[
    {
        "post_id": "nveytc",
        "author": "SDBeerGuy",
        "title": "I can't drive ANYWHERE without permission? OK, I'll follow that rule...Maliciously.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nveytc/i_cant_drive_anywhere_without_permission_ok_ill/",
        "score": 33751,
        "num_comments": 855,
        "created_utc": 1623187545.0,
        "selftext": "This happened when I was 16 years old and just got my drivers' License.  My parents had me run to the store to pick up some groceries.  I stopped by my friend's house on the way back home for maybe 5 minutes to show him I got my license and I was out driving alone.  It was a really fun moment in the life of a 16 year old.\n\nMy stepmom Mary Ann freaked out. \"We did not give you permission to drive to Bill's house!  We told you to go to the store and that is ALL!\"  I told Mary Ann and my dad that they had let me drive to Matt's house the day before, so I didn't think it was a big deal. \n\nThey went unreasonable and laid down the unbendable rule that set up the Malicious Compliance.  \"You are not allowed to drive anywhere we do not give explicit permission for you to drive.  Period, end of sentence.  Just because you were allowed to do it previously does not ever give you permission another time.  Ever.\"\n\nFast forward three days later.  My 13 year old stepsister has been a jerk to me all day, and I'm sick of her BS.  She goes quiet for about 30 minutes and then comes out all sticky sweet.  \"Hey Brian, it's time to take me to ballet.\"   \n\nI have taken her to ballet 3 days a week since I got my license.  It's basically one of my chores.  But I see my opportunity to say \"Screw you!\" to all three of them at once.  \"Sorry, Tina.  I'm not allowed to take you to ballet.  The parents didn't tell me to take you, and I don't want to get in trouble!\" \n\nShe screams, she cries, she begs, she threatens.  She calls her mom and leaves a message.  She calls my dad and leaves a message.  Just like Steve Miller says, \"Time keeps on slippin', into the future.\"  I'm not sure I'm brave enough to hang on to the bitter end and actually go through with it.  I'm shaking, but I know I've got them dead to rights.   No call back from the parents and the clock goes on past the start of her class.\n\nStepmom comes home and Tina runs to meet her.  \"Tina, what are you doing here?  You're supposed to be at ballet!\" \n\nI hear Tina tell her rendition of the story, leaving out how miserable she had been, and they go back and forth.  Mary Ann comes pounding down the hall and yells (as God is my witness) \"You just wait 'til your FATHER gets home!\"  I had to stifle a laugh because I never really believed people actually said that.\n\nAn hour later Dad comes home and the TWO of them go running out to meet him and tell him how horrible I was.  I wait in my room for the hammer to fall.  About 10 minutes later my dad calls down the hall, \"Brian, would you please come here and talk to us?\"\n\n\"Well, Brian, you did it.\"  \"What do you mean, Dad?\" \n\n \"You got us all, and there's absolutely nothing we can do about it. OK, let's make this reasonable for everyone. ..\"\n\nAnd they did.  They agreed that they were over-the-top.  They recognized that Tina isn't always very nice to me, and they spoke to her about that.  I was allowed to have reasonable freedom if I was driving somewhere, since I had good grades and had never been in trouble.  I walked down the hall back to my room, my back to my parents, with the world's biggest grin on my face.",
        "permalink": "/r/MaliciousCompliance/comments/nveytc/i_cant_drive_anywhere_without_permission_ok_ill/",
        "comments": [
            "I was kind of hoping the story was that they specifically told you to go to the store but didn’t specify that you were to come back home.  So you sat in the store parking lot for hours",
            "Oh, that's perfect. At least the dad recognized he fucked up.",
            "Wow. that was **not** the ending I was expecting as I started reading your story! I'm glad your dad and stepmother saw your (quite reasonable, I think) point of view. \n\n(Sounds like your dad had your back, too.)",
            "I told my kids that if they ever do something wrong\\break something that as long as they don't lie to me they would not be punished. Fast forward a few months and one of my kids broke a window, I was fuming, but she came to me and before I asked she said she broke the window and it was an accident. Fuck. So I thanked her for being honest sent her to her room to watch TV and had to eat my anger.",
            "Man, when my stepmother said \"just wait until your father gets home\" it never ended well for me. I'm glad he saw the real issue and understood what you were doing. That's some solid parenting there.",
            "Yes! Glad your dad recognized you got them good and instead of blowing up/being punitive, he realized they had been unreasonable and adapted. Good job on your dad.",
            "The battle in my house was over passengers. \n\nI could go out for a drive any time I liked, so long as I was home on time and that I wasn't driving around with people I hadn't told my parents about. She was strict about it, too; I once got grounded for driving my coworker home when her car wouldn't start. \n\nThen we had a power outage, and both my brother and I slept late. As I'm eating breakfast in an attempt to make myself late enough to miss all of first period I get an idea. My brother always took the bus to hang out with his friends (and being driven around by your embarrassing older brother is so not cool), so Mom didn't know I'd be driving him.\n\n>Me: Hey, Bro. You want to stay home today?\n\n>Bro: Sure, but Mom will kill me,\n\n>Me: Naw, she'll blame me. Just you wait.\n\nSo I call Mom's work. Voice mail, she's on another call. I ring my step-dad's, he's out and can't be reached.\n\nGreat! \n\n>Me: It's done, Bro. Go back to bed if you want, I gotta leave or I'll be late for second period. Just don't answer the phone. \n\nThat night at dinner was tense. Mom wanted to know why I didn't drive Bro in, though she framed it as \"I know you're not his keeper, but..\".\n\nI out and out admitted to telling him to go back to bed.\n\n>Mom: Why would you do that?!?!\n\n>Me: I couldn't reach you for permission to drive him, and he looked tired.\n\nThe look on her face was *scary*.\n\n>Mom: He's your brother. He's not some random person I don't know.\n\n>Me: You know all my friends and coworkers, and I can't drive them either.\n\nI was expecting to be told I was grounded, but instead she just sort of sputtered for a second before telling me we'd have to discuss this later.\n\nNever actually did, but she also never bitched at me for driving home coworkers or teammates again.",
            "Sounds like they laid down the law out of reactive fear for you (it’s scary when your kid becomes old enough to drive!), and your dad later understood that that wasn’t the way to do it. They should have figured all that out before you got your license. I think you handled it great and so did your dad.",
            "This is a weird world. I had older friends and family that literally drove me to work when I was 15 so I could save up and buy a car at 16. \n\nBought my 2 colored POS ford for $1200. Dad was pretty proud when he signed the title.\n\n rules. Or the car is gone.\n\n Answer when I call you, no excuses.\nKeep your grades up\nStay out of trouble.\nYou better keep a job (16yo and literally forced to work now or the car gets taken) bittersweet for sure. Grades definitely suffered bc the restaurant industry takes no prisoners.\nBe home by 8 every week night.\nGive my parent the insurance money every month. ( We're talking 2004 money here) I was added to the family plan and I had to pay the difference in from the old rate to the new rate. Which was alot. Im still salty about this 17 years later.\n\nI made 5.15 an hour. Car insurance was $200 month for full coverage. I worked my ass off. Even holding 2 jobs in the summer because of labor laws.. I lived 20 miles from work. I was pretty broke but I could afford insurance and gas and that was about it.\n\nDay I turned 18 the car was signed over to me. I dropped off the family insurance. Went straight to my own and straight to liability. Went from 200 a month to 50/mo. Got rear ended a month later and got a 1800 check from their ins. Sold the beater and banked the check. Put that down on my first motorcycle. Rest is history.\n\nAnd yes. I realized fast that first year i would have paid more in insurance than I bought the fooking beater for. And constantly moaned about this. I paid 200 a month for a 90HP 5speed rust box  while my sister paid 75 a month for full coverage in a slushbox dodge neon that would suck the paint off my car. She was 3 years older. I was pissed. Then my younger sis jumped on the fam plan and had nothing but praise about how cheap her insurance was.\n\nStill to this day I wonder if I was extorted by my parents or if Insurance companies literally HATE 16yos driving  rusty ford escort manuals.",
            "Malicious Compliance: Complete. Well done, OP.\n\nDad is also a hero here, as he recognized that OP did everything right and maliciously. Good on him.",
            "The secret villain of this tale is suburban planning. It’s crazy that one of the perks of being 16 is that you suddenly have the ability to purchase groceries. \n\nAnyone without access to a car in the typical North American suburb is stuck on an island without a boat, totally reliant on others for basic sustenance.\n\nWe can design suburbs way better! We don’t have to get rid of them. The main problem is massive parking lots spreading everything out. Reduce the parking need by adding light rail, zone some concentrated walkable shops and residences, and possibly avoid stepmom’s wrath when it’s time to visit a friend!",
            "Props to your dad for owning up to it.\n\nNot gonna lie, if my kid pulled something like this, i'd have been proud as hell, lmao.",
            "Good for you. My parents never would have admitted they were wrong; they simply would have added additional punishments.",
            "What a total dad. Great story.",
            "Reminds me of when I got in trouble with my mom for being out past legal curfew at my friend's 18th birthday party...with a bunch a nerds who didn't drink at all yet...less than a ten minute drive from home...less than two weeks before I turned 18 myself.",
            "Wow, props to your dad for recognizing the absurdity of the situation and correcting it in a reasonable way.",
            "I love how this story ended. You have a good father. He realized his mistake and I have to wonder if there was some pride in this. I bet he was thinking, “that’s my boy” lol. \nAnyway, good story. Thanks for posting.",
            "A good parent realizes when they fucked up. As a fellow Dad, I admire yours.",
            "I have to give your dad props for seeing the malicious compliance and recognizing what he and stepmom did wrong. \n\nGood for you. 😊",
            "I grew up in an abusive home, so I had similar \"rules\". \n\nLet's just say, consider yourself lucky you have a dad that was able to see his mistake and own up to it. My dad would have smacked me around, called me all sorts of names, and told me that \"obviously, I didn't mean this sort of situation, don't be a fucking idiot\"\n\nI'm so happy you did this and that your dad realized his mistake.",
            "As much as you were a smarty...\nProps to the parents for realizing their mistake",
            "100% this was your dads plan all along. His wife got upset and he had to back her. When that backfired it was a low key gloat “ok we tried it your way”. \n\nThis is my head cannon.",
            "am i missing something in the timeline? you just got your license, and told your friend about it. 3 days later this blowup happens...but you've been driving your sister to ballet 3 days a week since you got your license, as a regular chore?",
            "I don't understand. The story says Tina asks you to take her to the ballet 3 days after you got your license. But then you then say \"I have taken her to ballet 3 days a week since I got my license\". How were you taking her to class before getting your license? And why could you do that again?",
            "This is great - and reminds me of some of my own teenage MC. \n\nBackstory: I grew up in a rural suburb, so cars were pretty much the only way to get to any actual social gathering event (mall, movies, etc.) My parents didn’t like carting me around, so, I often was getting driven around with friends by their older siblings or by some of our older friends. No accidents, nothing. All was fine. \n\nBut, for some reason - at some point in late middle school, suddenly my parents came up with a rule that I wasn’t allowed to drive with anyone who “was new to having their license” until I had my learner’s permit. There was no definition for what “new” exactly meant. But, they did make it clear that it meant no longer being able to ride with older friends or friends’ older siblings (who again - were often tasked with driving us around) - even if they were in their 20s and people I had driven with for years! (That is - Unless I got permission from my parents first, which they rarely gave…) It was the MOST annoying rule. Especially since it seemed to come out of nowhere. And would change from day to day… (I have two older sisters who never had such a rule… and there was no catalyst for it\n- that I know of anyway.)\n\nI do get that they probably just wanted to keep me safe since teenage deaths from car accidents are kind of high where I grew up. But, they never explained it as such. Plus, I was actually a good kid who just wanted to hang out with friends - we had clean, not too thrilling fun. Not to mention, my parents still refused to drive me anywhere and my sisters were out of the house by then, so I was often stuck at home just because of this random rule. (It really did pretty much ruin my social life.) \n\nThen one day, I saw my next door neighbor/one of my best friends driving down the street. He was two years older than me and actually was a bit of a troublemaker. (He typically ran with a different crowd, but we had been friends since we were very little and stayed close despite having different friends groups.) \n\nWell, his parents refused to let him get his license, so I was surprised to see him driving. He pulled over when he saw me.\n\nMe: So, you got your license?!\n\nHim: No, but I know how to drive… so, here I am. Wanna ride?\n\nAnd - cue many many instances of MC til I got my temps. I wasn’t allowed to drive with anyone who was new to getting their license… But, my friend simply didn’t have one - so he didn’t fall in that criteria! I never told my parents that I rode with him, but if I ever got caught - I was ready with my flawless logic.",
            "And then will bitch and moan he never visits when he moves out.",
            "He finally realised that his son was a punching bag and it needed to stop.\n\nHooray!",
            "That’s awesome. Now try that at work with one of the Exectutives. Happened to me. My COO wanted to control my day so I had to check in at the headquarters to start my day to account for my start time. About a week later, my CEO needed me to come out to his cottage to fix their internet by 10am for an important meeting. Normally I would have started early and left from my house but because I was explicitly told that I must check in at 9:30, before going anywhere, I did exactly what I was told. \n\nGo my to work, checked in and told him that I now need to drive 2.5 hours to the CEO’s cottage for a 10 am meeting. Well 10:05 rolls around and the CEO calls me and asked where I was. I told him I was on my way but I had to check in with COO before I could leave. The CEO wasn’t impressed, put me on hold and 5 minutes later got back on the line and said get here when you can and get the internet fixed. \n\nWhen I returned, the COO pulled me into his office and rescinded his new rule for checking in. Found out the CEO had an unpleasant conversation about micromanaging and placing demands where they weren’t needed.",
            "Yo Mary Ann is a bitch",
            "I was hoping this was going to be about how you never put gas in your car because your parents never explicitly told you to drive to the gas station. So then your car dies while running one of their errands and you have to call them to come get you because it's not your fault they never said you could go to the gas station. Lol. Still a great story.",
            "[removed]",
            "This may be my favourite MC ever! I love the ones with a good ending.",
            "They don’t want their brand-new driver randomly going places without their knowledge? Idk man I’m 16 myself and find that fine.",
            "My little cousin is probably the sweetest and most honest person I know. Yet, for some reason, her parents low-jacked her car and set the most stringent rules for her I'd ever seen. Only allowed to drive to and from school, except with explicit permission. Had to give text updates every 30 minutes. Couldn't be more than 5 minutes late, otherwise would be grounded. Couldn't have any friends in the car *ever*. I sincerely don't understand why parents are so freaking protective of their children. If you can't even test the waters of freedom, how can be prepared for when you have it all thrown in your lap at once? A little trust goes a long way, and makes everyone happier in the long run.",
            "Beautiful! I'm so glad your dad not only had your back but also recognised that the original request was unreasonable. \n\n(The only thing missing from this story was sticking your tongue out to your stepsister. Hopefully there were other opportunities for this)",
            "I don't know your situation, but your dad recognized he was wrong. If possible, show them you are grateful for that and be explicit about it. This kind of stuff helps building better relationships.",
            ">\"You are not allowed to drive anywhere we do not give explicit   \npermission for you to drive.  Period, end of sentence.  Just because you  \n were allowed to do it previously does not ever give you permission   \nanother time.  Ever.\"\n\nMy kids (my own, not my stepchildren) give me flack because I will say \"period\" at the end of statements when I'm mad.  They've pointed to several memes and clips online and I've for the most part stopped doing it, unless it is for comedic effect.  \n\nWhen you create a \"rule\" like this, as a parent you are only setting stage for a war.  Battles will be won and lost on both sides, but this is flat out nuclear warfare.  My wife and I forbid our oldest from meeting up with boys we didn't approve of.  That ended well.  She sneaked her way out of the house one evening through her bedroom window and met up with a teenage boy of questionable moral and legal behavior.  She was \"smart\" enough to leave her iPhone in her bedroom, which then led to us (wife, her younger brother, and I) not being able to track her.  It wasn't until the mom got a hold of the daughter's friends that we figured out where she was.  Eventually the friends flipped on her, and told her she better get home.  \n\nBy that point I had already driven through town and saw no sign of her.  Her brother was crying that he would never see her again (he was 10) and I was fighting fear of having lost a child over how I would conduct myself when I saw her return.  She eventually returned, and walked into the house like I probably would have at that age - knowing fully well I was in trouble and no matter how I carried myself I was going to be punished so why not have a shit grin?\n\nThe wife and I have been infamously known locally as the parents who gave their child a flip phone as punishment after said child went online and started talking to strangers.  A flip phone doesn't prevent texting, or calling for that matter, those very same people she did on her iPhone.  And one could argue the low-tech punishment allowed her to escape more easily.  But we followed through, and it demonstrated to her that if we set a punishment, we are going to follow through with it.  This mattered very little in the end, because it wasn't a month after she had the flip phone for the better part of a year that she sneaked out of the house. \n\nThere is always a \"better\" way of addressing things.  Since she is our first, our daughter has been on the receiving end of our less than perfect judgment at times.  We have a rule now with our daughter that if she changes locations we have to be notified by text.  It's a cat and mouse game now where she conveniently turns off Find My on her iPhone or puts the device in battery saver mode and prevents her location from being shared in real-time.  She would honestly be allowed more freedom if she just kept us updated.  If someone were to ask us where our kid is at, we want to be able to confidentially say we know where she is.  That does not in turn mean we are policing the activity going on then - she could say she is doing one thing when the reality is another.",
            "Dad is kinda the MVP in this story for sorting this all out.",
            "[removed]",
            "[removed]",
            "Dad is the MVP here",
            "Very smart. Keep it up. You go far.",
            "Well done sir, well done",
            "I like how the dad realises that he fucked up. He wasn't even that mad, he just was like, \"Oh... oops.\"",
            "revenge is sweet. but maliciously compliant is sweeter.",
            "I like how you didn't even have to explain yourself to your dad; he knew what you had done, and why, and that you had them dead to rights.",
            "You lot seemed to really have grown up with soft parents. Had I done this, mine would have simply taken my car privileges away completely.",
            "I like good parenting - nothing wrong with admitting you made a mistake and rectifying it. Good dad! \n\nI was the opposite I had my own car and complete free reign, as a young 17 yo lad it was a great time but I do look back at the carnage I caused and wonder how I’m still alive!",
            "You have some good parents.  Cherish them.",
            "Love this and love the happy ending - I’m happy for you :D",
            "My parent's always said I was a legalistic little shit who remembered every rule they ever gave me verbatim.\n\nDon't fuck with kids with strong logical thinking and a good memory!",
            "Well handled.",
            "Good dad. Very nice ending",
            "This is like Al Bundy reliving his game winning touchdown from high school",
            "[removed]",
            "[As God as my witness](https://www.youtube.com/watch?v=LH0gcYgqOgM)",
            "[removed]",
            "[removed]",
            "I don’t like when the MC ends all wholesome. I like lots of yelling and swearing. Hurt feelings and burnt bridges. The whole enchilada.",
            "toxic family",
            "FUCK parents can act like this? Back n forth conversations??",
            "My parents would rather die in an oil fire. Rather than admit, they were wrong.",
            "I gotta admit, when I first read this I thought it said 'three YEARS later' and I thought the OP was a real arsehole.",
            "I wish I lived in your dimension where adults don't just double down on anger when a kid makes a point they disagree with... Maybe I would've turned out better.",
            "Count your blessings, a \"Gotcha!\" that ends up in actual change is 1/1million.",
            "I wasn't expecting that ending, I would have gotten the belt lmao",
            "Beautiful ending!",
            "Mary Ann is gonna make you fucking pay. You think this is over? This shit just starting my friend.",
            "Goddamn. I would've been in a grave and paved over with the car parked on top.",
            "Wholesome MC",
            "Man you got more than I ever got. You're a king",
            "Good story and well done!",
            "I had to be forced to get my license, I am the youngest and I knew it would turn me into a gopher.",
            "Your father is a legend.",
            "Is your dad usually that composed, because he seems to have taken that pretty well",
            "Fucking champ, I love how dad called it as it is too. Classic.",
            "This seems like a case of your dad being led to his behavior by your step-mom.\n\nYou should thank him for breaking out of that and de-escalating the situation - he absolutely took a risk and stuck his neck out on this one. Lots of parents would NOT have taken that path.",
            "Sounds like a cool dad honestly. I may disagree with his rules, but he recognized his mistake, calmed downed his wife into being reasonable (or agreeable idk it wasn't specified) and changed the rule to be more reasonable without a punishment.",
            "You got a good dad it seams from this story :)",
            "Sounds like you have a very good dad. Cherish him because a lot of us don't get that luxury.",
            "Ah... So very satisfying! I will also add that this is one of the most well written Malicious Compliance stories I've seen yet. Thank you so much for putting in the effort to use grammar, spelling, and all-around sizzling writing. I appreciate it greatly! \n\nAlso: kudos to you. You snapped their faces off. I'll see you in the barrister's ball.",
            "At 17, I got my license suspended for 90 days because I got caught riding a motorcycle without that particular endorsement. Terms of the suspension permitted me to drive to school and my job; the only places I really needed to drive. My cool mom conspired with me not to tell my dad. He would have been furious. He only found out years later after college. Had a good laugh, then.",
            "Your stepmom sounds like a wonderful lady",
            "'I've dropped my sister off at ballet but wasn't given permission to drive home. I'll have to wait here in the car park until I'm an adult'",
            "Thank god for your father.",
            "Good job, but holy shit is america weird...",
            "Good go on the dad, so many parents adjust rules and just use the \"I'm the adult\" card.",
            "You have a great Dad",
            "The kind of rare happy ending we want to see more often 😌",
            "Wow. Your dad is a champion",
            "Would not be surprised at all if mom exhibits narcissism tendencies. Sounds exactly like something my mom would have done.",
            "Went a little different than I'd expected.\n\nThought it would be \"go to the store and get `foo`\", so you do, and then hang out at the store until they eventually call to find out why you weren't home yet (because they didn't tell you to drive back again).\n\nIncidentally, I didn't get my license until I needed one to drive to college, because parents shared a single vehicle and I knew I'd only have access for running chores for them.",
            "Wow one of the rare parent stories on reddit where they actually come up with a reasonable solution in the end",
            "Best win ever lol",
            "Well done. I'm in awe.",
            "I can be your friend.",
            "Outstanding!",
            "&#x200B;\n\nyeah yeah, ya can't drive anywhere until they need you to do something. \n\nwell played.",
            "I thought he was going to wind up stranded out of gas somewhere since he wasn’t given permission to go to the gas station",
            "[deleted]",
            "This is the unicorn wholesome happy end MC that I needed today!",
            "I went to a store on the opposite side of our metropolitan area at your age so I could see my boyfriend at the store. My parents were SO mad. I shrugged, \"you didn't say which store to go to.\" My mom to my dad, \"I told you all of your smart ass-ness would come back to haunt us!.\"",
            "Why is it always the damn stepparent taking shit too far?",
            "My parents would call every 5 minutes, where are you? And if you didn't give an exact location you were immediately grounded. Kinda helped me learn directions lol. Mile marker 234, I just passed power line road. Im turning right at the old Taco Bell. It was always like that scene from White Chicks where his wife thinks hes two timing because he took 2 minutes more than google maps.\n\nSame kinda thing except malicious compliance only got you into trouble. I was told to come straight home after school and I arrived home with very little gas in the tank since honestly my hide would have been tanned had I stopped for Gas, I got grounded either way.\n\nThey kind of made compliance impossible you always follow your moms rules dad would say, that is until it conflicts with his. I was bringing my brothers home from grade school when I was asked to pick up some license tabs, my mother was appalled because it took an hour long lines. My father took my mother's side... 🙄 as always however if I'd dropped them off and gone back I'd still be in a lot of trouble for the extra gas usage and making a client wait for license tabs. \n\nThey always had planned routes for using the least amount of fuel. But when my brothers arrived you either got in trouble for wasting their time when they could have been watching TV by taking them along. Or you got into trouble because you took them home, 30 minutes out of town, and then went back into town to finish my parents errands. \n\nI never understood my parents complete reversal after my brothers were born. It led to some legendary teenage shouting matches where I'd literally scream at them for the consistent double standard and lead neighbors to think I was mentally unhinged. \n\nIt pretty much came down to, if my brothers considered the errands with me fun because they got to peruse toys at Walmart or if they were fed up for missing a TV show while at Walmart.",
            "I’m applauding this so hard. Good for you! I wish I had the guts to do this!",
            "Some starving journo found your post:\n\nhttps://www.boredpanda.com/teen-driver-cant-drive-without-parents-permission-malicious-compliance/",
            "Glad it worked out for you!",
            "[removed]",
            "If you’re gonna set boundaries, be prepared to have your child be literal and set them to a tee. And if you are a parent with narcissistic tendencies, be prepared for trauma as parents like those don’t like to admit when they’re wrong. Shame",
            "[removed]",
            ">\tIts basically one of my chores.\n\nThis undoes your whole argument, Dude. \n\nI mean, it is a really good get on your parents and sister, but by your own admission this was something you had permission to do as a chore.",
            "[deleted]",
            "I'm an insufferable teenager and I've been driving for just three years, but holy shit this whole thing is so bratty and whiny. Its completely reasonable that your parents wouldn't want you making unatthorized pitstops when you just got your license. Letting go is really hard on parents, and every second you're out of their sight driving alone for the first time must be terrifying.",
            "I gotta respect your parents because kids are idiots and kids who can drive are a special breed of idiot. You'll get it when you have kids. 50% of your job as a parent is to protect your kids from themselves.",
            "Sounds like your dad is an OK guy, seeing an error he made and then approaching it reasonably. Are you close with him?",
            "And then the whole family stood up and clapped.",
            "So wait you said you went to your friends house to show him your license but said that you had already just gone over there another day? Then you also said you'd been driving your sister to dance three days a week for a while now (which again comes back to why you went to your friends house) when this revenge happens only three days later? Seems like some major plot holes.",
            "My newly driving kid has the same rules your parents initially gave. The difference is, trying to \"catch me\" on technicalities will just get my kid grounded. Glad you found a balance that works though.",
            "Awesome story!",
            "The ending was kind of wholesome. Your dad was probably laughing to himself in private",
            "Your dad’s a reasonable guy!",
            "I can only imagine the dad telling them, “he’s out of line, but he’s right.”",
            "Well played! My parents wouldn’t let me drive at night…. Because…. I got my license during the day. \nI shit you not.",
            "Oh man, I was going to say that was a sick move on your part, but I’m glad I waited until the end! What a roller coaster. Parents can definitely be unreasonable, but I’m glad that they realized that they were.",
            "There is no way the end isn't fictional. I refuse to believe that there is a world where parents ever admit they were wrong.",
            "How do you get mad at a child for following your rules?  You’d have to be a total fucking  prick.  Your stepmom probably got talked off the ledge by your dad but in the end she was reasonable too.  Family growth I love it.",
            "You should thank God above that your dad is willing to admit when he fucked up lol. Good for him and good for you!",
            "Very frequent story with step mothers, got to have a dad with a spine or you fucked",
            "Hey man, I don’t want to talk out of class or anything but for reals, your stepmom sounds like a real b.",
            "As a step parent myself. She's a bitch. \n\nThere are two mistakes most step parents make. Overbearing to prove they are 'a parent'. Or trying to be the 'fun parent'. Both of these show an immaturity that can cause problems in the home. \n\nJust be an adult about things. As adulting will show a balance to life the child(ren) can aspire to.",
            "Love this!!  Good for dad!",
            "I hope you can appreciate that you have good parents.  They aren't perfect, nobody is.  But, they are smart enough to recognize they were beat, humble enough to admit it, and rational enough to make the situation better for everybody.  Fucking awesome.",
            "So, to summarize: parents impose driving rules on teenager with newly minted driver’s license, teenager acts out in return? \n\nWho was paying for the car and the insurance at the time of this “malicious compliance”? \n\nThis was one of the most immature posts I’ve read on this sub. Grow up OP.",
            "I so hope my kids will be like you and not like me. \n\nAt 16 i had motor driving licence (can't get car licence till 18). I came home: \"mom i bought a motorcycle\"\n\nAt 18 I came home: \"mom I bought a car\"",
            "Congrats! You now know your dad loves you more than his ball and chain.",
            "Looks oddly specific. You OK buddy?",
            "I kind of understand this parenting rule, so I’m gonna give them the benefit of the doubt if it’s purely to keep the child safe.",
            "mY pArEnTs ExPeCt Me To LiStEn AnD hElP oUt GoD i HaTe ThEm",
            "They were overreacting but you sounded like a terrible kid with little respect who still hasn’t learned much",
            "Sweet.",
            "I read the name Mary Ann and I knew shit was gonna go down.",
            "[removed]",
            "Dad has your back bro",
            "[Brian](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTK8vFhPgxFv5Zx4SLbjX5wW35HNylJ9jvaMA&usqp=CAU)",
            "Tina? What about Mary Ann???",
            "That is perfect malicious compliance! Dumb rule, followed to the letter and rule relaxed due to compliance.\n\nAlso props to dad for being a good sport.",
            "This is incredibly pleasant MC. You just made my day better with this!",
            "I worked at grocery store A when I was just starting to drive. We closed at 10 and the registers closed at 9:45. I wanted a drink so I went to grocery store B on my way home. Well my mom tracked all my bank activity and lost her mind when she found out I went to get a soda on the way home.\n\nEdit:bonus story I remembered. Once, on my way home from grocery store A, I just drove past my house. No where to be, I just wasn’t ready to go home quite yet, it was the holiday season and I was exhausted. Well I made it maybe a half mile down the road before I chickened out and went home. Well I should have chickened out before a half mile cause my phone rang as I pulled into the driveway. My mom tracked my phone and lost her mind seeing I went to the neighborhood down the road.",
            "This is awesome, and I can tell your father, while flawed, is a great human being regardless.",
            "fuck yeah bud. get you some!",
            "Bravo. Always nice to see someone get the short stick when they deserved it, speaking as an older brother that shits a bitch",
            "Noice. A happy ending",
            "What a perfect story.",
            "That’s awesome and I’m really glad to hear your parents were able to admit they over reacted and come to an agreement that suits all.",
            "Well played champ",
            "Wow, good dad.",
            "Well done, OP.",
            "I'm so glad that worked out for you.  \n\nAnd I have some similar stories.\n\nSo I'll also recommend therapy.\n\nIt took me too many years to realize how much parents and step-parents like that had fucked me up. \n\nBecause they weren't \"too bad.\"\n\nTake care, you're great!  💞",
            "Good parents will admit when they made a mistake.  It sounds like you have good parents",
            "I'm actually so freaking proud of you for this. This is excellent",
            "Look at that shit! Dads FTW!",
            "Hey, im happy your dad and stepmom were at least good enough parents to figure out you won lol",
            "Well played sir. Well played.",
            "I'm glad your dad is reasonable, and you played your cards right! I agree that being able to drive at 16 is right there in the top 10 proudest moments in our lives.",
            "Your dad the real MVP",
            "I would still refuse to drive the step sister if she is being rude to you. I would make it a condition of taking her anywhere. I would sit down with both parents and let them know it is unacceptable for her to expect you to do things for her if she does this. Tell them you reserve the right to deny her a lift if she is rude. Get them to let her know when you are all together so she knows you all support this. It is not an unreasonable request",
            "Maybe it’s because I’m an old man now but even if she was a brat for the previous 30 minutes, I don’t really like a story that involves “I made a little kid cry” especially when the punishment was more towards the parents than her.\n\nWhat exactly did she do leading up to this? Other than the most typical teen girl stuff?\n\n(Also she wanted to go to a dance class not like random shopping.)",
            "You were told to take her 3 times a week...you were given permission. Doubt it's a real story. Your parents probably took your car and laughed at you when catching the school bus. Lol",
            "LOL - at least they were adult enough to realise their mistake.",
            "Appreciate your Dad, he is reasonable.",
            "Smart ass teenager makes parents life difficult and bullies younger sister. Yup, checks out. Fucking kids are the worst.",
            "hahaha hell yeah man! Good work!",
            "Nice, unexpected, ending. \nWell done!",
            "USDA Choice MC!",
            "Hell yeah!! Good for you Brian!!",
            "Talk about a happy ending.  I did not expect that."
        ]
    },
    {
        "post_id": "ge83xe",
        "author": "Aanstekervloeistof",
        "title": "\"You're not to get involved in your mom's Facebookstuff\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ge83xe/youre_not_to_get_involved_in_your_moms/",
        "score": 33674,
        "num_comments": 1430,
        "created_utc": 1588719193.0,
        "selftext": "My dad's words years ago when I started a discussion with my mom over some dumb racist shit  she said on Facebook. Facebook brings out the worst in my mother who in real life used to be a lovely woman but over the years got lost in her echochamber of stupidity. I tried getting her out but \"I'm not to get involved in my mom's Facebookstuff.\"\n\nToday there was an illegal protest in my city. A protest organized on Facebook by the lowest of the low of our society. We have a group of about 100 delusionals in the country who're actually willing to get from behind their keyboards and disrupt public transport in my city any opportunity they can get in the name of 'the people.\n\nMy parents (not a part of the 100 but seem to be well on their way) went to todays protest, the protest was illegal, they were told to seperate and leave, they didn't, they got arrested. Haha. They didn't have any form of identification on them so they were not allowed to leave. \n\nMy dad called for the first time this afternoon asking me to go to their place, pick up the IDs and then the policestation. I asked if this was about the Facebookevent, he said yes, I said \"I better not get involved then\" hung up and ignored his next 17 calls.\n\nMy aunt appearantly went to pick them up later tonight and everyone's pissed at me saying I'm a traitor except for grandma, who called to say she misses me and I haven't been able to get the grin of my face.",
        "permalink": "/r/MaliciousCompliance/comments/ge83xe/youre_not_to_get_involved_in_your_moms/",
        "comments": [
            "Give your grandma a big hug next time you’re able to see her after the lockdown is over!",
            "It's a strange role reversal, when we're Young parents try to keep us from following the wrong crowd and when they're old we have to keep them from the wrong crowd.\n\nI guess the idle time *does* make for wicked ways.",
            "Hahahah granny is the fuckin GOAT. Shes with you because grandma's tell it like it is. Probably told them \"ya deserved it\"",
            "Their stupidity for not having any ID on them.  Hope they learned a lesson.",
            "Why would they not bring ID? Did they think that would help somehow? Like the cops detain you and then just shrug and give up when they don't have any?",
            "Lmao that's hilarious! At some point you will realize that you have very different world views from your parents. Keep doing what you're doing!",
            "Yeah... I feel that you should probably get used to the Idea of being the black sheep.  \nWhich will probably mean the UFO isn't gonna allow you on board...  \n\n\nKeep tight with grandma, everyone else can find their brain or keep out of your stuff...",
            ">\"I better not get involved then\" hung up and ignored his next 17 calls.\n\nI laughed so hard.",
            "Grandma is tired of her family's shit and you put a wide smile on her face today. Bless you.",
            "Hellz yeah. Grandmas love you no matter what",
            "When I was a kid it was always \"Don't believe what you read on the internet\" and \"The internet/Facebook is bad for you\".\n\nI ditched FB a year ago and its amazing, and being 'raised on the internet' (xbox live lobbies, youtube comments, reddit, twitter, etc.) has given me a solid BS detector. But now my parents are hooked in and spread all sorts of shit. What the hell?",
            "[deleted]",
            ">My dad called for the first time this afternoon asking me to go to their place, pick up the IDs and then the policestation. I asked if this was about the Facebookevent, he said yes, I said \"I better not get involved then\" hung up and ignored his next 17 calls.\n\nI wouldn't have said \"I better not get involved then.\" I would have said \"*you* told me not to get involved in my mom's facebook stuff\" and *then* hung up and ignored him.",
            "All these people whining about how OP is wrong because even thought their parents did something shitty and faced logical consequences, they are \"your paaaaarrrreeennnttttsssss.\"\n\nGuess what, OP's dad told OP to stay out of mom's toxic FB bullshit.  OP stayed out of mom's toxic FB bullshit.  It's the definition of being entitled when you tell someone to mind their own business then expect them to help you when you fuck up in the course of \"your\" business.\n\nCommon genetics does not mean you owe someone above and beyond tolerance of stupidity.",
            "I remember a time when my mother was a kind and thoughtful person. She still is, but now that all the kids are out of the house, she sits on facebook all day and shares a bunch of uber conservative catholic stuff. When my sister came out she had some really hateful stuff and now we have a big rift in our family. It really sucks. I feel your pain.",
            "I knew you were either Dutch or German because of your compound words. Then I saw your username. \n\nSo I take it this was that protest in Den Haag the other day?",
            "is it selfish to say I'm glad I'm not the only one who has a loved one putting up stupid things on facebook? It's not even that she put up crap it's that she puts up crap that contradicts the crap she's put there before. I love my birthmother but I hate seeing her post on facebook.",
            "Here in Holland we have a saying: \"who burns his ass, has to sit on the blisters.\" They got what they deserved for silencing you.",
            "I just called a friend on her FB post complaining about her new neighbor. She said something to the effect of how her new neighbor couldn’t speak English and how suspicious it was that they can afford to live in a house worth over $600k. So now she’s pissed of course because the truth hurts. She’s a little “redneck” for lack of a better term but so is some of my family. However, none of my family would ever make a stupid assumption as equating any language other than English to poverty and crime. What is the cure for ignorance? Staying silent hasn’t worked yet. Why don’t we try something different and call it out when we see it? Keep at it OP. One racist at a time.",
            "Bravo! Did a great job with that. Only thing I would say to them is \"play stupid games, win stupid prizes\"\n\n\nThey obviously don't know what the word traitor actually means. You didn't betray them. You maliciously complied to their wishes. Sounds like mom and dad aren't the only idiots in the family.",
            "I always say stupid should hurt, and this time it really hurt. First, telling you to avoid anything having to do with their \"Facebook stuff,\" then breaking quarantine to attend a large gathering during a pandemic to get arrested? Yeah, they were really dumb to reach out to you. I hope you're able to keep your distance from them for a good long while.\n\nAlso, you should consider posting this in r/entitledparents",
            "Having common sense and always keeping identification on you, especially during a protest with high chance of police intervention, seems like stuff parents should be capable of on their own.\nWell played.",
            "This has to be one of the best and perfect examples of “malicious compliance” ever.\n\nSide note, who goes to an event like this, where there’s a possibility of police being involved, and doesn’t bring their ID???",
            "You dont have 100 delusional. You have 102. If they're out there being idiots instead of adults they're definitely part of the problem. There may be worse ppl out there, the extra delusionals let's say, but your folks are most definitely among them regardless of their level of crazy at this time. \n\nI expect to see you posting over on r/insaneparents soon lol",
            "Your Grandma’s a cutie.",
            "did a double-take when i saw this, first paragraph had me suspecting you might be one of my brothers describing my mom. Alas, you are just another kindred spirit with some crazy-ass boomers for parents. sigh. keep looking for the good in them. take care\n\nsmall edit: i feel like my mom has radicalized over the past few years too; it’s like regularly screaming into the void of facebook somehow reinforces the behavior.",
            "How did our parents' generation get to all be so fucking dangerously stupid?",
            "[deleted]",
            "Grandma is the real hero here. While I admire the Malicious Compliance I think you may have missed an opportunity for change.",
            "Man if this doesn't hit home. Feels like my whole extended family (parents, aunts, uncles) all collectively lost their damn minds within the last 4-6 years.",
            "It's very clear that your grandma has lost hope for all of them except for you.",
            "your grandma sounds lovely . w.",
            "Ahhhh. \"Don't get involved in your mom's Facebook stuff (unless we get in trouble).\" I see. *Then* it's \"you'd better get involved!\"",
            "> Echo chamber of stupidity\n\nLOL. Will definitely be using this one in the future.",
            "My mother is going down the rabbit hole and I'm so frustrated trying to reason with her",
            "Most of the comments here are celebrating the verbal smackdown or laughing at your parents for being so stupid but man it's just really fucking sad to hear your mother described as someone who *used to be* such a lovely person.\n\nIt's easy to think of these people as though they're just dangerous morons who are beyond help but what OP is describing is the basically the loss of someone dear to him thanks to a cult of personality.",
            " Not sure if it’s been said, but you might want to have mom checked out by a dr. Changes in personality are signs of serious issues. Could be a reason behind them, or could just be nothing. Good luck with dealing with it either way.",
            "You and your grandma are both treasures and if you ever find yourself down under, you have a free meal on me.",
            "Well done, my parents are also Facebook idiots, although I haven’t spoken with them for 5 years so unlikely to get called upon to help now.",
            "What were they protesting against?",
            "It's always heartening when kids are better than their parents. We're getting better.",
            "Fuck your racist parents though. Get out as soon as humanly possible. Or use them until you can't tolerate it any more.",
            "Stupid game, stupid prizes. Just look at your parents like they're fucking idiots and ask them what the hell they expected. Tell them it sounds like they should have stayed home.",
            "Their generation said video games would destroy ours by making us all violent, antisocial, and stupid.\n\nNow we're dealing with Facebook making them violent, antisocial, and stupid.",
            "I'm old, and people ask me why I'm on reddit.\n\nWhy, to escape the generational echo chamber. And worse, the people on the lookout to lure lonely seniors into an extremist orgnization where they'll be surrounded by \"friends\" who reprogram them.\n\nI'm still working. But when I retire, reddit will be even more important as a reality check, where I can listen to the other generations.",
            "Grandmas letting you know if they kick you out you've got a bed there.",
            "I’ve been looking for this support group!",
            "Live with grandma and take care of her. Honestly, it’s better that way so when the time comes when grandma really needs help, people like Mom and Dad don’t try to use her. I thought my family was a happy family until my grandpa got dimensia and my grandma was on her own. She’s fine and well and my family still screw her over. Taking her things and such, and especially grandpas things too. I’m 18 and I’ve taken care of grandpa more than any of my aunts or uncles ever have.",
            "“everyone’s pissed at me saying I’m a traitor”\n\nLOL WHAT\n\nProps to your grandmother though, sounds awesome",
            "Rights are designed and applied for the good of ALL, not the good of ONE. No one has a right to endanger the life of another PERSON, period.",
            "If this were posted in /r/AmItheAsshole, you'd get a resonding NTA as well for this.",
            "Dude. This is probably my favorite post here of all time. Excellent story. Short. And incredibly malicious compliance. You complied perfectly with a huge amount of malice. Well done. 10/10.",
            "sorry for your experiences sir”",
            "Lmao",
            "Your grandma is the shit.",
            "I love your grandma 😭😭",
            "Your parents*are* part of the hundred.",
            "/r/prorevenge",
            "You from the Netherlands?\nDelightfully maliciously compliant!",
            "Your grandma is epic,I love her already,and you my friend played that very well 😁\nAs the parent of a diabolical sod,I sincerely hope if I ever do anything that dumb,she treats me with the same respect you showed your parents!",
            "He said not to get involved. You also disagree with what they're doing, and you know it's illegal. Your family can be pissed all they want, you know you did the right thing.",
            "Should have gone down there, bailed em out, have em sit in the back of the car while you give them a lecture on the way home.",
            "I've been told not to post certain things because it upsets family members and their friends who see it. So I deleted them and now they can't see anything",
            "Well well well, how the turn tables...",
            "Their brains have degraded to that of a 14 year old as science says happens and you are the adult now. You did a good thing, hopefully they learned their lesson. Next time you should ground them and turn the filters on their tv to disable fox news.",
            "It felt so eerie reading this because we must share the same mom. It’s unreal how she’s gone from normal/lovely to a hateful emboldened racist who drank the kool-aid. She doesn’t believe anyone or anything unless it comes from Fox or Facebook. She even told me once those are the only accurate sources of news anyone can trust these days! I could go on forever, but I just popped on to say that you did the right thing. Hang in there.",
            "Grandma the real MVP here, bless her",
            "At least your grandma still loves you",
            "I like you, and I am happy to see people like you being part of the future of America, that gives foreign people a bit hope that there are still some balls in your country.",
            "I wish I had such big balls and just hang up on my parents like that, but I also like living",
            "That's brilliant, also you are so German with the compound words.",
            "Good on you man! They should not to go out in this!",
            "You're hardly a traitor for making the mature decision to not encourage their illegal acts. You're being a good citizen for not allowing the law to be bent in your presence.",
            "If your mum says racist stuff she is not a lovely person in real life, she is a racist.\n\nSorry.",
            "Dang go spend some time with grandma ya scrub (unless shes like across the country if which case you do you)",
            "I'd sacrifice a small animal to feel the amount of smug satisfaction you must be experiencing now. Bravo",
            "I’m soooo glad my parents aren’t on FB.",
            ">Facebookstuff  \n>  \n>policestation  \n>  \n>Facebookevent \n\nDo you happen to be German?",
            "Your grandma sounds like my grandma - love the petty revenge haha",
            "L E G E N D",
            "Your grandma is the real one",
            "You are fantastic and you deserve dessert. 😊",
            "Bruh, your parents are like children. You gotta educate them on what's right and wrong. If they say things, \"because I'm your parent, you have to listen to me\", they're setting you up for a world of illogical excuses and subservience. If you love your parents, you might wanna help them out of this reckless behavior because frankly, it could get them hurt one day.",
            "I don't blame you. I wouldn't be caught dead trying to bail out my parents if they were dumb enough to pull some shit like this. Growing up, I was always told that my reputation is part of the family's reputation, and I dare not sully it.",
            "It's time to have one last serious talk with them about Facebook. You owe it to yourself and to them to try and make a connection to how it's hurting them and your family. Don't yell at them, but lay out the facts.",
            "Sorry about your ex-parents.",
            "I'm American, and I'm extremely confused and concerned with the idea of an illegal protest",
            "Time to call and visit (when possible) grandma more! Good for you! I know the fallout from this will be steep, but DAMN did they deserve this! Enjoy the award!",
            "Wonderful. Well done.",
            "Easy one for me. Were the shoe on the other foot would your Dad bring your ID to get you out? Sounds to me like you believe he would not.",
            "You're amazing and I love you!",
            "You're right, that's nothing on the table?",
            "Looks like.both your grandma and I are proud of you op.",
            "If you can, you should drive to your grandma's and visit her through a window or something.",
            "Granny got spunk. Go Granny!",
            "Nice! Any updates? Have you spoken with either of your parents since the incident?",
            "Good on you, they’re probably infected now too. Better isolate yourself lol",
            "The most malicious of compliance. I love it.",
            "Sweet.",
            "Haha. Bravo!",
            "Was it the one in the Hague (the Netherlands) by any chance?",
            "[removed]",
            "I always find it funny how narcissist parents make rules that don't apply to themselves.  Good job OP.",
            "So well done! I assume they were protesting being kept safe, right? Because for some reason, they are special snowflakes who can’t deal with social distancing or applying for unemployment.",
            "I'm so proud of you.",
            "Grandma has her priorities straight.",
            "good ol grandma.",
            "You sir are a legend",
            "Beautiful. I would not help anyone out who was a part of that no matter how close I was to them.",
            "Lmfao. Any relatives who are mad just tell the truth \"dad said I am not allowed to interfere with his Facebook events. I thought it was a test of my loyalty when he asked for help with his Facebook event!\"",
            "You did good, OP.  Real good.  I'd do the same even though I'm 49 and my parents are in their '70's.  If their gonna put that dog in the fight, then they can pay the price.",
            "Grandma #1",
            "Reminds me of my mom. After joining FB she went from being pretty liberal to hating Mexicans, immigrants (even though she is literally an immigrant herself), Asians, and so many more. She believes everything she reads from her idiot friends. That's not how I was raised. I deleted FB years ago because it was too racist, sexist, and all the other -ists. I wish my mom would as well.",
            "You’re the best I love it",
            "There are so many bad things about the weird racist and fascist and just shockingly stupid reactionary movements in America right now.  The ones that are really sad are where families are torn apart because some members are vulnerable to this Right-wingnut form of psychological manipulation.",
            "play stupid games, win stupid prizes\n\n- Ghandi (probably)",
            "Good for you.  I would have done the same damn thing.  Unfortunately, cult members don't usually learn from their mistakes.",
            "A traitor for looking out for the people they were being racist against or not sticking up for your racist mom(dad?)?",
            "What do they mean by “traitor”?  Do they mean this in some kind of patriotic sense? That you didn’t support their political beliefs? Or are they saying that you’re a traitor to your parents for not helping them out?",
            "Hey man, I feel like we're similar people with very similar families. Fuck them. Love you.",
            "This just shows how much social media and poor public education brainwashes people.... I feel sad for OP."
        ]
    },
    {
        "post_id": "a4o5ae",
        "author": "im_thatoneguy",
        "title": "Uber drivers can't file class action lawsuits so 12,500 drivers filed individually for 3rd party arbitration",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a4o5ae/uber_drivers_cant_file_class_action_lawsuits_so/",
        "score": 33364,
        "num_comments": 857,
        "created_utc": 1544385632.0,
        "selftext": "**Uber**: You may not sue us in a court of law, you must take all complaints to third party arbitration.   \n**12,500 Drivers**: Hold my beer.\n\nA class action lawsuit would mean that Uber only needed to deal with one plaintiff.   But by filing 12,500 individual requests for arbitration Uber has to hire and pay for tens of thousands of arbitrators to deal with each complaint individually.\n\n[https://gizmodo.com/ubers-arbitration-policy-comes-back-to-bite-it-in-the-a-1830892372](https://gizmodo.com/ubers-arbitration-policy-comes-back-to-bite-it-in-the-a-1830892372)",
        "permalink": "/r/MaliciousCompliance/comments/a4o5ae/uber_drivers_cant_file_class_action_lawsuits_so/",
        "comments": [
            "If this is the necessary spark to dump the forced-arbitration clauses, I'm all for it.",
            "I love it when the little guy is able to use the system that was designed to flatten him to instead help him.",
            "I wouldn't be surprised if they find a way of suing based upon the fact that their arbitration agreement isn't being fulfilled in a timely manner. ",
            "12,500 drivers: \"hold my beer\".  I think I've ridden with them a few times....",
            "TL;DR: Uber messed up, tried to screw workers by not calling them workers, now has 18.7m in legal fees to pay so that they can be taken to court as they required each driver to file an individual complaint through an arbitrator by putting arbitration clauses in their contract that prevents class action lawsuits.",
            ">\t“Of those 12,501 demands, in only 296 has Uber paid the initiating filing fees necessary for an arbitration to commence [...] only 47 have appointed arbitrators, and [...] in only six instances has Uber paid the retainer fee of the arbitrator to allow the arbitration to move forward.”\n\nSo it hasn't cost them much, yet. Hopefully more drivers go forward with their cases. ",
            "So.... what is the actual complaint of these 12,501 drivers? I'm especially interested because I'm currently in the process of applying for Lyft.",
            "arbitration isn't a lawsuit, it's done out of the court system.  uber apparently isn't paying the arbitration fees, which means the drivers will need to file a lawsuit in a court.  this means Uber can request to the court that the cases be consolidated. Uber probably didn't hire some flunkies as their lawyers, they know what they're doing.",
            "I'm stunned that arbitration clauses are legally binding...",
            "Here in Canada our judge just told the class action that they have to take their lawsuit to the Netherlands.\n\nThen why the hell are they allowed to operate in our country?",
            "I’ve seen JAMS arbitrators charge upwards of $800 an hour. They’re no joke. They are all retired federal judges I believe so it will be hard to get the numbers they need. It was a brilliant strategy. ",
            ">Of those 12,501 demands, in only 296 has Uber paid the initiating filing fees necessary for an arbitration to commence [...] only 47 have appointed arbitrators, and [...] in only six instances has Uber paid the retainer fee of the arbitrator to allow the arbitration to move forward.\n\nWait, what? What kind of a system is it if a company can stop an arbitration against itself by simply not paying a fee? Is there any penalty to Uber for doing this?",
            "I work in employment law for defense.  We've known arbitration clauses would be an absolute nightmare for employers for years and I've worked on a few cases similar to this one where the Plaintiffs came back and filed thousands of indidvidual claims.  This whole system is dumb and to be quite honest I'm glad that it's happening because I've always thought Class Action Waivers and Forced Arbitration Clauses are kind of stupid.  Honestly though, I feel like arbitrating a class action would be faster than taking it to Court.  I've always wished these things could be handled in entirety by a truly neutral third party.",
            "I wonder how 12,500 drivers got together and did the filings.   This needs to happen for Lyft, Amazon, and any other \"gig\" company doing their \"arbitration\" nonsense.\n\n&#x200B;\n\n&#x200B;",
            "[deleted]",
            "In case anyone is wondering what the drivers are seeking to arbitrate for. mainly for claims Uber misclassified them as \"independent contractors\" instead of employees.\n\n&#x200B;\n\n>\\>Beginning on August 18, 2018, Petitioners began filing their individual arbitration demands against Uber. Petitioners seek to arbitrate their individual claims against Uber for misclassifying Petitioners as independent contractors. Among their causes of action, Petitioners’ asserts claims for violation of the Fair Labor Standards Act, 29 U.S.C. §§ 206, 207.\n\n&#x200B;",
            "This probably isn’t great news for Uber since they plan on going public very soon. \n\n[They’ve started the ipo process. ](https://www.msn.com/en-in/news/other/uber-said-to-file-for-ipo/ar-BBQGPjB) \n\nLyft is also going public.",
            "Can someone ELI5 about what's going on?",
            "If it costs $5,000 each to litigate each one, we are looking at $62,500,000 as a base cost. Good Jahb! \n\nClass action might have been cheaper.",
            "Eli5 plz?",
            "Need a Uber service for lawyers. Call it Luber",
            "If this isn't malicious compliance, I don't know what is.",
            "As a side note, more and more judges are starting to say that anything buried in a mile long TOS cannot be legally binding as there is no longer \"an assumption that the contract was read and agreed upon\".\n\nJust because its in a TOS does NOT mean you are screwed, just shop around for a judge that will hear the case anyway.",
            "Not to be a debbie, but the Roberts court has a very bad record with supporting employee complaint cases. They might overturn any penalty CA awards them in favor of a lengthy period for Uber to engage in arbitration.",
            "Third party arbitration is such bullshit.  The fact that it's Uber that HIRES THE ARBITRATORS should make it obvious what side arbitrators will most likely side with.  I like the fact that it's going to cost them money but in the end they'll win.",
            "I dislike the perceived corruption within the arbitration system. If you were the CEO of Uber and JAMS kept ruling in favor of the drivers, wouldn't you fire JAMS and hire another arbitration company?",
            "lmao get rekt, Uber. Seriously, I hate them. Also, forced-arbitration clauses, 9 out of 10 times, are illegal and cannot be upheld in a court of law anyway.",
            "What I dont get is, after a class action lawsuit is successful, can't everyone who didn't participate sue for the same thing and automatically win because of case law? Isn't that why class action lawsuits are supposed to be scary? \"Yeah guys, I also got a nylon baybesda bag but I wasn't part of the of the class action, but it's illegal and i wanna sue for a thousand bucks. And I win, the courts already ruled this is illegal, right?\"",
            "Why do they want to sue?",
            "I've never understood how the law requires a business to do a thing but the business can simply force you to agree to ignore the law in order to do business and be employed.\n\n\"It's illegal for us to force you to take this psychological exam before applying for the job, so we won't force you. We will however not look at your application if you don't.\"   \nHow the *fuck* is that *any* different???\n\nHow is that not in direct violation of said laws?",
            "Uber should take better care of it's workforce.",
            "Arbitration is a wildly rigged system. If I’m an employee who wants to go to arbitration and 9.9/10 times the arbitrator is someone who has been hired by the company I’m trying to get something from. If said arbitrator rules in my favor they run the risk of not being hired again for future arbitrations so it behooves the arbitrator to rule against me because they want repeat business. Basically it’s 100% useless to arbitrate if you’re an individual going up against a multi-national company. ",
            "Ubers either gonna be playing REALLY nice with their drivers from now on or they're about to get nuked from orbit.\n\n&#x200B;\n\nMath time:\n\n12,501 drivers x 1500$ retainer fee for the arbitrator = 18,751,500$ USD\n\nThats just the cost of getting the arbitrators. That doesnt include their hourly rates, which are gonna be much, much higher. That, my friends, is what is called \"pants-shitting terror.\"",
            "all these companies that rely on their workforce to supply the car/maintenance/gas and have to bare the burden of being their own business for basically min wage, are complete fucking garbage. uber is the most successful but as soon as you try and have food delivered through grubhub or something you realize there is a lack of drivers cause no one wants to put up with that shit. they are always desperately looking for drivers to work these shit jobs.",
            "Uber: I have made a terrible mistake",
            "Yeah, Uber doesn't think things through that well. ",
            "Oh my god I'm laughing so hard that tears are rolling down my face! Suck the big fat one, Uber!",
            "It's pretty fucked up they're not allowed to do a class action suit, how is that legal?",
            "Can anyone give me a TL;DR: About why uber drivers are so upset?    \n\nI mean, As-is they already get to skirt most of the laws and BS red tape that taxis are required to dance through. \n\nThe uber kids should try to set up a legitimate taxi service. It is a hellscape of bureaucracy red tape and government gatekeeping. ",
            "Uber just got scientologied...",
            "how is it legal to put \"you may not sue us\" in a contract?",
            "[deleted]",
            "Fuck yes! And fuck forced arbitration. I keep saying that forced arbitration is a major social injustice but nobody fucking cares. Glad to see someone was able to finally use it against the corporations who take advantage of this shady legal tactic.",
            "This rules. Fuck Uber.",
            "Smart move, bargaining as a group works pretty well. ",
            "[deleted]",
            "Uber has been a shitty company from day 1.  They define corporate evil. Don't use them anytime, I don't understand why everyone still does.  Lyft is available basically all the same places now and although they aren't perfect they definitely aren't total assholes.",
            "Fuber",
            "This is hilarious.  Can anyone chime in and tell me roughly how much this will cost Uber?",
            "The only problem with this is that they've only paid for 8 cases to move forward. They just aren't paying to set up the arbitration appointments.",
            "And if they lose, do they end up paying the arbitration fees and the lawyer fees for Uber?",
            "...and they're already bleeding money or gushing is a better word...",
            "Uber needs to be burnt down and hopefully companies like Lyft learn from their mistreatment of drivers",
            "\"12500 *drivers*: Hold my beer\"\nI sure don't fucking hope that they have beer to hold...",
            "Uh, if you don't mind, may I have a backstory?\n\n*I don't understand why they felt the need to file a lawsuit, as I don't know what happened.*",
            "How many states have laws that require the company to foot the cost of arbitration?  Because in states that don't have such laws, I can see this incident resulting in companies rewriting their arbitration clauses so that the full cost of arbitration is paid-for by the employee.\n",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/alltheleft] [Uber drivers can't file class action lawsuits so 12,500 drivers filed individually for 3rd party arbitration](https://www.reddit.com/r/alltheleft/comments/a4s1dp/uber_drivers_cant_file_class_action_lawsuits_so/)\n\n- [/r/epicsystems] [10000 Single Arbitrators](https://www.reddit.com/r/epicsystems/comments/a4qqtd/10000_single_arbitrators/)\n\n- [/r/latestagecapitalism] [Is this a joke?](https://www.reddit.com/r/LateStageCapitalism/comments/a4pnf5/is_this_a_joke/)\n\n- [/r/leopardsatemyface] [12,500 leopards to be exact](https://www.reddit.com/r/LeopardsAteMyFace/comments/a4scix/12500_leopards_to_be_exact/)\n\n- [/r/lostgeneration] [Uber drivers can't file class action lawsuits so 12,500 drivers filed individually for 3rd party arbitration](https://www.reddit.com/r/lostgeneration/comments/a4s8mg/uber_drivers_cant_file_class_action_lawsuits_so/)\n\n- [/r/uberdrivers] [How many more of us are willing to join?](https://www.reddit.com/r/uberdrivers/comments/a9dur1/how_many_more_of_us_are_willing_to_join/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Holdup is there any legality to putting a clause in a contract then prevents a class action lawsuit from taking place? Like what ramifications are there to just filing the suit anyways",
            "Uber sounds like shit. Our new bartender at work said she's had people piss and vomit in her car and they don't care. She was given $100 to cover cleaning costs the first time and never again. She quit when she was robbed at knife point and they basically told her to fuck off.",
            "The reason company's have arbitration clauses is because there are no public records of the cases. If tried in court all of the court documents (possibly including financial and internal business documents) would be public. \n\nFor large businesses it's better to shell out for many many arbitrators than to have company statements open to the public. ",
            "This is why Bethesda is in trouble. Same scenario looming.",
            "To this day I don't get why people sign up for serious stuff without reading the contracts.\n\nConsidering that a lot of people drive for Uber as a side job, can start or stop working whenever they want, don't have fixed hours and don't use company property or infrastructure aside from the app, they're much more independent contractors than employees. Freelancers at most. They're not bound to Uber, and I don't get why drivers want employee benefits - not to mention the rides are barely sustainable from an economical standpoint, Uber would either crash and burn with all the expenses of raise the rates significantly without proportionally raising payouts.",
            "Sounds like the same lawyers that work for uber work for bethesda. ",
            "r/MaliciousCompliance",
            "Forced arbitration is an affront to the legal system....",
            "Don't you just love all the freedom you get in a capitalistic economy?",
            "I did 2 trips for Uber and hated very minute of it. I can't wait to see this company (and Lyft) crash and burn. There is a reason taxis are expensive. Uber charges less than taxis and proceeds to skim 20% off the top \n\nDriving 50 miles and spending 2 hours on the road to make a measly $20 is beyond insulting. ",
            "So why did they put in the terms of service that they would pay both parties legal fees?",
            "Doot",
            "Uber got finessed big time",
            "Iirc the AAA charges $4k filing fee to Uber for each case. Lol. ",
            "Why do people still use Uber? And why do drivers still work for Uber?\n\nSwitch to Lyft.",
            "What a stupid loophole. Nearly $19mm gone just over filing fees.",
            "Are these people all taking Uber to court for the âme reason, or do they all have different reasons?\n\nIs there something I don't know about here? ",
            "I doubt those 12,500 drivers have the cash to outlast Uber in court",
            "This isn't malicious.",
            "Bwahaha! ",
            "The article also briefly mentions that Uber is losing money. How does that come?",
            "bazinga",
            "pardon my ignorance but what is arbitration?",
            "Right before the IPO. Beautiful!",
            "Assuming that they ever deal with it. ",
            "Uber didn't really think things through, did they? Lol",
            "How can people have to follow bullshit rules that are unlawful even if they sign an agreement? ",
            "\"Uber is a private company!!! It can do whatever it wants!\" - t. reddit logic",
            "What are they arbitrating for? So wine else mentioned uber not calling it's workers workers, why is that bad? ",
            "I have read the article and I have no idea what is going on. What is arbitration? Are they suing in a roundabout way? Why? Can someone please ELI5?",
            "Where can I read more about this?",
            "How can I get in on this? I try contacting many different law firms in NYC and they all told me they do not fight cases against Uber and co like them",
            "They will go back on there work than and allow mass trials? Just curious what they do next, clearly they cant afford all those individually right?",
            "> tens of thousands\n\nHow many tens of thousands? 2? 3?",
            "As someone who hadn't used Uber in like 5 years (due to getting a car), and has been recently forced to use them again- I will never use uber again after I get ym car back. The prices are rapey! 7 miles, $15 and not in an area where there is traffic. ",
            "This will make them go bankrupt. Not really a smart move.",
            "Need to make flyers with information about this and how to join to hand out to drivers at airport FIFO parking lots everywhere.",
            "nice",
            "that is OUSTANDING. Have an upvote."
        ]
    },
    {
        "post_id": "nxuxjy",
        "author": "Weasel_Cannon",
        "title": "You want an omelette with nothing inside? Okay",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nxuxjy/you_want_an_omelette_with_nothing_inside_okay/",
        "score": 33357,
        "num_comments": 2182,
        "created_utc": 1623459832.0,
        "selftext": "So my first job was a server at a very popular 24 hour breakfast diner/chain. We had lots of colorful customers. One morning, I’m serving a woman sitting by herself. I ask her what I can get her, and she says she’d like an omelette. We have a list of pre-built omelettes, or you can build your own, so I ask her how she’d like her omelette. “Just a regular omelette, please” she tells me. \n\n“Okay, so you don’t want one of the signature omelettes, what would you like inside of yours?” I ask\n\n“Nothing, just a regular omelette.” She replies with a huff \n\nI pause for a second because this order does occur, but not often. Some people like their eggs scrambled and cooked, then rolled up. “So you’d like an omelette with nothing inside?” \n\n“YES! A plain omelette!” She snaps, now irritated that I’ve questioned her several times. \n\nSo I enter the order, a 5-egg omelette with no fillings and no toppings. A few minutes later it comes out, and she is appalled. “What is THIS?!” \n\nYour plain omelette, I reply...\n\n“But where is the cheese, or the ham or the onions?!”. She is irate. \n\n“Ma’am, you ordered an omelette with nothing inside...” \n\nShe gets cocky and says “An omelette is eggs rolled up with ham, cheese, and onions! Everything else is extra! You should know this, working at a breakfast place!”\n\nI look at her deadpan and inform her “actually, ma’am, omelette is French for scrambled eggs that are fried and rolled or folded; everything else is extra”\n\nI’m busy so I walk off and help other colorful customers, meanwhile she flags down a manager to complain, who confirms what I told her and points out that in the menu there is, very specifically, a ham cheese and onion omelette  with a large picture in the middle of the page. Then tells her she has to re-order her meal and wait a second time. \n\nShe didn’t leave a tip.",
        "permalink": "/r/MaliciousCompliance/comments/nxuxjy/you_want_an_omelette_with_nothing_inside_okay/",
        "comments": [
            "If it's any comfort, she probably wouldn't have left a tip anyway.",
            "Reminds me of my ex-MIL. She used the word \"regular\" to mean what she wanted. At a fast food restaurant if she was asked if she wanted a small, medium, or large size drink, her answer was \"regular\" (not one of the choices she was given). If her husband ordered a steak at a restaurant she would get mad at him and tell him that he's supposed to order something \"regular.\" I feel like the word \"regular\" is sometimes used to mean \"what I am thinking of\" or \"what I am used to\" or \"what I believe to be average\". We cannot read your minds and what is \"regular\" to you may not be \"regular\" to the person you are talking to! \"Regular\" is a vague term and should not be used when you have something precise in mind.",
            "I’m glad the manager didn’t just bow to her demands.",
            "This has a none pizza with left beef energy about it!",
            "Kudos to you for understanding the “plain” order.  \n\nSo many times I order something “plain” and it comes with the stuff I didn’t want.",
            "I worked as a cook, one time an order came in for a goat cheese and sun dried tomato **frittata** “NO EGGS - Allergy”.  The chef told a food runner to go get the waiter. The waiter came in and the chef told him we couldn’t make the order, the waiter *argued* (condescendingly) that we could make it “It’s simple, just put everything else but the eggs in a pan and cook it.” the chef was just shaking his head, the server added “Do I need to go back there and make it?”. The chef explained it would basically be some melted goat cheese with some herbs and veggies and he *would not* put that on a plate and send it out. The chef walked over to the front of house manager and told them to ask the customer to order something else, something that made sense, or at least confirm that they really wanted a plate of melted goat cheese with herbs and veggies for $25. The customer chose something else. The manager told the server that they were expected to know the menu well enough to explain that type of issue to a customer before putting an order like that in.",
            "At least it wasn’t an eggless omelette. \n\nhttps://youtu.be/9Ah4tW-k8Ao",
            "You see, folks? This is why you *read the fucking menu*.",
            "I once did something similar but less rude while getting breakfast at McDonald's... Ordered a sausage egg and cheese McMuffin, the lady taking my order asks \"how would you like that?\" and I'm immediately confused. This McDonald's cooks the sausages patties to different donesses? Wild. So I reply \"well done, please\" just to be safe, cuz you never know it is a McDonald's after all. Now she's looking at me confused. \"Like, do you want that in a meal or by itself?\"... That's when it hit me how stupid I was being. Managed to laugh it off but it was on a business trip and a coworker was with me, now it's a story that comes up while drinking.",
            "Oh man, I'm channeling Grosse Pointe Blank now:\n\n\"What do you want in your omelette, sir?\"\n\n\"Nothing in the omelette, nothing at all.\"\n\n\"Well, that's not technically an omelette.\"\n\n\"Look, I don't want to get into a semantic argument, I just want the protein.\"",
            "I used to wait tables at a breakfast place and once had a lady freak out that her eggs were runny. She'd ordered them sunny side up....",
            "You mean you’re not a mind reader? Shocking.",
            "Yep, happens all the time. \n\nI work BOH, and had the following...\n\nBeet salad, no beets...\n\nHerb salad and then ask \"what's all the green stuff?\"\n\nAntipasti salad, no lettuce...\n\nVegan hot wings.... Yes they exist now, they didn't back then.\n\nGluten free prime rib...\n\nA garden salad no meat, customer is vegan, heavy ranch. Customer claimed ranch is vegan...\n\nCustomer who claimed they were allergic to fish ordered a Ceasar Salad, didn't believe there were anchovies in the dressing....\n\nSteak.....FML, learn what the difference is between rare, medium rare, medium, medium well and well done PLEASE!\n\nGluten free pasta before there was gluten free pasta...\n\n\"No mushrooms, I don't eat fungus, but extra gorgonzola please\"...",
            "Stupid people should have to wear signs.",
            "If you are anywhere and the waitstaff is confused by your order, odds are you're the one who is wrong. They have probably taken that order thousands of times and heard hundreds of variations.",
            "I had some idiot send back the “extra rare” steak (blue steak) 3 times because it was bloody/red inside. Eventually I cooked it medium well and he said “finally you got it right”. Or the lady who ordered a Caesar salad every week with “dressing on the side”, complained every time about the Parmesan going to the bottom. On my last week working there, it wasn’t too busy, so I took off my apron and sat down in front of her family and explained gravity to them, no tip, but worth it.",
            "Plain omelet is what I have when I want scrambled eggs but accidentally overheat the pan",
            "Next time >> listen<< and >> think<<, lady.",
            "If it had peppers it would be a Western Omelette.",
            "Sounds like she wanted it as empty and scrambled as her head.",
            "Have a similar story: we used to have a \"mini\" spaghetti for people who aren't big eaters, and a regular portion. But since we noticed some people not having enough with the regular portion, they introduced a \"large\" portion. \n\nGuy walks in and asks for a spaghetti. So I ask \"the regular one?\n\nHe says \"yes, the large one\"\n\nI go \"you mean the regular one, or the new large size?\"\n\nHe looks at me a bit angry and goes \"just give me the regular large one!\"\n\nI say \"sir, you are giving me two sizes. Look...\" and I show him in the menu where it says \"large\" and explain to him that it's a recent change.\n\nHe goes \"I have been eating my spaghetti here for years and never had this problem!\"\n\n\"Sir, I'm only trying to make sure that what you think you're ordering is the same as what you're getting on your table because if it's not right, neither you or me will be happy\"\n\nIn the end I gave him the regular one, since that's what he (probably) wanted. But damnit people can be dense when all you're trying to do is help them.",
            "OP, feel no need to answer, but this was 100% a Waffle House right?",
            "LoL. Also how do you eat a 5 egg omelette?\nI struggle with 2",
            "Omelette isn't French for scrambled eggs. Scrambled eggs is Œufs brouillés.",
            "Do these people go to one restaurant their entire lives and then one day 20 years later wake up and decide to try a second restaurant",
            "When I worked on an offshore oil rig, one of the breakfast chefs hated when people ordered omelette as he had to make fresh, when all the other cooked breakfast items were ready on the hotplate for self service.\nOne of the guys coming off nightshift asked for an omelette and the chef asked what he would like in it, he said \"a bit of everything please\" meaning onion, ham, cheese etc, the typical omelette ingredients.\n\nWell, when this omelette arrived it was HUGE, resembled a giant calzone pizza, and when the guy cut into it he found bacon, sausage, a fried egg, black pudding, beans etc all the normal breakfast items. He shouts the chef and asks \"WTF is this?\" Chef replies \"you asked for a bit of everything\".\n\n\nNeedless to say, that guy never asked for another omelette.",
            "I read the title thinking, “isn’t that just eggs folded.” Read the post and learned something new. Didn’t know the meaning of the word omelette prior to this post. Learn something new everyday I guess. Thanks for the post OP.",
            "How much you wanna bet this lady didn’t learn her lesson and will continue to order her omelettes wrong?",
            "My friend was visiting Chicago from California. He wanted to try a Chicago style hotdog because he heard about how good they are. He's looking at the menu and see what comes on the Chicago style and looked a bit pensive. He didn't want the onions. Or the mustard. Or the pickle. Actually, he just wanted it plain. He tried the cashier his order, and the cashier looked at him confused.\n\n\"You want a Chicago hot dog, but you want it plain\", she asked.\n\nHe says yes.\n\nShe looks up at the menu, points and asks if he just wants a plain hot dog instead. It was about $2 for a regular hot dog but $5 for a Chicago style hot dog.\n\nMy friend is getting irritated with the cashier, not catching on, and repeats his order in a stern voice, \"I *said* I want a Chicago hot dog and I *said* I want it plain.\"\n\nShe starts to explain again but I interrupt this time to inform her he's from California, and tell her to just charge him for the plain Chicago style like he asked and I'll deal with him later. She smiles and says okay.\n\nSo my friend eats his hot dog and water says to me he doesn't understand this whole Chicago style hot dog thing. It tastes just like a regular hot dog. I say yeah, because it is just a hot dog. It's toppings he didn't want that makes it Chicago style.",
            "Evenhough she was wrong in the end.. if she actually wanted a plain omelette I'd also be very annoyed if someone asked me thrice if that is actually what I want. Omelette here is just an omelette with some salt and pepper. All that talk about ham, cheese and union in the omelette is just weird to me haha",
            "I hope she paid 2x too. You wanna be stupid you should have to pay for it!!",
            "As a former server…I feel your pain on so many levels 🙄",
            "Now you know why she was sitting by herself.",
            "r/TalesFromYourServer",
            "\"... a 5-egg omelette...\"\n\nThis is America, isn't it? I couldn't even eat a 3-egg omelette for breakfast!",
            "I used to wait tables at a trendy Tex-Mex restaurant in Austin that is known for the customer is always right. I had a guy order an enchilada dish that comes with a fried egg on top. He thought it was kind of small so he asked for another egg. I brought him two more that took about 5-6 minutes and he was not even halfway done eating his enchiladas. His wife says, \"You don't expect him to pay for that, do you?\" I said of course not, the extra eggs were free. \"No!\" She said, \"The enchiladas!\" I looked her right in the eye and said, \"Well, he's eating them so yeah.\" They blew a gasket and my manager berated me. Fuck those entitled Boomer bitches.",
            "[Highly Applicable.](https://www.youtube.com/watch?v=9Ah4tW-k8Ao)",
            "/r/TalesFromYourServer would enjoy this",
            "Are you in Britain? [Cause I think I know of someone else your customer met](https://youtube.com/watch?v=9Ah4tW-k8Ao)",
            "Reminds me of when I waited tables, and the breakfast menu listed \"2-eggs, any style.\" More than once when I asked the people ordering this how they'd like their eggs cooked, they'd answer, \"any style.\"",
            "Similar story, worked in a bakery very early hours. Customer comes in and asks for bagel with cream cheese.\n\nMe: What kind of bagel and cream cheese (20+ variety of bagel and 10+ cream cheese flavors?)\n\nCustomer: Bagel and cream cheese.\n\nMe: ok, as you wish (pick a plain bagel with plain cream cheese.)\n\nHand him the wrapped bagel, (cashier already rang him up) and he leaves. Comes back 2 min later. \n\nCustomer: This is not what I ordered, I ordered a asiago bagel with jalapeno cream cheese.\n\nMe: I will gladly remake it for you, but next time be specific when me or my crew ask you about your order. \n\nCustomer: Well you know what I meant, besides it too early to think about that.\n\nI just hand him his finished bagel, and just shake my head as he leaves. Being early in the morning to not an excuse to paying attention. It's not like I was having a deep conversation or having him do his taxes. Glad your driving on the road. /s",
            "I remember in Home-Economics class they were teaching us simple recopies.  They taught us how to scramble an egg - split the eggs into a bowl, add a bit of milk, salt, pepper, put in a pan and push it around as it cooks.\n\nI raised my hand and said at my house we use water, a half-egg shell per egg used.  The teacher wrinkled her nose and said 'well I guess if you want watery eggs, or are on a diet, or have someone whose lactose intolerant, but normal people don't do that'\n\nA week later the recipe was cheese omlet - and we were told to put in water and whisk until foamy.\n\nI asked - how come it's normal to put water in when you mix up the eggs for an omlet but not for scrambled eggs? She got mad.\n\nYears later I saw an America's Test Kitchen episode and I don't remember if it was scrambled eggs or omlet - and they discussed the three basics - Just beaten eggs, eggs plus water, or eggs plus milk.  They revealed that the proteins in eggs bound with excess water and were less runny than when you used milk or no liquid, and give a better finished product.\n\nSo F you home-ec teacher!\n\nOh yea, and omlet is not ingredient base, but technique based - whisk it until it's frothy and then cook it with minimal movement unti it's time to flip.",
            "I'll be honest- first time I ever ordered an omelet, I saw only the picture of a loaded omelet and told the waiter I wanted a plain omelet, and nothing on it (he did ask several times that I was sure, and I wasn't rude at all but said \"yes just a plain omelet\"). Now the omelets I had growing up had bacon, ham, tomatoes, onions, and cheese. To my family, a plain omelet meant one with no onions. Now I ate the 100% egg omelet I received and tipped with no complaint, but after talking to my parent I figured out what I really liked lol",
            "Is this an American thing? Plain omlette in Canada means nothing, just eggs (thought 5 is quite a few ahaha)",
            "So when Staff at any kind of business asks me if I'm sure, or tells me I may want to make a different choice that is a big red flag to me. I saw 'fried chicken' on the menu at a sit down Chinese place and the server told me no, it isn't what I think it is and I actually want to pick something else. If you give me advise I will take it.",
            "Around here what she wanted is called a “western”. \n\nYou are 1000% correct. A true “omelette” is soft scrambled eggs folded. With just some herbs like parsley or chives but definitely no cheese or other fillings.",
            "A standard [French Omelette](https://en.wikipedia.org/wiki/Omelette#France) is eggs cooked in butter seasoned with salt and pepper and (not always)  flavoured (but not filled) with tomato and finely chopped herbs\n\nSo OP was right, really, with the no fillings thing.",
            "I had a request for cheesy eggs with the cheese in the middle. So I made a cute little cheese omelette.  Nope. She wanted the cheese in the middle. Still shake my head on that one",
            "I had a similar experience, OP.\n\nThis short, nerdy-looking kid just sat down at the counter and said to me \"omelette du fromage\" over and over. \n\nI was like, \"Okay, cheese omelette, right?\" Anything else?\n\n\"Omelette du fromage\"\n\n\"Yeah, I got that already. Don't worry.\"\n\n&#x200B;\n\nHe left a tip though, at least.",
            "Damn 5 egger ommie granny bulking",
            "I’ve been cooking omelettes very frequently recently, I have to say the simplest omelette is always the best. I tend to gravitate toward the French style. This is basically melted butter in non stick pan, a well whisked egg or two, and a very quick fry in a pan. We’re talking a minute or two of mild agitation, with some butter on high heat. Then you flip it out and let it cook the rest of the way on the plate. A gentle rubbing of more butter over the top and a sprinkling of chopped chives. You got yourself a majestic meal.",
            "I feel like a plain omelette isn’t that weird to order this must be the 2nd restaurant she’s ever been to or something",
            "I would’ve tried to make myself the idiot to solve the regular omelette mystery. “I don’t want to get the order wrong. I am new here so- tell me again what’s inside this normal omelette?” “A normal omelette!” “Okay- hmm- we only serve what’s on the menu. Here’s a menu, where is the normal omelette? Here is the omelette section. No worries, get your reading glasses- no worries— no I wasn’t implying you were worried.”",
            "lmao onions and ham are absolutely not standard fare for an omelette I don’t know how she would even think to argue that. cheese sure, I could see that but ham and onions? I don’t think I’ve ever eaten an omelette that was eggs cheese ham and onion.",
            "Many years ago it was my job to cook any omelettes ordered at a restaurant in a government office building. I had one man regularly order an egg omelette. Basically 2 eggs and nothing else. One day he came in as usual and I added slices of hard boiled egg. He had a sense of humour and took it as a joke.",
            "if my server ever asks \"are you sure that's what you want?\" or anything along those lines I'm rereading the entire menu because I just got real nervous about my order.",
            "Just wait until you get a vegan who asks for a plain omelette. \n\n“YES! A plain omelette with no animal products!”",
            "“actually, ma’am, omelette is French for scrambled eggs that are fried and rolled or folded”\n\nUm…no it’s not.",
            "5 egg omelette?? Really..",
            "This is like an irl Good Burger skit, and I love it.",
            "Five eggs would be a big omelet even without fillings or toppings.  No wonder they always fill me up.  Thanks, now I'm hungry again...",
            "Plain omelettes are great for sandwiches. But best are always with old cheddar cheese and hot salsa. Nah if she didn’t know what a plain omelette is, she wouldn’t have enjoyed any other type.",
            "Wait, so you asked her specifically if she wanted an omelette with nothing inside and she said yes then she complained that there was nothing inside her omelette? LMAO!! XD",
            "As a French, I was really confused at the beginning of the story. Here you explicitly specify when you add something other then salt, pepper and maybe chive",
            "Plain omelette , done right, is amazing, with fresh bread and lots of butter.",
            "It’s ok. Hopefully she saved up enough money by not tipping you to buy a pair of pliers big enough to yank out that massive, stupid stick outta her ass.",
            "I make myself a plain omelette for breakfast several times a week. It’s nice of you to ask several times – I would have just written down “plain omelette“ right away and been confused when she complained later…",
            "[deleted]",
            "America has an annoying attitude with the 'the customers always right, customers have invincibility because they aren't the ones getting fired for shouting back. Employees should demand respect and customers should have more respect.",
            "An easily avoided situation by simply repeating back to the customer what the order entails 'so that's a five egg ommlette with no fillings and no toppings, just eggs, correct?'",
            "[deleted]",
            "Another person mad that no one cooks like their mom anymore. Eggs are a recurrent problem in her life likely enough.",
            "I am now slightly horrified by what Americans consider an omelette",
            "You know, I could excuse someone thinking cheese is default in an omelette.\n\nBut thinking ham and onions are?  What kind of sheltered upbringing did this person have?",
            "I don't even know how that's malicious compliance. It wasn't malicious at all. \nMore often than not I eat omelettes with only salt and pepper.",
            "good manager",
            "I can fill with invisible ingredients",
            "Why do people do this?  If someone questions your order, tell them what you want.  It's like some people are seeking their own outrage.  For God's sake.  There is no such thing a a regular anything unless it's labeled that way in a menu.  I'd like to see her order a \"regular\" pizza and hope for the right toppings.",
            "Man I kinda relate to her. Not that I'd cause a fuss, but finding a breakfast place that typically makes actually good scrambled eggs, with actual eggs, and milk and cheese, is more  rare than finding a diner that makes hot chocolate with milk rather than water. I get omelettes now because I cant rely on scrambled eggs to be good, not because I hate scrambled. At home I just add the omelette fillings to scrambled eggs instead of doing the folding.",
            "That sucks when your wage is determined by idiots that inflict imaginary issues upon themselves.",
            "Friend & I were grabbing a burger one day.  He always gets the same burger order, bun & a patty.  A guy living on the edge.  I order my burger then he orders his.  \"A burger with nothing on it, please\".  10 mins later i get a tasty burger.  He gets 2 pieces of bread.",
            "What do you call an omlette with nothing inside it?\nNo-mlette?",
            "5 eggs!!!?",
            "As an aside, a plain omlette is both the simplest and most challenging of egg dishes. Done properly, they are sublime.",
            "My golden rule is never piss off the people who handle my food.",
            "Sounds like that customer would complain to God about Heaven.",
            "Omlete du frommage",
            "I worked at a burrito place and people do this all the time (if you've never been in a Mucho Burrito, you walk up to a big counter of toppings, kinda like Subway so most people automatically get it).  They'd just walk in like \"I'd like a burrito\"  \n\"Ok well you're in the right place, what do you want?\"  \n\"Just whatever\"  \n\"Um that's not how this works, there's ...\"  \n\"Just get me a regular burrito \\*usually accompanied with a point to the menu at one of the disgusting premade recipe burritos that corporate tells us to sell \\* like that\"  \n\\*\\*\\*This is where it pays to be nice to the guy making your food because I would of course help guide the nicer people through the menu but the rude ones just got premade ones, no questions asked.  Smile at your servers and remember they are tired, working human beings and it just might pay off in the end, folks\\*\\*\\*",
            "To me the whole concept of breakfast place is a mystery. In my country you have breakfast at home, alone and pissed off that you had to wake up",
            "A five(!) egg omelette? Jesus fucking christ.",
            "“ ‘Omelet’ is French for ‘exactly how I personally want it,’ God you people are dumb!”\n\n/s",
            "As a fussy omelette person I've had problems ordering omlettes from the other side. There are some foods I can't eat, so an omelette is often a good solution in a restaurant. \n\nSometimes I need to take one of their Signature omelettes and remove items.\n\nOne place I ordered an omlette with ham, tomato and mushrooms. All good. Then I said to the waitstaff \"no cheese, I can't ear cheese.\"\n\nShe rolled her eyes at me and said in a rude tone: \"you didn't order cheese, you won't get cheese\".\n\nMe: \"Great thanks.\n\nOmlette shows up 20min later with the correct ingredients inside. Smothered all over the top with cheese. Melted nicely into the whole top. It was a HUGE amount of cheese. Not a decorative sprinkling.\"\n\nI looked at her and said: \" Why is there cheese all over the top? I didn't order cheese?\"\n\nShe said: \"It adds flavor and is a garnish. We add it to all our omlettes. If you don't want it then scrape it off.\"\n\nMe: \"No. I'm not eating this. I specifically said 'No cheese.'  I can't eat cheese and I told you that.\"\n\nThe dawning horror on her face as she realized I specifically said No Cheese was worth it. I could tell the cook was not going to be happy with her.\n\nDon't fucking roll your eyes at clients if they tell you they can't eat stuff. \n\nBut the amount of cheese on top was bizarre for an item not ordered. Their food costs must be huge.",
            "Can I have an eggless omelette? \n\nhttps://youtu.be/9Ah4tW-k8Ao",
            "I waited tables with a real sassy girl friend of mine that had a master's degree and enjoyed outwitting customers.\n\nOne day a customer flagged her down saying her iced tea tasted like water. \n\nMy friend picked up the tea and asked if she would like another one or something else to drink.\n\nThe lady says, \"No, I'll just have a water please.\"\n\nMy friend slammed the tea back down on the table and said there you go!",
            "This was the customer....but sometimes it can be the staff that messes up. One time my kid cousin was eating at a restaurant that rhymes with \"Lenny's\" and her parents let her order for herself. She asked for the \"kid hamburger with just mayo and pickles\". The waitress comes back with a bun smothered in mayo and loaded with pickles with no meat patty. The order of a HAMBURGER should imply the protein and the mayo and pickles are the only condiments she wanted on it. That was pretty dumb."
        ]
    },
    {
        "post_id": "sxivxh",
        "author": "upaboveitall",
        "title": "I was forced to eat at fancy restaurants for a month $$$",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sxivxh/i_was_forced_to_eat_at_fancy_restaurants_for_a/",
        "score": 33339,
        "num_comments": 1075,
        "created_utc": 1645412459.0,
        "selftext": "Many years ago, I got put on a work assignment for months that required me to travel to New York City and stay every Monday to Friday. I was assisting a company manager with a project and my hotel was near his regular office in the Theater District.\n\nIf you are not familiar, the Theater District is heavily built for tourists. Restaurants are generally kind of fancy and expensive. There were really not any quick and cheap options for dining in that area. The company had a generous meal policy of up to $30-40 meal for travel expenses. I did use that for a bit, but the food got to feeling too indulgent and kind of ridiculous given it was an extended assignment. Also I was working really long hours and did not want to go sit in restaurants- I just wanted to go watch tv and sleep in my room.\n\nSo after the first week or so, I instead went to a grocery store on Monday night. I bought some basics for cereal, sandwiches and snacks, and some frozen meals I could microwave for lunch in the office. It cost about $60. I then took a few cans of soda from my hotel fridge to make room for my weekly food purchase , and returned them before checking out at the end of the week. And that was it for food costs, with an occasional meal out here or there. I did the same the next four weeks, submitted my expense report at the end of the month. You know where this is going…\n\nA lady from accounting called, and refused to reimburse my expenses because $60 is more than $40, the max allowance for a meal purchase. I explained that had covered 5 days of food but was told it didn’t matter.\n\nI then spent the next month trying all the food in the neighborhood. There really were not any cheap options. I went out to eat a few mornings, lunch whenever I found time, and dinner absolutely every day. I could have bought a few installments of groceries but the once/week shopping convenience was part of why I’d wanted them. It had also seemed wasteful for me to go out for an expensive meal every night for long term travel, but now I’d been told that was preferred by accounting to my grocery bills!\n\nThe next month, I got a call from my NYC manager asking how I’d run through more budget every week of the month than the entire month before combined. I explained the grocery situation, and he thanked me and hung up. About 10 minutes later, that same lady from accounting called me to tell be they’d pay my still-not-reimbursed grocery bill and any going forward as long as the daily amount averaged for the week was under the aggregate meal allowance. \n\nI happily returned to a more reasonable diet.",
        "permalink": "/r/MaliciousCompliance/comments/sxivxh/i_was_forced_to_eat_at_fancy_restaurants_for_a/",
        "comments": [
            "in my line of work, we get paid the max per day allowed. If we use it or not that was up to us.\n\nI travelled for almost 3 years straight, so the hotels I stayed in regularly bumped up to the suites with kitchens. I would spend months on the road. When I flew out to assignments, I'd just buy tupperware, plastic knife/forks etc. I ended up getting an additional 300$ a week beacuse id only spend 100 a week on food.",
            "So busy counting the beans, they forgot the soup.",
            "Company I used to work for had a max dollar amount that could be spent per bottle of wine or booze when entertaining clients. On a night out with a client my coworkers bought magnums instead of regular bottles because it cost less per glass. For once in their lives they were actually trying to be “good stewards of the company dime.”\n\nGuess how that worked out? The accounting rep berated them on the dealing floor. From that moment onward they spent every moment trying to use the company’s policies to screw them over.",
            "My company tried to do the same with fuel. I get a $250/wk allowance. One Sunday morning, after working a 15h night shift from Saturday afternoon, I stopped to get fuel Sunday morning on the way home. I had a day off on Sunday, and was back to work by Monday. They refused to reimburse me for the fuel because I \"had Sunday off\" and the company will only reimburse for fuel accrued on a day that I've worked.\n\nI now submit 2 fuel receipts per day. One from before shift, and one from after, each totaling a little less than ~$5/each. I've been asked to stop constantly and have refused citing the previous incident, which they still stand behind.\n\nI went from submitting about 98 fuel receipts per year to almost 700. I told the woman from the finance department that if it happens again, I'll make it 3x a day.",
            "Why don't companies just cut the per diem checks ahead of time? That's what a place I used to work for did. You get your money so you can actually use it rather than wait to be reimbursed.",
            "We have this on the railroad where I work. If you work 11 hours, the company either has to provide a meal, give you time to go get a meal, or pay you an extra hour overtime and you expense your meal you get after you get off.\n\nGuys wanted to just get a few groceries sometimes, yeah it usually was more than a meals worth, but cheaper than going out. Company didn't like that so guys started going out for 40 or 50 dollar meals. The railroad didn't like that but they wouldn't take any receipt from a grocery store so that's just the way it is",
            "Math is our friend if we just use our brains!  \n\nI got into a similar fight with attg.  Worked at an Ad Agency - policy was you could order dinner delivered if you worked after hours and get a cab home.  I was almost done with my OT task and was getting hungry.  I knew it would be faster to take the train home and stop at the grocery store and get something from their deli - just wanted to get home and eat and call it a day.  They denied both receipts as I was only supposed to be reimbursed for food eaten while at work and actually in the office.  So I should have stayed later getting more OT, paid more for food and more for a cab?  Seriously it was like $2 for the train and $8 for the deli.  I told my Head of Production and he picked up the phone and suddenly they were reimbursing my $10 worth of receipts.",
            "This was the golden perk of a 3 month training at a former employer. Any new person coming into the role had to report to Corp HQ for a 3 month intensive training camp. Accounting was notorious for denying anything outside of the “rules”. \n\nThe teachers learned this and on the first day spent about an hour going over exactly how to submit your receipts and what the individual totals needed to be. ANYTHING outside of the rules on one line would cause your entire expense report to be rejected and it could take 6-8 weeks to get it revised. \n\nI went with any other guy from my location and before we left the last guy who went gave us a “cheat sheet” of all the local restaurants and how to make “special orders”. These restaurants were close to HQ and knew of us trainees. Alcohol was not allowed to be written off, but if you ordered “special combo #5” at the sushi bar they knew it as a bottle of sake and it looked like any other roll. \n\nWhen we got back we passed the sheet to the next guy with all of the updates.",
            "Expense reporting and reimbursement goons are among the dumbest, least flexible potatoes in accounting.  \n\nAn example for me:  I live and work in Columbia, SC, and my company has a major ops center in Albany, NY, and another in Syracuse.  When this story happens, my daily driver was a (then) brand new KIA Rio hatch, 37 mpg highway, and the company paid the IRS standard $0.56 per mile when using a POV for business.  I'm salaried, so it didn't matter on hours.\n\nWas given 48 hours to prep for a 12 day trip, Columbia to Albany to Syracuse and then back home.  Flight from CAE to ALB, then rental car, drive to Syracuse, drive *back* to Albany, then back home.  Round trip flight, Delta was the required airline, Hertz required rental (medium sedan,) Hilton Garden was the required accommodation, etc.  Because of the short notice, the economy seat flight and one checked bag was $973.41, rental was $611.03, gas and tolls cost an additional $99.57.  Transportation costs, reimbursed without question was $1684.01.\n\nHad I driven, the mileage paid would have been about $1030, plus another $12.20 in tolls.  For me, gas plus an oil change when I got back (was at about 4k miles, manual says 7500, close enough) would have run me $250 or so.  Personal profit, about $800.  Savings to the company, about $650.  Win-win, right?\n\n\"No\" because \"POV usage can potentially lead to employees abusing the system for personal gain, and cost the company more.\"  Never mind that it would be a savings for the company...",
            "As an accountant, I can tell you that that lady was just following protocols set in place, otherwise Internal Audit will be chasing after her. For me, I have to send querries to claimants because sometimes it's not as per protocol, not because I don't want to reimburse them, it's not my money anyway. \n\nFor OP's case and anyone else in the future, you have the good intention of cutting down costs for the company, but it is important to communicate that to the manager so that they can inform the accountant. The accountant requires that as evidence of permission to process claims in a different way, to protect themself from Internal Audit.",
            "How a competent employer does it:\n\n> The per-diem rate is 40 per day. You will be there for 5 days so here is 200 dollars. Don't waste our time with receipts and we won't ask you how you spent the money.",
            "I'll bet Accounting Lady was pissed that she had to buckle on that one",
            "Sometimes it's because nobody ever put a system in place to track and reimburse non-restaurant meals. It probably got worse when things started being done electronically instead of pen and paper.   \n\n\nThis is one area the military method made sense when people were on TDY with a per diem. It was just that, a per diem. You're an adult, here's money for food, take care of yourself.",
            "This happened at the last company I worked for!\n\nFor out of town expenses the company booked and paid for my hotel, but I could buy food and expense it. The wording in my contract was something like \"reasonable meals you'd regularly eat at home\" or something. Basically \"we'll cover your meals just don't eat steak and lobster every night.\"\n\nI was at a job for two weeks at a remote ski resort. Closest town was 30 minutes away. For lunch break there was one restaurant at the resort and it wasn't cheap. Kinda fancy and knew it was the only dining option around so they took advantage of that. I ate lunch there the first day and it was close to $50 with tip. So when I drove back to town for the night I hit a grocery store and bought a pack of buns, some deli meat, a pack of sliced cheese and a case of bottled water. Ate that for lunch for the rest of the week and it cost me like $20.\n\nI submit my expenses when I go home Friday and when I'm back out there Monday my boss calls me to remind me I'm not allowed to expense groceries under any circumstances. The contract states meals only. I explain to him what I did and he says it doesn't matter.\n\nI ate lunch at that restaurant every day that 2nd week and probably spent $300. No complaints from my boss or payroll or anyone. I couldn't believe it.",
            "I had the exact same issue but was staying in Vegas, working at a casino doing an IT project.\n\nIf you still travel.for work, just tell the front desk you are a diabetic and need a refrigerator for insulin. I am actually diabetic but they never ask for anything to prove it. They won't ever charge for the mini fridge.",
            "I bet your waistline thanked you - I'm sure I put on a few pounds just reading that haha!",
            "I have this exact same story.  Was told “we are buying your meals, not your groceries.  Well, I’m like 3000km from where i would put my groceries away in my house, soooo…. Anyways, yeah.  Convinced them to let me buy bread and meat and stuff.",
            "They tried this on me too while I was living abroad for work for a while. Luckily the manager was the one who gave approvals and added a note to finance that I went grocery shopping for a week’s worth of food at a time rather than eating out every single meal.",
            "So silly. I don’t know why companies just pay a decent per diem and be done with it. No receipts. No admin. Just give the employee cash and let them make their own meal choices",
            "This is a perfect example of malicious compliance haha",
            "I guy at my work had a deal with the local tuck shop. We have $50 allowance for dinner. Much more than needed. Double so in a regional town. \nHe would get a reasonable meal for $20. They would make a $50 receipt. He pays $35. The shop gets $15 more than expected and he got $15 extra from the company",
            "I work at a software development company. Most developers use open source tools that are free, but a couple of them requested a license for a paid version of one of those tools (it allowed him to automate a process that takes hours to do manually). \n\nAs Director of Technology I evaluated the request and accepted it. I requested finance the approval of the purchase for 2 licenses (300€). They said no, since they should use the same tools as others. I fought this for months, until this year when I just budgeted a license for every developer (18.000€). It was approved even if we are in a complicated financial situation...",
            "Yea, i do this, and i pocket the money i dont use its like 50 bucks a day and 50 bucks gets me food for a week.",
            "I would have just eaten out every meal from the get go",
            "Small disagreement, there are plenty of affordable restaurant options in the Theater District. If you stop by the food carts, you can get a meal at half the cost of the restaurants.",
            "When I was on business travel in NYC in the 1980’s and 1990’s, I would eat a hotdog for dinner from a street vendor, then race to the TKTS booth and spend the rest of my per diem on a half price ticket to a Broadway show.",
            "**Executive:** There's no way someone could spend $200 a week on food.\n\n**NYC:**",
            "The difference between you and me is that I would have gotten real comfortable with that $120 meal allowance. I was working an internship for free in the city, and my job responsibilities ended up being way different than promised (I was supposed to learn new skills, but was only getting used for my advanced graphic design skills that I would have otherwise charged for). They would pay for my lunch and transport though, so for a couple weeks, I was eating $25 lobster grilled cheeses, doing double meat in chipotle, and always getting a drink, sometimes two if I couldn’t decide. That was my small win, always pay your interns. Fuck them 😂",
            "There's nowhere in NYC that isn't 15 minute walk to something non touristy.",
            "My country has meal reimbursement specified by law. The gist is that you get daily amount and you get to keep what you dont use (stuff like hotel breakfast gets deducted).\n\nWork travels to Switzerland or Germany were nice because I get to save nice amount of money especially when I could stay in company apartment where I could cook.",
            "I would have all my food delivered. “How much is it? $25, here’s $40.” It was 8.67? Here’s $40”",
            "About 20+ years ago I was  a consultant for an international software company. They had a rather generous per diem for meals when you were traveling, and didn't care what it was spent on as long as you had a receipt for it that was within the limits of each meal (worked out to about $75/day at the time).\n\nI certainly couldn't eat out all of the time, and I preferred to stay at Residence inns as much as possible so I could occasionally cook. So I would buy a week's worth of groceries and cook. Then I would collect varoius receipts and turn them in for meals. Yeah, it was a way of gaming the system, but it worked out, and the whole thing was taught to me by one of my bootcamp instructors during training.\n\nI met my dad & stepmom for dinner one night at a rather nice steakhouse in Manhattan while I was there on business, and they got to the place about 45 minutes before I did. The total bill was over $300.00 and it took me about 3 weeks to expense it all away. Well worth it.\n\nDad passed away two years ago today, and this was one of my best memories of us.",
            "Had my own receipt printer for this very reason. I gained 30 Lbs, working in Manhattan for 8 months.",
            "Man I have seen the same shit. I bought a $100 weekly tiffin service instead of spending $35 per day. The manager was upset. I explained to him and he at least was sensible enough to understand and processed the expenses.",
            "A lot of companies have weird policies like that. Since I started working from home my company said we would be reimbursed a set amount for internet. I pay $20 less than what they reimburse so I submitted it and they denied it because it had to be for the exact amount they reimburse. So I’ve been getting a free $20 every month for 2 years.",
            "I'll never understand why they can't just give you a total meal allowance for the entire trip. $40/meal, 3 meals a day for 5 days. $600/week, and if you go over that then they only reimburse the $600. Hell, that's what McDonalds does, and they're the cheapest POS's on the planet.\n\nMy dad's company currently does a LOA (Living Out Allowance) it's supposed to cover travel expenses, and food. Idk how much it is, but he says it's very generous and they pay it to him regardless of if he uses it or not. The only downside is that it's taxed like regular salary.",
            "Friend of mine is the EA for the CMO of a fortune 50 company. Someone in compliance wrote a nasty email addressed to said C suite exec saying they can't spend more than $100 on any expense without getting prior approval.\n\n...it was for bereavement flowers totaling $120.",
            "With my company we get a much preferred per diem vs claims.  We get $75 per day (listed as $15 breakfast, $25 lunch and $35 dinner) for meals given as cash/cheque the week before the trip.  That's mine to spend how I see fit, no recipts or claims required to be shown after the trip. 5 star dining? Some days sure.  Donuts and coffee 3 meals a day and pocket the remaining $65/day? Thats cool too.",
            "The best meal policy is always just giving the employees cash and if they want to eat cheap to pocket some, let em.",
            "I have a similar story. I had to do a 3 week stint at one of our manufacturing locations once. When I got to town I was horrified at how much a rental car was a day, close to $100/day with taxes and shit, so I called around and found a local car dealer that would rent me one for $20/day which included insurance (that's important). I literally hitched a ride from the airport and left the dealer in a brand new car with like 7 miles on it. I drove the crap out of it for 3 weeks and the total bill was less than $500. I also ate on the cheap while there and when I turned my expenses in I got a shitty note from accounting about NOT renting from Hertz, who was our \"approved\" supplier. My bosses bosses bosses boss, who was an executive VP, had to approve it before I got reimbursed. \n\nA couple of months later I had to go back for another tour. I flew in, rented from Hertz, DECLINED the loss damage waiver per the accounting departments instructions and left. Every single day I had the full breakfast bar at the hotel, which was NOT included in the room rate, or ate a full breakfast at a local restaurant. Every day at lunch I had an extra large pizza with everything delivered to be plant and simply let the guys there eat it since I wasn't hungry, which was a powerful motivating force btw. And for dinner I had the surf and turf at the local supper club next door to the hotel and what I couldnt eat I fed to the cats that hung around. After about a week I had like 20 cats waiting to be fed filet mignon and lobster every night. I even bought a big bag of cat food which attracted even more cats. And the icing on the cake was when I wrecked the rental car, and since I had declined the LDW per policy the company had to eat like $6k in repairs and \"loss of use\" in addition to the $2k in rental fees. I turned in my expenses and they paid everything without batting an eye but when the bill hit the VP's desk he had a shit fit. He came to me personally, asked me what the fuck I did to run up such a bill and I told him the whole story. He just stood there with a dumb look on his face then started laughing. He explained a lot of financial shit to me about operating expenses and how it's basically all a tax write off then went back to the main office and fired the accounting manager. \n\nAbout a week after I got back I got a letter from one of the engineers with a newspaper clipping of a story about an army of hungry cats around the hotel and supper club begging for food and trying to get inside and shit. I never went there again and the company eventually got taken over then filed for bankruptcy. This was in the early 90's btw.",
            "Accounting doesn't care about the costs, they care about the rules being followed. Classic \"just make sure the numbers line up and are in their proper places\" position. Good thing a higher up was allowed to think on their own.",
            "If I can't have the comfort and quality while I travel for work. I aint going. I cannot spend my evenings in the way I would usually. So the least you can do pay me adequately for my hotel room, food and time there. \n\nI'm lucky enough to be in a position where I can actually do that. \n\nWhat I'm trying to say is don't sell yourself short.",
            "I always max out my reimbursement.\n\nThe company gives x for breakfast, x for lunch, and x for dinner.\n\nYou best believe all 3 were maxed out every day. I love trying new restaurants though.",
            "I had an early flight once and no time for breakfast so I enjoyed a 5-minute coffee at an airport cafe (about $6) and just rounded the amount up to $10 for a tip. Accounting called me notifying me I had “tipped over the allowed %” and needed me to pay back the $3.XX” I over-tipped. When I countered that I could’ve ordered a $30 breakfast (which was allowed) I got the knee-jerk “it’s policy” rebuttal. So I sent the money in all change via inter-office email specifically addressed to THAT woman. And on future trips if I didn’t have time for breakfast (or wasn’t hungry), I offered to pay for a stranger. And I’m still not sorry about it.",
            "Many moons ago, When I was drinking, management refused to pay for a single beer one night on my expense report saying it was alcohol. Next trip, the entire daily weeks worth of alcohol was covered under “parking” plus some for annoying me. Never mind the fact that when they went out it was 500+ per bottle of wine. Too bad I don’t drink anymore.",
            "My company will pay petrol expenses only from your usual place of work, to your destination and return. One regional meeting we decided to car pool and I drove a little bit around town to pick up my workmates. Company wouldn't pay the extra milage, just a few kms, but would have been happy to pay all 5 of us individually return expenses if we all took our own cars, much more expensive for them. So weird.",
            "There loads of cheap food options within a blocks walk.",
            "We used to have a policy of $60 per meal\n\nSo I once stayed a month in the US for work, hotel bill was just shy of $10k which included me spending $75 on average every day in their restaurants (breakfast and after dinner drinks)\n\nBut everything was in policy so it raised absolutely zero flags\n\nNow days it's a per diem (set by the Swedish government), which is something like $80/day :(\n\nCan't buy as many Martinis with that",
            "Similar to a job I had, they used to give us an allowance (like $25/day or something), it was great for me, I would just get a toast and coffee from the hotel at breakfast, some Taco Bell at lunch and a sammich at dinner and pocket the remainder $15 or so. New manager comes, he then says no allowance, and only pays for receipts up to $15 for dinner and lunch and $10 for breakfast, well, that turned my $25/day to almost exactly $40/day.",
            "Our daily allowance is 60, used to be 100, but the great recession happened.  Think about it as a perk for out rooting you from your house food. Also, killing time is part of it. What do you do when you are out at 6 pm? Go to your hotel room? No fucking way, I need a way to kill 2 or 3 hours.",
            "I’ve been to the Theater District plenty of times. There are lots of less expensive food options. Relatively speaking of course, because it is NYC and prices are high compared to other cities.",
            "My uni accommodation wasn’t built until about 9 months into my first year. As such the company had to pay for our accommodation until then. I ended up spending most of my first year living out of suitcases in furnished hotel rooms and for the first month they paid for our breakfast and supper costs at the Premier Inn diner which led to me gaining some weight as I feasted every morning on a continental breakfast and finished the evening with a three course meal… every day.\n\nOnce we were in the accommodation I signed up for a student manager role within it so I got paid by the company a small amount for my time on the job, and at the end of the year I successfully disputed their claims that I had to pay rent for the time that the building didn’t actually exist. \n\nHonestly, that was a truly amazing year.",
            "Happened to me, too. I was based in NYC but traveling to Texas often. Our travel system was So SmArT that if I bought something at 11:01pm in Texas it would only think in Eastern Time and say I had made a purchase against the next day’s per diem at 12:01am the next day. They would nickel and dime, you couldn’t go $.01 over without being flagged. \n\nAnyway I escalated it up to the CFO office and said - look, if you give me budget X per diem and I am there five days, my total food budget is (X*5), I’m not even approaching that much spend in a week. Nope! Can’t make exceptions for you or else we have to make them for everyone, don’t you understand!? The company was a bit of a dick about it so I did the same thing as you - whereas I originally wasn’t spending (X*5) total every week now I aspired to. Because I was traveling so much I knew what would trigger a food expense and what would need to be explained (think mall food courts saying Macy’s on the receipt even if it was clearly sushi in the line item). So I’d stock up on snacks, whatever I could fit in my carry-on and hand snacks out at the office, and I made sure to get as close to the per diem as financially possible because if they had a point to make, so did I.",
            "And this is what is meant by \"becoming a corporate robot\": When you cant use basic reasoning to approve an obviously valid situation.",
            "A company I worked for before i changed industries tried this with me. I told them no, I would not expense meals. They will pay me a reasonable daily per diem payed weekly and if i use it or not, thats none of their business. HR didnt like my attitude, my boss thought it was hilarious. I got my per diem.",
            "Twist: accounting lady was meliciously complying when she rejected your original claim. Lol",
            "It was nice of you to do that for your company, years ago. If that was today, many of us would max out the limit every single time. Extras could be saved for late night snack or even for the homeless people on the streets. No need to help save a dime for these cooprates. Max. It. Out!",
            "I worked for a company in the 90s that didn't have limits on expenses, since no one had ever abused that perk. Until my new ass of a boss came along and suddenly we had expense rules. One which stated a meal was capped at $60 *per person*. One morning we're working off site and he convenes a dept breakfast meeting of about a dozen of us - at an IHOP, and says we can only order coffee, and there's maybe three rolls to share amongst us on the table. Ok, weird, whatever. About a week later I take a couple of new hires out to lunch to welcome them aboard etc, it's over $100, I turn in my expenses to my boss, who crosses it out and says the limit is $60 per meal. Huh. So I wait until after work when the CFO is staying late and ask him, and he's bent over doubled laughing because since the rule change my boss has been capping every meal he's expensed at $60 no matter what, regardless of who or how many have been with him. I get reimbursed in full, and am asked to give my expenses straight to finance rather than through my boss, so that no one tells him it's per person, not per meal lol",
            "I work on heavy equipment in the field. My service truck is my office basically. The cab is extended I put in a cot of blankets pillows in the back along with a tv and tinted windows . Our company pays 200 per day hotel and 45 for meals rather you use them or not . The places we work on equipment is not some place you would stay in a motel. Groceries and a cooler, drive to the truck stop for a clean shower each night( 7 dollars). I can’t complain allot of extra money for minor inconveniences.",
            "Lol you should have continued with the fancy meals as a lesson.",
            "A fancy meal for 30-40$ in New York City?\nDoubt.",
            "This is a common idiotic policy at most companies. \n\nDoesn’t make any sense.",
            "Per diem. Any time I travel I spend as little as possible so I can pocket the rest",
            "Why do people take an instant dislike to bean-counters?\n\n\nBecause it saves time.",
            "Previous company was perfectly happy with me buying a weeks worth of groceries to bring back to the apartment. I can't understand how some people fail in using logic.",
            "In Germany that would make sense, as:\n\n1) As a company, you usually cannot deduct groceries from taxes. You have to do a lot of explaining. For example, you would have to deduct the part that you use for breakfast. Breakfast is not included in deductable travel expenses. Logic? None.\n\n2) Management has also to do a lot of internal explaining why there are groceries expenses. \n\n3) If your company goes into bankrupcy, the investigators will try to blame it on your 60$ grocery shopping and make you liable as a person. Logic? Again, none. But I know a guy that went through that and he actually needed heart surgery after the ordeal. \n\n4) ???\n\n5) Profit",
            "Accounting of all departments should have understood and let it slide. She was unreasonable. At my work it is well know you can just do whatever you want as long as the week averages out (and you’re not being egregious and abusive of it)",
            "You're lucky, my company gives me a $25 a day limit when away for the night. $25 a day to have breakfast, lunch and dinner. Tight arsed bastards. I'm in NZ where food ain't cheap.",
            "I worked away from home for a few months. Would make the 5 hour drive on Sunday night then stay till Friday night and drive back. Similar story, they didn't like the weekly bill and insisted I stick to my daily limit. Well ok. There was a supermarket right next to work. Since they didn't require itemization I spent the maximum $30 dinner allowance everyday. I got what I wanted for dinner then spent the remaining 10-20 on non perishables for home. Got between 50-100 in free groceries a week. Didn't have to buy any canned goods, toilet paper or noodles for like a year.",
            "I enjoy how a manager called to inquire about you actually utilizing your meal stipend as if it's a treat and not part of your daily compensation (even if you don't care to use it daily).",
            "Also you could try going once to grocery store but splitting your shop to two receipts, and expensing them for different days",
            "Yeap. That is my overall experience with accountants. They are really really great at following instruction and fullfilling the given tasks to the letter. (I guess that is kind of needed in this profession?). But they are really bad at using common sense or even coming up with new ideas a proposing these improvements to the management.\n\nSo when the company desides to provide \"40 buck per day\" thats what they will do. And they will not do it any other way because \"that is the rule that company decided\". Idea that company could change it, and that company can change it based on their own proposal is inconceivable for them. :-/",
            "This is why a lot of companies have monthly per diem. $1000/month is much reasonable than $40/day.",
            "This. This is why a lot of companies use \"per diem\" rates for a given city. OP should have been given a block amount for the time they were traveling. If they go cheap, they get to pocket the difference and if they go over, they have to pay for it themselves. Saves everyone a lot of time and energy, and you avoid these kinds of situations. \n\nOf course, it would also help if the lady from accounting had just a little bit of common sense.",
            "I did the same thing except I purchased 35 worth of grocery gift cards everyday. And kept the difference.",
            "My first job did per diem different. Depending on where you were at you were given x dollars per meal. No reports needed as if you went over that on you and if you went under, you keep the extra.\n\nThey sent me to Scotland for about 2 months,put me up in a flat and all. Per diem was like $95 a day. I found my local grocery store and banked all that extra and paid for a trip to London to see my brother with it",
            "You had this due to the class of expense:\n\n\"Dinner out\" - tax-deductible against profits, and chargeable to client\n\n\"Groceries\" - benefit-in-kind, could hit your own taxes\n\n\"Corporate Apartment Expenses\" - - tax-deductible against profits, and chargeable to client\n\n&#x200B;\n\nI had someone in Finance explain to me the \"correct\" line item to use in Concur, which made putting $$$'s in groceries through totally legit. Also meant no limits or allowances were hit. \n\nTL;DR Speak to someone in Finance about what to do.",
            "Protip:\n\nAsk them to give you a per diem for food instead, go back to shopping for less expensive food, and pocket the difference.",
            "Happened to me in work too - far less expensive though.\n\nWas spending maybe 20 quid a day with breakfast and lunch, water and coffees etc.\n\nNo one questioned anything, would tell my friends and they would tell me that I should probably cut back.  I wasn't over eating or over spending. Just a coffee, small breakfasts and a filling lunch to keep me going (on my feet all day, long hours).\n\nOne day I thought, ye this is a bit mad spending 100 quid a week of the company's money.  So I went to a grocery store and bought bread, peanut butter and jam.  Had a toaster on site, so no problem, there's me saving the company mad money every week with a few sambos each day.  Gotta call pretty quickly saying I can't spend my expenses on groceries. The expense bill that week was maybe 20 quid as against the 100 usually. No sense.",
            "Spend a dollar to save a dime. Sounds right for corpo land.",
            "Rule number 1 in dealing with corporate accountants. Never try to save the company money. It always goes badly.",
            "Was given a company credit card and told to use it for bills when travelling as the organisation had ‘decided’ that reimbursing for cash receipts was costing them too much.\n\nWould you be surprised at the number of places in the world that don’t accept credit card for payment and insist on cash. Nightmare",
            "Damn I wish I could eat lavishly on someone else’s dime. I love going out to eat",
            "Right after September 11th, 2001, I was hired by a sub-sub-sub-contractor for the TSA to be a network administrator. I oversaw the data collection during the medical process of federalizing baggage screeners for airports across the U.S. My usual stay in any one place was three weeks.\n\nFirst, they sent me to Seattle, then Billings MT, then Indianapolis, and finally, Anchorage, AK. The per diem varied widely from place to place, with Alaska obviously being the most expensive. Beef was so expensive, for example, a double-meat roast beef sub at Subway would have run you $25 easily.\n\nThe guy I replaced in Anchorage advised me to 'go native' and eat lots of fish, because we were getting the same per diem regardless of what we ate, and we'd pocket the rest. There was a sushi bar right there in the middle of the hotel bar, run by an elderly Japanese couple who spoke as much English as I did Japanese (10-15 words max). Luckily, the gorgeous Korean bartender spoke both, as well as Korean, so translation was never an issue. I spent three weeks eating the best sushi I'd ever had, including when I lived in San Francisco. A selection for which I would easily pay $30 here in the lower 48 cost a mere $15 there. And the fish was so fresh, it was probably swimming that morning. I've never had sushi that good since.",
            "My last job was my first experience traveling with business. They gave me and my buddy who came along something like $50 a day per diem. First part of the trip I'm clueless to this so I'm just buying things for myself without keeping receipts for reimbursement etc. Business partner points that out and suggests we discuss it more over dinner. That day we made it our goal to spend every single dollar of that, and more. They told me I could buy dinner for our hosts, so I waited till it's 6 of us in the group before pitching it. Found the most expensive place within reason, and spent close to $600 on dinner. That was the last trip they sent me on unfortunately, but it was fun.",
            "I had the same thing happen while working in Orlando once. Got tired of touristy restaurants and went to the grocery store. Got a call from my manager asking me to explain an $85 grocery bill. I politely responded, “You never asked me to explain a $40 meal tab but you want to know how I’m living off $85 a week in groceries?” He got real quiet and just said “gotcha, that works.” Management can be real dumb.",
            "There's a metric shit ton of food places around the Theater District and Times Square that are downright cheap. There are Halal carts that will serve chicken and rice for $5 and are delicious. There's a pile of delis that will make a great, fresh sandwich for under 10 bucks.",
            "I worked a job where I would usually stay down town in major cities, but circumstances changed on a trip and I got stuck in a hotel near the airport of a major city for two weeks. One of the managers said, “you’re lucky we even got you a hotel” I’m not sure what the alternative was, pitching a tent downtown? \n\nThere were no food options within walking distance because everything was  on the other side of security. The hotel’s restaurant didn’t have free breakfast and was insanely expensive for what it was, $20 burgers for instance. The rooms didn’t have refrigerators because most people who stayed there were waiting on a flight. The city was a twenty minute drive, but we weren’t allowed to use work cars unless we were working, no food runs. The only other option was a $27 and 45min train ride or $50 cab. Neither costs were reimbursable. \n\nWhen I asked about actual meal cost reimbursements instead of the per diem we got, I was basically told to fuck myself. I started looking for a new job that trip.",
            "What shortsighted idiots. Least the higher-ups we're a little bit smarter than the drones in accounting. My husband travels a lot and he always tries to get the cheaper hotels but there's a lot of people that go for the max, of course doesn't help the company bottom line any and every now and then they have to lay people off because they don't have the money probably cuz of these idiots spending extravagant money on hotel rooms. Now my husband's not staying it motels or anything, he's just staying at the cheaper hotels, instead of the more expensive ones like Hilton, etc. He'll spend 119 for a night instead 180, adds up.",
            "I had a similar situation, except they gave me a one-time exception for the groceries for that week, and the next time I travel the policy had been changed to officially allow for it.",
            "Per diem is the best way to do this IMO. I also fill my hotel fridge with groceries. Eating out every meal is an easy way to double your weight in five years.",
            "It’s not malicious compliance to use the food per diem that you are entitled too. It is ridiculous to not use it. With the one caveat that if they’ll\nPay out the whole thing anyways then you can spend less and bank the rest",
            "$40 is kinda nothing for a fancy restaurant",
            "That's got to be frustrating. My company gives us a $75 per day cap, and the hotel always covers breakfast. But they are reasonable, and let us use the company credit card at walmart if we turn in receipts showing we did food shopping and didn't buy non-allowed stuff. So we would have a packed sandwich for lunch, and eat like kings at night with steaks and multiple beers for dinner.  \n\n\nBut they're weird about other things, like it's always easy to approve funds for labor for a major project but capital funds are like pulling teeth. As a result the manufacturing plants hoard EVERYTHING during a renovation.  One plant built an entire new conveyor from the scraps they had lying around.  Couldn't get the capital funds for a new conveyor, but had no problem getting the labor approved to MacGyver one together from 20 years worth of spare parts they'd squirreled away. Would've been cheaper just to buy one new.",
            "In situations like that I have found typing something like 'Meals -$100 / 4 days = $25.00  Jan 7 - 11, works well.",
            "I relocated once and the company paid for a corporate apartment while I looked for a house. The Per Diem for food was $115 (in 1990s dollars) per DAY. There is no way I can spend $115 per day in a grocery store even feeding my spouse, two cats, and a dog as well.\n\nIt took me long enough to find a house so that the per diem went a long way towards paying my down payment. There were other folks who were in their corporate-paid apartments with per diem for over a year as they waited for houses *to be built*. The Account Manager was out of control with expenses.",
            "Ugh the bean counters. I work in the UK and would travel by train to visit customers. Company policy was you could only travel in Standard Class, not First. On about 30% of my trips, I could take the slightly slower train in First Class for significantly less money than the fast train in Standard. Company didn't care about saving the money, just that policy was followed.",
            "This sums up people in HR/accounting so accurately. Not a smidgen of common sense between them, and a stick too far up their ass to realise when dumb rules are smacking them from behind.",
            "Yo!  I'm in the exact same situation. It's $15 for breakfast, $20 for lunch and $40 for dinner. I've been having the hotel breakfast for free, a less than $10 lunch and for dinner I'll go out and spend $60 on a nice dinner. Got an email saying to stay within the company guidelines. I also go to the the supermarket some weeks like you did and get food for the week. My plan next week is to simply log the total amount for each day. Like $55 for dinner I'm going to put $40 for dinner and $15 for breakfast (leftovers). I'm kinda excited about this as I love being maliciously compliant.",
            "I fantasize about people enforcing these policies spilling hot coffee all over themselves.",
            "Had a new boss that was kind of a dick - while on a work trip a restaurant charged my card the day after the meal, thereby taking me over budget for that day.  It took so much paperwork to get him to shut up about it."
        ]
    },
    {
        "post_id": "p3cdsq",
        "author": "Madgerine",
        "title": "“Walk slowly so we can watch baby”",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p3cdsq/walk_slowly_so_we_can_watch_baby/",
        "score": 33342,
        "num_comments": 383,
        "created_utc": 1628813849.0,
        "selftext": "Years ago I worked at as a cocktail bartender and waiter. A group of suits came in and sat down and I went to take their order. I got a bad vibe off them from the get go and after I finished the order and went to leave this 30 something sleazy guy said loud enough for everyone to hear, “walk away slowly baby so we can watch”. I smiled at him and started to do an over dramatic slow motion back away, keeping eye contact with him and smiling the whole time. \nI told the other waiters about it and everyone started doing these slow motion walks whenever they walked past their table.  The best one was a bus boy who deliberately dropped something next to their table then did a very slow and sexy pick up like the ‘bend and snap’ from legally blonde. \n\nThey left pretty quickly.",
        "permalink": "/r/MaliciousCompliance/comments/p3cdsq/walk_slowly_so_we_can_watch_baby/",
        "comments": [
            "That bus boy deserves extra tips.",
            "I read this as “walk slowly, so we can watch THE baby” like it’s a babysitter",
            "Did the busboy maintain eye contact? 😆",
            "[deleted]",
            "You and your colleagues were awesome. Made me smile and laugh.",
            "Without a comma in the title, I was expecting a small child to play into this story.  Took me a second read to figure it out.",
            "I have a similar story. Old Guy we suspected of shop lifting came into our convenience store every now and then. Boss tells me to keep an eye on him. I try to be discreet but he started getting paranoid and asked for a manager as he was heading to the register. He yelled that I must be into him or gay as I kept following him etc. I was watching this from across our photo counter and he pointed and looked back and told me I was sick. Before he left he took one more look and I have him a nice air kiss and waved at him. Never saw him again afterwards and when I told my boss he couldn’t believe I did that 😂 usually the ones that freak out are the ones that have or are doing something wrong",
            "Brilliant .... and apparently effective. I would so love to have seen that.",
            "Well played. \n\nThis reminded me of a something that would happen at a bar I used to work at in the early 2000s. It was an unofficial policy that if a female employee was approached by someone who gave them a creepy vibe they should point to the nearest male employee and tell them that was their boyfriend. \n\nOne night this sleazy guy comes up to me and says, \"Okay how do you do it?\"\n\nI naturally asked \"Do what exactly?\"\n\nTo which he said, \"I've asked out four of you waitresses, and they all told me you were their boyfriend. How did you do it? Do they know about each other?\"\n\nHe's looking at me like I'm some kind of god because of this. Deciding to blow his mind I see a waitresses heading our way and flag her down. I guessed right that she was one of the four because that meant this guy had asked every waitress. \n\nI explained to her in front of the guy that he seemed impressed that they would all date me. I then asked if she minded if I shared my secret. \n\nNow playing along she says sure and she wants to see his reaction. So I tell the guy the secret is to treat the each like the Queens they are and while you're with them to make them forget about the rest of the world. In short, while you're with them they need to be your world. Do that, and the right women will be willing to take turns. \n\nAs I finished speaking the waitress leaned in and kissed me on the lips. When she leaned back the guy was walking away a thoughtful look on his face. \n\nThe waitress told me, after that performance, if I actually liked men I would ask you out. I just smiled and said, my lose then. Even years later it still makes me smile.",
            "*Slow clapping*\n\nThat's how you deal with douche canoes!",
            "Read one about student nurses and a sponge bath.    Long story short patie t demands sponge bath from cute younger girl \nTime passes and in walks a male student nurse who is over 6 feet 220 insisting on giving patient a sponge bath",
            "Oh my gaaaawd! The bend and snap! Works every time.",
            "They sound like some d-bag \"professionals\" - maybe junior executives -  who thought they were the greatest thing in the world.",
            "I’m a man, I appreciate physical beauty. I think just about anyone with a set of eyes does…but fuck this fucking guy. There’s a difference between seeing someone and admiring their beauty and being a sleaze ball about it.",
            "Points for the bus boy for sure. Not great job security but fuck it haha",
            "Came here for a story about a (literal) baby, got a story about a bus boy instead...",
            "The bus boy is the hero we all need in our lives",
            "Hahaha “oh my god the bend and snap! Works every time!”",
            "I hope the busboy got a free lunch or of that because that is hilarious",
            "Punctuation matters; I was halfway through the story before realizing there was no baby being watched.",
            "Best mc I've read in a long time. Great response",
            "Would only be topped if bus boy did this: https://youtu.be/dr6i4em2YQ4",
            "I would have just been like 'Alright, out. Fuck right off' but your approach was a million times better. High fives for creativity and teamwork lolol.",
            "Next time go the Quasimodo route and hunch a shoulder and walk slowly while dragging one foot.",
            "I like this bait-and-switch approach. Want to be creepy and sexualize the woman serving your table? Enjoy seeing this man's ass instead. It was awesome of your team to all get on board.",
            "Would have been a good time to fart.",
            "[The bend and snap](https://www.youtube.com/watch?v=X-4tIs00NvM)",
            "A man in the lounge at a hotel I waited tables at told the cocktail waitress \" I sure would like to get laid tonight\" She told him \" Why don't you just  crawl up a chickens ass and wait awhile\" All the employees rolled. She had a very thick southern accent it was priceless",
            "“30 something” \n\nFor the first time I actually feel old. \n\nWhat a douche tho. Ew",
            "Oh wow with the title I thought partway through reading this that one of the dudes was gonna ask you to watch his kid 💀",
            "That bus boy channelled a petty energy I totally wish I had.",
            "lmfaoo you always win with the bend and SNAP! lol",
            "At first I thought this had something to do with keeping your eyes on a baby.",
            "Bus boy for the win",
            "If there was at least one decent man among them you would have got a huge tip.",
            "The title led me to believe this was about a kid being scolded by a parent to tip-toe around their sleeping baby sibling so they can watch TV in peace. Lawd mein eyes will be the end of me.",
            "I love this. Great workplace solidarity.",
            "Taking longer to get their drinks is an added bonus",
            "Brava",
            "Bend and Snap!",
            "Not gonna lie, if I was the guy who told you to walk slowly, and then absolutely everyone did, I'd consider that a great story to be forever told.",
            "This fits r/sexistrevenge",
            "One of you should have walked on by giving the most evil eye with Phillip Glass' Koyannisqatsi playing in the background.",
            "When I read the title to this,  I expected an expose coming from a model who worked for a baby clothing catalogue.",
            "I lost it at the bend and snap. Bless the bus boy and all of your coworkers.",
            "That shit is hilarious.  I'm picturing Luis Guzman as the busboy.  Too bad he didn't go with a goat at the end..",
            "Came for the headline expecting entitled parents, stayed for the bend and snap. That’s awesome teamwork.",
            "I freaking LOVE that the rest of the staff was on your page like that!!!!",
            "I love this. Sorry that you had to deal with a degenerate perv though.",
            "The bus boy!",
            "Now that's what I call Team Work! ;-)",
            "I love your bus boy's response.  I can see it \\*perfectly\\* in my mind's eye.",
            "Good Lord what a bunch of disgusting, irritating, people\n\n&#x200B;\n\nYou handled that beautifully and your co-workers deserve many kudos for supporting your actions.",
            "When I read “bend and snap” I lost it! Great story.",
            "Priceless.",
            "Totally just visualized your too friggin cool busboy. Thanks for the image!",
            "The only reason men do this is to feel powerful for at least a little bit because they hate themselves so deeply that anything they can do to feel bigger when they’re so teeny is worthwhile no matter how obvious the self hatred is.",
            "Excellent.",
            "That boy sure was bussin",
            "Love this! They left. Huh. Thank you for making me laugh.",
            "Awesome, that's top tier industry trolling, nicely done! Glad your co-workers had your back!",
            "That bus boy sounds amazing!",
            "FUCK YEA!!",
            "Nobody puts baby in a corner",
            "My husband and I laughed so hard about the “ bend and snap”! We’re on vacation so I am reading these to him.",
            "I thought my family and I were the only ones to know about the legendary Bend and Snap.\nBless ♥️",
            "Haha that is amazing.",
            "Thank you so much for this, it totally made my day!",
            "Best MC I've read so far...\n\nYour team seemed brilliant and tight.",
            "This is one of those times where a comma would have really help this title",
            "Thank you for making me smile.",
            "Punctuation is your friend",
            "That title needs a comma after \"watch.\"",
            "I wish I had seen this!",
            "Y!AAAAAASSSSSSS!!!!!!🤪🤪❤🤠😵🤣🤣",
            "Then every-one cl-apped.",
            "👍👍👍👍👍🤙🤙🤙🤙👏👏👏👏👏👏👏",
            "How much did the watch cost them?",
            "Moe looks exactly like a human baby! 😂",
            "I love restaurant people lol. The best coworkers.",
            "Creeps like this need to have a bunch of ugly women flirt with them all the time; let them see how it feels.",
            "I don't get this at all, you got back at them by giving them what they wanted?",
            "Oh man, you walked slowly in front of them. ooooo boy you sure showed them.",
            "This might go on r/prorevenge",
            "/r/thatneverhappened",
            "Calling people suits? Lol\n\nYuck. Yikes.\n\nI guess I should generalize people in the service industry.\n\nEdit* will I be grouped in to this suit group because I wear a uniform?",
            "Ok.",
            "Well, no this didn’t happen, but like can you imagine if it had!? KARMA PLEASE!",
            "[removed]",
            "Can someone explain what this means cuz I don’t get it",
            " 🎤 drop",
            "Great 😆😆",
            "I love this so much. Well done.",
            "What does Reese Witherspoons flirting habits and a martial arts front kick have in common?  Bend...and snap!",
            "That is brilliant.",
            "If I were a patron I would have got in on the action. \n\nOr maybe just hit on them very aggressively. I figure if they are willing to dish it out like that, they should be willing to receive it. \n\nI just hope they don't double down because I don't actually want to have sex with them (but who knows, maybe it's what I've been missing?)",
            "The comments are as awesome as the mc ROFL",
            "Lol i wish there was a video",
            "Eats shoots and leaves",
            "This is my favourite MC in a while. Cheers, internet stranger!",
            "What a piece of shit",
            "Oh, I wish I could have seen that. It sounds epic!",
            "Where can I find this busboy so I can shake his hand?",
            "The only people who can do both",
            "Works every time!",
            "Amazing.",
            "Like a boss!",
            "Hahahahaha,",
            "Who brings their baby to a bar?",
            "Happy Cake Day!"
        ]
    },
    {
        "post_id": "jmwluu",
        "author": "E51838",
        "title": "\"Don't tell people you're leaving\" OK, I won't.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jmwluu/dont_tell_people_youre_leaving_ok_i_wont/",
        "score": 33287,
        "num_comments": 761,
        "created_utc": 1604352382.0,
        "selftext": "About 10 years ago, during my first full-time job out of college, I had a boss who decided she hated me. I'm not completely sure why, but she would go out of her way to make my life miserable. Demoted me to an overnight shift but wouldn't give me a reason, changed my shift around on a whim without notice (once changed my schedule for the next day after I had left without telling me, then wrote me up when I didn't show up on time). Stuff like that. She was a monster. So I was looking for another job.\n\nWell I found one, and I went in to give her my 2 weeks notice. This happened to be in the middle of a mass exodus for the company, as I was the 5th person to quit over the course of about 3-4 weeks. Morale was very low, and whenever anyone quit she would buy pizza for everyone instead of addressing why the place was so miserable and people were leaving. \n\nAfter I gave my 2 weeks, she said \"Don't tell anyone you're leaving.\" So I said OK, and walked out of her office and announced to all my coworkers \"Hey, guess what everyone! You're all getting pizza!\" and they instantly knew what had happened. She was very unhappy and I felt great. I served out the rest of my 2 weeks and she never spoke to me again.",
        "permalink": "/r/MaliciousCompliance/comments/jmwluu/dont_tell_people_youre_leaving_ok_i_wont/",
        "comments": [
            "In the US Navy, food is fairly crappy onboard ships. \n\nYou always know when any bad news comes up because the galley is serving “Surf and Turf” that night.",
            "Where I work we have a theater style popcorn popper in the break room. When they’re about to fire someone they start popping popcorn about 8AM so we can all get popcorn on our 9AM break. We usually have a good idea who is about to get sacked.",
            ">changed my shift around on a whim without notice (once changed my schedule for the next day after I had left without telling me, then wrote me up when I didn't show up on time)\n\nTime to start calling every 6 hours to make sure your shift hasn't changed, including one at 3 AM just to be safe.",
            "I once quit a job and was told not to tell anyone I was leaving. Like your workplace, there had been a large exodus and they wanted to keep it quiet. So, I didn't say anything, and there was never an announcement that I was leaving. People didn't know I quit until I started my new job and changed my LinkedIn; I got some very strange messages. Apparently this caused quite a few issues as no one else knew how to do my job.",
            "I guess she never had an exit interview with you to find out why you were leaving.  I take it the pizza is bought after the employee left.",
            "I had a boss who hated me. \n\nI gave my 4 weeks notice and I became very vocal about her decisions if I disagreed with them. I had nothing to lose. \n\n2 days into my 4 weeks notice period she said that day was my last day and I got 4 weeks paid out without having to work them.",
            "Yeah, this is a common workplace \"management\" strategy. If the workers are going to be unhappy, throw pizza at them. No care or human empathy, \"give the peasants their pizza.\"\n\nModern form of bread and circuses.",
            "My friend's work does a goodbye pizza lunch at a local place on their last day and they have a history of not telling anyone about someone's notice before the lunch is scheduled. So, to mess with his coworkers, he occasionally suggests to their boss about going out to the local pizza place for lunch as a group.\n\nThen he watches them all silently panic wondering if he is leaving! It's actually quite hilarious. \"I just felt like pizza today. I'm not quitting....*for now.*\"",
            "[deleted]",
            "I always tell my colleagues what I'm about to do before I hand my notice in.\n\nYou can't beat saying \"I already have\" when your manager asks you not to tell anyone.\n\nThey won't be able to spin this one if I get marched off the premises, as often happens to software engineers.",
            "Whoa, she cracked your \"code\".",
            "At my shop, we always have pizza when somebody leaves. If we have pizza on your last day, you were somebody that everyone liked. If we have pizza the day after you leave, you weren’t liked so much...",
            "Was it Pizza by Alfredo, or Alfredo's Pizza Cafe?",
            "where i live it is illegal to change shifts without ample prior notice, is it not the same everywhere?",
            "I once had a boss who wore a certain styled black tie the day he fired someone. We started realizing it after the fourth or fifth person. One day he came in wearing it, the DM came in, and they called me into the office...to promote me. Bastards.",
            "A single toxic person in management can cause a talent exodus that brings down a once flourishing company. I've witnessed it at numerous workplaces.",
            "\"Morale was very low, and whenever anyone quit she would buy pizza for everyone \"\n\nI worked at a place where the managers habit was to take everyone to lunch at the Zoo, then on the way back to the office, they would tell you they were terminating you.  We took to calling it \"Getting thrown to the lions\".",
            "I worked for a local pizza company that catered to one of the large insurance companies downtown. We’d go there twice a week during lunch. One day, we were told to bring less pizza because one of the floors was having a pot luck. Then a bunch of people were crying...turns out that pot luck meant they laid a bunch of people off while we were there. I was 18 and had noooo idea how to navigate that well. Was awkward AF.",
            "Oh man, I thought you were gonna say you worked your last two weeks and then everyone wondered where you were on day one of the third week.",
            "I worked at a startup where people would leave regularly. Our only notification was an email that announced a door code change. Then we would all look around a figure out who was missing.  \nOne day we all got the email, except one developer. He made a beeline for the boss's office, but it turned out they had accidently deleted him from the group email list. He came back very relieved, but but for a couple minutes it was a real 'aww sh\\*t' time for him.",
            "These bosses are the worst!  They look to fire the ones that they see as a perceived threat to them.  Good luck in your mediocrity once you’ve gotten rid of all the best people!  Idiots.  But hey, pizza.  It was probably some garbage pizza too like Little Caesars.",
            "Good for you! What is wrong with people????",
            "I was at my previous job for ten years. There was a four year run where each time I took a week off, I'd come back to learn that someone got fired. It became a morbid joke after the third time like \"BASA's going out of town, who's getting fired this time?\"",
            "I had a boss that informed me on christmas eve that he was firing me. He told me right before the company holiday party, and demanded I go to it and smile and pretend nothing was wrong or he'd not pay me my last paycheck. (He knew this was illegal, and also knew I didn't earn enough to afford a lawyer.) I was very popular at the company and he didn't want anyone to know I was going. So I did as he asked, smiled and was friendly at the party, ordered the most expensive thing on the menu and let him pay for it, waited until I got my last paycheck, cashed it, and called my coworkers to let them know what had happened. Some of them quit.",
            "I worked at a company that gave the firing responsibility to a mid-level manager with a sense of humor.  His M.O. was to use a child's toy clock - you know, the one you used to learn how to tell time?  Yup, if you showed up for work and there was a toy clock in your cube your time was up!",
            "surprised she left you go the two weeks, a lot of jobs here won’t let you go the last two weeks :/ and fire you right there",
            "Some places have an optional survey from the company headquarters HR, that bypasses your local division, asking why you were resigning or what prompted your departure. I’d love to see her buying pizza while your senior management is going, “another one quit because of what’s her face”",
            "Boss wanted me to quit, cut my hours to 15 hours a week but still come to n 5 days a week. With the cut, I lost my insurance I was cut to part time. \n\nI noticed the entry level position I started at, and no supervised was hiring. I applied and was told no guarantees and would make $10 an hour less while working those hours. \n\nDays later on lunch I was sitting in HR filing out application for my own department. VP I reported to asked what I was doing I told him. He asked what I used to do, I said I drove a small truck for an uncle. \n\nInterview came up, I wore a suit had resume and was in a room of people I trained who moved up the later and department boss. \n\nFired on the spot for gossiping about my situation but they know I can always drive a truck so no worries. I only told one person that!\n\nI HAD TO PUT ON A SUIT - TO GET FIRED",
            "Going the other way, I quit a job by emailing all-staff@company my 1 month notice of resignation prior to leaving for lunch. My phone was blowing up for hourrrs.",
            "Does every job have that one supervisor who the company keeps in place just to make people miserable?",
            "[deleted]",
            "My old job the moment you put in your 2 weeks they would take you off the schedule for those last 2 weeks you where there if the owner didn’t like you. \n\nOnce I had been hired in the new job I didn’t tell them about leaving till 3 days before starting and lied saying I was needed right away so couldn’t do 2 weeks and I was very sorry (I wasn’t). They just told me I could take a 3 day vacation and paid me my leaving check that same day.",
            "Man, reminds me of my movie theater job... Our company decided the lease on the building wasn't worth renewing and the regional manager tried to bribe us all with pizza to get us to come help remove things the company paid for including seating for 300+ people in 3 auditoriums. We first apologized profusely to the completely innocent GM who was still employed and therefore required to be there, and then proceeded to inform the RM of where, how hard, and how many times he could stick his stack of $5 Hot-N-Readies.",
            "A company I worked at had what we called \"Fire Fridays\" and we rarely knew who it was going to be. It was like playing Russian Roulette every Friday. Great way to start a weekend..oh and no sympathy food",
            "The HVAC company I work for in Atlanta fires people on the spot for giving a two weeks notice. I hate where and who I work for, I honestly wish the place would burn one night",
            "My boss took me and a coworker out for lunch when one of our coworkers at the time was being fired to make sure there wasn’t any....problems. Found out partway through my sandwich and somehow my brain started equating that place + going out to eat with *someone is being fired*. Yet he regularly takes us out and somehow my fear is still not assuaged what’s going to happen while I’m out to lunch.",
            "I worked in the office of a small manufacturing company with probably less than 50 people. Most of them worked in the factory part of the building. The cheap owner switched payroll services a week before Christmas so he could save a couple hundred dollars a month.\nThere were single moms, people with extended family expected any day, people leaving town for the holidays ALL of them counting on their paycheck the Friday before Christmas.\nBut because the owner changed services, it also changed the pay day which would be AFTER Christmas. This was announced during the potluck lunch typically planned a few days before Christmas. \nLegally, he couldn't do this but good luck contacting the dept of labor Christmas weekend.\nI thought people were going to kill him on the spot as we were only half way through lunch. Many of them weren't going to leave until he started writing checks.\nIt was bad. I wasn't happy either but I also had a 2 paycheck family and wasn't going out of town so I could wait a few days.\nWorst thing was he was surprised how pissed people were.",
            "Sadly.....I feel like I know this workplace.\n\nGroup homes for people with developmental disabilities?  The turn over sounds so incredibly familiar.....unfortunately....",
            "Relevant, ThinkGeek RIP\n\nhttps://twitter.com/timmystacobar/status/1146478091587469313?s=19",
            "I would have done the Pizza thing and told my new job I could start right away, then never come back.",
            "Whenever someone is about to get tossed the pink, our boss will randomly announce a barbecue for everyone on the coming Friday.",
            "I had been hoping you left and didn’t tell\nHer you were leaving so she had to write you up for no showing and lateness",
            "The Peter Principle looks like it's alive and well.",
            "Ah, buy pizza... I love that move. An uncreative attempt to temporarily boost morale for a day.\n\nIt just made me feel like I'm in middle school",
            "I had a manager hate me and it took me forever to figure out it was because I didn’t smoke. Like wtf.",
            "\" I served out the rest of my 2 weeks...\" like it was a jail sentence; which, in all fairness, it probably felt like ;)",
            "I’m currently waiting for my new job to tell me when I’m going to start before I leave my current one.\n\nOnce I know.. oh I’ll be telling everyone to put a mask on! My large retail company doesn’t enforce masks on customers.",
            "One of two reasons\n\nShe either hated you because you were a guy.\n\nOr if you were a woman\n\nShe hated you because she felt threatened by you in her \"realm\"",
            "That is pretty lousy to have a boss like that.   \n\n\nI had a boss similar to this, he just didn't like me for any reason. I was a good employee, on time, did my work, was social and got along with many people, just not Marty Murphy...if you're reading this, fuck you!  \n\n\nhe would find ways to call me out and threaten to write me up. We had 15 minute breaks, everyone usually came back between 15-20 minutes. If I got back to my seat after 15 minutes he would single me out, meanwhile half the team was still not back. I mean the guy was a total ass. Then I got news that my grandfather had passed on. He wrote me up and fired me for bereavement and said I made it up, even after showing him the obit article with my name in it. How he spun it was due to performance, etc. so it wasn't actually being fired for taking 3 days off to mourn the loss of my grandfather. Fuck Marty Murphy you piece of shit!",
            "Was therenpizza or not?",
            "It wasn't that hard pizza equal someone leaving  boy was she stupid or what.",
            "I used to work at Home Lowes Depot. They had a tradition whenever someone was quitting they would lay an apron with their name on it in the breakroom and everyone would sign it and write sweet phrases with black marker.\n\nWhen it was my turn to quit I put in my 2 weeks and told my coworkers but didn't put an apron out, I was curious to see what would happen.\n\nNothing happened.",
            "When i left my company, i bought everyone pizza too. Guess thats a thing everywhere.",
            "Out-fucking-standing.",
            "Fuck a 2 week notice.",
            "Why bother giving any notice at that point? You already had another job and your boss already hated you.",
            "Doe your name happen to be toby and your boss named michael...",
            "**whats that under your chair? PIZZA**",
            "\"Don't get emotional about shit\"\n\nEdit: They*",
            "From what I understand, you don't have to give this 2-weeks notice, right? It's just considered polite. Why didn't you just quit outright?",
            "Handed in my notice a few days ago, was also told not to tell anyone. Not even at the last day, no farewell allowed. I'm supposed to call it a long holiday or sabbatical to make sure nobody else panics.\n\nMy new work is across the street from the old place.... I'm actually getting an office with an all glass facade facing towards the old place. On the ground floor. It's not mirror glass. \n\nI hope my head doesn't fall off from grinning watching the old chaps roll into work.",
            "I can't imagine what hating free pizza feels like, but I think a few weeks of that and I would get it.",
            "\\> once changed my schedule for the next day after I had left without telling me, then wrote me up when I didn't show up on time   \n\n\nI had a boss do that but in such a way that I missed 3 shifts and was considered a \"quit\".    A month or so later they fired her and the new manager called me up and asked me to come back!",
            "One of my old bosses sang \"another one bites the dust\" about an employee leaving after serving the company 10+ years.\n\nThat's the day I stopped caring about the company",
            "I used to work for a hotel that bought us pizza and a gallon of thriftys ice cream when bad news was coming. Usually it was we had to close down to fix safety regulations or something for a day. Really all I heard is \"You're giving me pizza, ice cream and a day off away from customers?\"",
            "Someone told the story if someone left they got a cake, fired no cake. They weren't allowed to say if they were fired or not so they asked, \"will there be cake?\"",
            "You wouldn't happen to have worked at medical testing company, would you?\n\n\nBecause my wife had a female manager who was just evil and would buy pizza when someone quit...\n\nThey had a mass exodus there too because the owners were idiots.",
            "If your leaving or staying..\n\nThe company can do fuck all about it.",
            "Reminds me of this meme:\n https://www.reddit.com/r/meirl/comments/alxw0f/meirl/?utm_medium=android_app&utm_source=share",
            "r/deliciouscompliance",
            "> and she never spoke to me again.\n\nShe even gave you a reward!",
            "When I worked retail, my manager would release the rota on a specific day, and it if changed after that day she would call or text. As easy as that.\n\nThe only reason I can think for not doing that is because you care more about getting the chance to berate someone than you care about the success of your business. How utterly lousy. :(",
            "Its so strange reading all these comments about how the employer buys the employees food after they've fired someone. My job just tells us if we see the person they fired near the building, don't approach them and call 911.",
            "I worked at a place where if you had your yearly evaluation on a friday, you were gonna have a bad time.",
            "Can anyone shed some light on why the hell companies are so secretive about people leaving? Everybody will still know eventually, just later. If everybody delays the news it will be the same identical stream of bad news, just delayed by two months, two weeks, or whatever everyone's notice period is.\n\nNot to mention the inconvenience of planning your work with someone who's secretly not even going to be there.",
            "Did she buy pizza AFTER someone leaves!? As a manager myself, I say that is garbage! \n\nNothing says you don’t value employees more that celebrating someone’s leaving after they leave. Even if I don’t care for the departing employee, I will still wish them well on their future endeavors. The Pizza should come the day before they leave! \n\nOn another note, disciplinary action should never be a surprise. Expectations should be set long before disciplinary action is taken. Those expectations are set by policy, consistent enforcement of that policy with everyone, and a discussion had with the employee before discipline escalates. \n\nPoor leadership like this is why I won’t leave my role in leadership. I can’t fix everything, but I can help people within my realm of influence. I really suggest that anyone with the desire to change things for the better go into leadership themselves. It’s trying, but also very rewarding.",
            "Damn, stone cold Steve Austin over here bahaha"
        ]
    },
    {
        "post_id": "s4vdcu",
        "author": "WhoSc3w3dDaP00ch",
        "title": "\"Reconsider working here if I want to take a honeymoon? OK!\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/s4vdcu/reconsider_working_here_if_i_want_to_take_a/",
        "score": 33035,
        "num_comments": 696,
        "created_utc": 1642283739.0,
        "selftext": "I had a manager who hated reading emails and would miss important issues/meetings because of it. I even suggested text to speech to make it less unpleasant but he told me off. He spent a lot of time \"playing golf with clients\" and was mostly inaccessible. It got to the point where most of the team cc-ed me (I was next on the totem pole) so I could grant approvals for stuff like expense reports and help out on projects my manager was supposed to work on.\n\nWhen I was getting married I requested 3 weeks off for my honeymoon (EVERYONE knew I was getting married, manager even congratulated me on the engagement when it happened). I had 5 weeks vacation accumulated and didn't think it would be a big deal, especially since I was requesting it nearly \\~8 weeks in advance.\n\nThen a \"vacation request denied\" email comes in from our \"time off\" system. I emailed manager following up, left voice mails, and after a week he finally replied to an email,  \"Look, we need dedicated people, if you think you can take 3 weeks off for a vacation, you need to reconsider your position here.\" Keep in mind, my request stated \"Vacation request for honeymoon.\"\n\nI replied with \"No consideration needed, my last day will be <date in 3 weeks>. Let me know about transitioning duties.\" I forward this to HR, cc'ing manager and HR sets up my exit interview, but HR tells my manager to setup transition for my responsibilities. During my notice period, I even replied-all to this email twice, asking about transition plans, since I didn't get any transition plan...\n\nI tell my team, they ask manager what to do with my duties and manger says he'll think about it but doesn't do anything nor email anything out.\n\nFour weeks later, I get a call from my old boss, \"Are you planning on coming in this week?\"\"Why would I?\"\"Because you work for me?\"\"Not as of last week.\"\"Stop messing around, get your ass in the office.\"\"I told you my last day when you denied my vacation request.\"\"How about giving proper notice and transitions?\"\"HR asked you to develop a transition plan and to attend my exit interview. It's not my fault you don't read all your emails.\"\n\nI hang up and block his number, but screenshot the call log and sent it to the HR contact with an innocent, \"Should I be worried <old manager> thinks I still work for him?\"\n\nFallout:Things went from bad to worse for my old manager.  Apparently I was doing most of his managerial duties, so he actually had to try and get stuff done himself. He also got into some legal issues (those client golf outings? he played golf...but not with clients) that made his termination \"with cause,\" so no severance for him.\n\nI ended up at a competitor with a nice bump in pay. I wanted to start after my honeymoon but new company really wanted my help on a pitch.  I joined for several weeks, reworking \\~1/3 of the pitch and then went on my honeymoon for three weeks (they paid me for the entire time off - that garnered a lot of good will from both me and my wife).  I only left the company because mrs and I moved cross-country and they didn't have remote positions back then.  \n\n\nETA: Thank you for the awards!   \nI don't have the all the details but know old manager had to hire lawyer**s** to deal with legal issues related to his dismissal and the expenses.  \nClarification: This happened in the late 2000s. Mrs and I are still married.",
        "permalink": "/r/MaliciousCompliance/comments/s4vdcu/reconsider_working_here_if_i_want_to_take_a/",
        "comments": [
            "[deleted]",
            "It baffles me that bosses don't realize that if you want time off for a very important event that you will take it no matter if you have to leave.\n\nI think the way to go is \"I will be taking 3 weeks off... you can let me know if I have a job or not when I get back.\"",
            "Never give an ultimatum you're not prepared for the other party to take.\n\nGood job OP. Fuck that guy.",
            "I joined a company specifically because it was significantly closer to my fiancee's house (where I'd be moving).  I told them I needed a month off for the honeymoon *at the interview*.  Week before wedding, and I'm told I can't take four weeks in a row off due to company policy.  I put in my notice.  Next day, boss comes in and says, \"I had to send that email as it's company policy, but you can have a month off if you don't tell anyone.\"\n\nUh huh.",
            "How did the exit meeting with HR go? \n\nI can't imagine they didn't comment on manager's lack of responses and not being there. Seems like that would have giving you ample time to *innocently* share info.",
            "He gambled and lost. Never took you seriously until he found out he had to do his own job. Then the company found out what he was doing and fired his ass. \n\nBad bosses never win in the long run.",
            "Worked at a place that claimed worknlife balance.  Yeah 6mo on the road 6mo home.\n\nThey knew for months about mu wedding/honeymoon.  Last second job came up and I was like nope can't go.\n\nI was told my personal life was getting in the way of the job.  Yeah I wasn't committed to staying after that.  I did stick for a bit as I could travel to wherever in the weekend (long distance relationship) building up hotel points and airline miles.",
            "He definitely fucked around. And he definitely found out.",
            "I understand that people do all sorts of filthy stuff for money, from prostitution to plumbing, but I draw the line on playing golf.",
            "I’ve been saving up PTO for my honeymoon this spring and let my managers know as well. So far no issues but I’m fully prepared to do the same if necessary!",
            "I'd be the most pissed about not being paid the 5 weeks vacation I had accumulated.",
            "Man imagine having a job where you got such no oversight that you can go take 3 hours 2-3 times a week to play golf and nobody sees it.\n\nThat guy had a golden job and fucked it up",
            "I love golf and play regularly but know people so obsessed they will literally let it ruin their careers and their marriages. WTF! Get some perspective people!!",
            "This reminds me of a company I worked at, one of my team members applied for two week's leave for her wedding. I approved of course, but in a call later with the CEO -- she said, I can only congratulate her, but this is terrible planning. Imagine the load on the remaining team when she's not around. Thankfully, she didn't say anything to my team member. \n\nMy question is, why can't we just be happy about people instead of making a scene about oh who's gonna handle your workload. Isn't it the company's concern to ensure people can take their entitled leaves? \n\nCorporate culture sucks. 😑",
            "It's funny how people who are barely functioning adults weasel their way into managerial jobs.",
            "I'm glad for you OP!\n\nOn one of my jobs, my (extremely boomer) boss insisted that we should arrive at least 30 minutes earlier because she believed that the clients shouldn't see the employees arringing to work after them. One of the colleagues arrived like 45 minutes earlier to suck up a bit.\n\nI have to mention that people who would arrive earlied did no work whatsoever, they would just sit, waiting to start working - also the boss would always hold them up by chatting, so they would usually start working 10-15 minutes late, and they would later get criticized for keeping the clients waiting. And if they said that they have to go - they would be \"rude\".\n\nAnyways, when negotiating my employment, I was extremely up-front that I will be starting my work on time, however, I won't be arriving 30 minutes early. And the type of contact was similar to part-time, pay was good, however, I only got basic health care. Because of the type of contract, there was no 2 weeks notice.\n\nI do have to say that when covid began I updated her business model, and basically saved the company since she was on the verge of closing it down and firing everybody. After literally saving her company, she started becoming increasingly hostile, once stating that I was trying to undermine her authority and things like that. Which was extremely far from the truth.\n\nNow that being \"late\" part. I am a bit OCD about some things, which translates to me never being late to work in my life so far. I live like 20 minutes (on foot)away from that workplace. It takes me less than 10 when cycling/driving. So i usually show up like 10 minutes early, set everything up and I start working the moment my shift starts.\n\nOne day, I arrive like 10 minutes before my shift starts, she starts criticizing me how i'm not a team player, how I'm always late, how others are parents but still make it 30-45 minutrs before the shift starts even if the have families at home waiting for them.\n\nI'm shocked but i keep it cool and say that we should keep it civil and that we can settle it in private.\n\nAfter that she continues having a meltdown and asks me what's my problem?\n \nTo which I say something like \"let's focus on your problem which is finding somebody to deal with 25 clients I have scheduled for today\", pack and leave the office.\n\nShe actually called me to berate me and order me to come back to which I told her not to call me again or I'll be reporting her for mobbing and harassment.\n\nAfter I left, within 2 months, all of my former coworkers have left her and now she is working with her husband and her daughter as employees. Heard that the are not having a fun time.\n\nAnd, like 3 weeks after I quit, started working for a new company, for double the salary, amazing benefits, 2 types of health insurance and I just got my second promotion, and I'm working from home, most likely won't be going back to office, even after the pandemic ends.\n\nAnd I have like 32 days off per year, plus paid leave, the job is stress free and most importantly amazing management that really values us and are doing their best to help us achieve our goals and are actively working on our development. And we also have mental health days - how cool is that? Used them a few times - said I'm feeling kinda stressed, and day off got approved right away, and nobody even mentioned it when evaluation came up.\n\nIt's not always easy, but going out of your comfort zone can really be a life-changing experience.",
            "r/antiwork will shower you in golden medals if crosspost this story there.",
            "Was close enough at one of my previous jobs to be a CSO/CTO, but never got the official nod. It was always unofficial, but I had the hire/fire power tbh.\n\nOne of my juniors makes a change without anybody knowledge nuking the linux server. Apparently, one of my bosses had given him the root passwords for troubleshooting but never informed me.\n\nCEO calls threatening and says he'll fire me. Put my papers in the next 10 mins, since we're under lockdown, I also notify Employment Ombudsman regarding workplace malpractice and bring hell for them during the notice period. One of my other juniors quit 3 months later citing sexual harassment. \n\nLast I heard about them, they've a terrible attrition rate and none of their clients are happy with the work.",
            "What a prick.",
            "That story gave me a nice warm, happy feeling.",
            "I'll never, ever understand this line of thinking from managers. A time off request is a courtesy. I'm not going to be here on X, Y, Z dates so here's my notice about that. Plan accordingly.",
            "Very nice.\n\nI did something similar but not quite as malicious.    Got engaged, requested to use both of my 2 weeks of vacation consecutively...for wedding and honeymoon.    Was denied, told I couldn't take both weeks under any circumstances.   He even told me I couldn't take EITHER week during the summer months, we were short on people in my role and summer was a busy time.   \n\nSo instead, I took one week in April and one in May (wedding was in July).   Turned in my 2 week notice 2 weeks before the wedding (it would have taken 8 weeks to properly train a replacement).   And interviewed for new jobs.    Got back from my honeymoon and started my new job the next day.   Oh yeah, the new job also paid $6k a year more.\n\n\n\n (Side note:   I had never taken even a single week of vacation in my 2 years working there.   First year, no vacation time given.   These 2 weeks were at the tail end of my second year.   And I requested the time off 6 months in advance.)",
            "Old Boss:  \"Yeah I'm playing golf with clients.  Their names are Mr. Chip, Mr. Putt and Mr. Lomg Driver!!!\"  LMFAO",
            "Any time an ultimatum gets thrown down the relationship is already over. This is true for all relationship types.",
            "Exact same thing happened to me, except for our actual wedding and I was a contractor. The company I worked for and the company I was contracted to both knew I was getting married and when. Suddenly the week of the wedding they don’t know if they can “do without me” as it will shut down the whole job site. I was like “well you can be shut down for two days or you can be shut down until you find a new CWI”. That was the last I heard about not making it to my own wedding, although they tried the same stunt with our ‘honeymoon’ (which was actually just an extended weekend trip to see friends in the next state).",
            "This is just SAD. What a fucking loser. The ONLY reason he denied your vacation is because he didn't want to have to pick up the work you were doing for him for 3 weeks. So he figured he would just bully you into not going. Very satisfying ending.",
            "It's insane how many managers get away with not doing their work because the next in line does it all for them. Saw this in my current position. They just demoted that manager and all the higher ups were freaking out when her second in command stated she was looking at other positions within the company.",
            "So much in life can be prevented by figuring out when you have a \"go to\" guy and not fucking that up.",
            "So did he get sued or just fired?",
            "Sounds like the former manager of our California office.  He was terrible about responding to emails.  We came to find out his assistant managers were doing the majority of the work and he never even bothered to learn how to do several of the tasks he was supposed to be doing.  \n\nHe was also having an affair with one of the temps who worked for him and having sex in his office during work hours.  He threatened to fire anyone who knew what was going on if they told on him and was bribing them to keep quiet.\n\nOn top of all that, he was keeping a separate account with one of our supply vendors and wasn't sending the invoices through his boss for approval.  This vendor sells higher-quality products and gives you free gifts at spending levels.  So, he would spend a ton of money on office/cleaning supplies with them and give the free gifts (things like a jacket with a sports team logo, a charcoal grill, a bluetooth speaker, coolers/mugs, etc.) to his subordinate girlfriend or to the office employees to keep them quiet about said girlfriend.  \n\nEventually, someone made an anonymous call to HR and blew the whistle on what he was doing.",
            "I asked for a single day off 4 weeks in advance, denied, something pissed me off 2 days before the day I wanted off. Walked into the office and said I quit, see ya. I heard “can you Atleast finish your shift” as I was walking away, didn’t even turn back to look at them. Felt great.",
            "Good for you man, you handled it well even though I'm sure it ate away at your conscience/elevated stress during that time. Felicitations on your wedding!",
            "Manager played fuck around and find out and lost",
            "I think you will find this story of quitting for a honeymoon relevant:\n\nhttps://www.reddit.com/r/MaliciousCompliance/comments/8jvuwd/i_dont_work_there_anymore/",
            "Now imagine the manager reading this post and cringing realizing it him…",
            "Stories like this are why I really enjoy this sub. Great story!  Thanks for zinging the bad manager.",
            "Good for you. Fuck that guy.",
            "Average IQ move: accept vacation request and keep golfing off at work indefinitely\n\nBig brain move: deny vacation request, get caught for using work time for playing golf, get fired without severance\n\nmiddle management sure work in mysterious ways",
            "I always say loyalty to a company isn’t given, It’s bought. We work because it pays our bills.",
            "Since he wasn't able to do his own job of course he had to deny your vacation and simply hope you accepted it. What a fool.",
            "Boss didn’t want you going on vacation cause he knew you were doing his job, basically?",
            "Sounds like he couldn’t even bare to do his own job for 3 weeks while you were away and basically blew his cushy position big style.\n\nGood for you for sticking to your guns.",
            "I was working for a software firm. My regular job was assisting our clients with billing issues they were having with our software. All remote because of the panoramic. Got a call one day that they wanted to assign me to a new project. Came with a nice bump. I accepted the assignment, which would run alongside the work I was already doing. \n\nThis new work was billing our clients. The person quoted was doing the work before, had screwed up setting up accounts and none of the invoices had gone out. Within a few days, I had gotten all the current invoices out. \n\nOne of the VPs asked me to work with the sales director to get a list activities completed. The director and I had several emails go back and forth along with a string of text messages (I make sure I am able to document everything, so I am adverse to phone calls). A couple of days later, we have a meeting with th VP, and he asked the director if we had taken care of the activities. The director said he had no idea what he was talking about. \n\nRight there, I said \"would you like me to provide al the emails and text messages?\" This guy has a history of gaslighting. I added \"don't gaslight me\".\n\nI then texted the CEO that I would gladly go back to the activities I was doing before. You can keep your raise. Director will not be allowed to gaslight me. Got a call the next day from the director saying the tasks he was working with me on, had been assigned ro one of his team members. Never worked with him again.",
            "Good on you for putting your foot down and setting priorities for yourself, your life is significantly more important than your job so it makes sense you’d be willing to do anything to keep your life",
            "I respect your self control not to throw in an insult before you hang up.",
            "Nice. Too many of those types at the top. Love hearing one of them getting taken down.",
            "OP, good job 👌👍",
            "They never get rid of the losers until something like this happens, as if there werent 100 other red flags they ignored. It's rotten all the way up.",
            "r/antiwork\n\nThis story needs to be posted there!",
            "Nice.\n\nMy favorite part of this is that you are still married. Which probably has a lot to do with you proritizing her over work. Well done!",
            "And the best part is your job has to payout all your unpaid PTO, so now they have to give you 5 weeks all at once instead of 3 weeks at the normal intervals",
            "That's so satisfying,  thanks op.",
            "Man this is giving me a strong want to quit my job for similar reasons, but I have no alternatives right now.",
            "Fuck that manager. You're a saint. Well done. Congrats on your marriage.",
            "Haha these poor idiots really don’t understand just how different the dynamics are these days when it comes to boss/employee relationships.",
            "How do such inept and moronic people end up in charge of anything let alone as high up as this guy?\n\nI read/hear shit like this so often it boggles le mind.",
            "Isn't Sunday a working day in Saudi?",
            "That's what we call justice.",
            "Absolutely delicious",
            "Love how you basically went [Toby Maguire on him](https://youtu.be/pJTGAtLH7Hw) when he needed you to do his job after you quit.",
            "r/antiwork would love this.",
            "yeah quit that job immediately and take your honeymoon.  never ever put work before family.",
            "I'd have said he sounds like my Uncle but he owned his company so when he fucked off to play golf no one could say shit. 🤷",
            "r/antiwork would absolutely love this",
            "That manager had been getting away with that shit his entire career, of that there is no doubt.",
            "Boss move, OP. How did you get around with those heavy brass balls?",
            "I'm happy for those last six words! Take care!",
            "I always got another job lined up before I quit.  Didn’t ever like the the old job enough to stay at any raise. Let ‘em stew!",
            "Oh, that last paragraph, but not the lead up.   Had one job end, long notice layoff, so I was already in the end game of getting a new job when that one ended.  \n\n\nPart of the interview process was my informing the new employer \"I've had month long trip to Australia planned for 3+ years.   I can start on July 5th (1 week after my previous job ended), then be gone, without pay for August,  or I can start on Sept 5th, after I return from the trip.\"  \n\n\nThey had me start on July 5th.   At the end of the month I handed my boss my Leave of Absence papers (which HR said they'd need for me to have the month off without pay).   He tells me to enjoy.  \n\n\nI come back, go to HR to tell them.   \"We never received the paperwork, so were you gone?\"  \n\n\nGo see my boss.  He pulls the paperwork from his desk.  \"You mean this paperwork?\" and dumps it in the circular file.",
            "OP got paid twice for his honeymoon. Niiiice.",
            "THIS IS THE WAY.",
            "This!  This is why this subreddit exists!  I don't want to hear about lazy and inexperienced \"kids\" complain about the reality of work.  I don't want to hear about people demanding instead of asking for time off.  I don't want to hear about you giving it to the man by quitting on the spot rather than provide at least a two week notice.\n\nThis is gold.  You were a kickass worker who went above and beyond in not only your own duties but that of your boss's as well.  The last minute change (on your boss's part) was unacceptable to you and you followed the right route in quitting and setting the company up for success like a gentleman.  Despite all this your boss still fucked up and ended up screwing himself.\n\nI love it.",
            "This is great. Though I don’t think 8 weeks is much notice for a 3 week vacation? I think that’s the minimum I’d give for such a long time off",
            "r/antiwork gonna love this one",
            "PSA: Get a call recorder app on your phone.  I've found it handy for reviewing a conference call I've had when I missed some notes.  Could also be handy when your old boss calls and bothers you after you leave.  Both of my phones are Android and I like the app called ACR.",
            "r/Antiwork",
            "I've read this one before...",
            "Your boss sounds like a total idiot but, with all due respect, trying to take off 3 weeks in off in a row in America is almost always going to get a “no” from management.",
            "This sounds like a great post for r/antiwork",
            "Please cross post this to r/antiwork cause this is perfect",
            "r/antiwork",
            "[removed]",
            "Nice move although I gotta say I've never heard anyone in 30+ years of working take 3 weeks off at once.",
            "r/antiwork",
            "Just nitpicking but Russia is a \"rainbow computer\"?",
            "That sub can’t think r/wtf is a sub for telling people you left a gap the size of Ireland) is already one of the, if not then Yae is trash",
            "Posts like these are why I keep scrolling on reddit",
            "This is clearly mislabeled, hardly a M!"
        ]
    },
    {
        "post_id": "q06h5r",
        "author": "Ihavenofishonlywater",
        "title": "Won’t cancel my internet unless you’re unable to provide service? Ok…",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/q06h5r/wont_cancel_my_internet_unless_youre_unable_to/",
        "score": 32973,
        "num_comments": 1254,
        "created_utc": 1633219230.0,
        "selftext": "So, when I was living in the city, I had a contract with my internet provider. (Rogers, for my fellow Canadians) After a year in my apartment I decided to move in with my then-boyfriend (now-husband) on a farm. A farm on a dirt road in the middle of nowhere. So I call to cancel my internet. \n\nMe: I need to cancel, I’m moving-\n\nThem: (interrupting me) your service moves with you! You signed a contract for x years and it only ends early if we are unable to provide service!\n\nMe: you ARE unable to provide service, I’m moving to a rural area. \n\nThem: not possible! We provide service to many rural communities. What’s your new postal code? (I provide it) that’s for townname. We have service in townname.\n\nMe: but I’m not living in townname. That’s just my postal address. Im living on a farm OUTSIDE of townname.\n\nThem: repeats contract speech, with the additional offer of an absurd buyout fee if I want to cancel my contract early “without cause”\n\n*cue malicious compliance*\n\nMe: fine! You know what, I would LOVE hi-speed internet instead of shitty satellite internet! When can you come?\n\nThe install guy had to call me three times from the van. Twice because he was lost and a third time because he was stuck in a snow drift. When he finally arrived it took him about 30 seconds to determine that there is obviously no infrastructure for hi-speed internet. I offered him hot coffee for his trouble coming out and he happily cancelled my service free of charge and accepted my equipment return. Cost Rogers a 3-4 hour call out when you count the drive, just to try to keep one impossible contract.\n\nEdit to add: Wow, this went a little crazy overnight! Thanks for all the upvotes and awards everyone! :)",
        "permalink": "/r/MaliciousCompliance/comments/q06h5r/wont_cancel_my_internet_unless_youre_unable_to/",
        "comments": [
            "I had the same issue with Rogers mobility. \n\nMoved to a town where their cell service w\nIs horrible, but Telus is half decent. \n\nAfter 45 minutes to an hour of being bounced up the ladder I get to someone that would make a decision. \n\n“This postal code you’ve given me makes it look like you’re in the middle of the woods and our tower is on the other side of a mountain from you?”\n\n“Yes, because that’s where I live.”",
            "I had a similar conversation with my internet provider when I was moving, until I cut them off and told them “yeah, well I’m moving to Bucharest Romania…you provide service there??”\n\n“Okay sir, your final day of service will be June 16th”",
            "When I lived in Ottawa, an internet company named Fibrestream offered my building select plans.\n\nIt was like $40 for unlimited bandwidth and 100mb/s or something like that.\n\nI was paying rogers like $60 for 300gb and 30mb/s.\n\n\nI called up, said listen, I got this offer. Match it, or I'm leaving. Their retention offers were legit laughable. One was like $90 for unlimited at 20mbs. I genuinely couldn't believe it. They wouldn't let me cancel officially without my wife as she was on it too.\n\nSo when she calls and cancels, you know what the rogers CSR said? \n\n\"You'll be back.\"\n\nWe made an absolute point to not support rogers after that. They will get my business only if I have zero other choices.",
            "We had something very similar with sky in the U.K.. ‘we’d like to cancel as we’re moving!’ \n\n‘Sorry sir but we can’t do that as your service moves with you and you’ve got 9 months left on this contract, it’ll be £££ if you want to cancel ’ \n\n‘You don’t work where we’re moving to though’ \n\n‘We do all the U.K.’\n\n‘Ah yeah but you see we’re moving to the Isle of Man and you don’t there’ \n\n‘Ah yes, you’re right there sir.. we will go ahead and cancel that contract for you as we don’t provide a service to the isle of man’",
            "[deleted]",
            "Two stories about Rogers. We moved to the territories and they agreed to cancel service, but continued to charge us for MONTHS every time requiring a call to fix it.\n\nSecond, my dad worked for Rogers and his work van was parked in our driveway. More than once we had people at our door to complain or ask for help. They really are the worst - terrible employer, too.",
            "Ah, that reminds me of when I moved over a decade ago into a new apartment, the cable company I was using insisted I shouldn't cancel my service. In their defense, it *was* just down the street.\n\nThe wiring in the building was bad. It was so bad you could not get regular cable *television* to display, forget internet.\n\nBuilding owner refused to allow people to fix the wiring because it'd have required them to *punch holes in the walls.* Town ordinance refused to allow anyone to have externally visible wiring. ... Totally unconvinced, cable company sent a technician who noticed the same obvious impossible to solve problem I did, and canceled my service.",
            "SMH. My relationship with Rogers unfortunately has been a hit and miss. Back in 2013, my boyfriend of 4 years was on my Rogers account. Unfortunately he passed away suddenly due to a heart attack in his sleep. You can imagine the pain and distress I’m going through. I managed to get enough strength to call Rogers, requesting cancellation of his line. The rep proceeded to tell me how much it was going to cost to cancel his line. I took a deep breath and told him that the person whom the line was being used by is dead. Rep didn’t even flinch and proceeded to repeat the same speech about cancellation. At this point I’m just angry. I request to speak to a supervisor. One comes on the line after however long, I explain the situation to her, and guess what?! SHE PROCEEDS TO SAY THE SAME SHIT!!! At this point I’m just crying angry tears. I request to cancel everything I have with them, which at the time, being a Uni student wasn’t much. I found their corporate head office number and email, sent them a long email regarding my experience. Within a week, someone reached out, apologized for the prior people’s insensitivity, offered up condolences, cancelled my boyfriends line and proceeded to provide my remaining services (which I believe was my cell phone and internet) 6 months of free service. I’ve remained with them since. Of course I still have to deal with the occasional idiotic rep here and there, but once I get through to management, I end up with what I want.",
            "I took a fifteen year long bumming from at&t on my mobile account.  When I moved to the mountains I called to cancel since Verizon is the only game in town here.  I was like an hour on the phone with multiple people trying to all upsell me WiFi or internet or anything else at all.  \n\nYou don’t serve this area for what I need.  We done here.",
            "[removed]",
            "Had a similar experience with comcast. I was living the in the states and was moving back home. Called to cancel, all was going well until we got to the forwarding address.  \nAgent \" I need your new address\" \nMe \"ok, \" gives new British address \nAgent \" it needs to be an American address our computers won't accept a foreign address\" \nMe\" I don't have a new American address. Only the foreign one\" \nAgent \" well where will you be living if you don't have an American address?\"\nMe (very confused) \" at the foreign address?!?!\" \n\nApparently, they canceled with out the check as they couldn't send someone aboard haha",
            "I worked for Rogers\nAnd had a customer with this issue\n\nI cancelled their service\n\nBoy did I get in trouble \n\n\n\n\n\nWorth it",
            "Had the same problem with AT&T in the US when I moved with my now husband. Called to cancel my service as we were moving in together, and they didn’t cover where our new house was. They had to send out a technician who promptly said “we don’t service this area.” No — really?!?",
            "I was that tech once. Got called out to the far end of a rural road in a developing part of the county. Went from pavement, to dirt, to gravel, to dirt again. I saw the electricity poles end about 1/4 way down that road. \n\nJust like yours, somebody was insistent on offering them service. One call later their address is marked as not serviceable, and I trotted off with an ice cold water bottle and Gatorade. \n\nYou gotta do what you gotta do. Thank you for being nice to the tech who got sent out there. We just get a list of addresses and figure it out as we go.",
            "I briefly worked for Rogers and got a taste for how inflexibly asinine most of their policies were. Made it work *for* me once, though: when I got my first HDTV (dating myself here, but whatever), it came with a deal for a free HD cable box. So I called them up, they say they can ship it out in two weeks (no) or I can go pick one up at a store nearby. I say that sounds great, they give me three nearby locations with boxes in stock.\n\nAfter visiting them, it turns out *none* had any boxes in stock, and the employees complained that they had been trying to correct the false inventory for ages with no effect. I feel for them, give up on this, and call Rogers back to say \"fuck it, just mail me one in a few weeks\". But the person tells me that no, since I said I'd pick it up, I am now inexplicably ineligible to have one mailed out.\n\nI just say \"okay\" and hang up. Then I call back, and ask for Customer Retention. Customer Retention is the hellish department that you get transferred to when you try and cancel, whose internal metrics are solely based off of \"did the person cancel? if so, you did badly and can be fired\".\n\nSo they pick up, ready to be yelled at (since that's the norm for those calls). Instead, I calmly explain my current situation, and I can hear the person getting a bit confused. At the end of my explanation, they gently try and tell me that they're not the right department for this issue. I then correct them, asking what I am expected to do with TV service that no longer works on my TV.\n\nI can *hear* the gears turning. Because unlike 99% of the people who get sent to Customer Retention, I actually *wanted* to keep my service. I was a deliberate, easy win for this guy. **And,** Customer Retention actually has a shocking amount of flexibility in what they can do for customers (the kind of flexibility that customer support should have *before* people try and cancel).\n\nSo they suddenly ask, \"How's the signal on your cable TV?\" And I admit I'm confused, since I don't have it hooked up right now. \"Hmm. Sounds like there might be noise on the line. I'll have a tech sent out right away to check the cable for noise on the line, he can be there in under an hour. *Oh, and he'll also be able to give you a new HD Cable box.\"\n\nSure enough, in less than an hour, a Rogers van pulls up and the tech blatantly knows that he's being used as a delivery service. Hands off the box, half-asses checking the line, \"Yep, it's clean. Later.\" and heads off.\n\nRogers is a solid block of bullshit, *but* there are ways to exploit the beast.",
            "Got a similar story (different country), but I did actually move to a zone where they had service.\n\nThe issue, you ask? They didn't send the tech... THREE F&%$ing times!!!\n\nSo for about 3 weeks I had no service.\n\nCherry on top? they still charged me and refused to refund because \"the service was still working at the prior location\"\n\nFiled a complaint with regulatory authority. Funny thing, when got to the meeting (legal requirement) the ISP's lawyer didn't let me speak. She just called her company \"a bunch of imcompetent idiots\", gave me 2 months for free and 50% for the rest of the year.\n\nI bursted out telling her \"you cheated on me!, I was comming for a fight!\"",
            "Man my phone is with Rogers but I love slightly out of town enough for them to not offer internet, so I had to go with Bell. For the last year they’ve called me everyday and I always let it go to voicemail. I decided to answer some point last week…(paraphrased)\n\nRogers: Hello! We’re here to offer you our great internet service!\n\nMe: No, you guys don’t offer service in my area. Thanks for calling me every single day for over a year when you already have my address on file and could have looked it up yourself.\n\nRogers: Oh well I can go ahead and confirm we don’t offer service in your area! What’s your address?\n\nMe: No thanks, I’m happy with my service from Bell.\n\nThey haven’t called me back since.",
            "Call centre reps have to do everything in their power to prevent a cancellation. Otherwise it counts as a negative metric for them. \n\nSo that’s what they were probably doing. Trying to keep a disconnect from their metrics. \n\nTechnicians have no such metrics. Their job is to install and provide good customer service onsite. He did his job.",
            "I had a phone with rogers and decided to cancel that service and go on my moms. They didn't and texted promotional texts for years. I didn't notice because it was being sent to our accountant. They charged over 8,000 dollars in promotional texts and when we found out and tried to get the money back they offered us 150 dollars back. To say that we were pissed was an understatement. Then years later my mom's condo had a deal with rogers to provide cable tv. She returned one dvr and decided to only have one. We handed it into the store who lost it and then charged her for a DVR for years as well. I don't even know how much in fraudulent charges we've paid. I cannot stand them and am very vocal about how much I hate them. So I feel your pain.",
            "Had a similar thing but instead of coming out and canceling the fee, they just argued that cuz it was \"not their fault\" they don't provide service there I'd have to pay for the cancelation fee. The commercials advertising this promise? Didn't matter. Previously recorded garuntee from other customer service employees? Didn't matter. I literally had to dig up my contract and site the page, paragraph, and subsection and say word per word before they'd cancel the fee. Even then, the employee acted put out like it was coming out of their pocket. Like dude. Wtf?",
            "I cancelled our household internet 2 months ago. It took a few phone calls, and ended up with a rep crying and another rep giving me the what for. \n\nI read my bill one day, and decided to call in to add my husband to my account. It was supposed to be a siimple transaction, would have taken 5 minutes. However, before the rep came on the line, and automated message came on saying that our router wasn't going to work after a week. \n\nThe company provided router, that we paid extortion rates for was going to stop working in a week. I hung up and checked out my cellular plan. I re-read my internet bill, and made a snap decision. Going with my cellular provider would save us $500 US per year. \n\nOkie dokie. I called the ISP back, and again worked my way through their automated system. When I got to a rep, I asked to cancel my service. She asked why we were leaving them. I told the truth. I said, \"Your service isn't worth the $1250 per year that I'm currently paying. We have outages daily when the internet doesn't work at all. Then there was the automated message that my router that I rent from you is getting retired, and all internet service will be stopped unless I buy a new router. Then the fact that in March my internet bill will go up to over $1800 per year.\" \n\nI did not yell. I spoke quietly, and clearly. She started crying, and set up the disconnection. \n\nThe skullduggery happened when I went to turn in the equipment. That same router box that didn't work anymore by that time, would have cost over $350 on top of the cost of the money already spent renting it for the time we had service with this company.\n\nThe person behind the counter asked why I was disconnecting, and demanded to know who my new provider was. I told the truth, I said my cellular provider. She then proceeded to rant and rave about how evil my cellular provider is, and how much overages are, and all kinds of chuckle worthy things. \n\nI got a signed receipt for their router, and have it safe in my desk. The final bill came, and was paid off. \n\nThe gimmee on this? My cellular provider hasn't had a glitch at all since, and my bill didn't go up as much as I thought I would. Good riddance to bad rubbish.",
            "Had something similar a few years back with my DSL service. I moved across town and into a recently renovated duplex. The owner (he lived in the other half) hadn’t seen any point in running phone lines in the house since they were on cable internet. \n\nI called the company and explained everything and luckily the person I talked to was super understanding and told me they would go ahead and cancel without the early termination fee. A few weeks later I get a letter saying I owed the big fee and that kicked off months of hell. Every time I called I’d walk back thru the situation and they’d tell me they understood and that they were waving the fee but the system never reflected that. Eventually the fee that they agreed I didn’t owe got sent to collections. So then I had a whole other layer of bull shit to deal with. In the end I finally did get it worked out and never had to pay up but man that whole process sucked.",
            "Ah the Canuck corporations are behaving like their siblings south of the border, eh? Well played OP!",
            "Somebody I know once told the gym she was moving to Swizerland because they were adamant she did not need to cancel her membership. This conversation took place less than a mile from that gym. \n\nThey were really bad about the cancellations. When I worked for them I tried to get the power to cancel memberships because I was tired of being yelled at. No managers on the night shift. They said no because they knew I would just do it and not spend all night trying to talk them into keeping it. More than one person straight up cancelled the credit card for the membership to avoid the process and I think one lady complained to her bank.\n\nI don't think that chain is doing well these days and I am not sorry.",
            "A former colleague had a similar experience where the rep was insisting it would be covered, so he got them to update the contact and and him a new one. When the engineers arrived, he produced the paperwork saying they would provide him service at his address. Several new telegraph poles and weeks later, he did indeed have service at his new property",
            "LPT: When services refuse to cancel service, tell them you’re going to prison. They’ll stop asking questions and cancel service immediately.",
            "given how evil Rogers is, this made me smile",
            "Shame the boots on the ground are the one that had to suffer the most (glad you gave them coffee). Every tech that I've had to have come to my place was down to earth and kind of know corporate are dunderheads.",
            "I swear, if I get to hell and there's not a special special place for cable companies..... Imma be pissed",
            "I had to do that to get out of an insane contract with my service provider. \n\nNow I technically lied about moving out of their service area but I was not prepared to keep the service when I moved. $700 in cancelation fees was way to much to swallow",
            "Tried to cancel Comcast when mom died. They told me I didn’t need to as they were for sure in the area I was moving to. I told them the service was under my dead mother’s name and I told them where I was moving. They’re not in my new area. They canceled the service. But they gave it their best shot!",
            "\"(Rogers, for my fellow Canadians)\"\n\nAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!\n\n[deep breath]\n\nAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!",
            "I live in a rural area myself. Nothing but forest around me and a couple other houses.  \nI've had the same ADSL internet package for well over 15  years. Ever since fiber was a thing here I've recieved paper ads, phone calls, emails, all the things imaginable to get me to try and switch to fiber with me having the infrastructure to do so.  \nThey never really laid out the necessary items for me to actually HAVE fiber.  \nSo typically I have all of the ISPs calling me and going something like this.  \nISP:  Hello! Did you know you could switch to our super fast and amazing fiber internet today?!  \nMe: No, no I can't. I wish I could but theres no such thing here.  \nISP: That's not possible! My system is telling me your location already has it.  \nThen it's me having to explain that it really is not possible.  \n\nOne time recently they even sent an actual team who was making the rounds to check if we actually did or did not have the capability to receive those services after I agreed to a contract out of sheer spite. Only for them to have to instantly cancel it due to it being impossible to fulfill.",
            "American here but we had a similar issue with our DSL connection. We wanted to upgrade to fiber after years of horrible DSL service but were told they didn't have that in our area. What? We watched you install it. Dug up the whole road and installed channels on all the buildings, plus fiber boxes on every building... \"No no, we don't have that service in your area.\" Fine. We went to another company who signed us up and got everything installed. Happy customers. First company comes back door-to-door later trying to get people to switch and knew we used to be customers, so we told them about our reasons for leaving.\n\n\"But we *do* have fiber in the area.\"\n\nYeah, we know, you know, but apparently your customer service doesn't! \n\n\"Maybe this was before we installed it?\" \n\nNo, this was X years ago.\n\n\"Oh...yeah....we definitely have had it longer than that...\" \n\nYes, we know. We're never going back to your company with that kind of idiocy. Have a good day!",
            "Rogers, only second in scumminess to Bell.",
            "My ex and I were trying to get internet service from Shaw's in a city. We called and they said there was a contract already in place at the address with an outstanding bill. We said that's not our name on the contract. They asked if we could pay the bill anyway, we said no, hung up, and got service from Telus.",
            "This happened to me with Sprint. Moved to a state they don’t even cover and they wouldn’t cancel my contract early “unless they couldn’t provide service”. I had unlimited data at the time, and also moved to a farm in the middle of nowhere, and since internet was so shitty I used my phone for everything. Took one billing cycle for them to call me to cancel. Apparently my roaming was costing them enough money to notice and offer me a way out.",
            "Also rural Canada, also dealt with Rogers.\n\nWe are so rural that for years we couldn’t get internet at all. We asked tons of different providers and then finally Rogers had something available as of late last year. It was satellite internet with a router and our only option was to pay a ton of money per 10g, or pay $250 a month for 100gb high speed and then unlimited low speed. As a family of 5 we obviously took the option with the unlimited. With all of us working, the fast internet is used up in a week, and the slow internet is so slow it’s essentially dialup. Seriously—I can’t even google anything.\n\nIn the morning, we are having Bell come out, who can finally offer us unlimited high speed for $100 less than what we’re currently paying. Feeling blessed.",
            "Damn what a Timing, i Just had something similar *two days ago*.\n\nSince the flooding Here in West germany my Internet Breaks down every day. I called my Provider and wanted to cancel since they dont fullfill their contract but they refused.\n\nI mentioned talking to my lawyer and hung up. 5 minutes later they called me back \"we Just went over your outages again and It seems you are indeed qualified to cancel the contract\".\n\nNow i have a new Provider who is a bit slower in download but at least stable which is important for homeoffice.",
            "I did the same thing, I moved to a farm in 2019 and had to cancel my 100mpbs Spectrum service, I had no contract so it was easy to cancel when they looked up my new address. However, their sales folks would occasionally call me to ask If I wanted service. \n\nEach and every time I would be genuinely enthusiastic and give them my address, only for them to have to be the ones to say they can’t serve me. Eventually one of the callers offered to make a conditional do not call note in the system until service was physically available and they have never called again.",
            "I had a cellphone contract with Orange in France when my wife’s job posting was moved to Chile. I rang orange to cancel and the buggers said that it wasn’t me that was moving, just her, therefore I could stay behind and still maintain the contract. I was working as a consultant with a small company at the time so I got my fellow director to write me a letter saying that I was being moved to Chile to be our Latin American representative (for a company of four people specializing in a European based organisation). That worked but damn, was I supposed to stay in France because my phone contract was more important than my wife?",
            "I knew exactly where this was going as soon as you said Rogers 😅",
            "That's a good story.",
            "Rogers is the worst.",
            "Dealing with rogers myself, you gave them about what they deserve.",
            "Who asks for postal and not residential address?\n\nWhat a bunch of idiots",
            "I hate rogers with a passion, shitty customer service with ridiculous fees/contracts. The only good thing about them is that their internet is pretty good.",
            "I had this same argument with a provider in South Dakota. I was canceling my service and they wouldn't let me cancel. I had to tell them I was moving 800 miles south and they didn't have services there.",
            "Malicious compliance for Rogers? Cheers infinite times 🥂🥂",
            "As a fellow Canadian, I just have to say that I LOVE THIS! Any time you get to screw over the big three, you gotta take it.",
            "A few years ago I bought my first home, and moved from an area with only one option for internet. They didn't really provide service outside of a tiny area, so I figured it would be an easy cancel. Instead of listening to my whole sentence of \"I bought a house in x city so I need to cancel\"  they only heard \"I bought a house\" and wouldn't stop trying to upsell me home security services.\n\nFirst the rep said that I should be concerned about getting raped because I was a single woman living alone. Then said that someone was going to break in and kill my dogs. It was the most bizarre conversation I've ever had. Like even if I wanted a home security system, do you really think that's the best argument?!?!",
            "Similar conversation when canceling renter's insurance when I moved since they didn't cover if no water source was nearby:\n\nHer: \"But where's your nearest hydrant?\"\n\nMe: \"Don't have one. This is a rural area - we're on wells out here\"\n\nHer: (annoying sigh and ignoring what I just said)  \"Just look outside by the curb and it should be on the corner\"\n\nMe: \"You're not listening. There is no curb or corner for a mile or more. No hydrants. I. have. a. well. and. so. does. everyone. else. here.\"\n\nThere was silence at this point like she just couldn't comprehend such a world. After a few rounds of \"Look out the window\" she finally gave up and cancelled.",
            "When we moved, we had to cancel our Frontier internet. When my wife called to cancel, they went through all the hoops to try and keep us. Finally my wife goes “look lady, I don’t give a fuck what you do. We don’t live there anymore and we have a new ISP. If you continue service, we won’t be paying the bill and this is your notice of cancellation. Have a nice day.” They promptly canceled the service.",
            "When I have those little problems, I just tell them that I live 2 miles past the pipe. You know,the pipe at the head of the valley that the sunshine comes out of,,,when you get there, just go 2 more miles.",
            "I had a similar experience with a phone carrier. This company kept calling me to switch the whole company cellphones to their carrier and prices were good and I was in. That same weekend a friend of mine who had this carrier visited my house, which is on a hill, and had no reception. That same Monday I told the sales guy our problem and he said \"impossible, my records show you have full signal\". That's partially true as we have signal 20 metres down the road and 20 metres above but right in our lot there is no signal. Sales guy even sent me a sim card to test on my phone, to which I sent him screenshots showing that, effectively, there was no reception. Took me that much to get rid of him.",
            "I've hated Rogers with a passion for decades. Absolute hatred. At one point my wife had, before her and I met, phone and cable with them, so she convinced me to get internet with them. Way too expensive. So eventually I went to cancel the internet.  This was before streaming and downloading were really a thing, so she wouldn't let me cancel the cable. We had already cancelled the phone. \n\nThey tell  me we are on what is called a cancel disconnect, meaning if I cancel one service with them, they will cancel all the services we have with them. I tell the guy perfect, I hate your fucking company and am more than happy with that. He just stares at me like I have 3 heads, because I guess this supposed threat of cancelling shitty service with a shitty company that provides a shitty product is supposed to cow you into staying. Fuck you Rogers, cancel me. Please. He runs to the back, I guess to speak to a manager, comes back up and says they are just going to cancel the internet. \n\nIt took a few more years, but Pirate Bay is my friend, Fucking go Bit Torrent, cable can kiss my ass. forever.",
            "Man as a Canadian, fuck the telecom monopoly.",
            "As a fieldtech, not with cable/wireless/internet, think customer premise equipment, I briefly worked for an alarm company installing alarm systems for residential and commercial. The company would put out these boxes saying enter to win XYZ prize. They were only there as a way to easily generate contact info for the sales rep.\n  So I am scheduled to install a system on a Saturday morning an hour out of town. Paid per install. The customer had called the main office number to cancel the install, they had a window of time to do this. Main office didn't pass down the info that the call was canceled to the local office nor to the tech (me). I get up nice and early to get loaded up and on-site at the appointed time. Get informed the install was canceled. Customer was very nice. So nice they took me out for breakfast as an apology because head office didn't pass along the cancelation. It wasn't their fault nor their problem but they did it anyway because I went through the trouble of getting up early loading up and arriving on time. And waking them up early to top it off. I really appreciated the time and effort they took to not make the trip a complete waste of my time. \n  I did get a free breakfast out of it and the day off after mentally preparing to work that day. Yeah it wasted some gas (had to drive your own vehicle and provide your own tools) and some time but it was only a few hours early in morning. So it was still early when I got home and basically had the whole day to do as I pleased.",
            "Should have forced them to provide service, tell them start trenching!",
            "And that's why I'm glad Iive in Quebec where the law doesn't allow them to pull that shit.",
            "Interesting! This is a funny story for you (and for me, as a consumer), but as someone who's drunk the corporate Kool-Aid IRL and love kaizen, this actually looks like a really great case. Clearly, if they'd just believed you, it would have been much cheaper for them. On the other hand, I definitely see where the urge to push to keep contracts as much as possible comes from. So perhaps they're totally fine losing a certain amount of money on calls like yours if that means being sure that they're only losing the customers who they logistically could not keep. Or perhaps this would be simply a training opportunity for the poor guy who took your call--maybe he should have been trained to listen to you more. Maybe everyone in their call centers should be better trained. And maybe their whole internal review processes could be revamped to reduce unnecessary call-outs like this, and perhaps save them a lot of money! \n\nI think you handled this as gracefully as you could have under the circumstances--but if Rogers is smart, maybe they would see this as a great opportunity to review why things like this happen and take steps to prevent them from recurring. Who knows--maybe you just helped out a lot of ex-Rogers customers who found it much easier to disconnect than you did!",
            "Good on you. Shit like this (Rogers) should be illegal!",
            "I always tell them I’m going to prison. They always ask what for I say involuntary manslaughter but between me and you I meant to do it. Works like a charm",
            "Is it normal for Canadians to sight YEARS long contracts with ISPs as this post implies???",
            "Similar situation with us! But better results. Telus.\n\nHad services where we got a free TV (in change for an add on to the monthly bill so not free, sneaky buggers)\n\nMoved to rural 2 months after sign up. They didn’t have service there so we got to keep said TV (40 inch smart tv, nothing special) for free! \n\nMoved back into the city 4 years later. Been here 4 years. Still enjoying our 10 dollar (more or less free) TV!",
            "Buyout fees like that should be illegal. Internet and gyms",
            "Just give them this address; Node 2, Deck 5, ISS, LEO 51.603.\nIts the address for the international space station.",
            "Hahaha as an ex cable guy, I totally didn’t mind those “wasted” days. \n\nThanks for the coffee, we always appreciated that.",
            ">Rogers, for my fellow Canadians\n\nOof. Say no more, friend.",
            "This is belligerently Canadian and I love it. \n\nStuck in a snow drift\nOffered him coffee\nAttacked an evil corporation \n\nKudos from a neighbor south of the border",
            "I'm moving in to my MIL'S houseboat.  Currently off the Alaskan archipelago thing somewhere.  Do you provide service in the middle of the ocean?  Who keeps the cord from getting wet?",
            "We had the same problem with our provider here in the UK. There shitty map claims they have coverage, buy all we have is a single copper wire from the 50s that can just about handle dial up 😁 \nThey sent out 3 engineers to try and \"fix\" our connection speeds, every time the engineers told them there was no infrastructure support (once they found us).",
            "Military moving overseas is fun.  There is literally nothing they can do.  I've seen more then a few managers get in hot water dealing with reservists who get activated ok a 365 tour as well.",
            "Contracts in Australia when out the windows a few years ago.\n\nMost ISPs are now monthly, my ISP is daily, which is great if you are going away on holidays you can pause your internet.",
            "When I was moving to a 100000 population town that Rogers somehow doesn’t service I had to cancel. The cancellation was easy. But returning the equipment was holy fuck levels of frustration. They specifically told me to go to the store in the town I was moving to (they didn’t have service here but had a store) so I went there. That store told me I couldn’t return the equipment and to go to the store closest to where I lived previously. I drove about an hour there and was told they weren’t taking equipment returns. That store looked on their computer and told me to go to a third store in a third completely different city. I went there already pretty frustrated and that store was under construction and not open. I ended up going to a fourth store and telling them I was leaving the equipment there whether they take equipment returns or not then wrote in a complaint and ended up with a month of free cell service. Pretty ridiculous",
            "Lmao I used to work tech for them... the amount of times we had to fix Ontario agents' mess ups were way too high. It's like they were told \"no matter what, make thr customer pay\". My center didn't give a damn about sales goals in tech. Cancel if they need it or fix their problem. Kind of ridiculous how they work.",
            "Two years ago we had to move which involved cancelling our Rogers service. The Rep wanted my dad to wait all day in an empty house for a technician to come by and pick up the modem. My Dad managed to brow beat the Rep into sending a box for us to return the modem through UPS. Rogers claimed they never received the modem, thankfully I had the tracking number and was able to prove that they did receive the modem. Then they started harassing my dad claiming he owed $120 for something. After four or five calls he paid it and told the Rep to never call us again.\n\nBell's service is good but the hardware is hot garbage.",
            "I was moving to a different town that did not have Comcast so I called to cancel. They insisted I give them my new address to prove they didn't have service. Finally I thought we had agreed I could cancel it. They suggested I could transfer my service to a friend or family member. I told them, I like my friends and family too much to risk losing them over giving them Comcast",
            "hell every year I cancel my internet and open a new account (all on the same phone call) because they offer new account discounts but not loyalty discounts.\nWhat I do is call and ask for lower monthly rate, one that matches the new customer rate because the limited low rate I was paying only lasts for 12 months. They say sorry that is for new accounts only. I reply with ok I would like to cancel my account, which they ask why? I tell them I won't pay more than what a new customer pays for the same service. They cancel the account and then always ask if there is anything else they can help me with today. I say yes I would like to open a new account at this promo price. Normally at this point the customer rep understands what I'm doing and it's smooth sailing from there. I've done this 5 years in a row now at my same apartment, still paying promotion new customer pricing.",
            "Canada has some of the shittiest Telecommunications rates/services IN THE WORLD thanks to Rogers/Bell doupoly",
            "Comcast is our only internet option and they just double my internet bill. Fortunately, next month my neighborhood gets it's own ISP for residents and Comcast will loose hundreds of customers!",
            "Added benefit, wasting a bunch of their money to have a guy come out to verify there is no service. :)",
            "Not a Rogers story, but an independent internet provider. When I was in school living with roommates, we heard about this independent provider who provided great internet for cheap. As students, we decided it would be best to look into this.\n\nFirst, the provider told us they could help us out and we would get X service for Y amount. So we cancelled with Rogers and they were able to plan a set up visit like a day later. The guy arrives and he tells us we're outside of their service area.\n\nI think that whatever the service providers' resources are for their staff is probably not very accurate based on our two stories.",
            "I haven't lived in Canada for quite a while now, but I still feel like I just needed to stop in say, FUCK ROGERS.",
            "Can't say this enough; Fuck Rogers.\n\nThat is all",
            "Comment section TL;DR \n\nRogers is dogshit, if you have to choose between them or drawing your own memes on paper, then you best invest in some good pencils",
            "Please accept my award, kind farmer lady! I had the exact opposite problem. Me: Sign me up for your service please, here’s my address. CATV : we don’t have service on that street. Me: Yes, you DO I have a cable running right past my apartment. CATV: No, we Do Not. Me: WeLl I kNOw A tHInG oR tWo …CATV: No, nobody on your street has our service. Me: so it’s OK with you if I hook up to that block splitter right outside my window, then? CATV: none of our stuff is on your street, at all. Me: do you know if the sheriffs department at the courthouse has your service? CATV: They do, yes. Me: How did they get service, when you don’t service that area? CATV: We ran a coaxial cable down the telephone poles and, oh.",
            "We used to be with Rogers. Our contract expired and we were on month to month. I saw a good offer from a different provider, so I called Rogers up to see if they could match it. I was told they couldn’t that month, but that the following month there was a deal coming out better than the competition, and was provided the full details about it, including a reference code for it. So I waited.\nCalled up the next month, requested the change, with the specific code, was approved, seemed all good.\nFollowing month my bill came, and it was double my previous bill. Called up and was told that I was actually ineligible for the requested change, but since the rep had tried to change it, it removed my previous plan was canceled. Since they didn’t offer the plan any longer, it reverted to individual billing. For everyone on my plan, no bundles, anything. They just didn’t talk me.\nI canceled immediately, called up the competition, explained the whole issue, and was given the previous months offer even though they technically weren’t offering it any longer.",
            "As annoying as it is when sales people don't listen and sticks to their guns to keep a contract, at least they were willing to stand by it and *try* to keep you up and running. I can say dealing with other internet providers that minimum effort would be a marked improvement.",
            "I'd KILL to have cable out here where I live now.",
            "The unfortunate part is he likely didn’t get paid for that… I used to work for an internet co tractor and I didn’t get paid unless the service was completed (I live in idaho for context)",
            "I once had to tell our cable supplier we were moving out of the country to finally get them to relent...",
            "Rogers sucks cocks.",
            "The worst part about that is the guy installing it had nothing to do with the conversation you had over the phone. He was just assigned the job. Also if it’s anything like installing cable here in good ol KY. you get paid by the job. So that guy did all that just to not get paid. Sucks to be him I guess",
            "Honestly, with how Sasktel is the only provider who hasn't tried dicking me, or sneaking in scummy fees I don't get why we haven't just nationalized the internet, cell, and landline telephone services country wide.\n\nBell, Rogers, Shaw and whoever else can all go screw themselves.",
            "You can always say “I need to cancel this service. I’m going to prison for ten years and I won’t be able to use it” no salesperson is going to want to go anywhere near that so they’ll just give up and cancel without a fight",
            "What the fuck kind of contracts do you have in Canada where you can't cancel?",
            "Just tell them you’re going to prison.  Works every time.",
            "Well done! I'm always up for screwing internet providers...overcharging for subpar service. (USA here, I utterly loath Comcast).",
            "That's fair, that's not something you did to him--that's what his employer did thanks to their shitty policies and inflexibility.  And I'm not even Canadian but I've heard a lot of similar stories about Rogers.",
            "At least they had the unless we cant provide you service vs you paid no refund get out of here.",
            "LMAO GO YOU! I have Rogers and recently went rural from a pre GTA / dt TORONTO life and fuck the service isn’t as good as my bf of 10y who gets a 20$-40$ phone card. The fuck!?",
            "Pro tip always say ur being jailed to cancel a service",
            "When i was in the navy, those shady kiosk phone salespeople would try to get you to sign up. If you tried telling them you had a contact, they (seeing you were in the navy, or at least noting the very short haircut and asking,) would tell you to tell them you're being deployed under classified orders.\n\nNow I just use an MVNO, like redpocket (20.26 usd for three gigs and unl talk text,) or mint mobile, though not sure what their deal is.",
            "Had the same problem with my internet provider but mine kept charging me until the end of the contract, for like 4 months or something, despite me not living In the house nor the country anymore. I complained them basically on the daily and always got fed promises they would stop charging and cancel the contract or told it was not possible, it was a nightmare",
            "I had no idea ISPs had commitment contracts. Must be a Canadian thing. I’ve bounced back and forth from AT&T to Comcast whenever one of them had a great deal I didn’t want to pass up. No questions asked.",
            "So glad I have Google Fiber.",
            "Wow it's almost like Rogers is run by a bunch of money grubbing incompetent monsters who would rather overwork their techs and force their CSRs to adhere to ridiculous standards rather than treat customers with respect or lose a single dollar",
            "My current cellphone provider is Rogers and I despise them for their pricing scheme alone. They’re just charging so much for so little service, as are all of the Canadian cell phone service providers. Im still with then cause im on that old contract that amounts to 49$ tx included for everything unlimited except data which is 14gigs/month. They refuse to provide me with 5g since im not on their new plans.\n\nI once had a rep try to register my own cellphone to their network for some obscure reason. She told me I had to for my cellphone to work. I asked her how she thought I was calling her.\n\nI also had a rep try to tell me I fucked up by buying a phone outright as financing it would have ended up cheaper. I would have gone from 49$ tx inc to 109$+tx (15%) per months for the the same contract + a phone I would owe 600$ after 24 months. \n\nThey claim they have those “infinite” plans where after 15gigs of cellular data they reduce your speed. They slow it to an absolute crawl of like 512ko/s. If you download CONSISTENTLY for 8hrs day for a whole month you end up with 420 ish gigs of possible download. That is very limited to me.\n\nAnyway, fuck the big cell phone service providers of canada.",
            "\"I'm moving to Mars. I'm glad you're able to continue our contract at the current rate\"",
            "Moving is never a good answer for why you want to cancel. IME the response that works best is “I was fired from my job and having trouble getting a new one. I’m behind in bills and I’ll be declaring bankruptcy.” If you can’t pay they don’t want you.",
            "When I told Comcast to go shove it because I was switching to a local ISP, they asked why I was cancelling my service. My answer: “Because it’s Comcast.”",
            "It will have been for retention reasons, targets etc. Sucks but this is how desperate the person would have been to stop a cancellation.",
            "Hey OP, you should see if star link is available for your area. It beats regular satellite internet because star link is in a lower orbit.",
            "How are you posting without internet?",
            "I thought Australian internet was bad, but it seems like Canadians really get shafted for telecommunications.\n\nI went to Vancouver on holiday a few years ago. I was shocked at how difficult it was to get a prepaid SIM. I think after going to 5 different stores I eventually got a SIM that gave me 1GB of data for something like 45 CAD.\n\nHere in Australia, 40AUD will easily get you 30GB on a prepaid plan. In NZ and Japan I had no issues getting cheap travel SIMs. But in Canada, the people in the stores looked at me like I was speaking a different language.",
            "I’m in the US and moved to Wyoming. It was a joyful moment on the phone when AT&T had to admit that they did not have service at my new address. At least they didn’t try to claim they do. I also have Progressive insurance on my car, and they don’t have adjusters in my area resulting in a claim that is 7 mos old, and will result in my car being totaled due to hail damage. Which they can’t raise my rates for as that is illegal in Wyoming.",
            "And the blaming of who canceled your account was passed onto the install guy and the rep on the phone didn’t get in trouble.\n\nSo they won.\n\nAnd that’s just sad.",
            "starlink time",
            "That bud on the phone only follows a script, can't blame him for that. Knows you can't get cancelled and indeed lets that guy come to.your house.",
            ">\tCost Rogers a 3-4 hour call out when you count the drive, just to try to keep one impossible contract.\n\nFor every person person like you there are 20 more that just pay the fee. The ISP still comes out on top with this strategy.",
            "Nice of you to get the install guy a cup of coffee. Hope you had a slice of cheesecake or a muffin too. I used to work in the field. There is zero time for food and the pay is shit. Don't get me wrong here game well played, f*ck those ISP contracts. Nice you were kind to the other human from that company that helped you.",
            "You should call em back out, waste more of their time. Just to be sure it’s not possible..."
        ]
    },
    {
        "post_id": "6y1trq",
        "author": "nlderek",
        "title": "Send the police, there is a black man walking down the street! You want the police just because a black man is walking down the street? You got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/6y1trq/send_the_police_there_is_a_black_man_walking_down/",
        "score": 32950,
        "num_comments": 1354,
        "created_utc": 1504546686.0,
        "selftext": "I originally posted this as a comment on another thread, but it brought up so interesting discussion so I figured I'd post its own topic. I use to work as a 911 dispatcher and I once took a call from a lady who was complaining about a black man walking down the street. He was doing nothing wrong...except, as she put it, \"he's black and walking down the street\". She insisted an officer be dispatched to speak with her and we had a policy that we had to dispatch. Soooo...I sent the only black officer on duty. It was out of his area, but a computer message to him and the supervisor made it obvious why he was going. When he arrived she went nuts and called again screaming that there was now a black man knocking on her door. I said, \"yes this is the police officer you requested.\"  Ultimately I had to send the supervisor out because she refused to open the door and was throwing a huge fit on the phone. \n\nEdit: Thanks for the gold! I never expected this to blow up like it has. As for the few people who have felt the need to say this is fake..it's not, this is the world we live in and it happened. It happens every day. ",
        "permalink": "/r/MaliciousCompliance/comments/6y1trq/send_the_police_there_is_a_black_man_walking_down/",
        "comments": [
            "The perfect ending would have been if the supervisor was also black",
            "[deleted]",
            "I was a 911 operator for a little over 5 years. There was an elderly lady that would call all the time and the call would go a little something like this:\n\nme: (after name, address, etc.) what's your emergency ma'am?\n\nLady: There's a gang on the corner! Send someone please!\n\nMe: OK, can you describe the gang and what they're doing?\n\nLady: They're black!\n\nMe: ....ok....\n\nLady: they're loud!\n\nMe: um.... ok....\n\nLady..... they have bookbags!\n\nMe: wait, what? Are they at a bus stop?!\n\nLady: Yeah! How'd you know!?\n\nMe: are they kids waiting for a bus, Ma'am?\n\nLady: (dead serious) Well I don't know what they're doing but they're out there every morning and you need to send someone out here and tell them to leave! \n\nAnd as per our regulations, we had to send an officer.....",
            "Barely barely related, but I used to work retail selling computers, and customers would frequently refuse to talk to me because I'm female.  They would straight-up tell me \"I'll wait for the computer guy.\"  So I would go do something else until the male employee the customers inevitably found came to ask me for help.  Since I knew more about computers than anyone else in the store.  \n\nFun fact, the most sexist people were women.",
            "Pleeeeaaase tell me she was fined for abusing 911.",
            "A few years ago, there was a rape in the town that I worked. It was pretty big news the victim claimed that she was pulled from the street and raped. It's a relatively small Southern California town with a white majority. The victim claimed that it was a black guy and a hispanic guy. Everyone was talking about it.\n\nAbout a week later, from out my window, I see some black lady walking down the street. This isn't a high traffic area for pedestrians. Probably twenty people might walk down the street during the entire day. Nearly all of them white. \n\nA short while later, I hear over the police scanner that across the street, this white guy who's standing with his family has spotted a black homeless man who he believes is the possible assailant from earlier that week. \n\nI think myself, wow I can't believe I thought that was a woman. A short while later, after the police clear the scene, they confirm that it was a woman and she was merely walking to work.\n\nAt the same place where I used to work, residents would consistently call in suspicious people who just happened to be hispanic. At one point, someone called in, saying that there was a hispanic man walking down the street, wearing the company uniform for landscapers and driving a landscaping vehicle...but something was suspicious. As I talked to them further, they even said that at one point, that same suspicious person stopped and talked to a supervisor on the landscaping department, but they still wanted it to be checked out. ",
            "Reminds me of this joke:\n\nA US Navy cruiser anchored in Mississippi for a week's shore leave.\n\nThe first evening, the ship's Captain received the following note from the wife of a very wealthy and influential plantation owner:\n\n'Dear Captain, Thursday will be my daughter's Debutante Ball. I would like you to send three well-mannered, handsome, unmarried officers in their formal dress uniforms to attend the dance. They should arrive promptly at 8:00 PM prepared for an evening of polite Southern conversation. They should be excellent dancers, as they will be the escorts of lovely refined young ladies. One last point: No Jews please.'\n\nSending a written message, the captain replied:\n\n'Madam, thank you for your invitation. In order to present the widest possible knowledge base for polite conversation, I am sending three of my best and most prized officers.\n\nOne is a lieutenant commander, and a graduate of Annapolis with an additional Masters degree from MIT in fluid technologies and ship design.\n\nThe second is a Lieutenant, one of our helicopter pilots, and a graduate of Northwestern university in Chicago, with a BS in Aeronautical Engineering. His Masters Degree and PhD. In Aeronautical and Mechanical Engineering are from Texas Tech University and he is also an astronaut candidate.\n\nFinally, the third officer, also a lieutenant commander, is our ship's doctor, with an undergraduate degree from the University of Georgia and his medical degree is from the University of North Carolina . We are very proud of him, as he is also a senior fellow in Trauma Surgery at Bethesda .'\n\nUpon receiving this letter, the mother was quite excited and looked forward to Thursday with pleasure. Her daughter would be escorted by three handsome naval officers (and the other women in her social circle would be insanely jealous).\n\nAt precisely 8:00 PM on Thursday, Melinda's mother heard a polite rap at the door which she opened to find, in full dress uniform, three very handsome, smiling black officers.\n\nHer mouth fell open, but pulling herself together, she stammered, 'There must be some mistake.'\n\n'No, Madam,' said the first officer, 'Captain Goldberg never makes mistakes.'",
            "my neighborhood has a facebook group.  I quickly came to realize it is a bunch of people who sit in their houses being afraid of everything outside.  I was kicked off the group for commenting on the post \"there is a black man sitting on the curb at the corner of STREET and STREET.\"  I asked why him being black was literally the only piece of information they chose to give...no age, height...clothing..nothing.  They responded that it was so I knew who to look out for.  \"So, I am supposed to be suspicious of any black man walking around in my neighborhood?  You know that black people live here too, right?\"  I was immediately booted, as was my wife, who was not involved in the conversation at all.  ",
            "I'm sure you wouldn't be specific, but can you give a general idea what country or area this story took place in? I'm curious what type of place this woman lived in that she was so freaked out about a Black cop being on the force.",
            "I am a state police officer assigned to a state university. I was once sent to an outdoor campus venue where a hundred university students and faculty/staff advisers were holding an overnight \"homeless awareness\" event. They called 9-1-1 to report a transient was seen in the area collecting cans from the trash. No other behavior, threatening or otherwise concerning was reported. They explicitly demanded that he be cited for the offense (taking property from a trash container) and removed from campus.\n\nCalls like the OP has shared and this are not uncommon. Police officers are regularly put in a position where they are unreasonably put in a no-win position because those who call are horribly bigoted, racist, ignorant and/or hypocritical. ",
            "[deleted]",
            "[deleted]",
            "Out of curiosity, what was the responding officer's reaction?",
            "I was trying to figure out you could maliciously comply with this request as soon as I read the title but couldn't think of anything legal or easily accomplished. This was perfect. ",
            "Current 911 dispatcher here. Sometimes I'll ask the caller for a description of who \"should\" be in their neighborhood--just so my officers don't detain the wrong person. That usually further exposes their prejudice or gets them to hang up on me altogether.",
            "Lol nicely done.\n\nIt amazes me how these people reach adulthood without realising how wrong they are.",
            "Locked. Way too many rule breakers in here. Probably because it's on r/all and r/popular.",
            "[Was it this lady?](https://www.youtube.com/watch?v=vUjxya3Nr2Y)",
            "I had a neighbor who tried to get us to call the police because there was a black person using a boat in the water behind our houses. Not only was it a public waterway, but we had black neighbors. ",
            "My husband is a cop and they get calls like this all the time. \n\n\"There's a suspicious man in my neighborhood!\"\n\n\"Okay, what does he look like?\"\n\n\"He's a black man\"\n\n\"Okay what is he doing?\"\n\n\"Walking around\"",
            "As a Black man who's been handcuffed for \"walking while black\", fuck her. ",
            "Me and a friend were walking to a restaurant down the road from my house one morning and passed a car that was parked in a prominent spot at the end of an alleyway with a for sale sign in the window.  We stop look at the car for a very brief moment and continue on to breakfast.  On our way back home as we approach the intersection where the car was parked all of the sudden we are surrounded by police.  They start asking us questions like where we're going and where we're coming from, I tell them we're just coming back from breakfast and heading to my house which you could actually see from where we were.  \n\nThey asked why we were looking at the car parked at the end of the alley.  I point out that the car has a for sale sign on it and that we are on foot. \n\nTurns out the owner of the car saw me and my friend looking at his car which was for sale and thought we were car thieves.   The cops didn't see the for sale sign and the vehicles owner didn't mention it to them. ",
            "I'm also a dispatcher. I've got two favorite racist memories from work:\n\nThe first is getting a call from an ambulance crew who was responding to a call. They called requesting a cruiser to come check out a \"black dude walking down the road\". Asked them what was going on and they said \"nothing, he's just black\".\n\n\nSecond favorite was when I had to send an ambulance crew on an IFT from our hospital to a hospital about an hour away in a larger city. Medic comes to dispatch and says she's really nervous going to the city, especially at night. I ask her why and she says \"BECAUSE! they got them people there that you can barely see when it's dark out!\"\n\nEdit: example medic #2 was the same woman who once put a raw potato in the microwave for 10 hours thinking that she hit 10 minutes and then completely forgot about it. Microwave caught fire and almost toasted our admin building.",
            "That would be a perfect curb your enthusiasm moment ",
            "OP probably had more than one caller do this. Even in a community where people are generally accepting of others, I still take at least a couple of walking-while-black calls each year. My dispatchers have a much better protocol than in years past: they ask about the behavior and only dispatch on the behavior.",
            "I live in a condo building full of old biddies and for a few months, there was a notice on the front door of the lobby instructing people to call 911 if they see \"any suspicious vehicles\" outside. \n\nI immediately added a sticky note saying 911 is for emergencies and seeing a suspicious vehicle out on the street from the comfort of your own home is absolutely not a reason to bother the emergency dispatchers. I provided the non-emergency line for local police.\n\nWithin a day, the sticky note was removed and an additional notice was added threatening fines for \"defacing or altering official (condo association name) notices\".",
            "Funny that people think that this story is fake. If it was fake then op would have put more detail in the conversations and used a lot of descriptive words.",
            "LOL, this reminds me of an old lady I was taking care of in a nursing home years ago. She was scared of black men changing her alone so I was helping my aide who was a black man and we were joking with her. (She wasn't a bad old lady at all, just literally raised by people who probably told her from the time she could walk that every large black man was out to rape her.) She looked up at me and burbled happily, \"We just have the BEST black people!\" I kind of fumbled and replied something like, \"we have the best people of all races.\" C., the aide, just cracked up laughing over the whole thing.",
            "I'll put my story in here. I was an activities coordinator at a retirement home. I went to Walmart with this sweet old white lady in very late stage dementia. She mostly seems out of it and gets easily confused and overwhelmed, but every time we passed a black person in that Walmart she would look up, smile, and wave. Only the black people. And then a big young black man came walking towards us. He happened to be wearing the same sports jersey as my lady, so she smiled real big, gave her wave, and pointed at her shirt and then his. He smiled, waved back, and told her he liked her shirt. My favorite sweet lady <3",
            "Oh hey. He posted this on my thread about racist customers calling in.",
            "If this was my grandmother, I am very, very sorry. She's 88 and lost her filter somewhere around 70.",
            "When I look at this in this most objective way possible, I imagine the neighborhood where I've lived for 20 years.  Mostly white town.  That's just fact.  All the houses were built in the 50's, usually by the home owners themselves.  Over the years those people started dying off or going to nursing homes, but the ones who remain are simply not used to anything other than white folks.  I'm NOT justifying or condoning ignorance, just trying to understand. \n\nWe're taught by the police to call when anything looks suspicious.  In the above scenario, a black man in that neighborhood is \"out of place\".  He totally deserves to walk down any street he damn well pleases! But to those old people there, they grew up in a different time & set of circumstances.\n\nSomeone needs to educate them.  I run a neighborhood watch and I actually do some of that educating.  I do it with kindness but firmness.  I have changed some minds.  In fact one old \"bitty\" now has fresh made cookies ready after school almost every day for children that are Hmong, black, Latino & white since the neighborhood has become more diverse in the past 5 years or so.\n\nIf we judge them for not understanding, laugh at their ignorance I guarantee they will not become better human beings.  \n\nMaybe we can step up our game & show them how good diversity really is.  ",
            "I remember when I was about 8, 2 black people walked past our front room window and my nan commented, 'Hmmm? What are they doing in public? Surely they shouldn't be walking down the street?' My mum's reaction was so frightening that I quickly walked out of the room. ",
            "My car window was smashed, wheels stolen and the police refuse to come out. She called because a black guy was walking down the street and you dispatched. Sigh....",
            "I hate calls like this. The black guy/girl/random person thinks a cop was riding by and is being harassed for no reason  \nWe can't ignore them and not send anyone  \nWe also can't call them out on their bullshit, turns out thats a pretty quick suspension....",
            "CL: \"There's a black man walking down the street!\"\n\n911: \"Have you considered buying him a car or a skateboard?\"",
            "It's too bad there weren't more black officers on duty at the time. Could've had all of them swing past.",
            "Haha reminds me of something that happened to me back in 7th grade, something like 8 or so years ago.\n\nSo imagine me; 4'9\", 110 lbs (I was a lil chubby kid lol), mixed Asian and white kid. It's like 4:30 in the afternoon in October, and I decide to take a walk around my suburban, Northern Californian neighborhood after school. So I head off, and get about 3 blocks away before I walk down a court and see these kids stare at me, sprint across the street, and into their house. I was kinda confused at the time, but I just shrugged it off an went on.\n\nI get another couple blocks away before I notice I'm being followed by a big white Suburban. Now, I'm just a 12 year old kid, and being followed by a big, white SUV was unsettling. Moments later, I'm being shouted at by a soccer mom from the depths of hell. She told me that I \"scared her kids with my walking\" and \"that there were at least 4 cops in the immediate area that she knew and would call on me\" for \"roaming\" (is that even a thing?). Now, being the nerdy 12 year I was scared shitless. I just said okay and left before something actually happened.\n\nAnyways, looking back on it, I actually would have wanted her to call the cops, just to see what happened. But that's in the past and I guess I'll never know.",
            "It feels so hard being black. Either you are stupid because you are black or you just got a job because you are black. They have so little expectations of your, they are surprised when you outperform. You get companies wanting to hire you just because you are black, but nobody wants to be given a job for that. I've gotten hired at a top company before they even gave me an interview test. I don't mind some help, but don't patronize me to meet some quota you have.",
            "Reason for removal?",
            "This reminds of a bit from David Sedaris's Diary of an elf:\n\nThe last time I was the Pointer Elf, a woman approached me and whispered, \"We would like a traditional Santa. I'm sure you know what I'm talking about.\"\n\nI sent her to Jerome.",
            "I'm from a pretty diverse city and we still have crap like that. A friend of my mother's had the cops called on her when she was entering her nice high-rise apartment building downtown. The cop was absolutely livid when he realized the \"suspicious person\" from the call was a physically disabled, black, college professor who was about as threatening as Betty White. Plus, you know, she lived there and had every right to be in the building. ",
            "I mean if you think about it, the 1960s had all those lynchings of black people. Some of the photos you see from some of them have little boys and girls at those lynchings. Those kids are in their 60s and 70s now.",
            "As a black man that works in a suburb, this is one off my worse fears. My record is spotless because I like to interact with police as little as possible. ",
            "Haha I'm just surprised that people are surprised by this story. ",
            "I used to get pissed off when people talked about \"white privilege\": hey, my life is no paradise, where's my so-called privilege, etc. Now, I realize shit like this - that I consider *insane* -  a lot of black people are likely not even surprised by: Crazy racists like this lady. Flat-out racists like the Charlottesville Nazis & Klan members. Deadly racists like aggressive cops. Deadly racists like ignorant George Zimmerman. I'm surprised black people ever leave the house with this nightmare crowd around! Part of my privilege is that, as a white dude, I don't have to deal with this. I'm not even sure that I *could*... ",
            "If she's a racist cunt, then she ain't no lady.",
            "This pisses me right off. I hate that this shit happens at all. I agree with OP's choices with regard to the malicious compliance, but I'm still really pissed that this woman felt that a human being simply existing in her vicinity is sufficient reason to call the fucking police. AND 911 NO LESS! What a cow. ",
            "Join Nextdoor if you live in the suburbs. The amount of racist paranoid white NIMBYs who don't want their tax dullers spent on anything they don't personally benefit from and think crime is at an all time high is stunning. ",
            "[removed]",
            "[deleted]",
            "Thank you, thank you, thank You for posting this. People need to know that not everyone is seen or treated the same as everyone else. ",
            "How does the black police officer feel about being sent to these calls? Does he relish it, or resent it?\n\nI hope he gets a kick out of it.",
            "My mother came in from checking the mail, ranting about 'there's an Asian guy walking down my street' (10 house cul de sac with 9 Jewish families and my mother, older white lady) - joking, I said 'well why don't you call the cops?'  So she calls the cops, they come down the street, ask the older Asian guy wtf you doing here, he's confused, they call it in, and are told his family 2 towns over reported he had alzheimers and wandered off the night before.  He'd been out walking since the prior evening, all night, his family was worried. I lived in an all (except for me and my roommates) black neighborhood in Brooklyn, wore a suit & tie every day for work, and every night when I'd get off the subway after midnight to walk home I'd get stopped by somebody asking me was I lost.",
            "Why was this deleted? The fuck? I'm sitting here crying laughing and you delete it.",
            "These people ain't seen a brown skin man\nSince their grandparents bought one",
            "Does the policy to dispatch police officers vary from communities/cities? It seems to me that only people in rich area can actually request police officers asap to a non-emergency scene whereas people in poorer areas can't. Just something that's been on my mind lately. Mind to share some of your thoughts, redditors and OP?",
            "My friend told me a very similar story about his time as a 911 dispatcher. Only it ended with him making a sarcastic comment to the woman, then his suspension and his voluntary departure from dispatching. :( I think yours turned out better.",
            "You should have sent out a black supervisor so it would escalate even further, maybe all the way to Obama if this was pre-Trump.",
            "Yes, this is the correct way to handle this.  Are you afraid of a black man?  Well, we'll send a helpful black man to put you at ease.\n\nIf this isn't going to make someone get over their racism, then they're not unreasonably scared of a race; they're just assholes.",
            "This is brilliant. As a former 911 calltaker, I salute you. ",
            "Sucks how as a minority your mere presence is enough to raise suspicion here.",
            "he's just standing there... MENACINGLY!",
            "Watchin that grown woman throw a hissy fit probably made that cop's day",
            "> Rule #3\n>Don't question the validity of a story. It's much more fun if we give people the benefit of the doubt.",
            "What a bitch.",
            "So awesome. Make stupid decisions, suffer stupid consequences.\n\nShe had it coming.\n \n__",
            "Haha America",
            "Was she arrested for misuse of the 911 system?",
            "I'm a typical white guy. I was stopped one night riding my bicycle in circles in my own driveway, waiting for my wife to go for a ride.  She came out, explained that we live there, showed ID, etc.  He got out a notepad and wanted to get all my personal info.  I'm sure there is racism, but stupid police stuff can happen to anyone.\n",
            "But but but...racism in the U.S. is a myth.  Trump said so...",
            "https://www.dailydot.com/via/911-calls-racially-profiling-black-people/\n\nNot the first article I've seen published on this. People in America still call the cops when they see A Black. Fantastic work, OP.",
            "Let me guess, usa? Lol ",
            "The deleted comment was me being an idiot...\n\nThought I was in another sub",
            "This sounds more like a mental health problem of the women then 100% ignorance, just how simple it was",
            "\"Alright ma'am what's he doing?\" \"He's just walking menacingly\"",
            "I'm glad you guys took it with a laugh. I think that's the appropriate response. I'm not surprised at all by this, and I doubt she even had any real bad intent. A secluded older person, raised in the 50's-60's, would probably hold these views without understanding how it's inappropriate.\n\nAnd there are some crazy people out there. Hell, this year we have teachers forcing white people to apologize for their skin color. There's probably not any real bad intent there either. People just have a way of believing without consideration.\n\nThings like this should not be met with anger, but with reason and understanding. (An understanding for them being a little 'nuts' that is)",
            "People are stupid",
            "I work with old people can confirm.",
            "Sounds like you need a policy against racists and her phone number should have a special note on the file.",
            "Wow. All this talk about \"not having enough black Oscar nominees is racism\" and this shit is going on.\n\nReally puts racism into perspective. "
        ]
    }
]