[
    {
        "post_id": "o2uk8h",
        "author": "ElmerTheAmish",
        "title": "No Dirty M*******",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o2uk8h/no_dirty_m/",
        "score": 29895,
        "num_comments": 1494,
        "created_utc": 1624036252.0,
        "selftext": "Short and sweet. The names are made up, and the location doesn't matter. \n\nI work for a flooring company, running installation for one of our markets. The vast majority of the crews that work for us are filled with guys (and the occasional gal) from Central America. Being in a state with blue cities and red country between, we definitely get some of the \"Good Ol' Boy\" mentality from some of our customers. \n\nWe had an install go out months ago, and the customer specifically requested: \"Don't send no dirty Mexicans to my house.\" While we have some guys from Mexico, we truly have the gamut of Central America represented in our subcontractors. So we do our schedule, not sending one of the guys from Mexico. \n\nThe salesman was in the installation office when the customer called, rather frustrated: \n\n>Customer: I thought I told you not to send Mexicans out here.   \n>  \n>Salesman: Yes, sir, you did.   \n>  \n>Customer: So why are there Mexicans at my door saying they're from your company.   \n>  \n>Salesman: Well sir, it looks like Gustavo is out to your house today. Gustavo is actually from Honduras. \n\nAt that point, the rest of us couldn't hold in our laughter, so the salesman left the office to finish the call. Gustavo and his crew were allowed into the house to install the flooring, but we haven't made a repeat sale to the customer just yet.",
        "permalink": "/r/MaliciousCompliance/comments/o2uk8h/no_dirty_m/",
        "comments": [
            "I used to work at a museum. One day we had a very difficult woman come in and the front desk had to call the cops.  When the two cops- one white one not - showed up she started screeching and yelling that she  “wasn’t gonna be a arrested by a f-ing Mexican”\n\nThe non-white cop just sighed and very calmly said “well ma’am I’m from Puerto Rico so I guess I can bring you in”\n\nThe woman was so flabbergasted that the cops were able to get her in handcuffs and halfway out the museum before she started screeching again.\n\nEdit: since more people saw this than I thought I should mention that I was not actually working this day and blatantly stole this from my mother who was working.",
            "It's really weird to hear this story in Texas and other places along the border. OK, you don't want Hispanic subcontractors, so that leaves Jennifer in accounting and she does terrible grout work.",
            "> but we haven't made a repeat sale to the customer just yet.\n\nwanted to say that is a beautifully executed finish.",
            "I work at a coastal hotel in Oregon, so in a very redneck part of the state. Lady comes in to check in, sees me and asks if there is a white clerk to check her in. Am east Indian so I put on a thick accent and tell her no there is not(think Apu from the Simpsons). She asks if there's a manager, I tell her there is. She asks to see him. I ask her to wait and walk behind the door, put on a managers vest and badge and walk back out and ask her if I can help her in my best British accent( attended Cambridge University so came quite easily). The look on her face was precious. Needless to say I asked her to take her business elsewhere in the nicest way. On her way out, cusses me and says \"Fuck you\", and I tell her \"Sorry I don't do dogs\". I thought she was going to have a heart attack from the absolute anger and hatred she radiated. Turned all shades of red. I was ROFL.",
            "I was convinced you were going send someone from Mexico along with a signed note certifying that they showered that morning.",
            "That's hilarious. I hope that you gave your employees a bit of a heads up about the guy!",
            "When he first requested no \"dirty Mexicans\" I would have asked if he requires just the workers of Mexican descent to shower before arriving or all the workers. \n\nHonestly, the company should have refused to do business with a racist.",
            "I would've sent him gringos in sombreros that played Mexican music and only spoke Spanish.",
            "When I worked for Xerox as a service rep on multifunctional printers, my territory included some small towns outside the city. Once in Doctor’s office I was using my laptop to diagnose a software issue and an older gentleman was sitting in a chair watching me. Finally he came and talked to me, he remarked that he was amazed that a “Mex” was doing this kind of work. He asked if I had to go to a special school to learn how to do a white man’s job. I told him I was in the Army, had a security clearance and repaired cryptographic communication encoding equipment. After that I went to a community college and got an associates degree in Engineering Technology. He stared at me for a few moments, shook his head and sat back down.",
            "As half Mexican I salute the good sir, this was funny af.",
            "I’d paint ceilings but never install floors.  They’re beneath me.",
            "As brilliant as this malicious compliance is, i wouldn't feel safe as an employer sending out someone who looks 'mexican' to a client who specifically says no Mexicans. \n\nFrom the perspective of my employees safety, against someone whose clearly very comfortable being racist. \n\nIm sure there are specifics as to why this was probably not important, but I just think back to our cronulla riots. People were attacked for 'looking Arab'",
            "The right thing would have been to refuse them service, but well played anyway.",
            "Jim: You’ve got to remember that these are just simple farmers. These are people of the land. The common clay of the new West. You know… morons.",
            "I was unlucky enough to have a tree go through my roof and house during the last hurricane and if it weren't for illegals and Mexicans I'd still have the tree in my house. The best contractor I could find, hires skilled carpenters and roofers as subs - and he didn't care where they came from. The workers he sent worked their butts off in 95-degree weather.",
            "Poor Gustavo, I hope he was given a heads up and was asked if he ok doing that. It would make me extremely uncomfortable to work in the house of someone like that.",
            "I seen this crew doing a roof one time, all of them Hispanic, they were playing music and drinking all while putting a roof on in the middle of the summer at the hottest part of the day. That roof looked awesome. My two cents worth but skin color doesn’t have shit to do with work ethic.",
            "I would have fired him as a client after the first racist bile spewed from his mouth. Imagine the hostile bs that Gustavo and his crew probably had to deal with from that guy. \n\nGood luck finding a contractor that doesn't work with immigrants. Contractors are so in demand right now they can pick and choose what clients they take on.",
            "I am sorry sir if my choice of competent installers does not meet your qualifications for work inside your home.  Sorry but due to our non discrimination policy we will not be able to install your flooring and your deposit is being returned ASAP.  \nWhat should have been said to the \"bigot\" guy.",
            "Flooring installer here. Long Island NY, I won't hide that. There have been far too many times where the customer has said something to me and my coworker along the lines of  \"wow, I can't tell you how happy I am that you're white, and speak English!\"\n\nLike bro we get it you're vehemently racist",
            "Another way to MC this would be to send him all Mexicans with a certificate of being freshly cleaned.",
            "Fuckin' Pennsyltucky, man. I feel you.",
            "My malicious compliance for this situation would lead to this type of call:\n  Customer: I thought I told you not to send Mexicans out here. \n  Salesman: No, sir, you specifically said DIRTY Mexicans. They all showered prior to coming there so you’re good!\n😂",
            "I’m from Cuba and when I was young I was called a dirty Mexican often and treated badly by my melanin handicapped peers mercilessly until the Cuban Missile Crisis, when being Cuban became relevant. Then I became a dirty Cuban.",
            "It always amazes when a racist client finds out I'm 100% Mexican halfway through a job. Sure, they'll treat me with the utmost respect, but are clearly rushing me to finish so that I may leave they're precious house. I like to take my time at that point and point out everything that I'm doing in detail in my most professional courtesy. My kindness really makes them wildly uncomfortable 🤣🤣🤣",
            "you could have sent someone from Mexico, and just say you made sure they had a shower this morning, so he isnt a \"dirty\" mexican, and you are happy to send him the photos as proof",
            "Back in college I worked in a car dealership. I sold new cars and shared the building with the “no credit, no problem” used car sales. One of the most awkward parts of the job was greeting customers and trying to figure out whether they wanted a new Mazda or a 25% rate on a used camero so I could hand off the credit customers as needed. \n\nWell, one day, a black man comes in and demands a used car salesman. The caveat was that he didn’t want a black salesman. I had never heard such a request before in my life and asked him to repeat himself. “NO BLACK SALESMEN!!! THEY WILL RIP ME OFF!!”\n\nI told him I couldn’t honor that request and that I would get him whoever was first available. Knowing that it would look like compliance with a strangely racist request, I had no choice but to find a black salesman for him instead. It just so happened that this was my favorite salesman who I trusted to sell my mom a car. I warned him, everything went fine, and the guy bought a car from the black salesman.\n\nI guess my point is that your company shouldn’t have complied at all, malicious or not! If the customer was white I would have asked him to leave, no manager needed, no questions asked.",
            "“No sir, I’m pretty sure we sent the right Juan to do the job”",
            "The house next to mine didn't have anyone living in it for a time. It went into foreclosure and the price was super low. My (deeply conservative) mother was like, \"omg what if a bunch of mexicans move in next to you\" and I instantly, without thinking about who I was talking to, replied: \n\n\"THAT WOULD BE AWESOME\"\n\nShe glared such icy daggers at me, muttering something about \"your generation is what's wrong with this country...only YOU would think that having mexicans living next door to you would be a good thing..\"",
            "Similar thing happened to my coworker. Our customer service in the Philippines got an angry customer who demanded to be transferred to \"someone in America\" and got my coworker, who is indeed in America, but is born in eastern Europe and ESL.",
            "Was the intro a nod to “Who’s Line Is It Anyway”?\n\nI hope so, cause I loved it.",
            "I would have sent whoever and told them that we sent Americans.",
            "I worked in a call center and we had a guy get upset that he was talking to a girl from Mexico. He demanded her supervisor. The girl was actually from Peru. Her supervisor Julio from Panama takes the call and the guy gets even madder because it’s another Mexican. He wants the manager. The only other person we have available is Robert from Mexico. So Robert takes the call. He is very polite and helps the guy. At the end of the call he tells the man that he was the only one from Mexico he spoke to that day.",
            "I like how you censored the most offensive of words, Mexican!",
            "Poor Gustavo having to deal with them",
            "Although, what would have been even better, would be a, \" No sir. We do not accommodate racist preferences. Good luck with your projects! We will be here, should you develop a conscience.\"",
            "Fuck that customer in general",
            "Why not just refuse service to people like this?",
            "Funny shit. I know a guy from Florida that immigrated to British Columbia. To him he's not an immigrant because he's white. Continuously hates on first nations people, and to him, everyone from south of the border in the states is Mexico. I've come close to putting my hammer through his face, I'm not Mexican, but I am Latino, and my nieces and nephew are half Mexican. Thankfully I don't have to work with that piece of human garbage often.",
            "I was at a comedy club once and brought one of my Hispanic friends. The comedian on stage gestures at him and ask, \"What are you? Mexican?\" \n\nFriend says, \"No, I'm Argentinian.\" \n\n\"OH, so you're a *fancy* Mexican.\"",
            "Stopped at a Mexican restaurant in Oklahoma and this one guy was making a big deal to his table about he didn't order Mexican he ordered a hamburger i was so tempted to ask you came to a Mexican place and ordered German food.?",
            "You should have sent Mexicans, there's a double negation\n\n\"**Don't** send **no** Mexicans\"",
            "Poor Gustavo. That doesn't sound like an inviting job site.",
            "I have not realised that Minnie's Haberdashery is contracting for floor work.",
            "I couldn't give a rats ass about someone's ethnicity, as long as the job gets done right. What is wrong with people :/",
            "Guy I used to work with called a roofing company to replace his roof and asked them to bring out the white crew. I just shook my head…\n\nI work along side some hard working, nice, and hilarious Hispanic men and women in construction. Racism is fucking stupid:",
            "[deleted]",
            "I really don't understand people who think that someone's skin color/etc. is of any relavence. And in my experience, some of the best construction work that's ever been done was done by people from somewhere Spanish speaking.\n\nAll that matters is if they do their job well.",
            "> \"Don't send no dirty Mexicans to my house.\"\n\nAlso acceptable MC: send the Mexicans to their house... immaculately, cleanly showered, with freshly laundered clothes and perfectly polished shoes. \n\n\"Sir, you told us not to send you dirty Mexicans.  We sent you the cleanest ones who work for our company.  We will obey your every command.  Your satisfaction is our only goal.\"",
            "I assure you Juan took a shower this morning, sir.",
            "The story repeats and repeats.  The woman on the phone told when she’s in American she needs to speak English who politely replied that she was speaking Navajo and if you want to speak English, go back to England.\n\nOur country is wonderful.  So much variety. Better than other countries at having different cultures and different ethnicities that do a pretty good job on being together. \n\nWith notable exceptions.  But we are getting better. And we NEED TO DO BETTER!",
            "Wtf do people in Amurica have against Mexicans? My best neighbors have been Mecican. In my personal experience, they maintain their property, are devoted to their family, work their butts off and tend to be friendly. And, if you're nice and they are having a party, you only have to walk past to get invited in for tacos. THEY LITERALLY INVENTED TACOS!!  How could anyone hate that?",
            "I put a bid for a reconstruction project. The GC told me to lower my estimate. Reason, I have a mexican crew and they work for less. I was 😡.  My crew makes good money because they are top notch. I told him the price stands, they will get paid accordingly or we move on. Done.",
            "Why would you even deal with a client like that. Fuck those type of humans.",
            "I would have sent them all and said “no worries they all showered first, no one is dirty”",
            "Racist! At my husbands job No one likes to go to the mountains where all the hillbilly’s live. They had to hire a white dude because no one wanted to make those trips ( they deliver construction materials ) the white dude they hired is married to a black women and he don’t wanna go deliver to the mountains either 😂.I would of dropped that customer. I hired a Mexican dude to remove my fire place and stucco all the exterior of my home and he did all that for 4,000. When I was looking for estimates I had called this company and they sent a white dude and he gave me a 12,000 quote…fuck yeah I went with the Mexican company. They did a excellent job and they even installed a air conditioner at no extra charge.",
            "I'd have had my \"white\" employees roll around in the dirt and get greasy before sending them to the job. Playing Mexican music.",
            "What about clean Mexicans? Freshly laundered Mexicans? Newly Minted Mexicans? How about some Limited Edition Mexicans?",
            "Did this exact job for a while in the Deep South!  If I scheduled a Hispanic crew and we got the racist call that they didn’t want them in the house I canceled the job and hit them with a 20 percent material stocking fee. When they called back livid I would explain that the contract they signed obligated them to pay the fee because they refused the job at scheduled time and date of install. One guy pulled this shit after all the pad was down, my crew left and he had pad and rolls of carpet in his driveway and they got rained on a couple hours later.",
            "Technically, if you did send a Mexican worker, you could say they were clean, they had a shower that morning. Why you wouldn’t want the best person for the job, regardless of ethnicity, boggles my mind. I’d rather have a skilled craftsperson do the job, personally, instead of insisting on one of a certain ethnicity.",
            "> The names are made up, and the location doesn't matter\n\nIs this a Whose Line intro?",
            "No repeat sale because Gustavo does a good job and his flooring is holding up.",
            "I appreciate everything about this post, but most notably the intro.  None of this \"obligatory\" filler crap people add to their post.  Thank you for being the change we all want.",
            "Similar story, but at a tire and suspension shop.  Guy says he doesn't want \"the dirty Mexican\" to do the job, so when he came back and saw that the Mexican mechanic was working on it the manager told him \"Oh, well, we made him go home and shower before he started so he is clean now.\".  \n\nHonestly we should have let the white dude work on it though, he was a habitual drunk and horrible mechanic. Passed out and pissed himself in a car once. The owner's dad had hired him when he ran the place and the owner felt obligated to keep him around.",
            "Poor Gustavo having to deal with them",
            "Underlay underlay!",
            "I wish every story here was like this. Clever lede, succinctly written, and flawlessly executed. Bravo, I am completely satisfied.",
            "You should of sent a mexican and said we verified he did indeed take a shower, so he is clean.",
            "I am married to a Mexican national and we own a handyman company, however I'm just the project manager, not the handyman. An important client referred someone to us and when I said that I was going to send Jose out, they insisted on knowing if he was legal. I was incredibly offended at the mere question, but because of the situation with another client, I went to give a very high bid and found an easy out. Racists drive me crazy.",
            "I think the only other option, besides sending someone from a different latin american country would have been to send a clean mexican!\n\nYou can also offer white folks to do the job at an extra $10 an hour (for the company, not the white employee)",
            "Not sure if anyone else has said this (likely so), or if perhaps I’m imagining it… but was that a “Whose line is it anyway?” Reference at the beginning? \n\nAlso, excellent story :) deliciously malicious lol",
            "Francisco is from Brasil, and he doesn't speak any Spanish...only English and Portuguese",
            "Kind of like anyone who looks Asian is automatically labeled as Chinese or maybe a Japanese",
            "I actually had the reverse of this happen. I had a contractor (white guy) come out and give me an estimate on my roof. He actually asked me if I had any issue with his crew being Mexican. I was like HUH?? Why would I care? He said he has had many customers who turned them away. Freakin sad.",
            "I rebuilt a house after a flood, the best quality workers I contracted with all had a teenage kid on the crew, or a wife or girlfriend who would translate my requests for me. Only communication needed to the hard workers for my appreciation of their work was giving them cold drinks to keep them hydrated.",
            "You got my vote before I ever read past the first paragraph just cuz the Whose Line reference",
            "I lived in Moscow in the late '70s, my dad was posted at the Canadian Embassy. I got shouted at in the streets for being American. I shouted back that I was Canadian, they stopped shouting.\n\nIt was stunningly easy to get into the American Embassy compound, though. They hosted movies for all the English speaking kids from the embassies on Saturday afternoons, so we were let in without much questioning.",
            "I love all my Mexican peoples!!",
            " My boy Eduardo is more than qualified to vinyl plank your trailer, he mostly does bamboo staircases and shit but he says this keeps him grounded",
            "I worked with some Jamaican fellows in the tobacco fields of Southern Ontario in the late 1970's, (there were only two white guys, me and a friend) and it was everything he and I could do to keep up with them.\n\n We finally had to ask them if we could slow down the priming machine down a tad. (We finished almost every day by 1pm at the latest, while the farm across the road worked till 4 or 5pm, being in a tobacco field in the heat of the day sucks) \n\nI have never had more fun or worked harder than I did that summer. Never tell me that \"immigrants\" are lazy, they'll work you under the table.",
            "As someone who has worked with legal and undocumented workers since the 1960s, currently, professionally, plus my next door neighbor these are some of the hardest working, talented people I've ever known. Their work ethic is incredible. The only people who have ripped me off consistently over the years were white privileged contractors. How *they* treat laborers is horrid.\n\nGo to the local high school and ask some of these kids to work as hard as they do for such little pay and they will laugh at you.",
            "So I admit my prejudices as an old, white guy in construction.  I would hire a Mexican over any white guy - as they (Mexicans) usually have great work ethic, are polite, skilled, and fast.  Us white guys on the other hand . . .",
            "This is awesome.",
            "Later that day…\nCustomer: \nDamn, that’s a nice lookin’ floor!",
            "Technically you did not comply. He requested that you *not* send a lack of dirty Mexicans.",
            "So racist, should have wanted the best workers,  even if they were green😂😂😂",
            "My racist elderly neighbors kept yelling the wrong racial slur to the Latin American construction workers near her house. My brain fought against correcting her slur or let her ignorant ignorance shine. Shine won.",
            "I build houses in Forida. Sounds like a similar market to yours. If I ever had someone make a request like that I doubt I’d handle it as smoothly as your salesman did. Luckily, people that bad seem few and far between!",
            "funny enough if you actually work in construction you will find that many legal mexican-americans absolutely hate illegals also lol.",
            "It’s like Kiwis. We don’t want to do jobs in New Zealand 🇳🇿, but complain when immigrants come and do them! Prime Minister wouldn’t let in immigrants, saying ‘Kiwis will do it’, a lot of fruit rotted on the ground!",
            ">Don't send no\n\nThat's a double negative, you better fuckin send it bud",
            "> Being in a state with blue cities and red country between\n\nSo, all of them?\n\n&nbsp;\n\n> Don't send no dirty Mexicans to my house.\n\nI would've cancelled the order right then and there.",
            "You were technically correct, which is the best kind of correct.",
            "This is fantastic lol",
            "good on ya, legend",
            "Painter: But we are from Guatemala, won't he know the difference?\n\nMichael: I think anything south of San Diego is going to work just fine",
            "As a \"dirty Mexican\"\nI love this",
            "I'd have sent a Mexican with a bottle of hand sanitizer 🤷\n\nFuck that racist POS \n\nGlad you don't have to deal with him anymore 😁",
            "I love this. Very well done.",
            "The weird part is day laborers often get between $25-$40 / hr. for that back breaking work.",
            "Especially funny since most Americans won’t even know where Honduras is situated..",
            "I once knew a Gustavo from Chile",
            "Better off blacklisting that guy"
        ]
    },
    {
        "post_id": "oa3k8t",
        "author": "BbqinHell",
        "title": "You say that you order is less than a kilo? Let's weigh it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oa3k8t/you_say_that_you_order_is_less_than_a_kilo_lets/",
        "score": 29650,
        "num_comments": 862,
        "created_utc": 1624952568.0,
        "selftext": "Disclaimers: on mobile, English isn't my language, if you want to share it elsewhere, drop a link. \n\nA bit of background: I own and operate a bbq and grill restaurant. We run a special promotion for the Euro. We have a promotion for 1kg of skewers (pork or chicken) for 6,50€.\n\nThis happened on Saturday night. A group came to watch the match between Belgium and Portugal. One of them is a guy known to almost of the restaurant owners in town. Let's call him Dick. Dick has a tendency to complain about the food, in order to get freebies (either something extra or the whole order). \n\nThey place their orders and about 20 minutes later they're served. A few minutes later my head server, Mary, comes inside (sit downs are only permitted on the patio due to the pandemic) furious. \n\nMary: Give me the scales!\n\nMe, slightly confused (I was sweating over the grill, since we had a lot of orders): What for?\n\nMary: Just give me the fucking scales!\n\nI give her the electronic scales, she grabs an empty plate and heads outside. I follow her, because I know that something is up. She goes to the group that includes Dick, puts the scales on the table and proclaims \"Let's weigh them!\".\n\nYou see, Dick had ordered the promotion and then said that his order was missing almost half of it and demanded four more skewers \"to make it correct\" (his words). Now, in almost any other place he would be probably right. Most of them buy their skewers already made and they weigh between 100 to 120 grams, which means that a kilo is usually 10 skewers. But we prepare our skewers in house and are much bigger, between 180 to 220 grams (which is written on the menu), so our kilo is usually six of them. So, basically Dick was demanding almost another kilo of meat for free.\n\nDick, smugly: Yeah, let's weigh them and then you can bring what you still owe me!\n\nMary grabs the skewers and a fork and starts removing pieces of meat and placing them on the scales. Initially, Dick has a very smug smile. But he starts to frown when 3 skewers are emptied and the scales shows more than half a kilo of meat. Finally, with the second piece from the fifth skewer, the scales shows just above a kilo.\n\nMary, holding the remains skewers and smiling smugly: It seems you were right about the order not being correct. We put more. I'll take those (waving the skewers in her hand) back to the kitchen. Enjoy your food!\n\nMary returned smiling to the kitchen and put the skewers aside, while Dick ate his kilo of meat sullenly and the rest of his group smirking.",
        "permalink": "/r/MaliciousCompliance/comments/oa3k8t/you_say_that_you_order_is_less_than_a_kilo_lets/",
        "comments": [
            "I think Mary needs a raise.",
            "Good waitress there, helping that man make sure he stuck to his diet and didn't eat to many calories!",
            "That was so satisfying to read. Give Mary the support of all of us internet stranger. She deserves it",
            "This for sure happened with feeder fish at the store I used to work at. We had a customer say we shorted him fish so we recounted them and he was three over! So we took them back and gave him the right number. He was big mad.",
            "6,59€ for 1kg of meat in a restaurant seems to be an awesome deal! I'd not dare to complain, I've once seen someone complaining on a neighbor table, the waitress took the dish back. The smug grin of the guy was really annoying me, even if it shouldn't bother me at all but he was loudly boasting about how he'll get it for free and you could see it on the faces of the others on his table how fed up they were, probably not the first time he did that. \n\nThe waitress came back a few minutes later and grinned, told the guy \"I'm sooo sorry, we are out on <dish>, do you want something else then instead?\" Her smug grin went even wider when the whole restaurant were laughing and he left embarrassed. Then she came to our table and wanted to take our orders. I said \"bugger, I wanted the same\" - to which she cunningly in a low voice replied \"When I think about it, we might still have some more\" and came back,  brought me his order, for free! We gave her a big tip of course.\n\nThe one or other way, it doesn't pay to be a Dick in a restaurant - they are the ones who *make* your food, they could do anything to it if they wanted!",
            "Why is Dick not banned from all these restaurants if he has a reputation for doing this? Strength in numbers. Just ban him.",
            "Never mind that they're being weighed after cooking. Most places sell meat based on raw weight, and there is some weight loss during cooking.",
            "Oh that felt *good*. Mary deserves a raise alright",
            "Oh I think Dick DEFINITELY got skewered with that one!",
            "My grandpa has a restaurant and such move would leave \"Dick\" banned for life.\n\nHe's done it for less",
            "Don’t mess with Mary.",
            "First, that sounds like an amazing promotion.  A kilo of skewers...damn, I almost want to book a flight right now.\n\nSecond, I love hearing about barbecue around the world.  How would you describe your type/style of barbecue?  Is it unique to your country or influenced by other regions?",
            "You know I have to say for English not being your language, you have better grammar than me. All I can say is that’s hilarious malicious compliance.",
            "A kg of meat for €6.50 is a bargin already! Id struggle to just get raw meat for that price",
            "I like Mary!",
            "As a Fat American, a kilo is a lot of meat. Sounds delicious. \n\nAlso, someone get Mary a raise. And ban dick.",
            "I love that story! It’s great every time!",
            "My mom told me a similar story from when she worked at Yellowstone. Apparently a woman complained she'd gotten fewer fries than her friend so my mom weighed both their orders and took the extra off both",
            "I think you need to change the name to Mary’s place after she owned that fool..",
            "Mary had to serve a bully.  Who claimed his plate, was not served fully. She weighed it out, and fixed the amount.  The look on Dick's face is now sulleny.",
            "Every restaurant should ban DIck. If he can’t get served anywhere, maybe he’ll learn a lesson.",
            "Great story, but I just wanna say I love how you named the rude customer Dick",
            "I notice that when she said, \"Just give me the f\\*\\*\\*ing scales\", you didn't question her further.\n\nSmart move.",
            "[deleted]",
            "What restaurant is this so I can **make sure** I visit and eat there next time I'm anywhere near it?",
            "This gave me so much joy",
            "oh this is awesome. i think i am in love with Mary lol",
            "Something is telling me this happened in Greece. The combination of skewers, love of football and the spirit of Babis the Ellinaras",
            "Fuck yes, Mary. FUCK. YES.",
            "Interesting.  In the US when you order something like 1 kilo of meat.  The kilo is the weight of the meat before it was cooked.  After cooking it would be less.",
            "Brilliant.",
            "Do not mess with Mary!",
            "But skewers are heavier than feathers",
            "So uh, I thought meat weights usually reflect weight BEFORE cooking? So the served weight is significantly less?",
            "r/deliciouscompliance",
            "I love Mary. I wish I had many Mary’s working in my restaurant.",
            "The nicest part about this is that Mary isn't missing out on a tip cause it's Europe :p",
            "Why is it weighed post cooking? I’ve only ever seen meat sold by weight raw due to water weight loss when cooked.\n\nI’m not saying that this story is fabricated, but I’m confused by that not insignificant detail.",
            "This should be done to all chronic complainers.",
            "Wouldn't the meats weight be before cooking?",
            "How can you even eat a kilo of meat alone?\n\nI'm pretty hungry all the time, and even I can eat maybe less than half that if I have no sides with it holy shit.",
            "My only thought after reading this story:\n\n\"man, I could go for a kilogram of meat right now\"",
            "Idk Mary but I would love have a beer with her",
            "Dick gets skewered himself.  Oh, snap.",
            "Hahaha. What a loser. I hope his friends made fun of him the rest of the night.",
            "Mary had a little lamb.....skewer.....",
            "Mary just became my favorite \"Hall of Fame\" server.",
            "I want to go to a place where a kilo of skewers is only €6.5",
            "Reading this was great stress relief",
            "Don't know how it works elsewhere in the world, but in the US a restaurant can throw out a patron and tell them to not come back.  Banned.  It's usually a pretty drastic measure, so restaurants don't want to get a bad rap about throwing people out, but this sure sounds like Dick is a prime candidate for this.   \n\n\nAnd yes, Mary's actions for the win.",
            "Dick is a dick.",
            "What kind of people lack enough self respect to go to a restaurant with someone like that. If you haven't already you should crosspoint to /r/takesfromyourserver",
            "Mary is awesome.  I already like this woman!",
            "Who the hell eats a kilo of meat?",
            "As an American, I love the metric system. I understood the ratios of meat and skewers and everything though out your entire story. Metric's *10 base* system is sooo much better than the Imperial *confusion based* system.",
            "r/serverlife",
            "Absolutely love it, have to say those skewers sound absolutely delicious.",
            "Hahahahahahahahahahahahahaha\nThank you, this made My day😂🤣",
            "It's beautiful!",
            "Damn and Im now hungry for kebabs. Those sound really good and at a good price.",
            "A kilo of meat for 6.50?  I'm moving where every you're located.",
            "Mary sounds like a class act. Bravo.",
            "While he's complaining on the drive home, his wife is telling him, \"That's what your cheap ass gets\".",
            "it is a kilo even after being grilled ? That is impressive. Where I am from it is usually weighted before and then put on the grill.",
            "\"Let's call him Dick.\"",
            "How much of a lard ass do you have to be for 2.2 pounds of meat to not be enough for one meal?",
            "who the fuck eats a kilo of meat tho",
            "*Dick got skewered!!*",
            "Over 2 pounds of meat for under 8 bucks? WOW... Incredible, I literally paid 25 bucks last night for1/3 pound of pastrami 1/3 pound of brisket and a side of beans with 1 piece of white bread for Kansas city style BBQ...",
            "And Dicks meat got skewered",
            "fuck you DIck!",
            "Best malicious compliance I've seen in a while !",
            "How can someone like that still have friends",
            "My boss has fired many customers for being like this. We had a record year through COVID. Dumping shitty customers will NOT affect your bottom line. Put these pricks in their place. \n\n\nThe other great thing is all our staff are empowered to fire customers at will. It’s rare that it happens and some people are too shy. I never pass up the opportunity to tell a customer to get bent. We’ve never had our business impacted.",
            "Well done Mary. If she wanted to really make the point, she could have gotten a batch of fresh meat, weigh out a kg, have it put on skewers in front of dick, and then have that cooked. Then he'd get even less meat than what she left him with.\n\n(That only works if, like in Canada, meat weights on menus, are for the pre-cooked weights.)",
            "damn... 1kg of food and he wanted more?\n\ntalk about gluttony.",
            "Mary is amazing. This is gold",
            "I used to go to lunch with a friend like that.\n\nI used to.",
            "Sounds like your place needs portion control. \"giving away the profit\"",
            "Okay where do you work.\n\nLike the price is extremely good I would go to your place once a week if I would live there",
            "I would pay 6 euros to just not be so embarrassed and make a scene like that.",
            "Greece? Cyprus?",
            "Don't ever let Mary go buddy! You got a top employee right there!",
            "I've read this story before, I'm thinking it was /r/KitchenConfidential? I don't necessarily mean this exact story but someone else posted something really similar to this a long time ago, with the same ending and everything.",
            "And that was cooked weight?!?! That restaurant is losing money.",
            "A ton malaka",
            "I'm surprised that he didn't come back with something like, \"Your scale is rigged\".  Dick sems like the kind of alleged person who would always have a \"yes, BUT...\" response every step of the way.",
            "Dick is a piece of shit",
            "He was skewered.",
            "This happened to me at my old job with wings all the time. When you say a pound of wings people always expect 11-12 no matter what, and would get pissed at me when they only had 8 or 9. They were just big wings with lots of meat on them so they weighed more.",
            "A kg of meat? Jesus.",
            "That's fantastic! Mary is a keeper.",
            "When food is sold by mass it usually relates to the uncooked weight...",
            "Kilo? 2.2 pounds? That's a lot of meat? Am I just dumb right now?",
            "Who the fuck eats a fucking kilogram of meat? (That's over two pounds of meat, for all you medievals)",
            "Mary should have taken the extra meat back inside \"to make it correct\"\n\nEdit: I misunderstood the story",
            "Sounds Irish 🤣",
            "Who the fuck can eat two pounds of meat in one sitting?",
            "And then you shot the customer in the face... Because this is a drug deal and homie don't play that.",
            "Mary clearly knows a thing or two about meat sticks",
            "Που είναι η προσφορά αυτή; Επίσης ωμό βάρος είναι διαφορετικό απ το ψημένο βάρος.",
            "how is somebody unable to determine if something is about a kilo by hand?",
            "[removed]",
            "Things you could never do in America because you wouldn't get tipped"
        ]
    },
    {
        "post_id": "pftk2z",
        "author": "Creepy-Analyst",
        "title": "Bank won’t let me withdraw all funds? Ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pftk2z/bank_wont_let_me_withdraw_all_funds_ok/",
        "score": 29611,
        "num_comments": 1167,
        "created_utc": 1630501719.0,
        "selftext": "English is my first language and I’m typing on a laptop so I expect you all to judge this post harshly.\n\nI moved from Pennsylvania to Michigan a few years ago and only go home once a year or so.  A few years back I transferred the vast majority of my bank account to Michigan, but they were giving me a hard time about closing the account and so I withdrew all funds except for $1.31.  \n\nI haven’t touched the account since that time so two years later I get a notice for inactivity stating that I will be charged five dollars if my account remains inactive for 2 years.  I spoke with 3 different people on the phone but they would not let me close out the account without incurring a fee and since I’m never moving back to that town I refuse to pay them or add any money to the account.\n\nCue MC- so I have to interact with the account once every two years or else pay you five dollars? Fine, give me $0.01 please.\n\nWhen I was there in person last month I withdrew one penny from the account so now it’s good for another two years.  The attendant definitely gave me a weird look but at this rate my account will remain open for the next 260 years!\n\nEdit: grammar- thanks for calling me out!",
        "permalink": "/r/MaliciousCompliance/comments/pftk2z/bank_wont_let_me_withdraw_all_funds_ok/",
        "comments": [
            "We did something similar with a car loan. It wasn’t supposed to have an early payoff fee but they insisted it did and would cost $100 to pay it off early. Instead we paid it down to $1. They kept sending monthly statements saying we are current and our next payment isn’t due for 48 months or whenever. Finally at the end of the year they closed the loan out on their own without any fee.",
            "Then you turn around and deposit the money right back in. \n\nDoesnt it have bill pay? Just pay yourself a penny every once and a while. But mail it, so they have to pay the 50 cent stamp each time",
            "Upvote for the perfect intro.",
            "Oh, bless.   But I would still file a complaint with the regulating agency.  https://www.occ.treas.gov/about/what-we-do/index-what-we-do.html maybe?  Banks will fall over themselves to avoid a federal complaint.",
            "I don’t understand why a bank would give a customer a hard time for closing their account. Isn’t that just normal banking business?\n\nSo now they instead of them just sending you the remaining balance, they increase their own costs including postage & auditing. Wtf?",
            "Just keep withdrawing and depositing the same penny.",
            "If you get free bill pay checks you can also send yourself checks for $0.01 and then deposit those elsewhere.  Then your $0.01 withdraw costs them significantly more than the fee to close the account.",
            "you should setup a direct deposit of .01 per pay.  hopefully there is a small cost to your bank for DDs",
            "Hilarious.  Back in the 80's, when everybody had money to burn, my dad kept getting letters from a bank he did not use.  \"Hello Llunedd'sdad, we have opened an account for you at our branch and deposited 25 cents in it to get you started.\"  My dad would go down to the bank, a block from his office, withdraw the quarter, and close the account.",
            "Make sure they send your bank statements by snail mail.",
            "I had an account with BofA for a long time when I was younger.   I don't recall the exact details at this point, but they pissed me off.   Similar situation to OP, they wouldn't let me close the account without either depositing more money or paying them a fee.   Well, I didn't want to play their game.  This was back in the 90's, when banks were throwing free no fee checking and even savings accounts around.\n\nIn the end after a couple of payments and transfers, etc, there was left a grand total of $0.12 left in that account.  At the time I did \\*not\\* have paperless statements.\n\nSo every month they would pay for three sheets of paper (gotta have their promotional materials, ya know) , toner, envelope,  and postage (roughly $0.40 at the time).  To send me a statement for the 12 cents I still had in that account.    It was legitimately the one piece of mail I loved to get every month.   And immediately stuff into the shredder.\n\nThey kept that up for 5 years.   Eventually, though, someone figured it out.  So I received a letter in a large envelope ($1.25 or so of postage on that one) stating that my account was being closed due to inactivity and that they were enclosing a cashiers check for the balance in my account.\n\nIf memory serves, the check said I had 180 days to deposit it.\n\nOn day 179, I took it to the local branch and cashed it.",
            "Just an FYI most inactivity fees are there to force close the account. They won’t turn you into collections or chexsystems for it. So if you leave it sit and get hit with the fee, it’ll just get the account closed.",
            "Ummm is this Wells Fargo. Had a similar nightmare.",
            "Some banks will only count activity if its a deposit. They may still charge you the fee. Source: USA Banker",
            "[deleted]",
            "I'd make thousands of transactions of 0.01, put it in, take it out, as many times as possible, then make them give you paper statements. Cost them huge amounts for being complete A holes.\n\nEdit_\n\neasy to do with online banking, take 5-10 minutes when your on the toilet to start transferring money back and forth. No issue with tax or income issues from all the transactions because it's pennies, but will have to show up on bank statements!\n\nYou can also put a reminder or note on the transaction, F U BANK. lol",
            "I expect your will to say when you've passed on....\n\n\n\"And Suzy. My dearest Suzy, your now entitled to my entire bank account of $1. My only wish in life is for you to take out 1 single penny every two years.\"",
            "My Uncle had a similar story. Back in the early '80s, when it wasn't uncommon for small local banks to have accounts that had no fees, he was moving out of town and went through the drive-through on a Saturday to close his account. The teller informed him that he could only close an account inside, and the lobby had closed at noon and would not reopen until Monday.\n\nHe withdrew the whole dollar amount and left the change in the account, moved, and sent them a change of address form. They continued sending him a letter every month with his statement long after the point where the stamp alone was more than the balance. It was many years before they stopped grandfathering him in under the old offer, probably cost them hundreds of dollars before it was all done.",
            "I had a similar one with a credit card.   After going back and forth on a disputed fee, it wasn't worth my time any more so I just paid it - intentionally over by $1.00 - and cut up the card.\n\nFor the next 6 months I'd get a statement showing a $1 credit balance.   After that, they closed the account and issued a $1 check, which I didn't cash.   Which lead to more letters, another reissued check, more letters....\n\nI figure it cost them at least a few multiples of the original amount of the dispute.",
            "Because you are obviously American, your first mistake was claiming that English is your first language. Other than that, I loved the post.",
            "It's even better. the account can remain open forever since 2 years from now you could deposit the penny you withdrew. So you could keep withdrawing for 258 years, then just alternate withdrawal and deposit for eternity.\n\nalso.. perfect opening. it made air come out of my nose.",
            "English is my first language and I’m typing on a laptop so I expect you all to judge this post harshly.\n\nUpvote for this!  Love it!",
            "In two years, put the penny back!",
            "Though I enjoy playing their game, you should probably check into the fee schedule for the bank to see what rules govern the fee to close the account *and* check what the rules are for account closure. Sometimes banks require a $0.00 balance to close an account without incurring a fee, some will automatically close an account with a $0.00 balance. You can also mail a written request to close the account. Generally banks will charge for the wire out of the remaining funds *or* a certified check, that's why the $0.00 makes it easier to close. If it's a larger bank they may even let you close it out online -- especially since COVID and them having to do more business online....but if it's a big bank, account closures impact their numbers to shareholders...so who knows...just my $0.02",
            ">English is my first language and I’m typing on a laptop so I expect you all to judge this post harshly.\n\nFlawless formatting, good syntax, orthograph and writing, entertaining story, I give this 2/5. Would read again.",
            "[deleted]",
            "What is the name of this shitty bank?",
            "If there's a way to periodically transfer money from one account to another via NetBanking (my bank has that, idk about others), make that account transfer $0.01 to your active account every 23months indefinitely. Then, you don't have to do it manually every 2 years and there's less chance of you forgetting to do it.",
            "260 years? Time to put together a family trust to keep up the tradition for generations.",
            "I had a free checking account. After having this account for over ten years, a bank teller changes my account status to a  paid for account without talking to me while I was standing in front of her. I said thank you. And now I would like to withdrawal all my money and cancel my account",
            "Make sure you opt for paper statements so you can keep track of your balance",
            "Heaven forbid you end up delivering pizzas and get stuck in a cryogenic freezer for a couple thousand years. Then you'll be wishing you had that silly $1.31 left in there to compound interest. Or at least that's what the TV told me.",
            "Second sentence of the story, it's *were*, not *we're*. :P",
            "I hate banks for this reason, there's always arbitrary rules with 0 flexibility or common sense.  The world is full of bankers and MBA's who will spend a dollar to chase a nickel, and it's maddening to the rest of us.",
            "Who do you bank with that doesn't charge a monthly fee (if certain criteria aren't met)?\n\nJP MORGAN/  CHASE is getting stupid with their monthly fees and limits on certain transactions.",
            "Great MC. :)",
            "You should create an auto ACH transfer from one account to the other and back so it has activity on it. Just make it transfer .01 on it's own.",
            "You should file a complaint with the consumer financial protection bureau. I did once, and my months long fight with a credit card company was resolved within days.",
            "Make sure they mail you the monthly statements at ~50+ cents a pop.",
            "Use their online bill pay to mail a penny to your own account every 23 months to keep it going forever at their expense.",
            "I gave you an Upvote for the very first sentence.  Now I'll go read the rest...hahahahaha!",
            "“ English is my first language and I’m typing on a laptop so I expect you all to judge this post harshly”. Haha. Good one!",
            "Welcome fellow Pennsylvanian-who-became-a-Michigander!\n\nWas 24 years ago for me. But I also had an issue closing out a bank account. My last job there was paying me via direct deposit and even after 2 months of no new deposits, the bank wouldn't let me close until I had the previous employer fax them confirmation that I no longer worked there.",
            "Upvoted immediately after just reading the first line.  Genuinely laughed out loud.",
            "I had to get a cashier's check for $0.01 to pay off a mortgage recently. The mortgage company would only accept the final payoff either by a mailed cashier's check or wire transfer. Luckily, when I told the teller at my local bank that he waived the $8 fee for the cashier's check. I still had to waste a stamp and envelope not to mention a lot of my time doing it.",
            "This has not happened to me, but a story/rumor that sprung up in the time of Corona when a bank started to charge a fee if you are withdrawing less than a specific amount from the teller instead of the ATM to reduce the human interaction/crowds inside the bank.\n\nThe ATM outside the branch was not working so a man entered the branch to withdraw the money and was met by this rude teller stating the new rule and that you can go to another ATM instead, the man said OK, and withdraw more amount to exceed the one with the charge, took what he really needed and asked the teller to deposit the rest.",
            "That first sentence had me laughing. Have an upvote!",
            "ITT: No one understanding the time value of money",
            "I have worked in banking for years and we do this sort of thing for people all the time. Some states legally force the bank to hand over unclaimed assets after a certain period of inactivity. To prevent that from happening we just get the person’s permission to withdraw $0.01 and then redeposit that same $0.01. Just like OP said, it’s enough to keep the account active for another year or so.",
            "This reminds me of the guy who used GameStop as a bank. Reserved every game he could for $5, then when he needed money, he went in and canceled the games. When he wanted to deposit, he just bought a bunch of preorders for $5.",
            "Been in banking for 20+ years. These are actually state laws not bank policies. If the account has no activity for a certain period of time (determined by each state individually) the account must be “escheated” and the funds sent to the state. The state then hold on to it for another predetermined period of time and if it isn’t claimed the state takes ownership of it. It happens to a lot of account when people die. Same thing for safe deposit boxes. \n\nNote: there is no reason they don’t have process for you to close the account. If you don’t want or need it, close it. If you let it go and it starts incurring fees and you overdraw it could effect your ability to have accounts at other banks in the future.",
            "Upvoting purely based off the first sentence alone 😂",
            "How can you charge closing an account? Sounds so illegal to me",
            "My dad closed an account then got a bill in the mail for a dime. He called asked why they sent a bill and pointed out the stamp they mailed it with was more. They asked if he would mail a check. After some back and forth they warned him their would be a late fee. Dad said ok, when it gets to a dollar, he’d pay it. It took months and each month they’d mail him a bill.",
            "I'd drop it down to 2 cents, withdraw the penny and then redeposit the penny every two years. Why let them profit off the extra $1.29?",
            "Once I closed an account at Bank of America. The banker pushed back, pushed back, pushed back… I had moved to a different state where there was only 1 Bank of America ATM (no physical locations) in the whole state. The ATM was an hour drive away from me and was withdraw only (as I found out one day when I drove two hours round trip to make a deposit). They finally let me close the account.",
            "I left $20,000 in a savings account knowing I'd need cash for a down payment on real estate. It stayed there longer than I meant but earned a whopping $.18  in interest over like 8 months. I went to get a bank check for 20k and they handed me the remaining $.18 in cash, if you can call it that. I figured that would be the end of it but of course not. They didn't close the account after it was zeroed out and there was another $.01 credited in interest the following month which the bank happily charged me $10 / month to maintain. Like a year goes by and I see a statement for -$119.99. I fucking lost my shit on them, made them credit the fees and drove to the bank for them to give me $.01.",
            "> English is my first language and I’m typing on a laptop, so I expect you all to judge this post harshly.\n\nFTFY. \"So\" + independent clause = comma before \"so\". To judge if a comma is needed, replace \"so\" with \"therefore\". If it \"works\", the comma should be there.\n\n(Just to beat you down further, I'm Swedish.)",
            "American banking is weird. Charges for inactivity.",
            "Or deposit the same penny back next time you go.  This could last forever.",
            "The best part is when the bank also decides to send you paper notices for your bank account with $1.30 in it.\n\nLike, after a year the postage alone cost you more than it would to just close the fucking account guys. I'm happy to let you keep spending your stupid cash though. Your letters go straight to the recycling bin.",
            "That sounds like some policy wells Fargo would rock",
            "I had a similar situation with a bank in Texas years ago, but learned that if your balance is exactly $0 then your account will automatically close if two banking cycles pass. The teller wouldn’t let me withdraw the last $123.45 or whatever because that would create the close account situation.\n\nSo I withdrew enough to get to a round number, then went outside to the ATM and withdrew the last $100.\n\nTwo months later my account automatically closed.",
            "Absolutely love your opening paragraph 😂 You’ve got quite a wicked sense of humor.",
            "A few years ago my student loans automatically got their last payment. But somewhere between the time of the payment and a few weeks later, 78 cents of interest accrued on the account and they sent me another bill. I went online to try to pay off the remaining amount, but they refused to accept any amount less than a dollar. I thought I would be forced to wait the approximately 26 years until the 78 cents collected enough interest to be over a dollar, but a month later they automatically closed it out.",
            "The English was too good, you’ve earned a downvote for explaining too well and concise XD",
            "Can you set up an automatic money transfer from your Michigan account to your Penn account? If so set it up to transfer the penny once per two years and you don't need to remember it or visit a counter.",
            "if it's a checking account. write a check to yourself for one penny. it will cost them more to process it then",
            ">English is my first language and I’m typing on a laptop so I expect you all to judge this post harshly.\n\nI haven't read further than this yet, but I'm upvoting for this bit alone.",
            "When you are connecting two independent clauses with a “but,” you need a comma before it. You used “we’re” which means “we are.” You should have used “were.” You also connected a third independent clause with an “and” also not using a comma. But really that should be it’s own sentence for the sake of the reader. Three joined independent clauses borders on madness. \n\nSo it should be: “A few years back I transferred the vast majority of my bank account to Michigan, but they were giving me a hard time about closing the account. So I withdrew all funds except for $1.31.”",
            "I've had so many issues with banks and their ridiculous fees!  You are my inspiration and BANKING HERO!",
            "First line made me chortle",
            "Have my Hugz award for the PERFECT introduction and a terrific story of Malicious Compliance!!! :-)",
            "You are an unsung hero, sir.",
            "There's talk to eliminate the penny. Are you withdrawing electronically or physically one coin?",
            "This is the pinnacle of petty compliance.....and for that I applaud you.",
            "5/turd bank did samething but instead of electronic notice, sent letter to my old house and charged 500 bucks, sent for collection.. and as naive as I was, paid that in full.",
            "They tried to charge me a fee when I went to close my account at one of the \"big banks\" here after moving everything to a credit union that wasn't going to charge me ridiculous monthly fees. \n\nI got pretty visibly angry instantly and when I questioned it the teller immediately just waived the fee and closed the account. Felt bad for the teller probably having to deal with shit like that a lot when it's not their fault.",
            "Set up an automatic draft from your current account. Bonus points for setting up an automatic deposit in the other years to even it out.",
            "Op now everybody knows bowman pennies u got and where u live. Be safe",
            "Never heard of being charged a fee to close out an account.  Congrats to you for doing this.   If you want to take it a step further, after you withdrawal a penny, you should then deposit that penny right back in.",
            "Etrade used to charge an inactivity fee ($40 per quarter I think) if you didn’t buy or sell a stock. But if you use bill pay 2x a quarter then no fee. So I used to transfer $40 to etrade and pay myself $20 twice via bill pay and cash the checks at my bank. No more fee.",
            "Hope you also turn off electronic statements and instead get them to pay the USPS $.50 every month",
            "Banks are so weird! Had an account for years to receive a small direct deposit, and paid two very small bills from it. I opened a savings account with the same bank. Someone hacked my account, or\nsome mistake was made putting\nmoney into my account, then was quickly withdrawn. The bank closed\nboth my accounts! I didn’t do\nanything ! Very crazy🤬🤬",
            "So who actually funds these types of places?",
            "Yeah its called a dormant account. It's a federally regulated thing. I dont know why the bank wouldnt let you pull your money out before the 24months though. Thats dumb",
            "Asking as a European: Why is banking so cumbersome in the US?\nI had to transfer money to a US company for an international deal a few years ago it felt like something medieval. I even had to include the bank's postal address to make the transaction work.",
            "[deleted]",
            "I had an annoying situation with an online savings account that offers 3% interest (Porte). The catch is that you can only withdraw $1,000 a month through bank transfers, and $1,000 per day from the ATM in cash.\n\nHowever, they allowed brokerages to debit the account for any amount. So I withdrew the cash into my brokerage account, then withdrew from the brokerage account into my main checking account.",
            "I do something similar if the supplier gives me a hard time. They are often ending up in some fight with me over some or another.\n\nSo I pay their invoice in full, plus $4, so I am always in credit with them.\n\nThey have to send me a statement every month; they try to call me, it shows up in their books. They spend more trying to get me to take the money back than it's worth.",
            "If they waive the fee between customer's accounts, open a second account, and then have a timed transfer of paying 1¢ between them... Forever.",
            "I upvoted immediately, purely on the strength of the first sentence.  Did not regret.",
            "Now what you need to do is leave that account to someone in your last will with instructions to withdraw a penny every year and a half",
            "Haven't really got much to say about this apart from that that first sentence had me laugh-snorting so hard I think I ruptured my nostril.",
            "I also had an account go 'dormant' on me from inactivity. I contacted the bank and they made it active again. Now each month I have an automatic transfer of .01 from my chequing account to the formerly dormant account. (I have no transaction fees, so this works out great.)",
            "I might be missing something, but isn't this just more hassle for you without actually doing anything that'd inconvenience or annoy the bank you're mad at?\n\nYeah, the teller might give you an odd look and yup, they're not making any money on your $1 account, but having to actually go there and get your 1c feels like you come out negative too. No banking manager or exec is gonna think twice about this, I doubt the cashiers even care beyond \"That's weird.\"",
            "Ive got something similar with an old brokerage account. I tried to close it out but somehow they left 1 (one!) Share of some garbage stock. They refuse to close it and instead send quarterly reports of 5 or more pages updating me on the status of my $5.38 of stock. It's been 5+ years and running.",
            "A charge to close an account?",
            "I had an inactive account bill me $10/month for a while before I noticed it.\n\nI ate that - my fault. But considering an inactive account doesn't cost them any more than an active on, fuck them. I've now setup an automatic $10/month withdrawal, and an automatic $10/month deposit.",
            "Sounds like my first bank account. I had used it as a child but I switched banks when I got my first credit card at 18 (so my chequing account and credit card would be from the same bank). \n\nI got a letter saying that I had an inactive account and to go to the branch to deal with it. \n\nI don’t need the account anymore so I go in to close it - well it is going to cost like $15 to close the account and transfer the funds to my current account. So I figure I’ll just withdraw the money. Well it costs $10 to reactivate the account so I can pull the money out. So I ask what happens if I do nothing. Well then they will eventually close the account and take whatever money is in the account. \n\nI ask how much is in the account - $2.35. \n\nI tell her that it is a good thing I am not banking here anymore and turn around and walked out.",
            "I was tempted to respond with maximum grammatical pedantry, but it's too much effort. \n\nI love this one. In fact I love any malicious compliance against financial institutions.",
            "fyi, this practice is illegal in the US. in 2010 a major national bank was brought up on charges for this very behavior, they entrapped account holders into fees when their accounts fell below a threshold or they tried to close the account. They were forced to forgive all accounts, as they could not determine which accounts were closed and became over drafted due to fees and which were due to account holder negligence.   \n\n\ni dont know whom you should take this up with, but its a legal matter none the less. - while your complying maliciously, its undue stress and suffering against a hostile action.",
            "Well done. Old bank bastards \"upgraded\" my account to one with a monthly minimum without telling me. Tried to charge me a $35 overdraft when they took the $10 fee from my account with like $3 in it. That was a fun conversation. Actually went over to the bank in person just to say what the fuck. They agrees to wave all fees and I gave up the $3 and change. Took a handful of lollipops off the desk when I got up to leave.",
            "Second paragraph second sentence has a missing noun reference. Who is “they”? B-",
            "Upvoted due to the opening paragraph",
            "Up vote for the first sentence alone. Haven't even read the rest.",
            "Also, Data wouldn’t have real specific interests?",
            "I've had a credit of 1.06 on a canceled credit card for about 4 years now. Every 4 months or so, they send me a statement showing the credit, but there's nothing I can do. Chances are if I ask for a refund I'd have to pay some king of fee, so I just sleep well knowing they are wasting their postage.",
            "I love your first line!!!\n\nLove your MC, too!!!",
            "Monitor changes to policy, in case they define a minimum-balance fee. I'm surprised there isn't one already.",
            "Incredible opening line",
            "262 yesrs",
            "If you have a bank account that lets you schedule transfers you could also deposit $1 early in the month and schedule another withdrawal of $1 later on, I do this with all of my bank accounts (without the withdrawal) just to spread my funds out and prevent inactivity penalties.",
            "I just tapped the like button when I read the first sentence of English 🤣"
        ]
    },
    {
        "post_id": "9qojlb",
        "author": "Dingdongdelongwong",
        "title": "\"Everybody must know when I am out of office.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9qojlb/everybody_must_know_when_i_am_out_of_office/",
        "score": 29601,
        "num_comments": 665,
        "created_utc": 1540298190.0,
        "selftext": "So yeah, a couple of years ago I was working for an IT company which also provided server management and general domain and E-Mail services. We had some really big companies as clients, so we were used to some really idiotic demands, but most of the time we could convince the people whose main job seemingly was \"to be in charge\" to listen to our expertise. Not so Mr. Bigwig. Mr. Bigwig was the CEO of a large automobile sales company. He also was the type of guy who prided himself with being a \"great negotiator\" and \"thinking so far ahead, regular people can't follow\". And he was a complete ass to everyone.\n\n&#x200B;\n\nMr. Bigwig went on a holiday once and set up an automatic out of office reply in his mail account, but - as is the technical standard - everybody who wrote him during that time only received the reply just one single time. When Mr. Bigwig returned from his vacation this infuriated him a lot so he called our support line and yelled and cussed his way up our hierarchy until he had me on the phone. I tried to tell him that this was working as intended and tried to explain why, but Mr. Bigwig wouldn't have any of it. This went all the way to our CTO who sent him a waiver to sign, stating that we would deactivate this limitation, but not be liable for any consequences (in short). Then he told me to make the changes to MBs account. I tried to object, but the CTO just smiled, shrugged and went into his office. Mr. Bigwig was happy. He won and booked this as his latest negotiating victory.\n\n&#x200B;\n\nNow let us jump to December the 29th of the same year. I get a phone call. From Mr. Bigwig. He is not happy. He is not happy because he is blacklisted on about every blacklist in existence. He is also not happy because he can't receive or send any email. And he is not happy because he can't find any mail he received during the Christmas holidays or near them. He can't find them because the nice number in brackets besides his inbox folder, that indicates the amount of unread mails he has, reads 50,000. A quick look around the server logs tells me there are indeed some mails he did not receive. 150,000 to be exact. They are still pending delivery because his inbox is full.\n\n&#x200B;\n\nHe is also not happy because he is the laughing stock of everybody he ever respected.\n\n&#x200B;\n\nNow let me guide you as the reader to the bottom of this. What you don't know and we also did not know at the time is: Mr. Bigwig was member of a very exclusive group of business owners, CEOs and high ranking politicians around the globe. The kind of people you would imagine sitting around a large oak table, smoking cigars, drinking 200€ whiskey and discussing world dominance.\n\n&#x200B;\n\nThis group had a mailing list. A shitty, basic mailing list.\n\n&#x200B;\n\nIt went something like this:\n\n&#x200B;\n\nBigwig: (Out of Office Reply) Hey, thank you for you mail, but I am on holiday! I will reply later.\n\nSomerandomdude @mailinglist: Merry Christmas!\n\nMailinglist @everybody: Hey guys, Somerandomdude is wishing you Merry Christmas.\n\nBigwig @mailinglist: Thanks for telling me, but I am on holiday! I will reply later.\n\nMailinglist @everybody: Hey guys, Mr. Bigwig is on holiday, he will reply later.\n\nBigwig @mailinglist: Thanks for telling me, but I am on holiday! I will reply later.\n\nMailinglist @FUCKING EVERYBODY: Hey guys, Mr. Bigwig is on holiday, he will reply later.\n\nBigwig @mailinglist: Thanks for telling me, but I am on holiday! I will reply later.\n\nMailinglist @FUCKING EVERYBODY: Hey guys, Mr. Bigwig is on holiday, he will reply later.\n\nBigwig @mailinglist: Thanks for telling me, but I am on holiday! I will reply later.\n\nMailinglist @FUCKING EVERYBODY: Hey guys, Mr. Bigwig is on holiday, he will reply later.\n\n...repeat until the servers give out.\n\n&#x200B;\n\nSo B-Diddy was not the only one who had thousands and thousands of mails in his folder. All his fancy pants networking contacts had too. Mr. Bigwig raged hard at everyone who was brave enough to get on the phone with him, threatened to sue us for millions of Euros and to \"end us as a business\". We finally put him through to our founder, who listened to his rant and told him he would send him a solution within the next ten minutes.\n\nHe sent two documents: A scan of the signed waiver, in which the consequences of disabling the out of office message restriction were outlined in detail, and a service contract, allowing us to fix the problem to our abilities without any financial budget limitations, but with a really nice (read: enormous) estimated budget.\n\n&#x200B;\n\nIt was a good year for the company, with an unexpected spike in revenue, just before new years eve.\n\n&#x200B;\n\n//Edit: Thank you kind stranger for Reddit Premium! I have no idea what to do with it, but knowing somebody liked this enough to gild me with it makes me very happy :-)",
        "permalink": "/r/MaliciousCompliance/comments/9qojlb/everybody_must_know_when_i_am_out_of_office/",
        "comments": [
            "Yeah. I got to do this once. It was an automated monitoring system that had pretty extensive logs and would send out a summary email every 30 minutes.\n\nNew boss shows up and after a minor issue demands that we send an email every time we write something to the logs.\n\nWe go back and forth trying to explain that sending 5 GB of log entries split into god knows how many emails isn't going to work until the new boss just says, \"Do it because I said so and I'm in charge.\" \n\nSo we all shrug and get it ready to go for the next release and make sure that the boss is the only one getting the emails for this first release. I give our Exchange admins a quick call to let them know about the impending tidal wave of messages.\n\n5 minutes after we start the program up, new bosses email account is disabled and we get the call to roll back the changes from the heads of IT and Software Development.\n\nAfter that, every change new boss would propose had to get approved by the head of Software Development.",
            "-A computer program has an explicit limit of performing an action only once. \n\nSounds like it’s preventing a loop. \n\n-Please remove this limit. \n\nProbably will result in a loop. \n\n-The limit is removed. \n\nA loop results. ",
            "Mm-mm. I love a good story of \"Big man is an ass-douche and wants it his way. We give him exactly what he wants and now he's in shambles.\"",
            "/r/talesfromtechsupport would like this",
            "Founder and CTO reeled that one in. High fuckin' five to *them*.",
            "A tip/fyi for those that need more replies than the standard one time only Exchange does-\n\nhttps://www.symprex.com/out-of-office-extender/\n\nWe use it in our office.  It resets the out of office message at 12:01am every day.  You will only send one reply per address per day. \n\nInstead of the default for exchange, one reply and then no more until the out of office has been reset.  Someone is out of the office for 6 months?  Better remember their auto reply from 3 months ago because you aren't getting another reminder.",
            "I thought it was going to be that, another ‘out of office’ response kept replying to his and it just went on and on. But this is SO much better! \nNot only has he lost his shit and all the companies communications. But he’s fucked up the main form of communicate for the top 20 City CEO’s (or whatever they are) as well. Right round That critical end of year period.\n\nYour founders way of dealing with this is perfection 👌",
            "[deleted]",
            "I have a justice boner now.",
            "I once witnessed this happen inside a large institution, with spectacular results. [Here’s my writeup](https://reddit.com/r/talesfromtechsupport/comments/420oan/companywide_email_30000_employees_autoresponders/).",
            "Listen to the people who know what the fuck they are talking about!",
            "I've been seeing this more and more on this sub and I'm not sure I understand it. Why are some of these stories marked NSFW? They don't seem nearly raunchy enough to be marked that way.",
            "Our director managed to bring down our (tiny and outdated) mail server by trying to forward everyone a funny video. His mail client kept retrying because delivery timed out. He spent the better part of the day hovering over the shoulder of our server guy trying to figure out how to unclog everything.",
            "Holy hell I have a relevant story\n\nSo in my last job as an T2 email support we have enabled a feature to allow people to send as public folders. Some of the public folders also had auto-replies....\n\nSomeone at some point decided to send as a public folder with an auto-reply,  to a public folder with an auto-reply.\n\nWe had gotten these types of tickets before. Turn off auto-replies, delete the few hundred emails(max) wait like an hour and turn auto-replies back on. \n\nNot this ticket. Because lucky us the people behind the original recipient were not checking their public folder at the time but they were storing incoming email for later processing.\n\nSo we got a ticket to go stop and auto-reply loop and delete the emails. We mounted the public folder to find 2.1 million emails. Turns out they hadn’t been checking the public folder for like 3 months. \n\nBest part of that was our maanager didn’t let us send the ticket to the server team for batch deletion and at the time we weren’t given access to powershell....so it was deleted all by hand. 500 emails at a time. Took about 4 hours. Not fun.",
            "I was a contractor for NASA a few years ago and a someone made the mistake of replying all to an agency wide email.  \n\nNASA has about 80,000 highly educated civil servants and contractors.  You can see where this  is going. \n\nThen some clever people though it would be funny if they too replied all.  \n\nThen some people were upset at their quickly mounting unread emails so they replied all to tell everyone else to stop.  This in turn caused people replying to all about how it was ironic. \n\nThis quickly spiraled out of control and after a few minutes emails were locked until everyone got it out of their system.  ",
            "[deleted]",
            "I work at an IT company and we've had this happen as well, with our automated ticketing system. When we update a ticket, it sends an update email to the client. The client can respond to the update email if they want to add anything to the ticket. Client's out of office message responds to the email and updates the ticket. Ticketing system sends an update message to the client. Rinse and repeat all night until about 16k emails have been sent.\n\nWe fixed that real quick.",
            "When someone comes to you with a waiver and an evil grin after trying to talk you OUT of something, READ THE WHOLE THING, and be afraid. Be very afraid. ",
            "Glorious! You gave him what he wanted and he was too dumb to know the consequences. Wonderful! Bravo!",
            "I read the title as \"out of coffee.\" I then read this whole thing and thought, what the fuck does this have to do with coffee. Lol.",
            ">He also was the type of guy who prided himself with being a \"great negotiator\" and \"thinking so far ahead, regular people can't follow\". And he was a complete ass to everyone.\n\nThere was someone like this in US politics recently.  Can't remember the guy's name.",
            "How the hell do people keep on making this mistake???\n\nSimilar cases with people going reply all on mailing lists over and over have resulted... just as badly.\n\nLook up Bedlam DL3.\n\n\n/r/talesfromtechsupport would appreciate this.",
            "I really miss the times when autoreaponders used to answer more than once. I also miss when auto responders used to quote both subject and text.\n\nI used to subscribe people annoying me with their autoreaponders to any marketing mailing list I could find - most were with opt in, but quoting subject or body with the auth token in the auto responder took care of that.\n\nSome mailing lists have the auth token in the subject, but unfortunately not that common.\n\nI haven't had a chance to do that for a few years now. ",
            "[deleted]",
            "I did this once in IRC. I set up a script that would send a message when someone mentioned me when I was /away,  however, I forgot that the message itself also would mention me. It was a good way to get banned by flooding 😂",
            "Bröther may Î have some lööps",
            ">Mr. Bigwig was member of a very exclusive group of business owners, CEOs and high ranking politicians around the globe. The kind of people you would imagine sitting around a large oak table, smoking cigars, drinking 200€ whiskey and discussing world dominance.\n\nILLUMINATI CONFIRMED!",
            "I had a similar situation where I had created an auto-reply for my vacay, and within about 90-seconds of my running it I got a phone call from corporate: “TURN THAT OFF!!”  It turned out in that time I had auto-replied to everyone who had ever sent me an email in a matter of seconds.  One for every email I’d received.  I think it got well over a thousand emails in that minute and a half.  Great way to begin a vacation!",
            "I crashed our ticketing servers about a month ago because of a loop such as the one you described. I had a rule set up in our mailbox that if a message with a specific subject comes in, it would forward to my help desk. What I forgot was that upon receipt of an email our ticket system would send a reply...with the same subject. To which the mailbox would forward because, well, subject. To which the ticket system would reply and so on and so forth. 50 emails back and forth in 5 minutes. 400-something before we caught on (my help desk staff was suddenly addressing the same ticket dozens of times).  \n  \nThat's when the ticket system broke. It was eventually fixed, but that was a mistake a rookie makes, not a manager of a team of 25. And I understand and work with loops, using them for various dataset cleanings. But hot damn if I turned stupid that day. ",
            "My boss recently sent us instructions on how to setup an endless back and forth with a co-worker who is out of office for the week with the intent to kill his outlook. I think I landed on the right team!\n\n",
            "I work for an large company and one time a mass email got sent out about a new update. And a couple people replied all. So then like 50+ people proceeded to reply all to tell people to stop replying to all. It was a shit show. ",
            "\"Please remove the safety on this gun, so that I can shoot myself repeatedly in the foot\". ",
            "justice served",
            "**My Very First Mail Server**\n\nme: wonder what this setting bounce processing is, meh, I am sure we don't need it, lets turn it off.\n\nMe: ohhh out of office... AWESOME..  lets test that.\n\n..proceed to test it by sending myself an email.\n\nOne completely locked server, god know how many millions of emails to myself and 0 server hard drive space left.\n\nme: hmm, ok that's what Bounce processing does. Lets leave that shit on. yeah, good plan",
            "I worked for the airforce in their exchange department. At some point someone nested a very large distro group into a very small new distro group by mistake and when the first messages went out everyone in the large group would reply all asking to be removed from the mailing list.\n\nIt was bad enough that a few servers went down or had to be taken down and the queue cleared.\n\nThe air force ddos themselves ..",
            "Bring this over to r/talesfromtechsupport! Such a good read!",
            "Two rules everyone needs to learn. Don't fuck with the people that make your food; and don't fuck with your IT support.",
            "Power Delete Suite is helping me remove my presence from reddit in light of their recent decisions.",
            "Did he have his own mail server and IP? I don't care who is on the other end of the phone, I wouldn't be putting my infrastructure at risk of being blacklisted due to a client's request.",
            "To be completely fair, I did not wish anyone a merry Christmas on the mailing list",
            ">...repeat until the servers give out.\n\nLm fucking ao ",
            "Back in the early 90's when email was still new to a lot of people we had someone at our national office send out a message that there were cookies in the break room left over from a meeting.  He thought he picked the email group for all employees in his building.  Instead he got the group for all employees (40K+).  Then the back and forth emails started \"gee I wish we had cookies\" and the brain-donors were replying to the group email address which meant it went to everyone.  Within a couple of hours IT had to take down the email system, clean the messages and bring it back up one facility at a time.  Everyone got a lecture on the perils of \"reply all\" lol.\n",
            "Love it! Also what I suddenly realized is that most big CEOs didn't get there by being nice, normal people. They get there by being persistent and ruthless. So I guess what we see here as an assholisitic behavior is actually and asset if you're aiming for the top. A but unfortunate but completely understandable. ",
            "This might be the best malicious compliance story I’ve ever read",
            "We had something similar with our main \"info@company.etc\" email inbox. We couldn't use out-of-office as we needed the generic \"thank you for email, we will contact you in due course\" email each time as we could have many customers contact us multiple times over the course of several years.\n\nSo a rule was created to respond to every email with the generic response and that worked really well, until a company emailed us that had obviously done the same thing for their emails. \n\nI remember that Monday morning coming in to a ridiculous number of emails and seeing that number constantly counting upwards. Not quite 150,000 but still a panic on a Monday that would've been nice to avoid",
            "https://en.wikipedia.org/wiki/Email_storm",
            "What did I have to do with this?",
            "There are so many fucking asshats in IT. It's funny because the people who are actually competent and know how to get shit done properly never get promoted...partly because they're invaluable doing what they do, partly because the last thing they want to do is be an asshat manager like Mr. Bigwig. \n\nSo what happens is that you get these fucking imbeciles with no concept of how the internet even works who are good at something like ass-kissing or taking credit for other's work or sweet talking big clients, whatever. Those are the dicks that get promoted right to the top and make idiotic decisions like this. Malicious Compliance is the ONLY way to deal with them",
            "I had almost the exat same thing happen. My boss saw that other people had those nice \"out of office\" messages, and wanted one as well.\n\nWell, this was a long time ago, before mail servers had protections against that kind of mail loops. I strongly advised against it, but he insisted. When I came back next day, mail loops had managed to take down four customer mail servers as well as our server.\n\nHe never asked for that again.",
            "\"B-Diddy\"\nI can't breathe lmao ",
            "Wow. Yeah sometimes people really should just listen to their IT professional(s). Maybe Mr Bigwig learned his lesson but somehow I doubt that.",
            "> the type of guy who prided himself with being a \"great negotiator\" and \"thinking so far ahead, regular people can't follow\". And he was a complete ass to everyone.\n\nTrump was your boss????",
            "I love this story! Especially the foresight of the IT company to have him sign a *detailed* waiver.\n\nTo be entirely fair, though, although Mr. Bigwig was obviously an idiot, I'd attribute this *particular* incident more to a badly configured mailing list than to a badly configured auto-responder. Consider this: would you want the \"out of office\" notifications of everyone on the list being sent to everyone on the list, even once? You don't receive these on most lists, right?",
            "Don't kid yourself, these idiots drink more expensive whiskey than 200 euro",
            "We used to call this the \"Spiral of Death\". Way back in the day, Novell's Groupwise email platform did this by default. It would simply crush mailflow, among other things..",
            "I really love how the CTO and founder handled this guy. The fuck you, give me more money to fix this was the best possible approach and achieved the best possible outcome. \n\nEdit:typos",
            "We had this happen a few months ago. Our system sent out automatic invoices, and Mr Hotshit Lawyer didn’t feel the need to set that feature up. \n\n\nUs: Here is your invoice. Do not respond to this email as it is an automated email. \n\nMHS:  I am out of the office. \n\nUs:   this is an unmonitored email address. For assistance please email *humans*. \n\nMHS:  I am out of the office\n\n\nAnd on it went.  50,000 was the number I heard too, but no idea on the total pending behind the scenes. ",
            "Stopped reading and upvoted the *second* I saw the word **blacklist**\n\nEDIT: Tiny detail, but where's the NSFW part? Did I miss it?",
            "I lost it when you called him \"B-Diddy\" lol ",
            "Giant asshat gets what he wanted and then has to suffer his own consequences.  Pure MC!",
            "So this particular type of email spamming is called \"backscatter\" and is a common email spamming attack for misbehaving servers such as the one for your company that you mentioned. It's a nasty exploit and is hard to track down unless you catch it in the act. Solid revenge though. We used the same signing scare tactic for dumb execs also.",
            "Everybody interested im email storms should google \"Bedlam DL3\"  \n  \nedit: or read the original: https://blogs.technet.microsoft.com/exchange/2004/04/08/me-too/",
            "We call this an email storm at my work.  It’s what happens when someone improperly sets up the distribution list and doesn’t blind cc so it’s basically a reply all.  Hundreds of people reply back “please don’t reply all” until it shuts down the servers.  Me personally, I find it hilarious when people sneak in messages like “no one will read this but I put mayo on my hotdogs” or “anyone want to buy a 94 Camery” on a distribution list of 40,000 and you get 700+ spam emails...   People reading list will probably recognize my company but I don’t care.  I like to stir the pot when it comes to stupid things like this and started the chain up again after it finally died down 4 hours later. Lol",
            "...\n\nOh. My. God.\n\nTHIS IS AMAZING.",
            "Something I always hold up to:\n\nNever fuck with IT, not even if you're the president of the fucking World!",
            "I work telecommunications and have to work with IT on a regular basis. Internal IT, great. External IT, literally worthless at their jobs. Not a single person I have ever talked to can understand what is needed the first time no matter how many clarifying emails are sent. Love internal IT though. Also your system is bad for not having a prevention measure in place to stop a server loop like that besides limiting notifications to once.",
            "Wow. You should port this on r/talesfromtechsupport .",
            "I did this to myself once. I was relatively unknown project manager back then and only had a desktop machine at the office.\n\nI was on holiday for 2 weeks and set up a forwarding of emails to my personal email so I could still pick up work while away.\n\nI came back to 25,000 emails. I had typed my work email in the forward rule, not my personal one so the email client forwarded the email to myself, which then triggered the out of office message, which then sent the email to myself, which then trigger the OOO message, which then sent the email to myself....\n\nI had to spend the first half of the day just sifting through the OOO messages.",
            "Why is this NSFW?",
            "Going off on a tangent...\n\n>... The technical standard - everybody who wrote him during that time only received the reply just one single time.\n\nIt might be a good feature, rather than auto-sending the reply only once per vacation, instead do it once per day.  Or week.  This would help remind idiots that, hey, I'm on vacation.  Ought to be easy to implement too, just flush the cache of incoming addresses periodically.",
            "I sent somebody's e-mail server into an endless loop like that when I signed up for their forum and put spam@theirdomain as the e-mail.  Still, I imagine it can be fixed by keyword find/mass delete.",
            "Why is this NSFW tho?",
            "**tl,dr:** The mail system went into [sorcerers's apprentice mode](http://www.catb.org/jargon/html/S/sorcerers-apprentice-mode.html).\n\nedit: thanks for pointing out the spelling mistake.",
            "Classic self-takedown, nice",
            "Sounds like the boss was in the Bilderberg Group?",
            "Why is this NSFW?",
            "r/talesfromtechsupport jas a depressingly high number of stories involving email loops like this.",
            "/r/talesfromtechsupport ",
            "So how did you get the spike in revenue? \n\nI'm so happy to read this I'm just thinking that you charged mr bigwig for being a twat.",
            "This felt so good to read",
            "Fan-fucking-tasic!\n\nFlawless performance!",
            "As an IT guy this overfills me with joy and puts an evil grin across my face.",
            "'never stop the enemy from making mistakes..'",
            "As someone who has worked with some of these Bigwig customers too in IT, I love how this story turned out.",
            "this is gold 🤗",
            "I work for a recreational vehicle parts manufacturer. We service an even larger company almost exclusively. The President of my company is a rich old white guy, private jet and big boat type, he is the largest ass anyone has ever met. Pay raises havent happened in 5 or so years despite an massive increase in profit, and when asked about it he has complained about needing a bigger boat. It isn't rare to find him on the plant floor screaming at some poor bastard. \n\nToday, actually, we had a customer(outside dealer) come back and say something that shipped was wrong. We could hear him tearing the shipping department a new one. Later when the shipping lead is showing him how the thing is packed and all the parts needed. He just looks at it and complains about how he doesn't know where they go or why they are needed. \n\nBillionare likes scream but can't do any work with out any of us. He has no idea what is done by the rest of the plant. \n\n",
            "This story is made of kitties, puppies, bacon and concentrated WIN!",
            "I worked for a company that handled cloud hosted email for huge companies. One of our customers had a distro group that had literally EVERY SINGLE EMAIL IN THE COMPANY THAT EXISTED in it. Did I mention that they had upwards of 45,000 mailboxes? No? Well what do you think happens when someone sends an email to that group and people start replying all (primarily to tell other people to stop replying all...yeah)? That's right, total fucking chaos to the tune of over 1.5 million messages. We worked with the developers of the fucking system (Exchange/Outlook) to dive into each mailbox and delete everything. It took two days to remove all of the messages after spending at least a day ensuring all of our scripts ran right.",
            "Semi related [Bedlam DL3](https://blogs.technet.microsoft.com/exchange/2004/04/08/me-too/)",
            "Motherfuckin infinite loops \n\nHell yeah",
            "Legend!",
            "r/unexpectedjamesveitch",
            "It's an ego thing. A challenge for him, he has to demonstrate to himself that he can negotiate this situation and convince those poor schmucks they _~know nothing~_ do what they are told.",
            "Lost it at B-diddy. ",
            "B - DIDDY!!!!!!!! 😂😂😂🤌🏾",
            "gotta love people who don't understand email systems. the best stories are always the email ones.",
            ">The kind of people you would imagine sitting around a large oak table, smoking cigars, drinking 200€ whiskey and discussing world dominance.\n\nThis guy thinks 200 is expensive whiskey\n\n&#x200B;",
            "This is great. Thank you",
            "This is the real life equivalent of putting C4 on a vehicle in Battlefield and detonating it only to kill yourself but deal no damage to the vehicle because it was behind a concrete barricade ",
            "Insert Groot meme"
        ]
    },
    {
        "post_id": "coj02m",
        "author": "emmahar",
        "title": "I can only book over the phone? Ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/coj02m/i_can_only_book_over_the_phone_ok/",
        "score": 29510,
        "num_comments": 634,
        "created_utc": 1565448814.0,
        "selftext": "Super short one.\n\nA few years ago, I went to the doctor's to make an appointment (I had to go to the pharmacy next to it so thought I'd pop in instead of calling).\n\nReceptionist tells me they cant take walk ins (I didn't want an appointment then anyway), and can only take bookings over the phone.\n\nSo I stood at reception, got my phone out and called the number for the phone right next to her. I made eye contact with her, the whole time, as she answered the phone, and booked me in.",
        "permalink": "/r/MaliciousCompliance/comments/coj02m/i_can_only_book_over_the_phone_ok/",
        "comments": [
            "Should have paused mid-conversation to borrow a pen and paper from her to jot down the reservation details.",
            "Iafter hanging up, you should have said \"I'd like to confirm the appointment I set up over the phone 2 seconds ago. \"",
            "This exact story reminds me of a store in England that sold electronics (back in 2008 roughly) . I went in to buy a new graphics card and the website said in stock and the price, but in store the price was a good 20% more. I ask a member of staff about it and they said sorry but that's the online price and not in store. I argued that it allowed me to buy and collect in store at that price and they refused to help. So I pulled out my phone, bought it online to collect at that store, carried my item to customer service desk and said I was there to collect my item, they looked it up, printed a receipt and let me go.\n\nWhat a pointless endevour...",
            "Receptionist probably knows it's a stupid rule so she secretly enjoyed doing it too.",
            "LOL! What a ridiculous rule. Good for you.",
            "Please tell me you stayed on the phone making eye contact the whole time she booked you in.",
            "Not that I agree with this, but I kind have wish she would have fucked with you in return. After answering the phone she says \"I  have to put you on hold. I'm currently with a patient.\"",
            "Malicious compliance at its most glorious and petty!",
            "Similar thing happened to me. Went to a rental car place, walk in. They said they didn't have any cars available for walk ins aside from the super expensive exotic sports car. So I got out of line, went on their website, reserved the reasonably priced economy sedan, and got back in like to grab my keys.",
            "This happened to me as well but instead I asked while Infront of the receptionist with my phone out if she wanted me to call her. She went \" I will do it this time but next time please call\"",
            "My Dad claims to have done this too, and he's not generally prone to telling tall tales (and, uh, neither am I for that matter).\n\nThe way he told it, the receptionist was expecting him to walk home and call back from his landline, so when he pulled out his basic Nokia and dialled the surgery number she allegedly said \"You can't do that!\", to which he said \"You said I need to call. I'm calling. The phone is ringing. Are you going to answer that?\"",
            "We decided to go to a tourist attraction because we were in the area.\n\nI had a 30% discount on an app but they wouldn't accept it - it \"had to be printed out\".\n\nThey had a fax machine on the desk behind reception and its number on a list on the wall. So one quick \"email to fax gateway\" Google Search later my printed form churned out behind her and I went through again with 30% off.\n\nIncidentally that list also had since passwords on it but I wasn't feeling *that* vindictive...",
            "I had a friend do this on base. They wouldn’t take walk-ins for sick call. So, he stood there and called them. More people started doing this since it’s hard to call in sick when you don’t know you’ll be sick. They eventually changed the rule, AFAIK...",
            "My wife and I once walked into a restaurant to have dinner. The place was nearly empty, but the maitre d insisted we needed a reservation.\n\nWe asked if we could make a reservation for right that moment.\n\nShe got annoyed and told us to sit in the waiting area, then called some phone number to make the reservation for us. About 10 or 15 minutes later, we were seated. In the nearly empty restaurant (which didn't get much busier while we were there).",
            " I was traveling with my wife and dog and decided to stop for the night.  She looked up hotels that allowed dogs, found one close by with good rates and we pulled in to check in.\n\nI went in and the desk clerk told me the price was $50 higher than what we saw online. I asked about the discrepancy and he indicated that rate was only good for online bookings. And wouldn’t budge in the price.\n\nI walked away, sat down in the lobby, booked the room online and then walked back to the desk and said “I have a reservation”.\n\nHe pulled it up online and we got our lower rate.  Best part was, he forgot to charge us the $20 cleaning fee for pets.",
            "My husband explains that forcing people to make appointments by phone is a classist way to prevent people who don't own phones (poor, homeless) from getting a foot in the door.",
            "Not me, but a friend went to Walmart to buy a bike for his kid. The in-store price was higher than in their website. He was told they can't price match. So he whips out his phone, buys the bike and sets it to in store pick up while the employee was watching.",
            "Some where out there, a receptionist is telling her own story of malicious compliance of a company's insistence for booking over the phone, and the resulting queue of customers coming to the front desk to book an appointment by phone.",
            "That's nuttier than squirrel shit",
            "My kid's doctor's office never answers the phone, and their VM system is so convoluted that it is much faster for me to drive there and make an appointment face to face. If the receptionist ever objected (they haven't yet) I think I'd have a conniption right there in person.",
            "I see this as a sketch in some British comedy thing. Ricky Gervais is OP.",
            "Haha had something similar in nepal, found a place to stay for the next two night online that had a good deal, went to reception to book because it was only a block from the cafe, and they told us they couldn't do that deal. So we asked to use the free guest wifi, booked it online in front of them, then asked to see our rooms.",
            "Good eye contact with her.",
            "Sounds like a good reason to look for a new doctor. I'm not sure I could trust their judgement with rules like that.",
            ">I made eye contact with her, the whole time, as she answered the phone, and booked me in.\n\nMood.",
            "I've done similarish things before with a massive Monday morning Starbucks line I called my order in (for 4 people) then my drinks were ready as soon as I got to the counter to pay instead of them waiting another 10 mins after ordering.",
            "Boy, this sounds painfully familiar...\n\nMy doctor is a great man. He's knowledgeable, friendly, happy to serve his patients, and above all very funny and charismatic. \n\nHis receptionist is also his wife, and she is a ***bitch***. All of his patients hate her, but she ain't going nowhere...",
            "Such a weird policy. At my dentist I always make the next appointment in-person with the receptionist when I'm already there for a visit.",
            "Somewhat similar story: I was in Walmart once and found a Bluetooth speaker much cheaper on their website than it was priced in store. Initially the manager refused to price match until I asked her if she really wanted me to purchase it online and select the store pickup option and walk to customer service. Luckily she decided that wasn't necessary.",
            "[deleted]",
            "Sounds like Iceland.",
            "Lol, I hope you were facing her and talking to her in person with the phone at your ear",
            "Doctors offices often use 3rd party companies to manage appointments.",
            "I did just this years back, trying to get a follow up at a military clinic.",
            "It’s insane the lengths people will go to to be obedient. She just can’t break policy even when it truly does not make a difference. This happens a lot and I caught myself doing it at a former job of mine. Refusing to do something that is right in front of your face.",
            "I hate having to set up doctor appointments. I had one a few weeks ago and they told me \"We'll mail you your next appointment information.\" I received it in the mail 2 days later and since I didn't get to pick the day or time I now have to work my schedule around that which involves missing a good chunk of my shift at my job.",
            "I'm so irritated and I needed this laugh! Thank you, OP!",
            "I thought OP was gonna put the phone on the floor and stand on it and talk to her and then finally say it was worth it",
            "That’s comedy gold right there.",
            "I feel like I've read a MC like this before but I'm not quite sure where.",
            "Now this is malicious compliance",
            "“Ah, yes ma’am can I get directions to your clinic please?”",
            "Should have kept asking them to repeat themselves due to bad reception",
            "We once went to a Dominos for an offer they had. They said it is for delivery only. \nWe stepped outside the shop, placed the order, and had it delivered to our car that was in right in front of the shop. All the time we can see each other from the glass.",
            "Should have told her just a minute, you have another call coming through and put her on hold for a minute.",
            "Certain shops do this with online purchases, reserve online for a 10% discount and collect in store. It feels ridiculous and petty for everyone involved but I do it anyway.",
            "outstanding  move",
            "What a madlad",
            "Someone find the original post of this. I know ive heard this exact story on reddit within the past year.",
            "This is so incredibly stupid. What a bunch of nonsense",
            "Power move.",
            "This was an episode of Impractical Jokers\n\nExcept in that one, he said “Are you crazy, we’re packed?” And hung up on her right in her face",
            "Big dick energy",
            "Can I just say, thanks redditors. I've had a shit day, a really shit day. Posted this innocent story on here before my day went south, and I've come back to be accused of stealing other people's stories (with no explanation as to why I'd steal them, I don't get the benefit), accused of scamming the system, being a bitch, and lying. I've had a month or so on Reddit and genuienly saw it as quite a decent place with decent people. Thanks for un-restoring my faith in humanity, dickheads",
            "So many many places have this rule and this very solution. You'd think they'd learn. Sure it made sense (maybe) in the days of landline phones when everyone called from home, but now that everyone has a phone in their pocket? Not so much.",
            "When do we get to the malicious part?",
            "\"sorry I'm on the line with some bitchy receptionist\"\n\n...",
            "What's up with the upvotes is there an issue here ?\nEdit: I'll be elaborate ...I can't see anyone's upvotes and even when I'm upvoting I can only see the orange arrows ....",
            "I live in Wisconsin. Transplant from Arizona. They say \"can you borrow me...\" all the freaking time and it drives me insane! Along with...\"I seen that (this, them, it)\", instead of \"I saw that...\". I truly have to stop myself from dope slapping people.",
            "Haha nice! You totally showed that receptionist, who doesn’t make these rules and probably agrees they are dumb but has to follow them anyways...",
            "\"Yes sir. ... OK, I've got you set with the doctor in 15 minutes. We'll get the lubricant and colonoscope prepped for your procedure. ... Uh huh.... OK, have a nice day.\"\n\n(Maintain eye contact to assert dominance!)",
            "I watched a guy at the bar yesterday afternoon, call the bar to order a drink since the bartender gal was talking to other patrons. It was all for fun, but i for some reason found it hilarious",
            "OMG that is the most hilarious thing I've heard all day.  Definitely gonna be telling people about this.",
            "InfoSec — if you can browbeat the survivors?",
            "If you can please",
            "I have to do this with barnes and noble. find something I'm interested in see it's cheaper online, order for instore pick up with book already in hand. I usually play dumb and wait until I'm at the counter to do this. Waste my time ill waste yours too.",
            "I’ve seen this before???",
            "Hilarious, but technically not malicious.",
            "I have read this before haven't I?",
            "That's the way. Sometimes these things need to be done so the people behind such idiotic rules can clearly see how asinine their idea really was",
            "Hero",
            "Wow. Something I would do. You're my kind of person",
            "[deleted]",
            "Hey, I've seen this one!",
            "Not to take away from a good story, but having worked in the service industry, it wasn’t her rule. That being said, I have no idea the tone the receptionist used. Just thought I’d give an alternative point.\n\n(Edited to change a comma to a period",
            "Well done!",
            "Lol"
        ]
    },
    {
        "post_id": "kjr9hx",
        "author": "HungryAd2461",
        "title": "Boss agrees with secretary that I am not the office manager so I stop managing the office",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kjr9hx/boss_agrees_with_secretary_that_i_am_not_the/",
        "score": 29366,
        "num_comments": 546,
        "created_utc": 1608862206.0,
        "selftext": "When I was doing my articles at a small law firm (internship to be admitted as an attorney) I was the go-to person for everything at the office (setting up computers, buying stationery, paying bills, going to court, seeing clients,etc). After being admitted as an attorney I continued doing all this because the secretary only did about 20% of what a secretary would usually do and refused to do anything else. My boss does some shady business (don't pay taxes, etc) so he couldn't just fire her for fear of her ratting him out. He also never disciplined her. We are not in the US. \n\nSince we worked from my boss's mother's house, the secretary also spent about 50% of her day just chatting to his mother and they became fast friends. Guess who was always the evil one that everyone ganged up on? Yours truly. I was made out to be incompetent at my job and I used to cry a lot and almost became an alcoholic from work stress.\n\nOne day the secretary got really upset with me (after I asked her to buy stationery since we didn't even have staples) and after a heated argument told me that I'm not the office manager and should stop lording it about as if I was (bear in mind I was her senior both as an attorney and in number of years worked at the firm). My boss did nothing and rather got upset with me and so did his mother.\n\nI decided there and then I am done doing both secretary work and my attorney work because I was working roughly 50-60 hours per week (standard is 40) trying to get everything done without receiving overpay (the unemployment rate in my country is around 30% and in the legal field supply of lawyers exceeds demand). She knew this and my boss knew this but no one cared that I was basically working myself into an early grave.\n\nCue malicious compliance. If everyone agrees that I am not the office manager than I will stop managing the flow of the office and only do my attorney work. I stopped paying the bills, buying the stationery, reminding my boss of important meetings, etc.\n\nWithin two weeks the electricity was cut off for 10 days because it wasn't paid and my boss' elderly mother and the rest of his family had no electricity. We could also not work for those 10 days. Once the electricity went on, the phone lines were cut because of non-payment. We could again not work. The post piled up, there were no stationery. We couldn't do service of court documents because our service providers cut us off. It went on for weeks. I simply worked around the issues and sorted my life out (one example: when the wifi was off I used my cellphone to hotspot my laptop without telling anyone). \n\nIn the end my boss and his mother begged me to do what I used to do but I refused. Since I was focusing more on my actual work my fees increased and my pay increased as well. Shortly thereafter I moved away from that office to our secondary office and worked alongside lovely colleagues who all did what they got paid to do. I have been at this new office (same firm just a different location) for the last two years.",
        "permalink": "/r/MaliciousCompliance/comments/kjr9hx/boss_agrees_with_secretary_that_i_am_not_the/",
        "comments": [
            "so many times here I read about someone told to \"just do your job\", they do, and the company finds itself in a hole.\n\nwell done you, and more so for finding a way out of that rat-hole and into a nicer environment :)",
            "Great lesson. Overachieving just enables other people to be bad at/not do their jobs. Draw clear lines and stick to them - everyone is better off.",
            "some shady business (don't pay taxes, etc) ... We are not in the US.\n\nAt first I thought Greece, but no -- in Greece people don't consider \"not paying taxes\" shady.",
            "Hard work and dedication usually just leads to being handed more work.",
            "We have a security guard that helps mandate masks and social distancing while people are waiting for their food.\n\nOne day, we had a fuck ton of Togo orders and he decided to help bag the food, as nobody was here what so ever. The boss decided that he isn't allowed to do that so she yelled at him.\n\nNow he refuses to leave his chair like he was told to do, for any reasion what so ever, other than a patrol around the premises every hour. And the boss got upset that he was sitting on his ass.",
            "I just can’t get past the idea that someone working 50-60 hours a week is working themselves into an early grave. Sometimes I am forcefully reminded of how crazy American working life is, when I realize people in other countries don’t live like this. 😐",
            "By the way, you talked about how your old boss did stuff like not pay his taxes, when you switched did you end up reporting him?",
            "Upvote for using \"cue\" properly in a sentence: \n\n\"Cue malicious compliance.\"",
            "[removed]",
            "Well done. I am also a lawyer in a country with articling. I was lucky to article with a venerable firm, but even in that experience we had to do ridiculous things. Secretaries loved to use us as lackies rather than arrange the billing for couriers etc. A group of us tracked our time spent on secretarial and courier services and the top brass lost their shit at how much time we were donating to jobs that were not billing legal work. Anyone who knows anything about the legal business knows that lawyers need to spend their time billing.",
            "The firm has multiple locations but one is an employee's mother's house?",
            "Power shut off within 2 weeks? That's barely even enough time to mail a notice.",
            "A boss's best friend is his mother.\n\n\\-Norman Bates, probably.",
            "I ended up in a similar situation a few years ago, and instead of malicious compliance, I quit. \n\nThings were a mess, so I created processes to address he problems and made manuals for future staff in the position. I took care of contractors, paid bills, ordered supplies, trained new staff, organized meetings, stated up to date with privacy and health and safety regulations and made sure we met those standards. \n\nProblems that had persisted for ages were fixed and I was able to spend about half my day doing projects that we were technically required to do, but which nobody ever did in the past because they were busy bailing out the sinking ship. \n\n When a promotion came up for a role managing the office, I wasn't interviewed or considered for the role. I had a meeting with my boss to discuss this, during which he told me that I was never asked to do those things, and when I became upset by this, he told me that was evidence that I was clearly unsuitable for the role and that his decision to bypass me was the correct decision.\n\nLooking back, I wish I had taken with me all training, contacts, guides and resource material I had created, after all it wasn't my job to make it, so it's not company property.",
            "The ENTIRE first paragraph of this story was my life to a fucking T from 2014-2016!! Omg only the Senior Attorney (my boss) was screwing his paralegal, and they were the two ganging up on me. Wow. Spooky. Congrats on moving to a better situation!",
            "This sounds so familiar. It has to be South Africa.",
            "The saying at my company is \"No good deed goes unpunished\"",
            "What I find the most interesting is that your firm is big enough to have multiple offices but one of the offices is in someone's mother's house.",
            "If you're too good at your job they won't promote you because then who would do your job?",
            "They... left the utility bills for a private residence.... to an intern....",
            "It both amuses and saddens me that you have to point out you're not in the U.S. just to not have to deal with the whole \"well it's because they're backwards, unlike my superior country of \\*shitty nation\\*\" comments that would inevitably come.\n\nGood on you for standing up for yourself. It doesn't matter the location or field, shitty people going to be shitty if you let them. Hope things stay great for you.",
            "Congrats brother",
            "How did an intern have seniority over a secretary?",
            "You're not the office manager, of an office with 3 employees and the bosses mother?\n\nAnd this was the primary office? \nHow many people did the secondary office have?",
            "I did a similar thing. I was assistant manager at a retail bank. They decided I should have a sales goal and no longer be incentives for customer service: which was my main duty. I went back to sales mindset, made 2k more per month selling products to my customers who were loyal, and everyone else's sales goals TANKED. Anyone who was my loyal customer before, who I was passing off to my trainees for their sales goals, became money for me. I made an extra 8k before my graduation and lef to teach. The person who took my position begged me to call and tell my old customers that they were my replacement. I decided nah, they were there for my service and would be better off elsewhere. \n\n\nLiterally, that bank went from 1st in the region to being closed within 2 years. People were driving 20 miles out of their way to see me since I had helped them for years getting their businesses started, avoiding fees through the bank agreements, etc. In fact, I was called when my old coworker got a management position at a bank because they needed someone to start the bank off properly.",
            "This is some How to Get Away with Murder shit and I love it",
            "My personal standard for a good work ethic: make sure they miss you when you leave. Well done.",
            "You should never have been doing it in the first place. It’s insane you think it’s your job to pay the bills,etc.",
            "Sounds like South Africa",
            "Thought I was reading an updated Cinderella.",
            "i’ll never understand why some people will mistreat someone that is actually helping them out, like it happens a lot. i think they must subconsciously feel inferior/insecure and choose to take it out on the person that they perceive as so good",
            "They may have won the office politics battle but, you won the war. Sometimes people don’t appreciate what they have until it’s gone. It’s good that you stood up for yourself.",
            "I'd have asked for an email asking me to keep working on what \"wasn't my job\" before continuing.\n\nAlways collate a paper trail of managements double standards in case you need to rely on it later",
            "What could be the secondary office to his mother's house??",
            "Well done. But I don't understand something. If your boss is doing shady things about taxes and you're part of a bigger firm why isn't someone ratted them out to the firm? Is the firm shady as well? Do you work for your boss or for the firm? isn't your firm going to get in trouble for what your boss is doing and don't they want to know that?",
            "I love the idea behind wealthy people not paying taxes causing them more issue because, for example, the secretary who knows you don't pay taxes can't just be fired.",
            "Thank you for such a lovely story on this, the most depressing Xmas Eve of my entire long life.  I'm here in SF, the streets are dead, it's like being the last of the dinosaurs waiting to go extinct, and not even realizing it's all over.  \"You don't have to be a weatherman to know which way the wind's blowing\"",
            "Gg",
            "An \"internship\" for a \"firm\" run out of an \"attorney's\" mom's house... what?",
            "How the hell are you only working 40 hours as an attorney?",
            "Portugal?",
            "Good for you!",
            "Does she bring her cats to the office?",
            "Oh look a post from Brazil",
            "Let me guess...Spain?",
            "Are you in Brazil?",
            "One thing my dad told me was to do my job as best as I can and not to worry about anybody else job",
            "Hugo Boss.",
            "Hope you ratted them out",
            "This totally sounds like Italy",
            "[removed]",
            "Your country is not Greece by any chance, is it?",
            "Is this in South Africa?",
            "Sounds like the boss was banging the secretary.",
            "I love the mommy detail... It's like Queen mother of the firm xD",
            "[deleted]",
            "Thank you.",
            "Perfect “revenge”. Brilliantly executed. Cheers!",
            "You seem like Jim Halpert...",
            "Yeah, no; that's not in my job description.  Sorry....",
            "This gave me a fuzzy warm feelings haha! I’m so glad you stood your ground!",
            "Sooo, how often was your Boss banging the Secretary? \n\nBeen there, seen it, and explains the secretary’s attitudes and actions.",
            "Go you! Hopefully they learn from their mistakes after realising how much they were leaving for you to do.",
            "Good chance your boss was banging that secretary.",
            "“Since we worked from my boss’s mother’s house”..  sounds like a high end law firm. No red flags at all.",
            "I have a subreddit called r/Random_story and I was wondering if you would consider posting this story on the sub.",
            "Remember kids, Tax evasion is cool",
            "Remember kids, Tax evasion is cool",
            "Why don't you report him for tax evasion?",
            "I like how OP says “we are not the US” like we aren’t corrupt as hell.",
            "Good for you.",
            "[removed]",
            "You're an attorney, are aware that your boss is not paying taxes, and continue to work there.\n\nYou deserve to be disbarred.",
            "[removed]",
            "Well played!",
            "I am working 56 hours a week and I push up to 74 occasionally.",
            "[deleted]",
            "[deleted]",
            "Where in the world is electricity paid weekly and cut off after just 2 weeks?",
            "Sorry, but turning a blind eye to the shady / illegal stuff (not paying tax), makes you part of the problem. And people wonder why not many people trust attorneys.",
            "If the electricity was cut off in 10 days then it sounds like you were pretty bad at office managing when you were trying.",
            "What came about with the first office? Did they get their stuff organized and sorted? Or did they have to hire a new secretary to do the job they were supposed to be doing that whole time?",
            "The kick didn’t I run?",
            "Not malicious compliance, just compliance.",
            "They expected you to be in charge of paying the bosses mother's personal power bill? So much fraud in this post lol",
            "Is this country Greece? Cause it definitely sounds like what happens here!",
            ">Within two weeks the electricity was cut off for 10 days because it wasn't paid and my boss' elderly mother and the rest of his family had no electricity\n\nDid you not tell them you were no longer paying it?",
            "[removed]",
            "Everyone's worried about the electricity shut-off timeline's accuracy but not the brag that an elderly woman was put in the dark for weeks for the crime of... gossiping?",
            "Here’s something you better learn; Secretary is a demeaning word.   We are called Administrative Assistants (with or without Senior or Executive in front of the title.). Other than that ...great story!!!  Karma strikes.",
            "Smells like bullshit.  OP claims they were paying all the utilities but both the power gets cut off within 10 days?  Pretty big coincidence they are both shut off at the same time.  Also you would have to be at least a couple months behind before you get your power and phone lines cut.",
            "That office manager must have been sucking the boss's dick, seriously.",
            "good for you. i'm glad you aren't working yourself to death for people like that.",
            "[removed]",
            "> She drove off screaming at us about how we lost a huge customer, obviously. Wait, she was in the wrong, and the customs person was just “you can just get a new job, and how to do it....",
            "[removed]",
            "Sounds like you screwed yourself over too.  Anyone with half a brain would have ran for the hills",
            "[removed]",
            "The fact you keep using the term “secretary” makes me stop reading this shit. YATA.",
            "secretaries are always right and you are always wrong. waste of time to cry about something that is obvious. instead of being bullied by someone with lower IQ just get another job.",
            "Where do you live that phone lines and electricity are cut off after two weeks of nonpayment?",
            "Brazil, my dude?",
            "Every job has this person who throws their responsabilities to others. In the end, they screw a few people before losing their cool and the boss see who they're dealing with lol.\n\nGood on you, op! Hope you keep fighting for yourself.",
            "Boss literally pumped and dumped her.",
            "Bests story ever!!! You got them @OP, got em good. Merry chtistmas",
            "I like the fact that everyone is leaving.",
            "I hope you're well and you're able to stay in a place that's functional and rewarding",
            "You sound like you're either in Italy or France, glad it got better",
            "if its the same firm you'd think theyd clean up the rotten office",
            "So you just spent time going extra work that you not only were not paid to do but even lowered your salary because you didn't get to do your actual job?",
            "Dwight is that you",
            "Nice!",
            "Electric cut off after not even a week of non payment? Fuck.",
            "Dude your job sounds super shady",
            "Well done",
            "It is a hard lesson, but you actually do teach people how to treat you.  Pay attention to what you are teaching.",
            "US government jobs get around the job description by adding duties as assigned to the job description. This blurb isn't limited to federal employment either. Great way to get flexibility and maximize your employees talents. You just have to figure out how to compensate them for their work.",
            "This screams South Africa.",
            "Are you in South Africa? \n\nReading this, it sounds like some of the disasters my co-workers there have had to deal with. I was thrilled for my report located there when she found another job and could leave our company.",
            "that should teach them to grow a backbone, by the sounds of it you could probably start your own law firm and have better success than those idiot would ever have.",
            "I do 48-60 hours a week on average. It's kinda rough, but not so bad.",
            "Manager?  That sounds like a secretarial administrator.",
            "Sorry to hear bro...but i am concerned about what you said about knowing about the shady stuff happening at the company and still working there.... Wouldn't you be also caught up in it if ever busted? Look for jobs in the interim or freelance on the side.",
            "let me guess, you are from Italy",
            "needs more follow up to what happened to the secretary, the mother and the boss",
            "Some people will always try to take advantage of you and others without any real power to do so good for you to step up remember this event when dealing with anyone in your life trying to make you sacrifice what you don’t want to even if it’s just a minute of your time being waisted"
        ]
    },
    {
        "post_id": "cfec60",
        "author": "Tautochrone1",
        "title": "Boss is going to keep asking me to work shifts when I take time off? How about I take a permanent vacation...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cfec60/boss_is_going_to_keep_asking_me_to_work_shifts/",
        "score": 29354,
        "num_comments": 735,
        "created_utc": 1563576073.0,
        "selftext": "Disclaimer: I tried to keep it as short as I could but it still turned out pretty lengthy. No TLDR...read it or don't.\n\nThis is the story of my former employer. I work in the northeast US and my employer at the time was a very small company (Boss and 5 employees) in a very specific industry where 90% of our work was on construction sites and finding a well-qualified person in this very specific industry is a very very hard thing to do.\n\nMy boss was the kind of boss that every employee hates. Corners were cut every possible way in order to keep overhead costs down. On top of that he would constantly overbook on jobs (like signing contracts for 6 projects during the same week knowing full well that he only has 5 employees) which would result in the employees often working 14 hour days or more....which really sucks when you're on salary (no overtime). \n\nHis worst attribute by far was approving time off and then during your time off calling or texting you asking if you would be willing to work a day or cut your vacation short. Sometimes he'd even ask you to move your time off to the next week or next month \"when the workload lightens up\" (hint: it never lightened up due to his constant overbooking).\n\nAfter working at this company for 6 years I got used to all the aforementioned annoyances. But then things changed, my son was born. In the months leading up to his birth I made it very clear that I would be taking a 5-week unpaid leave of absence once he arrives. The state we're in allows new parents to take up to 8 weeks of unpaid leave. I told my boss that I know 8 weeks would be a huge strain on such a small company so I was willing to take 5 weeks but those 5 weeks would be completely \"off the grid\" meaning dont call me, dont text me, if youre going to ask me to do anything work-related the answer will be no so don't bother. I'm going to be spending time with my family. He 100% agreed.\n\nFast-forward to my son's birth. He was born on a Friday and after a short stay in the NICU (don't worry, he's fine) was released on Monday and we took him home. Tuesday morning (yeah...the next day) I wake up to a missed call, an email, and 3 texts all from my boss asking me to call him back ASAP. For reasons still unknown to me to this day I call him back and he tells me there's a slight emergency (code speak for he screwed up the scheduling and has a job with no employee at it) and asks if I could maybe come into work that day and maybe work a couple more days that week until he finds someone to cover it. \n\nI lost it. I literally felt something in my neck snap and unleashed a verbal assault on him that I still feel bad about now, a year later. I ended my rant with an apology...as much of a dick move it was for him to be calling me in that situation it was still completely unprofessional of me to say what I said to him. Obviously he wasn't a big fan of what I said and after a small rant of his own ended with the sentences that made this whole story possible. \n\nHe said, \"You've got a pretty good gig at this company that most people your age would be thankful for. I'd be impressed if you could find a better job in this field because I've been doing this for 30 years and I know how small this industry is and trust me, good jobs like yours don't come along very often. Think about that.\"\n\nSo we ended the call and I did what he said. I thought about it. After thinking about it for about 30 seconds I got out of bed, sat down in front of my computer and started looking at job postings.\n\n5 weeks later my time off came to an end and my first day back I came in to work, walked into my bosses office and handed him a piece of paper.\n\nBoss: \"What's this?\"\nMe: \"I thought about what you said about how you be really impressed if I could find a better job than the one I have here. ...so I did.\"\n\nMy boss reads over what I handed him...a job offer from a competitor for the exact same job I was performing but at a 25% higher salary, an extra week of paid vacation compared to what I had AND a stipulation that company policy was that work hours are capped at 8 per day meaning that once I hit 8 hours on a job I pack up and leave it until tomorrow. No exceptions.\n\nBoss: \"Well then...ummm...can I have the day to crunch some numbers to come up with a counter-offer?\nMe: \"No, don't bother. I just wanted you to see it because I know you wouldn't have believed me otherwise.\"\n\nGave my two week notice and left for whatever job site I was on that day. That was a year ago and I could not be happier with my new job. I get to spend lots of time with my boy and that's the best job perk there is.\n\nFor all you bosses and managers out there. Dont fuck with your employees...especially the good ones. Treat them how you'd want to be treated. \n\n***Most employees don't quit their jobs....they quit their bosses!***",
        "permalink": "/r/MaliciousCompliance/comments/cfec60/boss_is_going_to_keep_asking_me_to_work_shifts/",
        "comments": [
            "My company has a line in my contract that if anyone calls me and asks me to work on a scheduled day off I am to be paid for 8 hours that day and I keep my day off. \n\nI assume to curb shit like this.",
            ">\tMost employees don't quit their jobs....they quit their bosses!\n\nSo true. Congrats on your son and the better job!",
            "You still gave two weeks notice, you're a classy man.",
            "Congratulations on the new job!\n\nI was in a similar situation a few years ago after my daughter was born but my boss went the opposite way to your old one. \n\nMine was full of apologies, I got an extra couple of days of paid holidays and took my wife out for a nice dinner in a restaurant on the company’s expense account. \n\nThere were a couple of things over the years that I’ve been annoyed with but overall the place I’m with now are pretty decent.",
            "I fucking love this. As a small business owner I can't understand why a boss would treat their employee like shit and expect them to stick around. Your boss sounds like a nightmare and I'm so happy you left for greener pastures.",
            "Yeah, people in charge sometimes forget that skilled employees, especially in a niche field, are often very hard to find or replace and if they are shorthanded odds are that several other prospective employers are as well and will be all too happy to hire away someone from them.",
            "I'm counting down my days right now.\n\nI have a pretty sweet gig, but I'm massively underpaid relative to my colleagues in the same role, purely because I was hired on as a tech and worked my way up to a project manager. Couple that with no raises since last March of 2018, and no raise in sight until \"end of year\" from what we've heard (pending profitability, hah).\n\nMy current employer fired my former boss over a year ago. He reached out to me after his non-compete expired and offered me a position with his new employer starting in September for 20k more than I'm making now.\n\nI'm burning all my PTO, and even dates I had marked off later in the year I'm moving to use them now rather than later - I lucked out and work asked me to travel for a job in two weeks, right when some of my PTO was planned and approved already. I agreed, reentered all my PTO so I'm burning it all before September now under the guise of \"I'm not booked on projects and the ones I'm on should be slow\" and they're cool with it.\n\nThe amount of shocked Pikachu memes that will be given when I tender my resignation to my director, sales lead and sales VP is going to be priceless.\n\nAll, if you have an employee billing clients at $170 an hour, 25-40 hours a week consistently, pay them more than $65k a year.",
            "Finally a story i can completely relate to.  My baby girl was born last year and boss tried to make me work during my paternity leave (paid by government) when i pointed it out, he apologized in such bad way i just started looking elsewhere. It has been a month i switxhed and I've never felt happier, healthier and closer to my beautiful baby girl.\n\nI was the third in 2 weeks who quit and because i kept in touch with former coworkers, I've learned another one will be handing his 2 weeks notice after the vacation and another one might join me in a different department. So in other words, in a business with 4 employees,  they will now be 3 and soon 2 tech to deals with a work load of 15 techs.\n\nNo more my circus, no kore my monkeys. Previous company HR may final realized that i wasn't exaggerating when i said he's unfit to be a supervisor with his passive-aggressive attitude and moodiness.",
            "This is one of the reasons I'm so thankful for the company I work for. We're also very tiny, three people in the office, two out (though the two out are owners).\n\nRecently we had our fourth team member quit, and it's not in the budget to get a new one quite yet (bs a bit, but dudes got multiple companies and were the only one really turning a profit) and were also open 6 days a week. They want 3 people there, but can really only manage two except on busy days where we need three.\n\nIn August I'll be taking two weeks off and in September both my manager and I will be taking 4 day weekends to deal with various stuff we've had planned for almost a year (I've got a festival and my manager has a wedding). I asked my manager today how our other coworker is going to handle time without us. She skyoed the owner and was like \"hey so when (other coworker quit) you said you'd come jn during the times we needed off. So we need you to come in and do customer service, tickets, phone calls, and theres a few other days we may need time off so here's a list\" and laid it all out for him. He said hell come in just to remind him beforehand.\n\nThis wasn't very malicious compliance, but I am so thankful the fact that she put her foot down when she knew we had previously had plans for vacations and stuff that she wasn't gonna let the fact that he wouldnt let us hire somone else come in the way or let the company suffer. She stood up for the three of us, got me and my coworker raises, and made sure that the owner (\ta workaholic) knew that he was gonna have to pick up some of the slack in the office doing our job (which he hasn't done in 5 years), maybe he might also rethink having us have such low salaries.\n\nI bitch about my job a lot, but for the same reason that people quit shitty managers I will likely hold out with mine for as long as possible. She's a great person who knows how to stand up for people. I hope that if I ever get her job I'll be half as competent as she is.\n\nWow thst got long, sorry.",
            "Very true. I worked in a truck shop with 1 other mechanic and a service manager. My wife works and we split the kids time off if they need to go to the doctors etc. There is a big shortage for skilled diesel technicians at the moment which adds some spice to the story because he was looking for months to find another mechanic for first shift. So one day after I had to take the day off because my daughter had an ear infection he says “you really don’t give a fuck about this job huh?” Mind you, he is a baby boomer who’s wife stays at home. So him and I get into this massive argument. I hate confrontation as well but this guy loved it. The next few days I combed for jobs and found one for better pay and less hours. The day after I received a job offer I brought my truck and loaded up my toolbox. All of a sudden he starts telling me how maybe we can be more flexible with time off. Life is too short to put up with bullshit. But before you leave make sure you have a backup.",
            "Reminds me of when I was a manager at this small town Mom & Pa type grocery store when I was 20-22,  Store owner treated people like fucking shit, Refused to give breaks,   Would call you in on days you had off, would refuse to give you days off for serious shit,  Witnessed a co-worker one time get denied the weekend off when her mom died, Boss just said sorry but no, Your work is more important (spoiler, She quit)\n\nBut for 3 weeks once, he had my scheduled from 4:30am -1pm EVERY day, (We didnt even open till 8am) I was denied my 15 minute breaks, He didnt schedule ANYONE else to work with me for those 9 hours, this went on for 3 weeks almost,  I complained to him and he just laughed and said \"Sucks huh? But Im not changing it, Get back to work, I know you cant find anything better to do than work here\"\n\nSo I quit...I was managing 3 full departments, Bakery, Deli and taking care of the backroom shipping, Which NOBODY else in the store knew how to do, Within 2 months of me quitting the store was doing so badly they had to close down, Old boss was calling my cell 3-4x a day BEGGING me to come back.\n\nOne of my fondest memories of my 20's",
            "I once heard someone here on Reddit say, “Money comes and goes, health just goes.”",
            "I had the same thing. I was getting swamped where I was, doing duties that weren't mine, etc. My yearly review was supposed to come to discuss my wage, and it hadn't. It sailed by. At this point, I'm getting annoyed. So, I applied for a part time job at a new company. Turns out they wanted me for something better, since I, \"would be wasted in the part time area\". I'm going to be overseeing expansion of a new facility in two weeks as a supervisor, something I've been qualified for. For a very long time.\n\nI handed in my three weeks and the scramble didn't quite hit them until a week in. A job alert showed up on my phone...for my job. I did the job to the best of my ability, because you never burn your bridges. I've been away from there for two days. I got three phone calls one days after I left.",
            "I love when shitty bosses pull the \"Its not better anywhere else/this is ACTUALLY a really good job\" bullshit. They're always full of shit",
            "> ***Most employees don't quit their jobs....they quit their bosses!*** \n\nain't that ever so much the truth!",
            "Hope you let the other guys know too.",
            "I have a full time job at an AMAZING company but have kids in college so i got a 2nd job working part time at a different company.  The part time employer sounds like your previous one. \n\nFMLA... They don't care, will bully you until you come back early. Contagious illness.... Don't care... Will call and call until you come back early. Vacation.... That's a joke.... Will call you until you either come in or blow your top on them. Don't even try to call in.... They will refuse it and tell you that it will be a no call no show and you will be written up. \n\nNeedless to say my last day is in 3 weeks.  Not putting up with that crap. I've been lied on, lied to, & bullied. 3 strikes and I'm out of there.",
            "My supervisor for a fedex contractor kept making us do his work for him for a 2 week period of 14 hour days every day. On that final day I walked into work and saw a 200 pound treadmill with my work area number on it. Something came over me and I let him have it, along with 3 others. Needless to say, he isnt supervisor anymore, and the contractor and region manager have had enough of him. \n\nIn rare instances you dont quit the boss, but can get the boss removed. I'm a lucky one, and I hope the new job is going well!",
            "I’m about to apply to some jobs almost exclusively because of my boss.  Well, technically my boss’s boss.  My direct supervisor, while a little checked out, is actually pretty great most of the time (like, he’d never ask me to do something he wouldn’t do himself).  But the director of my department basically bullied my coworker into leaving and she used to be his “whipping boy”.  Now I think he’s channeling that energy toward me.  I would feel bad leaving them with two new hires (one of which is already considering leaving because she’s not sure it’s a good fit for her culturally) but honestly, if you’re not going to look after yourself, no one else will either.  And I just have a strong sense I am going to keep getting dumped on over and over until it’s too much.",
            "Never pick up a phone call from your boss on your day off.",
            " \"when the workload lightens up\"\n\nLol ouch, I hate this one. We switched from 5 days to 4 ten hour days plus 8 hours Friday if production was behind. Production was always \"behind\" except for maybe two time in the two years I worked there.",
            ">No TLDR...read it or don't\n\nI can't decide if I love or hate you, but goddamnit, I sure in the fuck do respect you",
            "Good for you! It helps me feel a little better after I just quit my job this week when I found out there was zero workman’s comp... she’s lucky I’m broke or I’d take legal action... I know my hard work will be better appreciated at whatever new job I take",
            ">The state we're in allows new parents to take up to 8 weeks of unpaid leave.\n\nThe same way the whole premise of breaking bad makes no sense to someone from western europe, your situation reminded me of the non existent workers rights in the US.\n\nNo paid leave for haveing kids is rough.",
            "I don't know why this post is getting renewed attention 4 years after I posted it but I appreciate the new comments and upvotes.\n\nAnd if anyone's wondering, I'm still happily employed at the same company and my son is excited to start school in the fall :)",
            "Great for you! Knowing your worth is priceless. Every job I quit was because of the boss not the job. Time with family is number one. Nobody should have to work more than 40 hrs a week if they don’t want to. Work to live not live to work.",
            "Similar story, ending not as cool. I was done having kids and my wife was involved with a cancer scare that involved surgery. Thankfully after the surgery, we found out it was benign.\n\nMy work involves a lot of weekends.\n\nI asked my boss for Saturday off, just to help with the kids while my wife recovered, three days after the surgery, which happened to also be a holiday weekend.\n\nHe never touches weekend work.\n\nTold me I couldn't have it off.\n\nOne fucking day when I legally could have asked for much more.\n\nWhile at work (I knew the company watched what we did online) I googled \"FMLA\" and \"FMLA + company name\" and \"FMLA violations\" the night before the procedure.\n\nCalls me while I'm on the way home from the hospital two days later telling me I can have it off. He ended up working the shift.\n\nSome of you may not be as fortunate and I was lucky a few Google searches reversed his asinine denial. Use your legal leverage if you have to, family is way too important and life is way too short.",
            "This was a very satisfying MC! Your boss was a twat—incompetent and completely disrespectful of his employees. I’m glad you escaped, and I’ glad you unloaded on him *when he asked you to come in to a construction job four days after you gave birth*. Jesus fuck that pisses me off just thinking about it again.\n\nBut let’s talk about the most shocking thing: What shithole country do you live in where new mothers only get 8 weeks of *unpaid* maternity leave?? That’s fucking ridiculous.",
            "What a fucking joke that you're \"allowed\" to take 8 weeks off UNPAID! What sort of post apocalyptic hell do you live in?",
            "Congrats on your son!",
            "You did the smart thing, I walked out of a similar situation, except I was the sole salaried employee and work at his home bitch.  \nI have been unable to get hired for over a month because I walked out.. xD  \nCongrats and have fun with the new job!",
            "HAHA I recently had a boss call me to cover a shift the day after I finished up my final two weeks notice.",
            "Fine I’ll do it. \n\nTL,DR:\nBoss keeps asking OP to work on days he requested off. Op finally loses it, verbally shits on boss. Boss says be more appreciative, it would be hard for you to find a better gig. OP says YOLO, flips double birds, and finds better gig. Old boss cries.",
            "Spend as much time as possible with your son. He will be grown before you know it.\n\nCongrats on getting out of that mess.",
            "Good read. Take my upvote.",
            "“No TL;DR... read it or don’t”\n\nYes! Finally! If someone wants to be lazy and only read small stories, they can search for small stories. (At least, that’s how it works in the app). If you want to read the story, read it. If you are too lazy to read a short story, don’t read it. Why are so many people mad at you OP? Seriously guys, just stop being lazy and read the damn thing, or at least don’t complain about you not having the concentration to read for a couple of minutes. Seriously. Stop.",
            "Our twins were born via scheduled induction, so my husband’s work knew he wasn’t coming in on the morning they were born or for the next two weeks. \n\nThey messaged him about a problem while I was in labor. Like, 2 hours into his paternity leave. It was still early in the induction so we just laughed and he answered the question. (It was about a product that he was the sole support person for). But we thought it was pretty bad that they couldn’t even make it two hours. \n\nSince it was not a crappy workplace, that was the last he heard from them until he went back.",
            "Quit has a negative connotation. Don’t quit your job, fire your boss.",
            "***Most employees don't quit their jobs....they quit their bosses!***\n\nAmen, brother.",
            "I didn't leave my last job because of my boss, but because of corporate.  My bosses loved me, and vice versa, but corporate was destroying labor costs & schedules nationwide.  Does that count?",
            "Why they don't teach \"most employees don't quit their jobs, they quit their bosses\" to managers is something that will forever elude me.",
            "I left a job I had been at for 7+ years that for the most part was grateful for and enjoyed. That manager had changed office hours after years of being the same so instead of leaving at 4, I had to leave at 4:30. I would get to my son’s school at 5:30. New company just cares that I get 8 hours in, so I leave at 4. It’s also a half hour closer to the school. I now get to his school at 4:30. I got a 30% pay increase, much less stress, more exciting work in the same field, and the biggest perk of the new job is an extra hour a day with my son because that’s priceless.",
            "ESPECIALLY do not fuck with good employees with families. Good buddy of mine going through this at my current (soon to be former within the week) employer. Been doing it a decade and has got nothing but kicked in the dick, and when he leaves, hoooo boy that's gonna hurt this WHOLE district's performance BAD.",
            "> **Most employees don't quit their jobs....they quit their bosses!**\n\nSo you actually *did* write a TL;DR, after all!\n\nCongratulations on the new son and the new job!",
            "The last line is my go to. Everyone can relate because it's the most honest thing.",
            "Construction May be a small industry where everyone knows everyone, but they pay a premium for quality help. Good play on your part.",
            "Geotech? This sounds almost verbatim like a geotechnical company I used to work at.",
            "> For all you bosses and managers out there. Dont fuck with your employees...especially the good ones. Treat them how you'd want to be treated.\n\nUnfortunately, as a manager I also have a boss.  I treat my team really well but then my boss will turn up and fuck with what I've already done.  Had a couple of workers this year quit and during their exit interviews rate me really highly and then put down that they're quitting because of my boss.",
            "Not being sarcastic here I really feel for Americans when I comes to work. The fact that parental leave is unpaid and you don't get as much holiday time as others is really shitty.  It seems employers really take advantage of terrible labour laws and a good work ethic.",
            ">No TLDR...read it or don't.\n\nThis post deserves an upvote for that sentence alone.",
            "Didn’t need TL;DR, beautifully written and very well played. Bosses, PAY ATTENTION!!",
            "The real wtf for non Americans is that the OP had to take unpaid leave for having a baby. In my third world shithole country, we get 2 months paid maternity leave as mandated by law. Land of the free my ass.",
            "It's been said many times, people don't leave jobs, they leave managers.",
            "That felt really good to read. I bet it was even better seeing the look on his face. Congrats on the new job!",
            "It baffles me.  The greatest asset to a company is the employees.  You take care of them and your business will flourish.  Fuck around with them and then you end up with shit employees and a rotating door.",
            "*\"Most employees don't quit their jobs....they quit their bosses!\"*\n\nWhat a great and true line. That should be pasted inside the door of every manager's office in the world.",
            "All of the folks posting here who a.) make no mention of Unions, and b.) claim they're salaried with a guarantee that they can go home after 8 hours obviously don't live in the United States, 'cause that shit simply does not happen, ever.\n\nOh, you don't want to work for barely-above minimum wage, put in 60 hours on a normal week and 80 on a seasonal busy week, and get disciplined for not wanting to come in on a day off or holiday?  We'll just threaten to replace you then.  Plenty of peons, even in the professional, white-collar worlds now who would love a meal ticket, no matter how soul-draining and life-destroying it is.\n\nVery seldom do you see real wage calculations based on unpaid overtime and wage theft, but I'd bet that Wal-Mart greeters get more value out of their time than accredited professionals these days.  If you're working 60 hours every week minimum, cut your salary by a third and that's what they're really paying you...",
            "Congratulations on new son and new job",
            "I had the exact same experience just this week and your story makes me feel as though I'm flight the right thing. Ultimately, you have to go with your gut and if it's telling you \"fuck this\", you ships take heed. I start my next job in the next few months. Thank you for your story.",
            "I’ve been a manager for years and I would never treat my people that way. I don't understand this mentality.",
            "Is this industry architecture? Coz it sounds like my firm too. Turnover rates are high and now the company is purely running on interns since the 2 full time staff left can’t manage 2 big projects. The firm is so cheapskate with their clients who are billionaires, buying 3$ cheap meals for them when they come down for our presentations. There is no OT pay and our bosses complain when we leave work on time, saying “why are you leaving so early”. Work starts at 8.30am and sometimes we only get to leave at 10.30pm",
            "My bosses were exactly why I left my last job. And I don't regret it.",
            "Folks, this right here should be your determination factor in choosing whether or not you keep your job. You’d be surprised how easy it is to deal with shitty jobs if your hours are capped like this and guaranteed vacation time off",
            "Yooo... were you an environmental consultant? Because I had a very similar experience.\n\nCongrats to you!",
            "I feel this so personally...one of my bosses, after 2 paycuts within 5 months (since the company wasn't making much), asked me to switch my hours to a foreign time zone which would be an absolute flip of my entire life. Shitty bosses are the worst.",
            "It baffles me that companies think their workers have to literally bleed if they must for their sake, and without compensation, as if there's nothing more to life than working unpaid overtime in a stressful job that just makes you want to give up on life. Life *must* be better than that",
            "I work for my dad and man, this post describes him exactly. I literally just finished sending off my first round of resumes today to some places I think I'd like to work. I hope in a year I'll be feeling the same way you do. Congrats for standing up for you and your family :)",
            "That last sentence holey shit I’m about to quit my boss",
            "Your last sentence is totally true people leave bad bosses, managers and line lines.\nI left mine and now earn net more than i used to earn gross!",
            "America... no overpaid, free hours because because 🤷🏻‍♀️🤷🏻‍♀️ In Poland we have maximum 40 hours a week and everything more is overpaid. My company for example is bonus 50% for first two hours and then 100% for next hour :))\n\nEdit: also 20/26 days of paid vacation per year depending on how long you work.",
            "[deleted]",
            "It’s only when you understand your true worth, are you capable of taking control of your career. Once I reached my salary upper limit I took a salary decrease ($1000) in exchange for a 10 minute commute. \n\nMy worse job was working for an executive who told me that I didn’t understand business and how to handle people.  I put in my 2 weeks notice.  As requested, said nothing to the clients until the company made an announcement about my leaving. 5 days after I left, contacted my company’s former clients and arranged contract  work. \n\nI am still on good terms with all of my former employers and from time to time pick up side work as I keep my full time job with a company that respects my experience.",
            "Where are all the potatoes crying about the tldr? (Which I appreciated, btw).",
            ">***Most employees don't quit their jobs....they quit their bosses!***\n\nAin't that the truth.",
            "I was an employee that the bosses called on their day off at 6 am cause someone called in and I always covered it. One day he called my other job and asked if they would let me leave early to cover a shift, my boss at job B was like wtf why would you call her at work and ask her to leave find another person. \n\nWhen I was pregnant I had some early bleeding and was freaking out and asked to leave 30 min early to get to the OB before they closed and was told no, I then spent the next 8 hours in the ER cause he wouldn't let me leave a few minutes early ( we had plenty of coverage), then when I called off the next day he told me I had to go in with 3 hours of sleep. Later at about 6 months pregnant he came storming into the small pet area (pet shop) banging on the glass and waving me out \"do you have a problem\" \"uh no?\" \"Then why do I have a bunch of people telling me you can't do your job? Can you do your job? If not I need a note\" \"uh..I'm literally doing the job that your screaming at me for not doing so I'm confused\" he just walked away. Then a bunch of groomers came walking over and asked if he took me off cleaning duty (there's no vents in the small cages so it's hot and hard to breathe and I was super preggo while the boy on staff played on his phone) \n\nOne day I was on vacation I planned it 3 months in advance he signed off on it. I worked a full shift then drove 10 hours to my grandparents house getting there around 3 am maybe 4 am and at 10 am I get a call and he's foaming over the phone \"where are you, why are you so late? We have people here for potty classes that you need to teach\" \"yeah I'm in Michigan, there's no way I can make it, I took the week off, you approved it\" \" well the other trainer isn't here\" \"well she is on the schedule I know she is I checked before I left last night so I don't know what to tell you\" he took me off the schedule for two weeks cause he was mad he forgot about my trip so showed up for my classes and then had to leave right after he wouldn't even let me clean so I was like cool enjoy the pee off your floors.\n\nHe made me take off my coat and searched it and my purse cause someone was stealing fish food...I didn't even own fish. He wrote me up for being on my phone on my break while buying stuff at the checkout and then let all the other people go and I had to clean the whole store alone and drive home in a snowstorm. \n\nThe final nail after 7 or so years of this abuse was I was 7 1/2 months pregnant and couldn't lift anything over 15 lbs, I was throwing up blood, and my baby was crushing my spine even the ultrasound tech was like damn girl I feel for you, and he still had me stalking shelves and I just couldn't do it, I was teaching dog classes, doing cashier work, taking care of small animals and inventory and I just couldn't do it, I was to sick and tired and in pain and he said \"but I need you, who else can stock the shelves\" he didn't even think about the 40 other people who worked there who could do it. So I walked into the office typed up a fuck you letter and quit right before Christmas and went and got a pregnancy massage that my husband got for me and was super happy, 6 years later and he and all the staff has been moved due to his issues and they still haven't replaced me.\n\nIt's a great feeling getting away from a shitty boss.",
            "Well played. Congrats on the better job!",
            "What happened to the company after you left for the better job",
            "It took me 4 kids and 12 years to figure that out. My #5 is my buddy.  I wouldn't have it any other way.",
            "**Most employees don't quit their jobs....they quit their bosses!**\n\nThat statement hit me like a tonne of bricks.  It is so true",
            "Fuckin A, right. Did the same thing 7 months ago and have been been happier. Way to go, OP.",
            "Jobs take the happiness of life and we should all do something about it. Like death or som.",
            "I enjoyed reading this very much, thank you for posting OP",
            "You are so right it's the boss who makes people feel like quitting.",
            "You should have showed it to the rest of his employees",
            "Once you've got a salary good enough to cover your expenses, you realize that more often than not, *time > money*.",
            "Treat them like you treat your toes: they're what keep you up.",
            "Under FMLA (family medical leave act)employers are legally obligated to give up to 6 weeks unpaid leave after the birth of a child. Provided you've worked at least 1000 hours in the last year. And they must return you to your same job duties at the same hour schedule and same pay. You have to tell them you are taking FMLA leave and there is nothing that can be done about it. In the US anyway.",
            "If I get a call when I'm off because my boss is incompetent (it happens often) that's an hour of overtime minimum, bitch.",
            "Sounds like your typical US  boomer boss.  That generation don’t get it, never have, never will.",
            "“Most employees don’t quit their jobs they quit their bosses”. That is the real truth right there.  Employees that quit their jobs were going to do so anyway, but a bad boss can force people out of a job they like.",
            ">  No TLDR...read it or don't. \n\nI loved this. Felt obligated to read it after that. Glad I did.",
            "TL;DR Bad boss. Found a new job with better pay, better hours, better time off.",
            "TL;DR:  \n\nBoss promised not to bother OP on paternity leave, and then immediately bothered him on paternity leave. Boss made a veiled threat, implying OP should think about how much he liked his job because he would never find a better one. OP thought about it. OP found a better job.",
            "Lol 5 weeks UNPAID, after the son is born. Land of the free indeed",
            "First of all, nice move on the “no TLDR...read it or don’t”.  Fuck lazy ppl who don’t want to commit a couple minutes to read a post. \n\nSecond: props for standing up to a bully of a boss and shoving his shit back in his face!",
            "No tldr aight didnt read",
            "Thank you for sharing this.  And thank you for sticking to no TLDR.   I don’t like tldr’s.",
            "“Read it or don’t “\n\nOh you finally got some sass ? Lol",
            "That was amazing, so happy for you (-:",
            "You should have given him your 2-weeks when you had 2 weeks of your leave left.",
            "YEP!\n\nLOL!",
            "Congratulations on your new boss!",
            "I think I had this boss",
            "if its super niche have you considered going into business for yourself?",
            "Im working on this. I want this.",
            "This is amazing. You’ll be telling this story for the rest of your life!",
            "I liked this story",
            "🔥",
            "Amen!",
            "Bad ass 👏👏👏",
            "I’m trying to get a new job so I can leave mine right now and this is inspiring, man.",
            "I absolutely would have given him the day to look it over then said. Umm, no. Thanks.",
            "As I sit at 104 hours so far over 10 days, and having to also work this weekend, I wish I had your cajones.",
            "True that :-) Happy for you",
            "You realize your mileage may vary, right?",
            "You are awesome",
            "One thing I learned, never work for free. My first job out of college put me in a work site that was 14 days on, (14 - 16 hour days) and 2 days off. I saw no overtime. I sucked it up. Eventually the job went more and more sour due to my boss (he was the CEO). He fired me, it was literally the best thing to happen in my career.",
            "100% just quit my job of 3.5 years because of the boss, not the job itself - which I honestly loved. But I love my mental freedom more.\n\nAlso I made said boss cry the day I put in that 2 weeks notice. That felt great and the owner of the company still wrote me a good recommendation letter.",
            "Family comes first dude.  Jobs are a dime a dozen.  Never sacrifice the family for some crappy job where you’re unappreciated, especially when you have young children.",
            ">This is the story of my former employer.\n\nDude, spoilers!",
            "beautiful last line",
            "Assuming you are at will, I would have left on the spot",
            "> For all you bosses and managers out there. Dont fuck with your employees...especially the good ones. Treat them how you'd want to be treated.\n\nThis whole thing is pretty much telling bosses that if you fuck employees they'll stick around for 6 years of unpaid overtime...",
            "Hopefully you told all this to your coworkers and they all also left that company.",
            "You know you can say no? My boss tried this but I just don’t answer back or say I’m away and unable to make it back",
            "This is why I left the corporate world to be a freelancer.",
            "From the UK. The thing that baffles me most is you actually have to take unpaid leave to have a child",
            "Aaaaaaaand this is the issue when you don’t stick up for your rights right from the beginning. Expect to do some long hours every now and then. But if it’s every day, doing long hours only means no one sees the problem and it never gets fixed.",
            "I had a similar experience, years ago.  Except I said sure to the counter offer.  Really felt good to say hmmm no thanks.",
            "\\> ***Most employees don't quit their jobs....they quit their bosses!***\n\nVery true. I enjoy what I do for a living and each time I quit I just need a better environment. \n\nCongrats to you and your family!",
            "My man, you are a legend.🔥",
            "Preach",
            "Congrats!",
            "Somehow feels like this belongs in r/prorevenge very much as well. Power to you sir.",
            "Tldr : boss man say you cant find better than this, worker comes back from holiday and gives 2 weeks notice for a better job and makes sure boss man knows how good a job it is.",
            "Praxis",
            "Your last quote hits so close to home.\n\nI'm in this exact position. Like the job and field but management is abysmal. Borderline moronic.\n\nWere they more human I wouldn't be waiting on the next year bonus to ditch them...",
            "This was amazing",
            "Epic!!! This should be a short film.",
            "I really wish that at the end, you had shared those details with the other 4 employees. That would have been the perfect cherry on top.",
            "[removed]",
            "Why do they always say “think about that”? Bitch, obviously I’ve BEEN thinking about that!"
        ]
    },
    {
        "post_id": "upwkt7",
        "author": "mypostingname13",
        "title": "You're capping commissions on our most in-demand vehicles because \"You're not doing any extra work, so you shouldn't get extra money\"? Fine. Let's see how that works out for you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/upwkt7/youre_capping_commissions_on_our_most_indemand/",
        "score": 29326,
        "num_comments": 956,
        "created_utc": 1652582991.0,
        "selftext": "I realize that this story could absolutely be current, but it's not. Another thread reminded me of it, and I think it absolutely fits here, so here goes.\n\nBack in 2014, I was selling cars. Ford, specifically. For all those who aren't car buffs, both the Mustang and F-150 were getting ground-up redesigns for 2015, and Ford had just announced that there would be no Shelby Mustangs or Raptor F-150's for 2015. Instantly, we were fielding several calls a day about these vehicles, and almost overnight, the inventory we had came with a $10-20k \"market adjustment,\" due to demand.\n\nOur GM loved both vehicles, and traded for them whenever he could because he loved chatting about them with buyers, so we had 21 Raptors and 6 Shelby's still on the lot when I sold a ruby red Raptor extended cab at $10k over sticker the last week of the month. Both are CRAZY numbers for the <200 new cars we sold/mo. With the trade, I was due about $4200 in commission, but my check was about $1700 light.\n\nCome the first Saturday morning meeting after payday, we were told that commissions on such vehicles would be capped at $2500, retro to last month, per a previously ignored provision in our pay plan. There was much grumbling, but management stood firm, citing how incredibly easy Raptor/Shelby deals were. They weren't wrong about that. There was no such thing as a test drive until the deal was done. You could absolutely drive the car before you bought it, but only after we had a signed buyer's order, credit app, and the deal had been submitted and approved. They were generally in and out in under 45 minutes, if not half an hour. But still. Dealership gets free money and doesn't want to share?\n\nCue malicious compliance. \n\nI talked to several other salespeople, who to a man were pissed, and we colluded. I whipped up a little excel macro/widget that would take the invoice price/holdback, add in pack and whatnot, and spit out a sales price that would produce an exactly $2500 commission. I sent it to every salesperson we had, and everyone used it. It only took 3 signed buyer's orders with seemingly arbitrary numbers for the desk to figure out what we were doing and to call another meeting. \n\nThat meeting was basically management yelling at us, and the entire sales staff calmly saying, \"remove the cap, or you'll never see another signed buyer's order that exceeds it. Fuck you.\"\n\nThe cap was lifted 3 days later.",
        "permalink": "/r/MaliciousCompliance/comments/upwkt7/youre_capping_commissions_on_our_most_indemand/",
        "comments": [
            "I had a friend who worked in a office supply store that sold the full fit out for offices and schools (tables, chairs, whiteboards etc). He was given a cap to his commissions so he used to just work up until he hit it and then stop.\nNow some work would naturally fall in his lap just from repeat customers and walk ins, so he started saving up sales until the next month. By that I mean he would deliberately hold off on completing a customers order until the next month so the commission wouldn't be wasted. Used to take him a bit over a fortnight to hit his cap.\nHe could have easily made the company hundreds of thousands more in sales, but he didn't see the point. As he hit his cap each month his matrix scores were always high so he looked like a dream team player.",
            "I've never understood capping commissions like that. So dumb. I had a friend back in the day who's boss got pissed that the top salespeople were earning more than he did, so he capped commissions, so they left and started their own business.",
            "When management does that, you tell them that you want it in writing that when the market cycles downward, and demand drops, they'll protect your pay on the downside. \n\nIt's really the exact same logic: If management wants to pay sales reps less than they've earned when it's really easy to sell, then they should agree to pay them more than they've earned when the selling gets tough.",
            "I used to work with a guy that turned down business because his assistants, the folks that did most of the work on any deal, wouldn't make anything extra.\n\nBob was our best sales critter. What he could do in January took most people six months, and we had people who couldn't meet Bob's January numbers even given an entire year.\n\nIt's not that the other salespeople were bad. Even the weakest one made at least a million a year for the company.\n\nAnyway, the company announces that they've got a new, better bonus structure! \n\n'Associates' and 'Assistants' would now make more money! They're gonna get an extra fractional percentage of any deal!\n\nBut they would now be capped at $10K a quarter.\n\nBob didn't like that. \n\nBob got zero deals signed that month. \n\nThe new rules meant the deals he'd already had in the pipeline exceeded the amount needed to get his people paid, so why look for more?\n\nWhen the company reversed the cap, Bob suddenly had $30 million bucks in deals, and his people made $40K.",
            "Sales is not my strong point but I love any story that involves an Excel macro or function.",
            "I think the shittiest part is the retroactive nature. You want to cap my commission, I'm not happy. But you change the rules after the fact, get fucked. You know who does that shit? Little kids who are sore losers.",
            "So, I worked for a commission sales company when I was in college, basically business to business PC sales. I was young and stupid so didn't realize how burned I was getting. I was told they had a commission cap per month (it was like max $4000 commission, if I remember). Note, this was on top of my hourly pay of $9/hr. It was so stupid that I would purposefully try to spread deals out if I was going to go over cap to put the sale in the next month and I would lie to customers that it was going to take an extra 5 days to process or something...\n\nI remember one month I had a great sale to a nursing school that agreed to buy tablets for all students, and I hit my commission cap and exceeded it on that sale (this was like a $100,000 revenue sale). I wasn't even halfway through the month. \n\nSo, I put in the hours to get my hours, but I literally didn't sell another thing the rest of the month, didn't try to, didn't go out of my way. I even had my manager call me and ask me why my production was done and I told him I just had some misses and some bad luck. I was lying. Why would I work just as hard and not get my commission?\n\nIt's when I realized how stupid commission caps were and made me realize how idiotic the company I was working for was. Commission caps are some of the dumbest things in the world.",
            ">  and the entire sales staff calmly saying, \"remove the cap, or you'll never see another signed buyer's order that exceeds it. Fuck you.\"\n\n\nStop, stop!  I can only get so erect!   Very well done.",
            "r/WorkersStrikeBack would salivate over this.",
            "I'm a controller at a Chevy/Buick store and our sales staff is on flats. Average 20 units working the pay plan will generally result in 120k a year, 30 units is well over 200k for our top guy.\n\nThat being said, we do share gross with the sales staff on Corvettes, which are the only units we sell over MSRP. If sales holds the 10k markup on a Vette they get a $3,500 spiff in addition to their unit flat. It's one of the most fair pay plans I've seen for longevity, plus our store has a very good culture and retains people well.",
            "If it weren’t for sales commission caps at IBM, Ross Perot wouldn’t have started his own competing company and become a billionaire.",
            "I remember the first time I heard our CEO talking about the pay of the sales guys and got they made more than him. I was surprised and asked him to clarify that the sales guys made more than the CEO. He looked at me and said something along the lines “those guys directly affect the bottom line. I don’t care how much they get paid every month as long as they earn it.” He said he wished he could write each of them million dollar paychecks every other week and that the sales guys are often the highest paid employees of the business.\n\nIt made a lot of sense. The more they make, the more the company makes.",
            "Salesman: \"I'll give you $10,000 in sales, and you give me $500.\"\n\nBoss: \"Okay, but only twice a day.\"\n\nSalesman: \"You got it.\"  <only sells twice a day>\n\nBoss: <stares in corporate>",
            "Worked at a dealership for 6 months. Store manager hired 15 people to sales, six days a week. The store sold on average 80 cars a month. If you sold 7 -10 cars you were top sales. That's new and used. The first 3 months guarenteed $3000 (year 2000). After that, commission. I made top $4500. On my 6th month, I was fired because I only sold 3 vehicles. Too many salespersons for sucha small store.",
            "[deleted]",
            "I worked collections and the owner of the agency decided after his divorce and marriage to a young little Goldfinger that he needed more profits. \n\nThe bonuses got capped at such a level  where  for the high performing individuals would easily max within the first 2 weeks of the month.\n\nWe all just started taking payment plans instead of lump sum.  That way we wouldn't have to make any calls each month.  Just bonus off the  payments you have set up already and then don't do anything to make the company more money.",
            "I am capped at one upvote.",
            "My late husband was the service manager for a verrry large Apple dealer. Shortly after the Mac was first introduced, back in the eighties, the owner hired a high profile saleswoman with an amazing record. \n\nTwo months later she sold a tractor trailer load of Macs to a school board at full retail price.\n\nHer commission totaled out at over $60k (back in the eighties, remember). The owner nearly had a heart attack. He tried everything he could think of to get out of paying her, but smart cookie had a contract with numbers included. She threatened to sic her lawyers on him.\n\nFinally, he paid up, and she walked as so as the cheque cleared the bank. I think about her every once in a while.",
            "Comment removed due to reddit's greed. -- mass edited with https://redact.dev/",
            "Fuck dealers, dealer markup, commission sales of cars, and car salesman. \n\nI don't need help finding a car. I don't need info, I don't need to be told how the climate control works. Fuck all that. Let me buy manufacturer or retailer direct like every other product I own.",
            "Called around to some dealers a couple weeks ago to see if they’d be interested in buying my Shelby since I just moved back to a high elevation state and I lost noticeable hp and the roads around here are absolutely terrible. Anyway, the general answer was, “hell yes please let me buy your Shelby.” Ended up getting 1k less than what I wanted walking in but I’m still getting almost 50k back in my pocket so whatever. Just found out they’re only selling the car for about 4.5k more than they bought it for. I understand demand is extremely high but I’m also extremely confused why a dealer would make that deal to only make 4.5k after. Who’s making money in that deal but me?",
            "This whole post reminds me of how much I hate car shopping and how I wish the whole industry was overhauled to eliminate dealerships all together. \n\nWhy can’t cars just be like milk at the supermarket or lawn mowers at Lowe’s. You see a price, you decide if it’s right for you and you buy it. Everyone gets the same price.",
            "I’m convinced most of the time people in charge don’t understand how incentives work. The hospital I used to work for decided after over a decade that productivity bonuses were needed (they were, as they were an outlier in not paying them). The fist year, my bonus was about 30% of my base pay, because I worked 60-70 hour weeks. So they started chipping away at the cutoff for payouts, until no one made better than 95% of the needed numbers. No more productivity bonuses, but also, no more incentives to give extra. After a couple years, I left for a job that paid the same base rate at half the hours, with no call or weekends. Within another 3-4 years, ALL the medical staff in the department had left. They went being incentivized to demoralized because of bad management.",
            ">There was no such thing as a test drive until the deal was done. You could absolutely drive the car before you bought it, but only after we had a signed buyer's order, credit app, and the deal had been submitted and approved.\n\nThese sentences bother me.",
            "Jeez. An easier way to cap commissions would be to cap the price of the fucking car. Oh wait, no windfall for the dealership that way.",
            "Amazing when the owner gets owned",
            "Great story but man it's hard to feel like you're the good guy in this selling cars 10k over sticker. Fuck I hate salesmen.",
            "Did you get the $1700 they owed you?",
            "for the last 15 years I’ve worked in construction sales for a small firm. I know this is unique, but I don’t have a quota or a cap. I just get paid a percentage of gross profit on my sales. 5 years ago they raised my percentage. They have never reduced it. It is an astonishingly fair pay plan.\nThe average employee time here is over 8 years",
            "I’ve heard this commission story from 2 different people at 2 different companies:\n- sales job with commission \n- build good relationships and grow knowledge, skills and your sales numbers \n- finally hit your numbers to move up to next level with higher pay and higher commission…. \n- so they take your clients and GIVE them to someone already at the next level and they assign you new accounts.",
            "> I sold a ruby red Raptor extended cab at $10k over sticker the last week of the month.\n\nWhat an odd practice, some models right now have 1-2 year waiting list, but I still think we sell the rare stock/\"demo\" car at sticker price. I don't think we bump cars up like that, guess that's why the sales dudes commissions only go up to about 1k a car.\n\nMaybe that's why new car salesman's have such bad rep, its from USA. I haven't seen anything dodgy like since working for Toyota in aus",
            "As a former ad salesman I never understood commission caps.  The whole point is to encourage them to sell more and more so everyone makes money.",
            "It’s crazy when business owners can’t see that a well incentivised sales teams actually make the company profits so pay them their correct commission.",
            "I’d like to say I am surprised it took them three days to figure it out, but I’m not.",
            "That's awesome. Further evidence that labor has to organize to even stand a chance. Good on you.",
            "Yeah, the whole dealership model is terribly outdated and a detriment.",
            "So you made a mini-union.",
            "Holy shit you make more on the commission of one sale than I do in a months working. What the fuck",
            "Excel is The Batmans of productivity software.",
            "If *a*, then *b*. This time, the logic was also [**commutative**](https://en.wikipedia.org/wiki/Commutative_property): if *b,* then *a*. \n\nThis is the funniest post I've read in weeks. I love it.",
            "I work in a call centre now and in the first year of me working there they reduced their payouts on commissions. Not as bad as capping it but trying way harder just to get where you were really sucks. No one I know tries even as hard as they did before. It went from an extra $1000 or more a month on top of our base wage (which is already enough honestly) to <$200. \n\nIt’s even worse in tech support because our sales opportunities are less likely but are more unique and opportunistic. And I hate sales, I hate selling people shit they don’t need, but I liked getting a pay out for making sales where I thought it actually was something a customer wanted. Like I tell most customers they won’t need more than 100mbps of internet if all they do is use Facebook and YouTube, so I wouldn’t try to sell them on anything more than that. Whereas a sales rep constantly sells Gigabit services to grandma who barely works her remote. \n\nEven when I did push for sales more I’d still sell with integrity and during the months leading to Christmas, I managed to bank decent money for my kids. Not any more. It’s such a shoot-yourself-in-the-foot scenario to disincentivise your sales staff that I can’t wrap my head around it. I mean our managers make only 10% more than we do and as a salary so with overtime we can make more than our direct supervisors but they get bonuses on metrics and on our sales so It’s just so backwards to me.",
            "Good on you, OP. That's basically an ad-hoc union action right there!",
            "sounds like management was mistreating labor, so labor organized to demand better treatment.\n\nneat how that works.",
            "That reminds me of the story of a commercial real estate management company that I worked with. They decided to put a cap on commissions for the year. Their top sales guys hit their cap the first month. And they all quit selling. It wasn't till the end of the year that management actually figured out what was going on with the lack of growth. Needless to say they realized the error of their ways and removed the cap for the following year.",
            "I worked for a hotel when I was in my twenties and the front desk staff, usually 3 or four of us, would get to split the average daily rate on days we sold out completely. Sometimes this was an extra 100 bucks a week or so depending on how many we got. It motivated us to get the best rates we could on hotel rooms and to sell every room. They took away the incentive due to \"BUDGET CUTS\" which obviously reduced our motivation to sell out. We also liked having extra rooms incase of emergencies since we weren't motivated to book them. It cut back on headaches from picky guests. Management noticed that we weren't making as much and said something. We all basically said oh that's unfortunate lol.  A month later we were getting perfect sell bonuses again.",
            "Cool, now all we have to do is get rid of car dealerships which exist only as artificial middlemen kept in place by auto lobbies, and maybe the working class could actually afford a car!",
            "Excellent. As a car buyer this is yet another reason I hate dealers.\n\nTo purchase my last two cars, I went to a website, selected the model I wanted, the features I wanted and then bought the car. This is how everyone should buy cars - though in some third-world countries that's not allowed due to corruption.",
            "Jesus. I sold a different car brand back in 2012 ish. We got anywhere from $50-$250 per car. And the brand sucked at the time so we would go days without any new walk ins. No wonder I failed, I should have been at ford.",
            "In my last sales manager/save our failing company role, one of the first things I did was change the commission structure. They had two sales people who were making fantastic money, but selling very little. They hated the new structure, but stayed anyway. \n\nWith the new structure, both made more money, and so did the company. They finally started selling, because they had to to get a paycheck.",
            "The amount they held back from one week of your pay is more than my current salary. 😕",
            "Worked for a planet named car company. One salesman ALWAYS did at least three times the next top salesman. Owners hired a sales education group that had cold call scripts and changed everything. The salesman refused to do any of it. So, he was fired. He got a job quickly at another store and was top salesman there.",
            "I appreciate this post. \n\nIt also shows clearly how fucked up pricing is for vehicles under this forced middleman system of private dealerships. \n\nIt’s why I never buy a car brand new. The markup and pricing isn’t worth it. Especially since paying a salesman commission and all the dealer fees attempted are just highway robbery.",
            "My brother works high-end IT sales for one of the biggest companies in the country doing that. He's often getting recruiters trying to head hunt him, as his basic is very low for his field. The thing is, his company give a larger commission (as a percentage of anything he works on) than any other company, so come year end, he is earning 2 or 3 times the amount of money any of the jobs being offer would net him.",
            "They forgot not to shit where they eat, the workers won't pay more to eat the shit that makes us both them money in theory. Cap me, fuck your proffit. \"Why did you submit these numbers?!?\" To make sure financing could make it work.",
            "HA!  You know, I feel like I made such a killing on that deal when I bought my 2016 Mustang GT that I wonder if something similar had gone on at that dealership lol.  It was just way too easy to walk in there and get the APR I wanted, they gave me way more than I expected them to for trading in my 2006 GT to make sure the loan happened and didn't even bother to ask me if I had a downpayment lol.  Like, I got for that 2006 exactly what I'd have private partied it out for lol.",
            "My husband doesn't have a limit on his sales commissions. He's eager to chase down sales leads and share them with co-workers if it's particularly big.\n\nFunny how this employee loyalty thing worked out.",
            "That is a thing of beauty.  I can only imagine what goes through their head thinking up stuff like capping commissions because it's \"too easy to sell.\"",
            "Nothing like the power of collective bargaining.",
            "I worked on a straight commission sales team.  The manager made $90k base + up to double that in bonus. The top sales people make $750k and up.  \n\nThey all respected the boss because she was the one who got them there.  The boss was a pure manager.  Everyone was happy.",
            "LOL, no one in this story ends up looking good. And the comments reflect that, each picking out their own 'bad guy'.",
            "Commission caps are dumb. It takes away the incentive to sell. Even Jim from the office recognized this and called it out!",
            "This story gave me a massive erection.",
            "I have nothing to say except fuck you and your \"Market Adjustment\".\n\nYou're nothing more than a scalper.",
            "[deleted]",
            ">due to demand\n\nI think you misspelled greed",
            "Pretty sure overzealous salesmen like OP were responsible for the insane dealership over pricing on cars like the Focus RS. Donut media has a whole video about how this practice, specifically with Ford, is hurting buyers and auto enthusiasts.",
            "As much as I applaud the insubordination when you were being fucked over, it was very hypocritical of you to get snotty about that when you were absolutely fucking your customers over with that \"10-20k market adjustment due to demand\". I hope you at least used some lube.\n\nThis is one of the reasons why I hate shopping for a car. Fucking ripoff salesmen at fucking ripoff dealerships fucking us customers over.",
            "[https://www.thisamericanlife.org/513/129-cars](https://www.thisamericanlife.org/513/129-cars)",
            "I worked at a collection agency in IT and their best people got crazy checks because of the way the department of education calculated payouts to us. The owners decided they wanted to keep more of the money so the best people left and then the owners bitched because collections dropped to the point they made less money.",
            "If they were smart they'd do tiered commissions instead. so like up to say 45k a certain commission, then 45k-60k lower %, then the next 15k lower, etc. This is a lot more reasonable and still gives salespeople an incentive to try and get more $$$ out of a vehicle while still keeping profits with the company. Also I would absolutely not do this retroactively, how dumb is that come on... you've got to be kidding me. That is a lot of pain for just a little short term gain. /armchairmanagerlol",
            "Out of interest, is there anything I can do to raise my sales game? I don't even work in this field but the skills would really, really help me! Thanks",
            "I damn well hope you were backpaid the commissions they had stolen from you",
            "Take away the incentive to sell and guess what happens? Your sales sky rocket duhh",
            "Good . Don't fuck with sales people's commission . I just quit us cellular recently (along with 4 other coworkers ) because they fucked with our commission among other things",
            "I certainly hope the \"fuck you\" was not an exaggeration.",
            "Greedy management is among the worst kind of managements",
            "Good job in the MC, but this makes me think how dealerships are older, almost-unnecessary model on their way out?\n\nIf you are selling cars without test driving, why couldn't this be done online without a dealership?\n\nIs the answer to why we have dealerships - because of history?",
            "Man I wish I'd known you then lol. [I love my mustang with a passion](https://i.imgur.com/cgnKnfN.jpg), but I'd have loved it even more with twice the horsepower 😅",
            "Taught those greedy bastards a lesson.",
            "I wasn’t smart enough to understand this story but good job bro",
            "Crazy that the GM didn’t realize that his sales team cares about money and understands MATH.",
            "I don't understand. Were you all throwing in a bunch of free stuff for the buyers?",
            "Oh I fucking love this. Pay your salespeople, people",
            "Human nature will continually cause people to stoop down to grab pennies while dollar bills fly over their heads.",
            "\"Why do this? Because Fuck them!\"",
            "Jesus H Christ.  This is utter diabolical genius.  GENIUS.",
            "Fuck with sales, they fuck with you.  \n\n\nWhy do people think it is ok to mess with your flow of income? Sales deal with numbers every day. You're not running anything pass them.",
            "Perfect example for why unions are necessary.",
            "[removed]",
            "The fact that haggling is part of buying a car in the first place really has to go.  Fuck that shit.  Vehicles are already ridiculously expensive...  Why raise the price higher and prey on shy/anxious/trusting people?",
            "Should be a fable for every kid who says they'll never use math after school.",
            "The most amazing part of this story is the 21 Raptors in the lot!",
            "I've never worked for a company with capped commission and I have no clue why you would ever want to encourage your salespeople to stop selling. It's an idiotic idea that has never made any sense to me.",
            "Ross Perot would not have launched his own rival company and become a fortune if IBM had not imposed sales commission limitations.",
            "tbf, 2022 your resale on 4wd ford ute is about 5 grand. If it's still running",
            "This is almost a r/prorevenge move, well done with the Excel move!!!",
            "Maybe I’m dumb, but I don’t understand what you did. You made it so that the sale price was capped to your $2500 commission? You sold cars under their market value so it wouldn’t go over your commission?",
            "When they increase your sales goal by a percentage the next year, and base that on your bonus. We used to alternate hitting sales goal every other month so we could always get a decent bonus every other month.",
            "This is why we need unions. I'm in corporate sales. Everyone needs representation.",
            "4k commission for a car seems crazy high... Were you guys only working on commission / no hourly pay?",
            "Sold industrial process equipment where we  received a quarterly bonus for exceeding quota.  Came on a once in a lifetime sale that produced a bonus of about three times my annual base pay. They grudgingly paid me but quickly capped the bonus program.",
            "\"we are making lots of money, let's reduce the money the grunts make so we can keep more of said money, I'm sure that won't come back and bite me in the ass\" every company before they realize the grunts are the ones making the money",
            "You never created a Lloyd Gross? A fictional salesman you create on paper to funnel all your capped commissions to?",
            "It makes zero sense for both the employer and the employee to cap commission. Absolutely stupid for the employer to expect the employee to continue working above and beyond once the incentive doesn’t exist. Of course they understand this when there’s no incentive for them???",
            "Worked retail audio, manager retail audio and the owned a retail audio shop. All high-end. I would never have dreamed of capping commissions. It’s the definition of self-defeating.",
            "It just boggles me that employers could be greedy and/or stupid enough to not continue incentivizing sales with continued commissions. That said, it's probably better for consumers.\n\nSomething I'm thankful for having worked for a computer shop was being a wage only worker. I was never incentivized to sell the customer anything unless I thought it would actually help them. I'd be open about prices and about alternative options. Hell, I had college students call in from the local college I attended and I'd tell them they had free access to the tech center there, save their money unless it was a hardware issue that the tech center couldn't fix.",
            "See boys and girls, what happens when they unionized? \n\nOh, the sales team might not have formally created a union, but they all stood together against company greed and won. Same thing.",
            "[deleted]",
            "Another example of price caps not working.  Pay attention to this when our politicians start offering \"solutions\" for inflation...",
            "So you point out every flaw in the vehicle and destroy its worth while encouraging customers towards more efficient vehicles instead of needless mark ups.",
            "Car salesmen are one of the worst people on the planet. They're leeches that add nothing valuable to society. What the hell do they even do? Crunch some numbers about a dozen times in a month for a fat paycheck? The rest of their time being spent talking crap about customers and complaining about how there is nothing to do at their job? It's not a job. That is why. They don't even care to do research on the cars on their own lots since it's \"not their dealership\". They're \"just the sales people\". Leeches at every step of the way."
        ]
    },
    {
        "post_id": "nud16l",
        "author": "rweso",
        "title": "You can’t pick up extra time because you had too many sick days.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nud16l/you_cant_pick_up_extra_time_because_you_had_too/",
        "score": 29223,
        "num_comments": 1267,
        "created_utc": 1623073855.0,
        "selftext": "I’m a nurse at a large hospital. The floor I worked on was selected to be the COVID unit during the first and second waves. More nurses than not were catching covid. So whenever I got an inkling of being sick I would call out and get tested. Now if I tested positive then I would get two weeks off without penalty. But I tested negative and returned to work. I get called into the office and got a verbal warning because I had one too many sick days. I said to my manager “you realize we are in a pandemic right?”  She says “yes, I know that but we still have to stick to the original policy.” When we clock in, there is an electronic message that pops up on the time clock that reads “During the pandemic we need to self monitor ourselves and by clocking in you are declaring that you are fit to work.” There was no adjustment to the policy even though we were a covid unit during a pandemic. So I would either have to lie about feeling sick when I clock in, or call out and get in trouble. \n\nHere is where the malicious compliance comes in. I had always picked up a lot of extra time in a sister department. Not because I needed the extra money but because the hospital was always short staffed. My manager didn’t like the fact that I picked up extra time the other department. She wanted me to pick up extra time in our department. So she said. “As punishment you can not pick up extra time in the other department for 90 days (The length of my disciplinary period). You should be responsible enough to pick up extra time in your own department.” As I didn’t need the extra money, I didn’t pick up ANY extra time in that period. I got called almost every day to ask if I could come in because they were short staffed. One of the reasons they were short staffed was because our sister unit was even more short staffed and the nurses on my unit were getting pulled to go work there. If only more nurses picked up extra time on the other unit, hmm. \n\nAt the end of the 90 days I was told I could pick up extra time in the sister department again. At which point I handed in my two weeks notice and told her I accepted a position at another hospital. She then tells me that because of my years of service I need to give four weeks notice. I tell her “no, that’s just a courtesy. So I’ll extend the same courtesy I got when I needed to call out sick.”",
        "permalink": "/r/MaliciousCompliance/comments/nud16l/you_cant_pick_up_extra_time_because_you_had_too/",
        "comments": [
            "Well done. Fuck jobs that give no shits about you and yet expect you to make them your life.",
            "I imagine she had a smug look on her face until you turned in the notice.",
            "Someone once told me never to feel guilty over calling out for legit reasons or for finding a new job because my seat would be filled before the ink on my death certificate is dry. That hit me hard",
            "In our unit, we stopped counting ill calls throughout the pandemic. There was no way I was going to be disciplining our staff for ill calls that could be related not only to their own covid symptoms, but also to issues with childcare/kid's schooling changes, etc. We still aren't tracking ill calls. I'm guessing we might begin again in September. In addition, our higher ups made the decision to add 72 hours of ePTO (emergency PTO) to be used at the employee's discretion for any covid related matter (childcare issues, covid symptoms or care of a family member with covid). This was specifically designed to help our staff preserve their earned PTO. \n\nWe can't afford to lose highly trained nurses because they or their family members are ill. It's a freaking pandemic. How did so many hospitals lose their hearts?",
            "Yep it’s kind of abusive.  When you work as a healthcare professional you have to sign a register saying you are fit to work from a character, health perspective.  You are told not to come to work sick because of vulnerable patients etc.  You have a legal duty of care to protect your patients.  \n\nBut actually be sick and it’s escalation policies and verbal warnings and the extra stress of worrying about your job.\n\nThey act like we have an over abundance of staff to begin with.\n\nIt also creates a culture of presenteeism where staff come to work unable to function properly affecting both staff and patients that day.  If they are contagious then you have more poorly staff the following day.",
            ">I tell her “no, that’s just a courtesy. So I’ll extend the same courtesy I got when I needed to call out sick.”\n\nHad a friend with a similar situation, and the giant knob of a boss hadn't yet taken the resignation letter. So they ended that similar sentence with something along the lines of, \"... and since you apparently don't even want to put forth that much courtesy either, I take back what I said. \\*ripped the envelope in half\\*, effective immediately, I resign.\"",
            ">She then tells me that because of my years of service I need to give four weeks notice.\n\n\"Funny, I thought this was an at-will state.  Can I have a copy of the contract where I agreed to that?\"",
            "In my state there was a shortage of nurses before the pandemic. It seems really stupid to piss off people ypu litterally can't find enough of to begin with, During a pandemic!",
            "yup, courtesy begets courtesy",
            "4 weeks notice??? What's up with hospitals giving people a hard time when they decide to quit. People treated me like dirt when I turned in my two weeks that I ended up calling out the last week. Totally not necessary",
            "Hospitals LITERALLY have the worst policies regarding illnesses and sick leave. If there is ONE employer that should be more lax about sick calls - it's fucking hospitals. Nurses work with sick patients and therefore get sick more often AND because we work we sick/vulnerable populations we SHOULD NOT be working when we are sick. What a joke.\n\nGood for you, honey 💪👏👏👏",
            "My job did the same shit. \"If you have any symptoms of covid-19, you must call out of work. If it's found that you're lying about having symptoms and clock in, you will likely be terminated\" literally a message to the group chat after I put in my two weeks notice because I was 2 points away from being fired because of calling off for covid symptoms",
            "Your manager not only sounds like a tool, but like one of the tester tools I purchased back when I first moved out of my parents house.\n\nFor those wondering, what I call a tester tool is the low end version of tools like ratchet sets, electric drills, circular saws, etc., that I'd buy thinking I need or have an immediate need for. If I use it enough to break it or warrant replacing through wear and tear, then I'll spend money on a high quality one.",
            "Four weeks notice? For a job that could fire you on the spot with zero seconds notice? I would have told that boss to go fornicate with herself and walked out that very minute.",
            "I worked as an MRI tech at an outpatient clinic PRN, but was working three days a week for about two years. When Covid hit, they told me not to come in. That lasted three months. I returned to work, and after a few months decided to retire. I gave one week notice. My supervisor (who was very good and I liked)  said since I'm a professional, I should give 4 weeks notice. I told her that it was all about me, and the large corporation had laid me off with no notice or any sort of severance pay, so I feel zero guilt.  Corporations don't care about workers, so why should I care about them?",
            "I’m a physician and the level of administrative bullshit you RNs deal with on a day to day basis is truly earth shattering.  Keep your head up and good on you for sticking it to the man!  When covid first started I was infected almost immediately. I’m an ER doc and was working in a major metro area where we were under surge capacity from the beginning. I was forced to take off almost 3 weeks by the hospital despite being asymptomatic. I was then forced to make up all that time off the next month per my contract. Total nonsense all around.",
            "Mind blowing. I would expect hospitals to have the *best* health benefits of any industry, both in cost coverage *and* time off for illness.  This doesn’t sound anywhere near the best.",
            "[deleted]",
            "And in an at will employment state you don’t even need to give two weeks notice. Courtesy is not a contract.",
            "Reminds me of an old saying, \"people don't quit jobs; they quit bosses.\"",
            "Did you ever test positive all these times you were out?",
            "Two weeks is a courtesy, even. You can never be forced to work against your will. In the worst case you break a contract where you agreed to that up front and are out some pay as a result.",
            "I always ignore my employer's sick policies.\n\nIf they ever say anything about it I just tell them \"I don't care what the sick policy is. The only sick policy I care about is mine, and the policy is that if I don't feel up to working then I don't.\"\n\nBut I only work throwaway jobs that can be replaced within a week if need be, so.. low risk.\n\nStill, gives me the freedom to respect myself.",
            "\"...because of my years of service I need to give four weeks notice.\" What the eff?",
            "Giving two weeks notice is BS anyway. If it doesn’t work both ways it has nothing to do with being professional. \n\nI gave my two weeks a large maintenance company, about a half hour later I was called back to HQ. When I get there I see my truck boxed in. I go to the office and I am informed my employment is terminated as of now, I had to turn in my keys radio and security badge before they would unblock my truck.\n\nI was then informed where and when to turn in my uniforms and that my final check would be issued at that time as long as everything is accounted for. As an extra kick in the nuts the date was almost fore weeks later. \n\nI was never in trouble. I barely ever called in sick Got along with most of the people, and didn’t stir up shit. I have no idea what the craziness was about.",
            "Good for you.  I travel, but I watched the staff nurses get screwed pretty bad during the last year.  The stuff the hospitals did were awful.  \n\nMy first nursing job was a real meat-grinder of a floor.  I would call at least one RRT a week, sometimes one each day I was there.  I was there almost four years.  Around year three I couldn’t stand it anymore so I applied to transfer to a unit with a higher level of care.   Like every hospital they constantly promote their desire to help your career advance and grow… however because they constantly lost so many employees on our floor who quit, they blocked my transfer.  Citing “the current needs on our floor are too great for us to let you transfer”.  They knew I was unhappy.  \n\nI spoke with the department chair and I said if you can’t let me transfer I’m going to leave the hospital system.   They said they would work on it and let me know.  A month goes by, I reach out, they don’t respond.   I put in my two weeks notice and the boss literally says “well good luck to you” and gives me the cold shoulder/silent treatment the rest of my time there.\n\nThe boss was your typical passive-aggressive one... “self-scheduling” that magically changed from what you put in.  Take a week of vacation and always scheduled the Friday before it starts and the Monday after it ends.  God forbid someone arrange their schedule to squeeze in three or four extra days!  Jfc. \n\nI didn’t care.  Always leave a toxic work environment.  They company doesn’t care about you, no reason you should care about their best interests.  Be happy.  Do what’s best for you.\n\nI’ve been traveling for three years now and I’ll never go back to staff nursing.",
            "“Here’s my two weeks notice”\n\n“You have to give four weeks notice”\n\n“Uh. Just kidding zero weeks notice.”",
            " *She then tells me that because of my years of service I need to give four weeks notice.* \n\nYea, right.  You're lucky I'm giving you two weeks, how much notice would you have given me if I was being fired?\n\nI'm so glad I'm retired, no more working for idiots and a\\*\\*holes.",
            "This happened to me when I asked to leave early. My son won an award for a drawing contest first place in all of first grade. I was ecstatic. The ceremony was at 6pm I asked to leave at 5:30pm to make it. I had been on the clock since 7amHe told me if the job ain't done youre not leaving. It's not like there weren't 3 other people there. At 5:30 I left went to the award ceremony. What if he looked in the audience and saw my empty seat what does that tell him? My job is more important. The next day I'm pulled into the office and sat down. Was told that by abandoning my post I forfeit my job. In the same sentence was told if he were in my position he would have done the same. So you tell me.",
            "Frankly, it makes no sense whatsoever to me that a hospital won't give their people unlimited sick time. I mean, even if they were forced to be checked by a doctor or whatever to verify the illness. It is too easy to spread things like colds or the flu to patients that are already sick or recovering from other ailments. It's purely insane, and that's even *before* Covid hit. It's even worse after.   \n\n\nSide note: A family friend had pneumonia and was hospitalized. He did not have Covid. During his stay in the ICU, when he was getting better, suddenly he started getting worse. He tested positive for Covid 3 weeks after he was initially admitted to the hospital. Why? Probably this exact thing. It's stupid and it kills.",
            "Love your work. \n\nI would've sent an email to the manager: \n\n\"Just confirming as per our conversation earlier that you would like me to ignore the health declaration on the machine when clocking in and work even when I am displaying covid symptoms? I just wanted to double check that this was what you ordered me to do. Thank you!\"",
            "“We’re short staffed tonight”\n\n*damn that’s crazy, good luck tho*",
            "Absolutely love coming to the sub and hearing about malicious compliance being used against the management. Workers of the world, unite!",
            "You need to give us two extra weeks of your time so we can fix our mistake.",
            "Rt though, fuck the 2-4 week notice shit. They'd fire you the minute they decided you, but expect you to give weeks of notice before you quit? Fuck that",
            "I hope every time the sister dept. asked you to put in some time, you noted something like \"Karen doesn't believe I am a good enough worker, so I am in a 90-day disciplinary period and am not allowed to charge any other departments.\"",
            "Sounds like the manager doesn't understand how illnesses work. Why are unqualified people working in healthcare?",
            "A previous boss once made the mistake of asking me in front of his boss what my plans were when I was leaving. Not missing a beat, I looked them both in the eyes and said \"I think I'll live in a cardboard box behind taco bell and suck a lot of dick to get my self respect back.\"",
            "My hospital job I recently left, we were the first covid unit in our hospital, and now the last one to still take non-ICU covid patients. We had to do a screening questionnaire at the beginning of every shift.\n\n I answered the questions honestly, one of them asked about new or unusual headache, which I had a headache so I said yes. It said stop, call employee health, I call and they said talk to charge and go home. I tell my charge, they say call house supervisor, house sup says its up to charge, charge says to just work. Even at that time, I was sure the headache was nothing, but what's the point of a screening if you ignore it?",
            "That last paragraph was *chefs kiss* gangster.",
            "Thanks for all you do, I can't imagine work was a walk in the park this past year.",
            "If I gave two weeks notice and they told me I needed to give four, they would instantly have zero weeks notice. Glad you stuck it to them",
            "100 percent love this. I also am at a large hospital and I put in a couple of hours of pto for late start days. I have been putting in extra time also. We just hired 2 more people so I thought I’d reward myself by taking some time. Manager sees pto requests and tells me he approved them…but I didn’t put them in with company policy. warns me (in the I’m being a nice manager way) to put in my time earlier. The schedule was made in April to cover through august. I politely applied I have a young daughter and am not in a place to plan that far in advance. Then asked for him to send me the company policy so I “can try to be in compliance” in the future.” All I got is an email forward of when another manger asked people to turn in our requests so she could work on the schedule. I think I’ll continue to put in my earned pto time and take it when I want (still is weeks in advance)",
            "Thank you for working to save lives during a pandemic. I’m sorry you had to wade through so much bs just to do your job. Thank you for your service!",
            "The only punishment they can really give you for not putting in a longer notice is to give you a bad recommendation at another job.\n\nYou already got another job, her threat was laughably useless.",
            "Wow!  At that point, I think I would have changed my notice to *effective immediately* grabbed my stuff, and had a lovely 2 week transitional vacation.",
            "I work at a school. SO and I had to quarantine because my mom, who lived with us, tested positive.\nWe were treated like absolute shit for taking\"unnecessary\" time off.\n\nFive coworkers have vanished without a peep at separate times. All five had to isolate after testing positive. None of the people who interacted with them were notified - in order for us to avoid a shutdown.\n\nShould the school shut down to sanitize, only teachers are given off. For admin staff it's business as usual and there is no mention of sanitizing our block.\n\nHonestly, they can just come right out and say \"we don't give a fuck if you die\".",
            "Lmao what kind of employer thinks they can tell you how much notice to give. I’ll walk out with no notice if I feel like it",
            "I worked at a big retail store that loves the color red. I was a barista in a popular coffee shop in the store. My boss was amazing. I need a day off? No problem! The rest of the employees in other departments were micro managed, my boss was chill as long as everything got done and stayed clean. I worked my butt off, picked up shifts if she needed me too. She was going to school to improve her life and I think that’s why she was the way she was. Upper management gave her the ultimatum: school or work and she picked school. We all hated when she left but we 100% supported this choice. Then the new manger came and micro managed a team that was working fine and we stopped doing as well, I stopped taking extra work. I got a new job and left that one because my time wasn’t valued anymore. They offered me a good amount of money to stay because I was a solid worker and my regulars loved me. To bad they didn’t see value in their employees",
            "\\>The hospital was always short staffed\n\nwell there's your problem. of all the multibillion dollar industries to penny pinch...",
            "It was a good story until the last paragraph.\n\nThen it turned into an amazing story. Well done.",
            "Lol @ “you need to give 4 weeks.” You could have given them 0 weeks.....",
            "\"You'll need to give four we-\"\n\n\"I can give you 2 minutes notice if you'd like to go this route, don't bullshit me.\"\n\n\nHow that interaction went with me when I quit my job at a call center. Manager was not happy with that, but I'd emailed my notice from my personal account so they couldn't do anything about it.",
            "> She then tells me that because of my years of service I need to give four weeks notice\n\nIn the US most states now work under what is called 'at will employment'.  That means that you can be let go at anytime, with or without cause and with or without notice, at the employers discretion.\n\nIt also means that you, as the employee, can quit at any time, with or without cause and with or without notice, at your own discretion.\n\nThe idea of '2-weeks notice' (or other term) is entirely a courtesy and is not required.  \n\nIOW, if you're not worried about burning bridges, you walk the fuck out anytime you want; screw their so-called '2-week notice policy'.",
            "Wow this manager fucking sucks, glad you got out of there",
            "I'm happy you took another position and I thank you for the care you provide. Nurses are the backbone of all hospital care. Considering the hell you must have endured since Covid hit, the administration should be coming to give you foot massages at the end of each shift.",
            "Where I work we had to fill out a form every day saying we don’t have any symptoms of covid or have been in contact with someone that tested positive for it. That if we answered yes to any of the questions, we had to go home. Well, my wife tested positive with symptoms. I thought for sure they’d make me take a couple weeks off. They changed their policy real quick afterward to one that said you had to actually have symptoms. Then I realized they didn’t actually give a shit about stopping the spread.",
            "“And your punishment is… you can’t work more voluntarily! Ha ha!”",
            "Wait pandemic or not, aren’t nurses not supposed to come in when sick?",
            "Sounds like every hospital I ever worked at. People have no idea how we nurses get treated.",
            "Getting a verbal warning for taking sick time is flat out disgusting! God forbid you take care of yourself to ensure you are capable of living and working. This is a clear sign that that don't see employees as human but as human capital that is to be squeezed at the whims of management.",
            "What were they gonna do, write you up for not giving a 4 week notice?",
            "There’s a nursing shortage and these are the games she’s playing? I think I know why y’all are understaffed",
            "Give respect to get respect. Your a badass OP",
            "same thing happened to me at my hospital! Im a member of the nursing staff and work in direct patient care, but i am not a nurse or cna/lna, i am a patient safety attendant. I work all over the hospital for the resource department, including covid units and isolation rooms, and my lna bsf and roommate works full time on our designated covid unit. So considering these things, and how hospital policy is to not come in if you have had any known contact with someone covid pos or are experiencing any of the symptoms, over the course of the pandemic i ended up having to same day or night before call out 4 times and i ended up with a fucking strike on my record for \"calling out for more than 72 hours in a work year\". Like, first of all, even if we werent in a pandemic that part of policy is cruel. your workers are human beings with lives other than work and that life in only allowed to get in the way 3 times in a year before you get a strike? and what annoys me most is if i was irresponsible and hadnt called out and ended up giving a patient covid knowing i had symptoms i would lose my job and had i have ever actually gotten covid i wouldnt have been penalized for my call outs at all. so i was a responsible worker who did what was best for myself and my patients and ended up in an attendance meeting with a strike on my record. i hate the way lower level hospital workers are treated, and im talking everyone below physicians and management and owners themselves, get treated like shit.\n\n(i didnt actually have 4 covid scares, 1 time was my cars brakes deciding they would no longer be working as i tried to leave for work, 1 was sudden symptoms while i was at work to which i stepped aside to check my very suddenly sore throat only to realize i was literally actively giving patient care with strep throat and needed to go to UC, 1 was close contact with someone who tested positive, and finally 1 was covid symptoms that both my roommate and myself were experiencing, so life and the pandemic simply got in the way of work more than three times in a year which is a no no at my hospital)",
            "Seems like the manager is great a making up rules as she goes along.  Was that 90 day declaration of only extra time in your own unit an official HR rule or something she made up?  That 4 week notice definitely was made up.",
            "At my hospital, the public message to the staff was not to come in sick, the reality was you were expected to be at work no matter what.  Sadly, I think that's the case not only for every hospital in the country but every workplace period.",
            "Imagine thinking you can enforce requiring someone to keep working after they’ve quit. 🙄",
            "This type of management is why I am not a nurse anymore.",
            "I changed it from 4.9k upvotes to 5.0k",
            "Good on you. And feel free to call out with names in these situations. Its always nice to know what companies to avoid.",
            "> She then tells me that because of my years of service I need to give four weeks notice.\n\nDoes she think the whole two weeks notice thing is a legal matter? You don't even have to give her two week, you could just leave one day.",
            "Need to give four weeks or what? They'll fire you?",
            "That was great.\n\nAlso thank you for working the front line during the pandemic.",
            "Idk why nurses get treated like shit even though we’re always short staffed and they clearly need us",
            "It’s funny people actually believe hospitals are staffed adequately in the US. Profits are more of a priority than patient safety. It’s always the nurses fault though",
            "They call us essential workers because they dont dare to call us sacrificial workers.",
            "I love it! Speaking as a spouse of a nurse who worked in the covid ICU units for months straight, it was a very difficult time to navigate - and my wife’s hospitals policies (or lack of change in them) were a little bonkers at times too. Thank you for your selfless part in helping during the pandemic, and good for you to find a new place to work!",
            "“You realize we’re in the pandemic?” Lol! \nEarly on my medic friend got barred by the management from wearing a mask. Got Covid. The hard, nearly lethal version.",
            "During the height of the pandemic in my area, around Thanksgiving giving 2020 we had 10+(about 20%) positive cases in our office over a one week period. \n\nI expressed my concerns and my intentions to work from home which is very doable in my Industry and with the technology our company has developed. I was forced to use my vacation AND work from home in order to not get in trouble. I took a little more than 2weeks \"off\" while waiting for some time to pass without new cases.",
            "Wow, your union really sucked if they allowed that into the contract.",
            "I’ve told my\nManager that I will give them the same amount of notice that I’m moving to a new job as they would if they were gonna terminate me.",
            "You tell her “no, that’s just a courtesy. So I’ll extend the same courtesy I got when I needed to call out sick.”\n\nAWESOME!!  \n\nThank you so much for all of your service and hard work especially during the pandemic!!  \n\nHope you are enjoying your new place of employment!",
            "Are nurses not unionized where you live? A shop steward/union rep should have ripped your manager apart",
            "Lol, required to give 4 weeks my ass. You aren’t required to give shit.",
            "It might be different in the NHS hospital where my sister works but if she had got a disciplinary related to following Covid guidelines, she would have taken it to HR and they would have whooped that managers arse...\n\nAlso, telling someone they can't pick up time helping out another department? Their ward manager would have waded in and told her manager to 'do one'...",
            "I was working for a small contract manufacturer. I was hired as customer service to the company I had been working for because I knew all the parts and suppliers. On Christmas Eve, my manager told me, not asked me I would be working all day until 10 pm because a new computer system was being installed. I had 2 children under 5 at home. I promised to come in the day after Christmas to do verifications instead. He stomped his feet and said no! I need you until 10 pm Christmas Eve.  I said, you will have to cover it, I won’t be here I quit!  He was bullshit at me. I had brought as many of my records as possible, to help myself. I got a box, put them all in it and dropped them to the Purchasing  manager at my old company. They approved me going there to make the manufacturing process run smoother, which I did.\n\nI also worked for a Financial company which was upgrading our computer system. I was  asked if I would be willing to go in for 1am ( my usual start time was 8 am). to verify the new system in order to make things transition smoothly.  I was paid double time plus bonus for the extra 7 hours I worked plus all of those who helped out got a long weekend, an extra paid day that weekend.  That is a company which knows how to treat employees.",
            "I hope you'll considered naming the hospital where you quit your job. As a patient I'd want to avoid placed that treat there staff this way if possible. Good luck at your new job, hopefully they treat you better!",
            "Imagine telling someone they have to work for you for an entire month before they can quit",
            ">She then tells me that because of my years of service I need to give four weeks notice.\n\nShe's got some balls. I would have just laughed.",
            "this one gave me that feeling of like.. the edible just hits and someone offers you free pizza.. its the best way to describe it its just fantastic, i hope you had an audience for the final line",
            "You should have just said \"okay, 1 week notice\"",
            "My wife and I work for the same hospital. They changed the policy during the pandemic to allow people to pick up incentivized shifts (1.5 time) within the same pay period as their sick day, because the nurses were running ragged and they needed people to pick up shifts. I wonder when they will reverse it.",
            "You should have talked to HR. If it isn’t in the policy, then your manager may not have been able to restrict you working elsewhere.",
            "That is definitely some bullshit. I work er, I definitely had my fair share of friends/coworkers out due to covid. To pull this shit during this time is fucking unheard of. Fuck that hospital. Good for you for getting out. We’re always replaceable, just a number to them. You did the right thing.",
            "Isn't 2 weeks just a courtesy?",
            "[deleted]",
            "At my job they told everyone to get tested for COVID if you felt or noticed symptoms. But the was zero incentive to get tested because if you tested positive it was automatic two weeks quarantine no pay. Eff em.",
            "Here in the UK it is 4 weeks notice and in the contract for my last job. The company treated people like absolute shite and everyone who left it was a direct result from the way they had been treated. So, what did the staff do when they could no longer handle it? Give in the 4 weeks notice, then get signed off by the doctor with stress/anxiety so they don’t have to be there that horrible 4 weeks! \n\nI’ve seen it happen so many times now at least 8/10 staff I’ve seen come and go have done it.I done it myself when I couldn’t take the abuse any longer!",
            "it happens everywhere but I still cannot believe Nurses are treated like they're doing a min wage entry job (and I think those that do work minwage/entry should be treated with respect always....just making my point quickly because they often aren't).\n\nHighly trained, work their asses off, get shit done.  Treat em better.",
            "My sympathies. I worked in a very small unit - 12 rooms, 3 nurses, one tech, and me, the secretary. During Covid, my unit shut down; so I got to pick up where I wanted, anywhere in the hospital. It was lovely.\n\nWe got to a point where our unit reopened. Our other night secretary decided he'd had enough of our manager and went back to his original floor. Our manager wanted me to work five nights a week, including every weekend, so she wouldn't have to get a pool secretary in as often.\n\nWithin the next week, she was short two night secretaries. I'm working from home, five days a week, and I love it.",
            "Glad you got to give her your notice that way!!",
            "Excellent.  Your boss got exactly what she deserved when she tried to punish you and control your OT.",
            "i have never understood the limitation on sick days and the legality of that. It's also extremely stupid. If a person is sick and decides to go to work anyway, they can infect the whole office with whatever bug they have. At my company it is forbidden to come to work when you have something contagious. And with everyone working from home now with covid, almost nobody calls in sick. First of all because there are less sick people but also because at home you are more comfortable and you can still get work done while sick.\n\nOf course, you can't be a nurse at home! That would be weird to bring patients to your house so you could work from home hahaha :-)"
        ]
    },
    {
        "post_id": "cqr1i7",
        "author": "jumboface",
        "title": "\"Call the HOA because my yard is \"devaluing\" your house? Alright, I'll have it clean by the inspection date.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cqr1i7/call_the_hoa_because_my_yard_is_devaluing_your/",
        "score": 29189,
        "num_comments": 1669,
        "created_utc": 1565881485.0,
        "selftext": "This is a story of my mothers. She has always been incredibly hardheaded, but this sticks out a lot from my teenage years.\n\nOnce a year she always had us pull everything out of the garage (lots of boxes my mom has a concerning amount of possessions) so we could go through it and clean/reorganize. This particular year the couple who owned the house across from us (flippers) where in the process of selling their house. Unhappy with my mothers \"unsightly\" driveway covered in boxes soiling their good image, they made a call to the HOA.\n\nBy the time my mother received the letter, the mess had been put away, but they decided to get her on a few other complaints such as the bikes against the side of the house and the \"patchy\" gravel. She had two weeks to have everything up to standards.\n\nPetty and easily frustrated, my mother knew immediately who called since the couple had come over and told her flat out with their renovations they were selling that house for \"way more any other house and this neighborhood\" and would appreciate if she respected that by keeping her property on par.\n\nFor the next two weeks every box from that garage was in our driveway. The couch and the living room TV came next. This was early summer, so it was perfect weather to sit in your yard in your short shorts and sports bra. My mom made sure to wave and smile every time they brought someone over for a showing.\n\nThe final step came at the end of that two weeks though. After the yard had been cleaned up and cleared by the HOA, my mom went to the local walmart and bought a for sale sign. She wrote about 1/4 of their ridiculous asking price on it and finished off with a big SOLD written across the front and stuck it out in our yard.\n\nNo clue what they ended up selling their house for, but it sat empty for a while so I'd assume it was below offer.\n\nTL;DR Don't tell my mom she's devaluing your house, or she will go far out her way to do so, all while complying with the HOA.",
        "permalink": "/r/MaliciousCompliance/comments/cqr1i7/call_the_hoa_because_my_yard_is_devaluing_your/",
        "comments": [
            "LMAO that final step was a masterpiece. All that stuff before is a headache and time consuming, but that under value sign is genius.",
            "> walmart and bought a for sale sign. She wrote about 1/4 of their ridiculous asking price on it and finished off with a big SOLD written across the front and stuck it out in our yard\n\nOh... oh that is so wonderfully evil I want to send your Mom a card on Mother's Day.",
            "[removed]",
            "My dad had a habit of starting big projects (putting in a pool, installing a geothermal well, adding chimneys and fireplaces, etc) and taking forever to finish them. We didn't have a HOA and most people didnt mind the mess, but one couple we shared a property line with were always complaining to the city whenever they could. When my dad built the frame of the deck for our aboveground pool, he waited to finish the platform and the fencing until he could get nice planks and make it look good. But this couple complained to the city, and my dad couldn't find a loophole in the building codes that would give him more time. So instead of hiring someone to do it or taking some extra days off work to do it himself, he threw on some unfinished plywood flooring and made a fence out of chicken wire. The neighbors were not happy about the \"eyesore\", but it was up to code, and my dad never got around to fixing it up.",
            "I live in a neighborhood that has a really strict HOA; however, our house is just outside their jurisdiction. The amount of angry Karen’s that have came to our door just to be told they are powerless is priceless.",
            "The whole concept of HOA is confusing and irritating to me",
            "The short shorts and sports bra is my favorite part of this anecdote.",
            "HOAs just need to die. \n\nIf a neighbor is trying to sell their house and ask me politely if I could mow my grass a little more often for them, sure, I’ll help out, not a big deal.\n\nLucky me there are plenty of HOAs branched off my street, but my street is part of none of them. Freedom is pretty awesome :)",
            "This was removed by Automod for a while. I have no clue why. It’s missing from the mod logs and the action reason was not displayed...very strange.",
            "I think I would like your mom!",
            "HOA Compliance level: EXPERT",
            "[removed]",
            "That is some next level revenge",
            "What even is the point of an HOA? Ah yes, let me sign away my rights to *check notes* decorate my house the way I want, AND I get to pay for it. Please take my money!",
            "Your mother is an evil genius :) I hope it rubbed off on you.",
            "That last bit with the sold sign is elegant. Pure spite, and well earned. Kudos.",
            "r/fuckHOA would like this.",
            "> She wrote about 1/4 of their ridiculous asking price on it and finished  off with a big SOLD written across the front and stuck it out in our  yard. \n\nThis... This is a wonderful idea. So beautifully quiet & polite, yet FU.",
            "The HOA allowed the sign? They must still be kicking themselves.",
            "And its gone. \n\nPlease mods, if you remove a high upvoted/commented post give some reasoning, so we can understand...",
            "Having neighbors that clean their garage would increase the property value.",
            "Got removed as I was reading it lmao",
            "The neighbors sounded like pricks who deserved every single bit of the can of whoop ass your mom handed them.",
            "The icing on that cake was the sold sign in her own yard that was a beautiful move",
            "[deleted]",
            "Why would your mom be actively against a neighboring property selling for a lot? She shot herself in the foot, property values go up when houses sell for a lot.",
            "I hate when a post that looks super interesting and has thousands of upvotes gets deleted before I can read!",
            "That's awesome.  Fuck HOAs.",
            "NGL I've never seen a for sale sign with the selling price on it. Ever.",
            "Honestly, a true hero.",
            "Pro revenge right here.",
            "You're mom deserves the Nobel Prize for The Neighbors Can Kiss My Ass.",
            "Needs to be cross-posted to r/FuckHOA.",
            "They were flippers so I'm guessing that at some point they probably had a dumpster out front and workmen coming and going cluttering up the street with extra cars and delivery trucks bringing rolls of carpet and crap but they bitched at your mom for her ritual spring cleaning?  Your mom rocks.",
            "[Removed] SHIT, I wanted to read that",
            "Upset it got deleted before I could read it",
            "Mods, if you’re gonna delete shit, especially heavily upvoted posts, please say why?",
            "Solid move.  They had it coming.",
            "Haha, your mom is awesome. This sounds like something my dad would do, well would TRY to do but my mom would put a stop to it.",
            "That is some serious /r/prorevenge stuff right there!",
            "Sales are public record and you can look it up with most apps like Zillow/realtor/etc. if you’re curious what it sold for.",
            "I have reluctantly taken on the mantle of HOA President recently at my complex. It is literally eight units in two buildings with a small courtyard, front yard, and parking spaces out back. Despite our modest property, you’d be surprised how often I’m bothered on a regular basis about the tiniest nuances of day-to-day life (e.g. literal text I received recently asked me to tell the lawn service to “not cut the grass too short since it would show ‘bald spots’”...seriously). I have to ensure we collect assessments, maintain liability insurance, sanitation needs, pay utilities, etc. The main objective is to have a tiny community sublimating our impulsive whims in order to aim for the ideal balance for all of the landlords/tenants. In other words, we don’t want someone painting the front of their unit to look like a Cannibal Corpse album cover (although that could be wicked and should be brought up at the next meeting). While I value open mindedness and independence, if you want to be a “free spirit” or whatever you deem necessary to enjoy your home, then this type of place is not for you. I can tell you from experience that when I was looking for a more traditional house to live in, that all of the listings (at least in my price range) seemed to be flippers renovating homes in seedy parts of town in line with all of the latest trends. While the finished product may have been impressive, it seems fairly challenging to enjoy when the neighbor across the street has a half dozen rusting junkers on their front lawn and clearly doesn’t give a rat’s ass how their place looks at all. I’d rather have a somewhat bland exterior because inside is where I welcome the people I value most anyway and truly shows my personality.",
            "Putting \"sold\" on the low-bid sign... stroke of utter genius.",
            "As the JustNO subs say, \"Play bitch games, win bitch prizes!\"",
            "Being in the real estate industry this was Oddlysatisfying. Thank you for making my day!",
            "Lol my neighbor has been trying to sell her mom since the beginning of the year and blamed out leaves that were blowing in her yard for her home not selling. We have the lawn taken care of now and no leaves blow in her direction any longer BUT her house still hasn’t sold. Lol",
            "Woah. I hope this is real.",
            "Your mom is a winner.",
            "Many real estate sites have the past dozen or so sale dates and prices of houses. Check Zillow or realtor.com",
            "I love love love HOA tales",
            "I hate the concept of flipping. It just drives up the price of everything for everyone and benefits very few. It's frustrating and annoying but the flipper mindset is \"fuck you I'm hustling\"",
            "You may be able to see the final selling amount on Zillow!",
            "Ive never understood home owners association. Being British I've always been confused it's some kind of group of people that care too much about vanity that they force it on others so everything conforms to their plans? Patchy gravel is soo petty. Your mum definitely did the best thing and I love it.",
            "Your mom is a goddamn genius for thinking of the sign",
            "Can you tell your mother that an Internet stranger loves her and her malicious compliance very much so?\n\nThis is one of my favorite stories I’ve read on here 😆",
            "Removed lol",
            "Removed?",
            "Post content is gone :(",
            "Removed?! What’d it say?",
            "I'm glad HOAs don't exist where I live, it's fucking stupid. If I bought the house, then it's my decision what to do with it, I shouldn't have to make it look a certain way just because neighbours would prefer it.",
            "Hey OP (u/jumboface for the tag) if you care enough (and tbh I'd like to know) you can always go on zillow and see what that house last sold for (and possibly numbers for sales before that) and compare it to the value of the houses surrounding it",
            "This is the plot of the latest American Dad episode, with a few tweaks",
            "Land records might tell you the final value of sold for. Some are even online depending on the town. You could figure out what it sold for, though you would need to know what they wanted for it first.",
            "I live in the 3rd world and i've recently been learning about this HOA stuff. To me it is mind-bogglingly superficial to the point of being revolting.",
            "That final act could have cost her tens of thousands of dollars had they spoken to an attorney.  Tortious interference with contractual relations is a thing.",
            "why people buy in HOAs is beyond me. paying money to be controlled and risk losing your home.",
            "Am I the only one who just thinks your mother ITA?",
            "What a fucking boss ass bitch, your Ma’s a legend.",
            "Before I got to the part about the yard sign, it was just your garden variety malicious compliance. But that sign moved it up to a whole new level. Hats off to your mother!",
            "r/fuckhoa",
            "America, land of the free.\n\nAmerica, where other people can tell you to tidy up the property you own.\n\nChoose one.",
            "Well HOAs are useless anyway. Your mom is beyond awesome.",
            "The SOLD sign is the amount of creativity I could only dream of.  This stands out as my favorite",
            "Seems like those people did the right thing to move out of such a trashy neighborhood",
            "Ahh, flippers annoy me to NO end. There is rarely a fixer-upper in the CA bay area due to these leeches. Your mom rules.",
            "I’ll never understand why anyone would agree to buy a house with an HOA. The whole purpose of owning your own home is to do what you please. It’s like buying a car and the car manufacturer charges you x dollars a month and tells you what you can and can’t do with it, Ridiculous.",
            "HOAs should be illegal",
            "So your neighbors politely asked you guys to not trash your front yard while they were trying to sell their house, you did anyway, they formally complained to your HOA, and then you guys acted even trashier?\n\nIf that's right I get why you guys would be upset having them call on you, but wtf is wrong with your family that you couldn't be a kind neighbor for a few weeks. I mean just take your trash/boxes out back hidden from view. This should be posted on /r/trashy.\n\nIt's clear you were jealous of there home, even if it was overpriced. I believe this because if you really didn't like that neighbor, you wouldn't be making it harder for them to leave. You would be doing everything you could to get them away from you.  It's cool that your Mom stood by her values, but she should have had some self awareness to see the bigger picture.",
            "Genius.",
            "County assessor's have websites. And the sale price of each house in the county is on the site. So you could look it up if you really cared.",
            "Your mom is awesome!",
            "Is your mom single?",
            "/r/fuckHOA",
            "I'm always reminded of [this story](https://www.reddit.com/r/tifu/comments/8vb50y/tifu_by_buying_a_house_that_wasnt_attached_to_the/) when I hear about flippers.",
            "My god that is diabolical, I love it.",
            "Fuck HOA’s. They are only there so bored housewives on Xanax and box wine have someone to complain to",
            ">No clue what they ended up selling their house for, but it sat empty for a while so I'd assume it was below offer.\n\nProbably not. It's really easy to lookup the taxable values and sale history of a house. Any realtor worth a shit would have shown potential buyers that your mom's house was in fact, never on the market.",
            "The HOA was pissed that you had bikes leaning against the side of the house? What the hell?",
            "/r/fuckthehoa",
            "This is why I will never understand HOA. Yes I know how they work but why on earth would you buy what for most people is the biggest investment of their lives, and then not be allowed to put a bicycle against it. I have never heared a story about one that was purely positive.",
            "She could have just put the sign out there and done the same thing with less effort.",
            "Does your mom work?",
            "What's the point in owning a house if you can't even lean bicycles against the wall without trouble?",
            "In my old neighborhood, someone complained about another guy’s lawn not being mowed weekly. After he was threatened with fines, he just had the entire thing mulched. No grass to mow means no fines for not mowing. The rules around using mulch changed that year, lol.",
            "It's been a rough week for me personally and professionally, and I just wanna say that this put such a smile on my face!  This is petty perfection, and I want to pay her to give me petty lessons.",
            "Kind of the opposite side of the same coin...\n\nAn urban legend in the city I grew up in told that there was an exterminator who also flipped property. He'd park the pest control / exterminator van on the street outside the home during weekend open house events. Then he'd low-ball 'em the next business day.\n\nThe story was that he was successful a number of times before being found out but they couldn't make anything stick from a criminal perspective... But he stopped once some folks took him to court.",
            "Awesome lol, this sounds like an episode of Malcom in the middle",
            "Damn that last move is pro revenge",
            "Is this a cultural thing with Americans that they always seem to want to \"stick it\" to people even if they don't have to?",
            "Hell Yes!",
            "This whole thing got better the more I read. The for sale sign with a bogus price is pure genius. Moral of the story: don't be an asshat.",
            "And this is why I will never live in an HOA neighborhood. PS. Your mom is a badass.",
            "you could find out how much it sold for via a public records search, or maybe simply looking the address up on zillow.",
            "Deleted :(",
            "What the fuck the post disappeared right as I started reading. What's the link to view deleted content again?",
            "When something gets removed/deleted, it becomes forbidden fruit. I just KNOW this would have been awesome to read!",
            "Why was this just removed I was literally in the middle of reading it",
            "Damn, removed?",
            "Why is it removed?",
            "Love when a post gets removed while I’m in the middle of reading it",
            "Where did it go?",
            "I’m all of a sudden imagining the antics on Step Brothers. 😂",
            "Outgunned/outplayed"
        ]
    }
]