[
    {
        "post_id": "11598pf",
        "author": "moxiesa",
        "title": "No abbreviations WHATSOEVER? Okay, no problem!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11598pf/no_abbreviations_whatsoever_okay_no_problem/",
        "score": 26735,
        "num_comments": 1645,
        "created_utc": 1676703405.0,
        "selftext": "Recently, my quality assurance has handed down a new policy that we are “not to use any abbreviations in our call notes whatsoever. Short hand is not permitted.” \n\nI work in a call center taking information for admissions of new medical clients. So the people reading my charts/notes will be medical professionals. The only abbreviations used are those commonly known in the practice, such as IOP (intensive outpatient), ASAP (who doesn’t know this?), etc (come on now). \n\nSo I have adopted their rule to the letter. I wrote every single thing out that would typically be abbreviated. Sometimes the notes require that times be recorded. Example: “I set the callback expectation for by 10AM.”\n\n\nIn my most recent scoring I was marked off for using “spelling errors in notes”. When I requested a review of my score, my supervisor advised me that writing “ante meridiem” was what caused me to lose points. I kindly cited the new rule that requires no abbreviations be used. My supervisor stated that he had never heard the term ante meridiem before. I explained what it meant, being the long form of the term AM. My score was amended to reflect no error was made.",
        "permalink": "/r/MaliciousCompliance/comments/11598pf/no_abbreviations_whatsoever_okay_no_problem/",
        "comments": [
            "Really lucky you don't work in light amplification through stimulated emission of radiation support.",
            "I got an essay marked down in university where I was describing the purpose of the ellipsis [...] in writing, with the comment \"the word is ellipse\".\n\nI was waiting for him at his office the next morning with a dictionary.",
            ">My supervisor stated that he had never heard the term ante meridiem before.\n\n\"I've never heard of it therefore it's a mistake when you use it correctly.\"\n\nThis irks me so much because it sounds so familiar.",
            "Wait until he hears about post meridiem…",
            "I’m a paramedic, and had a medical director one time who was an absolute prick. Condescending, rude, and wasteful of our time. \n\nOne of the things he would do at the quarterly department meetings was go over one or two calls we had by reading the ambulance run report. \n\nEvery time he would get to a commonly used and accepted acronym he would stop and say, “Ok now, what does A&Ox3 mean? We’ll say it all together; ‘alert and oriented to time, place, and person.’ “ And he would speak like you would to a bunch of 2nd graders. \n\nSo I started writing my run reports using no acronyms or short hand whatsoever, making them incredibly long and a pain in the ass to read. And since he mostly selected reports based on length he often ended up selecting mine. \n\nHe read through 2 or 3 of mine, but since they were correct, and there were no acronyms or other things he could use to be condescending to us it wasn’t as much fun for him and you could see it. I also started to raise my hand and ask what every single acronym or shorthand term he used meant. \n\nEventually he got caught stealing a computer and fucking a patient and was fired.",
            "I'm curious.  If your supervisor had never heard the term ante meridiem before, why did he think it was misspelled?",
            "Check if the software you're using can automatically replace the abbreviations into full words - I think word can do this..",
            "[deleted]",
            "On the eighteenth day of February, the year of our Lord two-thousand-and-twenty-three, common era, at forty-seven minutes past seven of the clock, post ~~meridian~~ meridiem, I elected to post this comment.",
            "I work in an industry where a large percentage of my time is devoted to correcting errors made by Point of Sale agents, which is frustrating. I take a small amount of joy in noting them as POS agents.",
            "If you're gonna make a rule, ya gotta be smart enough to live with it.",
            "> My supervisor stated that he had never heard the term ante meridiem before.\n\nI remember an English teacher tryna ding me for something similar. Inexorable may be archaic, but I was not to be swayed in the absolute belief of its existence.\n\nIf I'd been older, I'da recommended her approach a dictionary.",
            "Back in college on a test, the question was what was the common name for HCl, I answered Hydrochloric acid and was marked wrong. I disputed the grade and explained my answer was correct because he had not included the impurity sign HCl+. It was only a few days prior he explained that in order to be called muriatic acid the impurity had to be present. I got the paper marked 100%",
            "I would love this shit.\n\n\"Did you bring the light amplification by stimulated emission of radiation pointer?\"",
            "The heck? Is your QA team a part of the League of Villainous Evildoers Maniacally United for Frightening Investments in Naughtiness?",
            "GG, WP.",
            "I used to be a quality manager at a chemical distributor supplying many different trades. I got a lot of questions from customers using their typical trade abbreviations. I loved to google them and find a couple of abbreviations, e.g., the name of a brass band in a US state (I'm European), and then write it to the customer and inform them that I couldn't really understand what they asked for. \nMy very kind sector manager at my present work has the initials PBA, which could be Professional Bad Ass, he likes that!",
            "Oh, JFC.\n\nSorry, Jesus Fucking Christ.",
            "I thought it was 'after morning' lmao.   \nand PM is 'pafter morning' obviously.",
            "I work in Aerospace, where this would be devastating to communication lmao.\n\n\"Our PWA SQAR, DSQR, and MCL rep reviewed the PPAP and eFAIR submittal\"\n\nTurns into:\n\n\"Our Pratt and Whitney America Supplier Quality Assurance Representative, Designated Supplier Quality Representative, and Material Conrol Laboratory representative reviewed the Production Part Approval Process and Enhanced First Article Inspection Report submittal.\"",
            "Laugh out loud",
            "Could get real fun with that...\n\n> Let's prep the pt for the CAB tomorrow 10am\n\n> The patient must be prepared for the Conary Artery Bypass Surgery for ten hundred hours central standard time, on Sunday, Feburary ninteeth, the year of our lord two thousand twenty three.",
            "You could add \"of the clock\" in between the number and the ante or post meridiem for extra petty points.",
            "To play devils advocate,  when I worked in a hospital we were also not allowed to use abbreviations because they meant different things to different divisions.  Potentially catastrophic. \n\nWe used military time to avoid this situation.",
            "TIL it's \"ante meridiem\" and not \"ante meridian\". Had to look it up.",
            "wait, you got a spelling error for a term they \"had never heard before\"? how do they know it is wrong if they don't understand what it is in the first place?",
            "This is the shit that happens when you put dumb people in charge of smart people. \"Stop doing things I don't understand. Wait, no, not like that!\" LOL",
            "I had a class once that had an instructor that was also told not to use any abbreviations and decided to maliciously comply like you. It was a basic electricity class and everywhere in the text, it spoke of \"AC current\", \"AC voltage\", \"DC current\", and \"DC voltage\" so he always spoke it aloud as \"alternating current current\", \"alternating current voltage\", \"direct current current\", and \"direct current voltage\". It was a fun class.",
            "I would love that rule or something in between! We have far too many abbreviations in my company.\n\nHowever, it does not beat the Danish railways where my husband got a book, circa 2 centimeter thick, with abbreviations. You could date an abbreviation on the number of letters, two were old, five were young.",
            "That rule was implemented at a job I was at 'bout lotsa years ago.\n\nWe were allowed to use portable apps, so I made scripts to extend our shorthand.\n\nEach password change would become a blow-by-blow of the official process, each acces request an epic tale of inquiery and discovery, each closed account a harrowing tale of emotional anguish at parting with one of our beloved collegues.\n\nThat made me supervisor, strangely enough. I was trying to MC.",
            "Worked in a sales department that used the W/O to mean: with out. And week of.  And work order.\n\nSo you could have W/O # for x W/O rails due W/O whenever.",
            "I may actually start saying ‘ante meridian’ in day to day convo. See how long before somebody wonder’s what I’m saying 😂",
            "Anyone (AO) who has been lurking around these narrative subreddits (NSR) for a while will know exactly how annoying people can get with their shorthand notation (SHN). SHN in these NSRs were out of control (OOC). Thankfully, the NSR community (NSRC) started to give AO shit about their overuse of SHN and the NSRs have gotten more readable.",
            "Was charged with developing a list of approved abbreviations for a hospital. Enlisted the help of a surgeon with a sense of humor. Hilarity ensued: FLK: funny looking kid. GOK: god only knows.FTD: fixing to die.DRT:dead right there. \nThe bosses were irritated…",
            "“I am ignorant therefore you lose points”.",
            "I was told to do similarly once.  Remember that numbers are abbreviations too.\n\nIt's not 2/18/23, it's \"the eighteenth of February of the year two thousand twenty three\".",
            "\"ASAP (who doesn't know this?), etc (come on now)\"\n\nI don't think you know your abbreviations. ASAP is 'As Soon As Possible',  etc is 'etcetera'.. this is probably why that directive was instilled.\n/s",
            "I had a boss like that, and she didn’t want any abbreviations (or Acronyms) either, even though they were industry specific.  She would tell me to “ know your audience.” Which for the most part was just her getting shift briefings.  But she’s the boss… so I obeyed.  She put an end to that order after I started writing ‘Post Meridiem” and “Anti Meridiem” after the times, because she also insisted that I not use Military times.  She was a flake and lasted a little over 8 months before stepping down and moving on.\n\n*Edit for clarification and spelling",
            "Outstanding way to let you know they’re very, very ignorant.",
            "I’ve thought it was ante meridian for decades.",
            "When I was a medical student, I wrote a note on a patient that included shorthand which was common in another hospital we had worked at. My surgery attending read the note and asked me what it meant asks I explained it to him. He looked at our entire group and yells, \"U N A!  U N A!\"\nWe were all kinda confused. \"Use No Abbreviations!\"",
            "This reminded me of a a college professor I had. For reasons only she knew, she required our papers (mostly short 2-3 page ones) to have a minimum word count. In an upper division History class!  What are we, 12?  We were there because we thought 20th Century US Social History sounded interesting. (It wasn’t)\n\nIt wasn’t a problem for most of us, but one classmate thought the rule was particularly stupid (it was).  So in one paper, every time she referenced the 32nd US President, instead of calling him FDR or President Roosevelt (or simply Roosevelt), called him ‘United States President Franklin Delano Roosevelt’.  At least a dozen times. In about 2 1/2 pages. \n\nI don’t think the professor grasped the contempt behind my classmate’s actions.",
            "Now, see if your software has a spot where you can set up for these abbreviations to automatically spell out the full word.  At my job there's a couple of things I occasionally have to send out to people not in the business, who wouldn't know what the abbreviations and acronyms we use mean. I've set Word and outlook up so that when I use one of those abbreviations, it'll just automatically spell the whole thing out.  Handy for chunks of reused text, too - I have A1, B1 and C1 set so when I type them, they insert a big chunk of text I always use for group A/B/C. It's all very handy.  (It's [Quick Parts](https://www.makeuseof.com/use-microsoft-word-quick-parts-insert-frequent-text/) and auto text in word and outlook, for anyone interested).",
            "Now, let's do recursive acronyms!\n\n- VISA = VISA International Sales Association = ...\n\n- GNU = GNU's Not Unix = ...",
            "When in doubt, throw some Latin at 'em\n\nYou know they don't know that i.e. means id est and what not.",
            "I was also once told not to use abbreviations in my reports. \n\nThen four bosses met trying to figure out what a zoning improvement plan code was.   They eventually gave up and called me to ask,  and then said I could use ZIP code,  but no other abbreviations.   \n\nOnly the ones they can't figure out. 😅",
            "The \"ante meridiem\" made me laugh quite hard. Soon as I read the \"10am\" but, I was just like oh no, they're gonna spell that shit out 🤣🤣",
            "\"etc\" is an abbreviation\n\n\"am\" and \"asap\", like fbi or usa, are acronyms\n\nLuckily the supervisor was too stupid to think of that in the moment otherwise they could've easily lit your ass up were they so inclined to do",
            "Glad they stopped giving you Fliegerabwehrkanone about it.",
            "Every link should read world wide web dot...",
            "You should date every script with anno domini or common era.",
            "Just wait till you have to do something with Lasers! As, guess what, that’s an acronym too XD",
            "I love this \"what did I spell wrong\" \"well I never heard of this term before so instead of googling it, I just assumed it was spelled wrong\"\n\nAlso scoring every piece of work you do like you're in school seems insane.",
            "For those of us with military backgrounds... imagine this in use. Would never get paperwork in on time, if at all.",
            "Your supervisor’s stupidity resulted in you getting a lower score. Seems fair. \n\nSo, that little embarrassment on your supervisor’s part (and, apparently, he has no access to the internet or even a dictionary to look things up) didn’t make the company lift the “no abbreviations whatsoever” rule?",
            "In college a technical writing class gave us the assignment to write a user manual for something we owned. I was a 1st year transfer from community college electronics service to a four-year liberal arts college. Some of the items I had previously used in electronics came from overseas with manuals in broken English. I chose to write the manual for a tool used during calibration of magnetic recording devices (tape decks) used in music studios. \n\nI allowed a classmate (3rd-year) to do a quick proofread and she brought it back full of red marks and comments. I had the foresight to write out all the tech-talk acronyms and abbreviations but still, she started with my first sentence, “The TDK (something-something) is a precision instrument used for the calibration of. . .”\n\nShe went in on my word choice, “What do you mean instrument? Does it play music?” Trust me, it got worse from there. What I learned in college is that regardless of (perceived) rank, QA and proofreaders are like the referee given a brand new whistle. Fouls and infractions aren’t their motivators.  They can’t assure the whistle works (or that they do) unless they blow.",
            "Huh, I always thought it was antemeridian not Ante Meridiem. The more you know.",
            "As soon as I read the title I was hoping for “ante/post meridiem”",
            "I sure hope your line of work doesn’t have any [recursive acronyms.](https://en.m.wikipedia.org/wiki/Recursive_acronym)",
            "I mean, you could have meant 10 amplitude modulation. It would be chaos.",
            "So, did you also use They Are instead of They're? Because that would be petty to the max.\nAlthough using the long form of AM is also a massive fuck you to management",
            "If you're using Epic, maybe set up Smart Phrases so that you can still use your normal contractions, but place a period in front of them so that Epic automatically changes the text to the non-abbreviated format?  Best of both worlds since you get to use your contractions and they get to deal with all the long-ass words they want!",
            "I was at a writing workshop at a convention when one of the workshop leaders became enraged at my use of the word \"variegated.\" He said if he'd seen this word as an editor he would have thrown my story across the room, because this word does not exist. I assured him it very much does.",
            "Even if he hasn't heard it before, how hard is it to guess?",
            "No abbreviations at all? FFS.",
            "\"I've never heard the term before\"\n\n\nFriend, have you heard of Google?!",
            "I work in insurance as an underwriter assistant and the amount of abbreviations we use is insane. We have common ones but also ones I call \"generational knowledge\" which are abbreviations passed down from training class to training class and not written down anywhere. I can't imagine having to type everything out long form.",
            "I had always thought it was ante meridian (as in prime meridian).\n\nCompletely non sarcastic thanks for the Latin lesson (ante meridiem - \"before midday\")",
            "Nice. Did your supervisor get thier proof reading score marked down?",
            "Oh for unlawful carnal knowledge sake. That was very well done.",
            "If one can get bounced out of there for spelling mistakes, I now now know it's a career path I need not attempt.",
            "I had the same directive come down from on high. So my next report included the phrases wireless fidelity and Avtomat Kalashnikova 1947.",
            "Re \"short hand\" -- properly written as one word, no actual \"shorthand\" was being used. The manager thus didn't know what he was talking about in a whole additional way.",
            "Should have used military time and then they'd ask why you wrote 1000.",
            "LPT: set up an autocorrect that changes abbreviations you type to the long form",
            "In the Royal Navy, the acronym used on the day of the ship sailing was HOOTRODCUDCASDAH. \"Hands out of the Rig of the Day clear off the upper deck. Close all screen doors and hatches.\"",
            "Hell, one of the first things we were taught in Nursing School were common medical abbreviations. There's tons of them!",
            "I like the term TWAIN which stands for Thing Without An Interesting Name.\n\nAlso TLA - Three Letter Acronym \nAnd ETLA - Extended Three Letter Acronym",
            "Reminded me of the movie Johnny Dangerously, the “priest” is walking with him in prison and among other things says\n“Priest:\nPost meridian. Ante-meridian. Uncle Meridian. All the little meridians.”",
            "Omg this is so funny!!\n\nReminds me of my boss telling me about the hiring center our place uses (we don't have a choice...) and they threw out a guys resume because it had made up words on it... that word? HVAC. Hiring for a repair shop btw.",
            "What?\n\nDid not he get the memorandum?",
            "TIL that AM means *ante meridiem*. I’ve gone all three decades of my life thinking AM meant *at morning* and PM meant *past morning* and never bothered to look up the actual meaning.",
            "Last night, I thought about A.M. & P.M. and what they stood for.   I knew P.M. but wasn't sure of the A in A.M.  It was a very random thought that I hadn't given any thought to before.  But I did last night.  And then I come upon this post.\n\nI'm scared.",
            "Most people know etc. is short for et cetera. However, et cetera is itself a shortening of “and others especially of the same kind.”  Go get ‘em!\n\nhttps://www.merriam-webster.com/dictionary/etcetera#word-history"
        ]
    },
    {
        "post_id": "cdf593",
        "author": "PipsqueakPilot",
        "title": "Sexually harass a general and demand a date",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cdf593/sexually_harass_a_general_and_demand_a_date/",
        "score": 26724,
        "num_comments": 971,
        "created_utc": 1563181583.0,
        "selftext": "When I was commissioned into the Air Force the officer who conducted the ceremony was a female 3-Star General. She looked like your typical short, fit, friendly middle aged soccer mom (Relevant to the story!). Extremely nice and personable, and an alumna of my university! At breakfast beforehand we were sharing a table, and she and my dad (A Lt Col at the time) we're talking. The general told a story of when she first showed up to a new base for her first posting as 3-Star. While running on the track a guy comes up and starts to run along side, asking if she had just got there, etc. It quickly becomes very obvious he's hitting on her, so she turns him down and mentions she has a husband.\n\n&#x200B;\n\nHe is not deterred, and keeps on hitting on her. The man goes right on talking about how in shape she is, how good looking she is, how they should get together, etc. Also asking questions like, \"Well is your husband at the base yet?\"... \"Are you staying by yourself in the TLF?\" TLF being a fancy sort of hotel. He thinks she's a spouse, and figures she showed up to get the home in order before her husband arrives. He really wants to 'hang out', preferably at her hotel room. Nor will he leave her alone until she agrees to a date. Finally after about fifteen minutes of him refusing to stop badgering her she relents and agrees to meet up with him again. \"Fine- I'll free up some time and we can talk. What's your name and number?\"\n\n&#x200B;\n\nThe harasser gives her his name and phone number. He's a Staff Sergeant many, many rungs down in the organization she's now Vice Commander of. Later that day he was ordered to report to her office, in service dress, at 0730 the next morning. Along with his supervisor, his First Sergeant, and his Commander. So basically his boss, his other boss, and his bosses bosses boss. She didn't say how the meeting went, but I doubt he enjoyed his date.",
        "permalink": "/r/MaliciousCompliance/comments/cdf593/sexually_harass_a_general_and_demand_a_date/",
        "comments": [
            "I would've loved to be there just to see his face 😂😂😂",
            "This is the best Undercover Boss episode ideas ever.",
            ">she turns him down and mentions she has a husband.\nHe is not deterred, and keeps on hitting on her.\n\nGross. I don't understand people like this, where were your parents?!?",
            "It’s too bad all sexual harassers don’t have the same experience.",
            "> TLF being a fancy sort of hotel\n\nEhh... maybe if you're a 3-star. TLF is more like a meh hotel in a safe neighborhood.",
            "Well, he got fucked. So... win?",
            "That Staff Sargent is a double idiot because when a new 3star hits base everyone should already know what they look like. Unless this is a thing only Marines do.\n\nEdit had to make a word worse",
            "Being enlisted myself, I can guarantee that no matter what this staff sergeant accomplishes, this 3 star debacle will be the highlight of his career and that story will be told a disrespectful amount of time over beers.",
            "Yeah. We all look the same in gym clothes, no matter how high up we are in the hierarchy.",
            "A very similar thing happened at a military base I used to work on as a civilian. The lady in charge was an Army COL, and about a week after she arrived she and her family were in a local restaurant / bar sort of thing and two marines tried to pick her up as she got drinks for her table. They went on and on about how important they were because they were NCOs. I don't know how it turned out, but I bet in the official change of command ceremony later on they might have had a bit of regret.   \n\n\nSimilarly, I was in the lunch hall and someone saw her walk by (in uniform) and one guy asked his friend \"Who's the bird?\" I was new to working with the military and was surprised an American was using the British slang term for a lady. (he wasn't)",
            "Since adultry is prohibited in UCMJ, can the Staff Sergeant be reprimanded for persisting after knowing she is married?",
            "When your boss is asked to show up with you , you know your in trouble. When his boss is also asked you know you need a lawyer. When his boss is also asked , you need witness protection LOL",
            "Jesus Christ. Imagine fucking up THAT BAD that your command team as to be present for the shitstorm.",
            "*Morgan Freeman's voice:* It was at this moment he knew he fucked up",
            "SSG was hoping to get laid, instead he got fucked.",
            "I'm going to guess the SSgt probably didn't get that STEP promonition to Tech.\n\n&#x200B;\n\nWhen I was at Malmstrom the Commissary was packed on Saturday; especially paydays, you know.  Lot of times the meat rack would be almost picked cleaned by 3 p.m.  \n\nOne Saturday someone in civies rang the buzzer at the service window about 3 p.m. in the meat market.  Butcher answered and man in civies told him there were no steaks left and could he bring some out.  Butcher told he should of gotten there sooner because they don't stock anything after One and slammed the window in the man's face.\n\nButcher didn't see the radio in the man's hands.  Nor did he notice he had just slammed the window on the new Wing Commander.  After that day there was almost live catttle in the cooler on Saturdays.  Never heard what happened to the butcher.",
            "I heard stories of women who get approached by men and they shared how uneasy they feel when they get approached.\n\nThen there were comments about how being approached is fine, because how else someone who is interested in you will know if they have a chance. BUT, here comes so many caveats,\n\n1. They should approach in a respectful manner.\n2. They should respect the other person's right to say no, and retreat if indicated that way. (Which was not the case here)\n\nNow, if someones approaches someone adhering to above two points, still if I put myself in women's shoes, I will be annoyed. Because it is tiring being approached so many times, and denying so many guys. It gets tiring and annoying. (Just like we get annoyed when at some restaurants, those managers won't stop asking 'how is the food?', despite asking it very politely.)\n\nSo, best one can expect is approach, but politely. Women : it's annoying, but that's the best way out there.\n\n(I was asking for opinions, that's why wrote so much)",
            "\"So... that's a *no*?\"",
            "That's not what we would call \"making a good impression\".  Serves him right.",
            "We need more Generals like her in the Air Force.",
            "You get an upvote just for using alumna.",
            "This needs to go in r/militarystories.",
            "TLDR: Air Force General Samantha Carter of Stargate command gets hit on by Sargent nobody and he is now cleaning PortoPotties at the Ancient Antarctic Base.  #SG1",
            "Better luck getting struck by lightning",
            "scariest principal’s office encounter ever",
            "His chain of command probably couldn't believe how bad he fucked up.",
            "Knowing she was married, he should have put the brakes on right then.  You absolutely do not do that in the military.  That can get you busted in a heartbeat.  He shouldn't have kept trying under any circumstances,  but being military, that was just beyond stupid on his part.",
            "Did she ask to see him more?",
            "Air Force doesnt usually take these things lightly. He most likely lost a rank or two if he didnt get kicked out.",
            "r/MilitaryStories would love tales like this one.",
            "This sounds like it could be in a movie.",
            "There aren't enough \"at'a boys\" in the history of existence to undo this level of \"aww shit\"",
            "Ha, I have some good stories of self important enlisted not using their brains before acting when interacting with someone in Civilian clothes that just happens to also be an Officer. Some of them even happened to me.\n\n&#x200B;\n\nNot as good as this story though. I guess I am not good looking enough for any wayward female SSgt's to hit on...",
            "The chances of a 3 star being a vice commander at a base is slim to none. Most base commanders are Col. Or 1 Star. Always depends I guess.",
            "I went through some serious selection (think weeding out) programs in the Army, as did everyone in this particular army unit. A guy in my squad had accidentally become a legend when a few years prior he had picked up a girl at a bar a week before this selection program was to start. They get to her house, do the deed, and fall asleep. He was a lot more sober the next morning, and sees boots in the closet. He asks, she tells him her husband is an instructor.....in the program he is waiting to start. He demands she drive him back to base immediately. \n\nAs they leave her neighborhood, they pass her husband, who sees him in the car. He follows all the way to the base. Military Police get involved when a heated argument erupts at the base gate. The leadership of the program/school get involved. \n\nBecause he didn’t knowingly do it, no official repercussions. But for the next four weeks, every time they were getting punished by that instructor, everyone would yell “Thanks Johnson!” *\n\n*names changed to protect the innocent",
            ">Later that day he was ordered to report to her office, in service dress, at 0730 the next morning. Along with his supervisor, his First Sergeant, and his Commander. So basically his boss, his other boss, and his bosses bosses boss.\n\n\"Legend says that to this day you can still hear his screams for mercy...\"",
            "\"Because that's what badass officers do.\"\n\nAlso, it's not \"before hand\", it's \"beforehand\"",
            "This. Made. My. Day. 👌🤣",
            "Not my story... I used to work at Newport News Shipbuilding.  The wife of one of the big muckity mucks used to drop her husband off in the morning.  Since it was so early she would just wear her nightgown.  One morning, after dropping him off, she got pulled over for a minor infraction.  When the cop saw how she was dressed, he went out of his way to make her get out of her car and forced her to stand by the side of the road (just to bully her as some cops like to do).  She was very embarrassed as tons of cars were going up this road... third shift just let out.  From what I was told she never once mentioned who her husband was.  After embarrassing her enough, the officer finally let her get back in her car and let her leave.  Once home she call her husband... who called either the chief of police or the mayor (it wasn't made clear).  Regardless, it evidently was that officers last day with the Newport News Police Department.",
            "What was the punishment?!!?",
            "r/prorevenge",
            "Oh, to be a fly on the wall of that office when the dude and all his bosses showed up.  😂",
            "High ranking officers carry themselves in a specific way. I believe this story happened cause a SSG even tried to hit on my specialist girlfriend when they were both in uniform; I'm saying this dude was stupid af",
            "This is the best shit ever 😂 I can just picture his face in that meeting, at parade rest. Shit I bet his SOUL was at parade rest 😂😂😂",
            "So, all kinds of shenanigans happen on/near base. I worked for a military contractor for a bit and I have a couple of wild stories. Was support for them.  This doesn't surprise me one bit tbh.",
            "> She didn't say how the meeting went\n\nSo she's a master storyteller then. Knowing how to tell a story involves knowing when to end it.",
            "Yessssss",
            "Are you kidding me? That guy just has the best story to tell for the rest of his career.",
            "Well that's because they have to follow a chain of command. She officially can't reprimand him directly. He's not her guy. She is going to reprimand her junior, or his commanding officer.... Following the chain of command... Until it reaches that guy. That's why everyone was called.",
            "He got a date, uh...",
            "Thank you for this story that’s fucking hilarious",
            "Man I would love to know who this 3 star was.",
            "One of my favorite MCs EVER! 💋So awesome!!",
            "That’s amazing! I have zero doubt that staff became a senior airmen again real quick. Or got a nice LOR signed by a 3 star that will follow him around for a good long while.",
            "I bet he doubled-down:  \n\n\n\"But is there somewhere we can be alone later?\"",
            "Man this is a blue balls story. I need to know how destroyed he got",
            "She should have made him and all the bosses show up, come into her office, and then after 5 minutes dismiss them all and never follow up. The dude would just worry about it for a long time. Myself as somebody that would prefer a definitive punishment, this would have been way worse. Plus his bosses asking him what that was all about. \"Hello again, Sgt Whatever\", wait 5 minutes while they stand there and ignoring them, \"Dismissed.\"\n\nAlso, why hit on somebody near work at all. I don't even look at women in other cars on my way to/from work because they might be coworkers. Fucking dumb.",
            "I love this military justice and how she handled it is so savage, in a good way.  Okay weirdo name and number please...I got you fam",
            "The legends say he's *still* peeling potatoes...",
            "You know it gets real when the bosses bosses boss shows up man I wouldn't want to be him.",
            "Holy shit... I can't imagine how that went as a current SSGT in the AF. Damn haha",
            "Lt. Gen. aren't dumb! Glad she stuck it to him in an obviously humiliating way.",
            "This makes me soooooo happy.",
            "The Chad with this one was total and oblivious.   \nHe probably said, \"So, after this whatchoo doin'?\"",
            "Susan Jane Helms?\n\n\nThere are 9 women who have made lieutenant general in the Air Force. She is the most attractive of them based on their official photos. Which can be deceptive.",
            "In our universe, Carol Danvers stays on Earth in the Air Force.",
            "Serves him right. His unabashed persistence aside, dude is a scumbag who doesn't mind being a home wrecker. I've met too many guys/girls like this who were under the impression that spouses of deployed servicemembers were fair game (and many spouses were indeed geographic bachelors/bachelorettes). Lastly, you can't be too careful on base, you never know who you're talking to. When in doubt, just assume they outrank you and keep it professional. Adultery is punishable by the UCMJ and, though it might be attempted adultery, he could have definitely been reprimanded for misconduct or harassment. It probably resulted in a slap on the wrist and a good dose of humiliation, but it wouldn't surprise me if he was knocked down a peg or two.",
            "Seems like a really indirect sideways manner of handling conflict for someone who eventually became a literal military general.",
            "You mean he was a Staff Sergeant when he *entered.* \nI'm guessing he wasn't when he left.",
            "Can you please xpost to r/Army",
            "I understand what you’re saying but sexual harassment is not solely a work related term. Harassing someone in a sexual manner occurs in all avenues of life.",
            "r/instantkarma",
            "[deleted]",
            "Upon completion of the meeting, the 1st Sgt promptly took him back to the squadron and severed his testicles with his knife hand.",
            "Not only is she a fucking 3 star, he's enlisted and trying to fraternize, damn lol",
            "I wonder if he was still standing at attention for her",
            "Staff Sergeant Jodie, reporting as ordered, ma'am.",
            "A m a z i n g",
            "Boss's*\n\nIt's possessive, not plural.",
            "That is amazing. Love when a harassing person gets put in their place. And how does this guy not pay enough attention to know what the new general looks like?",
            "Yikes!",
            "How do you not know who your 3 star boss is?",
            "You're talking about General Janet Wolfenbarger and I claim my 5 pounds.\n\nhttps://en.wikipedia.org/wiki/Janet_C._Wolfenbarger",
            "I bet that SSG was sweating their balls off once they walked into that room and saw them, lol. We once had our division commander walk into our operations office. Let me tell you, we all jumped to attention so fast I would've been surprised if anyone even saw us leave our chairs. Apparently our 1SG and him were good ol' pals, because in like a minute, the CG was sitting on the couch all relaxed and they sounded like they we're having a good time laughing and being super loud.",
            "We've just been read the beginning of the Top Gun remake.",
            "LMAO at TLF being considered a \"fancy hotel\"",
            "Just hearing all the people that had to be in the meeting with him triggered my anxiety. The military is just a stress-diarrhea on a weekly basis.",
            "I read this whilst listening to Barbie girl.\n10/10 do suggest.",
            "I love military storys when they show up here there always fun to read",
            "Only thing that would have made it better was if her husband was in the office too",
            "*any marginally attractive woman higher than E-4*\n\n“Hehe, joke about sucking dick, hehe”",
            "LMFAO 🤣🤣🤣",
            "Not Grosso was it?",
            "SHARP!",
            "Am I the only one who thinks she should have maybe introduced herself or mentioned who she was before it got to the creepy stage?\n\nNot standing up for the guy, but at the same time none of this world have happened if she said \"My husband and I just moved here. I'm General Xxx, nice to meet you\"",
            "Plot twist, they netflix'd and chilled in her office",
            "Justice.",
            "My brother just joined the Air Force. One of the FIRST things they gave him was a pamphlet that included a piece on sexual harassment. Not only is this dude a scumbag but also can’t read apparently",
            "This is by far my favourite story on Reddit.",
            "No words can describe how disgustingly destructive that was\n\n&#x200B;\n\nSlow clap general....slow clap",
            "Nice"
        ]
    },
    {
        "post_id": "jdj9qp",
        "author": "procrastinator3000v2",
        "title": "Oh, I *must* paint my garage? Sure thing!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jdj9qp/oh_i_must_paint_my_garage_sure_thing/",
        "score": 26699,
        "num_comments": 1340,
        "created_utc": 1603038574.0,
        "selftext": "A friend of mine lived in a pretty big neighborhood with a pretty strict HOA. He was the first house at the bottom of the hill that you saw when you drive in. He asked and was allowed to add a garage on to his house and did so, siding it with cedar planks. It looked great. His HOA disagreed and told him the by laws state all exposed walls must be painted. He tried to appeal but was shot down unanimously. So he checked the by laws further and found that while it was stated that all exposed walls must be painted, there was absolutely no mention of any color restrictions.\n\nBy the time he was done each plank was a different primary color and there was nothing they could do about it. They were furious with him and he laughed his ass off.\n\nEdit: this blew up. I didn't think it was all that interesting, just a story of a guy I used to know. To answer a few questions/comments:\n\nThis was back in the early 90s. The HOA was created years after the neighborhood had been established. Maybe they assumed no one would use anything but tasteful colors. IDK and don't care. I also don't care if you believe the story or not.\n\nUsing a clear coat/wood-like finish would defeat the purpose of his giant fuck you to the whole neighborhood. I said he was a friend but that's not quite true. He was some guy I knew through a boyfriend and hung around a lot. He took great joy in being an equal opportunity dick.",
        "permalink": "/r/MaliciousCompliance/comments/jdj9qp/oh_i_must_paint_my_garage_sure_thing/",
        "comments": [
            "Reminds me of this lady and her malicious compliance over a fence. I like this video because the neighbor is especially angry about it \n\nhttps://youtu.be/4FriO91on3I",
            "I think a colorful, fun wall like that is the perfect response to an unco-operative HOA.  I hope he thoroughly enjoys his Wall of Many Colours.",
            "[deleted]",
            "[deleted]",
            "Sounds like what my parents did to their HOA. My dad has his Ham Radio license and wanted a large antenna at the house, so decided to build one. He and my mom looked at the HOA by laws and they were written in a way that said he could build it and as long as it was inspected and approved by local zoning before someone complained, he was good to go. So, dad planned everything out for a Friday afternoon. My uncle came over and helped dad build an 80 ft. antenna next to the house. The zoning inspector got there around 4pm, inspected everything, called it good, and signed off on it. That Monday, their neighbor complained and the HOA contacted my parents. My mom (who is a lawyer), pulled out the by laws and the signed paperwork from the zoning inspector and basically told them to suck it. Nothing the HOA could do since my parents had followed all the by laws. They still have the antenna and it cracks me up.",
            "“My walls aren’t exposed, I’ve covered them with cedar planks.”",
            "\"Can I pretty please add a garage to my house, that I paid for, so I can keep snow and bird shit and pollen off my car and have a place to store tools? By your leave, pretty please with sugar on top?\"  \n'Hmph. Well, if you must. I guess it's ok with us, since you asked nicely.'\n\nFuck HOAs and everything about them. Fuck the people that run them and fuck their parents for having them.",
            "Our HOA requires a $500.  deposit before you paint your house.  If they don’t like it they keep the deposit.  They also have 4 approved color options for the houses, you can’t match your side neighbors or neighbors across the street.  Sucks if you choose late your have no choice.  Yeah, we sold and are moving in a few weeks.",
            "It amazes me that a country that rants about freedom and individuality has HOA's that go against those ideas.",
            "Wow HOAs truly suck. I’ll be damned if I drop a couple hundred grand on a house to be told what I can and can’t do with it. Cedar is so beautiful.",
            "Sounds like a story for r/FuckHOA",
            "HOA’s board members are usually retired and they enjoy making life miserable. They will also pick on people\nThey don’t like .\n\nI was at a friends house late one night and my pickup was parked in the street . \n\nI left but I came early the next morning and parked in the street .\n\nSome busy body apparently saw it late at night then saw it the next day .\n\nHe was given a written warning via registered mail saying vehicles are not allowed to be parked In the street overnight and the next time he would be fined $150.00 every time it happned",
            "I'm picturing the likes of the [Equality House](https://www.google.com/search?q=equality+house&tbm=isch&ved=2ahUKEwiRjv-5377sAhUQQawKHXY7AzEQ2-cCegQIABAA&oq=equality+house&gs_lcp=CgNpbWcQAzIECCMQJzIECAAQQzICCAAyBggAEAUQHjIGCAAQBRAeMgYIABAFEB4yBAgAEBgyBAgAEBgyBAgAEBgyBAgAEBhQgRNYgRNgwBRoAHAAeACAAYUBiAGFAZIBAzAuMZgBAKABAaoBC2d3cy13aXotaW1nwAEB&sclient=img&ei=-IWMX5GyMZCCsQX29oyIAw&bih=937&biw=1920&safe=off) that's across from the WBC in Topeka, KS.",
            "Can he paint Jeff Goldblum in his Jurrasic Park pose?  That would be so cool.",
            "Is there purely an HOA edition subreddit of malicious compliance?",
            "The building permit fella told me several of my neighbors were quite upset about my new shed. Said they had anonymously phoned him and complained that morning. They had demanded that my shed be stopped! \n\nI had a lady on the right. And old man on my left. And a cemetery. (The cemetery residents only complained one night a year, so not them.)\n\nThe permit fella took my check, signed my paperwork, and said, ‘traffic cone orange is such a lovely color don’t you agree?’ \n\nI did agree!",
            "Depending on the exact wording of the bylaw I might have \"painted\" it in transparent weatherseal and sent them a copy of the receipt as proof. \n\nBut yeah, making them regret their arrogance works too.",
            "I never understood this. You *own* the house? Why is there an association telling you what to do with it?\n\nLand of the free my ass.",
            "Why would anyone buy a house in a HOA, you may aswell just rent, you don't even own your house really if you can't do what you want to it",
            "Reminds me of a cottage in UK. The local council insisted he repaint walls between the beams white or cream. He did, but found out the roof colour wasn’t specified.  It is corrugated metal, and has been dandelion yellow for years now.",
            "Americans are all about freedom then have these fucking wierd rules about where they live (only certain places I'm sure but still)",
            "I always upvote anything that ends with sticking it to an HOA. It's ridiculous that those associations are legal with how often they power trip over residents. Controlling NIMBY fucks",
            "I would've painted it the color of weathered cedar.",
            "Should have just clear coated it 🤣🤣",
            "I would’ve just put a clear coat on it and called it a day.",
            "I'm not from the USA, and I can't understand how people who love freedom and private property soo much, can have that home owners association thingy. I would throw hands to anybody that tries to tell me what do do with my own house.",
            "He would be grandfathered in under the old laws and they still would not be able to do anything.",
            "Great story. \n\nFuck HOAs.",
            "If you have a picture I would love to see it",
            "I would have “painted” it clear - minimal gloss, maybe a nice, weather protective top coat? I’d le the extra “paint” with the receipt and video for clarity.",
            "HOAs in England are just unheard of. I find them utterly appalling, I pay for my fucking house and within reason I will do what the fuck I want to it.",
            "**HOA = 100% dealbreaker.**",
            "I fucking hate HOA's.",
            "Do not ever by a house that is a part of an HOA. You don't even fully own your own house at that point.",
            "r/fuckHOA",
            "This isn’t a troll comment, but i don’t understand how a country which is built on the idea of personal freedom would allow such a thing like a hoa to exist",
            "What even are HOAs and why would anyone sign up to one out of choice? I live in Scotland and the idea of HOAs is completely foreign to me, they just sound like a bunch of curtain twitchers with a membership card",
            "Wouldn't a clear coat have satisfied the letter of the law just as well?",
            "he could have painted a clear coat and been within the regulations",
            "You should have meticulously painted wood grain over the cedar planks.",
            "I will never live anywhere with an hoa",
            "If this isnt posted in r/fuckHOA, it should be",
            "There was a guy in Atlanta fighting his HOA over approved colors. They held firm, so he painted his house two of the approved colors, purple with polka dots.",
            "Hoa's sound like the most useless pieces of shit ever invented. I honestly don't understand how they even exist.",
            "Never understood this HOA stuff? I thought America was 'land of the free'? So why are neighbours allowed to dictate what colour your garage is?",
            "I've seen quite a few hoa posts here, and as a non American, they barely make sense to me. Can someone explain to me how this works? Like, you paid for the property, how does the hoa get to dictate what you do with it? I get it if it's shared property, I'd get it if it was the town council, but hoa? How is that legal?",
            "You know he could had just painted it with clear paint lol.",
            "LOVE IT! I hate HOAs and would NEVER move into one. I admit on one hand I can see where they can do some good. But when they can dictate house color, plant/flower species, etc. ... that's just too much BS.\n\nThat's when you've got to read the guidelines and follow them, to the letter. I see malicious compliance coming into play, A LOT! lol",
            "Reminds me of a friend about twenty years ago who was putting in a fence to separate him from a particularly shitty neighbour. \n\nHe found the line laid out by the surveyor to mark the property line cut - but the stakes not moved. \n\nSo he retied it. \n\nIt was cut again. \n\nHe retied it again and hung a sign that said ‘every cut is a colour’. \n\nIt wasn’t cut again. The fence was built fully on his property and before installing the fence boards each board was painted on one side only. \n\nHe chose purple and orange.",
            "Why do HOA even exist?",
            "Would a clear coat have counted?",
            "HOA is where all Karen’s go to die. Literally the worst organztions only filled with sad power hungry old people who need to find some way to bully people. They truly need to be outlawed.",
            "I'm just now learning about HOAs. Do all neighborhoods in the suburbs have them? Why the hell would anyone live in that kind of neighborhood? This kind of policing is something I'd physically fight someone over. It's so obnoxious.",
            "Serious question why buy a house in an HOA/deed-restricted community?\n\nI live in a non-HOA neighborhood and for the most part everyone keeps their lawns green and maintained/no cars parked on lawn/no loud music. \n\nEven if they did those sorts of things I feel like an HOA isn’t much of a deterrent. Taking possession of a house via a lien is exaggerated. You can’t fine Andy $50 for failure to mow his lawn and then take his entire fucking house if he refuses to pay.",
            "A [woman in London](https://duckduckgo.com/?q=kensington+striped+house) was refused permission to demolish and rebuild her house because of an objection by her neighbour so she painted it in red and white stripes to spite him.",
            "Personally I just would have given it a few coats of clear.",
            "he also could have used clear paint",
            "My stupid question: does it have to be entirely painted? Could a thin stripe of paint on each board count?",
            "I would have used cedar-colored paint and painted it to look like wood, but this is probably way more enraging. Good job.",
            "That’s so petty and childish and I would have done the exact same thing.",
            "Imagine working your ass off to own your own home only to have someone tell you what you can do in it.",
            "How are HOAs not a deal breaker for more people when looking to buy a home?",
            "Should of painted it with clear sealing paint. Gotta protect that beautiful wood grain with the awesomeness of clear paint.\n\nKeep the receipt, something tells me they won't believe or understand it exists lol",
            "Literally no upside to a HOA. If I want to burn my grass every couple weeks and my neighbor wants to tie a cow up to his clothes line, we should be free to.",
            "Fuck HOA. So glad they’re not a thing here in the U.K.",
            "Love hearing people sticking it to an HOA. Those groups are horrible.",
            "I find this hard to believe mainly because why would a “strict HOA” not have rules about house color?",
            "I only recently heard about HOA when I was in the states from a friend. They sound fucking awful and I still don’t understand how they are legal",
            "I just saw a video on youtube where a lady colored her fence because her neighbors disliked that her fence was too tall",
            "There are actually some stains that say \"PAINT\" on the label!",
            "If done well it can look very cool \n\nhttps://i.imgur.com/4WfAxvl.jpg",
            "He could have just varnished the planks.  \nThis seems a little over-reaching though and an example of why I avoid those places like the plague.",
            "Any potential home owners or renters, if you see **HOA** anywhere on the documents, find someplace else.",
            "/r/fuckhoa",
            "I would have just painted on some clear coat..",
            "My first ever experience with an HOA was when I was at my JOB (storage unit manager) and some guy comes walking in and is like \"I'm the HOA manager and I bet you know we didn't want this place built\".\n\nGee, thanks for telling me you want me unemployed, scumbag. \n\nOne of the guys I rented to ended up having lots of shit to say about the HOA 😂😂",
            "Ever seen the Potsdam Toilet Gardens? https://www.adirondackdailyenterprise.com/news/local-news/2020/07/potsdam-again-pushing-for-removal-of-mans-toilet-gardens/",
            "People on the board of Home Owners Associations can get fucked, lose everything and I'll feel nothing. Fuck those people",
            "That's funny, but it's not really true they can't do anything about it. The HOA can amend the by-laws at the next board meeting. They're hardly immutable.",
            "Omg we have a turquoise (blueish green) house on our block......just gotta say go left when you see it.  Its very tacky looking....even the trim....you get used to it.",
            "Couldn’t have just used a clear oil or varnish? I mean, I get where he’s coming from but still...",
            "My HOA was harping to paint the trim, so I tried. I asked them the colors I'm allowed and they didn't have them! If you're going to have me paint something, you better give me the paint requirements or I'll paint it how I choose. Ended up moving before I got the chance to paint.",
            "Does everyone here know that HOAs are just some ominous, code enforcement company that is person-less, right? Do you know that HOAs have to have a board staffed by people who own houses in the community of said HOA, right? That the people who run it are your neighbors, and they are generally pretty understanding and reasonable people, right? They also are supposed to listen to the community and act on behalf of the community. If you never show up to HOA meetings, nor write your board, then they are to assume that you agree to the covenants and how they are executed.   \nIf you don't like how your HOA is acting, then you should feel obligated to show up to meetings and talk with the board. Again, they are your neighbors and want to keep everyone happy. If they are an egregious board, like mine was, then you can run for a position on the board, like I did, and  if enough people with common thoughts run then you can overturn the bad egg, like my board did. Now we have a lot of community improvements coming.   \nSpeaking of, if you like community parks, common areas, decorative trees, and a gate and walls, then you like HOAs, because those don't happen without one.",
            "Was expecting clearcoat.",
            "HOAs are the WORST.",
            "Fuck all HOA",
            "HOA's are full of the worst people society has to offer. Old, grumpy, miserable garbage, that can't control their own lives so they harass people about stupid shit. \n\nIf you are reading this and thinking \"Hey! Thats not fair! My (insert person) is in an HOA and they don't suck.\" just know they are control freaks with too much free time.",
            "Wow, another silly, exclusively USA thing. As long as your home doesn't feature anything racist or otherwise bigoted, fine!",
            "I would've went with a clear coat...",
            "Fuck HOA's. Seriously. Good on him.",
            "I would have found some clear paint to paint the garage with.",
            "What about a clear coat?",
            "Why not just do a clear laquor like a deck coat.",
            "I don’t own a house. What happens if you don’t follow HOA regulations? They can’t kick you out of the neighborhood right? So how do they get compliance?",
            "Can someone please explain to me how HOA s work? Why are they binding? They seem fucking awful.",
            "I wonder if lacquering it and calling it \"clear paint\" would have worked as well?",
            "Where in the world are HOA's so restrictive? The U.S? I read so many crazy stories of ridiculous rules/laws enforced by the HOA.",
            "Random spray paint patterns would work to, extra malicious and just as compliant",
            "I would have got the paint matched to look exactly like the cedar",
            "I want her as a neighbor. She seems chill.",
            "I would have painted it cedar colored",
            "If there were no color restrictions... Couldn't he have just gone with a clear coat of some kind?\n\nOr, if he had the money, have an artist come in and paint the shingles with wood grain.",
            "Can't they just rewrite the rules and force him to repaint to whatever color they want?",
            "I had a friend, dead some 15 years now, who lived in Columbia, Maryland. (Anyone who knows Columbia, knows where this is going.) \n\nColumbia has five neighborhoods, each with their own neighborhood rules - I won't go deep into it, but suffice it to say that the Columbia Association had a *lot* of say and power when it comes to a person's home.\n\nOne of their rules required the front doors of owners' homes to be painted in \"neighborhood appropriate\" colors. My friend was having none of it, and every year she'd get the fine from the Association, and every year she'd write them the check, usually for a hundred bucks or so. She was never one to swear - I don't think she'd say 'shit' if she stepped in it - but that was one place where she had no reservations about saying \"fuck 'em.\" She never did paint that door, either.",
            "we could outlaw HOA's you know.",
            "Before you buy into an HOA neighborhood ask for a copy of their regulations. Then decide if you want buy there.",
            "This does bring a simile to my face 😈",
            "Paint it with clear coat next time.\n\nTransparent is a colour",
            "Whats an HOA?",
            "HOA’s are trash!",
            "Man, they ruined all that good wood...",
            "Doing the right thing, fuck that nurse.",
            "Please go post this on r/fuckhoa. They will love it!",
            "Everybody read Mr. Plumbeams house.",
            "Sure it’s making me SICK.",
            "Whats hoa? I always figured you could paint or not paint your property however you wanted",
            "My parents live in a historic district, which was expanded to include their house after they moved in. \n\nThe historic district council wanted them to fence in the propane tanks on their property. The fire marshal said that was against the fire code. \n\nItnwent back and forth until my parents presented the counsil with a statement of liability basically saying it absolved my parents and their insurance of liability resulting from the fence. The counil's lawyer's position from day one was \"we must follow the fire code\". \n\nMy plan to hire an artist to paint propane tanks on the fence because they do not regulate paint.",
            "HOAs can lick my shit-covered taint. What value do they add? If I want to do work on \\*my\\* property, why does anyone have the ability to tell me how that work should end up looking?",
            "There was a house near parkville Missouri that did the same thing. The city wanted to buy the land out from under them to expand a road. So as the city got closer and closer with the road, they decided to paint the house (poorly) alternating neon green and neon purple paint. It was a great finger to the city. Not sure what happened up to the end, but there is now a wide road there and that house is gone.",
            "Should've just painted it with clear coat if they didn't specify color",
            "The HOA wanted it painted and he painted it.\n\nWhat NOW is the problem?  Why is everyone angry?  He did as he was told.\n\nAt least our strata manager gets an independent in to do things for us.\n\nSo much simpler here in Western Australia.",
            "Sure it’s bofa",
            "I wonder if you could get away with painting it with clear paint.",
            "Probably could of painted with cedar varnish",
            "That's a perfect fuck you 👏🏿",
            "Stories like these are why I won't ever live in HOA land or a Strata run condo.\n\nI'm an adult and don't need permission for what type of doormat I get for my porch.",
            "HOA are the dumbest fucking thing",
            "As An artist, I would’ve painted it with a wood texture and make it as realistic as I possibly could.",
            "Serious question: could you cover them with translucent paint?",
            "I wonder what kind of sorry state your life has to be in to be someone who powertrips as a board member for a HOA. Some of the stupid rules I've heard are just nuts, and a lot of them seem to get off on strongarming people about things"
        ]
    },
    {
        "post_id": "w9o4at",
        "author": "rcam_tv",
        "title": "A Customer Was Upset I Didn't Give Her The Right Amount of Fish; She Was Right.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/w9o4at/a_customer_was_upset_i_didnt_give_her_the_right/",
        "score": 26669,
        "num_comments": 770,
        "created_utc": 1658951346.0,
        "selftext": "I used to work at a mom & pop store that sold clothes, farm supplies, animals and sporting goods. Anyway, since we sold sporting goods we also sold bait fish. Fisherman would frequently stop by our store to buy them to fish with and they were sold by the dozen. Usually, when I  scooped bait, I would give a few extra fish to my customers. I had one Russian lady come in to purchase bait fish, so just as I normally did, I scooped a net full of fish and started dumping them in the bag counting them individually, and added a few extra to the bag. The lady watched me do this but insisted that I did not give her the correct amount. I assured her that I not only gave her the dozen she paid for but I gave her a few extra. I literally just counted and have done this long enough that I was really good at eyeing when it was over a dozen. This lady just kept insisting that I didn't give her enough so I said, \" Okay, let's count together just to be sure.\"  \n\n\nSo I dump all the fish from the bag back into the net and we started counting together very slowly \"1....2...3...4...ect...\" We get to 12 and it's very clear there are several extra fish still in the net. I  look up at her and I was like \"Ohhh you were right, I didn't give you the right amount.\" I then proceeded to dump the remaining fish back into the tank right in front of her and gave her exactly the amount she paid for.\n\nUpdate: She ended up just looking bewildered when I handed the fish back to her and left. Really nothing more she could have done at that point but I did start applying this philosophy to the customers who bought crickets.",
        "permalink": "/r/MaliciousCompliance/comments/w9o4at/a_customer_was_upset_i_didnt_give_her_the_right/",
        "comments": [
            "Similar thing used to happen to me when I worked fast food. Sometimes customers would complain I didn’t fill their ice cream cup enough and insist I remake it with the right amount. Which i did. What they didn’t realise was the amount i was meant to give was fairly stingy and I always overfilled the cups \n\nSo would remake and weigh their ice cream and tell them they were right i gave the wrong amount before, had actually given them too much \n\nPetty as hell but im ok with it",
            "had a guy come into the drugstore i worked at and he was buying a bunch of random shit for the sake of coupons he had and some sales going on. he was a total jerk about everything i was ringing up, micromanaging me to death. when i started ringing up his billions of bottles of orange juice he threw a little fit about how the total should have been an EVEN number bc of the price of the orange juice. so i checked my work and realized i forgot to ring up one or two of them. raising the price of a rude cuponers total by their own admission was magnificent. a tiny victory that i still remember to this day.",
            "Dive shop I used to work with did something very similar on a regular basis.  For reference, scuba cylinders are typically pressurized to 3000PSI.  When we would fill them, we'd usually go a little over to say 3200PSI because as you jam air in, it can get warm and expand, so if you fill to 3200PSI, when it cools down, it'll be 3000PSI-ish.  But said cylinders could also be used for paintball.  So these old paintballer farts would come in to get their tanks refilled, and _demand_ they be filled to 3000PSI, and want to watch the process.  So... we filled them to exactly 3000PSI every time.  The folks who would drop a tank off in the a.m. and say \"When you get time, would love a fill, will stop by before you close\" and/or otherwise just trust us to get them filled would get a nice 3200-3300PSI fill.",
            "I thought the guy had miscounted and was worried he would get in trouble for giving me too many fish at a bait shop once.  He thanked me for being honest, told me he was the owner, and gave me 12 more fish.  I was afraid if I counted them that time that I would end up with 50 fish so I smiled and thanked him.",
            "I offered to give a customer the 60% off deal that was starting tomorrow rather than the BOGO free deal that was currently on.  They rudely informed me that Free was better than 60% off so I rang em up with the BOGO deal.",
            "I used to go to northern Minnesota on vacation every year with my family to go fishing. We'd usually get our bait from the resort, and they'd tack it onto the bill. \n\nOne time we were there they were out. Something about their supplier having issues, so the owner recommended we follow the shore down about two or three miles, there's a channel marked with buoys. Follow the channel and we'll come to a dock next to a gas station/mini mart. Was told they sell bait in there, and tell them that Emery sent us. \n\nWe go in with our little yellow minnow trap, tell the guy there that Emery sent us for some minnows because he was out, and we'd like two dozen please. Guy nodded, took the minnow bucket, and I swear to you he used the bucket to scoop what must have been a hundred minnows into it. Charged us $5 and away we went. \n\nOf course we shared the bounty when we got back with some of the other fishermen there. Wouldn't have been right not to.",
            "My grandmother would do this. She would buy groceries, then go home and weighed it again herself. If she overpaid, she'll go back to get her difference in money back. If she underpaid, she'll also go running after them to pay the difference. For her, it's a Buddhist thing, balancing karma and all that.",
            "We used to eyeball our fries because we knew the small medium and large sizes without putting them into the containers first. We lived for customers who complained about being short changed. We dump out the fries and measure them again with the right size cup. Inevitably the customer ended up with less fries.",
            "Did she ever say that it wasn't enough or just that it wasn't correct? It is entirely possible that's exactly what she wanted you to do, being in a foreign country everyone is told to play exactly by the rules.\n\nShe would hate for someone, however misguided she may think this idea is, to claim she stole some fish when she has a receipt for 12 fish but has 15.\n\nPeople traveling internationally are told to be a little bit paranoid about that especially when they think that there might be a reason to needlessly prosecute someone to be vindictive or punitive to other cultures",
            "Wow. I witnessed almost the same thing when I was younger. We had a 40 acre pond/lake that we kept stocked and would charge a couple bucks to fish for the day, a couple more if you wanted to rent a johnboat, and we sold bait and tackle in “the tackle house”. (Really popular on the weekends). In the spring each year and until it got too warm, we kept minnows in a minnow tank. A dozen minnows really doesn’t look like a dozen when they’re in a white styrofoam bucket so my dad taught me to always add one or two extra - which I always did (and so did he). I saw him get challenged on two occasions - both times he told the customer, “I’m sure there’s a dozen in there but if you want, we will recount and for every fish under a total of twelve I will give you a dollar but for every fish over twelve you have to give me a buck.”  One of the customers declined, the other one paid dad two bucks…",
            "Some people don't like when there is a mistake in a transaction that involves money, it may seem weird but that's how it is. I had the same reflex once when I went to a restaurant in Prague and the waitress gave me too much change. It was like 100 crowns, but she'd have been in trouble, not me, so...",
            "Honestly she may have thought she was gonna get charged for the extra fish, which is why she objected.",
            "I work at a company where we sell pallets of 50# bags, 50 bags per pallet, 2500# per. There’s a weight tolerance +/-1%. Customer sends list of bag weights of all 50 bags, bitching that 20 or so of them were under 50# (still within tolerance). Co-worker charged w handling tallies all the weights and discovers the bags were over, with a few over tolerance so customer actually got more than 2500#. Responds to customer, thank you, good catch. We can bill you for the extra weight you got - how’s that sound?",
            "I work in the deli department of a grocery store. I get some customers like this, but when they ask for an exact amount. The following actually happened a few weeks ago word for word.\n\nCustomer: \"Four chicken drumsticks please\"\n\nMe: \"Alright\" *grabs two at a time because it's quicker*\n\nCustomer: \"Excuse me, I asked for four drumsticks\"\n\nMe: \"I have four in the bag sir\"\n\nCustomer: \"Are you sure?\"\n\nMe: *Takes the drumsticks out and counting them one at a time. Comes up with exactly four*\n\nCustomer: \"Oh sorry\"\n\nMe: \"No problem\" :)\n\nIt doesn't happen often but I have fun with these exchanges.",
            "I used to have a bearded dragon as a class pet and would regularly get him crickets at the pet store. He didn’t eat a lot at a time, so I usually only got him two dozen each trip (I can’t seem to keep crickets alive even with orange cubes).\n\nI’d usually end up with half again as many as I asked for because they didn’t feel like counting but only charged me for 2 dozen. My beardie was happy. Unfortunately he died last winter. RIP Charizard.",
            "Had this happen once too. I'm a service manager at a tire and oil place but still end up doing pretty much every job there. I was ringing up a customer and they complained about the price being too high because the price they were quoted didn't include tax. Went through the whole bill with them and found out they weren't charged for valve stems for their tires.\n\nI apologized, excused myself, and confirmed with the tech that we did put new valve stems in it. I went back in and manually scanned in 4 valve stems at $3 a piece. \n\nAn important note otherwise it'll become an edit, we always go over the whole bill anyway, there's just a lot of vehicles that take specific service packs for the valve stems we don't carry so I don't bother checking when it doesn't ring up valve stems. In this case the customer was being a dick so I did my due diligence to make sure they got charged for exactly what they got",
            "This happened ALL THE TIME when I worked at a certain pet store with the crickets and the minnows. I loved putting back the extra ones that I knew I had in the bag, too.",
            "I had a woman that wanted to use her 15% off store stamp card with a large purchase. Fine. She had three. We can use one per purchase. She insisted on using 3 for 45% off. I can’t do that. So after hemming and hawing she says, well ring it up again and split it three ways. Use one card for each. \n\nOh, no problem at all. She never understood that it wasn’t saving her any over 15%. I had to stop a coworker who was still trying to tell her and the customer was just MEAN. oh, and I stapled all 3 cards to those receipts, cost her about $600 to fill them up. \n\nBest part was my friend who held the door for her said she was grumbling to her daughter that it was a lot more than it should have been.",
            "I used to work as a cashier and this store accepted ebt, but sometimes things got complicated if you tried to pay with ebt and then use bottle return slips. For those who domt know what bottle return slips are, they're little slips you get at can recycling machines that can be scanned at the register and exchanged for money. \n\nThe problem was, sometimes if you tried doing ebt and bottle returns and you do ebt first, the bottle returns wouldn't go through like you thought and things get weird. This dude walked up, and did exactly that. Good thing was, I knew the trick to fix it. But this dude literally yelled in my face as I was fixing it that it was wrong, I was wrong, and that he wants another cashier. At one point, I stopped trying to explain what I was doing and ignored him as I fixed the issue. He apologized after so it was okay, but I still didn't like him very much every time he got in my line.",
            "I work in a dispensary (legal weed dealer). Sometimes i will slip a customer an extra joint for free (if i’m in a good mood, i like their hoodie, they let me pet their dog, etc.)…\n\nEvery now and then someone will watch me like a hawk as i’m ringing them up (we have to document every ‘sale’ for legal purposes, but i will discount it to make it virtually free) and they’ll say something like “hey i only wanted 4 joints not 5” or “check your counting there bud”.\n\nLots of times it’s clear they are doing it to be honest/try not to get me in trouble, so i’ll do something like wink at them and make the “shhh” gesture. But if they are doing it to be a know-it-all or because they don’t trust the stoner who works in the weed store (been in the biz for a while, i can tell the difference by the tone/preceding interactions), then i’ll be like “oh sorry about that! Almost spaced and gave you a free joint let me get rid of that!”\n\nAnd then i watch their face as they ponder the concept of “playing it cool”",
            "Play stupid games, win stupid prizes",
            "I had same thing happen in hs as a grocery store bagger.  We had to count peoples bottle returns.   Lady brings in two paper bags of cans.  I counted them by shaking them out into the cart.  Been doing this for a while and i know in close to accurate but erring on the side of counting too many.  I give her the ticket and go back to stocking shelves since was early and not lot of customers.   After she is done shopping she complains to the checker that i just poured out the cans and she doesnt think i counted right.  So i go over and recount then in detail since only hers were in the cart. I go back to the checker tell the lady she was correct i counted wrong and let me adjust her slip.  She gets a shit eating grin on her face and so i cross out the total and write in the new one for 5 cans less thsn original.  Somehow that day was a little less shitty than most. :)",
            "If there was a language barrier (and no physical attitude) it sounds like she didn't understand your generosity or feared you'd charge her per fish.",
            "Imagine thinking that you can count fish better than the guy who counts fish every day.",
            "Wife owned a cafe, guy comes in with a coffee discount card from like five owners long gone and screamed obscenities at my wife for not giving him a free coffee from a business we'd never heard of.",
            "I wonder if this is a cultural thing. In my experience, rural stores tend to be fair because the community is usually small, especially in the south. I don't know Russian culture, but if she was from Moscow or St. Petersburg, I bet it's like NY where you have to look out for people trying to get rip you off. I have nothing against NY, but you know what I mean.",
            "As a bartender this happens to me. I'll free pour. They complain. I pour a measured amount and they have nothing else to say",
            "[deleted]",
            "I used to work at a prison in food service. We were serving cake. Whoever cut the cake didn't cut it right. This one prisoner got a bigger piece of cake because of that. Then he said, I want two pieces of cake. I whipped out my spatula, cut his piece of cake in half and handed him the two halves.",
            "I had this happen to me all the time in a stereo shop.\n\nIt's not worth the time to count out 18 little spade connectors from a bag of 1000, or measure out exactly 24ft of speaker cable from a 500ft spool. I know a handful of spades is about 25 connectors, I know my wingspan is 6ft2in and I that 4 wingspans is a bit over 24ft, so I just did it the quick and easy way and gave customers a bit extra.\n\nI lost track of how many times customers insisted I must be shorting them because I didn't count/measure, insist I do it in front of them, and then act smug when I cut off a free foot of cable or take back a half dozen free connectors.",
            "100% have done this exact thing to customers",
            "i did the same thing where I would ask for sea snails off the bottom of the tank and the girl put her boobs in the water",
            "I guess her mother never taught her to not look a gift fish in the mouth.",
            "some folks just can’t get out their own way",
            "Added value for the customer. A little extra to thank you for coming in and buying our products.  A baker's dozen is a form of this.",
            "This summer we were on vacation and stopped to fill up the car.  Went inside and clerk was on the phone and he looked at my big gulp and snacks and said merry Christmas and waved me out the door.  He didn’t want to stop his phone call…",
            "Any chance she was being polite and didn’t want you to mistakenly give extra?  Could be a culture thing. Not sure….",
            "I heard this same story but with business cards. A customer ordered business cards from a print shop. They ended up with too many, complained about it, the worker counted them and threw the extras in the trash.\n\nI like this story better. Business cards are custom, nobody else can use them, so throwing them in the trash makes sense and I find it hilarious.",
            "I was out with a group of co workers and this guy would not leave me alone.  I wasn't even polite about asking him to go away.   Finally I was at my breaking point and I told this guy I'll let him buy me a drink if he left me alone after.  He bought me a drink and walked away.  I wish I knew it was that easy in the beginning.",
            "Cmon, include her reaction.. good story tho, classic",
            "Fuck around and find out!",
            "Was the store called Food and Stuff",
            "Sometimes it's just best to be quiet",
            "Stupid breeds greed",
            "ugh. Customer reactions to charity always kill me. \"You're going to charge me more!\"",
            "This is well written but honestly all I needed was the title to know the story!",
            "I had a guy agressivly negotiate a car with me, try to under pay me. I was counting the cash and he was being a jerk. I was like ok close enough. Took it the bank and I told the cashier it was probably off. She ran it and I saw her rerun it through the machine. I though damnit he did skimp on me. Nope! Overpaid $100.",
            "Maybe she really just wanted twelve exactly.\nSome ppl have ocd like that.",
            "((Surprised Russian Pikachu Face))",
            "Wife owned a cafe, guy comes in with a coffee discount card from like five owners long gone and screamed obscenities at my wife for not giving him a free coffee from a business we'd never heard of.",
            "This is definitely a Russian/Ukranian thing.\n\nNot to peddle stereotypes, but when I worked at a particular Office supplies store in an area with a high Russian/Ukranian population (discovered the migration was for religious freedom like... 40 years ago), it was ALWAYS the Russian/Ukranian customers that would give me hell about change or a specific number of something.\n\nI remember one night - I'll never forget it - I dished out 78 cents for change. 3 quarters and 3 pennies. Gave them their receipt and bag of shit.\n\nShe counted it out just as slowly as she did for OP. 6 coins. She did it 3 times on the counter, gave me a glare, and walked away.\n\nBruh...\n\nThat one stuck with me because of the glare, but I had multiple instances of people counting the change and holding up the line before walking away.",
            "What does her being Russian have anything to do with anything?",
            "[deleted]",
            "Your customer started out the day with brain damage, and then brought that brain damage to your store. You tried to teach a damaged brain a thing, but it didn't take.   \nDon't feel bad. I am sure the brain damaged lady did that math over and over again in her head until she got home and fell asleep from the exertion.",
            "This was perfect!, love the part where you told her she was right and the cherry on top was that you gave her the exact amount.",
            "etc. not ect.",
            "Play stupid games...",
            "She cut off her nose to spite her face lol."
        ]
    },
    {
        "post_id": "bvld0c",
        "author": "ACFF",
        "title": "CEO didn't understand what my department did apparently....",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bvld0c/ceo_didnt_understand_what_my_department_did/",
        "score": 26608,
        "num_comments": 844,
        "created_utc": 1559399286.0,
        "selftext": "Update at the bottom.  Thanks so much for the up votes and silver, gold and platinum. I really didn't think this would take off like this.\n\nSome backstory; I was a general troubleshooter for my company. My job involved a lot of travelling to different clients we support. My area of work is Ontario, Canada (where I am based out of) and some of the nearby States in the United States (New York, massachusetts,  Vermont, Pennsylvania.) I did most of my travelling by car since my schedule can change quite quickly and flying can become very expensive. I had one colleague who is technically my subordinate but we have a very good working relationship and would often handle calls independently of each other only checking in by phone once a week and in person once a month / when necessary. \n\nA little over a year ago I get an email calling me to the head office in New York City for a meeting with the CEO and the board of directors regarding my job.  I check with my colleague and he got the same email. So we make our travel plans and meet in New York City the following week.  We have dinner together the night before our meeting and can't figure out between us what the issue is about (it's rare to get summoned to head office and more rare for things to be so vague).\n\nWhen we go into the meeting the next day we are informed that the company is dividing our department between the US and Canada and that there would be a new person to deal with the US clients and we were to restrict ourselves to Canada. Both my colleague and I were a little shocked at this since neither of us has even heard this was being discussed. I asked who the new person for the US was and we then learned that it was a new hire that the CEO had taken a special interest in. \n\nTrying to be of good spirit I offered to train the new person. (There are many realities of the job that are not in the job description). CEO accepted and then brought in the new hire. In walks a young lady who looks about 23 years old and wears an expression that she knows everything.  She sits at the table and immediately makes it very clear that she wants nothing to do with us.\n\nCEO - Bob, New Hire - Karen, My Colleague - Jim.\n\nBob: Welcome Karen, we have just informed OP and Jim about the change in structure and they are willing to give you the support you need to get yourself started. \n\nKaren and Bob both look at me.\n\nMe: Glad to have you aboard Karen, I think both Jim and I have a lot of experience to share with you and we are happy to do so, perhaps it would be better in a separate meeting so we don't take the board's time. \n\nKaren: Thank you all. I have a lot of ideas about how I can streamline our department and new policies I can introduce that should save the company a lot of money in expenses. \n\nI'm very confused at this point. Karen is speaking as though she is my supervisor and that is distinctly not what Bob spoke to us about.  I can see some of the board members giving strange looks at this as well.\n\nMe: Bob perhaps I misunderstood the new roles here. Would you please clarify?\n\nBob: Sure, Karen is the new head of your department and both you and Jim will answer directly to her.\n\nBoard member: That isn't what we discussed or approved as a board.  We weren't fully convinced of dividing the department but this is completely against what we discussed.\n\nKaren: What did you discuss then?\n\nBoard Member: That your department would be divided between the US and Canada.  OP and Jim would remain north of the border and you would run the US.  \n\nKaren: That's not what I was told but I can work with that.  As long as these two stay out of my way. (Indicating me and Jim)\n\nJim and I are both shocked and insulted to be spoken of in this manner. We are both very good at our jobs and before today have never seen this woman in our lives. \n\nBob: That settles it, OP, effective immediately, you and Jim are to have nothing to do with Karen. Do not interfere with her work at all.  You are both to restrict yourselves to working within Canada only.\n\nWith that he ended the meeting and left the room with Karen close behind him.  Jim and I sat there stunned for a moment and some of the board members came up to us to express their shock and sympathies about this. I had enough presence of mind to ask if we would get a written directive of this change and was assured we would. Sure enough both Jim and I got emails with the new directive from Bob by the end of the day. \n\nSo after sending an email to all our US based clients advising them of the change and giving them the contact information of Karen, Jim and I made our way back to Toronto and reorganized ourselves for working within Ontario only. This meant much less travelling for us so it gave us more room to breathe. \n\nWithin a week I was getting complaints from our US based clients that Karen was not answering emails and missing appointments.  I forwarded these emails to Karen and copied the entire board including Bob. Another week later I get a phone call from Karen who sounds frantic but will not admit she needs help.  She makes pleasant conversation and then asks how I would handle a particular type of situation.  I tell her I'm really not interested in discussing work as that might be seen as interfering in her work.  Later that evening I get a call from Jim telling me he had the same conversation with Karen and handled it the same way.\n\nBy the end of that month I get a call from Bob asking if I will take over the entire department again. I politely tell him no since I didn't want to interfere with Karen and her role.  For the next 3 months I'm getting emails and phone calls from US clients asking if they can have me back as their contact. This confirms an idea that had been in my head. \n\nJim and I had actually grown our client base in Ontario since restricting ourselves here. So I had lunch with Jim one day and asked him if he wanted to go into businesses with me as partners starting our own consulting firm. We couldn't provide everything our current company provided but we could provide a high degree of professionalism for our specific field and it seemed we had a ready made client base. By the end of the lunch he was on board and we started the necessary steps to get ourselves setup.\n\nAs soon as we were clear we both submitted our resignations with explanations of why. The next time clients contacted us we told them we no longer worked for the company.  When they asked if we still worked in the field we told them we had established our own firm and what services we offered.  A month later we had 60% of our US clients on board, and since the former company had no Canadian support at all, we had 80% of the Canadian clients. Within 2 months we had 80% of the US and 90% of the Canadian clients. \n\nIn the year since that time our new company has grown enough that we have hired 7 new consultants. Jim and I find ourselves doing more office work than road work, and a lot of client courting. Our old company has had to stop offering the in person troubleshooting (what our department did) and Bob was fired by the board.  No idea what happened to Karen.\n\n\n\nUpdates:  \n\nBecause of interest expressed in the comments I made a phone call to one of the board members I remained on friendly terms with. Here are some answers to questions. \n\nHow did Karen get the Job?  Apparently Bob had set up a business school scholarship out of his own money which had put something like 6 or 7 students through business school. Karen was the latest graduate and Bob wanted to give her a start in the business world.\n\nWas Bob sleeping with Karen?  No clear answer was given. But Bob's wife divorced him shortly after he was fired from the company.  Make of that what you will.\n\nWhat happened to Karen?  Apparently she got a job as middle management in a financial services company. Hopefully she can still build a life for herself and had learned some important lessons. \n\nWhat happened to Bob?  Last heard he was a regional director for a large hotel chain. Hopefully he also lands on his feet. Everyone deserves a chance  to make a life for themselves. \n\nSome questioned why the board was there for this meeting. I honestly don't know and neither did the board member I spoke with. It was one of their regularly scheduled meetings and Bob added things to the agenda. \n\nSome questioned my use of non competes saying its not nice. Its a normal reality in the business world. The oddity is that my old company did not have one.  The non compete I have my employees sign is not overly burdensome. It protects our intellectual property and professional contacts.  It does not in any way restrict the employees ability to work in the field. That said, Jim and I have both agreed that if an employee leaves us on good terms and reasonably asks to be released from the non compete we would oblige. \n\nSome inquired if we are still hiring. Unfortunately we are not. We are taking a pause from expansion right now as Jim's wife is dealing with cancer. I don't want Jim to worry about the office while taking care of his wife so we have decided to maintain our size (which I can do with minimal input from Jim) until his wife is in remission and he has a chance to rest and return his attention more fully to our company.  Jim and I treat each other like family. So this is a natural step for us. \n\nThank you all so much for your interest and the great feedback and discussion in the comments. \n\nEdit. Replaced all the initials with names because a number of people commented the initials made it difficult to follow.",
        "permalink": "/r/MaliciousCompliance/comments/bvld0c/ceo_didnt_understand_what_my_department_did/",
        "comments": [
            "Very good comeback.  I personally took a break to get more coffee just before you hatched your plan, so I could savor it that much longer.\n\nAs for\n\n>what happened to N\\[,\\]\n\nI'm not sure what happens to CEO's mistresses after the CEO gets canned.",
            "You're lucky that you guys didn't sign a non-compete clause in your employment contracts. Kudos for throwing them under the bus.",
            "A young lady that the CEO had \"taken a special interest in\". Hmmm...",
            "Wow, what a great story and congratulations on your successful business! Thank you for sharing. That company didn't deserve you!",
            "That is the best comeback I've ever read here. Keep it up!",
            "Ontario eh!  Pitter patter, lets get at ‘er!\n\nI love it when they bring in very inexperienced people off the street and put them in positions of leadership.  The smart ones ask for help (that you so kindly offered) but the dumb ones do exactly what she did.  Look at how much money they saved lol....",
            ">I have a lot of ideas about how I can streamline our department and new policies I can introduce that should save the company a lot of money in expenses.\n\n\"Streamline\" and \"save money,\" two buzz words in a single sentence all while being vague about it. Definitely not a red flag",
            "I would like to go on record to say that I admire Karen. She certainly delivered on her promises to streamline the department and save the company money in expenses. \nIn all seriousness, best story I’ve read on here for a while.",
            "Now this is some pure, feel-good, malicious compliance.",
            "This happens fairly often, some new hire believes he/she can jump their way up to the big ranks within their first few months, and when they do get it their way, they realize they weren’t ready for it after all.",
            "My dad took his old businesses cintract as well, there was a hostile take over by one of the employees and they fired my dad since he had been there for so long, they then threatened to not pay severance if he didnt sign a non-compete. Well first of all, that wasn't part of the severance agreement, but we no konger had the income to afford a lawyer, so we simply didn't get the severance. Afterwards my dad started his own business with a VP who also got shoved out of the company(and was supposed to get like, 1 millsion dollars from his share of the company, still hasn't gotten it after decades of legal battles), using some contacts he had from his previous business (not giving names, but it's the kind of business that two or three contracts is enough for a two man business to prosper). The old business was a technical job, and all the people capable of doing the job had gotten forced out for objecting to the takeover. As a result, there was no one left to actually do the work required and their clients bailed. They then tried to sue my dad claiming he had aigned a non-compete, which was a lie, but my dad had just started his business and couldn't afford a lawyer. Thankfully, a family friend who was a very accomplished lawyer basically threatened the company with a letter promising to defend us if they didn't drop it, so they gave up. Eventually the company folded, and my dad's business is prospering, but the asshole who started all this is still propsering running a snow even for one of the companies they had a contract with. My family doesn't really believe in Karma....",
            "Great story and happy for your success. \n\nBut I have to say you are beyond lucky that your prior employer seems to have been idiots and sounds like the board was dealing with bigger issues to look into what you were doing. \n\nNot sure of Canadian law but did you not have non-competes?\n\nEven if you didn’t, Im surprised they didn’t sue you for tortious business interference \n\nAs a serial entrepreneur I’ll tell you the legal system can really be used as a weapon. Be careful out there!",
            "CEO was probably a \"finance\" guy who didn't know squat about running the business and wanted to make his mark micro-managing the company. That, plus his new girlfriend needed a job and a bump in salary and he created a position for her. \n\nPlay stupid games, win stupid prizes.",
            "To quote the Hulk, I see this as an absolute win! You should hunt down that dumb girl and send her and the ex CEO a big old cookie basket for letting himself think with his dick and fucking over themselves and that company.",
            "Why is the board at a meeting like that?",
            "Y'all hiring by any chance? I'd be down to work for you guys with that kind of integrity and entrepreneurship.",
            "OP, *come on!*  You must have some contacts at the old company that can give you more information about Bob and Karen!",
            "what micky mouse organisation is this? boards rarely get involved in hires outside of executives... and in this case the CEO mislead the board on this supposed person's role and they are just casually okay to change it? that's not how board meetings go in a sane business",
            "Fire and fury. Good on ya!",
            "You should post this in r/prorevenge",
            "I often feel that the best success stories emerge out of someone else’s failure to appreciate what they have in-house.\n\nGood on you for making a bad situation turn for the positive.",
            "I'm sure the board is very glad that bob got to get his willy wet with Karen.",
            "Are y'all hiring? :D",
            "If a board of directors approves one thing (promoting Karen to position A) and CEO does distinctively other thing (promotes Karen to position B) does that work? Doesn’t the board have the ability to act immediately, rather than waiting for the company to take a financial hit before removing Bob?",
            "“Blah blah blah I’ve been hired to save money”. \n\nThat’s code for “I’m about to drive this successful business into the ducking ground and ruin everyone’s happiness.”",
            "Bob was def shagging Karen.",
            "What an update!\n\nI’m sorry about your partner’s wife having cancer. It’s a shitty disease. I’m also in Ontario and hopefully ford’s cuts aren’t going to effect her treatments. \n\nCongratulations, and you genuinely seem awesome.",
            "it sounds like the new hire was a clueless casualty of the CEO's power games :/ I'm not sure why the board allowed this to happen the way it did, it sounds like they hurt their own business by letting the CEO tie his own noose.",
            "It sounds like Bob had given the job to his girlfriend who didn't know what she was going to do.",
            "thnaks for the names instead of inits.\n\ngood on ya for doing it the right way. GL",
            "[deleted]",
            "But.. was Bob Fucking Karen or what!?",
            "I'm late to the party, and sure no one will see this. But to me it's shocking how much Karen screwed this up. She had a perfect opportunity to step into what seems like a really astounding job for a 23 year old. She easily could have accepted your guys' help. Spent a couple or few months traveling around with you guys, getting to know you both, having you do the client introductions, all while stepping into her role. During which she could show she has talent and ability, but is also willing to learn expertise from those who have it. Making the two of you valuable resources in her future. Having you guys introduce her to clients not by email as your replacement, but in person as \"this is who you'll be working with now and she's great\". Which goes such a long way I really can't over emphasize it either. \n\nIn the end she could have come out with a lot of experience. What sounds like an incredible job for 23. Strong ties with experienced co-workers. A built relationship with clients. And a really good future. MAYBE even that top position if her and Bob were able to convince the board a couple years later.\n\nInstead..... Well. We know what happened instead.",
            "She got stuck in middle management? Oof. The morons are usually put in middle management where they can do the least harm.",
            "Fucking Karen...",
            "Hope she was worth it Bob",
            "What an absolute dick she was.",
            "Sounds like bullshit.",
            "Fuck you Karen!",
            "Lol you can hire Karen now",
            "It’s very obvious that the boss was sleeping with Karen.",
            "Bob is fucking Karen",
            "Wow, that's what happens when Bob let's his dick think for him. Congratulations on your new venture!",
            "Tbh I was expecting the typical 'Karen is ceo's daughter!' But this was way more satisfying",
            "I like the use of names for the primary characters as it does in fact make the story easy to follow. I especially like the use of ‘Karen’ for ‘the new guy.’",
            "Good for you! I hope your colleagues wife recovers well from her cancer.",
            "I can definitely see why you would have people asking to work for you. I don’t even have any idea what your field is, I’m pretty confident I’m severely under qualified, and *I* wanna work for you. You’re obviously a rare breed of boss, if my experience has anything to say about it.",
            "Best of luck to you, your friend, and your company bud!",
            "Troubleshooting is one of the hardest things to do. It requires extensive knowledge of edge cases. Not sure how any manager in their right mind thought a novice could do it.",
            "This guys knows how to treat clients, he is spoiling us rotten!\n\nYou don't like the abbreviations? He gives everyone names.\n\nYou want more info? He frikin reaches out to contacts to get you all the info he can get.\n\nThanks!",
            "As a young person I am absolutely elated that you are so professional. You have had no ill will (ie no scorched earth policies) towards Karen or Bob. Although they were A-holes per se, you didn’t say nasty things nor did you make an effort to Blacklist them with negative comments to their new employers or cause them to be unhireable. Although there are policies in place in the world that prevent blacklists from largely being a thing across different companies...it happens. And ruining a life just because someone had a huge ego is just so inhuman. So I’m glad you outdid them but I’m also glad you didn’t cause a life of suffering for a foolish kid.",
            "hope jim's wife gets rid of the cancer.",
            "No offence, but this story sounds like total bullsh*t. If you work in a consulting organization that is large enough to have its own board of directors, then two guys (regardless of their professionalism and relationships) could not pull 80% of anything. \n\nIf that did occur, then even if you didn’t have a non-compete, you would be getting sued back to the Stone Age. \n\nIt’s totally fine to branch off on your own. I did. But taking clients with you is somewhat poor form.",
            "Thought you weren’t supposed to use initials\n\nReally dislike it. Ruins the flow",
            "Speaking as a former Canadian employment lawyer, you are very incredibly lucky that your former employer did not have you sign a non-competition agreement.  \n\nPerhaps your CEO was also diddling the company’s legal counsel?",
            "Well played, good sir.\n\nWell played.",
            "Your company sounds rather large, I have to imagine there’s no poaching policies set in place. Everyplace I’ve worked at had me sign agreements that I was not allowed to poach clients in any form.",
            "Too many comments so I’ll ask here:  \n\n***What did the CEO and board say when you both resigned?***",
            "This reminds me so much of the opening of Up In The Air (clooney/Kendrick).",
            "Excellent!",
            "Nicely done!",
            "Kudos! That was a great read.",
            "Great story.",
            "Good for you and your working partner, great story!",
            "That is awesome",
            "Dude this is a success story",
            "Get fucked, Karen",
            "This is glorious",
            "Wow, hope your business grows more in the future! It sounds like you guys did some good quality work.",
            "This is beautiful.  I love it, so elegant.  Thanks!  It's well-written, too.",
            "[I have know idea how to do your job...](https://me.me/i/i-have-no-idea-how-to-do-your-job-but-3117529)",
            "This is so damn sweet.",
            "\\*salutes\\*  General Troubleshooter.",
            "What a nightmare, I’m very happy for you both that this worked out as well as it did.",
            "Great story.  Well done OP",
            "Great case of malicious compliance! I liked that you didn’t use annoying abbreviations in telling your story",
            "Great story OP. Fuck Bob.",
            "This may be one of my favorite MC I have read to date.",
            "That’s what I call success in the face of adversity. Bravo",
            "Don't get mad at someone fucking up, take advantage of it.",
            "Business 101 - Don't shit where you eat, Bob. Great post, OP!",
            "How did you not get your ass sued off for taking your employer's clients?\n\nIn the US, all that would need shown is that you made contact with the clients as part of your previous employment.",
            "CEO and new hire have more than work relationship going, if I can read between the lines. No clue why CEO would risk his job and reputation for someone who is unproven in a position.\n\nI once worked in a store. New gal is being shown around the store and is being told all the stuff she needs to know. He response to what she was being told was, “I know.” Job wasn’t hard so she was fine but she turned a lot of people off on her first day with this response.",
            "That was a brilliantly executed plan of battle.  Well done!",
            "That was very satisfying to read\n\nI have a friend who’s a high end property manager and as a favor for one of her clients she picked up an extra property for a temp summer gig knowing it’s a very difficult client and as soon as we get through the season she is let go and another client of hers that was friends with her let her go and she was extremely upset. A couple months later she gets an offer that’s big enough to work exclusively for one person, which she wouldn’t have been open to had she still had the other client, that was about a year and a half ago and she couldn’t be happier, I jokingly said to her she should send a thank you card to the temp job lady and she looked at me mortified for a few seconds until the gears clicked that it was some of why she landed in her current job. \n\nGood for you guys, taking a bad situation and flipping it is a true accomplishment",
            "Wonder how Karen got the job...",
            "Bob, this is why you don't let your 2nd head make the decisions.",
            "yes.",
            "Congrats! Do you think Bob was doing more than taking 23-year old Karen under his wing?",
            "Some stories on reddit are made up for karma but honestly, it was so well written that I don't care either way.\n\nGood for you for taking the initiative, OP.\n\nThis is also /r/ProRevenge material.",
            "Cross post to r/prorevenge",
            "This is amazing, good for you guys!",
            "Story is way too Hollywood.",
            "Great story. The entire thing could of been avoided if Bob didnt try to one side you all. \n\nAlso nice job with the names, its that extra step that helps the story, and people being able to remember the players on the board. Something that several subs have been making a mandatory rule, and it makes more sense.",
            "Congratulations on the new company, I hope you do well!",
            "You're my hero",
            "Congratulations on your new venture, and was so satisfying to see how an attempt to stifle your growth turned into a great opportunity.",
            "Interesting read...I just wanted to see Karen fuck up.",
            "CEO doing the young grad and giving promotion is quite common. Look at google brin and amanda (probably more undisclosed ones brin having with billionaire lifestyle)",
            "This might have been malicious compliance, but after reading your updates I don't think there's a malicious bone in your body. I'm glad that instead of being spiteful towards these people you're hoping they learn from their mistakes and do better in the future. Legend.",
            "I love your maturity. You wish people well around you, even those who moved against you. I appreciate that you have the depth of understanding that life isn’t just about getting one back, that people around you are suffering their own pains. Thanks for writing this all and being honest. \n\nYour even mindedness makes me want to know your opinions on other situations in the world.",
            "Wow, you really didn't give Bob a second chance there did you? Were you already considering starting your own business before his fuck-up gave you a good reason?",
            "This happens more than people actually think.",
            "Awesome story! I sincerely hope Jims wife will be ok x All the best!",
            "This was very satisfying, thanks for sharing!",
            "Give your best to your mate for me, whatever a random internet strangers best is worth.\n\nMy wife was recently diagnosed with a pituitary blastoma and it's not looking good, so I can empathise with your friends situation.",
            "We need more like you, in the US there are too many corrupt CEOs running the show imo.",
            "This is damn near a Pro Revenge",
            "> Within a week I was getting complaints from our US based clients that Karen was not answering emails and missing appointments. I forwarded these emails to Karen and copied the entire board including Bob. Another week later I get a phone call from Karen who sounds frantic but will not admit she needs help. She makes pleasant conversation and then asks how I would handle a particular type of situation. I tell her I'm really not interested in discussing work as that might be seen as interfering in her work. Later that evening I get a call from Jim telling me he had the same conversation with Karen and handled it the same way.\n\nAs a guy, I have no experience with multiple orgasms, but expect that it must be similar to my reaction to every succeeding sentence in this paragraph.\n\nHot damn, you just kept going from there, too.  I had to read this post in stages.",
            "Thoughts and prayers for Jim and his wife! and thank you for the fantastic MC :)",
            "That was a rollercoaster! Congrats on your new business, and give Jim and Jim’s wife a lot of love during this time. Cancer can be super rough, and he’s certainly lucky to have such an understanding and caring partner. You’re making it that much easier for him to deal with all of this.",
            "It's been 4 years+, what ever happened with Jim's wife? Hopefully she came out okay?",
            "This will probally get deleted by the mods because of this: C- CEO, N- New Hire, B- Board Members, P- my colleague\n\nSome people apparently find it hard to follow, no idea why, I have no issue with it at all, but those are the new rules and I expect that they will be followed.",
            "Bull. Shiiittt. You'd be sued and screwed. Not only that, but I highly doubt clients would be so willing to just abandon the security of a company that has served them for years for people who became independent. Bullshit.",
            "Acronyms make this barely readable.",
            "Yo man can you use actual names (non initials) in your posts?",
            "For the love of God please spell out titles or names. My brain can't cope with this alphabet parade.",
            "You missed several instances where you used a letter instead of a name in your edit. It’s even more confusing this way than it is with just the initials",
            "I’m eager like Karen, but I know my place!\nLmk if you need some additional professional support! :)",
            "[deleted]",
            "My only gripe of this story is it isn't longer. Really enjoyable read as well as a great payoff.",
            "That you were called into a meeting with the CEO and the whole board of directors is... Odd... That's only something that happens on TV, not in real life."
        ]
    },
    {
        "post_id": "winxej",
        "author": "JJayHawk84",
        "title": "I should quit my primary job? Yeah ok….",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/winxej/i_should_quit_my_primary_job_yeah_ok/",
        "score": 26589,
        "num_comments": 716,
        "created_utc": 1659900698.0,
        "selftext": "About 16 years ago, I was working as a greeter at Olive Garden as a second job just to make ends meet. The day before Mother’s Day I was about 10 minutes late punching in to work. I was coming from my primary job, changed clothes when I got there and punched in. The manager immediately pulled me aside and said that I needed to be more courteous to my coworkers and show up on time as my being late effects other people. I responded that I was aware and I did call in to let them know I would be late and that the person who answered was the person I was taking over for and that she said to take my time because she was just going home and spending the night in alone, no big deal.\n\nThe manager laid into me. She told me that I’m not the type of person that can hack having 2 jobs, that I was too inconsiderate to work 2 jobs, and that maybe I should choose which job I value more and quit the other one, and that if I quit the Olive Garden that I would NOT be welcomed back. Initially, I thought “well I’m not going to let you chase me away.” But then I realized, this is a second job. I don’t have to be here. I don’t have to let her talk to me that way. I went home and told my s/o (who also worked there as a second job) what was said. We mutually decided that I should quit the Olive Garden.\n\nSo I went in for my morning Mother’s Day shift wearing my street clothes, went to the back office to find the manager, and said “so, I put a lot of thought into what you said and have decided that you were right and working here, for you, is not for me anymore.” She looked stunned and said “Well you’re going to work today, right? You know Mother’s Day is our busiest day of the year, you can’t just up and quit, today of all days!” I said “Well maybe this will be a lesson for you on how to speak to your employees and how to be a decent human being. Besides, you said yourself I’m too inconsiderate to work here.” and I walked out. Have not set foot in another Olive Garden since.",
        "permalink": "/r/MaliciousCompliance/comments/winxej/i_should_quit_my_primary_job_yeah_ok/",
        "comments": [
            "Good for you. I had 3 jobs. Primary was warehouse, secondary was retail, tertiary was an at home office job with no schedule. My retail job kept scheduling me earlier than my availability allowed (10am, but they scheduled me for 6:45am) I couldn’t be there because I was working my warehouse job. Management kept telling me I should quit my warehouse job so I can work more hours at the retail job. I replied that I’d never do that because my warehouse job consistently gives me over 40 hours per week, gives me affordable and good health and dental insurance, and pays me $8 more per hour. I’d be stupid to quit that job for a part time retail job. \n\nEventually I ended up quitting my retail job because they kept scheduling me too many hours. I would work 12am-9:30am at the warehouse. Then my retail job scheduled me 10:30-7:00pm. I did that 3 times per week. I asked for less hours and they wouldn’t give me that. I couldn’t take it anymore so one day before my shift, I called and I quit. They were shocked and told me I wouldn’t be able to be rehired. They were acting like it was a big loss for me. It wasn’t.",
            "Good on you. Employers who don’t value their employees don’t deserve to keep them.",
            "But how will you survive the rest of your life without free salad and breadsticks? /s",
            "Manager is dumb AF considering how dependent the restaurant industry is on \"this is my second job\" labor.",
            "What is it about ppl in food service lower management that gives them the feeling of entitlement that they can control their employees lives?\n\nThey go from threatening loss of your job for something they willingly look past for some but not others to indignant victims when you call their bluff. \n\nThat’s a dog shit manager, fuck them. \n\nCould’ve been a simple, “Oh, you called? Okay, just give me a heads up if it happens again.”",
            "I had the same kind of talk a long time ago. I was working a commissioned sales job where I made enough to cover rent and bills, and got a call for an interview from a Gamestop I had applied to six months earlier.\n\nThey offered me a part time job while the assist manager was finishing school - two nights a week. I was like \"hell yeah, discount on games biotch!\" Since I already worked in sales, meeting the quotas was so easy that I was literally giving away extras to other employees (you had to have so many GI signups and preorders.) It was minimum wage but the discount allowed me to quickly expand my game/console collection.\n\nI was still working there in October, and the manager was scheduling me for when i had to work my main job. i told her that it was outside my availability, and after a few missed shifts, she pulled me aside and gave me the \"you need to decide what's really important to you.\"\n\nCue shocked pikachu face when I handed her my badge, thanked her for the opportunity, and walked out.",
            "You were there, but you sure as fuck weren’t family…",
            "I'm not quitting Olive Garden.. I'm quitting you.  \n\nNever welcomed back.. hahaha as if that is some kind of deterrent.",
            "I love when managers say \"you can't just x\"\n\nYes, actually, you can.",
            "Goddd that answer was soo fucking good. I bet she thought about that for the rest of her stressful shift (i doubt she changed anything but you were probably living in her head for the rest of the day)",
            "My favorite part is that you did it on Mother’s Day. That’s one of the worst days to be in the restaurant industry. Kudos to you for sticking it to her!",
            "Shit on the employee that is working there as a second job and see how well that turns out. These are the people that don't HAVE to be there and will walk if you do anything that might threaten their primary job. That manager was dumb as a box of hair. Good on you.",
            "I love when the boss at a job you hate doesn't realize that you literally do not need them. One of my old bosses fucked around with my hours because I didn't answer his call on my day off (i honestly hadn't seen the call, and by the time I did it was like 6 hours later) so I started looking for a new job. Apparently he started getting all paranoid and was asking the supervisor I was on good terms with about whether I've found a new job or not.\n\nThen, lucky me, I got an email about a new job the night before my birthday. Went in the next day, ON my birthday, and quit with no notice. The boss asked me if I \"don't like working here?\" And I told him \"no, i don't like working here, and I REALLY don't you.\"\n\nCherry on top is that I came in a couple weeks later to say hi to some of my old coworkers, and he had \"help wanted\" signs on every door and at the counter. Apparently 2 more girls quit without notice shortly after I did, and another had put in her 2 weeks lmfaoo.\n\nThe whole reason he cut our hours was because \"nobody wants to work when the store needs help on their days off\" like... maybe if we were making more than fucking minimum wage, we'd actually give a shit.",
            "Now I'm curious how screwed she was since you left on one of the busiest days. Did she had to cover for you or did she let everyone else work harder?",
            "\"You can't just up and quit\" but isnt that what she was telling you to do?",
            "A relative of mine has been a server for years and years. After she had her daughter she didn't want to work mother's day again. She would work any other holiday, always worked weekends and lunches ect. Valentine's day, new years, father's Day, Thanksgiving, whatever- she just wanted mother's day off. Well, new gm comes in and I'm sure you guessed it- put my relative on for mother's day. So she goes to tell the gm about the deal she had with the previous one, new gm doesn't give a shit. So relative starts looking for a new job. She put in her two weeks right as the gm was getting ready to go in vacation. They would be too short staffed for her to get walked out like usual, so she had a great long week telling all her regulars where she was going to. Got lots of extra tips, some even have her actual gifts dice she had been there for 5or so years. \n\n\nNew gm wasn't thrilled. Especially since the new serving job she took was on the other side of the shopping center. Every so often she'd stop on to see her friends that still worked there and inevitably, they too would put in notice and go to work at the same restaurant as hers. \n\n\nNot glorious, not fireworks, but a long slow death by a thousand paper cuts of resignation letters.",
            "\"But we're a family! It's even part of our slogan!\"",
            "Kind of curious, how do people have two jobs if one or the other has a shifting schedule? Like, for instance, one week you have a day where the jobs overlap?\n\nI think shifting schedules happen in the service industry, e.g. restaurants and retail stores.",
            "This is the way.",
            "Great example of how the words and actions of one bad apple can poison a person’s impression of an entire company.",
            "Whenever someone says “to make ends meat” I imagine them cobbling together bits of meat",
            "Bad management found a good way to make *sure* the restaurant would be extra understaffed for Mothers Day.  They played themselves lol",
            "My husband worked at the red bullseye store during college.  He was a part time student, and was putting himself through school. He had worked up to a supervisory position and was asked to be assistant manager, but said no thank you because his first focus was his grades. His managers had been really good about working with his class schedule, until a new manager started. He was told that he would have to make a choice, either his job or school.  Manager was *shocked* when my husband said, “please consider this my 2 week notice.”",
            "Some manages are just so, hell I don't even know if there is a word for it.",
            ">you can’t just up and quit\n\n\"Sure, I can.  At will employment works both ways.  Bye.\"",
            "I worked at Olive Garden 15 years ago. When college started, I gave them my school availability. They seemingly intentionally scheduled me during classes and activities required for my scholarship. When I brought it up, they told me that they needed me, everyone was making sacrifices, and I needed to evaluate my priorities. \n\nThis is after I had sacrificed a lot of my senior year and had been regularly made to work until 2-3AM on school nights. Fuck the OG.",
            "OMG, I can't imagine the stress and pain of not being allowed in Olive Garden again! \n\n/s",
            "I had to have that conversation with someone yesterday. The only difference, she’d blown off two shifts with less than 5 minutes notice each time, and messaged me yesterday (three days after I asked her to call me) to tell she couldn’t work her next shift either. She was only scheduled once a week, at her request. I asked her if she thought it might be better to go ahead and put in her notice, which she immediately did…then asked me to keep her in mind for seasonal. Umm…no, thanks.",
            "Unlimited soup, salad, and breadsticks\n\nLimited decency, consideration, and empathy",
            "I don't like Olive Garden mostly cause the last time I went there they were advertising that \"never ending pasta bowl\" thing. Which they had been advertising for years. \n\nSo I was excited to try a bunch of different pasta dish's. I order my first dish it's good, then second dish, it's okay but I didn't finish it completely I figured I would save room for another dish so there was still a little bit left of the second dish. I then tried to get my third dish only to be told \"that will cost you extra\" \n\n... Um what? I thought it was never ending pasta bowl? So you basically get 2 pasta bowls and then have to buy more? By that logic ANY restaurant can claim \"never ending... bla\" the false advertising really pissed me off to the point I decided after that day not to go back and haven't been back since. \n\nAlthough I know this doesn't really pertain to the post other than the restaurant. :P",
            "Their food sucks anyway.",
            "I love this too much. I’m picturing my most hated boss and wish I said those exact words",
            "I worked at OG, it was pretty terrible. If you called in sick, you were automatically reduced to 1-2 shifts per week. \n\nI put in my notice, and quit because it was a job at  In the town I was going to school in, and it wasn’t worth staying the summer to work 1-2 shifts per week. On the day I was leave town, the manager on shift called to ask me to work. I told I quit and wouldn’t be working that day as I already had my last check in hand. \nI was young and didn’t know any better, so after he pressed, I thought I’d take the shift and make a few extra bucks before I left town. I showed up to work and could clock in because I don’t work there. I reported to the manager and he said he’s take of it for me. A couple hours into the shift, the store manager approached me and asked why I was working. I told him I was called in by the shift manager. He told me I don’t work here, and I said that I am and he needs to work it out with his shift  manger. \nI resigned my self to possibly not getting a check, but I’d still get tips (I was a busser). I check in with the other buzzers before leaving, and they weren’t ready to tip out (we split tips). I made arrangement with the one of the bussers to meet me later to get my tip share. He didn’t show up, I didn’t get paid by the restaurant.\n\nOG is the worst.",
            "You have added considerable value to the human race. Cheers.",
            "Some of the shittiest management ive ever seen are in logistics and food service",
            "BRAVO!!!!  Hopefully, your ex-manager will come down from their high horse and learn how things work in the real world.  \n\nHope you found a place to work at that really values you.",
            "Fr managers be forgetting they’re managing NOT OWNING!!!!",
            "The satisfaction of quitting on the day you leave.... I've only tasted it once but it was great",
            "Had a manager tell both morning and afternoon staff that her meetings were mandatory and not showing up meant we'd get written up. Meetings were at 8 on a dam Saturday but whatever. One time me (front of the line) and the cook had a meeting at our other job at 9 on a Sunday, our busiest day (was not mandatory but it was encouraged and they were giving us breakfast on top of that) we told her we would be showing up at around 10:30. She said we couldn't do that, and we both told her it was mandatory and we'd get written up and if she wanted proof then we'd bring a paper from our other job.\n\n   She told us not to let it happen again and we both told her that we can't respect her mandatory meetings if she wasn't gonna do the same for our other jobs then. After that she \"encouraged\" ppl to show up at her meetings but barely any ppl showed up and she just posted a paper in front of the punch in screen letting everyone know what the meeting was about",
            "Nice. I quit my second job because I couldn't get the day off that I really needed. I had the job during my apprenticeship but I had recently qualified and was now on more than everyone except the Store manager I believe. I only kept working because I had no reason to quit.\n\nI handed in my one week notice (so I'd finish the day before the one I needed off), my immediate boss was really cool and apologetic about not being able to give me the day off. I got tannoyed to the personnel manager's office. \"I hear you're trying to blackmail our shop\" I asked for an explanation of what part of handing in my notice was blackmail and it turns out that she thought it was a bluff power-move on my part. She tried to put me in my place, explaining that my job was easy to fill and I went \"I'm pleased it won't trouble you\" in a positive way. Then she brought the big guns out, \"you need to consider what you'll do for money\" to which I replied \"I'm also an electrical engineer at xxxxx earning £xxxxx, I'll be fine\". Her tone changed after that, she'd been so used to using the power she had over people living payday to payday that she didn't know how to negotiate. \n\nAnyway she says she'll find a fix and won't file my resignation just yet, she'd let me know on my last shift if she got someone to fill my slot. Last shift comes along, she apologises for not being able to cover me but then says \"so we'll need you to work Saturday\". I laughed and told her that I wouldn't be working so to file my paperwork as planned. She responded with that because she didn't accept it would take affect from the current day and it would count as one weeks notice from then this making me legally obligated to attend. I just replied \"word it how you want, I physically won't be in this country on that day\".",
            "Reminds me when I worked for a Big Box retailer.  They knew before they hired me that I was in the worship band at my church. They kept scheduling me for 8am on Sunday, which is when we did setup and dry run through our sets..... I discussed it with them, always came to an agreement, then the next week there'd be a little asterick next to my name indicating that the manager overrode my availability.  More discussion, more agreement, more overrides. So, one day I just didn't show up until my available time (which was constantly agreed upon).\n\nThey came at me with a PIP.... I said \"do you really think that putting me on report for going to church is going to end well for any of you?\"  They capitulated, but overrode my schedule again.  I sent a one line email to HR copying all the managers at that store saying something to the effect of, \"The hiring manager agreed to my availability and continues to change it without talking to me first - I have much higher priorities than stocking USB drives.\"\n\nNever had a schedule override again, still quit 2 months later.",
            "Did your s/o stay there?",
            "Unfortunately being employed by Olive Garden hasn’t changed much. I know somebody who used to work doubles for them all the time and the managers were so pleased that they were talking about training her to be a manager. Then she got Covid and had to miss work, and all of a sudden she was their worst employee and she was written up. They also started over staffing so the waiters weren’t making enough in tips to live on. Luckily she was able to quit and move on.\n\nJust don’t work for them, they suck.",
            "People don’t quit jobs, they quit bosses.",
            "I worked for Olive Garden for four years to pay my way through college. When covid hit I got laid off same as everyone else. I was so bored/terrified that I went and found a job elsewhere. I waited 10 weeks for them to call me back into work at Olive garden and went back a few nights a week. I was by far one of the strongest servers there and frequently took large sections to bail them out because they were short staffed. The manager was a control freak because his wife controlled everything he did at home. I can’t tell you how many times he tried to catch me with a nit pick and lost 😂😂 they demanded that we start working more shifts and started scheduling everyone outside of their availability. Even before covid they were never staffed appropriately and we were frequently out of dishes/breadsticks and the kitchen was constantly behind. People started tipping less and less. I went from making 40+ dollars an hour with my tips to ten or less some nights working more hours with extra tables. One day after a 70 hour work week at my new main job the manager decided to get picky about my uniform. (Mind you, it was a Friday night and there was myself and 1 other server on a Friday night when there are normally 20 servers on the floor) so after almost 5 years of putting up with him I cashed out and left. Never went back.  Darden is the worst place to work ever lol",
            "Nice mic drop. Did she do the whole surprised pikachu face?",
            ">you can’t just up and quit, today of all days!\n\nNo? Just watch me!",
            "You take me to Olive Garden for mother's day and I'm putting you up for adoption.",
            "I love this, especially cause mothers day at OG is a NIGHTMARE lol",
            "Ohhhh quitting on Mother’s Day is SUCH A FLEX LMAO",
            "[deleted]",
            "Never ever threaten someone to leave a job.  \nThey would do it for spite.  \nI know this for a fact, did it twice.",
            "Inconsiderate managers/bosses are the primary reason why people leave their jobs or just outright let productivity drop.",
            "I haven’t worked in a restaurant for over a decade, but when I saw that you did it on Mother’s Day, my jaw dropped a little bit. That’s going full nuclear with a resignation. Much respect.",
            "It is sad to see so many stories about abusive inappropriate managers giving ultimatums and being genuinely surprised when their ~~victims~~ employees quit.  It is never their fault.\n\nI had a tubby balding little angry manager who yelled in my face for his mistake and tried to screw me out of reimbursements.  He even attempted to put an explicit limit on my learning/growth \"because I would get too expensive for them.\"  My resignation was a complete surprise to him.\n\nI let my replacement know what was going on and he only lasted a few months :)",
            "Why would they expect you to feel any need to work there after something like that? People work for money, not for any moral reason. If you were doing charity work, that might've been a reasonable response from them, but this is something you're doing out of your own volition and can quit any time. 100% your boss's fault.",
            "Was hoping your SO quit on Mother’s Day as well",
            "the concept of a professional greeter seems so strange and creepy to me (german) if I was greeted by a stranger when entering a restaurant i'd turn back immediately.",
            "They are an over priced \"dining establishment \" that I never really cared for to begin with. Your post just reinforced my lack of urge to dine there. Thanks!!!",
            "Frick, reminds me of a situation I was in that was quite similar. Boss 1 came into Job 2 as I was working Job 2, absolutely ripped me to shreds in front of whole store. Gave me the same ultimatum. Next day, gave the boss-above-her my notice with full explanation of what she did. i won't go into detail, but bc of her and her bullshit, I am never going to work there until she is let go, and I doubt that will happen bc afaik she's been there for longer than the current boss.   \n\n\nSo kudos to you, OP.",
            "“I’m not worried about whether you consider me worthy of rehire, because you’re not eligible to rehire me.”",
            "Please tell me when you walked out, that you put sunglasses on as the whole building exploded behind you.",
            "“When you’re here, you’re family…”",
            "As soon as I read Mother’s Day I knew this would be juicy. Well done! (Also a former OG host & server)",
            "Ex Olive Garden employee here! Beautifully done.",
            "You know what makes me maddest about this?  That you have a significant other, and between the two of you you need 4 jobs just to make ends meet.  So, so wrong!",
            "Good for you!!!  More people need to speak up to management.",
            "Ahhh, that story makes me feel nice.",
            "Olive Garden smells awful",
            "I was diagnosed with Celiac Disease in 2007 and haven't had Olive Garden since before that. Can't say I miss it.",
            ">When your here you're family... a very abusive family. \n\nOlive Garden.",
            "In a perfect world, every restaurant employee in the country would not show up for Mother’s Day and demand better pay. This would be my dream.",
            "See this is my problem with Olive Garden. Every time I go there they treat me like family.",
            "Any job I have either left, or been let go, or even fired from, I have never gone back to. Especially the places like Applebees and Olive Garden. I know how y’all microwave everything, no thanks. T.G.I. Friday’s had the most at like 10 microwaves. The kitchen manager, KITCHEN manager, microwaved ribs and steaks and burgers. I knew I couldn’t stay.",
            "> “Well maybe this will be a lesson for you on how to speak to your employees and how to be a decent human being.\"\n\nI somehow doubt that she learned either of these lessons from this.",
            "She will never hire someone thats using it as a second job again. She will need complete control over their finances.",
            "Amazing! If you actually said that to her you're a hero. That should put her back in her place.",
            "Interesting",
            "Do they still only let you have 3 tables? I worked there for a million years and absolutely ruled that place. Soup, salad and breadsticks can kiss my ass for the rest of eternity and I cannot stand one more joke with the cheese grater.",
            "I remember quitting my second job and just feeling so relieved that I could SLEEP. I'd been running myself ragged and just didn't have any more give a fuck in me.",
            "This is beautiful. Some managers, especially in services, tend to go on power trips. Remove that power and they are sniveling.",
            "Jesus all the stories. \n\nBeing a fucking manager at a restaurant isn't that hard. And some people seem to work overtime fucking it up. Lol",
            "Mother’s Day is the busiest day of the year at Olive Garden? Some people must really hate their mothers.",
            "I haven't been to an Olive Garden in years - not because I worked there but because it's expensive for pasta I can make at home that's just as good.",
            "\"you're too inconsistent to work here\" *quits* \"wait where are you going we need youuuu\"",
            "I wish you had told us where this is so we could actively avoid spending money there.",
            "I too quickly say things in stories that I slowly think in real life",
            "\n>Have not set foot in another Olive Garden since.\n\nI was with you all the way until here",
            "Real talk, as a white person, I don’t get all the brouhaha over their salad and breadsticks. They’re pretty shit honestly.",
            "Had something similar happen. I didn’t “need” the 2nd job but it provided a little extra cushion financially. Wasn’t worth the BS in the end. Good on you:",
            "You are an artist and made her looks so foolish. As someone who worked in the food industry for a decade mother's day is literally a day to pay off bills as a server. You left her deep in the weeds and that is hilarious",
            "But you got breadsticks and salad!",
            "But I don't understand b/c when you're there, you're family.",
            "How bad of a kid does one have to be to take Mom to OG on Mother’s Day? 😁",
            "Boil some noodles for an hour and then drown them in off-brand ketchup. Now you never need to go to Olive Garden ever again.",
            "About 16 years ago...",
            ">About 16 years ago...  \nHave not set foot in another Olive Garden since.\n\nLOL, you hold a grudge as long as I do.",
            "I also haven’t been to Olive Garden since I went “on leave” for my mental health/to focus on college. I liked it so much I never went back. Not even to eat.\n\nThat was four years ago.",
            "👏🏼👏🏼👏🏼👏🏼Bravo!",
            "Any employer who is that ridiculous deserves to get screwed. The old cliché about the employees being the most valuable asset is actually true. Unfortunately there are many people in management positions that don’t actually understand that. \n\nTurn over rates are an enormous cost to any business. Some managers either don’t get it or just don’t care.",
            "I guess Miz Manager didn't spend her day sitting on her ass in the office that day, did she?",
            "I wouldn't take a dump in an Olive Garden.",
            "Excellent!",
            "When you're here, you're family.",
            "Apparently you are not family…..",
            "I mean…you should still go there. Bread sticks are 🔥",
            ">You know Mother’s Day is our busiest day of the year, you can’t just up and quit, today of all days!”\n\nPlease take your moms to better places people. Olive Garden? For real?",
            "> if I quit the Olive Garden that I would NOT be welcomed back\n\nOh no, the horror. How can I possibly go on after being blacklisted by the illustrious and world-renowned _Olive Garden_??\n\nDo these people really not realize that they’re also low-level employees at a shitty chain restaurant?",
            "Don’t you realize how lucky you were to work for someone who has never ever been late to work? There’s so much you can learn from her! /s",
            "you fucking chad",
            "as a server at olive garden, I can say that greeting is the least important role in the restaurant where tardiness is damaging. It is a perfect second job because you don't really do much physically. Manager sounds like a control freak, it happens in every job, especially the restaurant business.",
            ">Have not set foot in another Olive Garden since.\n\nThis is sound advice for everyone, regardless of whether or not they work there",
            "Don't like the food. Never ate there again after the first time. AWFUL",
            "I had a manager asked me if I really wanted to be at my job I took an hour to think about it and said you know what you are right I dont want to be here BYEEEEE",
            "You did good.\n\nI once took a retail over the holidays (just pre-Thanksgiving through the weekend before Christmas).  I explicitly told them it was *temporary* and my last day would be the Friday BEFORE Christmas, as I was leaving for a cruise.\n\nAfter my cruise, I went to pick up my last paycheck.  They tried to keep it from me since I \"didn't give notice\".  Yeah.  That backfired.  Then the worst happened: \"You'll never be able to work for any Mervyn's store again!\"\n\n😂😅🤣😆🤣😅😂",
            "Question: what made you bring this up 16 years later?\n\nIt seems that the memory was 100% a significant learning experience that you haven’t forgotten :D",
            "My only issue with this is that you might have made things difficult for your SO who also works there.",
            "People very often quit bad managers more than bad companies.",
            "Something similar happened when I worked at Ulta. It was a second job to keep me busy in the evenings. One of the managers had a very weirdly possessive attitude about the free samples behind the counter. You were only supposed to give them to people who technically qualified, and only if they asked for them. One day, a mother and her two preteen daughters came in, got haircuts, bought a ton of make up, their total was like $300. I gave the girls a couple of free samples. They left thrilled with their Ulta experience. After they left, that manager ran over and asked me who said I could give them those samples. I told her I used my judgment and she laid into me. I quit on the spot. I was making like $75,000 a year at my other job and $11/hour at Ulta. Do you think this Ulta  job means anything to me?",
            "This brought a smile to my face. Love to see it!!",
            "👏 👏 👏 👏 👏",
            "Good on you. Fuck managers like that.  Where do people get off thinking threats and talking shit is going to make employees happy?",
            "You get a standing ovation from me 👏 whooo!",
            "...and on Mothers' Day! That's how you twist the knife...<applause!>",
            ">She told me that I’m not the type of person that can hack having 2 jobs, that I was too inconsiderate to work 2 jobs, and that maybe I should choose which job I value more and quit the other one, and that if I quit the Olive Garden that I would NOT be welcomed back.\n\n>Well you’re going to work today, right? You know Mother’s Day is our busiest day of the year, you can’t just up and quit, today of all days!\n\nYeah. Totally can.\n\n\n\n>I responded that I was aware and I did call in to let them know I would be late and that the person who answered was the person I was taking over for and that she said to take my time because she was just going home and spending the night in alone\n\nYou know... The managers job really is to keep everything running smoothly. It sounds like it was. If some colleague had complained, managers attitude would be understandable, but otherwise.",
            "As a former Olive Garden employee who had crappy managers as well, good for you. Right move.",
            "I worked at OG for 6 years. I made a lot of friends, but corporate is ridiculous and their “service standard” is a joke.\n\nPlus, you get the soup and salad cheapos that leave you a dollar after 5 soup refills.\n\n.. yeah, no thanks. I’m glad you quit!",
            "They should've known better than to talk mess right  before mother's day!",
            "YES!  Good for you. That asshat manager soooo had that coming. Bet the look on her face was priceless.",
            "When you're here, you're family.",
            "congratulations it seems you win !! any manager who treats anyone like that is not okay and should not be a manager",
            "fucking up busiest day... man i remembered decades ago when i was working as a receptionist to a tuition center. one of the teacher was so good she 'hogged' almost all of the subjects to detriment of my ex-employer, claiming that they're giving too much money to her so he decided to cut her fees. what a great choice as the teacher smiles and out of nowhere warned me and my co-worker to be 'ready' for this coming weekend.\n\nwhen the busy weekend comes, she quits on the spot, leaving all the students with no teacher for the whole day while my ex-employer scrambled to find replacement teacher for the same day to no avail. even though i had to cover some classes, but man i'm impressed!",
            "Olive garden is shoot food anyways so you saved yourself in the end",
            "Olive Garden pretty much sucks....",
            "They may have unlimited breadsticks, but you have unlimited balls",
            "Thank you for saying \"Olive Garden\" and not \"A Garden that sells Olives\" or other such bullshit.",
            "rAMEN! Love it!",
            "Good news, no millennials have set foot in an olive garden since either",
            "I used to order OG to take-out like once a week. Got tired of it after the 2nd time they gave me stale breadsticks. Like, dude, I even tip you guys $1.00 for the take-out order. Of all the things you want to cheap out on, you cheap out on breadsticks? The one thing you're known for? You're gonna lose a customer because you wanted to save like, what, 15 cents on a pair of breadsticks?",
            "Olive Garden culture is the absolute worst. I managed there for 3 years and just quit in May. I couldn’t take it anymore. My Gm literally told one of the employees to shift her priorities, scale back on her classes so that she could have a more flexible schedule for OG. Like what???",
            "Wait I get that you're banned from the olive garden but does that also include the red lobster?",
            "I hope the manager had a surprised Pikachu face when you used his exact words against them",
            "Olive Garden's food is terrible. The fucking McDonald's of Italian food",
            "r/antiwork would love to hear about this story of yours",
            "Really never gone back to olive garden? Not even for infinite pasta trough?",
            "K",
            "The fanfic sub /r/antiwork is that way -->",
            "So your manager was right?",
            "Others on here said you did the right thing. I disagree.  You stated that you called in when you were running late (kudos) but you spoke to a co-worker, not a manager. Therein lies the problem. Your co-worker did not have the authority to approve your being late. Your manager was right in reprimanding you because you cut her out of the initial situation and bypassed her authority. \n\nThat you further quit over being rightly reprimanded shows your own ignorance.",
            "OP, you should post this story on r/antiwork for some extra karma.",
            "I worked at an Olive Garden in college  I almost got fired because I was real terrible to a table on Valentines Day. It was a mother and daughter who split an order of spaghetti and drank water. At one point I just asked them are you done yet? Biggest money maker of the year and they waited 2 hours to spend $12. Of course they complained. Of course I got reamed out. Should have left right there. Good for you OP.",
            "Olive Garden is so overrated. Fat people love anything resembling pasta.",
            "Yeah. Such crazy that you and coworker don't make the rules and believe it's alright to undermine and step on management's toes. \n\nThere's so many thinking errors here you should check into therapy.. 16 years ago.\n\nDerp.",
            "There’s only one Olive Garden but a thousand different doors",
            "They do have good food though. Apparently shit management but damn can they make a good sirloin.",
            "This gave me a happy-boner. Well done.",
            "I’ve heard a lot of horror stories about working for OG.",
            "Did your S/O quit too?",
            "Damn I should buy you a steak dinner for the way you handled yourself. Good job 👍😎",
            "/r/antiwork",
            "I used to work as a host at an Olive Garden \\~10 years ago. They're a truly abhorrent company. I was late 1 time in 2+ years of employment and was written up for it.\n\nI eventually got a paid internship and left. I haven't stepped foot in an OG ever since.",
            "You win. Well done!",
            "Always quit while you’re ahead.",
            "It’s very pathetic but unsurprising how many people I know who have done this - not just in the restaurant industry, specifically at Olive Garden"
        ]
    },
    {
        "post_id": "rba776",
        "author": "UndecidedMN",
        "title": "Can't Have White Rope Lights to Celebrate Christmas - Ok, Get Ready For The Color Explosion",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rba776/cant_have_white_rope_lights_to_celebrate/",
        "score": 26534,
        "num_comments": 829,
        "created_utc": 1638913029.0,
        "selftext": "About 20 years ago, my wife and I had just gotten married and we rented a condo where all the windows and sliding door faced the parking area.  My wife, to celebrate our first Christmas as a married couple put a white rope light on the railing on our 2 foot grilling area.    It, was nice little gesture.  \n\nThat night we went out to dinner and when we came home, found a letter under our door.  The letter read \"All holiday lights must be removed immediately from the exterior portion of the condo.  Christmas or other religious lighting is against HOA policy and failure to remove can result in fines and other legal actions.\"  My wife felt horrible and I couldn't believe it.  The owner of the condo had left a copy of the HOA regulations and I found a nice little loophole.  Apparently, they could regulate lights on the exterior balcony/grilling area, but not lights inside the condo. Game on.\n\nI took my wife immediately to the big box hardware store and picked up two fake Christmas trees, about 2,000 colored lights, a light ball and whatever holiday decoration I could find.  Our condo had 3 windows and the sliding glass door.  I filled up each one of those windows with lights, crisscrossing, around the inside of the perimeter of the window and one had the led ball hanging in the center.  The sliding door had the Christmas tree in full view completely covered in lights and ornaments.  Also the sliding doors were full of Christmas lights. My electric bill must have tripled.  When you came into the parking lot of the Condo complex, you saw a beacon of light full of Christmas spirit.  You probably could see the condo from orbit. And, nothing could be said by the HOA snitch.\n\nApparently at the next board meeting, a proposed rule change was brought up to limit the amount of \"holiday lighting\" being shown through windows.  It was quietly pointed out by another HOA board member that was an attorney that you probably could not regulate activities inside a person's dwelling.\n\nI moved out before next year, but I never received another notice.",
        "permalink": "/r/MaliciousCompliance/comments/rba776/cant_have_white_rope_lights_to_celebrate/",
        "comments": [
            "These? Oh no, these are not Christmas lights. I'm atheist. \n\nThese are *thanksgiving* lights. Happy Holidays BTW",
            "I am not in an HOA, and have a good relationship with the neighbors across the street.\n\nI do not know where they lived previously, but they asked in a hushed, reverent tone, \"Do you think they neighbors would mind if we put up some decorations for Diwali?\"\n\n\"Mind?  I think they would appreciate it!\"\n\nThis was last year when everyone was really getting cabin fever.",
            "The beacons of Christmas have been lit!",
            "These are not holiday lights. I'm an avid airport enthusiast, this is part of my ode to landing strips.\n\nEdit: oh shit, encouragement! Thank you!\n\nEdits: my most awarded comment ever. I have no idea what I'm doing, and I love you all!",
            "I got a letter from my HOA that my driveway was too dirty. I threw some concentrated muriatic acid on the stains and they disappeared, leaving a inverted-stain of the acid running down my driveway. Looked like absolute shit but was objectively cleaner than anyone else's driveway. Didn't get fined",
            "Best one I ever had was an HOA notice for a brown spot in my grass during a month of 100 degree weather in the middle of a drought threatening a hefty fine if it was not corrected. I went around the neighborhood and took Polaroids of all the brown spots in the Gras of spaces the HOA was responsible for. Ended up with a few bankers boxes full. At the next HOA meeting I walked up and dumped them all on the table and told them the HOA owed the homeowners a few million dollars if fines where applied to them as well. They never bothered me again",
            "Good for you for doing that, that’s awesome. it’s insane how ridiculous some people can be. Like you and your wife just wanted a small strand of lights outside it amazes me someone would be that upset by that.",
            "What if you argued that the lights weren't put up to celebrate holidays but something else? Birthday, promotion, funeral, successful assassination,  etc.",
            "May I please be the first to say \"F#CK HOAs!\"",
            "Do any HOAs exist which don't suck?",
            "I lived in an HOA that threatened to take me to court over the color of light bulbs inside my unit. They said that it altered the exterior appearance of the building. I eventually contacted their lawyer and it was the first he heard of it and thought it was stupid.",
            "These annoyances I see like this one are the primary reason I want absolutely nothing to do with an HOA. At all.",
            "So by the wording of that rule putting up non-religious or non-holiday lighting is ok?  Like a giant swastika or an animated goatse, maybe.",
            "Good job Clark.",
            "You know I fixed my HOA? I got on the board and didn’t let any of the busybodies make stupid rules and had them replaced with my neighbors that wanted to do anything besides make new rules.",
            "who the fuck regulates against christmas lights?\n\nlike fuck whoever complained too, but imagine codifying against something harmless and basically universally enjoyed?",
            "My sister refers to this kind of decorating as a \"holiday pukefest.\"",
            "These aren’t Christmas lights, they’re safety lights.  You wouldn’t want there to be an accident because you removed a safety precaution, would you?",
            "After forcing the closure of third-party Reddit apps by charging them [29 times](https://www.reddit.com/r/apolloapp/comments/14dkqrw/i_want_to_debunk_reddits_claims_and_talk_about/) how much the platform earns from its own users (despite claiming that it wouldn't at any point this year four months prior) and slandering the developer of the Apollo third-party app, Reddit management has made it clear that they respect neither their own userbase nor operating their platform in good faith. To not reward such behavior, Reddit users should encourage their communities to move to similar platforms such as [Kbin](https://kbin.social) or [Lemmy](https://lemmy.world), whose federation with the [Fediverse](https://en.wikipedia.org/wiki/Fediverse) makes it possible to switch platforms without losing access to one's favorite communities.",
            "> My electric bill must have tripled.\n\nFucking with HOA's is worth the cost.",
            ">It was quietly pointed out by another HOA board member that was an attorney that you probably could not regulate activities inside a person's dwelling.",
            "Why would anyone prohibit xmas & religious lighting?  (And I say this as a non-religious person)",
            "Nice. I know the HOA rules might have covered this, but another loophole might have been \"Christmas or other religious\" lights.\n\n\"Oh no, you misunderstand. These are my fuck you lights. And they'll be up all year.\"",
            "There's an HOA near me that dictates the color and type of curtains/blinds you can have. You also can't park in your driveway or store a boat of any kind in your garage. Everything there is some shade of brown.",
            "I dislike the whole concept of HOA's it seems to me it is just a way for the busybodies of the world to try and exert their dominance over everyone else and be able to hide behind a shield of the organizations.",
            "Man, eff those guys.  I'm not even Christian, but I've just celebrated my 5th consecutive year of not falling off my roof putting up the Christmas lights.   Do we really want to live in a world where people aren't celebrating or spreading love/cheer?  It's just another holiday of lights, food, family, drinks, and quirky fun music.",
            "I was the one who accidentally grew a huge green shrub penis on my front lawn.  Complete with testicles.  Was there for years until snow damage castrated it.\n\nMy neighbors would have sold their souls for a HOA",
            "\"Religious lighting is against HOA policy\" - almost asking for a lawsuit\n\nIf the current \"religious freedom\" thing had been active you probably could found a bunch of people to have a protest March.",
            "Saturnalia lights my man. Don't fuck with my sincerely held non religious beliefs. \n\nI'll never live in a neighborhood with an HOA.  They all suck.  Without exception.",
            "I'm as anti-religious as it gets.  But I love holiday cheer no matter the reason.",
            "Sounds like somebody needs some Festivus Lights!",
            "r/fuckhoa",
            "And that is the best Clark Griswold response I have yet to see…I salute you!",
            "Religious lighting? \"I'm sorry, you seem to be confused. These lights are atheists.\"",
            "“In my religion, it’s a requirement that if you lit up decorations you have to also feed any neighbors that comment on it. So, anyway, nice lights. When do we eat?”",
            "Fuck all HOA’s, not anyone should be told what to do by someone else IN OR ON THEIR OWN FUCKING HOME. Motherfuck them every chance you get.",
            "My HOA has a regulation that says \"only the following colors can be used for curtains inside the dwelling. Black, White, Gray, Tan\".\n\n\n\nWhen I first moved in I replaced the old white curtains with dark blue curtains. Within a week I got a letter from the HOA stating I was in violation. I called them and said \"Hey what the hell!!\" They said my curtains were dark blue and needed to be Black. I told them they were black but looked blue from the sidewalk. They said we need to enter your place to confirm that. I told them to come back with a warrant then they can come in. Never got another letter from the HOA again.",
            "Hot take,  Christmas should no longer be considered a \"religious holiday.\" It's celebrated just as many non Christians and it's lost all connection with the birth of Jesus(which isn't even dec. 25th).",
            "Are there ANY benefits to living with a HOA? Just seems like pointless nonsense …",
            "I’d never move into an HOA.  I gotta follow enough rules as far as government goes, fuck if I’m gonna follow even more dumb housing rules by people who don’t pay my bills and don’t own my dwelling.",
            "You should post this in r/fuckhoa",
            "I'd have left them on the railing and informed the HOA that they were neither Christmas light or any other religious lighting, but simply 'lights'.\n\nI do love your way of handling it though.",
            "i’ve literally never heard the term religious lighting lol, as if jesus himself hung up a string of electric lights around his abode",
            "HOAs should be illegal.",
            "These are my December light. I just fucking love December, man",
            "INFO \n\n> I moved out before next year, but I never received another notice.\n\nNot \"we\"?",
            "i hope i never become as bitter, petty, killjoy, as that HOA snitch",
            "Oh no, you misunderstand me.  These are not Christmas lights.  You’ll notice that our nightlights stay up year round.",
            "HOA's are cults and should be illegal.\n\nI have, am, and will continue to say this for as long as I draw breath. I will, in fact, die on this hill.",
            "I cannot think of any conceivable or logical reason why a HOA wouldn’t allow Christmas lights. It’s not even a religious thing because I have an atheist friend who absolutely adores decorating her home for the holiday season and putting Christmas lights up. At this point Christmas has pretty much transcended being a religious holiday.",
            "America is so weird. \"Land of the Free... But don't you dare entertain the idea that you can do whatever you want with a house you paid for!\" I think I have to ask my mortgage provider if I wanted to do something that could negatively affect the house value, like demolishing it completely, but otherwise if I want to deck my house like the proverbial halls, with different displays for every winter festival of light, that's up to me!",
            "Could you imagine candles being banned on the Sabbath?",
            "So if you put the lights up on the balcony in January, just to be decorative and not to celebrate any particular holiday, you could leave them up all year?",
            "My parents live in an HOA and my God, I need to meet these fucking snitches.",
            "Who the hell lives in an HOA and enjoys it is what I want to know.  Have not had the (dis)pleasure myself, but it seems just fucking awful. Do people move into these on purpose or do they just not know beforehand?",
            "As an atheist passionate about first amendment rights, I find the \"religious lighting\" thing absurd. Christmas is mostly a pagan holiday first of all, secondly the first amendment doesn't require we remove culture. Religion is a part of culture, oh well. Of course it shouldn't be represented on public government lands, but I don't care how religious you decorate your private yard or home. Or rental home.",
            ">Christmas or other religious lighting is against HOA policy and failure to remove can result in fines and other legal actions.\n\nYeah, sure, try it and see how fast you get sued.",
            "/r/fuckHOA",
            "There are WAY too many reasons to NEVER live in an HOA. Biggest Karens that ever lived snoops around. They never take care of the places as well as they're supposed to anyway, and you just waste the required fees. My mom lives in one where her house is worth $300,000 and her streets are potted, nor are they even plowed as much as they're supposed to be nor as well. Total waste",
            "This is why I'll never live in an HOA.",
            "Sorry about the divorce.",
            "\"This is my own private domicile... *Grinch!*\"",
            "The whole home owners association is fuckin weird, I've never subscribed to it, I had them approach me when I moved into a neighbourhood and politely declined, at first, then aggressively declined when they started pushing me to join and said they were going to give me a fine, for playing Satan's music, told them to get fucked and if they pushed me I'd happily put satanic paraphernalia all over the house",
            "They can… ban religious lighting??? That seems wildly inappropriate and bordering on bigoted if applied to any other holiday.",
            "I would have had enough menorah, dreidel, Hanukkah gnomes, and Star of David lights in EVERY window. I F!n hate HOA",
            "My fam got a letter from the HOA that we had a broken window (it was a small crack in one pane that didn’t even go all the way through). The issue is that the window is in our backyard facing a small forested area. Nobody would be able to see the window unless you walked behind our house or stood on the other side of the trees w binoculars one (we tried it). So that was annoying",
            "Who the fuck says no Christmas lights of any kind? What sort of bah humbug complex were you in?!",
            "HOAs fuckinh suck and the people who run them can go shit a hedgehog",
            "What the fuck can an HOA even do if it's your own god damn property?",
            "Love it. Love it so much!! Who bans a single rope light lol!!",
            "HOAs: for people who don’t think federal, state, county and city governments are quite enough government.",
            "My new neighbor got our HOA to do a holiday decorating competition.  All I can say is that it's beginning to look a lot like Christmas.",
            "[deleted]",
            "This would be nicely received on r/fuckhoa",
            "Fuck HOA’s. I don’t understand why anyone would move into one.",
            "My position is that white lights are not holiday lights, they're the kind of lights you leave up all year 'round.",
            "Plot twist - the hardware store owner wrote the note!",
            "Do you have a family member or friend born on or around Christmas? \"This is how we celebrate his/her birthday!\"",
            "Clark Griswald approves",
            "You should have left the tree up year round and decorated it for all the major holidays and events..just changing the light colors and ornaments",
            "That dude literally sounds like Scrooge .. what’s his beef with Christmas lights? 🎄",
            "\"97% Upvoted\" seriously? Only 97%? How could anyone not upvote this heartwarming, feel-good holiday tale?",
            "Slow Clap.  Well done!",
            "We need to put the Saturnback in Saturnalia!",
            "Fuck HOAs and the meddling little power trippers who make it their life's mission to control other people and their property. Anyone have a pitchfork?\n\nEdit: inappropriate apostrophe",
            "HOA's are the worst.",
            "All you have to do is look in your contract you signed when buying the house and see if the HOA can put a lien on your ouse, if not, fuck em they cant do shit.",
            "I love a good HOA trolling!! Well played. Well. Played. Indeed!",
            "The HOA was being ridiculous and there's nothing religious about putting up lights anyway. My family and I are all atheists or agnostics and our big holiday is New Year. We certainly decorate for it!",
            "we had family over one time at our relatives house and they were asked to leave because their truck 'made the neighborhood look bad'",
            "You did good. I would not have been able to get to the store fast enough.",
            "Isn't there a stupid HOA reddit that this should go on too?",
            "Festivus lights!",
            "Love this.",
            "You, sir, are a hero.",
            "Good for you! From the very bottom of my heart, FUCK HOAs. \n\nNothing but petty, vindictive little nobodies wielding their tiny little authority like a cudgel to smack around anyone they don't like. \n\nI was once interrogated by a neighbor I'd never met because I had the audacity to walk to my townhouse with my dogs. She decided that since she hadn't met me, I must be someone coming in off the street to let my dogs shit all over the playground and on people's stairs. \n\nThis same person later SCREAMED at a car service driver who dared to have his car stand in our lot for a few minutes. What was he doing? I don't know, I'm not a sociopath like this lady who screamed at him and then called the cops, who proceeded to show up, question them, and then leave shaking their heads. \n\nFUCK HOAs.",
            "God damnit I fuckin love this sub.",
            "These are Festivus lights",
            "HOAs are mostly useless, but at least they had the good sense to have an attorney on board.  Otherwise they likely would have had to raise dues in order to pay for dumb decisions.",
            "Fuck the HOA. It's the least American thing I've ever heard of - a non government body that tells you what you can and cannot do WITH YOUR OWN FUCKING PROPERTY! How is this so widely accepted yet America does not have a functioning public health care system?? You need to sort out your priorities.",
            "Would suggest crossposting to r/FuckHOA",
            "[deleted]",
            "I pity anyone under the rule of an HOA. Owning my first home has brought me such joy and freedom, can’t imagine some fucking Karen telling me how I can and can’t use my property.",
            "Fuck HOA's",
            "“Religious lighting” wtf is wrong with people",
            "These are not Christmas lights, they are New Year lights that I didn't take down from last year.",
            "HOA’s bring out the petty dictator in certain people that only need a little bit of power to activate.",
            "Clark Griswold sheds a happy tear, well done.",
            "Our HOA was literally run by Karen. The most vicious power hungry busy body on the planet. So glad we swapped homes with the MIL.",
            "I live in a house with no HOA so I don't have to deal with shit like this and I don't even like Christmas decorations but if someone would complain about a minor decoration like this I would seriously consider going full on US suburbia with decorations just to spite them.",
            "Pfft, it's not Christmas lights. It's illumination for the alien helipad.",
            "Some people have an excess of Bah Humbug...",
            "You are the best kind of husband 🤣",
            "Well fucking done OP. I’m a condo manager and these rules and the boards sometimes are so ridiculous and the power trips are senseless . \n\nGood for you that you moved out. I WILL NEVER BUY IN AN HOA OR CONDOMINIUM. I suggest you don’t either...",
            "how...just HOW is literally every single HOA run by a power tripping piece of shit",
            "They are my nightlights. Im scared of the dark🤣",
            "Christmas is a birthday celebration. So candles and lights and happy birthday signs.",
            "Listen... I am no longer a Christian but its stuff like this that gives Christians ammo to believe there is a \"war on Christmas\". Just let people have their lights... ffs.",
            "r/fuckhoa would like this."
        ]
    },
    {
        "post_id": "awauwb",
        "author": "kalebislame",
        "title": "Friend brings in dads ashes because teacher demands to me meet his father",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/awauwb/friend_brings_in_dads_ashes_because_teacher/",
        "score": 26527,
        "num_comments": 549,
        "created_utc": 1551480936.0,
        "selftext": "So my friend Talon's dad died about 5 years ago. They got him cremated, so Talon has an urn with his dad's ashes in it.\n\nOne of our teachers was mad at Talon about something (I'm not sure what) but the teacher demanded to meet Talon's father. He tried multiple times to tell our teacher that his dad, was in fact dead. But Mr. McCunt wouldn't listen to him.\n\nSo the next day, Talon shows up to school with his dads urn and plops it on the teachers desk and says \"You wanted to meet my dad, so here.\" \n\nI have never seen a teacher so mortified in my life.\n\n\nedit: it's not that Mr. McCunt didn't believe him, it's that he didn't give the kid an opportunity to explain. He just kept interrupting and sent him out.\n\nedit 2: obligatory \"wow this blew up\" \"thanks for the sliver/gold\"",
        "permalink": "/r/MaliciousCompliance/comments/awauwb/friend_brings_in_dads_ashes_because_teacher/",
        "comments": [
            "If he still needs to talk to him, bring in a Ouija board.",
            "This reminds me of a story that was posted here some time ago. This took place in England I believe.\n\nSome government agency notified a woman that they were coming around to take some information or other from her mother. The woman repeatedly tells the agency that her mother is deceased. They still insisted to pay a visit to the deceased mother. The woman said fine. When they came to the house, the woman had the government employee sit down and showed him the urn.",
            "“My dad isn’t a big talker, but he is a great listener”",
            "Kinda similar, I had a teacher who yelled at a kid in the hallway because he was wearing a hat (against dress code). The kid tried to tell her he had a pass to wear hats. She called bullshit and asked why someone would get a pass to wear hats. He yelled to her across the hallway \"I have cancer.\"\n\nShe never called anyone out on dress code again",
            "Not as mortified as the Dad though.",
            "Thank God Talon's father wasn't buried.  That would have been a huge mess.",
            "To add as a revenge story he should have walked around the school with it all day and told every teacher who asked \"Mr X insisted on meeting my dad so here he is\"",
            "As a young person with a dead father, I can confirm that pulling shit like this is one of the only perks. ",
            "Why wouldn’t Mr. McCunt (or anyone, for that matter) believe Talon when he said his father had passed away?",
            "Honestly though. Whether or not talon was lying, how is the teacher winning that argument. Either way a grown adult is arguing with a child for no reason. ",
            "When I was 16, I was at a friend's house, and he pulled out a tub full of an off white substance. He opened it and put it in front of me and said, \"smell this\". Right when I do, he slaps the side of the tub and I inhale some of the dust that got stirred up accidentally.\n\nHe starts laughing uncontrollably and says, \" you just inhaled my dad.\"  ",
            "Please tell me you remembered to anonymise Talon's name.",
            "My dad died right before I graduated high school in 2015 and my step dad died this last Saturday, right before I will be graduating from College. So this post honestly gave me a good chuckle. But it also pissed me off. I can not stand teachers/professors that demand proof of a dead parent. My mom and dad divorced when I was 6 months old and my mom and step dad had been together ever since. I’ve had to prove their deaths twice now and it blows my mind. It’s the last thing I want to do. Who wants to google an obituary and print it out to bring to class? Especially in a time like this. I get it that anyone can say their parent has passed, but in all honesty who in high school or college would even mess with that sort of lie? God it’s so frustrating. ",
            "Had the opposite happen to me, bank phoned me to inform me that I was listed as deceased in their system, and wanted to double check...",
            "[removed]",
            "My grandfather died while I was still on active duty in the Navy. He'd been a sailor himself, and his will requested that he be cremated and tossed out into the ocean. I had been sent home (my ship was in Saudi at the time) to attend his funeral, and everyone figured that since I was going back to an ocean-going vessel, I should take care of the latter part of his will.\n\nSo I got to take an unadorned cardboard box with me on a trans-Atlantic flight. Inside was a sealed plastic bag, containing several pounds of ash and what-not. As I was passing through customs in Saudi, the box went through the X-ray and came back as just a big blank space. So, naturally, the customs agent got suspicious. (Bear in mind this was pre-9/11.)\n\nHe told me to open the box, and I refused. When he insisted, and I didn't back down, he asked me what was in it. My reply: \"My grandfather.\" He clearly didn't expect this, and had to call in his boss and chase down someone with a better grasp of English. Took a couple hours, but when I finally got someone to understand what was going on they let me through without any more hassle.",
            "Something something hes an urnest man. ",
            "I would start talking to the urn and act like I’m getting yelled at and being interrupted make a big ole scene. “IM SORRY DAD ITS HIS FAULT FOR SUMMONING YOU FROM BEYOND! DONT HURT ME, PLEASE GO BACK TO YOUR REST!!!!”",
            "say hi to my dad.... BEYOTCH!",
            "I had to do that when a petty bureaucrat kept insisting that I needed my mother's signature on a document. Apparently, the idiot had no idea what a death certificate was. I plopped her on the counter and told him, \"here she is. Go ahead and hand her a pen.\" \nTurns out, the signature wasn't actually required. ",
            "[removed]",
            "This very sad but Talon is a fucking metal name",
            "There arnt many things more frustrating than having someone older then you who ignores and interrupts you or doesn't really listen to what you are saying. I work with some people like this. I get to the point i dont even want to bother having a long conversation with them.",
            "Upvote for correct usage of mortified!",
            "One of my teachers in high school thought one of my classmates with skipping class because he claimed his grandma had just died. The teacher demanded proof, so he took a photo with her in her casket and brought it to him. The teacher was very careful about accusing students after that.  ",
            "I'm quite certain I've heard an almost exact variation of this story on here before. ",
            "Talon is one badass name",
            "Amusing story but I call BS. A teacher would not ask the child who is in trouble to set up their own conference. The office would have contact information on file and parents or guardians would be contacted directly. I think this is an edited repost of a story from malicious compliance. There was a utilities company that refused to make changes to the account without the owner who was dead. So they brought in the ashes. ",
            "This reminds me of when my friends and I were driving around being dumb teenagers and a cop pulled us over. He told us all to get out of the car, but one of our friends was in a wheelchair and couldn’t. The cop was screaming at the guy to get out, and we kept saying “he can’t! He can’t!” And finally the cop pulled his gun and I yelled out HE CAN’T WALK!\n\nThe cop got embarrassed and let us go after that. I can’t even remember why he pulled us over ",
            "‘‘Twas the name mr. McCunt that truly earned the upvote, story matched the sub perfectly but damn that name will forever be etched in my mind",
            "I did that with my son's ashes. My first born male child that someone flippantly asked for to do something. I'm not welcome in that establishment anymore. ",
            "Yo, so is there a way you could describe the look on the teacher's face? Maybe,\"Like a deer in headlights\" or something? I'm very curious what THE FUCK someone does when a corpse jar is put on their desk.",
            "K but what did he do after? He just looked mortified and then said what? ",
            "But them the teacher refused to believe him and assumed they put some wood ashes in a random vase and throws the poor kid's dad away",
            "Talon? Really? Lol",
            "Amazing this punchline still makes it to the front page. How many different dads ashes stories are there?",
            "Whoah, my name is Talon and my dad also has passed away. I had to do a double take to make sure this wasn’t me lol",
            "Your story reminded me of a story of my own.\n\nMy dad was cremated and my mom feels weird about displaying her dead husband on the mantle, so his urn is in the front hall closet (he would have found this placement hilarious). So one day, a good decade after his death, my mom answers a spam call that asks for my dad. She started to say \"I'm sorry, he's not unavailable\" but gets cut off from Spammer. When he finally lets her get a word in, she says \"Fine. Give me a second and I'll put him on the phone phone. I just have to dig him out of the closet first\" and slams the phone down.",
            "McCunt.. I snort laughed. ",
            " I had a friend named Talon. Unique name in my personal experience. ",
            "Yeah that's a pretty good way to make someone shut up...",
            "Man it's so rare to hear about other talons's (I'm not exactly sure how to make it a plural) ",
            "This is worthy of a show on Comedy Central! Comedy gold!",
            "Not sure what irks me more about this\n-the fact that the teacher was insensitive enough to ignore a kid explain this FIVE TIMES\n-the nerve of the teacher to be mortified when it turns out true",
            "Wouldn't the teacher call home instead of telling the student to bring him in?  Also,  teachers are informed of the death of a students parent. ",
            "Got you to 700 my dude",
            "I swear I've heard this story before but I'm not sure where ",
            "Story would be even better if the dad was buried instead of cremated.",
            "Heheheh. \"Mortified\"",
            "He should've brought the Urn into the office so the principal could over hear their conversation.  ",
            "I have to try this",
            "I think I saw a story like this before but it went way worse. The teacher flipped out and got the principal and everyone involved.",
            "He should have brought him a cup of instant cocoa, had him take a sip, and then (jokingly ofc) say that it comes courtesy of his father.\n\nBut seriously, fuck the kind of person that demands an explanation but constantly interrupts and calls every given reason \"just an excuse\". I hope he gets a case of the fiery shit squirts during one of his classes.",
            "This is unrelated and off-topic, but when I was around 16 I signed up for a martial arts class and told everyone my actual name was Talon, nobody even questioned it.\n\nUnfortunately my sifu had a really strong Hispanic accent and could not pronounce it properly, he always called me “tay-lon”.\n\nTotally backfired. -_-",
            "Another bites the 'Dust'",
            "Why specifically is Dad?",
            "This is just paraphrasing an older \"dad's ashes\" story... Frankly I'm not buying it",
            ">edit: it's not that Mr. McCunt didn't believe him, it's that this is a common trope on reddit and I forgot this part of the story, which trades in orphans' grief for karma.",
            "I knowI probably shouldn’t be laughing, but...",
            "Yeah that's a \"100 percent deffinatly happened\" for me",
            "I frequently got accused by teachers of taking too long in the restroom. I offered to take pictures of my number 2 next time as proof. The accusations stopped thereafter.\n\n&#x200B;\n\nEDIT: words",
            "And then the whole class cheered and he found $100.\n\nNeedless to say he’s not a vigin anymore ;) ",
            "When I went to pick up my dad's ashes from the crematorium, I put them in the boot (trunk) of the car because I didn't particularly want to be anywhere near them.\n\nI always imagined that if I'd have been stopped by the police on the way home, I'd have said \"Officer, I feel compelled to let you know I have human remains in the car\" and see what happened.\n\nAlas though, it was not to be. ",
            "Buuuulllllll shiiiiiit!!!",
            "I honestly don’t believe this happened. Or if it did the context isn’t sufficient. You don’t need to prove it’s right I don’t care. It’s just ridiculous that someone wouldn’t believe someone if they said their father was dead",
            "your friend has style",
            "/thathappened",
            "Petition to stop people from editing posts after the fact to answer to naysayers. This is a democratic website and \n\n#THE PEOPLE \n\nshall decide",
            "This was a perfect time to film, I would pay good money to see that teachers face",
            "Ok no that's just bad teaching I mean I'm pretty sure a school should/would know if a dad wasn't in the picture especially a dead one so that's on the teacher for not letting him explain",
            "r/prorevenge",
            "Talon is a real name? That kid on Jamie Kennedy’s New Year’s Eve in LA like 7 years ago really was named Talon? ",
            "This was the perfect way to say “I told you so!” to that insensitive teacher. I love it!",
            "Talon?",
            ">I have never seen a teacher so mortified in my life.\n\nImagine if this happened in front of other students and parents?\nBeing mortified would be the least of his worries.",
            "I hope the teacher's guilt level is over 9000...",
            "Your friend is called Talon? ",
            "Talon is a really cool name. I've never met someone who was named Talon.\n",
            "Lmao, well done by your friend.",
            "why would the teacher be mortified at a free meal",
            "This has to be one of the best titles this Sub has had.",
            "[Word cloud out of all the comments.](https://i.imgur.com/1x6LBRT.png)\n\nFun bot to vizualize how conversations go on reddit. Enjoy",
            "This can also be seen as a revenge post lol",
            "[Life imitates Art](https://www.youtube.com/watch?v=gm5fVx8vbu0)",
            "One of my children was asked to interview a family member who had come to Australia. As parents whose ancestors came to the country in 1864 and 1856, I asked the teacher which relative they would like me to dig up so that my child could interview them. Teacher still didn’t get it and suggested another teacher who was a newish arrival."
        ]
    },
    {
        "post_id": "e2k1jx",
        "author": "tortellini21",
        "title": "Allergies are not important to The Home Depot.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e2k1jx/allergies_are_not_important_to_the_home_depot/",
        "score": 26517,
        "num_comments": 769,
        "created_utc": 1574878266.0,
        "selftext": "Edit: reddit doesn’t allow me to change the title of posts. I do not want to cast any slander towards the Home Depot. The title should probably read this: “Bob Doesn’t care about your allergies”\n\nthis happened about 5 years ago, and I haven't been to the home depot in question in a long time. Names have been changed for privacy.\n\nIn high school, I was working at the local home depot as a head cashier. I kept track of all the active registers and made sure things ran smoothly. I held this position for quite some time (1-2 years) and enjoyed it pretty well. Customers were nice, and my coworkers were mostly craftsmen and gardeners, all with interesting stories to share. \n\nbefore we go further, let me explain something. I am allergic to nearly every form of pollen. I mean EVERY form. I take allergy medication, but even then if I am in close proximity to flowers for too long (>30 minutes) I will begin to break out in hives and throwup most of the time. \n\nso after about three months working in the winter, the spring season was upon us (the worst season for my allergies). \n\nOne day, about three of our garden section cashiers called off sick. They are pretty reliable people so I had no problem finding people to cover for them. As I come to my manager to inform them of the position changes, my manager looks at me and says \"You can handle the garden section on your own, can't you?\".\n\nI inform my manager that I could cover it for at most 15 minutes before my allergies flare up and ill have to leave. \n\nhe states \"we don't have any documents on file that state you are not fit to work in the garden section, so unless you come to me with a doctor's note stating your allergies, I couldn't give less of a fuck.\"\n\nI don't know who shit in his cheerios that morning, but I complied, saying \"I want to be sure of what you are asking, you want me to work in a section which is hazardous to my health instead of placing equally capable employees in that section?\"\n\n\"Did I stutter?\" he said\n\n\"Ok, sure,\" I said\n\nI make my way down to the garden section, and immediately my eyes are stinging. I decide that I am going to stick it out for my boss's sake, no matter how shitty my service becomes.\n\nthe first 10 minutes are pretty uneventful, but then a customer asks me about the rash on my arms\n\n\"The Home Depot does not care about allergies,\" I say \"as I do not have official paperwork\"\n\nthis customer looks extremely concerned, asking for my manager's name.\n\nat this point, I was feeling nausea hit me, I throw up in the trash can at the register, turn back to smile (as well as I could) and say \" I work under Bob \\_\\_\\_\\_\\_\\_\".\n\nThe customer reassures me that I will be ok, and tells me I should head home. Turns out, this guy, Nick \\_\\_\\_\\_, was a higher-up at the home depot's regional management and was my boss's boss. So, naturally, I comply with the chain of command and head to the locker room to pack up.\n\nAs I am packing, Bob \\_\\_\\_\\_\\_ comes in, fuming and cursing, telling me I have no right to leave yet and that my shift is not over for another 5 hours. \n\nI simply say \"Nick \\_\\_\\_\\_\\_ told me to go home\"\n\nBob's face gets redder as he threatens to fire me, saying I was lying and tells me to go back out.\n\n**I comply, knowing that I will see Nick on my way out.**\n\nI pass nick, still in the orange apron, and he asks me where I am going. I say that Bob told me to go back to work. Nick's expression goes from concerned to furious, as he takes my apron from me and tells me I'll be paid for the full shift and to go home.\n\n&#x200B;\n\nI come into work the next day to see that Bob's nameplate has been removed from the office. I ask our HR rep what happened, and apparently, after I had left, Nick stormed Bob's office and proceeded to perform an audit on all of his past employee complaints. This guy had been throwing out complaints for the past **5 years**. Needless to say, there was an opening for the store management position, and I was given a week's vacation for my troubles. My satisfaction was huge.\n\nEdit: I realize now that the title may look like I am putting down Home Depot. That wasn’t my intent, I just wanted to recount my experience.",
        "permalink": "/r/MaliciousCompliance/comments/e2k1jx/allergies_are_not_important_to_the_home_depot/",
        "comments": [
            "Yup you don’t mess around with people health. What Nick did was spot on.",
            "> This guy had been throwing out complaints for the past 5 years. \n\n*Winces*  Ouch.  Somebody definitely deserved the sack.  Depending on how his contract was written, he could easily be worse than 'merely' fired -- that kind of malicious incompetence could leave the parent company open to some massive lawsuits.  Hopefully that was the end of his career as a manager.",
            "TBH you got lucky that your second-degree boss happened to show up in your line when he did. How well would it have gone over to require Bob’s demand in writing before entering the Flowerdome?",
            "having worked in the big orange box for nearly half a decade myself, across 8 different stores, I can confirm that this is sadly not an isolated incident.\nwhile it is not the way most managers do things, it is sadly far too common.",
            "Have you heard of [sublingual immunotherapy ](https://acaai.org/allergies/allergy-treatment/allergy-immunotherapy/sublingual-immunotherapy-slit)  (SLIT) for allergies? I moved from the northwest to the Midwest & found out I’m allergic to pretty much everything out there after getting tested for allergies. I could take allergy medicine, or my doctor said I could try allergy treatments where I either get a weekly shot or take daily drops under my tongue.\n\nI opted for the drops since it’s more convenient for me. They make a custom mixture of my allergens so I slowly build up an immunity. I’m about 6 months in & it seems to be making a significant difference.\n\nMight be something to consider so you don’t have to feel miserable a good chunk of the year. If you can start soon, you may have built up a bit of an immunity by the time allergy season arrives.\n\nSucks you had to deal with that shitty boss & glad it had a happy ending for you!",
            ">Did I stutter?\n\nPunchable boss.",
            "[deleted]",
            "This budding story bloomed into quite a read, but always get stuff in writing like that! Never apollengize",
            "i feel like I missed a thing here. how can you audit employee complaints If bon has been throwing them out?",
            "Home Depot really does not care about its employees physical health. I worked there in the flooring department for over a year from when I was 18-19. I broke my back and my neck when I was 16 so I had some trouble moving the large cases of tile. I brought in a doctors note stating my injury and that I could not lift anything over 50 lbs but my managers did NOT care. They continuously gave me those tasks because I was the “young” one and I couldn’t possibly have a back as bad as them. They then denied my department change request to 3 different departments even though I was trained and covered in those departments for lunches. \nIn another event, I had accidentally rolled over my right angle with the electric ladder machine after slipping on some dust. My was swollen like a balloon and bleeding and I was told to finish my shift and stop complaining. I wasnt even given a break to stop the bleeding. \nEventually I left the company and went to work a desk job because of how brutal it was. \nFuck Home Depot\n\nEdit: Forgot a letter",
            "[removed]",
            "No offence meant, but how does someone in high school become head cashier, organising shifts, for a a big store like Home depot?",
            "What year were you in high school? I use to be an operations manager at Home Depot (I left the company five years ago) so I know they don’t hire anyone under 18, even for seasonal work. \n\nAlso if you were the head cashier and knowing you’re allergic to pollen, wouldn’t it have been easier to send your other cashiers out to garden, rotating them every hour or two, and take over the lumber door registers or even self check out (that way you could still be close to the cash drawer if someone called for cash?) \n\nSeems that there was a much better way to handle this situation than putting your health at risk.",
            "[removed]",
            "Bob Saget and Nick Nolte?",
            "I had a miscarriage and they wouldn't even let me sit without a doctor's note which, by the time I got one, i wouldn't have a need to sit anymore. Fuck them.",
            "[deleted]",
            "An audit determined 5 years of *missing* documents, in a single day? And resulted in a summary dismissal? \n\nMy money is on them having an audit in the works for a while prior to that, corporate wheels don't turn that fast.",
            "[removed]",
            "Your post is much more entertaining if I use a valley girl accent in my head.",
            "[deleted]",
            "Bravo Nick!",
            "[removed]",
            "It was Nick Fury, right? Tell me I'm right!",
            "> I mean EVERY form. I take allergy medication, but even then if I am in close proximity to flowers for too long (>30 minutes) I will begin to break out in hives and throwup most of the time. \n\nThis seems like a very severe and general case, I used to have bad allergy from birch pollen for example. In such a severe case I'm a bit baffled that you would not have informed your employer about this reactivty or even danger to your well being.\n\nImho Bob was of course wrong how he handled it, but he does have a point when he mentioned that there was no record of such allergic reactivity. Maybe something you want to hand in so this does not happen again.",
            "[removed]",
            "[removed]",
            "[removed]",
            "I want to be leaf",
            "[removed]",
            "Maybe don’t work at Home Depot or Lowes or any other place that sells flowers if you are extremely allergic. I worked at one of these places many decades ago as a cashier and customers would go to garden first sometimes and so they would end up checking out at the regular registers. You can’t completely avoid flowers at Home Depot/Lowes/Albertsons/Kroger/Stater Bros/lots of places, but there are places you can work far away from your serious allergy.",
            "Yeah, Home Depot still has this rule.\nSource- I work there and cannot be in direct sunlight for too long. They still make me go out to garden and I try and hide from the sun as often as I can. I don't have time to get a doctors note and seeing as I just started, I dont want to be a nuisance.",
            "Why did you apply to home depot when you have such severe allergies? Didn't you know that most home depot stores have a gardening section and you will cross paths with the products at some point",
            "[removed]",
            "this is the stuff that happens in movies\n\nwow",
            "[removed]",
            "My wife is deathly allergic to nuts. She is so allergic that even smelling them can start a reaction that could close her airway.  A co-worker has refused to stop eating nuts on the sales floor. This is a big outdoors company so she went to HR which they said they addressed it with him. Dude goes on to text coworkers about her being a snowflake and planned to bring in more nuts or fake nuts to force her to quit. Another co-worker reports this to HR. My wife finds out and asks her boss to switch her scheduled shifts so she doesn't work with Mr. Peanut. Her manager screamed at her about how she isn't his priority. HR won't do anything because they can only act when the guy brings nuts in. I'm worried about her health so I am trying to get her to quit though we need the money. I am at a loss for what she can do since I think no laws have been broken. Sucks worrying that some dumbass could kill her just because he doesn't want to change his own ways.",
            "My ex worked at Home Depot for a few years. Your manager sucked donkey balls. My ex had mostly good experiences there, was rewarded for his hard work (raises and moved up from part time to being Asst. Manager), and enjoyed the job until he was the Asst. Manager. His old store manager found out his wife was having an affair with another store manager, and he was given 6 months leave work work on his marriage, and the 'other' manager was fired. A shift lead was found to be having an affair with an Asst. Manager, and the Asst. Manager was fired.\n\nAll that said, you would think my ex would have learned the lesson here. He didn't. He was fired when his side chick's husband reported their affair to the store manager.\n\nYes, he's my ex. Unfortunately also the father of my daughter. At least he's *her* problem now, and I can ignore him when he's being stupid.",
            "**Now call Nick and ask if you can apply for Bob's position**\n\nShow dominance.",
            "Good on Nick for fixing issues when he found them, but I feel like he should have had Bob's ass years sooner.",
            ">\"Did I stutter?\" he said\n\nYour brain sure as fuck did...",
            "Worked at THD with a co-worker who had Krohn's disease. Was threatened with termination because of \"too much time spent in the bathroom\", doctor's note be damned.",
            "If anything it sounds more like praise for home Depot higher ups. Good on him for knowing shit management when he sees it.",
            "I love how you referred to home depot as if it were a person. The Home Depot does not care about your allergies. The Home Depot only cares about sales. The Home Depot says I must work the garden section.",
            "Working at Home Depot now. It’s fuckall over here",
            "[removed]",
            "[removed]",
            "[removed]",
            "Did you mention when you were hired that you may need accommodations made? Yeah I’m being that guy, but working in a place with a huge gardening department seems pretty dumb for someone with allergies without mentioning during the hiring process—as then you would have had the proper paperwork already on file—or been told to look elsewhere. Your manager was obviously a prick, but you could’ve done a bit to avoid the ordeal yourself.",
            "I am a current employee of the big orange apron. One spring I had a sudden break out to a plant and had to be brought in because of the intense pain. However, we were so busy that I had no idea what plant caused it.\n\nTwo days later, I see on my schedule I'm out there for a week straight and they just shrugged and said, \"have these shitty gloves that you have to keep taking off to handle money lol.\"\n\nI had seven break outs in two days before figuring out what exact plant it was. I had to see my primary three separate times and fill out dozens of forms before they accepted I can no longer work outside.\n\nThey still try, but I just say \"read my paperwork\" and ignore them.",
            "That's one if the things I liked about working at The Home Depot. It may take time, but assholes get stamped out instead of succeeding.\n\nThis is such a satisfying story.",
            "Did u add Bob \\_\\_\\_\\_\\_  to list of ur allergy?",
            "r/bossesbeingbros",
            "I too work at THD and I'm a very valuable employee since i have all of my machine licenses (I've been told by HR not my opinion). I have a good reputation with my managers too, since I've been there for a while, can't not be busy, and my dad is a contractor and one of their top customers.  We recently got a new manger (we'll say judy, the new marketing manager).\n I was the only person in my department at the time and my supervisor told me not to stay late since i opened the next day (6am i hate mornings). I had about 9 bunks of drywall to move with the forklift in and out of the store, they come in 36 sheets. \n Judy decided to lock the one large door I use very frequently, which meant i had to wait 30 minutes for her to stop her power charade and unlock the door not 30 second after i told her the head cashier was coming to unlock it.   I had to stay 45 mins late no one was happy with her. \n\nAll of my other managers are amazing people, i love THD as a company, in every store there's always just that one manager.",
            "I also worked for Home Depot, albeit for only a short time. But just in that 5 month span, I can tell you management at your store isn't the only one. Management at my store was the exact same and couldn't give too shits about their employees. They got paid way more than they deserved.",
            "So sorry you had to go through that! How fortunate that Nick was there at that time. Thanks for posting!",
            "First time I have heard of a corporation actually doing the right thing",
            "I don’t know why everyone is doubting this story; I’ve worked at Home Depot and it was legitimately the worst job I have ever had and I have worked in some really bad work conditions. Terrible management; racist asshole bosses; low pay for hard manual labor (you are better off finding a job landscaping, you’ll make more per hour for the same amount of manual labor); the same music (20 songs) plays repeatedly in the store; I could go on and on about how awful this job is.",
            "Okay one thing here, prolly shouldn’t say Home Depot doesn’t care about allergies. Bob doesn’t care about allergies. This is like a news headline gone wrong.",
            "Reminds me of when I worked fast food and boss wouldn't let me leave to go to urgent care when a hot liquid got spilled on my arm and wanted me to continue to work drive thru and washing dishes but customer complaints about seeing my burns as I took their payment/ handed them their change got my manager to relent and finally let me go to a local walk in clinic",
            "The Home Despot",
            "I have allergies to everything. I don't get hives. I get a rash days later and it lasts weeks. I also usually always develop sinus infections from my dad's guava tree every year. I have asked him to cut it down because the fruit rots and I get sick. He refuses.\n\nSide note: Does this mean I can work at PetsMart in only the kitty only section?! I'm allergic to dogs and hay/wood bedding, but not kitties.",
            "This is a delicious MC... nom nom nom",
            "This was very satisfying to read.  Thank you.",
            "This shit would never go down at Lowe's",
            "[removed]",
            "Has allergies...works at a home and garden store.\n\nCan’t swim...works as a lifeguard",
            "I absolutely believe this, I worked for Home Depot on and off for years before I eventually became tired of the horrible management. Management is known for ignoring their employees well being. I couldn’t stand it anymore.",
            "\\> Needless to say, there was an opening for the store management position \n\nDid you apply for it?",
            "> there was an opening for the store management position \n\nAre we to assume that you are the one who took the position?",
            "As a former employee of the Home Despot, I can confirm they give about as many fucks anout their employees as Walmart or Amazon, which is to say approximately zero.",
            "I won't defend Home Depots behavior because it's ridiculous, but I will say that it's a good idea to get those things on record, if for nothing else than if you have a reaction and you're incapacitated, you want them to have a record of what you have \n\nNow, personally, I work with a lot of unions and the labor agreements basically stipulate you have these things on file and the employer is required to make reasonable accommodations, but if you don't file something it's your problem and the employer isn't required to do anything",
            "Honestly, the boss has a point. Why don’t you have you allergy on file if it is this severe??",
            "If I was the manager I would have given you leeway and let you stay away from the garden section and give you ample time to get medical documents to prove your conditions",
            "I'm going to rain on the parade and say, you have a known health issue, so a place that hosts a garden section, is really not a place you should work. Nut allergy folks are not going to work at some eating places or a nut factory.",
            "Really though, if you work somewhere with a garden section, and are very allergic to it, you should give them a doctor's note, because if they just take everyone at their word some people will take advantage of it to avoid work they don't want to do.",
            "This sounds like a typical home depot story except for the happy ending.",
            "I recently called a store manager at homedepot. about the scented pine cones they are selling for the holidays. The imitation cinnamon and perfumes give me a nasty headache and nausea. I informed him that people like me have issues with these scented items and I felt he genuinely cared and told me he will bring it up in the next meeting but can not promise the product would be removed. And I said that’s understandable but there was scented pine cones at every single register and throughout the store. \nLater on when I made another visit to the store I noticed that the cones were in the garden area and the registers were clear of the cones so I could get my materials without getting sick. \nGood job Home Depot.",
            "I mean isn't someone with a pollen allergy getting a job at home depot like someone with a seafood allergy getting a job at a fish mongers?",
            "Technically, while he was an asshole, Bob was correct legally (initially, at least). If you don't file the ADA paperwork, they don't have to provide you any kind of accommodation.\n\nYou really should file that paperwork. If for no other reason that if you ever run into another asshole supervisor, you'll have grounds for a massive lawsuit against a company with very deep pockets and very smart lawyers.",
            "Way to go, Nick. That fuckin' asshole Bob could've been responsible for someone's death eventually, because some folks are DEATHLY allergic to things like that, not to mention all of the potential lawsuits from his behavior. Smh good thing he didn't last.",
            "Bob Nardelli? heh",
            "Ah, Home Depot. They aren't very respectful of women in general.\nhttps://www.bostonglobe.com/business/2019/09/03/women-are-facing-massive-increase-hostility-workplace-author-metoo-era-study-says/idjrymGJnMFvNANUO9seHM/story.html",
            "Sorry, but this is a bit irrelavent to the story.... I've never seen a red star given to a person. What is that!?",
            "So let’s be clear.  Home Depot cares enough to fire the jackass responsible, and give you vacation to recover.  They did the right thing, In Spades, once they realized what was happening. Kudos to them",
            "People doesn't know the importamce of an allergy till they have it. When I didn't know I have allergies I thought it was only sneezing and coughing (was a kid, probably 13 yo). Till one day I got my lips swollen and my worst scenario ended going to the hospital and almost dying for a stupid nut... (go for the jokes?)\n\nI hope the tolerance of the allergy gets better for you if possible!",
            "I just wanna confirm that Home Depot itself is pretty decent, but they hire some *assholes*.\n\nMy manager came in wanting to kill the kids workshops, fire anyone over 45 and hired a whole lot of attracting late teens to early twenties girls with no experience whatsoever.\n\nFuck you Paul.",
            "Damn that's crazy. Were you a minor when this happened? My old stores wouldn't hire those below 18",
            "I read this sitting in the garden at the Home Depot where I work.",
            "they have you a week vacaton which means you could have sued for a years worth because that guy was throwing our complaints and they never caught it.",
            "Man, and I thought my allergies were bad. I do relate to an extent, though.",
            "This is borderline prorevenge.\n\nWell done!  Always look after yourself.   Its unlikely others will.",
            "Lowes was like this when I was running 104 degree fever.   Dizziness caused me to fall on some scaffolding and get hurt af.",
            "I’m glad someone realized what pain and discomfort you were in and handled it. I hate that you had to deal with that though even for the hours you did.",
            "r/itoldyouiwassick",
            "Allergies my friend. All about the allergies.",
            "I thought this was going to be a shit post about my favourite store from the title, turned out the opposite so that's pretty cool.  Glad you were treated better than right, not often that happens.",
            "You did not put them down. My takeaway is that they look out for their employees but they still have some bad managers like everywhere else in the world.",
            "Don’t fuck with allergies",
            "Did you apply for the position?",
            "Malicious compliance. Satisfaction. I love it. I'm sorry you had to suffer though, but damn that was satisfying to read.",
            "That is amazing, what luck Nick happened to be the guy you talked to. There’s some justice in this world still.",
            "Shows that no matter how good of a company you work for, there's always that asshole that has to have a power trip.",
            "But what about the children?",
            "You are one lucky son of a bitch.",
            "that was awesome",
            "[removed]",
            "Good story.\n\nIt makes me wanna visit a Home Depot, now that Bob is gone.",
            "So he got promoted to customer then.",
            "That.  That there was satisfying.  Sorry you had to go through that, though!",
            "Ugh people like that just baffle me. I've had a boss disregard my health issues too, I get almost instant horrible debilitating migraines when in the homes of smokers that smoke inside (yes some people still do that in 2019...) but her reply when I let her know was \"oh we all get that, just get on with it\"... Uh no, you have probably never had a migraine in your life, that is not something you willingly trigger. -.- Then she proceeded to try to send me to 3 more homes with smokers even if she could easily have sent me elsewhere. Needless to say I quit that job very soon.",
            "Seems legit"
        ]
    },
    {
        "post_id": "pa5wtn",
        "author": "morrigan_li",
        "title": "Wife forced to give extra credit, assigns it to parents",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pa5wtn/wife_forced_to_give_extra_credit_assigns_it_to/",
        "score": 26503,
        "num_comments": 1001,
        "created_utc": 1629743690.0,
        "selftext": "My wife teaches a lovely group of kids in an area where parents are incredibly strict. The children are almost all operating within the 'A' grade range and their parents overwork them to ensure the A+.\n\nAnyways, the new school year has some parents pestering my wife for extra credit assignments. She's insisted that it is optional for her to assign extra credit and they've raised the issue up through administration to force her hand. Another teacher (who teaches the same class), gives loads of extra credit and they want their children to be on an even level. With the news that she'd have to match the amount of given extra credit opportunities, she has decided to involve the children's parents.\n\nExamples:\n\n* 5 page handwritten and legible essays about a historic event they were a part of.\n* 20 minute video interview of their opinions and experiences about certain political events while growing up.\n\nHer extra credit is just many different little assignments that take lots of time from the parents day for an extra couple points on the next exam. While she continues to assign these extra credit assignments, the participation rate has been zero.",
        "permalink": "/r/MaliciousCompliance/comments/pa5wtn/wife_forced_to_give_extra_credit_assigns_it_to/",
        "comments": [
            "This is brilliant!  I remember when my daughter was in 4th grade, I was standing with a group of parents and a girl walks out all excited and says to her mom...I got a 98%!  and her mom immediately got angry and said...what happened to the other 2%?  She went on and on and then went in to talk to the teacher about it!  Unbelievable.",
            "Extra Credit:\n\n* Research the origins of cupcakes, and bring examples of recipes to class.\n* Observe a brewery/winery/distillery's production process, and bring examples for the teacher.\n* Review the class history book for revisionist nonsense, and launch a campaign to demand that the schoolboard issue factually correct texts.\n\nEdit:\n\n* Create origami using $20 bills.  Origami will not be returned once graded.",
            "HAHA love it. Then she can cancel all the extra credit crap due to lack of participation.",
            "Oh oh I have an idea:\n\n\"1000 word essay about the importance of having a happy childhood and the detrimental  effect on child develoment  of imposing too much unecessary academic pressure\"",
            "This is the best malicious compliance I've read so far. Every kid should have a person like her in their corner.",
            "Yeah man that's how you do it.\n\n\"We want to be more involved in our child's learning\"\n\n...\n\n\"No, not like that. Not where we actually have to *contribute*.\"",
            "Damn what year does she teach?",
            "This would be right up my alley growing up. F geometry, but do a crazy interview with Dad about history? I’d be in. Lol.",
            "I rode a school bus 2 and a 1/2 hours to & from school.  I did all of my homework on the ride back-and-forth. Needless to say my pen manship got many complaints from the teacher.",
            "That's actually super meaningful and will probably be absolutely great for the parents and children alike.\n\nTo this day one of the most worthwhile assignments I had in grade school was to interview my grandfather about his life and write about him.\n\nI learned a lot about my family member. So did my mother.",
            "Savage! I love it.",
            "I’ve always added extra credit to the tests I give - it’s the same question “What else did you learn about subject x that wasn’t covered in class? How did you learn about it?”\n\nI’ve had kids make origami when we were studying Japan (learned from YouTube), give historical facts that we didn’t get to in class, I’ve even had a kid do some spoken word poetry based on a grammatical concept.\n\n*shrugs* it values learning, recognizes it doesn’t all happen in class, and adds layers to our study.",
            "“For extra credit, learn a new instrument from the following list:\n\n1) Trombone: 5 points\n2) Clarinet: 10 points\n3) Kazoo: 30 points\n4) Drums: 50 points\n5) Euphonium: 75 points\n6) Accordion: 200 points”\n\n[edit] 7) Bagpipes: instant A regardless of previous academic performance",
            "> While she continues to assign these extra credit assignments, the participation rate has been zero.\n\nNo participation?? Who could have predicted?",
            "That is a great idea it would be a good way to get parents talking to their kids about their life and history. My parents don't talk much about the events that they were around for  mostly because there isn't a natural way for them to come up this would be great!",
            "This reminds me of my experience with one of my college professors. Incredible amount of knowledge...just appalling teacher.\n\nAs a class we finally convinced him of offering extra credit. The guy offered the class to attend a lecture from one of his colleges and then make a 10-page summary.\n\nThe professor wanted us to spend three hours listening to a talk that was vaguely relevant to the class, then do a 10-page paper on something that we couldn't possibly understand to the level that he expected, all so that we could get 1 extra point...out of 100.\n\nGuess who did it out of spite and was actually the only one? Yep, this guy.",
            "I was one of those kids. Straight A's on absolutely everything I did. Sucked up new skills and information like a sponge. My parents pestered me a lot whenever I didn't get 100%.\n\nAt age 14 I was burnt out. I just couldn't keep the facade any longer. Went from straight A's to C's and D's in the span of a few months. Turned out I developed some serious depression from constantly feeling like I wasn't good enough. Still struggling with depression and never finished high school...",
            "This is beautiful.",
            "Brilliant",
            "0 participation? These people can't stand to talk to their kid for 20 minutes?",
            "> While she continues to assign these extra credit assignments, the participation rate has been zero.\n\nHuh. It's almost like these parents didn't actually want to do any of the work themselves and thought everyone else should have to do it for them.",
            "Beautiful in its simplicity and maliciousness",
            "Your wife is my hero! She refused to play those games that teachers often find themselves apart of which is pitting teacher against teacher and overworking their students.",
            "I'm very involved with my kids' schooling. I sit there while they do their homework to try answering questions without giving the answer, I follow up to make sure they are actually remembering to turn in the assignments, and when I feel like it's necessary I go to the teachers to address any concerns I have. When my oldest has been given optional work to do because she's ahead of the class I put in the time to do it because it's important and, effectively, I asked for it.\n\nI can't tell you how much I love your wife putting these complacent parents in their place. If you're just along for the ride, don't pretend that you're driving the bus.",
            "Genius.",
            "I’m apart from almost every historic event. I guess the world is my oyster!",
            "Praise be for good teachers with the mind to Call parents and administration on their bullshit the best way possible.",
            "Extra credit is bullshit. It’s another way to overwork teachers and students should just do better on the assignments given to them in the first place. Many schools/divisions ban extra credit.",
            "I remember, when I was in college, taking Eastern European History as an elective. The professor was a little old Polish man who lived under the USSR until its fall. He had a standing offer to issue extra credit to anyone who brought in a family member who could talk about their experiences with Eastern Europe.\n\nMy dad used to travel all over Europe on business when he worked for Volkswagen. I had mentioned the offer offhand one day and he started pestering me to get him scheduled to come in, so I talked to the professor and we got my dad a day to come in. He spent the whole hour talking about the differences between Eastern and Western Europe from the lens of a visitor, everything from the cultural differences (especially in East/West Germany and Berlin) to architectural differences of buildings made before/during/after the Cold War, and even how it used to be that you could tell whether you were in formerly East or West Berlin based on the color of the streetlights. It was really neat, and at one point he and the professor were just talking about Poland for about ten minutes -- my dad got to bring up his favorite irrelevant fact, that his great grandfather was born in Warsaw during a period of time where it was owned by Russia, so his birth certificate is a little unique. \n\nI got a shitton of extra credit.",
            "I have 3 children in school. My parenting idea with grades is this: \n\nEffort\n\nIts all about effort. If you are making the right effort, like after class help,, more participation,  and get a low grade then so be it. If you're slacking off and not doing the assignments or asking for extra support then that bad grade is on you. \n\nI will never expect perfection from my children because that is an impossible expectation.  I'm not perfect. Far from it. Far be it from myself to have those expectations of others when I can't do it.\n\nWhat matters is understanding of the information. However it may be.",
            "Sounds like a non union gig. Extra credit = me working for free.\n\nTry differentiating your assignments.",
            "She should make an assignment that involves going to a local national Park, perhaps one that's 40 or 50 miles away, taking pictures, collecting samples, and writing a report about their experience and what they learned about the history of the place.\n\nMake the parents spend their day driving back and forth",
            "The extra credit system makes no sense. In Norway, we have no such thing (at least formalized, I don't know what every single teacher is doing). The student get their grades based on the skills and knowledge demonstrated through assessment, not based on the amount for work they do.",
            "I just resigned from my position as a middle school teacher after five years. Not a long time, but it was enough to realize it wasn't for me. \n\nEvery quarter, I would provide 2-3 extra credit assignments and offer an extra credit question on most quizzes/tests. I would also allow any student to retake any assignment (tests included) in order to earn a better grade, provided that they turned it in on time in the first place.\n\nBut here's the thing, the extra credit assignments were always just a little bit tougher than the normal coursework. They're *extra* credit, right? So you need to show that you understand the core concepts of the material being taught, and that you're able to expand that knowledge just a little bit *extra* to complete the assignments satisfactorily. If that's too hard for you, then feel free to redo any/all other process-based assignments to review the basics of what we learned. Again, that was always, always an option. And I talked about it all the time.\n\nAt the end of every quarter, like clockwork, I would get a rash of emails from parents or requests from students asking for extra credit work. I would explain what I just told you all above, provide them with the materials, and wait. Rarely would anything ever come back, and if it did it would often be a woefully underwhelming attempt at the extra credit, showing just how little they paid attention in the first place. *sigh*",
            "Your wife is a fantastic teacher.\n\nAdmin: you should give extra credit assignments\n\nYour wife, I assume: every kid in the class is already earning an A, and their parents will force them to put way too much time into the assignment when they should be using their precious free time to relax, so no.\n\nPerfect MC.",
            "If she’s ever forced to give extra credit, she should assign the parents a 1500 word essay on the politics behind parental pressure and how parental pressure impacts the parent-child relationship",
            "I get that you are implying the kids aren't being harmed by this...but honestly this would really negatively affect me as a student. Making extra credit reliant on the parents exacerbates the performance gap between kids with supportive parents and kids without, and just knowing that my parents' neglect and total lack of interest in parenting me could cause me to miss out on extra credit would kill me inside.",
            "Bake (enough for the class) examples of cheesecake through time",
            "Those students aren't in the A range if they need a ton of extra credit. Your wife is brilliant. NTA",
            "I hope these parents know that when thier sweet little overachiever goes off to college they are very much going to participate in debauchery and crazy parties to break out of the shell they've been living in.",
            "Great! Evil parents need redemption for forcing their children o grow up too fast and not have a life. Here is your homework and yet you refuse to do what you asked for! Appreciate this teacher extraordinarily!",
            "For all those complaining that the wife is being a terrible person for playing with the kids’ grades… they’re almost all already A students, according to OP’s post. Adding more work to their load could negatively impact their grades and morale, considering it’s extra time to devote to more work. And most people with overbearing parents would probably agree: the last thing they would want is to have to spend that extra time listening to their parents talking about historic/political events. They probably already have heard “how much harder” it was for their parents growing up, and it’d get turned into an extra lecture on being grateful for the opportunities they’re being given, etc, etc. I’m just speaking from my own experience as a kid with overbearing parents would sound like the parents in this story. \n\nAnyway, IMO, extra credit assignments really should be for kids whose grades could use the boost, not for kids whose grades already sit at the top. If the other teacher’s class needs the extra credit so badly, perhaps it’s because their students are not doing as well, grade-wise? \n\nAnyway, kudos to OP’s wife. Parents asking for extra credit assignments probably don’t know that it also means extra work on the teacher’s part. Glad she could comply with their demands and still not add too much extra work to her schedule",
            "Fantastic, shut them and make them realize how shitty the work students have to do is. Sure busy work isn't a crime but the mental damage doing absolutely nothing AND it being so time consuming and exhausting has on kids shouldn't be overlooked.",
            "In our school district we have have kids drop out of band, orchestra and or choir as they are not AP courses that can get you an extra 1 point for your gpa.  My son graduated with a 4.5 on a 4 point scale and wasn't in the top 10 of his class",
            "I hate this mentality - I have exceptionally low self esteem, especially surrounding my own abilities, and ironically it wasn't even my own parents that led to that! A friend of mine in early high school, her mom was one of those parents - grades needed to be exceptional, if they weren't you bet she would talk to the teacher about it. So for 3 years I had this \"friend\" impressing on to me the importance of good grades, throwing it in my face when she got better than me, and then getting angry if I did better than her. Once her mom even called up my mom to complain to her that I didn't deserve the grade I got, because there is no way I did better than her daughter. \n\n&#x200B;\n\nWho needs confidence any way, right?",
            "Don't let your wife read and mark your post. Great tale though. 😁",
            ">5 page handwritten and legible essays about a historic event they were apart of. 20 minute video interview of their opinions and experiences about certain political events while growing up.\n\nI love it!\n\nBecause of how you've described it, I'm assuming this is an elite school which means it's likely filled with parents with money whose outlook on life is that those without money are beneath them.\n\nHaving their kids submit an assignment where the parents are interviewed and outing their bigoted views is perfect, because they don't want to say the quiet part out loud.\n\nGenius!",
            "HA HA!! Your friends is a petty genius. Play stupid games, win stupid prizes, PTA moms!!",
            "I have never been more happy to be teaching adults. I don’t know how teachers of younger students manage parents. God speed to you all!",
            "As a latch key child who struggled in school and this would be yet another blow to my self worth.",
            "These are *excellent* assignments, malicious compliance aside. I’m finishing up my PhD in history and I’m currently applying to teaching positions and working on syllabi and etc. and I think these types of assignments are brilliant. It connects students with the past (and the recent past, since their parents were involved) and it illustrates how important historical events weren’t all that long ago. I love it. Good for your wife!",
            "Extra credit: learn a brass wind instrument.",
            "No, you're doing it wrong! You're supposed to overwork our kids not US! If we wanted to spend time with kids we would be sponsoring an orphanage in Africa!",
            "Your wife is my kind of people. I've worked in education for a while, and kids who are continually pushed too hard will undoubtedly break. Passing the pressure on to those administering it is brilliant!",
            "Primary school should be based only on three things:\n\n- Reading, writing and ideas expression mastering.\n\n- Arithmetic and real life problem resolution. \n\n- Curiosity. The joy to learn/experience new things: cooking, new people/cultures, simple home tasks...\n\nOnce kids are eager to learn and have the tools to do it,  they have their whole life to do it.",
            "That is brilliant. When the parents complain about ANYTHING, she can easily pull the whole \"Well, judging by how much extra credit has been performed, it's obvious you're not actually  involved with your Childs schoolwork\".",
            "Lol they can't even do a 20 min interview so their kid can get the extra credit",
            "Parents that push their kids about grades are the worst. All they are doing is instilling bad self confidence and resentment. I had a friend with parents like this and she tried to kill herself several times, once over a math quiz she got an 80% on.",
            "your wife rules. lovely MC",
            "It's so weird to me that administration would force a teacher to do extra credit instead of looking into why the other teacher is giving out so much more of it.\n\nIt isn't fair to either class of students to have an imbalanced extra credit system for each teacher. \n\nIf teacher A gives out lots of extra credit\nTeacher B gives out little extra credit\nThen wouldn't it follow that any student in teacher A's class would have an advantage over teacher B's class?",
            "Suggest “family math.”. They hate that.",
            "Honestly I wouldn't mind doing an assignment. My teenage self would punch me in the face for saying that, but doing proper research and source citing could be a good thing for a lot of growth ups.\n\nExtra points if your are able to do it all from your phone. A tool I have difficulty doing a thorough job fact checking.",
            "I once told my mom I got in the 98th percentile for a test. She went “why aren’t you in the 100tj percentile?!” I told her it was mathematically impossible and spent half an hour arguing with her. When I finally got home and showed her the paper, she went “why didn’t you tell me it was percentile?! And why aren’t you in the 99th?” \nAsian moms. Gotta love them.",
            "As a teacher I am incredibly against this.\n\nNot all kids will have the parents willing to do your stupid assignments but some will actually do it and then you will need to give those kids points.\n\nJust put your foot down and say there are no extra credit assignments in your class like I do.\n\nAdmin cannot force you to give extra credit assignments at all. If admin wanted to fire me over something like that I would just grab unemployment checks for a while while picking a district that wasn’t run by fucking nut jobs.\n\nFind a district where your admin doesn’t make you beholden to random parents whims that have nothing to do with how well you’re addressing standards and learning objectives.",
            "This. Is. Genius. A+ for effort.",
            "Gonna be devils advocate here:\n\nStudent A is on track to be Valedictorian. They have worked hard all through high school and have completed every extra credit assignment and taken every advanced course. \n\nStudent B is on track to be Salutatorian. Like student A, Student B also completes extra credit and takes advanced courses. \n\nStudent A gets put in this teachers class. Student B gets put in the other class, where the content is the same but he is given tons of extra credit opportunities. Suddenly, through no fault of her own, Student A is no longer Valedictorian but Salutatorian, all because her teacher wanted to be pedantic about extra credit assignments.\n\nThe social sciences (which OP said is the subject this teacher is teaching) should be equally giving either the same extra credit or no extra credit. At this level of academics, grades can change a student’s life and determine how many scholarships they get.",
            "[removed]",
            "I mean, I love what your wife did. But I kind of get the parents perspective that their kid should have a level playing field with the kids in the other class.",
            ">Another teacher (who teaches the same class), gives loads of extra credit and they want their children to be on an even level.\n\nThis reality sort of makes OP's wife's action a little less palatable.\n\nAt the end of the day, there is still harm done to her students as compared to the students of the other class. When fighting for limited slots and selection committees are forced to distinguish, the A+s will have an advantage over the As.",
            "This is amazing!",
            "Hahaha!! As the daughter of teachers and having seen the shot they deal with, this is gold.",
            "Holy moly that is an AMAZING idea",
            "That is brilliant",
            "Haha that's amazing! Also shows the tiger parents who only care about looking good",
            "That's a great way too stick it to them but I feel for the kids in her class who can't make up lower grades when compared to the other students.",
            "Question: when you turn your grades in, does that A+ equal a 5.0 over an 4.0 for an A?\n\nFormer teacher and our department rule was extra credit at most only brought you up a half grade if you were at 90%, up to a whole grade if lower simply because the report cards/GPAs didn’t go passed 4.0 so… you know, no need to make anyone do extra work…and no way for the slackers to only do last minute extra credit assignments and still get an A. \n\nIf the GPAs do go into 5.0 territory, then yeah, that sucks for the kids trying to compete at the school level for valedictorian say…at that level though.",
            "Perfect! Let the parents know what a time/energy/overwhelming burden they place on their kids when parents expect A+. I encouraged my kids to work to the best of their ability, and not to be slackers. But, hey, if they got Bs (good) and Cs (average) and a couple of As (excellent), I was fine. Someone has to be average.",
            "It does seem unfair that one teacher gives all this extra credit so kids get better grades, but the other one doesn’t really, even tho they’re all A’s, other class is all A+++!",
            "Will not go into details to protect people still there but my gem from teaching was a parent that told me her (c student) got an award for citizenship (hard concept for an EK but he really did do something nice.) That I was \" throwing her off the trail of how biased I was and only chose her child because I hated him\" WTF",
            "For us non-Americans wtf is extra credit?",
            "I went to public schools and I remember being in AP and advanced classes through middle and high school. When I was in my first advanced class in middle school, my parents were used to me being an AB student. That first quarter in advanced classes I brought home Cs for the first time ever. My parents were upset and parent teacher conferences were coming up. When they got to the conference they immediately asked my teacher why I was getting a C instead of an A or B. My teacher calmly told them that the class was a lot more difficult than a regular class, and that the C in the advanced class was better than an A in a regular class. My parents stopped complaining after that and were proud of me being in advanced classes rather than having higher grades in regular classes.",
            "Tbh, when I'm a parent I HOPE my kids' teachers do stuff like this. I will do those assignments because I'm lame and love homework",
            "Extra credit idea!\n\nHave the parent record 20 minutes of the student having actual fun.",
            "Honestly though, if two sections of what should be the same class have one teacher giving heaps of extra credit and the other giving none, that’s an actual problem.",
            "What I especially like about this is - if they've got time to complain and escalate the complaint, they can't claim they don't have time to participate",
            "THIS. THIS IS PERFECT. Take my poor womans gold 🎖🏆🏅🥇",
            "I love that extra credit assignment about historical events they were part of. They might have had to out their respective ages.",
            "I think the school should require consistent rules for extra credit. I’d have been pissed in school if I could never get a grade as high as students in the same class with a different teacher.",
            "If everyone is getting an A then what do grades even mean? It's a sign of a bad curriculum, a bad teacher, or bad testing. No school  is going to have all perfect students. And the school should not be encouraging the parents to overwork their children in pursuit of A+,.  Let the kids be kids. \n\nEveryone in this story sucks.",
            "That's pretty great. I'm going to take a guess that your wife doesn't teach English...",
            "Hopefully you'll provide an update :)",
            "This is amazing.",
            "This is amazing and I love it.",
            "So I am a high school teacher (not in the USA), I need to know. What is 'extra credit'?",
            "Extra credit is BS. Volume shouldn't supercede quality",
            "I’d honestly adore getting to do extra credit assignments with my boys… they are 2 and 4 though so extra credit would probably be, color this butterfly.",
            "Extra credit should be graded proportionally.  You dont get extra credit to boost your mark.  Only now have the option or ability to 'average up' your mark if your doing poorly.  However with the risk that you could also average down your mark if you do poorly on the extra assignment.",
            "Typical of social climber parents.  Treat their children like furniture they can buy and pay extra to accessorize.   But, don't care about enough to actually show up.",
            "Woaw... reading something like this makes me so happy. I'm really glad your wife resisted the pressure, it's not always that easy. I guess she could have gotten in trouble for that kind of stuff and I'm guessing it's not that difficult to come up with some legit extra credits idea for the kids so yeah, huge congrats to her for sticking to something fair and nice for the kids while crapping on the parents at the same time. She seems like an awesome person.",
            "Malicious homework compliance is the reason I had to learn how to spell  humuhumunukunukuāpuaʻa in the 5 grade. My 5th grade english teacher didn’t take kindly to my mothers request for 2 weeks of homework for our Hawaiian vacation.",
            "Making sure kids overwork just so their parents can brag with their achievements is one thing that tells you those people shouldn't have become parents at all.",
            "Great malicious compliance but damn, poor kids.",
            "See, I am a teacher and if I did that, the parents would be turning in enough extra credit to bury me.",
            "As a teacher who doesn’t like extra credit- I love this!!!",
            "When I failed math and science in 8th grade my mother asked \"how could you do this to me?\"..... Pretty sure it's my grade......",
            "I was “apart of” the Civil War, so I guess I could write five pages about my lack of involvement in it.",
            "Hahahahaha brilliant",
            "I guess that shows what the parents consider to be really important, then. Spend kid's time on grades? Great! Spend parent's time on grades... Eh, I have things to do.",
            "Hahahaha, this is brilliant.    Then go back to administration and say \"there has been no participation, so I will stop doing that\".",
            "How about a collection of 5 photographs from the parent's childhood and an interview with the parent regarding the event taking place in the photo. \n\nA research paper describing why extra credit is so Important to the parent. \n\nA research project comparing and contrasting the outcome of students of this age who spend with family, doing extra curriculars, left to their own devices and doing homework or study projects. \n\nAn experiment on the emotional reaction by the family if the living room furniture is completely rearranged \n\nLet's see how else we can inconvenience these parents."
        ]
    }
]