[
    {
        "post_id": "10hefpi",
        "author": "fire_me_anytime",
        "title": "Not 5 Minutes Early, but 10 Minutes Late...and It Cost Them a Fortune.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10hefpi/not_5_minutes_early_but_10_minutes_lateand_it/",
        "score": 26457,
        "num_comments": 1003,
        "created_utc": 1674262310.0,
        "selftext": "The \"5 minute early\" post reminded me of a story that happened to a friend of mine, let's call him \"Bobby\".  \n\nBobby was a CNC machinist, a good one, and the only one. The company he worked for made an intricate product, and his CNC part was crucial. The rest of the product bolted on to it. The finished product sold for tens of thousand of dollars.  \n\nIt took 3 hours to make this piece. Bobby would make 3 a day, he'd make one in the morning, take his coffee break, then make another, and take his lunch break. That ate up about 6.75 hours. He'd stay late to make the third part, and make 2 hours OT.  \n\nHis new foreman turned out to be more than a bit of a jerk. He'd try to get Bobby to do other tasks, and Bobby said no, as he needed to monitor the CNC machine during all stages of the cycle. Foreman bitched to the Plant Manager, who told him to back off and leave Bobby alone.  \n\nOne day there was a bad snowstorm, and Bobby was 10 minutes late. The Foreman was there to greet him at the time clock, with a shit-eating grin on his face, holding a Demerit Slip. Bobby had clocked in a minute late the previous week, and the Union rules said that if you were late twice within 14 days you got 20 demerit points.  \n\nBobby and Foreman got into a bit of an animated conversation, and the Union Steward came over and said that Bobby had no choice but to take the demerit hit.  \n\nSo Bobby went to work. His shift was 8am to 4:30pm, but he usually stayed until 6:30 to finish the last part. Not today. At 4:30 he shut the machine down and headed for the door.  \n\nThe next morning, Foreman comes over and says that the assembly team is short a part.  \n\n\"Yeah, I know. I'm working on it right now. It'll be done in 2 hours.\"  \n\n\"But they need 3 a day. Why didn't you make 3 of them yesterday?\"  \n\n\"Because my shift is over at 4:30, and I went home.\"  \n\n\"What? You stay every night until the third part is finished.\"  \n\nBobby pulled the Demerit Slip out of his shirt pocket, looked Foreman in the eye, and said, \"Not any more.\" Bobby had done the math. Every week, instead of getting 15 parts, they were getting 10 or 11.\n\nForeman tried to sweep it under the rug, but within a few days chaos ensued. The assemblers had no core part, and their team went to the Plant Manager to let him know that production was falling. They assemblers liked it....they got to hang around yakking while they waited for the next CNC part to arrive.  \n\nEventually, there was a meeting with Plant Manager, Foreman, Union Steward, and Bobby. Foreman tried to throw Bobby under the bus saying that he refused overtime. Union Steward pointed out that, as per the contract, mandatory overtime was only in case of emergencies, and this wasn't an emergency. Bobby had every right to decline the OT.  \n\nForeman lost his temper, started yelling at Bobby and Union Steward, and was asked to leave the meeting. Plant Manager knew he was screwed, and looked at Bobby and asked, \"What's it going to take to get you to work the overtime?\"  \n\nBobby smiled, and replied, \"As long as Foreman is my supervisor, I won't be working a minute of OT.\"  \n\nAnd that was the last anyone saw Foreman.  \n\nBy sticking to the contract, Bobby cost the company a handful of parts worth many thousands of dollars, and put the company into a position where their lowered production would cost them even more...in perpetuity. Bobby worked a couple of Saturdays to catch up, and made double-time for those shifts.  \n\nThey hired a new Foreman, who was explicitly instructed, \"Do not, under any circumstances, fuck with Bobby.\"",
        "permalink": "/r/MaliciousCompliance/comments/10hefpi/not_5_minutes_early_but_10_minutes_lateand_it/",
        "comments": [
            "\"See that guy over there? That's Bobby. Bobby makes a key component of a machine that sells for tens of thousands of dollars. If you come to us with a complaint about Bobby working overtime, or Bobby comes to us telling us you gave him shit because traffic was slow and he was five minutes late some day, you will be asked to leave. Are we clear on that?\"",
            "I don't care if he's strutting around naked, don't fuck with Bobby!",
            "I like to think there's a new rule written in the margins of the employee handbook that just says \"Thou shalt not fuck with Bobby \"",
            "Love the story, but fuck, I can't image a company in that situation, not at least stopping to think, \"what if Bobby get hit by a bus?\" and work on replacement plans, training a backup...anything other then PANIC!!!\n\nWhat did they do if Bobby wanted Vaca or was sick?\n\nbut fuck that foreman",
            "These are my favorite kind of examples. Hard working, honest person does a great job that all but usually one or two appreciate then it explodes to a massive issue only for the employee to win. I love it. If only leadership could have had more foresight and never let it get to this point…",
            "A smart plant manager would hire a second CNC guy and have Bobby train him to also make the part. Then just put one of them on a night shift and up the output to 4 parts per day.",
            "Bobby is too mission critical!\nAs a manager i would find a way to get a back stock of things.\nFind a way to make sure bobby being sick does not cause issues.\nMaybe have a spare person that can do the job and run a second shift/machine? So that bobby is not made redundant but still valuable",
            "There's a 'Bobby' in my shop too.\n\nExcept his name is Steve. A few days before Christmas, the owner of the company came down from the office to wish everyone a Merry Christmas before he left for the holidays. Steve just stated, if you don't have an envelope in your hand with a bonus cheque, you can fuck right off. The owner of the company just left.",
            "I love this story",
            "This is a really badly led company. Their whole production is dependant on the knowledge and overtime of one guy. What happens when Bobby gets sick, what happens when Bobby goes on holiday (never thought about that one did they). What happens if Bobby walks under a bus.\n\nThe same bus factor 1 probably also applies to the CNC machine.\n\nEdit: This was mentioned before by u/SillyDrizzy",
            "The dream job. The single point of failure for the whole company. He's got them over a barrel until they learn not to depend on just him.",
            "Ol' Chesterton's Fence rears its head again.  It may not apply in all situations but all managers should know what it is.",
            "I remember hearing about a similar dude. Guy gets brought in as a manager at a concrete plant and finds that there’s apparently a hobo living in the woods behind the plant, sleeping in a hammock and just hanging out back there. He gets told “oh yeah that’s our welder, don’t fuck with him because he can weld cheese.” \n\nOver time he discovers that A: However good people say he is at welding, he’s better than that. B: If his talents are needed to fix things and get the plant back in operation he’ll be there until it’s done no matter how long it takes. C: He swears like a sailor on the USS Tourette and is completely unfit for human society. Apart from emergencies where he’s needed he’s fucking off in the woods thankyouverymuch.\n\nDude found his niche and was living his best life.",
            "Dammit Bobby (done in my best Hank Hill voice)",
            "It was more than likely put in bold, italic, underscored and put into a larger font “Do not under any circumstance, fuck with Bobby”",
            "I work in Manufacturing and one of our first lessons is never to have a Bobby situation. You need to have a system, instruction sheets, cross training, and so on, so anyone can go today and the company won’t lose $$. Only idiots let that happen. He needs vacations, he can get sick or have an accident or he can win the lottery and leave. This is just bad management. \n\nThat said, I HATE foremans like Bobby’s. F that guy.",
            "Take my award, great stuff here.  10/10!",
            "[removed]",
            "The actual conversation w the new foreman \"that is bobby... bobby makes three key component parts to that machine a day...It would take 3 people to even train the one dude to replace bobby. if bobby tells us you are being an asshat you will be fired. bobby can manage himself just fine leave him alone.\"",
            "What happens if Bobby gets sick, or goes on vacation, or croaks?",
            "Never depend on only one person to make or break your company. They need another person to replace Bobby if he’s not available. Poor planning.",
            "I like Bobby.",
            "Sure the foreman fucked up, but the Company/Plant Manager also fucked up for not having a backup plan. Like training up a second Bobby on a second CNC machine or even having a batch outsourced to build up stock.\n\nFor such a crucial part, what was their contingency plan for Bobby falling ill or the CNC machine breaking?  Everyone runs around with their hair on fire?\n\nI am gonna guess that somewhere \"just-in-time\" was mentioned.",
            "A company that depends if a *single* person like that is doomed to fail. \n\nWhat if Bobby got into a car accident? No parts for the week.",
            "Fell for the Bobby trap!",
            "That doesn’t sound like a very sound business plan if something untoward happens to Bobby.",
            ">\"Do not, under any circumstances, fuck with Bobby.\"\n\n😂",
            "If this is how they treat the most important workers in their firm, imagine how new hires, the old, the women and the minorities are treated. Must be a hellish place to work for.",
            "Oh fuck, that was tasty. Think I'll go back and read it again",
            "Petty managers cost companies millions by doing shit like this",
            "As an industrial engineer that literally writes the SOE for assembling products, this makes my eye twitch. Shame on those process engineers for setting him up for failure and relying on OT to make a single days’ products.",
            "A couple of weeks into my first job an older man walked by us on his way to get coffee.  I was told, \"That is \\[redacted\\].  Without him, none of us have jobs.  If you see him sleeping, let him sleep.  If he's ranting, let him rant.  If he tells you to do anything, you do it or you find someone who can.\"\n\nGood training.",
            "There's a guy like that at my work. Cnc operator/programmer. Been with the company for 20 some years, and the company was bought out by a larger corporation 4 or 5 years ago. Whenever there's mandatory overtime. There are no exceptions for anyone leaving early or not starting at their designated time. Except this guy who is the only one that can get a few crucial jobs to come out with few to no discrepancies.  Sometimes, he'll come in 3 hours early and stay a few hours late for the entire week. Next week, he may come in for 2 hours and leave before the rest of the shift even gets their because of back pain or something. And then not show up the rest of the week. Even if medical leave or whatever, most others would get warned about taking care of their selves, better time management, and having backups for travel. \n\nNot this guy, it's pretty much a \"he does whatever he wants and you'll damn well like it.\"",
            "This is a pretty dumb situation for a company to get stuck in. When your entire operation is running solely off of the work of a single person, you're gonna get fucked eventually! I probably would have held them hostage in that meeting if I were Bobby. Get em to sweeten the deal a bit!",
            "Best part of the entire story, do not fuck with bobby!",
            "What do they do when Bobby wants to take a vacation?",
            "Wish my boss rolled like that. Guess it’s time to join a union",
            "Since Bobby holds so much of that company’s sweet, juicy profit in his talented hands, they need to add some zeros to his check. Edit: Bobby would be better off as a very highly paid consultant rather than an employee.",
            "WTF wouldn’t you train a part-timer to finish work that obviously needs to be done, and have a backstop for holidays or illness ?",
            "Demerit points? American industry treats its workers like primary school.",
            "You don't need to the best ever at your job.\n\nYou just need to be indispensable.",
            "I lived a story similar to this and there is great satisfaction when the company learns how hard you actually work through regret of thier supervisor's opinions.\nFucking with the guy that does extra for his own satisfaction that directly benefits the company is not going to end well for the company.\nMy skills leave with me and I decide every day who profits from them besides me.",
            "Lol, Bobby should be asking for a 50+% raise every year.  Great story.",
            "A single point of failure.....BRILLIANT!",
            "That man over there is Bobby. We don’t fuck with Bobby.",
            "The moral of the story is dont be a fucking prick. If someone comes in does their job well and doesnt make life difficult, leave them tf alone. If their late occasionally or make a mistake, let it slide.",
            "Skilled People: Laugh now but one day we’ll be in charge.",
            "I was a Bobby before I retired. Not a machinist but a specialist to be sure, and on a 300 million dollar project, the only such specialist. What an amazing feeling it is.",
            "I would agree to not fuck with Bobby, but you gotta wonder what kinda business practices are they running to only have one Bobby at all times. What happens if Bobby's appendix bursts or he gets into a car accident?",
            "This is why you have at least two bobby's in your shop. \n\nIf bobby got hit by a bus your entire company appears to be fucked. \n\nThat said top work sticking to his guns like that though.",
            "As a supervisor of union employees you have to know what the rules are and when to apply discipline. Some supervisors let it go to their heads and forget who does the work. There are a lot of Bobbies in the work force, and a supervisor's job is to support production, not stop it.",
            "My dad is the CNC bobby in his shop. He’s frank and he’s the inspector. He’s retirement age and hasn’t because he just doesn’t want to but he’s one new, younger, smart ass supervisor away from walking out, for what would be the 7th time at this particular shop (yes, he’s been invited back 6 times) and he doesn’t have to go back this time. They had better figure it out or some oil company in Texas is right fucked. \n\nThis current guy is Francis and I don’t think he’s got what it takes.",
            "It’s so wild how these people always go after employees who are not only critical, but already going above and beyond to get the job done.",
            "Bobby is what you call \"unfuckwithabble\".",
            "That company needs to get two or three more people up to speed on the cnc machine. What if Bobby gets sick?",
            "I love hearing stories where the unions actually stick up for the employee and enforce the contract. Unless they are police unions",
            "\"B-but, I'm higher in the food chain! They wouldn't fire me before they fire him!\"\n\nYou might be a fox in a henhouse but he's a golden goose on Wallstreet.",
            "This post is the reason Reddit needs to exist.",
            "One year on and this is still my fav MC.",
            "If Bobby works in a non-union shop:\n\nForeman loses temper. Plant Manager fires both Bobby and Foreman. Production stops.\n\nPlant Manager scrambles to find another Bobby. No can do, Bobby's are rare, expensive, and in-demand.\n\nLayoffs. Plant closes due to bankruptcy. Foreman is still unemployed. And Bobby? Bobby got another job in 3 days.",
            "Little known fact: Bobby had the CNC machine set on slow.",
            "It was on that day that Foreman fucked around and found out Bobby was playing the long game.",
            "> got 20 demerit points.\n\nTo be clear this is and actual company? Not like...I dunno Hogwarts or some shit",
            "If you need a guy to constantly do overtime....hire another guy for fucks sake.",
            "now this is beautiful... well played Bobby.  \n\nJust for the uninitiated and speaking from a managers position a good CNC operator is worth whatever they want to be paid.  A GREAT CNC operator is worth their weight in gold.  They can completely make or break an operation with ease.",
            "FAWB, FO (Fuck around with Bobby, find out).",
            "I love a happy ending.  Well done.",
            "If I ever have another kid, I’m naming him Bobby so no one ever fucks with him.",
            "Best I’ve read in this subreddit.  Well done.",
            "*Very* satisfying, but the cynic in me points out if Bobby did not have this 'nads-in-a-vise situation, Foreman would have gotten away with it. \n\nProbably did so to many others before, if he was brazen enough to wait with a slip and a visible grin at the door...",
            "If i were plant manager I'd have a second person learn the cnc with and have them start 2 hours later so they could finish up the part without doing overtime. \n\nAnd probably get a cnc machine that doesn't need constant supervision.  Cnc machines are automated, aren't they?",
            "Why didn't the company just hire another CNC machinist?",
            "This was so satisfying I think it made my skin clearer.",
            "This is a beautiful story about what egos do. That foreman knew he was not irreplaceable, but Bobby was and he just couldn't live with it. And thought he could get away with it. But the thing with cruical, irreplaceable workers is that they usually know that they are irreplaceable. As they say, fuck around and find out.",
            "What the heck happens when Bobby wants to take a vacation?",
            "This violates the “bus” rule.\n\nNever have one person who is so vital that if they were hit by a bus, productivity or progress stops.",
            "Load bearing Bobby, do not fuck with.",
            "Don't Fuck with Bobby ...  I want a hoody with this emblazoned across it. Let people who read it be forever perplexed.",
            "I'd like to buy Bobby a beer.",
            "Please tell me that some wonderful person saw fit to tear up the demerit slip!",
            "This seems like an absolute setup for failure though. They need to get a second Bobby and they need to do it now! Because, if Bobby gets sick, this company is in trouble. If Bobbie does, this company is dead. Hell if Bobby just decides he wants a $50 an hour raise, they have to give it to him, or they're in trouble! \n\nBobby maybe the ultimate monster swinging dick, but you can't have anybody completely irreplaceable in any factory like this or you're screwed.",
            "that right there is a great example of a union and your union steward doing the right thing. fucking good for \"bobby\" ...",
            "So, no one thought it was a good idea to train someone else to  make the part?  Just think what happens if Bobby drops dead, gets seriously ill?  I have a friend who is a machinist and he  is the only one who can make a specific part.  He pretty much writes his own ticket at work and keeps telling the bosses they need to get him a person to train on the part and they don't.  So, he works whenever he wants, now just once a week, and has full benefits. How does this even make any sense?",
            "Don't. Fuck. With. Your. Machinist.",
            "Company needs to get Bobby an apprentice",
            "Why the hell aren't they hiring another guy to be trained by Bobby? It's never good to have a single person doing an important job!!! What if he's sick ...?",
            "Yeah recognizing Bobby was doing 2 hours overtime everyday and giving him generous for 15 minutes late collectively over two days… should not be in any manager position to speak of anywhere.",
            "Nice for an individual employee to have that amount of power but it does seem like poor \"planning\" on the part of the company to be totally reliant on a single person\n\nWhat happens when Bobby goes on holiday?\n\nWhat happens if Bobby is off sick?\n\nWhat happens if Bobby dies (unexpectedly)?\n\nWhat happens if Bobby decides to leave?\n\n\nFor all except the last one it seems they'd be up a brown sticky water way without a means of manual propulsion\n\nFor the last one, depending on the notice period, they might have a chance to recruit and train a replacement for Bobby",
            "Any company that has a single point of failure deserves to fail. What happens when Bobby gets sick? What if he gets hit by a bus?",
            "Sounds like the company needs to invest in the second CNC machine. If their tolerances are so tight that they're dependent on this one machine then they will get f***** if it goes down. If a single part has an issue and needs to be tossed then it sounds like everything downstream gets f***** over cuz they don't have any buffer in place. And if the machine has a catastrophic failure then they're really screwed over cuz now they're entire line of operations are down until they get a new machine. If Bob can run two machines side by side and have a part output every two to two and a half hours then they'll not have to pay him any overtime and they reduce the wear and tear on a single machine.. and they have a backup machine in case one machine goes down so they don't come to a complete halt in their line.\n\nHack if Bobby gets sick or dies all of a sudden results in the same issue if they don't have anyone else trained on making that part.",
            "2 lessons can be learned from this:\n\n* Don't be a dick\n* Companies need to have redundancies incorporated into their system wherever there is risk. Be it an essential component or safety equipment.",
            "Pay raise would have been where i started at. Apology from foreman in writing before he was kicked. Need to rub salt into the deep cut",
            "The foreman was stupid. He didn’t know what was important and thought exerting his power was his job. A good manager knows how to get the best out of everyone.",
            "I was the only person at my company who spoke X language. They never hired anyone else, trained anyone else, nothing. Whenever I was on vacation, all the X-speaking clients didn’t have to worry about shit since they didn’t have to pay their bills. I Office Spaced my last few years there bc they treated me like shit. I eventually got laid off and outsourced and everyone in my family congratulated me for getting paid to leave that shit hole.",
            "He didn’t ask for a raise too? I would’ve asked for a raise. A big one. And is it normal for a union rep to not back the employee, especially for something like being ONE minute late?",
            "There needs to be a sign on the CNC machine that says: DO NOT MESS WITH BOBBY.",
            "Brilliant!",
            "The story is badass but it just struck me that they shouldn’t be saying not to fuck with Bobby specifically, but just not be a dick in general.",
            "Plant manager learns that Bobby is the single most important person in the company.",
            "I think every business has one of these. Especially the well run ones. There's a machine shop around the corner from my condo that has a few dozen workers. Most are run of the mill workers. But there's also Ted. Ted's manager has told me that he makes 6 figures and works about 20 hours a week. Why? Because Ted installed, maintained, and trained almost everyone in the building. If anything goes really wrong, you call him. But he wants to retire, but they can't afford to lose him. \n\nCool guys, always fun to chat with",
            "For all the people asking what if bobby quits..... its simple, a worker who knocks out a couple of extra hours *every* shift enjoys his job and considers himself well paid for the effort/work he does. Keep paying Bobby his OT, dont **** with Bobby, and he'll do his thing till the cows come home. Given that Bobby was ok with pulling saturdays to make up for the missed production, I'm pretty sure he'd have the same approach to vacation and missing work because he's sick..... just ffs dont **** with Bobby!,",
            "One wonders if the amount of money they lost to pissing off Bobby couldn't have been used to buy a second CNC machine to spit out more parts.\n\nAlso to hire somebody else to make sure one guy couldn't screw them over like that.\n\nAnd now I'm mad about the Senate.",
            "What Foreman got wrong was Bobby was staying late because he *had* to. Nope. Bobby was staying late because he*wanted* to. That's what company loyalty looks like.  Good job destroying it.",
            "Who runs Barter Town?\n\nBOBBY runs Barter Town!",
            "Its the second CNC machine thats the prohibitive cost, paying Bobby OT to knock out an extra unit a day is dirt cheap by comparison, routine maintenance, servicing and a skilled operator will minimise downtime due to breakdowns. Redundant, unused manufacturing capacity is something nobody wants",
            "Epic story.",
            "Perfect example of playing fire with the wrong person",
            "Beautiful",
            "I love the Bobbys of the world:\nGood, hard workers who know their shit and know who is shit.",
            "This made me smile 😊 I do like it when AH supervisor types get what’s coming to them.\n\nThou Shalt Not Fuck With Bobby 😄 Fantastic 👌🏻",
            "I think we all need that last line on a shirt - or framed somewhere",
            "Great epitaph!",
            "What is a demerit point in a work context? What effect would it have?",
            "Bobby doesn't want to be fucked with, unless the earth is literally on fire.",
            "Bobby is like a porcupine. Make yourself just big enough of a mouthful to not be worth eating.",
            "As a cnc machinist, I hope I can get a job like that.",
            "Work to rule!",
            "Perfectly balanced, as all things should be.\n\nI'm glad for Bobby as well!",
            "So the company bought a second CNC machine and then Bobby watched both of them instead of just staring at one?",
            "\"Bobby's gonna be Bobby. And if Bobby can't be Bobby, than Bobby's not gonna be Bobby.\"\n\n-Bobby ~~Brown~~",
            "Awesome story but if Bobby is super crucial why have 1 Bobby?",
            "Did they ever think about what was going to happen if Bobby got sick or was in an accident and could not work for a while ?",
            "Totally with Bobby - also poor company practice by having Bobby as a spof",
            "Thank you for writing this so beautifully",
            "Classic manager\n\nThinking being a dick to someone will make them stay overtime for free",
            "We need \"do not fuck with Bobby\" shirts.",
            "Foreman: “I was just trying to do my job!\n\nCompany: “Poorly! You let the company lose money. Ill make sure your next employer knows you care more about your ego than the company’s profitability”",
            "“This is Bobby. Our god!”",
            "Shit company relying so much on one meatbag.  What if the meatbag got a kidney stone",
            "it's kinda funny how this exact tale repeats in so many different fields. the basic story is always the same: a worker agrees to work overtime so some critical job gets done. a new manager tries to prove something and the worker now defaults to the strict work times, often messing up the whole system. only the ending varies, sometimes it pays off for the worker, at times the manager wins.",
            "The first rule of Company is: you do not fuck with Bobby.   \nThe second rule of Company is: you DO NOT fuck with Bobby!",
            "Don't any of these weirdos watch any fiction whatsoever? I could name many shows where people are allowed to bend the rules and or be weird because they bring in the amazing results.",
            "and what happens when bobby gets in an accident or extended illness? this is a bad way to run a company. there should never be a single point of failure like that",
            "I'd love to have been in that meeting. I work in manufacturing, I can imagine the followup with the foreman. \n\n\"So let me get this straight, we have an employee, his one task is critical to our production. He's the only one who can complete this task, and you in your infinite wisdom decide to fuck with him? \"\n\nI gotta say though, poor planning on the company to rely on one person like that. What if bobby gets sick, needs a personal day, takes a vacation, gets hit by a bus?",
            "*\"Do not, under any circumstances, fuck with Bobby.\"*  I'm keeping this one.  Love it.  Bobby sounds like a really cool guy.",
            "How about just don't treat anyone that way?\n\nLike yeah, it's good to be on time, but we're all humans living in a world we don't control. People are going to get held up. Emergencies and surprises that can't possibly be planned for will happen.\n\nJust leave *all* the people who do hard work for you alone.",
            "Don't bite the hand that feeds you.",
            "Any line with a single point on failure is doomed.\nBobby was a better man than me, the power would have gone to my head 🤣.\n\nWhen does Bobby take vacation? What happens, the whole line stops for a week?",
            "Kudos to Bobby for doing what he could to get the line back up to schedule. Sure he made out as far as as a bigger paycheck, but he did the entire factory a solid by giving up his free time."
        ]
    },
    {
        "post_id": "w6gbu6",
        "author": "yarntags",
        "title": "Told to change one student's grade, so I changed them all",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/w6gbu6/told_to_change_one_students_grade_so_i_changed/",
        "score": 26430,
        "num_comments": 1246,
        "created_utc": 1658616250.0,
        "selftext": "I moved to a new state to take a high school teaching job in a rural town. I liked my fellow teachers and almost all my students, but this was a small town with the usual assortment of outsized attitudes. One student was particularly lazy. Her parents both worked in the small school district (admin at the HS, teacher at the MS). She rarely turned anything in on time, and what was turned in was generally rushed or incomplete as if she'd gotten the instructions secondhand. Somehow, though, she had straight As in all of her classes.\n\nI quickly figured out why. When she turned in another late, incomplete assignment, and I very generously gave it a D, her overall grade in class dropped to a B. I was called in the next day to a meeting with the principal and both of her parents who immediately complained I was being unfair and capricious with my grades. They accused me of not giving students the instructions, so I showed them the instruction paper which I passed out and went over in class. They accused me of not giving her specifically a copy, but I remember handing it to her and I told them why: she was making out with her boyfriend when I was trying to go over the instructions. (They didn't like hearing that part lol) They accused me of not being clear with the deadline, but it was the second line of the directions. They accused me of not fairly grading her work, but when I showed them her work, they clearly hadn't seen it before and wondered whether I'd gotten assignments mixed up before I showed them her name on it.\n\nThe principal asked me to change the grade in the gradebook. I asked about whether she'd have to redo the assignment first, but that was declined by her parents. I understand why my principal caved - it wasn't worth trying to fight two employees in a small, rural district already struggling to recruit people.\n\nSo I went back to my classroom and changed every students' grade to a 100 in the gradebook. No special treatment. Even the ones who hadn't turned in a single thing got a perfect score.\n\nThe Fallout:\n\nMany students asked me why their grade changed, but I never addressed it. I would just brush them off by saying not to worry about it, though clearly rumors were spreading like wildfire in the small school, because even the secretary and the principal asked me about it later on. I only said that yes, I changed her grade. The principal looked like he wanted to ask me about why I changed all the grades, but he just shrugged and walked away. He never interfered in my grade book after that. The student's parents transferred her out of my class and her boyfriend also transfered a day later (no more PDAs in my class, finally, so no complaints).\n\n&#x200B;\n\nEdit: I'm trying not to let internet strangers hurt my feelings, but a lot of comments are hung up on the idea of \"Why are you letting them make out in class, you're a bad teacher!\" lol\n\nTo be clear (to be cleeeeeeeeeear\\~\\~\\~), I tried all the usual stuff before they transfered out (it was an elective class, so it was possible): asked them nicely to stop, kept them after class and explained why it was inappropriate to make out in class, wrote them up with official reprimands in the school discipline system, made jokes in class to embarrass them into stopping, and eventually sent them to the principal's office - but guess who worked in the principal's office and would run interference?",
        "permalink": "/r/MaliciousCompliance/comments/w6gbu6/told_to_change_one_students_grade_so_i_changed/",
        "comments": [
            "Yeah fuck those parents they are enabling a child and she will fail in life. Also tell your principal to grow a damn spine. Do they give every student an A? I bet not, just little darling.",
            "Parents who do this are not doing their children any favors.  They won't be there to protect them when their precious snowflake goes off to a college they are in no way prepared for.",
            "I adjuncted at a college for a while and was teaching a research method classs (major required, nearly universally despised). Grading was \n\n30% exams \n\n40% for the various homework\n\n20% final paper (most of the homework was sections of the paper that I gave comments on to make the final better)\n\n 10% attendance.\n\nHad a student who mostly attended class and did amazingly well on the tests.  But that's it.  None of the paper sections or other homework. Gave the whole class an extension on the final paper to the last day of finals.  She turned the final paper in the day after I'd submitted grades to the university (which was after they sent the threatening email about late submission).\n\nMonths later I'm getting calls from her parents and my former department chair.  They beg me to grade her paper since it was \"turned in.\" So I did. It was terrible.  So she failed it too.\n\nMore calls and the chair asks me if another colleague in the department could grade her paper and they'd average them as a \"fair\" method since I must be biased. There was a pretty detailed rubric and it was hard to mess up things like \"no spelling errors\" but fine,  I don't care. \n\nThat person gave her a 98.5, which was the exact number the student needed to earn to not fail. At this point I didn't care,  but when they called me asking to teach it again I told them off for having no integrity at all.",
            "[deleted]",
            "> Many students asked me why their grade changed, but I never addressed it. I would just brush them off by saying not to worry about it, though clearly rumors were spreading like wildfire in the small school, because even the secretary and the principal asked me about it later on. I only said that yes, I changed her grade.\n\nHow does one gain this level of wisdom in responding to inquires about one's malicious compliance? You somehow managed to perfectly walk the line on letting everyone know exactly why you did what you did, without getting into any trouble for saying anything specific about it",
            "I was teaching English at a two-year Catholic college, one of my students was a girl who never turned in anything and when finals rolled around, complained to her dad that I was somehow unfairly imposing these Draconian requirements on his little princess. Dad went absolutely batshit, left this long message for the English Department where he tore into me, up and down and sideways. I explained to the Department Head and the Dean of Students that she had not handed in a single assignment, that she hadn't taken a single test and that requiring all students to take the final was obviously not my personal vendetta against her. I failed her, but I also never worked there again. It's a hard call sometimes, I wonder if I should have been less idealistic and lived to teach another day.",
            "Did they say what to change her grade to? Because if they didn't, it would be very tempting to change it to an F ahaha",
            "Substitute French teacher in my sons’ prep school.  But they ask me to take over a Spanish class (don’t speak the language) but tell me not to worry because I just have to proctor a test.  First clue that this whole class is sketchy (Spanish teacher had a rep as being a very easy class)- as soon as I tell them they are taking a test they all start moving their desks close to their neighbor.  Like full on scraping/scooting the chair two feet to the left or right, whichever way their cheat buddy lives. Everything was so sketchy, all of the movement and fidgeting throughout the test. Not anything like the same grade French class tests.  Then I catch a boy who is supposed to be a good student looking down at the floor where his book has been placed as instructed, but the book is open.   I’m like, what are you doing!?  He says he has dropped his pencil accidentally into the open spine of his book and is just fishing it out.  I tell him, go see the headmaster.  Later the headmaster talks to me and tells me that this boy comes from a good family and is an A student so no way he can be cheating.  I pulled my two kids out of that school at the end of the school year.",
            "Wait until her “perfect grades” get her a scholarship to university and she pulls the same crap . Professors have neither the time nor the interest in pandering to spoiled, whiny kids and their obnoxious parents. Maw and Paw Kettle won’t be able to bully the Dean of a university lmao. She won’t last the first semester",
            "Pegging the grade inflation so hard you wrapped the needle around the pin.",
            "I stopped teaching college because of that just minus the parent. Kid didn’t come to class or would show up late and then complain I wasn’t exposing what he missed. He got a bad grade and became disruptive so I asked him to either stop or leave. He then stopped doing the work. The ombudsman called me saying he wanted to ask me some questions. I get to the meeting and the kid is there and the ombudsman proceeds to ask him state what the issue was. He then pretty much asked me to fix it. I finished the semester gave everyone As and tendered my resignation. The pay was crap and I didn’t need the job but I enjoyed the students. I was pretty much doing the university a favor because they needed someone to teach that class (statistics for business) and they didn’t have anyone so I said sure why not. Then they roped me into MIS lol. They had to figure out how to deal with both without anyone there with enough background. The switch to the customer is always right in academia is real.",
            "I was teaching a 9th grade class in a very small town (pop. 900) in the heart of the Rocky Mountains and gave an assignment to write a paper describing a thermos bottle and use the words conduction, convection, and radiation to show me how it works.\n\nI had one Special Needs student in the class who turned in her paper on time and all done. Upon reading it, I see her use the terms \"black body radiation\" and \"thermal emissivity rate\". I was pretty sure she had no idea what those terms meant so I asked her to redo the paper - not all of it, just the part with the terms - and demonstrate what they meant OR leave out that paragraph all together.\n\nGot a phone call the next morning from her mom, shrieking at me. Literally shrieking. \"Are you saying my daughter is stupid?\" And more like that.\n\nFortunately, unlike your experience, I had a Principal who knew shit. He told me, \"You're just doing your job.\"\n\nI swear, some kid's parents. Jesus.",
            "How times have changed. I was not a very diligent student but went to a good private school in a wealthy area. After I had f'ed around on a big assignment and was in danger of getting a failing grade the teacher called my parents to let them know and enlist them in \"fixing\" the situation (i.e. getting me to finish the work and the teacher would pretend it was on time). After the teacher explained the problem, she said something along the lines of \"So, what should we do about this...\" and my Mom replied, \"Fail her.\" The teacher was gobsmacked, mentioned what it would do to my grade and GPA etc. My mom was all \"So what.\" As far as she was concerned, if I did the crime, I did the time. She wasn't about to rescue me. Pretty sure that was the only time the teacher ever heard that.\n\nedit to ad a missing word because I still don't pay attention.",
            "I've done this! I had a student go to the department head, claiming I had favorites and graded everyone else too harshly. It was a whole ordeal. All for what would have been, at best, 1 pt to her overall grade. \n\nThe department head sided with me, however my supervisor decided to grade the largest assignment herself and said she would have had it +7pts instead of what I assigned it. She even admitted she was biased due to the students complaint. Ended up telling me to add 7pts to that assignment for the student. I said I'll be adding it to all 60 of my students. Because if I was truly a tough grader, all students must have been suffered. And if my boss pushed for me to only add it to that one student, she was forcing me to concede that I grade unfairly. \n\nI had a good chuckle that when it kind of got out, the self proclaimed favorite student said he would have gone to the head and showed her his grades (solid C+ student) in order to defend my honor.",
            "There's a few teachers in my family, and they all agree: the worst parents are other teachers",
            "Man, oh man. My dad was a high school principal when I was in high school. If I somehow failed to meet expectations, I was the one who heard about it, not the teacher. And that's the way it should be.",
            "My parents never bullied an instructor into changing my grades, thank goodness, but they were always present during my education. My mother, God bless her, helped to found the charter middle school I ended up going to and got an administrative job in the office while my brother and I were there. She followed me to my high school and pulled the same shit there. I'm still not sure exactly what her job was on the campus but I think it was related to counseling somehow.\n\nTo be fair, I think she was following my brother, but it was still mortifying for both of us. It was a miracle she didn't find work at my first college, and I didn't get out from under her influence until I joined the army. That took a lot of growing up in a very short period of time, I'll tell you what. And man, I did not do it gracefully.",
            "yeesh, someone I know was told she couldn't fail anyone out of music because something something elective and No Child Left Behind. IIRC she told all the students who actually paid attention that they'd be receiving 100s because the system was bullshit, so enjoy a few free days off here and there. There's no winning with this kind of system.",
            "I had hoped this was a story of parents complaining their child wasn't the top student so you changed everyone else's grades to 110% or something but this works too",
            "I want to see her first semester grades in college. Mommy and daddy can’t get those changed, and on top of that, she’ll be in over her head in the new school.",
            "This happens a lot more than people realize.\n\nA lot of so called \"a\" students are that way due to parents having pull.",
            "I’ve had this happen with parents/admin before too, so I grade everyone on a “curve” or give bonus points. The one who got a D, I might agree to raise their grade to a 75 or 80 (whatever was needed to pass). Then raise everyone else’s the same number of points. \n\nI hate that crap too. It’s not right if just the ones who fail get a “second chance” what about my high achievers who actually studied and/or read the directions made a 90 the first time? If the ones who were lazy and failed get another chance then everyone should. It’s only fair!",
            "I was teaching AP English Lit at a private “Christian” school. One parent complained that her son had a D in my class. “He has a 1400 SAT score! How can he have a D in your class?” I told her straight up, “because he hasn’t read the book.”   I gave several examples of simple questions he couldn’t answer about the book because he hadn’t even bothered to read a Spark Notes version of the book. Those entitled, privileged kids were so annoying. They’d run to the principal/soccer coach whenever they couldn’t get their way. Half the high school staff left at the end of that school year, including me.",
            "Glad you didn’t screw over all the other students to prove a point by making all the grades 0s!",
            "Setting her up for failure. Not until precious’s problems get too big to fix will she learn a dang thing. They are not doing her a favor.",
            "I had a mom like this and a struggle with being a lazy piece of shit every day. It engrained some seriously detrimental qualities in me I'm still having trouble shaking 11 years after highschool ended. They're doing that kid no favors.",
            "I had a professor once who told this story at the start of every year in his class (or atleast he said he did I only took the class once)\n\nNow he was a big professor. Been there decades, tenure, leader in his field, etc.. He was known to be a good teacher and if you put in effort it was easy to get good grades which is why I took this class. His syllabus had been refined over many years so there was really no way around any of his rules and everything was submitted online.\n\nSo one year at the end of the semester he gets a call from parents basically yelling at him because their kid was failing the class. The parents were freaking out blaming him and making every excuse for their child. He basically says I don’t care and hangs up. They go above his head to the department chair and make some SERIOUS accusations with absolutly no foundation. I’m talking favoritism, that he tried to sleep with the student and she said no, that he faked his credentials, just about everything you can think of. The chair obviously knows him and doesn’t believe the parents but talks to him about it anyways and now the professor is pissed off. \n\nThe only reason the student even had a chance at passing the class was because they had done really well on the papers. So now he regrades everything. Not much changed with all of the work not turned in and bad attendance grades, but he looked closely at the papers and did those online checks for plagiarism. Turns out she used one of those online things like fiver to PAY someone to do her paper for her and the person she paid had used the same paper for a different student at a different university a year or two ago. Put in the other paper and this one has three matches ranging from almost exactly the same to paragraphs copied and pasted but some changed. \n\nAs I said he was very talented and basically wrote a scientific god damn paper that coulda been peer reviewed. He showed us pictures of it and there were footnotes, diagrams, statistics on the likelihood of this happening, way too much effort. Apparently the student had also signed something at the start of the year to allow her parents to see her grades and such (every student has the option for this I personally didn’t do it but this student did)\n\nHe sent the dean, the department chair, the student, the parents, and the office of academic integrity all a lengthy email with attendance records, images and accounts showing not turned in work, work she did turn in that was horrible with an explanation for each section of the rubric she missed points on, and to finish it all off his research paper on how she definently chested on the papers. He went on to explain how this meant that she would now be charged with plagiarism and have to defend herself against the “honor court” at the school. If she was found guilty she would be kicked out of school and likely never be able to get another scholarship again. Yah she was very quickly found guilty lol\n\nThis is second hand from a couple years ago but I remember it pretty well and I’m pretty sure all of these details are correct but god damn was it hilarious and he said he hasn’t been contacted by a parent since then",
            "This is why I quit teaching. I loved teaching, but holyfuck the admin was so horrible I just couldn't do it anymore.",
            "The comments in this thread explain way too much about 2022 USA. 😞",
            "I was a first year teacher.\n\nI had the new superintendent's kid and one of the board member's kid in the same class.  They were buddy/buddy.\n\nBoth stopped coming to class for a while, so I marked them absent.  Grades began to drop.  I called home.\n\nBoth sets of parents came to meet with me.  The sup't made it clear they were a parent, their child was snatched up and away, blah blah.\n\nCome to find out that they were going to the guidance office and hanging out there specifically to get out of my class.\n\nJump forward about two weeks - end of term and time for grades.\n\nBoth had a failing grade, and I was prepared to assign it.\n\nI was walking down the hall.  My DH pulled me into their room.\n\n\"Change their grades.  It will look good on you for your continued employment here if you do.\"\n\nThis is HIGHLY illegal.  Like, snatch your certificate to teach illegal.\n\nTranslation: I am telling you to change grades, or you will get fired.  I am protected because I am the DH, and the conversation is hearsay.\n\nI changed the grades.  I said, after, that I had done the wrong thing because I set precedent on how both students could skate by with no accountability.\n\nBoth students moved to other teachers for the second term.  Both had same issues but passed.\n\nYears pass.  The students graduate and move on.\n\nThe sup't kid goes to the local, regional university.  Parents put them up in a nice apartment, pay for classes, spending money etc.\n\nFall Grades - 0.00.  The student suddenly learned who their father was meant jack shit in college.  They failed all classes.  When you don't go to class and spend time partying and drinking, well ...\n\nLater, they got pregnant out of wedlock, so there is a nice smear on the sup't family now.\n\nThis is still my crowning achievement in my job.  The sup't absolutely HATED me but could do nothing about it.  My observations were solid, scores looked good and eventually I had due process rights.",
            "and that’s how parents raise perfectly good for nothing entitled little shits",
            "I had a student like this. I caved to them and changed their grade. Then day before final grades were due I adjusted it back down to what they deserved. Locked my classroom and enjoyed my summer.",
            "I teach adults and I still have the parents ring me when they don't pass.  I tell them under our countries privacy Act I can't tell them a thing.  Doesn't stop them yelling at me.  I tell them it's simple in my class - you do the work and you will pass.  If you don't you won't.  This is adulting now.  But so many kids have been \"protected\" by their parents they can't even catch a bus.  I am constantly shocked by how little practical life skills a 25 year old can have.",
            "These same parents will wonder why their child suffers from failure to launch and lives with them forever",
            "Just laughing imagining the kid who didn't turn anything in being like \"it's a miracle!\" Haha",
            "You graded everybody based off the curve established by your admin on that one student.  Seems fair to me.",
            "I would have given her an 80 and everyone else a 100",
            "This was a particularly good one.",
            "You were really a hero here, glad for teachers like you my whole life.",
            "Get straight A's in HS through bullshit methods only to go to a big university and get absolutely destroyed. Nothing gained whatsoever.",
            "UPDATE GRADE\\_BOOK SET GRADE\\_VALUE=100 WHERE STUDENT\\_ID=\\*;",
            "How the hell did it not bring at least three parents on the barricades with perfect grades?!\n\nI **hated** teachers giving overall good grade passes. I was a straight A student and worked for it. I would have snapped if I would have realised someone is giving their whole class a  100 because *for God damns sake* it was so invalidating to my efforts!\n\nAnd I know I want the only one who took pride in her work - andd whose parents gave a shit about effort being connected to grades.",
            "You’re not a bad teacher, but the kid had bad parents. This is like those who tell their children they are queens and kings, eventually they believe it- they are being set up for failures. The my “kid” is a “good” kid is now facing jail time because mom and dad always got them out of trouble like this girl’s parents are doing. Not saying she’s gonna end up in jail but there will come a time when all this will slap her in the face. Education really is the key to ending up in a good place. But you tried - and failure will come soon to this entitled kid",
            "This is hilarious!",
            "That is very unethical for the principal to ask you to change it, and you didn't have to if you didn't want to. It would have been best to lodge a formal complaint against the principal so that this type of situation doesn't happen again.\n\nAlso, by not sticking to your guns, the Karen behavior was reinforced and will be worse next time.",
            "I’m a teacher and anyone that works in education has had at least one kid that does this. Always shocked when parents in education enable this behavior in their own kids.",
            "I could have written this story except the student was an athlete whose scholarship was in jeopardy. I handled it the same way. I was never again asked to change a grade.",
            "Since the grade seems maliable atleast for a short period of time, I would have raised their grade, and lowered everyone else’s. 2 parents complaining vs every other parent complaining…. Hmm, principal might reconsider",
            "And every body clapped",
            "There needs to be some sort of accountability office above the district level (ideally state, preferably federal) where this sort of undue pressure and obvious nepotism can be reported.\n\nIt is a travesty that you were asked to do this. The principal should have never let it even get so far as talking to you, and should have certainly never asked.\n\nYou handled it with aplomb though. Well done, given the aggravating circumstances.",
            "Shame on the parents. Kids need to understand that their actions  have consequences and the real world is full of disappointment.",
            "That principle is spineless and pathetic in every way....and those parents have failed thinking they can pull this crap and there kid will coast through life with no bumps....wait until the real world hits and mommy and daddy can't help...also so pathetic.",
            "As a child of teachers, I have noticed that teachers are either very good parents or terrible parents. Never seen a teacher that was an average parent.",
            "This is the way! No ‘special’ treatment. Parents like this HATE it when you cover yourself. I’ve had a few like this over the years. Good job! ❤️",
            "The hero we didnt deserve.",
            "As a teacher, the worst parent experiences I’ve had are people that work in my district and I HATE seeing a district email on the contact info.",
            "Next time this happens, if you have a union rep, make sure they're in that meeting with you, the parents and the principal. Also your principal is a spinless pos.",
            "Very well done. That was crafty, and probably afforded you some points of respect",
            "You're kinder than me. I would have given the brat a 90% and every other kid 100%.  After all the parents demanded an \"A\" grade.",
            "Her parents and their enablers aren’t doing that kid any favors.",
            "My mom was a teacher at the school I went to for a few years and if I had ever done something like that girl, she would have tore me a new one and given the school permission to paddle.",
            "This girl’s gonna be a stereotype in a few years",
            "Not all heroes wear capes.\n\n(Question: You do not wear a cape, do you?)",
            "Good on you. One of the biggest problems with integrity is that it requires someone with integrity to recognize and appreciate it.  Entitlement is poison to learning.",
            "Damn, imagine being parents, and working in education, and knowingly depriving your child of an education, this is child abuse.",
            "The parents won’t be able to do this when she is in college or university. They are setting her up to fail.",
            "You got off easy on that one.  I've taught in one of those small districts and when dealing with faculty's kids it can either be very easy or hell on wheels. If it was your first year, you're lucky that you were rehired the next year. (Depending on the school system's rules.)",
            "my mom used to straight up interrogate me on my stories before ever contacting a teacher. “are you sure this is what happened because i will email the teacher about it?” parents who take their child’s side on every single issue are not parenting their children",
            "I worked at a small school district. The good o'l boy system is strong. A lot of people are untouchable and can pretty much do what they want to do.",
            "Ohh, she is going to have a huugggee problem in college!!",
            "She won't get far in life if this is how the whole family acts",
            "That kid is going to have a hard hit in the real world.",
            "Jared kushner",
            "They’ll grow up stupid, not your fault.",
            "This girl is fucked in life.",
            "You should have changed her D to a C/B while everyone else gets an A",
            "I was told that 68s always had to be raised to 70.\n\nSo I made sure that any six weeks' grades that were 78-79 became 80s, 88-89 became 90s, and 98-99 became 100s.\n\nI also rounded up my 67.5s, 77.5s, 87.5s, and 97.5s.\n\nAnd anyone who made a literal 70, 80, or 90 got an extra point so that they didn't look like someone who got rounded up.\n\nTeaching was fun.",
            "People who are criticizing you most likely have never worked in a classroom. The last couple years have been really bad. Parents aren’t parenting and students are extremely immature for their age likely as a consequence of Covid interrupting their social development. I don’t blame you one bit.",
            "This kind of reminds me of a story from the university I used to work at.\n\nProfessor teaches class. Student is failing class. Student gets bad grades. Student's parents are huge donors.\n\nProvost demands professor change student's grade after parents complain. Professor refuses.\n\nStudent suddenly claims sexual harrassment. Professor is fired. Professor sues university for wrongful termination.\n\nProfessor wins BIG in lawsuit against the university. Provost somehow still gets the new Computing Services section of a building named after him.",
            "This is awesome. I went to uni with a bunch of entitled Torontonian private school kids who got in with scholarships because their grades were so high. They would tell me with pride about how they would talk back at their teachers and their parents would essentially blackmail their teachers saying \"you have to do what I say because I pay your salary\"...\n\nI went to a smaller city public highschool and worked my ass off to get my grades. During first year, this difference was oh so evident. They struggled a lot when I didn't.\n\nDon't give up on fighting the good fight!! Bravo to your creativity in fighting against this corruption! Please don't take any of these other comments to heart; sometimes you just have to let kids learn the hard way. It sounds like you did everything you could to modify their behaviour.",
            "Her parents are setting her up to fail in life. Sad",
            "It was a good idea to give them all the same grade. No special treatment. In my country, this would never fly because even if students get straight A's for assignments, tests and exams tend to be moderated by the national department of education. Sure she'd get straight A's, but she'll definitely fail at the end of the year.",
            "Honestly? Don't let internet strangers hurt your feelings. Fuck them, and  *especially* the parents, you did the right thing. Our society is the way it is bc of parents like that. All these nonsensical, superiority complexes have been running amuck and getting out of hand for far too long. I ran away from home when I was 13 (\"ran away\" when I was really just out after curfew, but w.e) and the police officer that had responded to the call told my mom \"kids nowadays need to be disciplined more, they're being spoiled too much.\" That was 16 years ago and it's only gotten worse since then.",
            "A girl in my class was a straight-A student. She wanted to be valedictorian.\n\nOne day she gets an assignment back. A-. She lost her shit. She refused to eat for 3 days, and her dad - pastor of a local church - went to the teacher and begged her to change it to an A. And the teacher did. \n\nGirl ended up fucking around in the last few years of HS and failed valedictorian quite spectacularly. She wanted to go to college to be a marine biologist, but her unplanned pregnancy (forced to keep because Christians) destroyed those plans. She didn't attend college, now she's a stay at home mom with six kids or something. \n\nMeanwhile, our salutatorian worked himself so hard that his mom literally had to force the school to remove some of his advanced classes from his schedule. It was why he WASN'T valedictorian.\n\nTelling your kid's teacher to change their grade isn't going to help your kid. It'll only hurt them.",
            "I’m eager to see the consequences of being a lazy shit hit the little princess and her parents in a few years.\n\nOn another note, how did she even get an A in your class in the first place?",
            "Going through the same thing except it’s with students with 30 or more absences. They got changed to a passing grade. No work for the year turned in/",
            "Working in education, sometimes your worst parents are your own kind. Cant say I miss it",
            "This is why I'm not a teacher.... \nIf you can't make the standards I was raised by then what's the point of going to school....",
            "She’s going to be a dream in college.",
            "It’s absolutely absurd that teachers have to deal with this shit. \n\nI say this as a spouse of a high school teacher who does deal with this shit every year. \n\nAnd hearing these stories from you and her piss me off. \n\nIt’s completely unacceptable to be interrogated by the principle and parents. \n\nYou (should) owe *nothing* to them. \n\nIf your school has union representation and you earn tenure, I’d literally never allow a principle or parent to talk to me like that. You know you’ve provided that student with every (equal) opportunity as other students. It always comes down to: did you try to do it, or not?",
            "Talk about grasping for straws. Parents deserve an F in parenting 101. Also an F in negotiation skills.",
            "I fucking love you. I am one of those students that works REALLY hard but has some disabilities so I always grade low. I would die to just randomly get a bump in my grade. Like I'd be so fucking thrilled. Like someone actually gave me a chance. (I'm not bad at assignments just exams/tests and it brings my grades down so bad when we have 60% exams)",
            "You did that kid more of a favour than her parents did",
            "Ah reminds me of the time my friend was caught buying Adderall off this girl whose dad worked for the school district.  My friend got charged with buying drugs and spent the rest of the year in jail, she just went to an alternative school for the rest of the semester.",
            "I don’t understand how people see grades as a goal, instead of the assessment of capability that it is.\n\nSure, you want your kid to be a capable person… changing the grades doesn’t make that happen.",
            "It’s against the law for them to ask you to change her grade…just sayin’.  You are in control of your grade book and no one else.",
            "What a BOSS MOVE",
            "You’re a boss 👏🏻",
            "I would’ve dropped it to an F and been like ok if you genuinely want me to change it she can sit with me during lunch and complete her work",
            "Funny how the paerents accusing you of being unfair.... is acting, unfair,    quite the paradox",
            "As a father I will never fucking understand doing this.  Change her grade are you fucking kidding me.  here is my instructions, here is her work you tell me where this is an A (insert project/paper/worksheet here)",
            "At my college, my professor caught a classmate cheating. He was blatant about it, too. He had a cheat sheet hidden in the test stack and would pull it out when the professor wasn't looking. He got cocky and pulled it out when he thought the professor stepped outside. The professor was just walking to the back of the room to observe from another view. The student got an F. Since this was the final, he was going to fail the class. His parents somehow got a lawyer to type up some letter and threatened a lawsuit, and claimed it was his word against the professor's. The school didn't want to deal with it, so he ended up retaking the same test and got a passing grade. FU Joel.",
            "It also continues in adulthood for some…..at one point in my career I took on a sales management role , we were hiring an inside sales representative and one particular individual we interviewed had his mother call me to ask me to explain why he’s was not hired, asked me who was hired and what made she/he better than her son and when I declined (politely) to answer asked for my bosses name!"
        ]
    },
    {
        "post_id": "7v086q",
        "author": "0000001A",
        "title": "Have a problem with the policy? Fine, I'll change it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7v086q/have_a_problem_with_the_policy_fine_ill_change_it/",
        "score": 26369,
        "num_comments": 326,
        "created_utc": 1517674824.0,
        "selftext": "I used to work as an administrator in a secondary school in the US (Grades 9-12) around 10 years ago. We were a school that didn’t have a specific “zone” or neighborhood, so to speak. Some of our students lived 30 or 45 minutes from the school, which made it necessary for us to sometimes conduct business with parents or guardians over the phone as opposed to in person.\n\nOne day I met with a Senior (Grade 12) who was in a class that he and his father had deemed too hard for him, and since they didn’t want it impacting his ability to attend college, asked for him to be changed out of the class. It was early in the semester, and there was plenty of space available in other courses, so I had no problem doing it after a conversation over the phone with his father. The student was a good guy, and he was totally grateful to me for helping him out. He would now get to enjoy his last year a little more, with one less difficult class to worry about. \n\nThe next day, I get a phone call in my office from mom, who is irate. She spends approximately five minutes berating me about changing his schedule. I indicated to her that dad was on the contact list for her son, and he was allowed to make these decisions if he chose to do so. She is the person who put dad on there several years before.\n\nEvidently, mom put dad on the list before their divorce. She had raised the child over the last several years by herself (according to her), and she should make all of the decisions. I didn’t know this, and the records didn’t reflect it. Since she knew this argument wasn’t going to work, the next objection was against our policy of making decisions over the phone. The conversation went something like this:\n\nMom: “How do you know for sure it was his dad on the phone? There’s no way you can be sure. I can’t believe you would ever make a decision like this without a parent present. By doing business over the phone, you could be speaking to anyone.”\n\nShe continued on and I tried to explain that it is necessary at times to use the phone, since parents work in another town and may have to travel an hour or more to get to the school. Well, she wasn’t buying it.\n\nSo finally, I relented. “Ma’am, you are right. I will no longer make decisions like this over the phone. I am going to insist parents come in and meet with me in person.”\n\nMom: “Good. Now I need my son to be put back into the class he was in originally.”\n\nMe: “Ma’am, I’m sorry. You are going to have to come in and meet with me. I’m no longer changing schedules over the phone. How do I know you are this student’s mother?”\n\nMom: “I can’t do that. I live 45 minutes from the school, and I work every day.”\n\nIt was at this point she dropped all of her objections.\n",
        "permalink": "/r/MaliciousCompliance/comments/7v086q/have_a_problem_with_the_policy_fine_ill_change_it/",
        "comments": [
            "Instant non-gratification. Most excellent.",
            "This is too perfect. It reads like a comedy sketch!",
            "She must be a piece of work. Surely, *surely* she could have seen this coming?",
            "As a teacher, I love this so fucking much. Thank you. You made my day. ",
            "I don't even understand why a parent was involved in the first place. I chose my own schedule in high school, and I changed out of a couple classes when I realized I wasn't interested too. My parents never had to get involved. As long as I was meeting all graduation requirements, why would they need to be?",
            "Foisted by her own petard. Well played.",
            "What logical reason could she have for wanting her son to stay in a class he will probably fail? Does she just want to rub his nose in stuff he can't do?",
            "[deleted]",
            "Thank you, that was cathartic for me.\n\nWell worth the 3 minutes to read, would read again: 🌟🌟🌟🌟🌟",
            "Mom sounds like a bitch, but I've sort of been in this situation. After my divorce, before my ex had an order of protection placed against him, I had full custody of the kids and he had visitation. Apparently on one of the visitation days he filled out some form at school that removed me from the contact list and told the school I was no longer in the kids lives. Essentially, all phone contact from the school went to him. I still got all the folder contact, but anything serious enough for a phone call... straight to him. I didn't find out until my daughter's speech therapist noticed it on her file when trying to schedule her therapy for the year. I had to fax a copy of the divorce decree and visitation schedule to school to prove I hadn't abandoned my kids. \n\nSo who knows, maybe there was a reason mom didn't want dad dealing with this stuff. Maybe she was just a jerk. Who knows.",
            "This is truly malicious compliance! Well done!",
            "Sudden realization are the reason i love to come here",
            "Reminds me of [Rita Pierson](https://www.youtube.com/watch?v=Lju4BweO7zQ) telling a parent that her son can come in and leave whenever he wants, but good luck with transportation.",
            "She either has a reeeeally shitty job that wouldn't give her 2 hours to take care of her kid's school matter, or she wasn't even that interested in the kid's welfare. If the latter, it probably means she was trying to change the schedule back not for anything to do with wanting to challenge her kid academically or something, but instead just to contradict the kid's dad.",
            "Have a problem with the policy? Fine, I'll change it - \n\ncheck out the hook while my DJ revolves it.",
            "well played",
            "Just wait till she shows up, insisting you change her sons schedule back.",
            "Check out the hook, while my assistant arrange it.",
            "I really hate that at school you are unable to pick your own classes and that your parents have more of a say in it than you do. ",
            "Wow...quite the finishing move 10/10 would read again ",
            "Short. Simple. Sweet justice. Love it!",
            "This mom is also the worst type of person. Expects something to be put into place, yet expects it to not apply to her. ",
            "If this is true, I would've loved it so much I would've been aroused.\n\nIf it's not, I don't even care and you should look into writing.",
            "She doesn’t seem very bright though ",
            "How the fuck did she not realise that was coming ",
            "This reminds me of politicians that change policies so they can put up religious statues only to regret it when the Church of Satan wants to erect a statue right next to it. ",
            "Why wasn’t the son involved in making these decisions? He was a senior?",
            "At least the kid didn't get any of the fallback from his mom's actions ",
            "Kudos OP, I definitely would’ve only thought of that later in the shower and kick myself for not saying it",
            "I could see why she was annoyed if the Dad had done it without consultation of the student, but you had talked to him and he was completely enthusiastic about changing that class. He's almost an adult and should start getting used to making their own choices anyway. \n\nEither that mother is going to have trouble letting her baby go or the divorce was so bitter she can't handle the father being involved in any decisions regarding their child. ",
            "This is the kind of post this sub was *really* made for",
            "That musta been fun getting someone to shut up.  You used her own argument against her, too; haha! Tres ironic.\nI know, this is a place for malice.  I wonder, still, would the responsible thing to do have been to verify who was the child's custodial parent?  ",
            "You flipped it right back around at her",
            "I wish more stories on here were this short. A good read, without unnecessary details.",
            "damn that was risky, in case she did actually come in, i would have hit her up with \" I will talk to the father in person \"",
            "We just had to have a parent sign off on a form. Which a buddy did for me in the school cafeteria one morning. Get over it lady. The kid would find a way. Good on you for putting her in her place.",
            "I can't believe that woman is divorced. Harpy.",
            "This is delicious. ",
            "Cool, so did the student end up attending college? How has that worked out for them?",
            "Divorced you say?  Perhaps he's his own particular shade of nightmare, but I think I might have an idea why it happened.",
            "I work in the front office of an elementary school and we run into issues like this all the time. I feel your pains. It’s all about identification and it’s the biggest problem we have. People will walk in expecting to check out a child, eat lunch with them, change their transportation, and they will have absolutely no ID on them. And they’ll insist that they are a student’s guardian as if that would prove anything. It may be true but we have no way to check and even if you are, how do we know you’re allowed to pick them up if there’s court docs on their profile? \n\nParents will get upset and start giving us sob stories about how they’re in a financial bind, live on the other side of the city yada yada yada can’t you just make an exception? So we get it approved by admin and then they do it again a week later. \n\nWe also have parents call in saying uncle/brother/friend will be checking out their child. We tell them we can’t accept that info over the phone since we can’t confirm they’re the guardian. We compromise by accepting a faxed note with a copy of their ID. They’ll bitch they don’t have time to do that or don’t have they’re ID on them anyway. \n\nI actually love my job but I hate the parents. I want to punch them every time they walk in and flat out say they don’t have ID, openly admitting they drove from their home or from shopping without it and expect to pull their kids out early. \n\nThe problem is that a lot of the issues will come up an hour before dismissal and it becomes a pick-your-battle problem. Do you let this person take the child because you recognize them from last week, or do you make them go get their ID at home and potentially have to sit with their child for an hour after school while they fight the big city traffic just to make a point?\n\nFuckers say they absolutely love that we check IDs every time until it inconveniences them.",
            "She sounds like she has a short haircut",
            "This is one of the most poetic stories I've read on here, thank you",
            "Reads like a rage comic from 2007\n\nMOM RESIGNED!",
            "Shouldn't a senior in HS be dealing with this kind of stuff himself? ",
            "That's some very quick thinking! Well done.",
            "This sounds really familiar. I'm pretty sure I've read this before but this is a shortened version",
            "Hnnggg that felt good",
            "Damn that was a good read",
            "That's fantastic. ",
            "Smashed in that own goal 😂 \n\nLove it!",
            "This is awesome ",
            "Holy shit... this is actually some of the best material I've ever seen in this sub. Bravo!",
            "Wow",
            "This is so good I can barely believe it's true.",
            "Amaaazing!!!!",
            "I love storie like this. They are hilarous. You were all too kind to her, and it bit her in her own silly ass.\n",
            "nice",
            "Sounds like me and the cable company. Im the customer so i dont know if it counts here. They wanted to charge install for the tv and install for the internet even though they can do it in one visit. So i asked then to install tv on Tuesday and internet wednesday.  I got my discount",
            "I'm upvoting because - karma.",
            "...YES YES AND YES...",
            " Saw where this was going, still mentally applauded. ",
            "I just read two posts that were either not compliance, not malicious, or both. Thank you for the complete turnaround with this great post.",
            "I come here for stories like this.",
            "Well played.",
            "Satisfying like a cool sip of ice water on a hot day,  mmmm.",
            "I don't get what she was thinking. The same thing could be said about her. ",
            "I believe this story until the ending.  Pretty sure someone like that isn't going to let you win that easy lol.   If there's more to it please elaborate.",
            "This, right here, is why I try to be reasonable.\n\nPeople are too wrapped up in the glory of their own specialness to see they're just another asshole like the rest of us. ",
            "U need to give us more of the conversation. Even if it's just approximations. ",
            "[deleted]"
        ]
    },
    {
        "post_id": "nlk4yx",
        "author": "joeltheconner",
        "title": "You want to book the hotel? Sure thing, babe!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nlk4yx/you_want_to_book_the_hotel_sure_thing_babe/",
        "score": 26339,
        "num_comments": 392,
        "created_utc": 1622043964.0,
        "selftext": "Here's a simple and fun husband and wife MC from yesterday for you. On mobile, tldr etc.\n\nMy wonderful family of four are on a trip to visit family and friends. Four years ago, on a trip with the same itinerary as this one, I (husband) booked our hotel as I usually do. I am what you would describe as \"thrifty,\" and I don't like spending a ton on hotels when we are basically just sleeping there.\n\nThe hotel I booked for this leg of the journey was probably not the most high class and sure...it was not in the safest area of town. This was definitely a hotel where some acts of questionable legality and morality occur. In my defense, it was a VERY last minute booking as we were supposed to be staying with family and there were very few options available under $150 a night.\n\nThe stay there ended up being fine but it has been a long running joke between us for the past four years.\n\nWe are now visiting for the first time in four years. I went to book the hotel, and my wife said \"No way! It's my hometown, and I am doing it this time.\" So, she pulls up Ye Olde Priceline and starts looking at places...specifically looking for a place with a pool for the littles. She looks at one, reads the reviews and details, and says it looks good...especially for the lower price! She even calls to make sure the pool is open because of Covid. I look at the photos, and look back at her thinking she was making a joke. She was not. I just smiled and said \"whatever you think, babe!\"\n\nYep, you know what's coming. \n\nAs we approach the hotel, I see a look of confusion slowly wash over her face. She says \"Wait, is this...\" and trails off. I reply with a resounding \"Yep! It sure is!!!\"  She booked us in the exact same hotel that she has been griefing me about for four years. I laughed and laughed and laughed. She cannot believe she did it, and also thinks it is hilarious. I am vindicated!\n\nTLDR: wife gives me grief for four years for booking us at a shady hotel then proceeds to book us all herself at the same shady hotel.\n\nEDIT: thanks for all the comments and awards! Glad this could bring you so much joy. Just finally told her that I posted it and people are loving it, and she wanted to thank you all for helping me revel in my rare opportunity of getting one over on her...because that is a rare occurrence with us. Pro tip: always marry someone smarter than you.",
        "permalink": "/r/MaliciousCompliance/comments/nlk4yx/you_want_to_book_the_hotel_sure_thing_babe/",
        "comments": [
            "The best part is looking over her shoulder and letting her do it anyways. Somehow keeping it all together for that payoff of \"hey, this place looks familiar\"",
            "Twice makes it tradition. You can no longer go anywhere else.",
            "Glad she had a sense of humor about it.",
            "Pro tip: find the price on price line and then compare to the hotel website. If it’s higher on the website, you can usually call the hotel to get that price. The hotels have to pay a cut when it’s booked through a 3rd party instead directly.",
            "Wholesome. Good read",
            "This could totally happen to me.  I have an awful visual memory for people and places and would fail to recognize the hotel.  My husband, on the other hand, would probably be able to spot it from the other side of the room if I had it open on my phone.\n\nCongrats on your vindication, dude!  Bask in it!",
            "I would have taken it a step further and called the hotel in advance to ask that the concierge greet her with \"oh welcome back, thanks for staying with us again!\"",
            "Hah! That's amazing.\n\nI booked us an Airbnb in Los Angeles.. was pretty sure it was in a good area of town, checked with a friend who lived nearby, she said it was a fine area of town.. Turns out it was 1/2 a block from Sunset Blvd and had a lot of homeless people living on the sidewalk out in front of the place.  My kids were horrified at the human feces just hanging out on the sidewalk as well..",
            "VINDICATION!",
            "This made me cry tears from laughing so hard. I can imagine my wife doing the exact same thing! \n\nSome of the best entertainment and stories come from seedy hotel stays",
            "I read this to my husband.  He rarely laughs at stuff I read him or jokes.  He laughed at this!",
            "ok possibly the best MC ever lmao!",
            "Delightful!",
            "Not nearly as fun, but I got flak for years for booking a hotel for me and my wife for an anniversary.  I made sure to get one with a Jacuzzi for sexy times.\n\nNeglected to notice it wasn't a Jacuzzi, it was a Jacuzzi tub for 1.\n\nI mean she did use it, but no sexy times were had by us in there. Not nearly enough room.",
            "Exact same thing happened to me except for the sweet revenge part. I haven’t been allowed to book hotels for over a decade. Thanks a lot Goodnight Inn near Magic Mountain in Valencia, you ruined me you bastard! Wife and kids couldn’t sleep all night due to hookers arguing with pimps, police sirens, homeless people wandering the parking lot yelling at the wind. The constant grind of freeway noise was almost a relief in between. Wife and I spent the next day getting dragged all over magic mountain, wanting to jump in front of a rollercoaster car just to end it all . Kids had a blast.",
            "/r/wholesomecompliance",
            "Bravo!",
            "I grinned when I read this. Thank you for sharing it.",
            "This is probably the most wholesome MC I've read in here.  I'm glad everyone saw the humor in it.",
            "[deleted]",
            "Some years ago my Wife, who's everyone's trip planner, booked us on a Hotel in Panama City.\n\nIt was in the place nobody wants to stay on a city. We arrived kind of late around 9pm, and we were starving so us tourist decided to go to grab a bite somewhere nearby and get to know our surroundings. Not 50m away from the hotel a police stopped us and inquires what were we thinking of doing, we explained that we intended to eat somewhere close and if he could point us to any decent place. He shook his head and said \"Listen this is a rather dangerous zone so I suggest you go back to the hotel as every single place that you'd like to be in is most likely closed already.\"\n\nSo we sheepily got back to the hotel and ate whatever we had in had.\n\nA few nights after that I woke up in the middle of the night and while I was peeing from outside I could listen to something that went like this:  \n\n\n\"No Ramon, por favor\"  \n*Unilegible Ramon Response*  \n\"Basta Ramon no lo hago mas!\"  \n*Worrysome noises*\n\nWe had a lovely time there.",
            "As a wife, I find this hilarious",
            "I hope you complimented her on how she, \"did such a better job of booking a hotel\" than you did - just to jab her a little more.",
            "[deleted]",
            "Did they at least improve over those four years?",
            "My partner and I booked a hotel in Hollywood.  That should tell you everything, but I just have to add we couldn't sleep all night because of the noisy springs belonging to a *very* busy mattress directly above us.  I am all for live-and-let-live, but for crying out loud, they gotta sleep sometime.  Thinking about it now, we should have returned the favor during the day.  Jerkholes.",
            "Same thing happened to me at the Red Roof Inn in Memphis, TN.  The pool was empty except for a few murky inches of smelly liquid and a shit load of shopping carts.",
            "Being married is downright fucking awesome sometimes.",
            "> Pro tip: always marry someone smarter than you.\n\nI just remind my wife not to complain too much about my choices, after all she was one of them ;-)",
            "I would love to say \" I've  told you\"",
            "… and the kids ask questions about the coin slot on the bed, and the mommies and daddies wrestling on the funny TV Channels….",
            "Mistake 1 is using Priceline.",
            "This is cute. You guys sound like a good couple.",
            "This is amazing. What a great story! 😂",
            "My husband once accidentally booked us at a illegal activity hotel. Thankfully we had been planning to go camping on the road trip so we had sleeping bags to avoid the blacklight crime scene. \n\nNow we refer to it as our camping trip at Hooker Hotel",
            "I swear this gets funnier every time I read it. Thank you so much for giving us all a good laugh. And to all you clever responders another thank you.",
            "Your writing is epic! I also laughed and laughed when your wrote the same hehe",
            "This is fantastic :D",
            "LOL this is brilliant!",
            "Most wholesome malicious compliance.",
            "VIN-DI-CA-TIOOOOON!",
            "This is my favorite post I’ve seen on here so far",
            "Oh I can just picture the long Shrek face",
            "Vindicatioooooooooooon!",
            "You guys are a match! Two peas in a shady pod.",
            "Oh, I like it when there’s a happy ending.  So rare for these stories.",
            "I’m glad this story actually ends on a mutually happy note! There’s no villain in this one.",
            "You and your wife are well matched because you both have a healthy sense of humor.  Your kids are lucky to have you both.    \n\n\nThanks for posting such a fun story.",
            "lol! glad to know other spouses have this same disagreement. I will book the CHEAPEST thing I can find, especially on road trips where it's only literally to sleep. My husband doesn't like staying in hotels with drug dealers or \"shady people\" in the parking lots, though. We've had some doozies, but 90% of the time our cheap hotels work out fine. But it's always a point of contention. For some reason, when I first was old enough to book hotels they were like $39-$99 a night, so I still look in the $50 price range and consider anything over $100 an unobtainable luxury. This is difficult in many cities and peak times... I don't know why my brain hasn't updated hotel rates yet.",
            "This one was worth the read 100%",
            "The funniest thing is how it’s been a running joke for 4 years but she still managed to forget the name of the place when she was booking it.",
            "Having a wife who laughs at this situation is why you’re the winner here.",
            "Ok so my mom, a friend, and I stayed in a hotel near Richmond, VA some years ago and we pull up and this place looks SKETCH. Like I'm 100% sure there were drug deals going on. It was barely lit and looked pretty grungy on the outside. But my mom is like...\"Everywhere not $400 a night is booked, let's just try it. If it's bad we'll leave and I'll do a chargeback on my CreditCard.\" \n\nYo this place was AWESOME. They had granite countertops, a nice big screen TV, a microwave and fridge, garden tubs, and it was CLEAN. We were speechless. Was only like $35 a night for a 2 queen room.",
            "\\>  I laughed and laughed and laughed.\n\n...all the way to the couch, for the duration of the stay.",
            "If I could like this more than once, I would!!!!",
            "Apparently you know my wife..",
            "🙄😂😂😂😂😂😂😂 Karma works in mysterious ways!!!",
            "[deleted]",
            "When you design from the same requirements document, the solutions tend to look the same.",
            "A rare win for the husband. If I know anything from sitcoms and pop culture, this never happens. Congrats.",
            "Man I can picture you as “Ross” from friends when he said now I’m so happy when he got back at “Rachel”!!😂\nYou kept it inside for 4 years, talking about being patient haha! Good one man and bless your family :)",
            "This is the cutest thing ever! Thank you for sharing!",
            "so did it have a pool and has it been opened?",
            "It's so great to read a good natured MC story!",
            "Glad she’s being a good sport. I like stories that are light hearted. Too much serious shit goin on...",
            "Oh man this is great! Innocent fun and great memory for both of you!",
            "> Pro tip: always marry someone smarter than you.\n\nDoesn't this advice *de facto* require that you bamboozle someone who is in fact smarter than you are into marrying someone dumber than they are?",
            "These was a great story. LOL!",
            "Hahahahahaha!!!! I just love that you guys are so much so on the same page and have the same thought process. This is great",
            "Great story! 😁",
            "Most wholesome malicious compliance post I've read! I'mma remember this for years, thanks.",
            "Ok this is a good one. Take my free award!",
            "Now that’s a win mate",
            "I love it when couples have little paybacks like this and unsteady of being nasty about it, they just laugh and say “okay, you got me good!”",
            "That's so wholesome, I love it so much! You must be beside yourself with this, I can't imagine you'll forget about it anytime soon. Oh the sweet sweet satisfaction of that moment.",
            "Hilarious! The best Malicious Compliance yet! Thanks.",
            "Lolol, truly exposing the difference between information and reality, decisions are an expense",
            "This put a HUGE grin and smile on my face. Thank you SO much for sharing!!! Love it",
            "hahaa this is awesome!",
            "Did she relent and get a bit of a giggle from it?",
            "Flawless victory. Fatality",
            "I feel like this is the difference between off brand and on brand food \n\n\nI remember when I was a kid I complained about my mom always buying off brand soda so she blind folded gave me two cups one with coca cola and one with off brand coca cola and I couldn't tell the difference",
            "Hotels are fucking stupid, u can't even sleep in",
            ">I am vindicated!\n\nLOL. :)",
            "There's no need to tell us you're on mobile",
            "\"How is he?\"\n\"To shreds, you say...\"\n\"and his wife?\"\n\"To shreds, you say.\"",
            "With kids I would have been more careful.",
            "There are very few people who know more overall than me, I am the embodiment of \"jack of all trades master of none\" I know some about just about everything that isn't celeb drama or other dumb stuff like that. But if you want advanced knowledge on most things go ask someone else, unless it's minecraft, then I am your guy.",
            "Okay, that's funny, buuut... that's not malicious compliance.  Wife booked the hotel, not OP.\n\nAnd I know some people are going to argue that this is still compliance... but there's nothing malicious.",
            "\"Pro tip: always marry someone smarter than you.\"  \n*cries in forever alone tears*",
            "I stopped reading when you said \"the littles\".",
            "This is probably the best MC post I've seen by far.",
            "How this got 18,000 upvotes I'll never know.",
            "[deleted]",
            "[removed]",
            "[removed]",
            "A great switcheroo! But I honestly don't get what people think is the big deal about having hotel neighbors who are doing drugs and hiring sex work. If you rent a high-rise apartment, you absolutely have some neighbors there who are doing drugs and hiring sex work. \n\nI mostly care if the place is clean and has adequate quiet for sleeping.",
            "Fool me once...",
            "Sort by cheap to not cheap and you gonna get the same kinda places every time.",
            "[OP as they pulled up.](https://youtu.be/xSTN3mHEAOA)",
            "Can you teach us good sir?",
            " Not only does she book the shady hotel, but it is in her hometown?",
            "A shady hotel with a pool cant be that shady",
            "[deleted]",
            "I love that this ended on a happy note.",
            "haven't i read this one before?",
            "This needs a new phrase. You told me so?",
            "My wife and I stayed at bargain hotels, too. But one bad stay, in the middle of summer, no AC and no open rooms made us pay a bit more to be closer to things, and make sure we have basics like AC in the middle of the summer.",
            "\"Oooooh, Self Burn - those are rare.\"",
            "[Live shot of OP getting out of the car.](https://www.youtube.com/watch?v=xSTN3mHEAOA)",
            "[deleted]",
            "This could be us…",
            "Wife: \"Never again are *you* going to book us there.\"\n\nAlso wife: \"I booked us there...\"\n\nSo how many stars out of 5??",
            "Congrats on having the only believable story I've ever read in this sub",
            ">Pro tip: always marry someone smarter than you.\n\nREDUX, so helpful in life.",
            "Anyone else get here from Malicious.Reddit on Instagram?",
            "My husband gets praised and he gets to be right a LOT. I am pretty sure he would have teased me; but also had me cancel to booking after I made it and rebook somewhere else!  I don’t know how you kept your mouth shut!!!  Ha ha ha ha. This is soooo good on soooo many levels"
        ]
    },
    {
        "post_id": "yyl7lm",
        "author": "zorggalacticus",
        "title": "meeting counts as lunch break? Alrighty then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yyl7lm/meeting_counts_as_lunch_break_alrighty_then/",
        "score": 26263,
        "num_comments": 746,
        "created_utc": 1668781160.0,
        "selftext": "So we have this big company wide meeting every year where the ceo comes in and discusses profit margins, raises, plans for the future, etc. It lasts about an hour, sometimes more. Meanwhile, our work gets backed up while we are stuck sitting in this meeting and we always end up working overtime.  Well this year the boss in our department says that the meeting counts as our lunch break. I give my coworker the look, we glance around. Seems everyone is in silent agreement. We all show up to the meeting with our lunch boxes and proceed to casually eat lunch at the corporate meeting. All 60 of us from our department. The ceo stops his spiel after a few minutes, our supervisor claims ignorance. I speak up and say boss said this counts as our lunch, and I'm not skipping my lunch. Boss tries to deny having said that. Ceo asks who can verify this and everyone raises their hand. Guess who got an official reprimand from the ceo himself? One more of those and boss is out the door.",
        "permalink": "/r/MaliciousCompliance/comments/yyl7lm/meeting_counts_as_lunch_break_alrighty_then/",
        "comments": [
            "I'm cracking up at the audacity of someone who would try to lie in front of 60 people who can call him out on it. 😂",
            "My old boss used to buy us lunch during the all hands meeting",
            "Did he honestly think all 60 people would simply take that lying down? That no one would say or do anything?",
            "I kinda understand why the boss thought he could get away with the initial statement about the meeting being lunch.  But when all 60 people showed up with their lunch and started eating it, I don't get how he could possibly thing that these people *who were already calling him on his BS* wouldn't call him out for lying about it in front of the CEO.  Does he think that if he just keeps shoveling the BS over and over they're eventually going to accept it?",
            ">One more of those and boss is out the door.\n\nSomething tells me that this is not his first fuck up.",
            "Dang, I'm union and boss came into break room while I was eating lunch trying to talk work, i explained that I'm contractually required to take a 30 minute uninterrupted break and if she wants to discuss work it will reset my break. She said it would only take a minute. I sat there on my phone for 30 more minutes.",
            "If I was the CEO, I would have fired the boss. Once your employees start lying to you, there's no going back.",
            "I used to own a house near work and would go to it every day for lunch and a nap.  Sometimes the SO would hook up with me there and we would have a nice little afternoon romp.  Most of the other people ate in the lunchroom, and we had the same thing only quarterly.  The execs would put on the dog and pony show and expect everybody to attend.  We had this one admin assistant who really took it personally that I would not stay for the show, like do you have to go out \\*every\\* day.  Um lunch is \\*my\\* time.  I also had a position where if I was there people would talk shop, so the simple answer was to not be there.  Plus it was really recharging to get a little nap.  I finally chatted with the CEO about it and he was a good egg.  He had never really thought about it, and he moved the meetings he wanted everybody to attend to company time, and got pizzas for it.  So they got 100$ attendance and people were happy.  This was also around 2000 and I was in charge of dealing with all the computers and software we had, so I was there late nights a lot and so was the CEO so he knew I was not a slacker or anything.",
            "Wait, so you are forced to attend the meeting? That sounds like paid time, not lunch- unless lunch is to be provided at said meeting.  Any manager foolish enough to cross the lines this far really needs to be dressed down in epic style.",
            "[I don’t know if you’re allowed to do that.](https://m.youtube.com/watch?v=OSjXIT1brSw)",
            "Yeah he definitely didn’t think that through.",
            "Nice.",
            "I've got several bosses in trouble before. So satisfying",
            "Man really tried to gaslight 60 people.......",
            "CEO- “you for real?”\n\nBoss standing on a plank over shark tank “ Who me!? Nooooooo… splash!”",
            "If this was in the US, I'm pretty sure it's an explicit violation of labor laws. Boss could have cost the company a shit-ton of money with that stunt.",
            "My last lunch and learn began at 11am. 1 hour meeting and the admins began setting up food at 1145. Had a great BBQ spread. Spent the next hour conversing about work. Completely paid lunch for all. \n\nI love my company. Been there over 9 years now.",
            "I had completely opposite experience at one place. We went to lunch as a whole team and this time was logged as a meeting every day. Then we went home an hour earlier due to no lunch break.",
            "I do believe that violates Federal Labor Laws, and would have been just cause for the CEO to walk the boss out the door. Your boss got lucky, and Kudos to your CEO for being a decent human being.",
            "I don’t think you’re allowed to do that",
            "Various Departments of Labor might have some things to say about this.",
            "[deleted]",
            "Oh yes my old workplace did exactly the same thing, scheduled a meeting in our lunch break. The only suitable meeting place was the lunch room. People were getting up during the meeting to heat their lunch, filling their coffee cup. People from other areas wandering in microwaving stuff, sitting at the table. The meeting was bedlam.",
            "When our manager tried this with us, our entire Union production crew showed up with Indian Take-out.   The whole meeting room smelled like curry.",
            "I had a similar situation, but ours were a 4 hour meeting. And because of low blood sugar I actually started falling asleep. So I got permission to bring my lunch with me. Juice boxes slurped with a straw, apples, carrots, individually wrapped sweets, smoothies I'd need to shake now and again and crackers was sone of the items I brought to the meeting.",
            "If the CEO was smart he would have realized the boss just lied to his face.\n\nBoss should have been fired on the spot. I'll put up with a lot of shenanigans. The instant you show you can't act like an adult and take responsibility, you're gone.",
            "I used to work at an AT&T call center. The dress code was casual something or other. Basically, shorts/polos and sneakers was the official ‘accepted’ attire, but tons of people would wear basketball shorts, regular graphic Tshirts, and flippy floppies. Once every 4-6 months, they’d have the big wigs come do a walk through. The big wigs usually tried to sort of ‘catch’ things by coming last minute, but we always knew at least a day or two ahead of time, and frequently we’d get a week heads up. Whenever this happened, we’d be told to wear slacks and button ups. I got to where I hated the place, so one time I just wore my usual cargo pants with a polo and sneakers, not in any way unsuited to the normal standard or job details. I had good hygiene and spent 8 hrs per day at a desk getting yelled at by customers that could only be described as scumbags, fuck being uncomfortable for 8 hrs just so that I could not even be looked at when 6 old white guys walked by me. \n\nWell, I got a very stern talking to as soon as I showed up to work, and they tried to send me home, but wouldn’t you know it, the big wigs walked by right as this conversation was happening and my manager hushed. It was also insanely busy and I told her that if she wanted to send me home, it would take me close to 2 hours with traffic to make it back, and in reality I just wouldn’t come back because what’s the point in spending 3-4 hrs on the road to work 4-6 hours at a job that totally sucks. I hoped I made my bosses look like shit, that place sucked.",
            "Lie like that to me once and out you go! Lying managers/bosses are toxic.",
            "Only an official reprimand? They made what may be an illegal demand and then LIED TO THE CEO!!! Who still has a job after that second part?",
            "A company I worked at tried to give out lunch so that people wouldn't charge the time to the company. But I was hourly and since I was required to be at the meeting, I would charge my time as Admin time.",
            "Had a lawyer boss that did that - periodically schedule a mandatory meeting during the lunch hour. Though she provided food, the implied agreement was that the meeting would supplant our time-to-ourselves lunch hour. I would simply attend the meeting, then when it was finished clock out and disappear for exactly an hour. \n\n\"Where were you?\"\n\n\"At lunch.\"\n\n\"You had lunch at the meeting.\"\n\n\"I *ate* lunch at the meeting, but that wasn't my required-by-law break.\"\n\n\"........ okay\"\n\nShe was alright to work for.",
            "Meanwhile in the tech industry, the company pays catering so we can have free lunch during these kinds of meetings… of course now it’s all remote which is even better and they still let us expense $20 to eat during the meeting",
            "Nicely handled.  If more employees would stick together like this, then the bad bosses wouldn't be able to get away with their bs.",
            "Here’s a quick story. After 9/11, there was going to be a memorial service on 9/14 in our city to help people heal. My boss told me to tell the employees they couldn’t go, we had to keep production going. Most of my department went, I quit the job that day.",
            "Would have been awesome if you pulled a Spicolli and had pizza delivered. 🤣",
            "At one of my first jobs food was provided at the computer steering committee meetings, which were always scheduled from 12 to 1 so they didn't interrupt anything important. The food, however, sucked. I started to make a point of rushing out just before them to get something I actually liked, but it wasn't until the secretary that took the minutes went on her full lunch break directly after the meeting that they started to get the hint that they were being dicks.",
            "Play a stupid game and win a stupid prize",
            "Love it when a plan comes together. (Yes I’m that old)",
            "I don't think I've seen a more appropriate and pointed MC.  My vote for all time best.  At least for this week.",
            "So, timekeeping fraud.",
            "If that counted as my lunchbreak likely unpaid lunchbreak, I would just not attend.",
            "Catfish curry for lunch you say?",
            "Nothing like an official reprimand from the CEO for a boss who tried to pretend he didn't say what he said! Very satisfying!",
            "I have an \"Archer\" lunchbox with a thermos that looks like a bottle of Glengoolie.\n\nWatch me spread out a picnic blanket.",
            "GOOD FOR ALL 60 OF YOU! Well Done! Witnesses, Boss never thought you guys would TELL ON HIM! He got exactly what he deserves! Now some of his ABUSE towards you guys will have to stop! \n\nMaking you guys MISS LUNCH A-N-D WORK LATE….WHAT A HEARTLESS PERSON HE IS!",
            "Um, they can't make you work through your lunch.  You are entitled to go to the meeting and then take your lunch without working.",
            "I would have microwaved fish for such an occasion.",
            "Literally what the fuck did he think was going to happen lol.\n\nI would have brought in some leftover curry or something smelly",
            "Nothing like a spineless boss who doesn't stand up behind his own words.",
            "He should have been fired right there for lying to the CEO about it.",
            "I hated the CEO at my old job but at least he offered food and a break during meetings like this",
            "Honestly if it counts as a lunch break the ultimate compliance would have been to go out to Applebees with the boys, unpaid lunches are not consider “work hours”.",
            "I would be ok with this if the company provides lunch for the meeting",
            "Imagine being that supervisor being called out and losing all respect from the entire company for being a spineless POS liar.",
            "Lmao we have such meetings after each quarter and lasts about 1.5 - 2 hours we get pizza drinks cookies/deserts and all the breaks before or after that. If we finish early we are supposed to just sit that and chit chat and not work.",
            "Well done you!  \nThat was so satisfying. Need a smoke.",
            "This is a good one. Hi 5 to all of you!",
            "What a knucklehead boss. The ceo now knows him personally and not in a good way.",
            "I once had a boss try to give me a promotion without a raise in pay. He said, \"Let's see how you do before we talk about a raise.\"\n\nI said, \"That's not how it works. More responsibility + more work means more pay.\" He wouldn't budge. I walked out. \n\nWhen I went to get my last check a lady I knew from corporate was there with a few other higher ups. She asked me what was going on, and I told her what the manager did. She grabbed 2 of the others and had me repeat the story.\n\nI don't know what happened after that, but they exchanged a *we got him* look.",
            "Amazing solidarity from everyone present",
            "Penny wise dollar foolish.",
            "How did he think he was going to get away with lying to the CEO in front of 60 people who know he is lying?\n\nAnd if he were totally ignorant then why do ALL 60 of you have your lunch there in the meeting?\n\nSupervisor needs to be let go now - talk about ”an integrity issue”!",
            "It’s a rule at my company. If you schedule a meeting during the lunch hour you’re providing lunch",
            "when we have these stupid townhalls they usually cater it. that way no one gets pissed off.",
            "If it's my lunch then I don't have to be there. See ya in 30!",
            "Every single one of your employees are skipping lunch to see you Mr. President.",
            "That is a boss that cannot be trusted.",
            "Well played, and glad the CEO has your backs!! Sounds like a pretty good company with just a few individual bad apples (boss). Pretty sure what he did is illegal in many states and countries, and at the very least just plain rude!\n\nI'd have \"forgotten\" my lunch, waltzed out to buy a sandwich and some nice crunchy chips, or a crisp salad, then walked into the meeting mid-speech - your lunch break, they absolutely cannot prevent you from eating your lunch, and if you need to go out and get something, well you're 100% entitled to do so during your lunch break!\n\nThank god that's a hypothetical in my case, as in my company we'd all just end up taking early or late lunch, before or after the meeting. Meeting time is not lunch time, lunch time is YOUR time, meetings are you performing your job. Also why there's such poor turnout at the \"lunch and learn\" events many corporates like doing. Free lunch (cheap plain sandwich, or even a pizza where you get 1 grubby slice, yay...) doesn't mean that you can take away the \"break\" part of employee lunch breaks...",
            "You can’t skip lunch",
            "Who even gives a shit if people eat during some random presentation?",
            "I am appalled at the number of people who are ok with sacrificing an hour of their own spare time for a $1 slice of pizza.",
            "My boss used to come into my office to talk shop during my breaks. It was so annoying. All I want to do on my breaks is stare at my phone and zone out for 15 minutes. For a while, he was coming into my office a minute (about the time it took to walk from his office to mine.) after the bell rang for my last break every day to discuss what I needed to do the next day. He'd leave when the second bell rang to \"let me get back to work\".\n\nEdit: I should clarify that he wasn't a bad boss, just a little thick at times.",
            "They could get me there by offering free tacos and cats to pet.",
            "When we had those meetings they threw it at a hotel and we got it catered. Lunch buffet. Win, listening to a bunch of shit that could have been sent in an email, meh but lunch was always good",
            "As a person in HR, this pisses me off to no end. Lunch breaks are lunch breaks and they are federally mandated.\n\nLove this malicious compliance. If it happens again, you should all report it to HR on the same day. That’ll get his ass out the door even faster.",
            "Glad to see the CEO isn't one of those, \"it's disrespectful to call him out even when he's wrong\" types who scolds you all for humiliating him. \n\n\"It was wrong of him to tell you you can't have lunch but since you publicly embarrassed him you're all getting a write up.\"",
            "\\*APPLAUSE\\*",
            "If you're going to pull that kind of shit at least buy lunch for everyone.  Ffs",
            "Excellent MC story, and it wasn't a mile long of text, thank you!",
            "Thank you so much for not only having a great story, but one that isn’t a novella like most of these.",
            "Also sounds like a paid lunch to me. I'm in a meeting? I am getting paid. I am eating lunch in the meeting?  Cha-ching.\n\n&#x200B;\n\nedit - spelling",
            "I hope everyone had tuna.",
            "FUCK yes. Well done, all of you!",
            "If you force someone to work through lunch for a meeting like this you have to feed them. How many meals would they have had to provide?",
            "Wonder what would have happened had all 60 filed a complaint with the state about not getting a lunch break (after confirming he didn't intend for you to eat)?",
            "Yeah, been there. The ol' \"WE'RE PROVIDING LUNCH! THEREFORE WORK WHILE WE EAT THE FOOD WE BOUGHT YOU\" trick.\n\nFortunately my current office lets you take an hour after the meeting if you want. Some do, some don't. We're not clock watchers here at all.",
            "Beautifully done.",
            "All y'all are heroes!!!",
            "In most states, lunch can't be interrupted by work or it starts over.",
            "My initial response would have been “Cool! What are you buying us?”",
            "I just love that everyone just understood the assignment lol",
            "My company takes us to lunch at least once a week. Fridge is full of soda, water and beer. There’s frozen food in the freezer in case you forgot breakfast or are just in a hurry. I can expense any office supplies I may need. I’m paid 62.5 cents/mile for traveling for work. I’m paid more than most folks at my station in life and my prospects are good. Our company is growing and the old heads are handing off the baton to a new generation. Oh, and we’re employee owned. We all work out dicks off, but it’s rewarding and we all love what we do for the most part. \n\nHate it for folks that have found themselves in shitty employment for shitty bosses. There’s good companies out there.",
            "My old boss was informed that the new contract trainer told us not to worry about state deadlines. Boss said \"Then don't worry about\".\n\n6 months later District manager comes down with security to check permits. 1/2 the crew doesn't have them. Boss denies he said it.\n\nDM says \"it's he said, she said. \n\nYup 23 to one, we weren't believed!",
            "Oh, the policy. The policy by Boss. Boss's policy. That policy.",
            "Meeting counting as lunch should have provided lunch!",
            "What is with this. Y’all should see what margins most companies are working with, a catered bbq lunch for 100 people is not even visible on a P&L",
            "The old me would have expected food at meetings like that.\n\nThe new me:  it is going to take a lot more than free food to convince me to leave the comfort of my own home to go to a meeting.",
            "You don’t skip lunch.",
            "[deleted]",
            "These guys worked out how to do it right:\n\nhttps://security.utexas.edu/food-policy",
            "For USA, If you do ANY work during break...the break must be paid...IF NOT call the department of labor and get paid.",
            "This is the way.",
            "I'm just, like... the tiredest I've ever been.",
            "We used to have team meetings that were also lunch breaks. But one of us would be charged with ordering lunch from the chef (yup, the company had a bloody chef and they made stuff like curries, Indonesian food, Thai, pies, fish and chips, whatever you wanted) AND we got paid during lunchtime. We also had \"cake day\" once a month with an entire meeting room full of cakes.",
            "I feel like that should have been an instant termination.\n\n60 labor law violations AND directly lying to the CEO?",
            "This made my day. Easy",
            "What kind of adult kindergarten companies do you people work for lmao ? Why didn’t they just provide lunch at the meeting ?",
            "I worked at a company that did things like this. Me and my friend always called their bluff and took a lunch break anyway. Guess what, they never said a word to us because they knew what they were doing was illegal. Unfortunately, the rest of the staff just did what they were told.",
            "This, my friends, is why we need a union. The power of the people always outweighs the power of the company",
            "I love it when they schedule a 'working lunch'. Workers don't get paid and they don't provide lunch.\n\nTaking one for the 'team'.\n\nsigh...",
            "Beautiful",
            "Nicely done to get all of you munching lunch in the meeting.",
            "Is that a hot dog up your sleeve?",
            "A meeting counts as lunch? It's mandatory too? Sounds like a paid lunch to me.",
            "I'll never understand how you can be THAT bad of a manager.",
            "\"they can't move lunch\".",
            "Well done.  I would have loved to have seen this go down.",
            "That boss got SO BUSTED!!!!  🤣",
            " ROFLMFAO.....ROFLMFAO.....ROFLMFAO.....ROFLMFAO.....ROFLMFAO.....ROFLMFAO.....ROFLMFAO.....",
            "you have aroused my justice boner",
            "This is one of those legendary moments where you hope this meeting room had a camera recording so all of the coworkers could watch it later.",
            "Can't see \"no lunch\" working for so many people with certain health issues, you know?",
            "\"you CANT skip lunch!\" \n\nIykyk",
            "Well done",
            "I work at a place that pre pandemic would buy the entire office (60 people) lunch once a month. They actually designed the office around the kitchen to accommodate it. It was amazing",
            "Flawless victory",
            "My work has ‘Lunch N Learns’ which are often meetings about upcoming marketing campaigns we’ll be having or interesting topics that benefit the business if you know them. It’s some hot bullshit and I never attend. Or rather, I make sure my lunch break is at another time if I think the topic is interesting.",
            "We have a town hall meeting twice a year. Lasts about an hour. Then we get a catered lunch. We also have seven or eight Fridays during the summer where we will get catered lunch served, we have an Oktoberfest celebration which is 4 hours long, cooking classes that the company pays for and we just had her Thanksgiving lunch today.",
            "you should’ve hidden a hot dog in your sleeve. \n\nyou can’t skip lunch.",
            "If I'm the boss and one of my supervisors lied to my face while trying to throw the rest of the staff under a bus that would be his last day.  You can't trust anything he says moving forward and the staff certainly know he doesn't have their back.",
            "Should have just hidden a hotdog up your sleeve and eaten it on the sly. *you can't skip lunch*",
            "Sadly not even shocked a boss would do this. What a jerk to sit there and lie in front of all of you too. Glad you spoke up! As a teacher, we have lunch and learns frequently. We have meetings and are expected to work while eating. 🙄 We are supposed to have a 30 minute duty free lunch break. Rarely happens! By the time you drop them off, go to the bathroom, and pick them up..maybe 20 minutes at the most. Too many out, eat with your kids. Any special occasion, eat with your kids. It happens all the time unfortunately, but our state doesn’t allow unions.",
            "If he said it counted as your lunch break, when was it he expected you all to eat, if not in the meeting??\n\nOr did he just not give a shit & expect you all to stave the rest of the day?\n\nWe have lunchtime meetings where I work & we do all take our lunch in with us haha, but our meetings are usually reps trying to sell us something (& they provide lunch), or someone talking about a case study (I work in an NHS laboratory), so it’s a bit different",
            "Spartacus moment.",
            "Well played ;-)",
            "Awesome result!",
            "I love when bosses lie",
            "My first ever gold. Didn't even get a notification for the gold. Got one for the silver though. Thanks for all the awards folks.",
            "I think it's obnoxious the CEO would be upset enough to stop and check. I wouldn't care if people were eating. I teach third graders, and we don't even have a designated snack time in my classroom because my kids are always damn hungry. I let them eat whenever they want and have as many snacks as they want. We don't have lunch til 1 pm, and by that time, most of my class has already eaten their whole lunch and two snacks. 😂🤣 Why do we have to police people like this?",
            "This story made my day. Thanks❤️!",
            "Seriously, I would have had everyone bring in the strongest, nastiest smelling lunch they could come up with that day...",
            "Lmaoo legit clown of the year🤡🤡"
        ]
    },
    {
        "post_id": "tn81tz",
        "author": "Dangerous-Web-2497",
        "title": "Oh so you do pick up after yourself and I am just exaggerating? let's give every man for himself a try then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tn81tz/oh_so_you_do_pick_up_after_yourself_and_i_am_just/",
        "score": 26250,
        "num_comments": 613,
        "created_utc": 1648163022.0,
        "selftext": "Years ago when I just moved in with my then BF (now Fiancé), he was terrible at picking up after himself. He was a self admitted mama's boy and went directly from his parents' house to our shared home.\n\nBarely 3 weeks in I was fed up, so when I told him that I was tired of picking up after him and acting as his maid he hit me with: that's not true, we both clean up equally.\n\nAfter a bit of back and forth he said: well if you don't believe me then let's split the house, you take care of your half and I take care of mine. I took that literally.\n\nGot painter's tape, divided every single room in half (including the kitchen counter, the inside of the fridge, the bathroom counter...). Also he was cocky and suggested 2 months, I shortened it to one.\n\nNot even a week in his half looked like a pigsty and he had no more food (because I stopped grocery shopping and cooking for him), the only exception I made was cleaning the toilet and shower because I was not about to use a filthy bathroom to make a point.\n\nHe bought me flowers and chocolate, apologized for his behaviour and started learning how to be an adult. We are 8 years into this relationship and he is an amazing man, we are about to get married.",
        "permalink": "/r/MaliciousCompliance/comments/tn81tz/oh_so_you_do_pick_up_after_yourself_and_i_am_just/",
        "comments": [
            "After three years of living with a very messy and dirty man, stopped cleaning up after him. A month later he informed me we should end things. I took pictures of our home to ensure I’d never go back to him.",
            "I'm glad the guy didn't double down and took his L like a man.",
            "Glad this worked out for you prior to getting married. I basically tried this (though not quite as literally) and he didn’t give a shit about the mess, my feelings, or fairness (with housekeeping or anything else) and so we got divorced 8 years into our relationship (2 years after getting married). Edit: adding that he also had only ever lived at home except a short stretch in a dorm.",
            "I love when people take accountability. Now look a wonderful relationship and marriage will soon foster!! Only if everyone could swallow their pride.",
            "I had some friends at university that all lived in the same shared house that were each insistent that the general mess wasn't their fault, but the others'. They all eventually graduated and moved out, some to other house shares, others to living on their own. Within two months every single one of them was living with the same amount of mess. It was a shade-thrower's paradise.",
            "As an ex mummas boy, thankyou so much for doing this for him. I didn't figure this out until I was forced to live on my own for the first time (and honestly, within 2 weeks I was not only cured but loving it)\n\nYou gave him the opportunity to learn and he took it with both hands it seems!",
            "I had a similar experience when I was just married. My wife was complaining about how messy the house always was. I knew I was cleaning, and was equally perplexed. Then I started paying attention and realized that I was cleaning up her clothes and her messes. Luckily I was able to point it out (nicely) to her and she realized that we were both a part of the problem and can both be the solution.",
            "As long as you both agree to it a true test of who does what is always very telling. A love this one.",
            "Cackling!!! 😂😂😂🤣🤣🤣🤣\n\nI had a similar issue but way less extreme and suggested we keep a household labor timesheet. Either I was misjudging the disparity from the start (unlikely but not impossible) or he shifted into high gear as soon as he saw my 10+ hours/week in a spreadsheet.",
            "That’s a great way to teach him though.  But op is he any better about cleaning now??!!",
            "Reminds me of the road trip my husband and I just got back from. He sat in the back of his truck for the first time while I drove (to ride with our niece) and he got really nauseated. \n\n\nBeing in the middle of a national forest, I said I could just pull over so he could drive. He said, \"well no, just wait for one of those dumpster spots.\"\n\n\nI explained I had no idea what he was talking about and long story short, he decided that to prove how confidant he was in their existence, we wouldn't switch until we found one.\n\n\nWe switched when I reached the other side of the forest. We've been married 9 years and victory is still so sweet.",
            "When I started dating my future wife, she came over for the first time one Saturday and saw the disgusting hole of an apartment I lived in.\n\nShe promptly made me get dressed, made me take her to Walmart, and made me buy cleaning supplies with my own money. When we got back to my place she rolled up her sleeves and promptly supervised me cleaning up my own mess. If I didn't know how to do something she taught me then sat back and watched me do it.\n\nShe went out and got groceries and made me lunch and dinner while I worked (after I cleaned the kitchen). That was my first hint that she was a keeper.",
            "This was one of the red flags that my Ex was a narcissist- we had spoken often about doing housework 'as equal partners' well before we were married.        I intended to keep my full-time job; in fact, I earned more than he, so chores were agreed upon to be split.\n\nSeven (7) months into the marriage and he decides he doesn't want to do his share anymore and gets violently angry that I expect him to take out the trash on his designated day.\n\nFollowing that, he argues that since he doesn't want to clean- 'I can't make him and if I want it clean, you'll have to do it yourself!'\n\nChallenge accepted - Malicious compliance activated.\n\n After announcing, \"Okay, I will!\"         Subsequently, I cleared the living room of his refuse; his jacket, his backpack and his shoes- SLAM I threw them into his den and onto his PC chair.        His dirty dishes and his dirty laundry?    BAM onto his PC chair.        He couldn't access his computer without picking up his shit on his chair.\n\nNaturally, he protested, and I replied, \"YOU wanted me to clean,  so this is how I'm going to do it!\"\n\nIt only took one more day of that type of 'housecleaning' and he started doing his chores.\n\nHowever, the marriage limped along a few years and he got his heart's desire when I was called up to military deployment and he had the house to himself- to clean or not to clean, as he saw fit.        Therefore, he did NONE of it.       I wasn't even there and the mess was all his, but he neglected ALL of it; then the Ex had the audacity to announce that, \"I've gotten used to you being gone, and I like it!\"        So, I came home to piles of trash; overflowing litter boxes and dead houseplants.        \n\nHis solution to the squalor was that ***I*** should do it all: the cooking, cleaning and working a full-time job, because I was 'a terrible person' and his sitting on the computer all day, was 'more important'.\n\nLong story short, which included DV; we divorced.        The Ex said it was because of \"What s*he* did to me!\"",
            "Good job- I often go on strike around here but no one seems to be too upset by it.",
            "Tough love… I like it.  No one wants to be a doormat.",
            "I'm glad he learned and that you took the time to show him the error of his ways.",
            "Man i wish I confronted my roommates that quickly. It's been years and it's still not great though most have realised how much I had been cleaning up after then. \n\nIt's horrible having to live with people who can't Clean up after themselves. It's really selfish and something that can be easily fixed.",
            "Just after my sister had a baby her (now ex) husband asked her what she had done that day, to which she replied about doing the washing. His comment was that 'she didn't do the washing, the washing machine did the washing'. Well his washing didn't get done for a few weeks as \" I guess the washing machine couldn't make it up the stairs for his washing\" (sisters words).",
            "Lol good thing he didn't make an excuse that you \"got the easier side of the house\"",
            "After 8 years of fighting to get him to act like an adult and do literally anything without being explicitly told, I asked for a divorce, kicked him out of the main bedroom into the guest room (I own the house) and stopped cleaning or buying food for him (unless he asked specifically and repaid me). The amount of times he ran completely out of money was insane and the state of his living area is so bad I've threatened to evict him twice. Awful.",
            "I dd something similar with my ex. He thought he cleaned up equally but really all he did was move around piles without ever actually putting away or getting rid of anything. I was the one who did all the cleaning. He got after me because I put out the garbage on a rainy day and complained that the bin is full of water and will get moldy. He went so far as to declare that I will be the one to clean out the bin, not him! I went off and stopped cleaning anything but the messes I make. I went so far as to get separate garbage bins just for me. \n\nDid he learn his lesson? Nope, he complained about how lazy I was and I don't pull my weight around the house. Meanwhile it got so bad that I couldn't walk around without shoes on, the place smelled awful, and I needed to sit on a towel on any of the furniture. I didn't care though, I was willing to live in a rot infected wasteland to make my point.\n\nI eventually left when it was obvious that he thought the entire mess was my fault. I live in a nice clean smell free house and he probably died of flesh eating bacteria or sepsis by now.",
            "glad to hear you guys worked that out!",
            "I might have to do this.\nMy wife does clean, but she never picks up after herself as she goes.\nLike, shell cook dinner. But leave all the trash and scraps for days before she \"notices\"",
            "Good on you for teaching a good lesson and standing up for the facts, and good on him for humbly learning that lesson.",
            "Like teachers tell children:\n\n\"We like you, but we may not like YOUR CHOICES!\"",
            "Did not expect the wholesome conclusion. May you have many happy roads ahead.",
            "Had this problem with every roommate I had in college. Soon as I was out of college I lived exclusively with female roommates. They weren't perfect /neither am I), but they were less regularly messy and cared a little more when people would come over to at least clean up enough so guests didn't think they were messy.",
            "Finally some malicious compliance used for good, not evil, bravo. I kind of want to do this with my wife (I have been to an extent) in a full\nManner. She complains the dining table is always a mess, and I clean it, since I cleaned it last I have made a point to not leave anything of mine on it and not use it at all, this was 3 weeks ago. Last night she exploded at me\nSaying it was a complete mess, and it is, everything on it is something she has left behind, at dinner I just push it aside and clean up the plates after. I’m not sure she’s getting it still.",
            "Damn you a lucky one!\n\nWhile trying to extract a leech from my life, I also stopped providing old comforts. He refused to leave so I just stayed in my area. He tried pointing fingers at me for \"not doing chores\" when he really meant he would dirty and destroy any of my efforts to clean as soon as he humanly could.\n\nSomething finally seemed to click after he had strewn the dishes and pots all over my small kitchen and he told me I was a slob. I looked at him and said at least my dirty kitchen was organized and reminded him that he was the one causing the mess.\n\nI hope that guy dies slowly of some lung fungus. 😇",
            "Best thing my husband and I ever did for our marriage was get a house cleaner! Almost all our fights were over who cleaned what last. So much better now!",
            "I spent 4 years with my ex. Moved in with him at his mom's apartment about a year in (we were young) and they were messy, but I didn't mind. A year after that, we moved into his dad's house, as his health was declining and he needed help paying bills. I was taking care of the cleaning, as much as I could handle. His mom was by sometimes to help dad out (she was a caregiver and would help him for super cheap) and my friend lived with us for a few months. \n\nBut when it was just me and the ex, I was doing all the cooking, the cleaning, taking care of three animals (dog, cat & bearded dragon), and I was so drained. I dealt with it for months because his dad had passed, but it went from slightly messy, me spending all my money on bills/groceries for the FOUR of us, to the point that my depression was taking over my brain. I could barely handle any of it and I REPEATEDLY asked for help. The bare minimum of help, like dishes once or twice a week & taking the laundry baskets up/down the stairs (I did the actual laundry). \n\nHe stopped being home most of the time, instead stayed late at work (we work at same job, so he was definitely there) and hung out with his best friend for hours afterwards. I worked first shift, he worked second, and during the week the only time we saw each other awake was for 10 minutes after I clocked out and visited his dept. The weekends were spent with his other best friend (his wife and three kids). The guys would disappear in the car and I'd be stuck with the wife and kids. \n\nI hate to say it but I'd probably date him again despite it all. 😭 (He's currently engaged to the girl he started dating a few months after we broke up.)\n\n... Sorry for the rant.",
            "My oldest daughter, illegal (edit: A LEGALADULT-- lol, sorry, on mobile!) adult now, doesn't help out much. She says that she never uses anything here.\n\nSo I asked her, \"and you make sure the dirt stays on your shoes when you walk inside the house?\"",
            "I am grateful to my mother for making me do chores. I was capable of doing all the housework by 13 when she made me start washing my own laundry full time. I had friends who moved out and didn't know how to do anything because their mom did everything for them.",
            "I left my messy partner recently and it's been sooo freeing to actually have a clean house",
            "I firmly believe that everyone should experience two things before they move in with a partner:  \n\n\n1. Living alone - Learn to look after yourself and keep your home tidy\n2. Living with others - Learn to compromise and how to deal with people who don't keep their space (or shared spaces) in order.  \n\n\nToo many people go straight from living with their parents to living with their partner.  \nI think in many cases, the wife becomes \"replacement mom\" because the guy never had the bachelor experience to learn to look after his space and his life.",
            "Had this happen with my ex gf.\n\nCame home everyday to do washing, cooking and cleaning after work.\nGot sick of being told it would be done and excuses as to why it wasnt ever done.\n\nSaid im sick of living in a pigsty.\nThen cried and stopped talking to me for days, after finally speaking to me she said she couldn't believe I called her a pig.\n\nI knee jerk told her she has to get her things and leave by the end of the month.\n\nIt still hurts but I think it was probably for the best..\n\nIm glad your man took his head out of his bottom.",
            "Really hope he also cleaned up his half and didn’t just try to win you over with flowers and chocolate instead.",
            "Damn. That's a good man who can admit when he was wrong and make a change. Congratulations!",
            "My pop would of called you a smart woman, while laughing his ass off",
            "can you leave him for my roommate for like a month? You can leave after setting him up straight.",
            "Good for him. My son (21) is a mama’s boy too but he’s pretty neat and I insisted that he learn to cook, clean, and do laundry. I grew up in a very “traditional” household where I had to do dishes, help mom cook and clean and laundry & babysit my much younger sister while my brother only had to pull the trash to the curb (which he frequently forgot) and mow the lawn occasionally. He eventually learned to do everything for himself no thanks to my “traditional” parents.",
            ">Got painter's tape, divided every single room in half\n\nI was gonna be like \"this is childish and fucking stupid.\"\n\nBut if it worked, it's actually genius and hilarious.",
            "Opposite here. Wife thinks every empty surface is now a place to throw clothes, walks PAST the dishwasher to put things in the sink, making the bed is \"pointless because you just get back in it\", car full of fast food bags and garbage, doesn't notice a dirty floor needs to be vacuumed, etc etc.\n\nI cook, clean, grocery shop, do laundry, shovel snow, take out recycling and garbage, clean the bathroom, take our cars to the car wash/clean them out. I also did this kind of stuff to help around the house as a kid, so maybe it's just been taught to me at an early age?\n\nEveryone tells me I make a great wife (I'm a dude.)",
            "You found yourself a keeper.  He was blind to his faults, but once he found them (sure he was stubborn and had to be hit over the head to find them) he admitted he was wrong and worked on changing.   That's the sign of a real man, the ability to adapt and get better.",
            "My husband is the one that makes sure our house is tidy, and I am eternally grateful for it. Communication is the key to relationship success. We had a discussion about my inability to see what made things messy after living together a few months, as he was exasperated picking up after me. It has been 17 years and while I’m still not great at keeping things tidy, I have improved and I continue to try to improve. One thing I have always been good at is making sure we have clean dishes, towels, and clean sheets. I make sure we have a stocked pantry and medicine cabinet, make doctors appointments, vet appointments, and check the cars fluid levels and tire pressure. I fix things that break, he puts things away and throws away junk. Every couple needs to have an even division of labor and if your partner isn’t willing to share the load and won’t communicate with you or try to improve, they aren’t a true partner.",
            "Great story!  I'm glad your relationship worked out!",
            "Nicely done. I'm pretty much a terrible bloke at housework, but I try to keep my mess in specific zones like my computer room/office and the garage/workshop. \n\nI do vacuum and run the washing machine, and I cook.",
            "Man, I am shocked that this method worked! I've been married for 5 years and I recently tried this with JUST the laundry. He legit did not even notice the mound of laundry in the laundry room. After two weeks he told me that he couldn't \"find\" any underwear and asked me to help him look for some one morning. I had to actually tell him they were all dirty. His response? \"oh, I better swing by walmart to get more boxers before work!\".... because doing laundry did not even cross his mind as an option to have clean clothes. I had to spoon feed him my reasoning behind not doing laundry!",
            "My husband’s whole family are big time slobs.  And while I am not from a family of clean/neat freak, I \nDo have a limit of how much “mess” I can tolerate.\n\nI’m in the middle of a ten day head to head about household chores. I haven’t cleaned or cooked in that whole time. The only thing I’ve done is run the robot vacuums. \n\nI work full time (and always have), and have been the Sole cook, cleaner, shopper, planner for twenty years and I’m tired. Kids are grown, so I couldn’t give a shit less anymore… \n\nPS: I haven’t done anyone’s laundry but my own since my youngest son was about 13.",
            "Great ending 🤘🏻",
            "Very nicely done! Too many folks, not restricted to just men, do not know how to keep house. Or how to deep clean.",
            "Did you know that your post is pretty much an old [I Love Lucy episode](https://www.imdb.com/title/tt0609301/)?\n\nExcept of course Lucy and Ricky were married.",
            "I think I saw that episode of [insert name of family sitcom from 60s, 70s or 80s here].",
            "I am a mess too.\nI've been living with my gf (i love her, she is a pain in the ass but so am I) for 8 years now. \n\nWe organised to keep the house clean (split the task) but we don't have the same level of expectation regarding cleaning. My part is never done good enough. And we always ended up fighting or yelling and it ruined our weekends.\n\nSo we decided to pay for the cleaning, every friday we come and everything is clean (to me). She still find some spot that aren't up to her standards but it's not my fault anymore :).\n\nBest money ever spent.\n\nOur cleaning lady is on holiday this week so we have to clean together tomorow. I am already anxious about it.\n\nAs usual I will do my best.\n\nWish me luck.",
            "I do love me a story with a happy end with my morning coffee. Good on you OP and I'm glad he learned his lesson.",
            "Was the Brady bunch so long ago that we’ve gone full circle?",
            "My husband did something similar. It ended up that we were both about equally messy in different ways and different places. We both overestimated/underestimated different pieces of it too. It was an interesting experiment because we both learned things.",
            "[I thought this story sounded familiar.](https://tvtropes.org/pmwiki/pmwiki.php/Main/ThisIsMySide)",
            "Awesome ending! Actually phenomenal beginning for you and your man. \nAfter 40 years, my husband finally realized how much I do (or did), lol. He retired and a I handed household chores over to him. He gets to do his part now.",
            "This post made me realize I gotta start cleaning a bit more lol",
            "Unexpectedly wholesome ending. Good for him for stepping up, and congratulations to the both of you.",
            "Lol! What a good story! Glad you worked around it.",
            "Wow, that guy must have a lot of emotional intelligence. Admitting your faults with that kind of grace is the way to go. Cool story",
            "This sadly reminds me a lot of myself, (unfortunately I'm more like your fiance than you). I don't think I'm quite so bad, but I definitely have had and lost the \"oh come on it's both of us making the messes argument\". \n\nBut I am reforming, and I always took on the dirtiest jobs so she didn't have to, (I clean the bathrooms, sinks, and take out the trash in addition to helping with the rest of things).",
            "This is a very good Malicious compliance that I respect how you handled it and changed a man for the better. Kudos to you OP",
            "The good ending",
            "a lot of people I know wouldn't have the guts to swallow their pride and admit they were wrong like that. Props to both of you for handling things like a mature adult",
            "There's nothing more amazing than a person willing to admit they've been proven wrong with good grace.",
            "you just need a magic coffee table\n\nthis has made me laugh for a long time...\n\n[https://www.youtube.com/watch?v=-\\_kXIGvB1uU](https://www.youtube.com/watch?v=-_kXIGvB1uU)",
            "content purge",
            "Not as bad as some of you have experienced but my boyfriend CONSISTENTLY will leave wrappers from food piling up. We could literally just have finished picking up and deep cleaning the entire house and he will immediately turn around and open a package of cookies and then just leave the wrappers and crumbs. Like ??????",
            "Listen, my (future, potential, currently nonexistent) sons may hate me, but I will ensure that they learn how to CORRECTLY clean up after themselves. That way I can look any of their future partners in the eye when asked an go “Well no, Jimothy should know how to scrub a bathtub and polish wood furniture. That’s been his chore since he was 10!”",
            "I parented in a marriage for almost 10 years. Now when I date I request a home tour before getting serious.",
            "Holy fuck, it DID learn!!!!",
            ">He bought me flowers and chocolate, apologized for his behaviour and started learning how to be an adult\n\nThis is called personal growth, or just plain *growing up*.  Sometimes people do it naturally, but a lot of times it has to be a little painful for them/us before it sinks in.  Good on you for showing him, and good on him for actually *getting it*.\n\nWell done.",
            "After reading so many AITA posts, it's nice that this ends right",
            "Lucy would be proud. Brava!",
            "I'm glad he apologized and learned from it.",
            "Is he this guy? \n\nhttps://youtu.be/SqQgDwA0BNU",
            "I'm on your side, but not even a week and you had to clean the toilet and shower? What the fuck were you all doing in there??",
            "What an Odd Couple",
            "fairy tales for children.",
            "Ahhh yes - the Reddit circle jerk of reposts for upvotes.",
            "Since I'm the first one home, I do nearly all of the laundry/cooking/cleanup. I admit, I take a few days off, here or there, but otherwise I generally keep things pretty clean.",
            "I had a guy who I wanted to be with. Long story short, I spent a lot of time at his place… cleaning. We hooked up once and he used friend zone leverage to keep me coming back. At least I made a few thousand in cash, but not what I wanted.",
            "Yeah, had a similar issue except it was my girlfriend who was a slob. Not too long after we started dating I'd suggest her coming over because I kept my place clean and her place was a pigsty. And she'd do the same thing at my place...leave food out, tissues on the counter, dishes in the sink (dishwasher was literally right next to it), shit just dropped at the door...it was manageable but irritating.  One day I was at her place and I couldn't take it anymore. I just started tidying up after myself and it turned into just cleaning.  When she got home, she got pissed because 'you think I'm a slob and can't clean up after myself!' Not, OMG thank you, or you didn't have to do that or I'm sorry I just can't seem to get my shit together. Nope, I was the bad guy and maybe I was to some extent but jfc, you have no idea. I'd asked her if there was a reason for her being this way (more sensitive than this for brevity) and she shouted 'if you don't like me the way I am, then just leave.' I appealed to her for us to work it out but she just screamed at me again. So, that was the end of that. \n\n To be clear, I didn't go through her shit, I just picked up the trash that was lying around on nearly every horizontal surface and wiped it down. Nothing intrusive, not rearranging anything, just throwing the trash in the bin.\n\nI'm no neat freak, but it really requires very little effort to just throw a tissue in the bun or dirty clothes in the basket that sitting right there. Some people have psychological issues and I get it. But some are just lazy slobs.",
            "I wish this worked. My dad doesn’t care about living in filth.",
            "I did this with my roommate. He rarely took out the trash but would talk like he did it more than me. I started a list and suddenly he took out the trash 5 times as much",
            "I, on the other had, broke up with a fiance partly because she would never clean up her mess.  Her family home was always disgusting, because her long suffering mother was the breadwinner, and her Puerto Rican father refused to clean or cook, because it's \"women's work\".  So she never learned how to clean anything properly, or how to use a manual can opener.",
            "Oooh Ok. I just came here to read the comments before complaining about my man not putting a trash bag in the van after he emptied it. Some of y’all are really going through it. Im just going to leave now *backs out slowly and closes the door**",
            ">He bought me flowers and chocolate, apologized for his behaviour and started learning how to be an adult. We are 8 years into this relationship and he is an amazing man, we are about to get married.\n\nI would *love* to know who he expressed this with who told him \"bruh you *goofed*\" and directed him to the floral department for proper apology materials.",
            "Is it sad that being willing to change and not him not doing it to start with sounds amazing to me?\n\nI had an ex break up with me because even though I was doing my student teaching, working 39 hours a week, and cooking every meal and he was unemployed I asked him to clean the kitchen after I cooked. He said he'd rather never eat a cooked meal than clean. I kept cooking for myself and didn't buy him ready made meals because they were out of our budget. He said that I was cruel and petty and broke up with me.",
            "So the plot of an I love Lucy episode?",
            "oh man did I have to embarrass my bf with the stains he left on the floor from spilling drinks and not cleaning them up. I left it there and avoided cleaning it because I had asked him to clean it for 3 weeks and nothing got done. We eventually moved out of state and cleaned the apartment together but I told him that his mess and he is cleaning it. \n\nI think most men are oblivious to these things if it doesn't bother them. They should be a little more caring about how there SO feels about cleaning/cooking/general tidiness.",
            "Get him to pay for a cleaner once a week.  I run a cleaning business and you have no idea how many marriages we save lol.",
            "He does sound amazing. He accepted he was wrong when shown proof and made the effort. Good on him, and good on you for sticking to your guns.",
            "Rcently got broken up with by a woman who played the \"I do everything\" card. Turns out I can live alone in the same house and get all the cleaning done with little effort in very little time and I still have a ton of time to myself.",
            "Before my parents were married, my grandmother told my mom not to baby my dad. He knew how to clean and cook etc. My mom, being a naive country girl, wanted to look after her husband. Well she ended up looking after him for 51 years and he never had to do laundry or push a vacuum so well done OP",
            "I'm the husband that does most of the cooking and takes care of a lot around the house.  I also expect help when needed and to be left alone if I want a few hours to play games on the PC.  My wife loves to yell down the hall from the couch because she \"needs something.\"\n\nShe really hates it when I use the noise cancelling headphones.",
            "Now that’s creating a boundary. I’m really glad they learned from that experience",
            "Don't you love it when people actually learn they are wrong and actively change to fix it? He's a keeper.",
            "I was the same way although we never did this. Im marrying her in August and I still don’t think I deserve her. Shes amazing. She also says that shes put to much work into making me a responsible, respectful man that she could never let another woman have me. Lol",
            "Honestly, what a freaking way to test a relationship, too. Y'all for real deserve each other it seems lol",
            "I would have just started catapulting everything on to your side.........check mate",
            "Wholesome AF.",
            "You trained him good for you lmao",
            "I would clean, but I have a wife for that.",
            "You **fixed** him? What kind of witchcraft is this?",
            "I should have tried this with my hoarder ex-wife. We already had a dead bedroom so threatening to take away sex would have me laughing in her face. As it is, I’m enjoying the fruits of a clean and tidy house while our kids complain of hers when they go there for her week.",
            "Whip that boy into a self-efficient man.  Good job.\n\nI had a simliar issue so I can understand.",
            "So your life is a sitcom? Cmon we both know this never happened",
            "I'd love to believe this, but you have to admit it read like girl-justice-porn-fan-fiction.  Do you have, at least, a picture of him standing next to some blue painters tape line doing an exaggerated shrug with a bemused look on his face?",
            "Am I the only one thoroughly creeped out by this?",
            "Let’s not even mention all the jobs that grotty men create, that women don’t. I separated from my husband a year ago, and I still come across things in my home that I’ve missed that he did. Just yesterday I was looking at my bathroom wall from an unusual angle, and saw a mess of giant fingerprints and smudges all in one spot. Took me a while to realise it was from him resting one hand high on the wall above the toilet as he peed. Gross! I mean, it’s not like women don’t have loads of messy things happening to them on a regular basis. Yet we seem to manage to keep it contained, and not make it the household’s problem, right?",
            "Where is the malicious compliance?",
            "Its all foreplay...\n\nIf your lady feels happier about a tidy house, she is more likely to receptive to horizontal refreshment...\n\nIts all foreplay...",
            "You are a f\\*cking HERO.",
            "I live with someone who insists they feel like the maid, constantly doing everything around the house.  I'm the one with a full time job, their income is helping out the landlord to decrease rent occasionally.  I could take a picture of any room in this house and point out 20 of their things out of place for every one of mine... At least.  I don't even have a closet of my own.  *They have three.*",
            "Wholesome",
            "I'm pretty sure I've seen this in every sit com ever so I'm having trouble believing it.",
            "Keep the tape handy. He may count on the marriage to backslide.",
            "I'm glad the guy didn't double down and took his L like a man. Ditto Kineth",
            "8 years in living together and not married? Yikes, a moment of silence for this woman.",
            "That's not a man. That's a boy.",
            "So you complied with your own rules? Really not what this sub is about.",
            "This sounds like fiction to me, but in case it is true... If anyone does something like this to you, *RUN FULL SPEED TO THE DOOR.* Healthy relationships aren't \"gotcha\" contests.\n\nEdit: went into OP's history, and they have an AITA post about being a bride Zilla.  Huge red flags all around, get away from this person!",
            "I'm impressed but also concerned.",
            "I had this too (I'm the one that sucks at cleaning), so I gave her a choice either I pay someone to do the cleaning, or I pay you to do the cleaning ( i would ofc keep things tidy and put the dishes in the sink and stuff) but I would not clean except if I fucked up or something happened. first she was like free monies, but after half a year she argued that i should start cleaning and keep paying her.. So I stopped giving her monies and started paying a cleaning company. and that worked for a while...",
            "After the month id try to gaslight her and claim the clean side was mine all along.",
            "Yeah this guys told the story from his point of view and someone corrected him no doubt.",
            "This is why we have a maid, lol.",
            "Found a gem in the rough and t’was polished. Shiny..",
            "Wow.   This is a great post.   Very cool.  U guys can get through anything with this kind of relationship.",
            "Yeah, nothing unhealthy about making a big deal over making a point so mundane to go so far as to do this, but who am I to tell you to stop wasting your time- as much of it as you have.",
            "You are why 1/2 of American marriages end in divorce. Division of labor is a good thing. Instead of two people doing a half-assed job on everything, keeping gender roles allows for specialized labor where each partner can tackle a given area. You’re renovating the house, I’m sure that’s not 50/50 (even if you think it is), mowing the lawn, shoveling the snow, maintaining the cars, hell, being the one who has to check out the noise 3 am, these are all things a lot of women take for granted. Instead of belittling your partner with tape via I Love Lucy, why not just take a second to think about the things he does for you with out complaining.\n\nSincerely,\n\nSomeone who’s in a loving marriage",
            "You trained him well.",
            "Ain’t nothing like a woman’s scorn though. I bet you cleaned like you’ve never cleaned before during that little hunger games of yours.",
            "Lol my gf is just as messy as me so idk, nice of him to adapt because he wants you to be happy but just because things aren’t tidy all the time doesn’t mean you’re undeserving of being able to call yourself an adult",
            "[removed]",
            "I’m the clean one in our (ex) relationship. I’m FAR more clean, tidy and organized. It’s a small but crucial part of why we’re getting divorced. I just wanted to sound off for the mature, clean and responsible men out there. Couldn’t let you ladies get away with your silent implication all men are pigs.",
            "Glad to hear you're getting married. Not every man would stick around after that sort of sit-com BS.",
            "Cool story",
            "8 years courting? Amazing man? The maths seems a little off",
            "😂😂😂 hold on baby instead of talking like adults let’s get the masking tape like we’re in a 2005 sitcom 😂😂😂😂😂. \n\nGood luck when y’all have kids!",
            "I am glad to hear he maned up, and you two were able to work through this to a perfect solution rather than fight and not co-operate to learn. I wish you both a happy and life long marriage together!",
            "How did he lack that much self-awareness that he didn't realize how much he didn't contribute to cleaning until you literally drew lines?\n\nRegardless, glad you guys were able to clear it up and have a mature relationship about it.",
            "That's awesome.",
            "8 years sheesh",
            "That’s awesome",
            "> self admitted mama's boy \n\nWhat a winner.",
            "sitcom level petty. I love it",
            "good thing he didn't ask his mom to help",
            "Thats a great way to prove a point, without real malice. Enjoyed your post.",
            "I have a feeling that this turned into Wholesome Compliance.",
            "This is something that needs to be discovered and dealt with far before this. To be so deep in a relationship and not having a good understanding of the cleanliness of your partner is surprising. We all have a bedroom and a bathroom and it's easy to see how hygienic someone is",
            "It's kinda a great plan....maybe us already married folk should try this?",
            "congratulations! your team work is making the dream work.",
            "lovely"
        ]
    },
    {
        "post_id": "db09du",
        "author": "ConfusedContortion",
        "title": "Force this kid to take the final. Fine, he'll take it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/db09du/force_this_kid_to_take_the_final_fine_hell_take_it/",
        "score": 26254,
        "num_comments": 402,
        "created_utc": 1569786874.0,
        "selftext": "So this happened years ago when I was in highschool, but I smile every time I think of it. My highschool had a policy that anyone who has missed less than a certain number of school days could pick one class they had an A in to skip the final. You could get a couple extra days for college visits, but otherwise it was very straight forward. Awesome policy, and we all loved it.\nOne year, we had this kid who was in eighth grade and had been diagnosed with cancer. He spent allot of his year sick, getting treatment, going to the hospital, running to the bathroom to throw up, etc. Despite all this he finished the year with an A in his Spanish class. It was his only highschool class, so it was the only final he would have been able to skip.\nAdministration was not going to let him skip the final because he had missed too much school. He and his parents asked them to make an exception, given the situation, but administration wouldn't budge. His teacher stood up for him, but was told this kid had to take the final no matter what. He had missed too many days and there would be no exception.\nThe teacher said ok, but told her class not to study for, worry about, or exempt her final. Then, the first day all her students showed up for the final she told them to take out a piece of paper and number it 1-3 leaving one line in between each number. \nShe then asked three questions along the lines of, \"What is your name?\" \"How do you say yes in Spanish?\", and \"How do you say hello in Spanish?\" Then she collected the final. Everyone got an 100 that year, and she became a legend.\nThe kid has been cancer free for over five years now.",
        "permalink": "/r/MaliciousCompliance/comments/db09du/force_this_kid_to_take_the_final_fine_hell_take_it/",
        "comments": [
            "Something similar happened to my best friend. She had cancer in highschool and she did all the work from the hospital, but they still had the audacity to try and hold her back because of \"missed days\". Its seriously some bullshit. (Shes still alive, in case anyone was wondering)",
            "Awesome teacher",
            "I was taking culinary classes, and the administration at the community college said that every class needed a final.  This made sense for the lecture classes, but how are you going to give finals for a lab class?  One of my instructors took it literally (he was the head of the program, and his lab class was the first lab class you took), and we had both an oral and written final in his class.  God, that oral final...I could not remember the name for a slotted spoon.  Oh well.  One instructor took it to mean \"show me what you learned\" but that was baking class, so it was easy to show what we'd learned by baking a cake.\n\nThe other lab classes I took?  One of the tests was 10 questions, and our instructor had submitted our grades before we even took the final.  It had questions like \"What size is a quarter inch dice?\" and \"when are high heels appropriate kitchen shoes?\" and \"how many refrigerators are in our kitchen?\"   And it was multiple choice.  Another of the tests was 15 questions, and had questions like \"What color is the sky?\" and \"In which direction is the Pacific ocean?\"  Things that had absolutely nothing to do with cooking.  Not only that, but he wrote the points each item was worth on the test.  Up where it said \"Name\" it said (15 points).  All the other questions were 1 point each.  Even if you got them all wrong, so long as you put your name on it you got a B.",
            "I have an interesting story as well. I got very sick the first year of high school right before finals. I missed all of my finals and had to make them up in the summer to complete the year.\n\nAll in all I did fine except for one (Algebra 2) , because the teacher said she would let us use our notes.for final so I did not study. I showed up with my notes and they refused to let me use them even after seeing a note from the teacher.\n\nI started the test and in the middle I wrote in huge text,  THEY DIDNT LET ME USE MY NOTES AND I DIDNT STUDY BECAUSE I WAS SICK.\n\nI did not complete the rest of the test, I probably did 50% max.\n\nI received my grades back and got an A on it. Best teacher ever",
            "1. What is your name?\n2. What is your quest?\n3. What is your favorite color?",
            "I pulled a similar stunt a few years ago when I was teaching an Intro to Technology class. The class was a mix of grades 9-12 but the 12th graders finish school a couple of weeks before everyone else. I was told that I had to give everyone a final exam, so I gave everyone a test a few weeks before school ended, and called it the 12 graders' final exam. I then told the rest of the class that if they showed up for my final, they *would not fail*. Don't show up, and the make-up exam will be much harder. \n\nDay of the final, I hit them with 9 questions like \"What color is George Washington's white horse?\" and \"Who's buried in Grant's Tomb?\"; that sort of thing. Question 10 was to give me a 100-word paragraph on something they learned that semester. (I did that partly because I wanted SOME part of the test to relate to the course, and partly because I ran out of too-obvious-answer questions.) The few students who took the make-up test got a genuine Technology final.",
            "Better than my nephew’s teacher.  Came back to school after a round of chemo.  His class was scheduled to take a midterm but he was feeling nauseous.  They contacted my brother to come get him and my nephew stayed in class waiting to get picked up.  When he got back to school, the teacher was returning the tests.  My nephew had a zero written on his with the comment “refused to take the test.”  My brother had to go to the superintendent to get it dealt with (teacher was always pulling stuff like this- no sympathy at all.)",
            "    It was his only highschool class\n\nDo you mean Spanish was the only high school class in which he finished the year with an A? Or was he not taking any other high school classes at all?",
            "I had a somewhat similar experience with a teacher in high school. We were juniors taking AP U. S. History for college credit but out state (Louisiana) decided that no matter how advanced your class was, every junior still had to take an EOC (End of Course) test that was standardized. On top of this already stupid idea, our school decided we also had to have finals. So after we finished our college level AP exam and our easy state standardized EOC exam, we walked into the room to take our final. Each person grabs a packet of papers for our exam and the instructions read: \"Please explain why 10 or the 23 AP United States History memes are funny.\" I asked our teacher afterwards if she was even planning on looking at them and she said \"Well I gave everyone a 100 when they walked in the door so no.\"",
            "The Oceanography teacher when I was in HS had 1 question on his final exam. Name 100 sea creatures , no repeats. 1 pt each.",
            "Amazing story",
            "Reminds me of my first year at Ohio State. We were in the first day of class. It was Freshman English. The professor passed out a form for us to fill out: Name, address, phone number, etc.\n\nHe then passed out another piece of paper. It was a test. Seriously? Day one? The test was over parts of speech, adjectives, predicate nonnatives, past-participles, etc. What the hell?\n\nHe said that the university required that he give us the test. He then said that the university doesn't specify what percentage of our final grade it would be.\n\nHe said that it was worth one-tenth of one percent of our grade. I think I got an 80 on the \"test\". Darn, the best I could do in the class was reduced to 99.2%.",
            "The administration can't do anything because they did take the final and it was related to Spanish. Get rekt administration",
            "Kinda reminds me of my Physics teacher my senior year of high school\n\nIt was senior ditch day so of course there was a shitload of people missing from class, so she decided that there would be a pop quiz with one question but worth like 20 extra credit points. The question? “What color are my blue eyes?”. Safe to say that was the easiest quiz I’ve ever taken haha",
            "Best type of teacher",
            "Not completly related but in my senior year of high school on senior ditch day, a few of my teachers had pop quizzes. For my math class his questions were like:\n\n1. What color are my blue eyes?\n\n2. Which star wars trilogy is the best trilogy?\n\n3. What football team in the NFL is the best team (his classroom was full of Seattle Seahawks stuff, I still wrote down Steelers though)\n\nNeedless to say, those who didn't ditch got 100% :)",
            "That reminds me of one of my professors in College. He never gave finals because we had to write a 2 page essay every class and a 7 page essay report at the end of the year for 1/3 of our grade. My last year at that college he was forced to do finals. So he gave us a piece of paper and pencil and told us to write our names on it then collected it and let us go. We all got 100% on the final.",
            "Dang, 11/10 teacher.",
            "Teacher's a legend, the admins are fools. It seems that there are always school admins that are too stupid to function without going by the book, common sense and decency be damned.\n\n&#x200B;\n\nOur admins and teachers tried to go out of their way to make sure folks graduated...",
            "That is a hero right there.",
            "Your teacher was amazing!",
            "Only a [scientist](https://imgur.com/bFcLl4O.jpg) meddling with dolphins' brains could solve those questions.",
            "The fact he's cancer free makes it even better",
            "[deleted]",
            "that teacher is a saint",
            "1. Jochvent\n2. Sì\n3. Bonjour",
            "As the son of a teacher, grandson of a professor, and otherwise related to twelve other educators I can tell you this is one outstanding teacher!",
            "Administration was the final tumor to beat.",
            "> The kid has been cancer free for over five years now.\n\nThe teacher cured cancer!",
            "Not all heroes wear capes.",
            "Teacher of the year, no, teacher of the decade right there",
            "Damn. She cured his cancer?",
            "Don't fuck with a teacher who knows how to play the game.",
            "I don't understand the lack of empathy a school can have, over something like this.\n\nHorrible.",
            "And then the school had to report the results, as many students who had F's or D's suddenly got A's on the final. District notified the state, who had to perform an audit, and now the teacher is being investigated.",
            "Administration probably took the tack of \"If we make an exception for one student then we have to make exceptions for everyone.\" This is the problem with state-run education, the administration doesn't see kids, they just see numbers.",
            "Cool story but what kind of fucking highschool is this? It totally kills the point if you have to put in literally no effort and just automatically get 30% of their grade as 100%.",
            "This is awful. All that work, down the drain. Students that did not deserve to pass did and students that did not follow the guidelines normally get a free pass anyway. Even if the administration is shit, this is still not okay.",
            "Wait theres teachers out there like this? where da fuq dey at doe",
            "I would buy that teacher a drink. The education system needs more common sense like that.",
            "Man i wish i had a teacher like this",
            "My junior or senior year of high school I took chemistry, but I was having chronic headaches and would often have my head down on the desk because they were light sensitive. Despite that, I tried my best. When time for the final came, the teacher had us calculate our grade so we would know exactly what was needed on the final to get the grade we wanted. Even if I aced the test I could not get a passing grade in the class, but I figured what the hell, I will take it anyways. The teacher ended up giving me a C. I am still very grateful to that teacher.",
            "I hate all the drama about kids not coming to school. As if the kids have control over their ability to access transportation. Not to mention how it descriminates against disabled students. They're basically saying, \"those of you who have a strong enough immune system that the annual flu only gives you the sniffles, thanks for coming and infecting everyone else.\"",
            "That's awesome. When I was in highschool someone snitched because the teacher was helping us to much during the final and he almost lost his teaching license",
            "when you forget how to say yes in Spanish",
            "Weird policy. I’m all for weighting the finals less (some classes it’s like 50%) but I think it’s important to have a cumulative test. Helps you retain stuff from the start of the semester better.\n\nBut yes your administrators were being dicks and your teacher’s awesome",
            "So glad he's better and that teacher is the best ever.",
            "That’s a nice teacher. At least they weren’t naïve to the situation 👍🏻",
            "I'm a bit amazed that nobody made a mistake in that exam. Normally there's always this one kid...",
            "THAT is a good teacher with her priorities in order!",
            "Fcking legend of a teacher",
            "I get that the kid was sick and got an A but also the school was only following the policy of the rules. If you make an exceptions they all of a sudden you get others requesting the same.",
            "We need more teachers like that on this planet. She deserved a medal. <3",
            "[deleted]",
            "So, how do I upvote the TEACHER? and not just the article?",
            "The point of the rule assumes if you have an A and have gone to most classes you should not have to study. The kid missed classes and should have had to take the final. Your reason for not being there is irrelevant, the point being he was not there.\n\nTeacher is still a legend",
            "Non-malicious.\n\nStill upvoted. God bless.",
            "Legendary teacher!",
            "What an awesome teacher! So glad to hear the boy is cancer free!",
            "This is wholesome.",
            "If he was out getting treatment, how did he meet the number of days absent?",
            "aaaaand what school does she teach at cuz I WANT HER TO TEACH HERE",
            "I love this teacher",
            "Damnit, this made me tear up at work.",
            "Lets fucking go baby",
            "Kudos to the teacher for stepping up and doing the right thing.",
            "I think it's funny that there was probably at least one tryhard student who studied anyway.",
            "Finally, a Spanish exam I could pass",
            "[deleted]",
            "Jeez, i had to have 3 surgeries my senior year, 1 life saving. I missed 53 days that year, left early at least 2x a week, and was in the nurses office sick several times a week. I had a 3.4 gpa, and zero issues with the school about attendance or exams. Those schools sound heartless",
            "What is the airspeed velocity of an unladen swallow?",
            "Administrations don't care about education. It's a fact.",
            "I agree with the school. In the real world you get sick and it sucks.  \n\nBut nothing wrong with the teachers test. If the student could not do those simple things then they did not learn anything.",
            "Two wrongs don't make a right.\n\nThis teacher inflated grades for her whole class.  That is wrong.",
            "r/wholesomecompliance",
            "[deleted]",
            "That just kept getting more wholesome",
            "Epic",
            "Teacher probably got fired after that!☹️",
            "what the hell kind of school system is this? \"If you're present for most of your classes you literally get a free pass on one of your finals\" like no way this actually happens right? ...right???",
            "So wholesome. I think I'm gonna cry"
        ]
    },
    {
        "post_id": "l7v1mi",
        "author": "OtherLtDan",
        "title": "Must check my work email every single day? Ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/l7v1mi/must_check_my_work_email_every_single_day_ok/",
        "score": 26124,
        "num_comments": 372,
        "created_utc": 1611933451.0,
        "selftext": "So I was working for a small private ambulance company that ended up getting bought out by a larger corporation. To folks that have done this kind of work, no it wasn't the company you're thinking of, but this new corporation wanted to be just like them.\n\nSo corporate sends out a directive that all employees must check their work email at least once every 24 hours. No exceptions! Now I'm a lowly part-timer, so it would occasionally be weeks in between my shifts. The fun part is, I usually played Field Supervisor on my shifts I did work.\n\nSo in order to be in compliance with the corporate directive, I set my work email to update every day at the same time on my phone. I would then log my 15 minutes of email checking on my paycheck so I would also be in compliance with state and federal payroll laws. I also made sure to inform as many employees to do the same.\n\nDidn't check your email while you were on shift because you were too busy trying to figure out what made grandma's ambulance ride to the doctor medically necessary? That's ok. Just check it when you get home. Make sure you put it on your timesheet, though!\n\nIt took a couple pay cycles, but eventually I get a call (on my day off), asking why I'm logging 1.75 hours on weeks that I didn't even work. I explained that I was just following their corporate directive. I was told at that point that I no longer was able to log those hours. I told them to give me that in writing as that goes against labor laws. Needless to say, the directive to check email every day got revoked.\n\nOh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes.\n\nEdit to say: Thank you everyone that's up voted and given awards. You guys are the true heroes!",
        "permalink": "/r/MaliciousCompliance/comments/l7v1mi/must_check_my_work_email_every_single_day_ok/",
        "comments": [
            "Beautiful malicious compliance.   Especially the request of the directive in writing for the labor board... they LOVE written rules that violate laws.",
            "This was a sweet read with a lovely finish.",
            "This is my favorite kind of MC. No, I don't work for free...ever. Not for one single second. My workplace wanted us to submit a form daily through an app  before we walked into the door of the building. I told them I don't work before I punch in and I don't use my personal phone for work so if they want me to use an app they'll have to provide me a phone and pay me for my time to submit the form...suddenly I don't have to do any of that stuff.",
            "Well done.\n\nIsn't it amazing that important corporate directives that inconvenience the workers are no longer important when it costs the corporation money?",
            ">Oh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes.\n\nPerfect.  I can almost see your boss sighing and saying to HR \"Just fuckin' pay it.\"",
            "Would have only been better if y’all had a minimum number of hours to charge... one common perk of unions",
            "Some states require a minimum of hours reported for any work. Massachusetts, for example, will require employers to pay minimum 4 hours for any shift, or work related activity. If you have to come in on your day off for a 30 minute meeting, you'll get paid 4 hours.\n\nEdit: stupid autocorrect\n\nEdit 2: [apparently it's 3 hours now](https://www.mass.gov/info-details/massachusetts-law-about-hours-and-conditions-of-employment)",
            "Yep! If you (the business) require it? You have to pay for it! Well done.",
            "You hooked me when you said “small private ambulance company”. Bullshit like this is why I’m going to nursing school to get out of private EMS. Cause at least I’ll get paid a little more to deal with bullshit.",
            "People on salary LOVE to try to get hourly employees to do simple work like that off the clock. No thank you. Anything you tell me to do is work, and I will be punched in to do anything for you.",
            "\\>  Oh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes. \n\nsimilar sitch but wholesome\n\naround the time i arrived at a new job (network admin), phones had always been shitty/buggy\n\nbig boss got fed up with this shit and contracted out phones to a major service provider. never wanted to deal with dropped calls or crappy voice quality so he just told them \"fuck whatever it costs, i want \\*everything\\*. all the features. all the failsafes, backups, enhancements, everything\"\n\nso phones arent IT's responsibility anymore, but they connect to all our systems. the tech from the third party is around almost every day for weeks. we start chilling. after hes done, whenever we have a problem we dont have to wait in the service queue, he just comes, 'cause we're chill with each other now\n\nthen he starts showing up... randomly. we're just having fun, playing games in downtime, chatting, having lunch. like at LEAST twice a week hes there for a few hours.\n\nafter a month or two of this, summoned to big boss' office\n\n\"sooo... see you're spending a lot of time with the phone guy.\" shit \"...even when there's no issue to be solved. just, you know, lounging around. you even have lunch together\" fuck\n\n\"so the *next time he comes around* with *nothing to actually do* and you decide to get *lunch*...\" fuck we are boned \"...don't clock out. bill me that hour. the more time you spend with him, the less i spend worrying about the phones.\"\n\nsuh-weeeeeeeet",
            "If you lived in California, the sixth consecutive day would've started at 1.5x time and the seventh (and I believe any subsequent) consecutive days would've started at 2x time.\n\nThis is how I got paid $5800 to fly home from DCA to SFO. Which would probably be a great MC story to write someday, come to think of it.\n\nEDIT: I misremembered (I moved out of CA in 2017, and this MC took place in 2012). It's 1.5x for the first 8 hours on the 7th day, and 2x time thereafter.  I'll make sure to be clear when I write this MC.",
            "With the lockdown in the UK I'm on furlough. I'm a keyholder and my number is first on the contact list the airport have if there is anything wrong with the site.  \n\nEach call out means I'm take off furlough for the day and paid a full days pay.(The legal minimum for being take of furlough temporarily is 1 day)   \n\nThe company also pays me £50 per callout for being on call.  \n\nlast week I got a call, discovered it wasn't to do with us but next doors unit. Total time on phone was 2 or 3 min... yup I submitted it, it's just been approved and I just got a full days pay & £50 for it!   \n\nI wasn't being sneaky, you have to say exactly what the callout was, how long it was and what you did on the submission.",
            "Good for you. If you are not salaried, you should not work without clocking your time and getting paid for it.",
            "I worked for a Fire District as IT support through a MSP. The department had to have the policy that firefighters who were hourly instead of salary could not have their email on their phone for this exact reason. They had to check their email on the station computer so the department didn't have to pay them for receiving emails on their days off.",
            "Love this story. Work needs to get a piece of equipment back from me but says I have to do it on my own time and I can’t be clocked in while driving from my house to the site and back again. Which would take about an hour or so to get there and back. \n\nI’m just sitting here like, this can’t be legal. You can’t make me use my personal vehicle and my time to do a work related activity and not get paid for it.",
            "I like you.",
            "This might be the most American story I have read today.  \nNone of it could even happen where I live.",
            "\"Fuck you, pay me,\" written forwards and back. Well done!",
            "Some jurisdictions have minimum shift lengths.  \nYou may have been entitled to 3 hours instead of 15 minutes.",
            "I thought everyone checked their work email every day. Maybe I just have a problem",
            "I love how you have to mention it’s not THAT company, and literally everyone knows who you’re talking about lol.",
            "\"You need to be at work x minutes early before your shift starts\"\n\nYou need to clock in x minutes early. Don't work for free.",
            "\\> Oh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes. \n\nHell yeah. Billable hours is billable hours.\n\nSimilar sort of situation long ago where my relief kept showing up late, anywhere from 5 minutes to an hour. There was also a strict \"no overtime\" policy, but it was very much a situation where it would have been unethical and possibly criminal to just walk away without waiting for someone to take my spot.\n\nBig talk with HR that basically came down to asking them, \"are toy telling me to work off the clock?\", and \"I know you are not asking me to work off the clock, so what is the solution here?\"\n\nMind you, my relief was supposed to be there 15 minutes before end of shift. So if they were not there by 5 till, I was to call the head boss and they would cover me till someone showed up. It was glorious.\n\nSucked not many co-workers were willing to do the same despite a not so bad union. Union was aware but I was one of the very few willing to say people were bullied every day into unpaid overtime. Worse still, with no documentation of the work not getting done due to lack of staff, they could not justify hiring more people.",
            "this is....\\*chef's kiss\\*",
            ">I explained that I was just following their corporate directive. I was told at that point that I no longer was able to log those hours. I told them to give me that in writing as that goes against labor laws. Needless to say, the directive to check email every day got revoked.\n\nI love how rules magically disappear when you attempt to LEGALLY obey them.",
            "Oh how I wish they'd pull that with my work. I work 4 10 hour shifts a week and am unionized... If I preform a work function mandated by the company I'm entitled to 4 hours call out pay (at the overtime rate). How sweet it would be.",
            "Rules are rules.  But more importantly..... Paychecks are Paychecks!",
            "Nice!\n\nWay back when the teachers in our school district were first getting internet, computers, and emails, we got a new principal shortly after. Before email, notices were printed out and we'd find them in our mailboxes which we checked at the beginning and end of each school day. That ended with email and we were expected to check our email. I did, generally before school started and sometimes at the end of the school day. Once our principal sent out a notice during the day about a meeting to be held at the end of the day that the email was sent out. Not all of us got the message and missed the meeting. When he rebuked us for not checking our email, I retorted that I check it at least once a day - before school and generally after. I wasn't going to check it while teaching. He planned better after that. And if it was an 'emergency' meeting, they announced it over the intercom.",
            "I laugh at managers who request something verbally then refuse to put it in writing as they know it's against the law - even better to email them after the fact (and their boss) to confirm their directive.",
            "My man! Always ask for it in writing. They either realize they are about to get strung up, or are stupid enough to give it to you.",
            "This isn't even malicious compliance... It's just compliance. They are legally liable to pay you for checking emails, I'm not sure what they were expecting when setting the policy.",
            "I did the exact same thing a few years ago! I had a side job at a bowling alley and was told to be 15 minutes early to every shift. When I said that I would of course log that extra time, they were very perplexed. Apparently, the whole staff had just worked free extra time for years. Needless to say, the management at that place was generally terrible and abusive.\n\nBut hey! They're out of business now, and I'm the CEO of my own company, where work hours are very flexible and every minute is compensated. The only thing I feel bad about is that I missed the opportunity to scratch some people's cars outside that terrible place while it was still operating. (:",
            "I need more of this in my life. I never think of this shit at the time.",
            "22 minutes? Wow, what kind of child (the HR drone calling you) has to spend 22 minutes power tripping over the phone? These children just can't stand being said no to.",
            "Always ask for something in writing. I either got it in writing or sent them an email that said “Per our phone conversation on Date and time, you told me to do...”",
            "I'm in Canada and I have to login to an app regularly for work, and I believe it's unpaid. Would that apply here?",
            "As soon as I saw the title, I knew it would be somewhere in the medical field.\n\nThey tried this on us once, but working in an operating theatre doesn't give you much time to check your emails. We made a point of checking for emails at inconvenient times, and they quickly stopped demanding it.",
            "Too bad you weren't uber vengeful and didn't include the 'that goes against labor laws'.\n\nI'd personally let them dig that hole deeper.",
            "Working for a company with a lot of hourly employees where in IT we have to set their email address as a common store email address for this same reason.  So that any email they read is done so while in the store and on the clock and nobody goes unexpectedly PT to FT by doing email at home.",
            "Similarly try logging your showers at home as \"decontamination\".",
            "> Oh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes.\n\ni love u",
            "That sounds like some Acadian Ambulance shit.",
            "I know that’s not the point of your story, but coming from Australia the concept of a private ambulance company is fascinating to me. Where I live ambulances are provided for free by the state government. But still, I know stories from family who work in the health service and there are still some ridiculous managerial compliance rules!",
            "Sorry you have to work for an AMR adjacent company",
            "This would have been illegal in Illinois had they let you record the hours. We get a guaranteed 24 consecutive hours off within one week\n\n>One Day Rest In Seven Act (ODRISA)\nProvides for employees a minimum of twenty four hours of rest in each calendar week\n\nhttps://www2.illinois.gov/idol/Laws-Rules/FLS/Pages/ODRISA.aspx#:~:text=One%20Day%20Rest%20In%20Seven%20Act%20%28ODRISA%29%20Provides,that%20the%20employees%20have%20voluntarily%20elected%20to%20work.\n\nhttps://www2.illinois.gov/idol/Employers/SiteAssets/Pages/posters/2020OmnibusPoster11x17.pdf",
            "My work makes us do this same thing. We have to make sure we stay up till about midnight on our Oncall weeks and verify an email went through. They use to pay us for the time but they revoked it and made everyone sign a form. I managed to dodge signing the form because it didn’t feel right and I was going to look into what could be done. I still don’t know what actions I could take when it comes to this. \n\nEveryone is still really upset because we still have to come in just as early and we’re not salary. Executives make comments around us about how they are just “checking emails” and that it’s not worth clocking in for.",
            "I love when employees get to explain to their employers how laws work.",
            "You want my time for free? TF you think you are?",
            "star 6 pound              \nWhen I worked at IBM \"star 6 pound\" deleted voice mails.  We took a class one day on \"star 6 pound\".  In other words \"let me aks you to take yo damn silly ass problem down the hall\".",
            "> Oh, but I did put down 30 minutes on my timesheet for the call as it took 22 minutes.\n\nThis is the way.",
            "if they want you to do something, they pay, if they dont pay, you dont do it, its simple :P",
            "> So I was working for a small private ambulance company that ended up getting bought out by a larger corporation.\n\nThat's the most American sentence I've read all week!",
            "As a paramedic, fuck anyone who thinks I’m doing anything for free.\n\nOP, you’re a person after my own heart.",
            "Logging 30 minutes for the call is just *finger kiss*",
            "Wonderful. Well done",
            "The fact that this counts as malicious compliance is sad and proof that we live in a r/boringdystopia. With normal contracts, you get what you pay for (or even less), but the other way around (and work is nothing more than a contract with ie. your phone company), you are expected to give more than the contract provides for (not less, as with your phone company).",
            "The fact that you even logged the call makes you the hero of the day for me.",
            "This isn't even malicious compliance, it's just compliance.\n\nMy workplace went back and forth on the same as I'm on call. My old boss really wanted to micro manage things, and I made sure my time cards very accurately reflected the work I did. My current boss is less interested and as much as possible within a given work week I short time at work for time doing work at home.\n\nIf I end up doing overtime due to on call stuff I ensure I get paid appropriately.",
            "what stops you from being afraid of just getting fired?",
            ">So I was working for a small private ambulance company\n\nWhat in the hell is that? You guys have private ambulance companies?",
            "“Oh, but I did put down 30 minutes on my timesheet for the call”\n\nThat’s savage man! 😂  good to see someone being able to give it back to the corporate!",
            "What's great is I know which one you're saying it isn't and by default I know which one it is. lol",
            "money's money you gotta work it some how",
            "Very much enjoyed your story, thank you for sharing and congratulations on your victory!",
            "I am learning a lot from this post. I deal with abusive HR and tend to level up my game against them. Your ideas are so clever and neat !",
            "Man, if I was the employer in that situation, I would have just said \"Alright fair enough, crack on\". Paying out 15 minutes a day to make sure everybody is up to date on what's going on is actually worth it imo",
            "Every minute you spend makes your employer a half hour in profit. Never feel bad for a minute for yourself.",
            "It's funny how this is malicious compliance in the USA lol. What a distopia.",
            "Beautiful, beautiful play.  Wage theft is still theft.  No, YOU are the hero.",
            "Why did you put 30 minutes down when the phone call was only 22 minutes?",
            "I love this",
            "I love this. Actually I should do this.",
            "Small Private Ambulance Company. That's all I needed to here.",
            "Why are people so shady like this. Nicely done.",
            "Man I wish I only had to check my email once a day.",
            "This should be made into a short film...",
            "Haha stick it to their paychecks",
            "Government contractor here, glad that I’ve always had good management, regardless of which company I worked for (large and small). While they’ve all wanted me to minimize my overhead time, I didn’t have to defend charging it (though I usually put notes in my timecards so that people could see why I was charging to overhead instead of to the customer)",
            "When I first started working at a call center, they casually told us about things such as the attendance policy and issues that can get you in trouble, particularly “customer mistreats”. Now the attendance policy stated we must be logged in and ready for a call within 3 minutes of the shift start time. Customer mistreats including things like checking your email while the customer is telling you their issue. While discussing all of these things they advised we be at our computers 10 minutes early to get ourselves together and do things like “check emails so you’ll be prepared for the day.” I laughed audibly and asked “Does the union know you want us here 10 minutes early to do unpaid work?”. I’m pretty sure my life at that call center went downhill from there. \n\nNot checking emails lead to a lot of issues because there were changes and mandates we missed. Management decided to give us 5 extra minutes in the morning to look through emails but that lasted a good 2 weeks. We pretty much winged it and if we missed a mandate because it was in an e-mail we didn’t get a chance to read, management wouldn’t say a thing but advise to do it next time.",
            "Doesn't 22 mins round down to 15 not up to 30? Assuming your work asks for time entries in divisions of 15 min like mine does",
            "It's illegal to check work email without being paid for it?\n\nThis is news to me.  Sounds oddly petty.",
            "Stopped reading at ‘private ambulance company’ to consider how America fucks up every damn thing it touches.",
            "Not malicious, just compliance. Not your fault the law is what it is.",
            "If she likes to look in your upstairs windows, get a big piece of paper,  a sturdy thick black marker and write GET FUCKED! Then tape it to your window facing her house.. if she complains - which she will cause you know ..Karen - ask her why is she looking in your windows to begin with! \n\nKeep us updated how it goes lol",
            "You did all that because.....you had to check your email? I have bad news for you.",
            "Kinda sounds like your a douche to be fair. Takes literally 5 seconds to check your email. I get my email to my phone. I look at it all the time",
            "[deleted]",
            "ianal /not legal advice; Hey if your company is being fishy, memorialize your conversations/ keep notes, and I would guess stay clocked in while organizing them all. Include your name, date, and time and then everything you recall and what happened including what led up to the conversation. Sign it. If you’re getting into detailed based arguments, you can also write and sign it in the presence of a notary to help prove when it was made. I’m not sure if you can call those work related duties and stay clocked in, but if you’re having conversations outside of work I’d tack this onto the responsibility involved put on you by the company. I think a total 30 minutes of work time is totally justified for a 22 minute convo, 8 minutes is fast if anything",
            "Why do I sense that you worked for AMR?",
            "this pleases me",
            "Ha, I am supposed to check my email several times per day (including weekends and holidays). I am also supposed to follow up on those emails. Yes I make 50+ hours a week (and sometimes 100+ hours),\n\nNo, I get only paid 40 hours and no overtime.\n\nThe reason for this is that managers are exempt for any laws on labor laws.",
            "I also work for an ambulance agency that also yeah a policy to check my email 3 times a day. I just don't check ever if I'm not scheduled to work and clocked in lol.",
            "[deleted]",
            "Way to stick it to the Corpos",
            "  F",
            "Question: my job used to have weekly call meetings (I rarely attended due to third shift) that was mandatory that has switched to monthly. No pay for it unless you’re working on site. Chance of same thing happening here?",
            "Private ambulance companies?\n\nWtf?\n\nWhere is that a thing?!",
            "What was the large ambulance company?"
        ]
    },
    {
        "post_id": "gmomlv",
        "author": "TboneXXIV",
        "title": "You can't park there. Ok, you can, but it will cost you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gmomlv/you_cant_park_there_ok_you_can_but_it_will_cost/",
        "score": 26116,
        "num_comments": 822,
        "created_utc": 1589895168.0,
        "selftext": "My parents had this problem with a guy parking a tractor trailer on their land.  He lives right across from one of their pecan groves.  The grove has well spaced trees all in neat rows, the grass is mowed super short, the ground is really flat.  It looks like an ideal place to pull your rig if you don't know better.\n\nThe ground is so flat because they use mechanical harvesting.  Bumps and grooves can cause the machines to leave pecans laying on the ground.  A 2 inch deep groove from a big truck like that can hold thousands of dollars of pecans and will until it is fixed. Oh, and you have to get them up by hand.  It's a big deal when someone screws with your livelihood like that.  \n\nSo the guy parks there one time.  They get it, he probably doesn't understand he is causing so much trouble.  Dad goes down, explains the damage he has done, tells him the grove is private property and not to do it again.  Dude, we'll call him Dude, agrees, apologizes.  Dad goes home, fixes damage midweek.\n\nNext Friday there is the truck again, same spot.  Dad, not about to put up with this, calls the sherrif dept.  Cop comes, truck moves.  Dad fixes damage midweek.  Next week, no truck.  One week later, truck is back.  Repeat complaint for trespassing to sheriff.  Dude claims he forgot.  He drives over the road and his home depot where his car is parked is 30 miles away.  It is convenient for Dude to forget because he saves his gas and time by driving his employers rig and parking it on my parents land.  (Also, he doesn't get nailed if his cab isn't clean, no other driver gets assigned 'his' truck.  There are plain motivations.)  Dude clearly does not forget every time he is home but this is what he claims to the deputies sent out on the complaints.  After 7 times the sherrif department is called, he FINALLY gets a trespassing citation.  No fine is levied.  Drives his car two weeks in a row.  Following week, truck is back.  At this point my dad has fixed this damage so often he is keeping a tractor and blade on the property so it gets done faster and easier.  \n\nCalls the sherrif yet again.  The sheriff himself comes out this time.  Truck leaves, sheriff comes to see my dad.  Says the enforcement problem is that it is hard to explain to a court the harm when pictures hardly show any damage and Dude always apologizes and moves the truck when deputies come.  Says getting Dude for trespassing under those circumstances is going to be tough but he is on this and will see it through for my parents but his office us 30 miles away, not that many deputies to be out patrolling, etc.\n\nAnd then the sheriff, bless his little elected heart, says, \"But if there were something different like a theft of services going on...\"\n\nCue Malicious Compliance.  \n\nThe next day, signs go up on 80 trees in a row (8000 feet, they are 100 feet apart).  \"Semi parking.  $500/hour.  Prepay.  Violators will be towed.\"\n\nDude doesn't pay the signs any mind.  Dude does, however, pay the tow truck and deputy quite a bit of mind.  Comes running and screaming, waving his arms as they are hooking up.  \n\nWell, before my dad called to have him towed, everything was documented, including having the sheriff himself drive by and take several pictures of the truck parked with the clearly visible signs.\n\nEverything is put on hold while Dude's employer, who owns the truck drives out.  \n\nAfter 3 hours, Dude's boss gives up and writes a check for $7800 to cover parking and tow truck fees.   That actually covered the tow truck, all the repairs, printing the signs, and beer for about a year for my dad's Tuesday poker gathering.  Salut.\n\nDude, who still lives there, does not park in the pecan grove.  His boss payroll deducted his checks for 2 years.\n\nTLDR; trying to stop trespass parking is useless.  Charge for parking instead.\n\nEdited for typos and clarity.  Thanks for the upvotes.  \n\nYes, my dad IS awesome.",
        "permalink": "/r/MaliciousCompliance/comments/gmomlv/you_cant_park_there_ok_you_can_but_it_will_cost/",
        "comments": [
            "[deleted]",
            "People think because my trees are next to the road ( on private property ) that they can come steal my fruit. I am going to use your dad's logic and put up a sign for a hundred dollars a pound. I'll let you know how it works out.",
            "As a truck driver, I get why we was wanting to do that. But also as a truck driver, I never park my truck anywhere without asking first. I've been turned down before without reason and that's fine. You just accept it and go somewhere else, even if it's a PITA, as it often is. It's part of the job.",
            "Best MC story I’ve read in a while.",
            "That’s such a good idea to put up that parking sign. Kudos to the nice sheriff. \n\nI can’t believe the driver, after ignoring your repeated warnings, didn’t think anything of the sign. How could he be so dense as to not notice it’s clearly for him? \n\nHe’s either dense or incredibly entitled to assume he’d keep getting away with it. So deserved it.",
            "Some people just don't seem to learn a lesson, unless it's a painful one. Kudos to the sheriff for dropping the hint.",
            "For those who are curious, the reason the nuts are so impacted by the grooves is because, as OP said they mechanically harvest, they more than likely are using tree shakers and ground collectors in their orchard. \n\nBig machines clamp onto the trunk of the tree and shake until all nuts fall. Then a sort of spinning brushes which can then sweep into an above tank. So these spinning parts only affect a level ground and any outlying nuts are left behind",
            "That’s awesome! \n\nThe only parking story I have is that my grandfather had throat cancer, causing him to have to use his finger on his throat to talk. So he rented a handicapped spot for many years before his death. I knew he parked there but never knew it was his- until I was willed his apartment and moved in. \n\nNow, my MIL is handicapped and cannot walk long distance or sit down for long periods of time due to a rod in her back. So, when my in-laws visited, they legally parked in the spot. The old man at the other end of the row claimed it was his spot. Except the city owns these lots. \n\nAfter some back and forth, the neighbor next door informed me that this guy literally removed my grandfather’s sign and put it in his preferred spot. I never had a chance to do anything about it but waiting came with sweet revenge. He complained to the city whose response was to remove it since my grandfather was no longer paying. Lmao I still laugh every time I think about it! \n\nThe funniest part is the space we told him to use was further away from my apartment but actually closer to his! He complained about being out of breath yet every time my MIL left, he’d come move his car...",
            "When I was about 18 living in rural Arkansas and no jobs around for miles. I and a few friends had the idea to go out to my family's land and hand pick pecans for the entire winter. \n\nThe land had about 13 large pecan trees that have been in our family since my grandparents planted them. And the pecans started dropping about November. Pecans were going about a $1.21 per pound. \n\nI and three of my guy friends started picking 100 to 200 lb a day, and each made between $50 and $70 a day picking pecans. We would pick for two to three hours then go sell the pecans and smoke the rest of the day away.\n\n Picking pecans was some of the best money that I've ever made in my life. And some good ass memories came out of that time, but picking pecans at that rate off of 13 trees is not really sustainable and it only lasted until January. But it was fun while it lasted.",
            "This is similar to what we (my family) had to do at the hunting camp we own in MI UP. My grandfather bought the property (120 acres) before the State turned the area into a State Forest Area and it’s been in the family ever since.    \nAnyways, there is an area for 4 wheelers nearby, plus the roads and of course the private trails on our land.  We started having problems with people leaving their 4 wheelers out behind the camp building because they were too lazy to take them home and back.  Plus they were breaking into & using the camp building itself to cook, shower, toilet.  This all despite the “No Trespassing “ & ”Private Property” signs around the whole place.    \nAt first we just attached notices to the vehicles (used those plastic paper holders meant for putting in 3 ring binders, note inside, sealed top with duct tape, zip tied to handle bar) telling the owners that it was private property and to remove vehicles from it.    \nThat didn’t work, but we still have a lot of distant family in the area soooo\n\nNew notice informed that if we (or one of our agents) found their vehicle on our property we would assume it was abandoned and promptly remove it.  Then gave our distant family permission to check on the camp regularly and any 4 wheelers they might find were theirs to keep.  After about 6 weeks, there was no more problem.",
            "[deleted]",
            "This is incredible. Great story with a great outcome.",
            "I had a friend with a retail store in a high end little NY town that had a similar problem. \n\nShe kept losing pens, but did not like the logistics/look of having it chained. So she hot glued a giant flower to, but people still walked off with the pen.\n\nShe add a sign that said \"pens $10 each\". \n\n\nNo one ever bought or stole one.",
            "Why does there have to be harm to charge him? He is clearly on private property.\n\nHaving said that, good for your dad.",
            "Modern problems require modern solutions.",
            "Pecan Trees are serious business. I used to chase for a hot air balloon in Southern NM and damaging a tree would cost some serious $$.  Depending on the damage, the pilot could end up paying for the projected crop for the expected life of the tree.",
            "Your dad sounds like a nice smart man with a lot of patience. Good for him.",
            "Dude: I want to park here\n\nOP's Dad: Be my guest!",
            "Was a truck drivr for 20 + years, I know so many ways I could have cost the truck driver his job and I would have done anything I could to make it happen. I hate inconsiderate idiots, my garage is in the alley and has many no parking in alley signs yet I had people parking at my garage door. Call cops and they did nothing so I started calling my repo friend who would tow the cars 2-3 blocks away, no more problems.",
            "Just because pecan park somewhere, doesn't mean you should!",
            "Sounds like r/prorevenge \n\nMy family have had something similar happen to you. Maybe too similar and it's a small cart.",
            "I love your dad! Will he adopt me?",
            "I'm sorry I can only upvote once.  Please high five your dad for me.  That is amazing!",
            "Some people are like this. I had a neighbor that deserves his own story here. Had to fight him in court. He had to sell his house in the end. All due to him using my property. \n\nIt’s absolutely mind blowing what some people feel they are entitled to and should get away with. On top of that they will act like you’re the problem for not letting them shit on you. \nIts cray cray!",
            "Wish I was there to see him try and explain his way out of that last one, bet it was absolutely priceless.",
            "This is some brilliant revenge... r/ProRevenge one might say.",
            "I have a friend who works in property management. She mentioned the importance of signage when it comes to towing violators. I had a tear in my eye when I got to that part of your post!",
            "This is one of my favourites I've seen in this subreddit.",
            "That salut really just sent into a hysterical spiral",
            "I love dudes employer",
            "Theft of service. Man, that is really smart!",
            "You’re damn right your dad is AWESOME",
            "This is juicier than a Georgia peach and I love every ounce of it.",
            "Haha I love this story. The ending was the best. The boss took the money he spent out of the dudes payroll for 2 years hahaha that got me best of all. Teach the dude a valuable lesson.",
            "Best MC I’ve read. Kudos!",
            "$7800?",
            "This comment has been censored. #Save3rdPartyApps",
            "Upvote for \"bless his little elected heart\"",
            "Ahhh, legal justice. \n\nPut up some cameras when he's out drinking and driving and decides to \"get even\" at night.",
            ">Dude, who still lives there, does not park in the pecan grove. His boss payroll deducted his checks for 2 years.\n\nEPIC. Love it. This almost seems more like r/prorevenge, but I don't care. Great story.",
            "“This area is where we target shoot. Your truck was in the way of my backstop. Enjoy the Swiss cheese”.",
            ">\"Dude paid the signs (suspiciously put up after seven visits from the sheriff) no mind\"\n\n\\*grabs popcorn\\*",
            "> TLDR; trying to stop trespass parking is useless. Charge for parking instead.\n\n\n\nIt's the service economy in action :)",
            "That is GLORIOUS!  your dad is awesome and that  sheriff also has my vote when election time rolls around.  that would've been a great vid for yt!  oh to be a fly on the wall to hear the ass chewing dude got from the boss......i love these types of victories",
            "Shoot out 9 of the 18 tires the first time this happens. Claim ignorance. Problem solved in about 57 seconds.",
            "This one has me laughing.  I can use something like this.  LOL.",
            "That is brilliant!",
            "That’s genius",
            "So there had to be a crime/damage committed before sheriff would do anything? That’s BS. The crime is trespassing. The end. Damage is extra. What is so damn difficult about staying off other people’s property? And why do police not accept trespassing as a crime?",
            "I'm amazed by the amount of \"Well what I woulda done\"s in the comments when the actual conclusion of this story is already pretty satisfying as-is. Thanks for sharing your story.",
            "i mean, if you apologize technically you understood you did something wrong and try to don’t do it again, but hey, i’m no one to judge someone",
            "You missed an obvious pun for the signs: “You pecan’t park here”",
            "Dude is either oblivious or doesn’t care...nah. He’s both. Loved this story. Best MC I read in a while.",
            "Love it!",
            "I love this a thousand times over!",
            "This is hilarious, and such a great idea",
            "Really brilliant.",
            "Imagine putting like $10,000/hour parking signs.",
            "That is glorious!  Sometimes you just gotta work with the system",
            "Great read. Dudes boss handled the situation lol. Bet that dude is out of a job after that. Unless dude's boss was his father which 8 times out of 10 it usually is that he is doing that with reckless regard. In which case he is now out of mommy's chicken tendies!",
            "OMGosh, that was glorious!!!",
            "Nicely played sir.",
            "This is the best MC story I’ve read on this sub.",
            "Ooo this was a good one",
            "Clever solution - I like it!",
            "This is more r/justiceserved really but a good read.",
            "Should have called the employer after the 3rd time would have saved alot of hassle",
            "Wait, you mean to tell me that it is possible for a person who is \"actually trespassing\" not to be charged for trespassing???",
            "Nice.",
            "That waa brilliant great sheriff as well.",
            "Why do I have a feeling this happened in southern GA",
            "YAY!!!! Go dad!!! 👍🏻👍🏻",
            "Bless that sheriff!",
            "This post made my day. Ahhh",
            "Your dad is smarter than me. After the 2nd time, I would have gone sabotage or violence and then only I would be in trouble.",
            "This is beautiful.",
            "Beautiful, so satisfying",
            "after the second time i'd be slashing tires",
            "Haha thanks. I wish it was a story I didn’t have/experience to tell. I never wish a neighbor from hell on anyone. It destroys your comfort, relaxation and piece of mind. Your home becomes a stress. \n\nSometimes you just gotta knock a bully out in a long term strategy. \nCut the head off not the fingers :) metaphorically speaking :)",
            "[deleted]",
            "This is a great story. But I really have trouble understanding what those nuts are or why there would be thousands of dollars in stuck in a groove. How is there even so much flat space, if there are nut trees or whatever...",
            "I loved that your dad was so patient and nice by simply informing the law for 7 times, but still got his revenge in the end! Bless the man!",
            "Oh fuck, I loved this MC. It made me laugh.",
            "outstanding!\ngreat play OP 👍",
            "Great story best ive seen here",
            "Ok here we go again.",
            "Ok now that's just ridiculous, you're totally right!",
            "7809 dollar Holy shit. Expertly done.",
            "I love this.  I have seen other people use this successfully. Kudos.",
            "Absolutely fucking glorious. Thank you so much for sharing!",
            "my hat is off to you on that one, brilliant move.  If it wasn't a needed part of the properly I would've suggested putting up something there to keep the ass from parking there in the first place."
        ]
    },
    {
        "post_id": "7r5pzb",
        "author": "shutuphipp",
        "title": "YOU DON'T CALL ME...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7r5pzb/you_dont_call_me/",
        "score": 26110,
        "num_comments": 610,
        "created_utc": 1516235243.0,
        "selftext": "I work as an emergency dispatcher and 911 operator. The other night we got a call about a pickup truck parked at a tire store, loading tires in the back. Deputies responded and found that, yes, a theft had obviously occurred and asked if I would call the owner to see if he wanted to come out and file a report.\n\nThe owner was obviously annoyed with the 1:30 phone call, as people tend to be, but once I explain the circumstances, they tend to react appreciatively. But as I began, \"This is [County] communications. We have deputies out at your-\" he snarled, \"YOU DON'T CALL ME AT THIS TIME OF THE DAMN MORNING!\" and hung up. Well. He obviously didn't care that much, then, did he?\n\n*shrug*\n\nI radioed the deputies. \n\"Made contact with the owner and he advised we do not call him at this time of morning.\"\n\"[County], did you add that to the notes?\"\n\"10-4. I did.\"\n\"Show us clear, then!\"\n\nA few days later, my supervisor told me the owner, after filing a report the next day for the stolen tires, complained that we should've contacted him when it happened. The complaint made it down to my supervisor, who kicked the notes and a recording of the 45-second phone call back up the chain. The owner was basically told where he could shove his complaint.",
        "permalink": "/r/MaliciousCompliance/comments/7r5pzb/you_dont_call_me/",
        "comments": [
            "I work for a fire alarm company. There have been times when a customer is angry that nobody called them to notify them about an issue with their system.\n\nOur central station has all calls recorded. I love to conference my phone with my computer and play them the call recording of them receiving the call as they complain they were never contacted. There have been times when they've literally received a call daily for the past two months and still attempt to claim they had no idea there was an issue.  After proving this to them, they're often still angry at me for their failure to take action on a problem. Funny how that works.",
            "Shame too, the first 4-8 hours of a tire theft are the most important.",
            "The true malicious compliance would have been to wait a minute and call him again. Because that would be a *different* time to call him at. Repeat as needed.",
            "As a fellow 911 Dispatcher, love this! However, my agency probably still would have disciplined us because we didn't call the owner back and made the situation very clear before they hung up a second time. -_-",
            "42 comments and nobody has said it. \n\nHe didn't want you calling him at that hour of the morning... because he was **tired**!",
            "I work for an AMR call center. When someone gets dispatched, but the person says they don't want a ride, no matter the reason, we're not supposed to give them a new ride. That's called denying transportation, and it's a reason for not getting another ride. I love when people tell me, \"Hey this person showed up too early, I don't want to go to the hospital before 0630 and it's 0540! I need a new ride later so I'm not so early!!\" I like to tell them that we can't give you a ride, you denied transportation, please find another way there, *hang up*",
            "As a 911 Dispatcher myself I always get nervous calling people during the wee hours but my favorite call to make is the one asking the registered owner if they know where their car is and asking them to check the garage if they respond that it’s parked there. ",
            "Is it standard for emergency dispatch to use a relatively benign sounding name like \"[County] communications\" when making a call like this?",
            "[deleted]",
            "Fellow 911 operator here. This stuff happens all the time, but it's especially awkward for us since we can't tell the person *why* we need them to show up (because of a stupid policy). All the time, this happens. Someone gets arrested for DUI and the following ensues:\n\n> \"Radio, call *<phone number>* and see if they can pick up the vehicle.\"\n\n> 10-4.\n\n[...]\n\n> *ring, ring* \"Hello, who is this?\"\n\n> \"Mr. Smith? This is *x* County dispatch. Your wife was involved in an incident and we need you to pick up her vehicle.\"\n\n> \"Oh my god? What happened? Is she hurt?\"\n\n> \"I can't tell you any details. Will you be able to pick up the vehicle?\"\n\nShit drives me crazy. If it was them calling me, I'd be pissed if I didn't know if my loved one was hurt or killed.",
            "When Brezhnev died, my college roommate woke me up in the middle of the night to tell me and we had a discussion about it. So *he* said. Went back to sleep and had no idea about Brezhnev's death the next day. Had to be told again. Sometimes we aren't awake when we're awake. ",
            "Perhaps he just heard “This is [county] communications” and thought you were a wireless provider pitching him on a new cell phone contract? \n\nThat’s a pretty vague name to identify yourself with.",
            "[deleted]",
            "You have to tread lightly when waking up someone that tired. They might blow up under all that pressure, or even blow a valve, stemming from the theft.",
            "To be fair the amount of spam calls people get these days is insane. I’m on call 50% of the year. On some nights I take 1 call, on other nights I take 20. I treat every call as a possible medical emergency call out and am always respectful. Thankfully most of the fuckers are automated. Sometimes they aren’t and I would never respond the way this guy did at this point in my life. 10 years ago I absolutely let my emotions show when I felt it was allowed, I’ve learnt it’s only necessary in emergencies now and it’s not an emergency when I’m woken from my sleep at 1:00, 1:10, 1.15, 1:20 ad nauseum until 4:00. It’s my job and I must respond professionally. \n\nThis guy is either immature or an asshole. I’m definitely thinking it’s asshole.",
            "I had a similar reaction to the police calling in the middle of the night (my brother had been arrested) but the call started differently:\n\nMe: \"Hello?\"\n\nCaller: \"Are Mr or Mrs [last name] available?\"\n\nMe: \"It's 3 in the fucking morning.\"\n\nCaller: (in an extremely snotty tone) \"This is Officer [whatever the fuck his name was] with [town] Police Department!\"\n\nMe: \"Well then, next time, you should identify yourself *first*. I'll go wake them, hang on.\"\n\nAnd then I went and got my parents.\n\nFor real, tell the person answering that you're a cop. Especially if you're calling at a ridiculous hour.",
            "If someone called me at 1:30AM and identified themselves, not as police, but as “communications”, I would also hang up.",
            "> \"This is [County] communications.  \n  \nThat's because that sounds like a generic marketing call. You people need a better introduction. \"Hi - I'm calling from 911 Emergency Services\" or something would be better :|",
            "To be fair though whenever someone wakes me up in the middle of the night for something I never remember it in the morning. ",
            "If you don't want to get calls outside certain hours, shut your damn phone off.",
            "Thanks for what you do!",
            "If someone called me at 0130 stating they are from \"x communications\" I'd flip out too. That's why we say \"This is the dispatch center for the X Police Department...\"",
            "Well, not to excuse rudeness, but if i had a 30sec exchange at 1am in the morning and went right back to sleep, chances are i may not even remember the next day...",
            "Looks like he was.... tire-d.  ",
            "Do medical calls now, no winning sometimes.  Tonight was hysterical.  “WHY can’t I be seen?!”  “Um the offices are closed.” “FUCKING LIAR I AM HERE ALL THE TIME.”    2 hours later a call...  “WHY IS YOUR LOUNGE CLOSED?!”  Siiiiiigh",
            "[deleted]",
            " If police knew that a theft had occurred, why do they need the owner to file a report? Is that for insurance purposes?\n\n",
            "If I was that boss, I'd think back to the 1.30am call I hung up on and... y'know, NOT complain about not being contacted.",
            "He's tyred, give him a break.",
            "I probably would have been this guy.  I don't wake up nicely.  I once woke up to my mother standing in the door, practically growling, \"What. Did. You. Just. Say. To. Me?\"\n\nShe had thought I was awake, since I just went to bed, and asked me to do something in the morning.  I proceeded to tell my very religious and short tempered mother no (a mistake) and to duck off.  \n\nLuckily, I was sufficiently confused to save myself from punishment.",
            "What a moron.",
            "was 1:30 am. he probably wasnt awake when talking to you. ",
            "Ahhh... when the system works. :) ",
            "I gotta say, for a sub about malicious compliance, a lot of the comment I see on posts like these seem to dislike such. I enjoyed your post though",
            "Do they usually get a ton of calls from the county where you live? If it was someone who is calling me several times a month, I might be upset, but I don't ever really get phone calls from the county, and never late at night. I know people aren't themselves when they're tired, but it's still kind of shocking he wouldn't be at least a little curious why the county is calling at that hour. ",
            "He probably thought it was a telemarketer. That's what he gets for being rude I guess..",
            "The sad part is that he might already have a bad day to begin with and had his sleep disturbed.\n\nAnd the next morning to find out HE WAS ROBBED BITCH!",
            "What was the malicious compliance?",
            "the amount of spam calls i get a week, at all hours, has gotten out of hand. I would have called him 1 more time. I could see the issue. It has become an obscene problem. You woke him up from sleep, if anything he is disoriented as well...",
            "[deleted]",
            "Some people aren't really awake when they do this stuff. I've had small conversations with people who were just asleep that won't remember it at all in the morning. I would've probably called him back.",
            "Where's the compliance? The guy was just an asshole, but I don't think anybody maliciously complied here?",
            "Although the OP’s story is extremely satisfying, I would get in trouble for doing my job this way. Every agency works differently though. And if the officers seemed okay with how things ended up, then that’s a wrap. 10-8 CLR",
            "Was the guy even coherent when you spoke? \n\nI dunno man, this sounds like you didn't preform due diligence.\n\nEither way bragging about it here is pretty fucked up given your position",
            "Dispatcher here, too, I fucking love saying \"RP (caller) is being a total dick\" in a professional way. \n\n",
            "I mean... if you absolutely don't want to be called at that time ever, why not turn off your damn phone for the night?\n\nWhat a silly man.",
            "That poor man..",
            "[deleted]",
            "[deleted]",
            "Was this at Crazy Rays...",
            "Next time just burn the rubber",
            "Blue streak",
            "Probably an employee stealing, because the owner is usually a dick",
            "Awesome storytelling!  Right to the point. ",
            "I work as an alarm agent that are the middle men for residents, companies and store owners with security systems that are monitored 24 hours for police/fire dispatch. \n\nI know to well this type of scenario and do not understand the attitude that comes from MOST of these people with alarm systems.\n\nWhen an alarm such as Burglary and Fire are activated, regardless of an actual or (most likely) false, as an alarm agent we have very specific procedures to follow with calling customers about active alarms, no matter what time in the morning or evening.\n\nThis mean the typical phone call for an alarm agent is meant with anger and disdain. \n\n“Who are you and why are you calling!?”\n\n“Do you understand what time it is?”\n\nThe worst is when a subscriber of an alarm system calls me for information about their own security account and doesn’t recall the password (that they set up) and gets furious when I can not give them the info due to their inability to remember their own password/code.\n\n“I have never had a password for this account!”\n\n“I’m the owner, and I demand the information, NOW!”\n\n“You called me and you’re telling I need a password to get information from my own account!”\n\n...and so on\n\nThen there are accounts when the first contact to call is police dispatch, which is fine since there is the symbiotic relationship between alarm agents and dispatchers. However, when a faulty alarm doesn’t get rectified we have to keep calling dispatch as long as we’re getting alarms and that can be VERY annoying on both parties. \n\n“I’m calling to dispatch on this burg alarm “\n\n“We already canceled the dispatch and got a false alarm call for you guys”\n\n“Unfortunately, it’s going off again  and the owner does not have proper code to the account to mark it false.”\n\nWhat I have come to learn is that unless you’re a business or own a business (small or big), and even then, security that is monitored 24 hours is more of a hassle for what it is worth.  Piece of mind is about calling 24 hours to make sure everything is okay. Crime is not adherent to the subscribers schedule, which mean calling about a faulty alarm at for in the morning and getting screamed at during the process.\n\n\n\n\n\n",
            "I worked for an alarm central station. The amount of times people got pissy when we called them bc their business was being robbed and the police required a key holder to respond was insane. So glad I'm not working there anymore.",
            "Fuckin right o fuck that dick ",
            "Lol, glad to hear about your excellent note taking skills! I too, am aiming for this position. I took the class and I am in the hiring process now....takes a long time! ",
            "Come on dude. You don't call someone at that time of the damn morning.",
            "He was too TIRED......\n\nCome on people, I didn't see this pun anywhere.   Get your damn act together."
        ]
    }
]