[
    {
        "post_id": "144b8og",
        "author": "BeeeRick",
        "title": "Boss told me to gain some perspective, so I did and found a new job.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/144b8og/boss_told_me_to_gain_some_perspective_so_i_did/",
        "score": 25781,
        "num_comments": 623,
        "created_utc": 1686235594.0,
        "selftext": "I worked as a systems administrator for an IT Firm. I got tired of dealing with abusive and angry clients for 5 years. I got tired of being micromanaged and being exploited. I got tired of being talked down to like i was a child anytime the slightest little mistake was made. When my boss learned I was no longer going to work in another market 3 days a week like I originally planned and he had no one else (because no one wanted to deal with the jerks in that market), he spent an hour lecturing me on \"taking a long hard look at myself\". He said that he was concerned about my reliability after refusing to spend 3 hours a day commuting to the other market on top of my work day. \"If I can't rely on you to work in the other market then I just don't know if you have much of a future with this company. I think you need to take a long hard look at yourself and gain some perspective\". You know what, you are absolutely right. 2 weeks later, I found a new job and gave my notice. He BEGGED me to stay, offered me more money, etc. This went on for days. I said \"no thanks, I finally found that perspective you wanted me to find. Boy am I glad I did! A new job with a raise and benefits, and no stress. The only advise you've ever given me of value! Good luck to you!\". He let me go a week into my notice. Started the new job, love my new boss and my coworkers. Its been over a year later, the former boss hired 6 different people to fill my spot, each lasted 1-2 months before they left.  Hmmm, wonder why that is. Maybe he needs to gain some perspective on how to run a company and treat people?",
        "permalink": "/r/MaliciousCompliance/comments/144b8og/boss_told_me_to_gain_some_perspective_so_i_did/",
        "comments": [
            "*\"Gain some perspective\"*\n\n\"Whoa. The perspective from outside this shitty office is amazing!\"\n\n*\"wait, not like that\"*",
            "Every time I peruse Craigslist for jobs, I see the same ad for the same job where I worked for 3 weeks... 12 years ago?",
            "I once had a girlfriend who said we couldn’t get married unless I became a Christian too. \n\nShe suggested I have a conversation with her priest. So I did. We spoke for about two hours. \n\nGirlfriend: “How’d it go?”\n\nMe: “He convinced me that you and I should not be dating.”\n\nGirlfriend: “What the f…”\n\nThat was like 20 years ago. Still friends.",
            ">Its been over a year later, the former boss hired 6 different people to fill my spot, each lasted 1-2 months before they left. Hmmm, wonder why that is. Maybe he needs to gain some perspective on how to run a company and treat people?\n\nI guarantee he hasn't learned a thing. He's probably joined the *no one wants to work anymore* crowd and is blaming that for his problems. All to rationalize his awful management style  \n\nHe thinks he is the victim \n\nPeople like this never change",
            "Excellent job! Good for you!\n\nI once worked for a company that was bringing everyone into the 20th century by taking out all the dumb terminals and putting a PC on everyone's desk. Also, we were setting up LANs and WANs and moving to the Microsoft Suite of office products. It was a HUGE undertaking, but really needed. Owners told our sole Network Admin to do all this himself. He argued. They refused to believe he couldn't do it himself. He argued some more. They refused to budge. So, he quit. Moved to Texas to be closer to his daughter and new grandbaby.\n\nThe company had already started the process. They hired a consulting firm (HUGE $$$$) who sent a team of people. 2 guys who spent all their time in the server room. 1 supervisor for the whole project. I got two techs assigned to me (help desk manager) and then had a third guy who just did hardware and software setups. Things went pretty smoothly.\n\nThe old guy came back (I think to sell his house) after about six months and visited the office. He was greeted with smiles and hugs. The supervisor of the consulting firm told him (I was there) that they had to bring in three people to replace him, and that he had nothing to be worried about or ashamed of. He had made the right choice. I thought that was very classy of her to say that to his face. He was super happy to be by his daughter and grandbaby, the entire company got updated and upgraded, and I stayed there 11 years.",
            "Good on you!! I always lovw when they toss money at you as if that’s the problem.\n\nMy husband got an 83% raise one year (over the course of the year) because they were terified he would leave like everyone else. He left 3 months later and I was watching the zoom call when he told his boss. The color literally drained from his face\n\nEdit: it was not 83% all at once. He found out a new hire was being offered significantly more and asked what his incentive to stay was. They gave him and another on his team 30% more to equal national average and what they offered the new hire. He got a promotional raise and the yearly raise… and maybe another one I cant remember. It equaled 83% at the end of the year. This still didnt give him much over national average and just barely a cost of living balance.\n\nHe actually took 8K less a year for the new job. It is much more progressive and better benefits. They also offer an educational allotment",
            "If EVERYBODY has problems working for that guy, maybe the problem is NOT everybody.",
            "Bosses like this rarely realize that \"perspective\" is the last thing they want you to get. It almost always results in a crystal clear understanding exactly how fucked up they are.",
            "My ex-boss recently gave me the \"change starts with you\" speech. I applied for another job while on my lunch break that day. They emailed me the next day, interviewed me and hired me within a week. I start soon, and will be making more money with half the commute. Ex-boss gave me the Surprised Pikachu face when I handed him my notice. Guess someone should have given him the \"people don't quit their job, they quit their manager\" speech.",
            "I should also note, what I found amusing, was that one of the guys he hired kept disappearing at clients, and one day didn't show up at a client for several hours. When questioned he said he \"got lost\". On his last day, they found him passed out in his car with drug paraphernalia around him. The pool for new hires must be grim if you are going to hire that type of person. LOL",
            "Had a similar experience myself. \n\n“You don’t know how good you’ve got it!” He said, when I was rejected for a pay rise from minimum wage to something more realistic. \n\nI’ve been gone from there for 5 years, their website domain expires next Thursday.",
            "At one of my old job during a meeting, my manager called me garbage and stupid for continuing to chase my dream of being a designer in front of others. And that I should give up on my dream and go back to being full time at the company (I was full time, quit to take classes, came back as a part timer while I searched for a job and work on my portfolio for about 2 years). Couple months later, I got a contract job as a designer at a well known pharmaceutical company. Luckily, I landed the job about a month before the pandemic hit hard and everyone was told to work from home. At the old job, I wouldn't have been able to work from home, I worked in the field, traveling around my big city to visit client's sites.",
            "I'm doing this right now.\n\n2 weeks ago I got a job offer with another company\n\nlast week I had a \"performance review\" meeting with my boss, and I told him I need a raise and an increase in benifits, as I'm seeing other companies start off with better pay, vacation, and healthcare than I'm making now after 7 years here. I basically told him \"hey, I got one foot out the door, what are you going to do about it?\" \n\nHe gave me a small raise, but thats it, told me how I need to bring my skills to the next level if I want anything more, and maybe after 10 years I could get more vacation time, but would have to think on that. ( the people who have been here 10+ years don't get any more vacation than I have now )\n\nMonday I'm handing in my two weeks notice. I'll be making 11k more, hybrid schedule, a 10-15min commute,  8 more vacation days per year, no more having to work unpaid overtime, and amazing healthcare plan the company pays for 100%.\n\nI can't wait to see his face when I hand it in, as I also run all the networking and technical side of our office in addition to my normal duties, and this place is fucked. ( also can't wait until they fuck up our systems, as the only backup system we have for ALL our data is stored on my personal server at home, because the boss is too cheap to pay for anything, and I did it myself and has saved the companies ass several times )",
            "[deleted]",
            "Once he started begging you to stay, you should have responded with \n\n\"If you can't rely on yourself to keep people from quitting on you instead of helping them out, then I just don't know if you have much of a future with this company. I think you need to take a long hard look at yourself and gain some perspective\"",
            "I once told my HR I was fed up and worn out, ready to bail.\n\nShe said \"Well, STEVE found a solution to the problem, didn't he?\"\n\nSteve quit. I think she was trying to make a threat that I could just not have a job.\n\nSo I found a new job, much more money, happier life.\n\nWhen I told the MD, he was livid, so I just pointed to the HR manager and thanked her.\n\n\"I asked Susie what I should do, and she recommended I try not working here, so I followed her advice, and I'm really happy with the outcome! Thanks for the recommendation, Susie! Couldn't have done this without you!\"\n\nAnd off I jolly well fucked.",
            "People don't quit jobs, they quit lousy managers...",
            "Lmao, awesome OP.   My father did the same thing.  He asked his boss for the help he had been promised and his boss told him to take the weekend to think about his role with the company.  My father grabbed a bankers box, filled up his personal effects, and walked out.   For context,  my father had worked at or owned the company for 48 years and was 68 when this happened.  He didnt need the money but they SURE needed his expertise lol.",
            "[deleted]",
            "Boss tried to pull one on me yesterday. It's been said, and known, in many discussions with the bosses and plant mamager that you have to give 24 hours notice of overtime. You can't just wait until we're already at work for the day and be like \"well the other department is swamped so we're gonna need you to go over there and work a 15 hour shift.\" Nope, can't do that. You didn't give me enough time to make arrangements for someone to pick up my kid from school. The boss threatened to write me up and void my perfect attendance for leaving early, which would result in me losing my 500 dollar bonus. I said good luck with that and left on time anyway. Came in the next day and got called into HR. They made him apologize and assured me that I will still be getting my attendance bonus. They've tried to pull this multiple times. It always ends the same way. You'd think they'd learn by now they can't just scare us into letting them take advantage of us. Nope, they still try it. They'll never fire them though. At least HR is on our side for the most part.",
            "The goddess of perspective should not be summoned in vain.",
            "Never fails to amaze me that the shittiest managers of the shittiest jobs are the ones who most act like you should be treating that job like a gift",
            "\"I'm not sure about your future at this company.\" Oh, what a coincidence. I'm not sure about my future at this company either.",
            "This is the MC I FEAST on. All power to you. I’d love to have seen him beg. I want it made into a dramatisation!",
            "I have a personal rule, \"Never accept a counter-offer\". \n\nFrom the old employer's perspective, that counter-offer is pre-paying 3 to 5 years of raises. Which means you're not going to get another dime out of them for a very long time.\n\nFrom the new employer's perspective, your starting salary is just a start to test you out. Once they see how good you are, you can usually expect a raise to what they can actually afford.",
            "Two things to keep employees \n\n1. Don’t be a dick. \n2. See rule 1.",
            "I had a boss one time tell me life is too short to stay in a job I hate. When I resigned, I told him, \"I'm taking his advice and putting in my notice.\" His face was priceless. Good for you!",
            "I'm two years into the best job I've ever had that I found after my shitty manager said that I have to be able to work with everyone or get demoted because I didn't want to work with someone that called me a homophobic slur and got physically aggressive towards me 😎 I've been checking in on her LinkedIn, and she's gone from store manager to associate manager at a different company and I know it's petty, but I love to see it.",
            "I have left a company every time this speech has been given to me. My personality does not take well to condescending paternal behavior by management.",
            "My mother had a cancer scare (she is fine now). But in the moment I told my boss, who'd I'd been doing about 10 70 hour weeks in a row for, he told me to take my laptop with me to her hospital room.\n\nI took his engineering dept with me when I left. Fuck you Bob.",
            "I was in a position like this and was complaining to my boss about having to pick up the slack for coworkers who were leaving mid shift. They weren't firing anyone because they needed help. I was always forced into their extra work. I told my boss how messed up it was this guy was knowing selling drugs out of our store then would leave after he made enough money for the day. My boss said I needed to focus on me and if I kept complaining then he'd make it 3 people leaving at the end of the week. \n\nHe said \"there's two people leaving at the end of the week would you like to be the third?\" I hung up on him and gave the camera the one finger salute and walked out. I had 2 days off after that call and never went back and he told everyone he fired me. Ook dude.",
            "A lot of the people that tell you to gain perspective are the ones that are completely devoid of it.",
            "I love hearing the ones where multiple people are needed to the job one person used to do,happened with me,my work was divided three ways,lol!",
            "I can see clearly now, the pain is gone. I can say Old Bosstacles, go away!",
            "He was also right that you didn't have much of a future with the company because you left.",
            "Just left an MSP myself, the owner wanted to step down from day to day operations, still collect a paycheck (not including profit cuts) for him and his wife, while giving me 10%, telling me I need to work more than 80 hours, and keep me at 90k, with no benefits \n\nNoped the fuck out. Got a big pay bump, benefits, and massively reduced workload. Last I heard, he needed three people to replace me, 1 already quit, 2 veteran employees are leaving, and they lost multiple clients.",
            "Dick let you go one week in because he assumed you'd start the new one a week later, and there's a one-week delay for claiming unemployment insurance.",
            ">I think you need to take a long hard look at yourself and gain some perspective\".\n\nOkay\n\n*Surprised Pikachu face*",
            "If your company has a “market” 3 HOURS AWAY then you better have a presence there. Like an office or someone working remotely that lives there. 3 hours is a small road trip, not a commute.",
            "Your boss let you go a week into your notice because he doesn’t want you to let others at work know that there’s better opportunity out there. You seemed too happy with your decision to leave and if others see that, he may have a hard time keeping them under his thumb and belittling them. Part of that is making the employee feel as though they “have nowhere else to go” and if you let the cat out of the bag in that one, he’ll have no recourse to talk down to others without any more quitting!\n\nYou dodged a bullet, my friend!",
            "It's always gratifying, and sad as well, to see how many people it takes to replace you once you leave a company.  The sad part is that seeing the number of bodies to try and cover your spot proves that you were being undervalued and the paycheck probably reflected that.  Still gratifying to see the lose those same bodies and continue to scramble though.  Good luck with this continued perspective that has panned out wonderfully for you.",
            "Exact same kinda thing happened to me at one of my old jobs\n\nI was a nightfill manager for a supermarket working 3pm to midnight most of the time later with a bunch of kids in a small store (so there was no competition for hours)\n\nMy direct manager was lazy as all fuck and did nothing but sit in his office all day (he would regularly get his parents to work for free in the various areas over him doing it)\n\nThe hours were all fucked and he never took a single look at it and went \"yea somethings wrong you need more people\" Dude couldn't do basic fucking maths and would say that 14 + 3 = 21 (he understaffed and counted the hours wrong and when I pointed it out pointed at the numbers and just counted to 21 with whatever was there even if it obviously didn't end up to 21)\n\n\nWhenever the budget was fucked because he was getting his friends in to do extra hours where they would just fuck around he would blame me for it even though I had zero control over the hours and I would get in trouble from the store manager over and over again.\n\nThey also kept comparing me to the guy before me who left to go nightfill manage a bigger store because he was such a huge success here (the hours required were lighter by about 30%, the lazy boss would help him since they were friends and the amount of product required to process each night was about 1/3rd less, they also never acknowledged this despite them making these changes)\n\nI ended up taking a pay cut and leaving to a day job and last I heard they got my immediate report to do my job (amazing guy, he messaged me about a month after I quit and asked me to be a reference to a job in an industry he had a interest in, put so much God damn sugar on his resume it would make you diabetic, he messaged me a few days later telling me he got the job) \n\nThen they got one of the managers friends to do the job and he quit within a month, then they brought back the golden boy WITH dedicated help and he quit within a month, my main go-to reliable coworker ended up quitting soon after I left aswell.\n\nI left right at the very start of the covid lock downs here, saw the writing on the wall and went NOPE",
            "My boss was either very smart, really stupid or just didn't care for workers. I settled on didn't care and did my best to be a professional and support him. Received my annual review standing in his office with a comment of sign here. No give or take, recommendations for improvement or where he wanted the shop to go. Previous marks had all been to the far right. But he marked everything in the middle so he would not have to write anything on the eval!\n\nI had enough time that I decided I was retiring and put in my notice. Somebody in another department I supported was concerned and asked what would I need to stay. New supervisor, cash bonus and new equipment.\n\nThe first conversation with my new boss was what do you need to be successful, because we value you and your talents! Just got another bonus 6 months later. If you boss sucks, walk! There are plenty of jobs in both skilled and unskilled labor!",
            "I’m surprised people will put up with this shit for years. If my boss/coworkers treated me like that I’d be gone within a few months. Fuck that",
            "Just remember, cool guys don't look back at explosions.",
            "I think some people enjoy running mini-fiefdoms. But then the internet happened and people realized they can do other things. They can move companies, they can stand-up for themselves. So lots of SMBs with king leaders (and some queens) are having a hard time coping with the changes in culture.",
            "\"Have some sense of proportion!\" she would say, sometimes as often as thirty-eight times in a single day. \n\nAnd so he built the Total Perspective Vortex - just to show her. \n\nAnd into one end he plugged the whole of reality as extrapolated from a single piece of fairy cake, and into the other end he plugged his wife: so that when he turned it on she saw in one instant the whole infinity of creation and herself in relation to it. \n\nTo Trin Tragula's horror, the shock completely annihilated her brain; but to his satisfaction he realised that he had proved conclusively that if life is going to exist in a Universe of this size, then the one thing it cannot afford to have is a sense of proportion.",
            "Had a similar situation happen at the job I was working right before I had my daughter. Awful, toxic work environment completely as a result of the owner and general manager. After multiple rejected requests for them to work with me while going through complications with my pregnancy ( I wasn’t asking for time off or lesser responsibilities, but merely to be scheduled in a less physically strenuous spot during my third trimester that was still part of my job area), manger told me ‘I needed to reevaluate myself’. So I did. Put in my two weeks notice three weeks later and had my baby girl 24 hours after my last shift. Started my new (much better) job after taking some time for maternity leave and never looked back!",
            "I recently did that, except it wasn't as malicious.\n\nI wasn't performing well at my company, I admit it. I am a developer and wasn't developing for a long time. Around april we did a follow-up meeting where I thought I'd get one last warning before I could get fired. My boss was supportive giving me tips to manage my time and effort - but he did a mistake:\n\nTo motivate me he told me I was the best coder in the IT department and I should take that as an advantage. Thing is, I am the 3rd youngest in the company, with 3 YoE and while I understand why he said that, in my head all I thought was \"I have peaked and I won't progress here, if I stay I will stagnate\". On top of that, there were newer recruits who a) were progressing faster and b) were more myopic regarding their professional ambitions.\n\nSo a few weeks later, found a promising offer and amicably resigned, and left in good terms. Today is my 4th day there, I already coded more in a few days than in my old company for the last 6 months, and so far the environment is quite good.",
            "\\*chef's kiss\\* perfection!",
            "Two weeks and found a new job already?! Shesh. I'm at 6 months and applying everyday everywhere",
            "Tell him that a disinterested party (me; I have zero interest in knowing about him beyond this lesson) says what .any people say here at reddit: people don't quit lousy jobs. No, they quit lousy managers.\n\nA lousy job can be improved; a lousy manager simply cannot be improved upon.",
            "When i asked for a raise my boss said i was living outside of my means; \n\n1 week , 10k more, 1/4 of the responsiblitities\n\nBiggest regret was not leacint 3 yrs earlier",
            "Kinda like my boss use to be when he'd push for fixing the problem no matter how long it took. Some days were 10-12 hours. I finally told him I wasn't gonna do it anymore and that I was salary so I didn't get paid overtime. \n\nHe immediately chimes in \"you may not get overtime but we still bill the client for those hours, so you have to work as long as possible\"",
            "Great perspective!  Thanks for sharing it and nicely played on your part",
            "He effed around and found out",
            "I think it was 4 months before they found a person to accept the position I left. \n\nIt can be scary quitting and faced with a no win situation but sometimes all you can do is leave and pursue a position more to your advantage.",
            ":shocked Pikachu face: -  *perspectived* boss",
            "I had a boss that gaslit me into thinking they were looking to replace me. I was running a satellite office completely by myself. Like I was the only employee there until 4 pm everyday then I stayed to close as well. I left and they had to hire 3 people to replace me. In my exit interview I let them know exactly what my boss said to me about my job. (I saw an add in the paper for my job and asked her if I should be worried and she said “everyone should be worried”). Turns out they knew I hate working the satellite office and we’re trying to hire someone else so I could be in the main office with more support. Good for you for leaving.",
            "This happened to me when I made the jump from helldesk to sysadmin work. I put in my notice, a manager who I didn't even report to took me aside and told me that I was wasting opportunity at their company. Yeah, I wasn't. I hit the ceiling. I'm now making over 3x as much as I did at that job, working in DevOps. Honestly, no manager I've ever had has given me anything I would consider useful advice.",
            "Fucking golden!!!  CONGRATULATIONS!!!🎈🎉🎊🍾",
            "guess nobody wants to work anymore",
            "The more they need you, the more they act like you need them.",
            "Man, you IT people and your quick interview process.\n\nGreat job, though. Glad you're happy.",
            "Send him a postcard asking if he's gained any perspective yet.",
            "Don't you love the whip-sawing such jerks engage in?  \n\n\nYou need to look at yourself and gain some perspective, or else there's not much future here for you.  \n\n\nNext (after turning in resignation) Please stay!  I'll give you more money! I'll give you other things!    \n\n\nNext:  (halfway thru 2 week notice period) Go!! Get out of here!  I hate you! Go away!!\n\n  \nGee, I think he needs to gain some perspective!",
            "I would have accepted his offer, gushing thanks and play it to the hilt. Then ditched the sonovabitch the next day",
            "A timely new Onion article:  https://www.theonion.com/ceo-s-company-wide-email-inspires-employees-to-start-lo-1850508575",
            "Good on you! Ppl need to realize they don't have to work for a shitty manager. So many good jobs out there!",
            "After ‘checking’ with their own boss, a newly appointed mid level college admin refused to allow me to come in 2 hours early & leave 2 hours early, 2 days a week so I could take classes, which would not have interfered with my productivity. I said, “Ok, I’ll make other plans.” A month later, I made certain both were in the same office when I gave my 2 weeks notice. Mid-level’s head spun toward me as I heard these words, “Oh, is that what meant by other plans?” Even though I wasn’t an instructor, out of respect for students, I worked very hard those weeks, while continuing to decline offers to continue there part time, in addition my new job. My replacement didn’t start until after I left but was someone I’d known so I did keep communications open to help that person, which allowed me to enjoy the chaos that backfired, as mid-level was let go about 6 months later. Fun aside: an upper level admin looking to get out of academia was told, during an interview, that because they ‘worked at a college,’ they wouldn’t be prepared for corporate politics - we all had a good laugh over that (US)",
            "I work in software and have been with the same company for 11 years. Two years ago, I was offered a “promotion” on a different team. I wasn’t crazy about the manager to put it lightly but decided the job title would look good on my resume regardless. In the 18 months I worked for him, he chewed through 30 people on a 20-person team. That’s Walmart magnitude turnover on a team where the lowest paid junior developers are paid over 50K. When my old boss offered me my old job back, I jumped at it to say the least. I don’t think I’ve seen half that many people leave my old team in the last 11 years.",
            "Maybe I spend too much time on r/antiwork but the thing that stood out most to me is that he fired you without cause.",
            "This reminds me of the time I spent as Technical Support Manager for a regional ISP. I started when Windows 95 was brand new, and 56k modems were still in the future. Cut to 5 years along, and we've been sold to a larger company that has ISPs in multiple markets in multiple states.\r  \n\r  \nThe new owners were all from the cable TV industry and used to bullying people with impunity. Basically, \"If you want to work in this industry, in this zip code, or any zip code that touches this zip code, you better toe the line! We will fire you immediately if you don't take enough shit fast enough!\"\r  \n\r  \nThe problem they had with us was that we lived in a smaller market, and there wasn't a single person in our crew who couldn't double or triple their income by moving to a slightly larger market. So our fear factor was non-existent. Nonetheless, they persisted in making sweeping, draconian dictates that we would push back on pretty hard. They usually refused to listen to our input, and we would comply with their wishes - to the letter - and wait for the fallout. In several cases, the fallout was such that they were forced to come back to us and reverse their orders.\r  \n\r  \nThe most egregious example was when they instructed us to stop accepting payments at our office and make the customers pay directly to them at corporate HQ. The problem with that is that we were in Southern Oregon, and HQ was in California. This may come as a surprise, but there is a certain amount of animosity towards Californians in our area, mostly because they move to our beautiful area and push the property prices through the roof and then spend all their time bitching about how much better it was in California. While we never made a secret that our new corporate overlords were Californians, this \"shoving it in their faces\" was going to go poorly. We tried to explain it to them - we were going to lose customers - but they insisted, so we complied. \r  \n\r  \nWe put a sign at the front desk with the name and mailing address of the HQ and stopped taking cash payments from walk-ins (about a third of our customers dropped their payments off in person while they were in town), and those that paid by credit card had to call HQ to make their payments.\r  \nWe lost nearly a third of our customers in two weeks! They reversed their dictate, we regained 80% of those that had left within the following two weeks, and the corporate officers started asking our opinion about customer-facing issues.\r  \n\r  \nThey sucked every second they were there.  They finally went bust and sold us off to a local group. I got laid off as a “salary cap casualty” (my salary was more attractive as a part of theirs).  C’est la vie!",
            "It’s probably long over with but just so you know being let go in the middle of your notice is a big no-no in some places and your employer likely owes you the pay for that week he cut you off from.",
            "Excellent, love a story like this. Glad you’ve find a great role",
            "Employers rarely care about you. Good for you.",
            "Sounds like my current position...including going to find a new job.  Nice",
            "The ego of a boss is always an amazing thing. \nThey truly think that ppl forget they have autonomy.",
            "As a former sys admin myself I adore this story so so much, in ways only other sys admins can know",
            "/\\* Happy dance for the OP \\*/",
            "What did boss man think was gonna happen talking to people like that?? 🤷‍♀️\n\nEnjoy your new job sir. No one should tolerate that level of disrespect.",
            "Good on you, OP!  Glad you took the new job and didnt stay.  Staying almost always turns into a bad idea.",
            "Great post OP!!!",
            "Boss learned a valuable lesson, sometimes the grass is definitely greener on the other side/new job.  Well at least boss should have learned one",
            "Is there a bug or why are there 51 comments and no upvotes  shown? I do like your story",
            "HAHAHA served himself some humble pie",
            "Your ex-boss sounds like the principal from The Breakfast Club.  Glad you gave him a comeuppance.",
            "The best Revenge is to move on live well, enjoy life & let him stew in his own S@#T !",
            ">Maybe he needs to gain some perspective on how to run a company and treat people?\n\nyou mean he needs to \"\\[take\\] a long hard look at \\[him\\]self\" ?\n\n \\* SM58 mic drop ;)",
            "Bosses hate that one simple trick",
            "Man as a “boss” I read stuff like this and just wonder what were the “good old days” like when you could hire a skilled employee and be perfectly fine abusing them because to you they were a dime a dozen.\n\nI hate training people, and not me doing the training, anyone doing it because there will be mistakes and you have to accept that, it can take months to get people up to speed. So even if you are lacking I am willing to work with people because starting over from zero is painful.",
            "> Maybe he needs to gain some perspective on how to run a company and treat people?\n\nSend him an hour-long vid lecturing him on perspectives. lol",
            "A story that can be told by some people in IT positions in medium/big business around my province. Generally crap jobs, low pay and very choosy with people search (for work).",
            "Please email this link to him. He needs to read that last line! Bravo!!",
            "There are a lot of bad bosses in this world who think that that type of talk sets employees' minds right, rather than having the more common results of an employee either being insulted and/or leaving.  For me, it was that I should think about whether or not I really wanted to work there. Spoiler alert: I did not.",
            "Was it a MSP, because this feels like MSP behavior.",
            "About 5 1/2 years ago they outsourced the helpdesk at my old job so I had to find a new one.  Eventually (3 months) I did find a new one and was still keeping an eye on the job listings.  Half a dozen places I'd been rejected from re-listed the same jobs within 3 months after my rejection.  Guess the chose poorly when picking someone.",
            "At that point I would have given him a stupid counter offer to keep me. Triple my current salary, comprehensive benefits, and buy me a house but enough for me to start a family near the other city. Fully in my name of course.",
            "This has to be a fantasy, this is too satisfying to be real lol",
            "As an IT guy \"and no stress\" rings a little hollow.   Give the new job a couple months and we'll see, ok?",
            "were you tired of making paragraphs as well?",
            "Yeah, been there... boss was bi-polar and changed his meds 6mos into my new job.. OMG..  every little thing.. why were you late 1 mins.. well I... (fill in the blank) .. response.. You should've taken that issue into account before leaving and left earlier..    \n\n\nThere was a pizza going away party for one guy who was just moving on and another who was retiring.  Little did he know that I was leaving two days later.  I reimaged my laptop, got it on Windows 10, deleted all my content (let him go to MS to get it back) deleted all the trash and recovery files etc..  cannot recover stuff off a HDD when the OS has been changed...  \n\n\nF\\*\\*k him.. the place I went to was GREAT, but I was let go because of Covid (nothing personal or bad, just too many people to support too few)..  anyway, found a great job after Covid and never looked back.  The company he works for has downsized, lost its BIG head quarters, staff leaving like a sinking boat.",
            "lets tee pee his house",
            "I love a happy ending!",
            "I had a boss give us all \"Who Moved My Cheese\". I read it and moved my ass out to find better cheese...",
            ">He let me go a week into my notice.\n\nHopefully you still got paid for your final week that he didn't let you finish.",
            "That’s awesome!",
            "This tastes so sweet.",
            "I love it. The headline says it all.",
            "After being at a very toxic work environment for 2 years, I’ve learned that no job will be worth my nerves… disrespectful management / coworkers ? Talking down to me or others? Micromanaging?\n\nI don’t care what my situation is, I’m immediately planning my way out. Spending a peaceful day and work and coming home with my nerves still intact is worth way more than a few $€¥ an hour I might be losing.",
            "Feck yes! Excellent 👍🏼 !",
            "Vindication right here",
            "The title made me smile well done.",
            "I hope his company crumbles and he loses everything. He really treated you like a scum, whe in fact he is the scum !",
            "[deleted]"
        ]
    },
    {
        "post_id": "oq4ek9",
        "author": "knightskater97",
        "title": "So I wore the \"wrong\" type of underwear in the pool",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oq4ek9/so_i_wore_the_wrong_type_of_underwear_in_the_pool/",
        "score": 25604,
        "num_comments": 1413,
        "created_utc": 1627053115.0,
        "selftext": "I (24M) hosted a friend from college (also 24M) that I haven't seen since before the pandemic. Shortly after he arrives we head to a local bar and grill in our neighborhood. We decided to do the 15-20 minute walk instead of drive so we didn't have to worry about leaving the car. I was joined by my roommate (25M and also a good friend) and his new(ish) girlfriend (22F), who I don't know that well but I have always had friendly encounters with when we have hung out.\n\nAt the bar drinks flowed freely and my friend seemed to really hit it off with our crew. We stayed longer than expected and it was fully dark and we were well buzzed by the time we decided to walk home. It was still hot outside when we got to the apartment complex so my roommate suggested that we hit the community pool. The pool and hot tub were technically closed for the night but it isn't too close to any of the units and generally no one cares if you are responsible and don't break glass bottles or anything like that. After debating whether to head back to our place to change first my roommate insisted that \"we're all friends here\" and that we could all just go in the pool in our underwear. Everyone agreed on this although my roommate's girlfriend announced \"you guys have fun with that\" and proceeded to lounge next to the pool on one of the deck chairs and scroll Instagram.\n\nWe strip down and hop in the pool and are having a pretty good time just messing around. After some time had passed my roommate was chatting with his girlfriend and then quietly approached me afterwards. Apparently his girlfriend was very uncomfortable with me wearing just briefs in the pool (both my roommate and my friend were wearing boxer briefs) and she wanted me to go all the way back to the apartment and change into a swimsuit. I initially protested and said it was his idea in the first place and how everyone was in their underwear (and none of us cared) and what's the difference, it's not like my underwear was white/see through or anything like that. My roommate asked me to go change for him as a favor so that it didn't \"turn into an issue\" between him and her. I was pissed but decided to let it go for the time being.\n\nWhen I got back to the apartment an idea popped into my head when it occurred to me that I still had a swimsuit from when I used to swim on the club team in college, so I put on my speedo and head back out armed with another 6 pack for the boys in only a t-shirt, towel wrapped around my waste, and flip flops. I get back to the pool, announced I had changed into my swimsuit (as requested!), drop the towel and ditch the T, and launch into a wicked cannonball into the pool. I can see a wry smile on my roommate's face but nothing else was said about my choice of attire. We go on in the pool and a few minutes later she announces that she's tired and is going to bed. We stay out late including more beers and laughs in the hot tub while the girlfriend was asleep at our place.",
        "permalink": "/r/MaliciousCompliance/comments/oq4ek9/so_i_wore_the_wrong_type_of_underwear_in_the_pool/",
        "comments": [
            "My favorite part is your roommate appreciated the compliance",
            "When I read the title I thought it would go differently (as in ‘you don’t like what I’m wearing, then I just go without my underwear), but this was a better outcome! Nicely done!",
            "I'm confused as to why briefs are worse than boxer briefs. They are just shorter in the legs. That's like the only difference. Unless they were like two sizes too small or something it wouldn't have made a difference.",
            "\"...not like my underwear was white/see through or anything like that. \"  \nHm... reminds me that my father could have one-upped the akwardness for her... he owned a white speedo that would turn see-through as soon as it touched water...     \nMany family holidays I amanged to suppress the memory, only for them, and the speedo, to reappear at the next one...",
            "Lmfaoo roommate couldn’t say nothing so he just “:)” and prob internally goes *that’s my boy*",
            "[Undies Togs Ad from NZ](https://youtu.be/xW4qptCre8M) seems appropriate for this MC  (link goes to YouTube)",
            "Had images of a guy in a ladies swimsuit then until I saw *speedos*.",
            ">Apparently his girlfriend was very uncomfortable with me wearing just briefs in the pool and she wanted me to go all the way back to the apartment and change into a swimsuit.\n\nAs soon as I read this I thought, 'I would have gone and changed into my American flag speedo.' Glad to see we think similarly.",
            "[deleted]",
            ">towel wrapped around my waste\n\nAny port in a storm I guess, but I’d have used toilet paper.",
            "I can understand requesting that certain fabrics not being used in the pool (if they are the ones in charge of maintaining the pool and paying for maintenance), but she clearly didn't single out the fabric, just the choice in attire.\n\nHilariously, you chose an actual swimsuit that covered probably less of you.",
            "Hey, hey, my eyes are up here lady, don’t be a perv",
            "As a female myself I don’t get what made her uncomfortable. Unless of course she was secretly attracted to OP and couldn’t help looking at him is his briefs. She got up and left when he put a Speedo on because that was just to much. Of course this is all opinion. Having 90% male friends and having seen most of them at one point in time in their undies only one or two made me uncomfortable and was 100% because I was attracted to them.",
            "Girl like that just wants to see if she can control a situation she has nothing to do with.",
            "I (F42) had my five kids (M13, M12, F10, F8, F7) in the pool at a hotel once. We had the whole place to ourselves. Eventually the six of us were soaking in the hot tub. Some random dude comes in, towel around his waist. 40ish, clean cut, waves and says hello. Me and the kids wave awkwardly, but politely, as Canadians are supposed to.  Next thing, he drops the towel and heads straight for the hot tub with us.  Wearing nothing but a pair of Superman briefs, blue and yellow with a big S on the front. (I didn’t have to stare - the image burned directly into my brain.) Nobody waited to be told to move. My kids noped outta there like there was candy and video games waiting for them upstairs.  _This_ is an example of wearing the wrong underwear into a pool.\n\nEDIT to add: His underwear were briefs, quite worn, and somewhat see thru - I guess he had showered on the way in. \n\nIt just felt awkward at the time. And explaining to five kids exactly what the most polite and appropriate response would have been, in the moment, would have embarrassed somebody, I’m sure. Probably the man.",
            "Unless she was actively looking at op in water, how could she tell what he was wearing? Also, I think we need photographic proof. You know, for science and stuff. 😏",
            "Power Move - love it……budgie smugglers are appropriate pool attire for sure",
            "Did you grow your beard out while you were changing so you didn’t cause your buddy to have impure thoughts?",
            "Am female, kinda confused. What’s the difference between briefs and boxer briefs? I googled it and the boxer briefs cover like 2 more inches of skin than briefs? Was she scared of your thighs?",
            "Love when dudes literally beg other men to do something so their own gf won't make it into an issue. Sorry, bro. Don't stick your dick in stupidity.",
            ">towel wrapped around my waste\n\n*waist",
            "I don’t see how briefs are all that much different than boxer briefs.  What’s it show 2 more inches of thigh?  She sounds like a buzzkill.",
            "I was really hoping you were going to say you happened to have a Borat style mankini left over from Halloween one year. Speedo definitely works though.",
            "If you're going in the water drunk and after hours then you go either naked or fully clothed. All in-between states are pathetic.\nAlso pathetic would have been the sight of my shriveled up and hibernating old chap after skinny dipping off Brighton beach on a winters night, but I'm a man of principle.",
            "When I was on my condo committee, I discovered one of the key reasons we want proper attire i.e. swimming clothes is that cotton messes up the filters and you have to spend more on cleaning the pool.  Skinny dipping is preferable to normal underwear as far as your pool maintenance costs are concerned.",
            "Plot twist. GF noticed her fella checking you out and got jealous. That's what his wry smile was all about upon your return",
            "It made her uncomfortable because OPs briefs revealed that his package was bigger than her boyfriends.",
            "What a bitch... if she’s uncomfortable it’s because she’s staring.\n\nWhere’s the motto “my body my rules I wear whatever I want” now?",
            "Or she could have, ya know, KEPT HER EYES TO HERSELF.\n\nImagine if the genders were reversed-- if her & her girlfriends decided to hot tub in THEIR underwear & one of their boyfriend's got weird about her underwear-- they'd probably be tearing him a new one about not being a perv & \"just don't look!\"\n\nLike... c'mon.",
            "Has she never heard of looking the other way?  Closing her eyes?  Or,she could leave.  Why was she even looking?",
            "Your friend’s gf has some serious issues and is a complete piece of shit lol. Women wear way more skimpier clothing, and imagine the outrage had it been a man telling a woman to change out of her bikini because it makes him uncomfortable.",
            "Sounds like your roommate found himself a real winner there /s",
            "I suspect their relationship will not last if she's singling out certain people",
            "This reads like\n\n\"Hey,you're my bf's roommate,so I control you as much as I control him\"",
            ">towel wrapped around my waste\n\nYou pooped in your towel? Dirty boy.",
            "WOW. This is absolutely the definition of this sub and if I had award money I'd send you one. Love this story!",
            "I don't know.. we might have to see some pictures of you in the underwear and the speedo to really decide...",
            "What color was your Speedo?   A lot of people need to know that.",
            "Don’t tell us what to wear, teach the girls not to stare.",
            "Bros before hos",
            "As a European, this story slightly confuses me 😄 I mean, who complains about bathing attire? Just weird.",
            "The friend needs to tell the girlfriend: “Learn to live with disappointment.”",
            "NTA... Wait, wrong sub.",
            "Soggy boxer briefs sound so uncomfortable! The speedo is likely made of material less likely to make your crotch feel like less of a boggy swamp. Good on you.",
            "I see nothing wrong here, move along.",
            "People are so judgey about briefs.",
            "I honestly thought I was on a TIFU post. Wasn't until the end i realized this was the MC thread.",
            "Curious to why she singled you out from the others.\nI think I need a photo of you in your pants and your friends so I can see why she decided you cannot be wearing only pants in a pool even though ya mates wearing same can.",
            "Wow. Some people have a lot of nerve. And yay speedos!",
            "I'm mostly baffled by someone considering taking the car for a 15-20 min walk. Especially if you plan to drink some beers",
            "Lord heavens no not a male wearing a skimpy bathing suit! What would happen if a female wear to also wear a skimpy bathing suit?!",
            "I can't imagine how it would go if a man told a woman that they were uncomfortable with their choice of clothes....",
            "It was the hole in the front that was the problem I’m pretty sure.",
            "The ol banana hammock switcheroo. Classic.",
            "This is the part where we're supposed to teach women not to stare instead of shaming the victim for what they're wearing, right?",
            "Lol. I thought it was in reference to the mormon garments. Lol",
            "Shouldn't the roommate get mad at the girlfriend?",
            "Roommate’s gf was struck by your confusingly large penis, and lashed out in her confusion! Your compliance was both malicious and perfect. Bravo!",
            "Why on earth there are so many comments saying… “op might have been showing a little too much”, “she might have feel uncomfortable”.\nBikinis are extraordinarily small and revealing and no one is saying this things to women.\nWe shouldn’t put the responsibility of the situation into OP. If there was something wrong going on the decent thing is to say it, tactfully. If not, and you still feel uncomfortable you look the other way and scroll Instagram. End of story.",
            "Sounds like you might have a bigger package than the bf and she's jealous and didn't want to see it.",
            "I was at a pool somewhere in Poland and they would not let you swim unless you were in a speedo.",
            "I thought this was on r/tifu and I kept waiting for something terrible to happen",
            "Nobody wants to see your banana hammock.",
            "You wear underwear?",
            "I wish my apartment had a pool and a hot tub.",
            "“We’re all friends there’s no need for trunks” \n\nLonely island - no homo",
            "Did she have trouble averting her gaze? B.d.e.",
            "Going swimming in the pool drunk is reckless; we’d had so many drownings in my country this week, you don’t fuck around with water safety.",
            "What's a brief?",
            "You weren’t wearing see through underwear, and it sounds like this was night time. Its not like theres that much difference between boxers and briefs, especially when wet. It sounds like she would have had to go out of her way to be looking at your groin enough to be bothered. Something else has to be going on here.",
            "I would have shut that down instantly with  \"Hey Becca (I'm 99% certain she was a Becca), my eyes are up here\"",
            "Kinda disgusting getting into a pool in your dirty underwear.",
            "Damn, what a prude.  She needs to chill the fuck out.",
            "Your friend is totally cool. Also, he probably got some good warning vibes off his girlfriend. Stock up on beers. He might be throwing Ms. Uptight back to the sea soon. Trust me, better than a lifetime of that shit.",
            "Love this, you’re a cool guy!",
            "at least you wore underwear! we usually ditch that when we go drunk swimming",
            "Chick seems like a stupid bitch to me.",
            "In Finland that could have been naked swimming.😆",
            "Oh you're uncomfortable? We'll the gate out of the pool is over there, have a good one!",
            "Next time just loudly ask her to stop looking at your genitals. Shit goes both ways y'all.",
            "This girl clearly has the hots for OP's massive schlong. Too hot and bothered when the speedo came out so she had to go \"deal\" with it in her own way",
            "I guess she just wasn't that into you.",
            "That'll teach her to objectify your schlong!",
            "I thought this was TIFU and was waiting for a very different ending.",
            "I would just like to point out that it's bad for the pool itself to wear most cotton clothing in a chlorinated pool. The chemicals in the water cause the cotton to shed quickly which fouls up the filters and re-circulation pipes.",
            "What a princess, the type of person who calls radio stations to complain instead of changing the dial \n\nYour boy is dating a junior Karen",
            "You handled this in the exact same manner as I would.\n\nWomen say this is the difference between a bikini and underwear. Even though they cover the exact same amount of skin, the swimwear is a woman choosing to be looked at rather than feeling exposed in underwear.\n\nThe fact this swimwear exposes your bulge is a side effect of the swimwear and perfectly acceptable.",
            "Why is she terrified/angry about potentially seeing a human body? If she's a full blown invalid, can't she just take her whiny ass back inside, or maybe just keep her stupid eyes on her phone? \nI work not have had the same playful, considerate approach as you.",
            "It’s probably dark, or getting there, so why the hell was his ol’ lady checking you out so hard that she could see the type of undergarments you wore?"
        ]
    },
    {
        "post_id": "maagdy",
        "author": "Fickle_Midnight5907",
        "title": "Lady DEMANDS that i stop what i’m doing and open my register. Okay, no problem!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/maagdy/lady_demands_that_i_stop_what_im_doing_and_open/",
        "score": 25416,
        "num_comments": 584,
        "created_utc": 1616373294.0,
        "selftext": "I (M19) work as a cashier in a gas station in Miami Gardens, Florida. Naturally, the people that come into the store tend to be on the crazier side. \n\nThe store had a line of maybe 7 people. Now, at this point, i had the “register closed” sign up and i was stocking the vaporizers and accessories on the shelves behind the counter. \n\nMy coworker was handling the customers in line. I turn when i hear the door opening. Another lady walks in without a mask on. I politely ask, “Excuse me, miss, do you have a mask that you could put on?” She scoffed at me and rolled her eyes as she dug in her purse for a minute or two. Finally she pulls out a ratty little mask with only one functional strap and holds it to her face while she’s waiting in the line. \n\nWell, apparently she couldn’t do that for very long. She comes to the front of the line ranting and raving about how the line is too long and that we shouldn’t be keeping a valued regular customer waiting. (I’ve been working here for 4 months and i’ve never seen her, i’m fairly confident i know all the regulars) I tell her that there are other things that my manager left for me to do before the end of closing and that i have to get them done. \n\nShe didn’t seem to like that all. “I DEMAND that you open your register RIGHT NOW” Okay, you got it, lady. I moved the sign and then i turned back to her. “Do me a favor and stand a little bit to your right” Surprisingly, she complied, albeit with her arms crossed and what i can only assume was an angry gaze firing through her mask.\n\nCue the malicious compliance.\n\n“Next customer” i yell out into the store. It dawns on her what i’m doing but the next customer shoots up in front of the counter before she can even fully process it. I go about this transaction as normal, despite the fact that this lady is yelling at me at the top of her lungs (no longer holding the mask to her face, mind you). \n\nI finish up with the other customer and I turn to her. She tries to yell over me so i raise my voice a bit and try to be as stern as possible. I tell her “Just because my register is open now, doesn’t entitle you to skip all the other people in this line who also have lives, and jobs and other responsibilities. Get to the back of the line, and be respectful or i have no choice but to have you removed from the store. (We don’t have security but we’re 2 blocks away from a police station and one of the cool ass officers who comes into the store gave me their personal number to use just in case we have any issues.)\n\nThe lady harrumphs loudly and walks dejectedly to the spot in the line she had before she left. In the amount of time it took for the rest of the story to occur, more people had gotten in the line. “I said the back of the line” i told her pointedly. She dropped her shoulders and walked to the back like a toddler. \n\nPeople, man.",
        "permalink": "/r/MaliciousCompliance/comments/maagdy/lady_demands_that_i_stop_what_im_doing_and_open/",
        "comments": [
            "Mate you handled that like a pro. Well done!",
            ">Just because my register is open now, doesn’t entitle you to skip all the other people in this line who also have lives, and jobs and other responsibilities. Get to the back of the line, and be respectful or i have no choice but to have you removed from the store.\n\nThis is the kind of dialogue I will never say out loud and be playing again and again in my head later at night",
            ">“Do me a favor and stand a little bit to your right”\n\nOh THIS is good.  My friend who works at a corporate gas station can't even comment on masking up ( more than one person  every. dang .shift--No Mask).  She tells me she can't even comment on line skippers either.  I make a point in calling it out, \"HEY, WHATCHA DOING.  LINE IS BACK HERE\",  when it occurs,  bc I know the staff can't.",
            "We have three registers where I work and the dumbest thing I see people do is wait at an empty register instead of queueing up behind people",
            "Haha love it",
            ">  “I said the back of the line” i told her pointedly. She dropped her shoulders and walked to the back like a toddler. \n\n\\*Chief kiss\\*  Bravissima!",
            "Count your drawer first to verify the count tally first....it is policy most to do anytime you close down and open up a drawer you are responsible for and haven't had eyes on it constantly.",
            "After you sent her to the back of the line, did you reclose your lane?",
            "Beautifully executed malicious compliance!",
            "You rock!  I’m never messing with you. Sincerely.",
            "Almost ... No Soup For You!\n\nBeautiful",
            "Unless she was wearing her mask properly, she shouldn't have gotten any service at all.",
            "One of the greatest stories I've ever read, posted on everything or everything2 around 2000.  \n\nThe hero is in the UK waiting in line for the bus after transferring from the metro. Spies a dude rushing over from the metro who cuts into the line ahead of hero. Hero calls him out, dude gets out, slinks back and cuts in line immediately behind hero.  \n\nSo hero turns around, leans out a little bit and offers the person who used to be behind him to go ahead of him. Person accepts. This moves hero and dude both back one place in line. Rinse lather repeat until they are the last two people in line.  \n\nDude flies into a fury and tries to assault the hero but the police were nearby and had been watching the situation develop; they intervened quickly and hauled the dude off to jail.",
            "Regardless of context or motive, angrily demanding “I DEMAND that you open your register RIGHT NOW” in a gas station that close to the police station with so many customers around is a **dumb** move.",
            "I was working a crappy job for about 3 months between school (college) ending and my date of departure for boot camp (March).\n\nAt first it was a great job, I was hired specifically for the holiday to do overnight restock, while the store was closed.\n\nNow, this was a big name toy store at the time and it's Christmas time.  I bust my ass from 2200 to 0700 for a couple of weeks, as I don't want to be the reason some kid didn't get his special present from Santa.\n\nApparently, my attitude and hard work was noticed and the overnight manager asked me to stay one morning to talk to the store manager. \n\nOkay, sure, no problem.  Tired and sweaty, I meet the the guy and he asks if I'd be willing to work for a few extra hours after store opening,  kind of like a tour guide,  as I know where everything is, as I just put it out.  He wanted to help the customers get in and out and on with the rest of their days.  \n\nSo I say, sure why not, pitch in, help out, everybody wins, Christmas spirit and all that.  Works great for 2 days.\n\nThen, for some reason, there is a slew of \"I quit\", about 3 days before the big day.  The video game cage, think of all video games and consoles being in a big fancy looking open faced shipping container.  Guess me talking about how I used to work at a video game store during the summers and holidays while in school was a resource they could not pass up, as most of the \"I quit\" crowd came from there.\n\nAgain, sure why not.  Took 1 hour and only 1 hour to figure out the reason.  Whatever the game system of the time was sold out and there were no more coming in.  PERIOD!  NO MORE!\n\nNow, there were signs on the front doors, all the registers and about 5 or 6 more on the \"Cage\", clearly stating this in big bold letters.  With the obligatory \"so sorry, inconvenience,  etc\".  The signs on the Cage had the addendum, that the boxes you see are marketing displays and are empty.\n\nThe screaming tantrums, demands to see the manager, \"don't lie to me, I see one right there\",  were outright insane.  I pointed out the signs, explained as best I could, (hey I've been here for less than a month and not privy to the inner machinations of the stores retail and supply process). \n\nBest I can tell them is, as part of the company's marketing agreement,  we were obligated to keep the displays up.  Again, I pointed out the signs that were all over the Cage saying these were empty display boxes.\n\nI stuck it out for 4 hours before going to the Manager and telling him, in no uncertain terms,  this is not what I signed on to do.  Keep in mind, I'm still doing the whole overnight restocking gig as well.\n\nHe loses his mind and just goes off.\n\nNow, I want to be perfectly clear here, none of this is directed at me.  I am just the seasonal hire who he felt he could express his frustrations too, as i' d be gone in another week or two, tops.  Looking back, I can see the reasoning,  not wanting to pass this kind of attitude and frustration onto the regular employees and have them start acting the way he REALLY WANTED TO, to everyone of the, \"I demand to see your manager\" scenarios. \n\nSo, I'm a nice guy, and try to be helpful and a team player, get the mission done, etc.  But, I can be a right evil and vicious bastard if it is needed. \n\nI ask him, if i could give these proto-Karens (This is the 1994/95 holiday season and there was no official naming convention for raging entitled bitches (REB) at this time), a way to see these folks put in there place and enjoy the hell out of it vicariously, would he put me back on overnight restocking only?  He could even yell at me and chew me out in front of the customers  and tell me i'd never work \"here\" again, making the them \"happy\", and not damage his customer base.  \n\nOf course he wanted to know what I was going to do on Christmas eve morning, but I told him it was my present to him and to trust me it was in no way illegal or dangerous.  After hemming and hawing,  he said okay. \n\nSo, I go home and get what I needed for the next day.  \n\nI come in, work the night restock,  the jump in the Cage when the doors open.  Only difference is, that today, I have a large stack of homemade business cards next to one of the out of stock signs that is next to the \"window\" of the Cage.\n\n30 seconds after the door opens, I hand out my first business card without saying a word.  The lady is speechless.  Before she can demand to see the manager,  another REB cuts in front of her and starts off on her spiel.  Another business card.  Another shocked silence.  \n\nThe manger sees a group of about 7 REBs standing in front of the Cage, and comes over.  He is clearly surprised that no one is howling for my blood to him yet.\n\nHis,  \"Excuse me, I'm the manager here, is there anything I can help anyone with?\"  He may as well have thrown are meat into a tank of piranhas.   The explosion of voices was a sight to behold and a sound to deaffen. \n\nAfter about 5 minutes of scratching REBs waving business cards in his face, someone actually let him have one.\n\nI think he actually hurt himself by not trying to laugh.  I don't think there was a power in the verse that could keep the smile off his face though.\n\n\"The National School for Adult Illiteracy\".\n\n\"We understand how embarrassing it can be to be unable to read in today's world.  We are here to help\".\n\n\"Call 1-800-INOREAD\".\n\nBelow that, in fine print\n\n\"If this card offends you, then you clearly know how to read.  SO READ THE SIGN DIRECTLY IN FRONT OF YOU, BE QUITE OR BE GONE!  HAVE A MERRY CHRISTMAS.\"\n\nDon't know about the REBs, but I had a great Christmas, and so did my manager.  Went back a few years later.  He had one of the cards in a small frame on his desk.",
            "She didn’t seem to like that all. “I DEMAND that you open your register RIGHT NOW” Okay, you got it, lady.\n\nI was hoping you then called the cops and said a woman was robbing the store and demanding you open up the register.",
            "Damn I hope she was there for vape supplies in the bottom of the box you were stocking from and had to wait some more",
            "What you had there was a genuine Karen sighting.",
            "I used to live in Miami Gardens kinda around the corner from tipsys..boy do I miss it..well Miami in general not really that area",
            "Handled like the pro you are!",
            "I can't believe she didn't argued when told to go back of the line.",
            "To be honest based on the way she phrased it I half expected you to open your till and be like “just so you know we don’t keep a big float in our registers and the police are dispatched automatically in the case of a robbery”, put your hands up and stand back a bit. I mean, she yelled at you to open the register, how are you supposed to be sure she isn’t trying to rob you? Sounds like a threat to me. And here they say not to argue, do as they say as the money and goods are insured. Wonder what she would have said then.",
            "Seven people in line, one register open and you're stocking shelves? As someone who ran the service desk in Woolworths (major grocery chain in Australia), I'd be asking you why you weren't already serving. Doesn't excuse this woman from not masking up and trying to cut the line, I know. Your manager shouldn't have had you stocking shelves.",
            "When I read “I said the back of the line,\" I pictured lightning cracking across the little thunderstorms in the back of your eyes, like Raiden. *FINISH HER!*",
            "https://www.youtube.com/watch?v=eVSlE28hOgI\n\nand \n\nhttps://www.youtube.com/watch?v=FTbgvYPVdXE",
            "I was hoping you opened your register for one customer and then closed it, technically satisfying her demand.",
            "[removed]",
            "Love how you handled her.",
            "6.2% chance this isn't bullshit fiction",
            "Love that shit! I'm a I don't give a fuck kinda guy. I have to wait I'll wait. Hell I'll even let people go in front of me. Good for you!",
            "You just reminded me of the only customer cutting incident I remember as an employee.\n\nA guy and his presumed wife came into the restaurant I was working at and pushed past 5 people to get to the register and demanded that we take their order since \"we've only got half an hour for lunch\". \n\nWhen they were told they could've called in an order ahead of time but can't skip the 5 people physically in front of them the guy started getting irate. Yelling about something I couldn't quite understand and isn't really relevant. \n\nWhen the manager on duty told him they could get to the back of the line or leave he stormed around the counter only to see the manager with his chef coat lifted on his left side and his hand on gun. At that point the guy turned whit as a sheet, ran over to his wife and just about dragged her out the door. We're in the pretty deep south, so as crazy as the gun part sounds it's very common for people to have a concealed carry here.",
            "Don't get me wrong, this lady was a complete Karen and as a person who works at a supermarket, some of the dumbest things I see people do is stand and wait I didn't obviously close register with no cashier behind it.\n\nBut if I saw an employee stocking shelves while there was a line of several people and only one cashier, I would chew that employee out and tell him to get on a register, stocking can wait.\n\nBut other than that, you shoulda told her that she will be denied service until she puts on a proper mask",
            "[removed]",
            "And then the store clapped!",
            "Why are you stocking the shelves if there are several people waiting?? And anyway she won, she got served quicker.",
            "[removed]",
            "A line of 7 people at a fucking gas station is way too long. She was right.  You should have opened up. \n\nShe still got her transaction handled in half the time. \n\nThis didn’t happen.",
            "Nice work, my man!",
            "That was gorgeous. Open the second register and send the abusive customer to the back of the line. \n\nClassic.",
            "Forget King Kong vs Godzilla, I wish I could have been there to see Florida Man vs Karenzilla!",
            "I did this once. I worked in a trade in store and on the weekends when we had extra staff, those who were just buying things wouls be called our of the larger queue one at a time and be served faster. Well this one guy decides to cut the queue. I wasn't having any of it and sent him to the back of the line. He did it again. I told him to go to the back of the line again and wait like everyone else. He gets annoyed and from the back of the line starts launching game and dvd cases at my head. Fun. He then storms out after missing me every time. All I could do was pick up the cases and shake my head. Management decided to hide down in another area so they didn't have to deal with him. I hated retail.",
            "you should've opened the register sooner if it wasn't that big of a deal. Ik cashier normally have to make a till and it's a whole thing but you whipped it out so why not help those 7?",
            "Bro, you should have waited until she got back to the front of the line and then closed your register.......",
            "I love that professional “fuck you.” What a champ. Iconic.",
            "Today. You are my hero.",
            "Here I was thinking that when a woman comes in and demands you open a register, you are going to push the little button under the counter and ring the police.\n\n\"Sorry officer, she came in here irrate and demanded I open the register, I thought she was robbing the place\"",
            "While the lady was being a bitch and I think you handled it well she does sort of have a point. If there is a line of 7 customers and another till is available you should be helping the line of customers.  Stocking vapes is not a priority, helping the customers is. The vapes will still be there after the customers are helped. At the gas station I work out the policy is to have two people behind the counter ringing people up whenever there is more than 2 people waiting to be helped.",
            "Amazing hahaa",
            "I have a huge amount of respect for you!",
            "Good for you way to go bro",
            "I work in Miami Gardens, and I tip my hat to you.",
            "Damn, my mom was a counselor at American for a long time, I have some idea of what you probably see going on in your store!",
            "Fucking.well.done!",
            "Well done 👍",
            "I thought this was going in a different direction at first. Demand I open the register? Sounds like a robbery, let me call the police.",
            "I thought the compliance was going to be you literally opening the register on her demand and calling the cops as if it were a robbery.",
            "As a former Florida native (born and raised in the mouse’s backyard now a resident of the frozen north known as PA) I can confirm that there are crazy and entitled people there, and it seems the further south you go the crazier and more entitled they are.",
            "surely there would have been giggles or smirks from the other customers",
            "Woohooo Miami Gardens! Lol I feel you.",
            "\"I said the back of the line.\" You goddamned God among mortals!",
            "I'm a firm believer that \"next customer\" always means \"next in line\" and not whomever is closer.",
            "Dude I’m convinced that some people grow up & some people just grow older into adult babies. Good on you for holding down the fort.",
            "My brother managed a gas station for years. You get all walks of life because everyone goes into the convenience store/needs gas. The stories he would tell me of customers were always amazing.",
            "Fuck yes",
            "That was great!  I imagine that announcing they way you did - both times - guaranteed she would get no backup from other customers.",
            "I would pay to see this. Well handled sir!",
            "And then you closed the line before she could get up there, right?\n\nIf not, you should've!  ;)",
            "I too work at a servo, and if a cuntstomer comes up to my till with the closed sign while I'm counting, I'll totally ignore them for about 5 seconds then tap on the sign. I'm just that done with it",
            "Gas station in murder gardens? Kudos to you 🥳😂",
            "[deleted]",
            "You were so close, then the Police Officer just had to give you their personal number.",
            "How did she stand with her arms crossed and her mask still on?\n\n\"Surprisingly, she complied, albeit with her arms crossed and what i can only assume was an angry gaze firing through her mask\"",
            "[removed]",
            "[removed]",
            "Fuck yes! Good on you OP",
            "Well handled.  But I have to say 7 customers waiting for checkout?  Dude, you should have opened the 2nd register after 4 people were waiting in line.  I don't care how many other tasks you have on your list, customer service should be your number 1 priority.",
            "If I had been on that line I would have clapped.",
            "> “I DEMAND YOU OPEN THIS REGISTER!” \n\n“Yes ma’am.” (pushes silent alarm)",
            "The sack you carry between your legs must be a burden bro.",
            "7 people in line and your putting away stuff away???",
            "Wait. 4 whole months???",
            "I am clearly on the wrong freaking wavelength tonight. I thought she asked you to pop the drawer on your cash register, then started injecting heroin in your line.",
            "I see this a lot in the retail world:  clerks misunderstanding their manager’s instructions.  \n\nWithout customers there is no need to have stocked shelves before the end of a shift.  When I go into a store and see 7 people in line, one cashier working the register and one or two more not helping customers - I make note of this and don’t return to that store.  And when I see a busy store and all the cashiers helping at registers, I make note of that store and frequent it.  \n\nYou handled an unruly customer well, but your own actions sparked this incident.  \n\nI was a clerk for 9 months as a freshman in college.  I learned all kinds of things about myself by analyzing some of the crazy situations you described.  In most cases I was the common denominator across each one, though I could always justify my actions just like you have.  \n\nThink about it for a bit..  The goal in a retail environment is always to avoid major conflicts like this one.  It’s not good for business or for your own mental health.",
            "As awful as she sounds, she was entitled to the spot she had before. I worked I retail for 15 years, and if there were that many people in line you should have opened. You were right to take the customers ahead of her, but forcing her to the back of the line was crossing over to petty tyrant territory.",
            "Please continue being awesome and please please please please teach others of your ways!",
            "As a fellow gas station employee, you deserve a raise.",
            "If it weren't for the pandemic, chin-diaper supporters and maskless morons would be a great way to instantly ID these sort of people with no downside.",
            "Wow you are such a hero. You told her, yes you did! Tell 'em! Im praying to the skies that you become my Supreme Leader!",
            "Your job is to be a cashier, and it took some crazy lady to have to tell you to be a cashier before you would cashier? I guess common sense isn’t so common!! Let me explain.....when you see 7 people waiting in line, that’s your SIGN that you should have stopped what you are doing and done your job, as a cashier!! \n\nAs a business owner and boss, if I hire you to serve customers, then SERVE the customers!! Yeah it’s nice when you can help out by stocking, cleaning, or dusting shelves or whatever but for you to sit there with your back to a line of customers when your SOLE PURPOSE of being on the payroll is to cashier.....then cashier, it’s your job!!",
            "One of the cool ass police officers gave me their personal number. Okay kid.",
            "Boss move! I love you!",
            "What a chad police officer",
            "Somewhat unpopular opinion: I’m stoned",
            "Inspiration 4 won’t like a thing of the past president and the other three try to keep it from being able to be shitty to other people ? For the same platform that they launched on??\n\nI hope that we are indeed doing him dirty like that. But even if he won he'd look like a sack of shit 😂",
            "TL;DR: Karen complained the line was too long, so you opened up a second register to help it move faster",
            "[removed]",
            "You had me until “cool ass officer.” There is no such thing.",
            "I have to say, I would never act like this woman, but I would definitely be standing in line very annoyed that there were two people working, but weren’t willing to put aside what they were doing for ten minutes to help the line. I’ve worked retail and when I see a lot of people queue up I leave the stocking for a sec and help. Again I would have just dealt with it and never attacked the employees, but it’s annoying as hell to watch a worker look at the line and then turn their back to keep doing something else.",
            "Was there applause?",
            "With 7 people in line, and one of two registers open, you need to switch from sticking shelves to opening the other register, without being asked. I doubt that the big boss really thinks putting more stuff on the shelf is more urgent than putting money in the register.",
            "Miami-Dade County: Arkham America",
            "Please tell me you closed back up when she got to the front..",
            "[removed]",
            "“LEARN YOUR PLACE, TRASH!”",
            "Could've used you in the US Army a few years ago when we needed to instill some discipline.",
            "Ha! I used to live in Miami Lakes right next door! \n\nLuckily it was nicer there but there are entitled people everywhere. Nice work dude 👍",
            "Humans only breed out of ignorance or selfishness.",
            "I thought where this was going to go based on the title was that her demanding you open the register was going to be defined in the laws/corporate rules as part of the definition of a robbery and she was going to get threatened with charges when the cops showed up.",
            "Not where I thought it was going, nicely done.",
            "Here’s an answer - stop letting customers bully you. If you have a policy they can respect it or fucking duck out. Show no mercy and don’t waste your time with fucking peasants.",
            "Lol well done.  I would have told her to get stuffed.  She can't demand shit - she's not paying my wages",
            "Stocking the *vaporizers*?\n\nWhat",
            "Good on you 👏",
            "You are a King among men good sir!",
            "Pretty sure i’ve read the same story before",
            "Fantastic",
            "Honestly man you have more balls than I do. I worked very briefly as a cashier in a supermarket. Worst experience was a guy came raging over to me demanding a refund for something, I told him he had to go to the customer service desk about 20 feet away; because it had a small queue (about 3 people) he refused and wanted me to deal with the refund, while I had people in my queue waiting to have their items scanned, etc. I froze up not sure what I should do. Luckily for me my manager was close by at the time so took the man away and dealt with him.",
            "Dale, bro. Thanks for representing the 305 in a positive light amid the shit-storm going on in MIA right now.",
            "This story tells me that you have the kind of workplace where when this story got retold to the manager, their reaction was \"And I MISSED IT?!\"",
            "Fucking well done for standing up to people like that",
            "the minute i saw Florida thoooo",
            "Great job and Super professional response! Working retail/service is hell but comes w many fun stories",
            "The only way this gets better is if you helped work down the queue until she was the last person waiting, then closed your register again leaving her to be served by your colleague.  \n\n\nExcellent MC OP.",
            "As a night shifter, there's a special place in my heart for gas station cashiers. If it wasn't for you, I wouldn't have any snacks or caffeine!",
            "5 days?? That’s honestly comedy gold. Also it’s something wrong with Lady.",
            "On behalf of a fellow south Floridian, I salute you for dealing with the craziness of Miami Gardens",
            "I bet the other customers in the store right then really loved you! Well done! 😎",
            "I, too, like it when that happens and you least expect it to happen but there you go...",
            "Fickle_Midnight, destroyer of Karen.",
            "Ahhhhh, Miami Gardens!",
            "Dude, you should've waited till she came to your register, and closed it. Saying go to the other one. Back of their line.",
            "[deleted]",
            "If I had been a customer in line I would've applauded you, or bought something extra and gave it to you as a present.",
            "My hero",
            "Man, at my store even managers will take \"a customer rudely demanded I open\" as a reason to NOT be open, so long as the lineup isn't insane.  Props for actually opening and still giving her her just desserts.",
            "That's a big bowl of win right there. You did as demanded but she was also shown that aggression and rudeness don't get you to the yop of the queue any faster",
            "This person reminds me of those people who blow by everyone in the left turn only lane to just \"realise\" the reason the center of the road is lined differently for a reason.",
            "more than that of people?",
            "I’d totally have closed the register just before she got to the front of the line.",
            "Gas Station in Miami Gardens? geez that’s rough man…",
            "Family owns and operates a few gas stations in long island NY the amount of times pol come in with no mask blows my mind and when you tell them they dig in their purse or pockets and pull it out , its like what do ppl think we dont have families or something i been double masking it at work even behind the plastic clear sheets we put it , i love how you handled it though stay safe <3",
            "I award you my free award.",
            "Finally someone who is acting like an adult and doing their job. And after all that BS she thinks she’s next in line??! WTF? Dies she think you work fir HER? And without a MASK! No Karen, no , BAD Karen ! That’s a bad Karen! No !",
            "I like tomatoes",
            "ahh miami gardens... thats one of the better cities in miami-dade. the people are always friendly and definitely not super trashy",
            "Fuck Miami Gardens. Fuck Miami. Fuck Florida",
            "TIL that people are still standing in long lines inside gas stations during a pandemic. As a privileged, white person I haven't had to step foot inside a store for over a year now.",
            "That's no lady...",
            ">People, man.\n\n[People... What a bunch of bastards!](https://youtu.be/eVSlE28hOgI)",
            "Bravo!!",
            ">She comes to the front of the line ranting and raving about how the line is too long and that we shouldn’t be keeping a valued regular customer waiting\n\nThis immediately tells me she's not a regular. See, \"regulars\" tend to have a lot more patience and understanding than incidental customers because they see the store/restaurant/bar/whatever as \"their place\" and why would you want to build a bad rep at a place you intend to frequent?",
            "You’re a hero.",
            "No problem with how this was handled, but if you have a line with 7 customers, maybe you should have more registers open (Unless this is a QT, their lines move almost as fast as Chik-fil-a)",
            "Dude, if I was in that line, I'd have tipped you so well. That shit deserves a standing ovation, lol.",
            "This situation is the cororate world in a nutshell... aim high my friend aim high it never gets better so you might as well get paid better",
            "Without profanity, unwarranted shouting and you kept yourself professional. You da real MVP, OP.",
            "Like a boss!",
            "Wow, you handled that lady like how I handle a student in school. Respect ✊",
            "Lol. I once worked at a gas station years back. People would cut in line all the time demanding to put money on a pump etc like they where more important than a kod buying some bubble gum. Haha. People are a trip.",
            "Handled that fantastically, bloody well done.\n\nAlso, this may be a bit odd, but bear with me. I had a great experience in Asda earlier today - I was in the queue with a few bits, had a huge amount to carry as I stupidly thought I could get all my chores done in one day and forgot I am a weak human and was at the end of my tether. The queue wasn't long but there were some customers being silly in the self checkout (card versus cash, forgot something, etc etc etc) which made the wait longer than expected. I was waved over to a cashier checkout that they were opening but some women got there before me so I waited patiently. After five minutes or so, my back absolutely killing me at this stage as it was busy so didn't want to put my bags down, it became apparent that these women were huge pains in the arse. The dude who had initially waved me over to the cashier checkout came up and apologised, I told him it was fine and wasn't his fault, he then made sure the next self check out that came up was held for me and brought my basket over for me. I was frazzled at this stage so while I did thank him and try and express how much I appreciated him keeping an eye out for me and helping a fraught checkout process I feel like I could have thanked him more and so I guess my point is that I want to just publicly say how awesome that attendant was and how much I appreciated him and hope that he has a lovely day and there weren't any more twits or at least he didn't get the rough end of any twits. Also you have a great day too.",
            "Wow, you have so much patience.  I can't handle \"crazy\".  Good for you!",
            "Some people have a bad tendency to treat those of us who work in retail and hospitality like shit for no good reason. Husband trying to get the kids? Scream at the teenager mopping the wet floor because you need to get your drink. Co worker narcing on you to the boss? Bang several times on the counter by the empty register and make an entire store  stare at you while you have a meltdown. They do make good stories.",
            "Miami Gardens: scenario of obnoxious entitlement is believable.",
            "I hate it when there's so many people on the que and there are two staff and one of them is fumbling around. I used to work in a store and dealing with customers was a priority, we would drop everything to get customers sorted at the checkout.\n\nStores lose so much money with people just abandoning stuff and leaving the store because they waited too long and the queue took forever. \n\nPlus they just abandon whatever they wanted to buy so, you the staff have to put them back. \n\nWorst is when the customer is spiteful and decides to just walk out the store with the items they wanted to buy.",
            "I love Florida gas station stories.",
            "What is it with florida, man"
        ]
    },
    {
        "post_id": "83etzs",
        "author": "ShinnyRose",
        "title": "\"Just add subtitles!\"",
        "url": "https://i.redd.it/pgdqfvoehxk01.jpg",
        "score": 25411,
        "num_comments": 267,
        "created_utc": 1520684217.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/83etzs/just_add_subtitles/",
        "comments": [
            "Having actually done video transcription for a few years now, I was always outright told not to translate or even transcribe, even if I knew what they were saying.  Which always seemed silly to me, because it applied to even common foreign phrases, but... whatever, they were paying me.\n\nSo for something like this, I'd just put [SPEAKING CHINESE] and just wait for someone in the video to speak English again.  (If the whole video is in a foreign language, then I just send it back with a note)\n\nThat said... what happened here is next-level pettiness, and it's beautiful.",
            "Plot twist that's the actual dialog ",
            "I remember when Homeland was filming the scene in Pakistan they had people do some Arabic graffiti on the walls (no one in Pakistan speaks Arabic). Only to later did a viewer notice that the graffiti in the background says \"Homeland is racist\"",
            "Closed captioner: \"What should I put down here?\"  \nEditor: \"Something in Chinese.\"  \nClosed captioner: \"Yeah, but what?\"  \nEditor: \" I don't know what, I'm just the editor.\"\n",
            "/r/notmyjob",
            "Fucking hilarious",
            "King of the Nerds! This show was a blast, but also terrible",
            "I had a friend who worked for the local CW station.  One of his jobs was transcribing the closed captioning for a show. \n\nOne day he told his supervisor that he had done his work even though he hadn’t and was planning on doing it that evening or the next day.  \n\nThey aired the episode before he had the chance to do the work he said he had done.  So an episode of The People’s Court went on air with out closed captioning.\n\nThey fired his ass.",
            "Considering the editing on this show, I would not be surprised if production told the editors to make that joke.",
            "*Chinese Noises *",
            "r/notmyjob is leaking ",
            "[deleted]",
            "I imagine the story probably went something like this:\n\n> _Editor is editing a piece of media entirely in English except for this one shot. The first edit comes back and this shot has no subtitles._\n\n>**Editor's Asshole Boss (EAB):** Why aren't there subtitles here? I told you to put subtitles here.\n\n>**Editor:** And I told _you_ that I need someone who actually speaks Chinese. I tried to transcribe it, but without actually knowing any Chinese I can't spell any of it right for Google Translate to understand it.\n\n> **EAB:** We're not hiring a fucking translator for one shot. Just put in some fucking subtitles, I don't care if they're accurate or not.\n\n> **Editor:** Whatever you say.",
            "[From Ernest & Celestine](https://i.imgur.com/85syXhV.jpg)",
            "/r/Sadlygokarts ",
            "[Cries in Spanish](https://i.imgur.com/QByIDqZ.jpg)",
            "Hanlon's razor.",
            "It's not every day I see something that makes me laugh for 30 full seconds alone in a room. Then I look at it some more and keep on laughing. The Chinese man seems so nice, and I'm just imagining this editor shaking his head at himself as he types these subtitles in. ",
            "I fucking hate vague instructions. \"take the ladder upstairs\"  \"which room?\"  \"just upstairs\". Don't be surprised to find the ladder blocking the top step. ",
            "This is from the show King of the Nerds. S2E8. Happens at the 22 min 27 mark. http://www.dailymotion.com/video/x3jelr1",
            "几句普通话。我不太清楚，我只编辑。",
            "I feel like someone told this guy, \"You don't NEED to know what they're saying, you're just the editor.\"",
            "\"That sound that Chinese people make\"",
            "Hahah",
            "whatever",
            "I thought that guy was a Chinese editor for a reason he doesn't know...",
            "Well, now we know exactly who to fire",
            "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r83etzs?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[\"Peanut: Can you hear me now?\"  Arguing with Myself   JEFF DUNHAM](http://www.youtube.com/watch?v=A38YO3f2Bv4&t=176s)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/83etzs/_/dvhkl47?context=10#dvhkl47) - That reminds me of a Jeff Dunham bit.     One of my favorite comedy bits. Jeff just fucks with these deaf people.\n[Dread Zeppelin - Black Dog.mpg](http://www.youtube.com/watch?v=CZHWy6W00oM)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/83etzs/_/dvhy6n1?context=10#dvhy6n1) - He's like a cover band, no matter how good he is he'll never advance the art form, but it can still be a great show.   Unless you're talking about Dread Zeppelin, who have definitely ascended to the upper echelons of what is considered true art.  You...\n[How sign language innovators are bringing music to the deaf](http://www.youtube.com/watch?v=EuD2iNVMS_4)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/83etzs/_/dvhu4y9?context=10#dvhu4y9) - Nah, good chance that part was real. They have signers for concerts too, it's actually an ADA requirement that venues can accommodate deaf people who attend\n[(LoL) Chris Pratt making a translator's day very difficult.](http://www.youtube.com/watch?v=ZCOHmeRdz-8)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/83etzs/_/dvhvsd1?context=10#dvhvsd1) - http://www.youtube.com/watch?v=ZCOHmeRdz-8\n[King Of The Nerds season 2 episode 8 s2e8](http://www.dailymotion.com/video/x3jelr1)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/83etzs/_/dvi6z55?context=10#dvi6z55) - This is from the show King of the Nerds. S2E8. Happens at the 22 min 27 mark.\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r83etzs?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
            "concerned divide squalid grandiose wipe axiomatic berserk bright alleged intelligent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Perfect.",
            "Smiles in Ching Chong",
            "某物",
            "So how long did you wait for the GIF to load?  ",
            "Should somebody tell him Chinese isn't a language?"
        ]
    },
    {
        "post_id": "nmgwnb",
        "author": "None",
        "title": "Ex boss accused me of reporting him so I did",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nmgwnb/ex_boss_accused_me_of_reporting_him_so_i_did/",
        "score": 25308,
        "num_comments": 837,
        "created_utc": 1622147588.0,
        "selftext": "I worked for his small company for 6 weeks at the end of 2020 (it was landscape architecture). He sacked me with no real explanation when I was off sick with covid. I have undiagnosed (highly suspected) ADHD so I wasn't massively suprised (it affects my performance). But I was suprised by the timing and the fact it was via email. I asked for more clarity. I was never rude to him. I just told him I wish he'd called me so I could get some feedback.\n\nHe got really mad and proceeded to write a long list of my (over-exaggerated and some false) shortcomings e.g. too slow, distracted (stuff he never mentioned at the time). He then said 'if you want to take legal action against me, let me know'. I didn't. I left it and moved on.\n\nFast forward to today. He just called my mobile from a private number asking how I was. I was taken aback as we have had no communication since. He said 'someone has put in a report I'm using unlicensed software, was it you? Because I know we left on bad terms'. I said I've no idea what you're talking about. He made it seem I was devastated he sacked me (lol) and would have good reason to report him. No matter what I said he was convinced it was me. He even accused my dad who works in IT.\n\nI didn't even know he was using unlicensed software. I said 'I feel like you're unfairly accusing me here' he raised his voice and shouted 'WHY DO YOU ALWAYS PLAY THE VICTIM, STOP PLAYING THE VICTIM! (probably in reference to the fact I questioned the way he sacked me). It sounded so rehearsed I honestly had to hold back laughter. Then he  said 'I'm not *accusing* you, but did you do it?' (Lmao).\n\n\nLooking back I believe it was unlicensed. We only ever used the student version of autodesk (which is illegal when you're running a business). This combined with his accusation tells me he is infact breaking the law..\n\nI was so pissed off by his accusation I reported him to both autodesk and the BSA. He'll have to run an audit and likely face a huge fine. He thinks I did it either way so what harm can one more report do? ;)\n\nEDIT: for all you sad trolls, I didn't complain *because* he sacked me. I just questioned the *way* he did it. A simple phone call would have been better than an email. When you're fired you have a right to ask why and that's easier to do in conversation (best in person). I literally didn't have a problem when he sent a list of my shortcomings. I just accepted it and moved on. I also take full accountability for it, the ADHD played a part but I'm still to blame for losing the job. Not the ADHD.\n\nAt no point did I ever say I shouldn't have been sacked. If you actually bothered to read the whole story you wouldn't be making that assumption. I was just pissed he pointed the finger at me for the report. Also I love this mentality that because I'm a graduate I'm a little bitch and bosses can never be in the wrong. You've clearly never had a job to not know that. Now fuck off.\n\nAlso, my dad does not work there. Like I already said he is a software engineer, not a landscape architect. So stop telling me I'm 'happy to put him out of work'.\n\nIn regards to the ADHD, I didn't know I had it until recently. But it makes sense in hindsight. Especially considering the reasons he fired me are all ADHD symptoms. Although I haven't been officially diagnosed (awaiting) my doctor highly suspects I have it. Thank you to everyone who has offered me advice :)",
        "permalink": "/r/MaliciousCompliance/comments/nmgwnb/ex_boss_accused_me_of_reporting_him_so_i_did/",
        "comments": [
            ">unlicensed... autodesk\n\nBig oof there. They don't fucking play",
            ">I didn't. But thanks for the idea. _click_",
            "[deleted]",
            "That phone call is what a prosecutor would call witness tampering.\n\nCan't stand getting caught in a crime? Commit an even bigger one in a pointless attempt to cover it up!",
            "Perfect example of \"Accuse me if something? Might as well do it then.\"",
            "A large tool die mold shop got hit hard for the same thing, around 2005, they screwed around one of their employees. the shop had around 50 workstations, all but one were pirate versions, they bought two copies of Cad program and two Cam programs, they installed 12 pirate copies of the Cad and around 20 of the Cam. Every station had bootleg copies of Microsoft Office, Some had copies of DNC programs that drip feed data to CNC's, the CAD, CAM and DNC programs are not cheap as they are industry specific. The upshot is the guy they fired was the guy was the IT person, he knew where the bodies are buried. After they tried to Screw him around on severance he decided to get even, he sent BSA a list of every pirated program and workstation it was on, in the end they were fined almost a million dollars and he got a $45,000 reward. Also the company had to install legal copies on all stations.",
            "You can take a lot of comfort and satisfaction that the very fact he acted that was proves he was fucking terrified. You held power over him and didn't even know it. That guy is a sad pathetic coward clearly. Not really something be proud of. But for vindication sake, yeah you unknowingly had him scared. Fucking beautiful. Remember that.",
            "You should have very pointedly said to him \"No I didn't report you, but I am going to now.\"",
            "Why in the hell would he go around asking who reported him? Especially people he thinks have a grudge? \n\nNow those people with possible grudges know there's something to report him for. That's like handing them ammunition on a platter.\n\nAnd what exactly was he going to do if someone said \"yes\"?\n\nThis man is very stupid.",
            " Email him and say that you didn’t report him because you didn’t know he was using illegal software,  but once he told you, you felt it was your civic duty to report the crime. What’s he going to do? Fire you?",
            ">I reported him to both autodesk and the BSA. \n\nI can understand reporting him to Autodesk, but why the Boy Scouts of America?",
            "I had a coworker who grabbed my butt at work. It bothered me but I was young and wouldnt have reported him (tho I definitely never shouldve questioned that was the right thing to do) but then he started DARING me to do it! He'd say things like \"I dare you to go to HR! They don't care about you. They won't believe you.\" \n\nHis \"dares\" became more scary and upsetting than the original incident. So I accepted his dare and told HR. He was fired after they investigated & found the butt grab on camera. After he was fired some of the other girls started talking & Come to find out that the grab he did on me was the mildest of his offenses but they were all too scared of him to report. Nobody missed him.",
            "I had a boss that did that to me.  First job I worked at had these two employees that were great buddies and all.  One was a supervisor the other just a regular employee, after sometime of me working there they both were fired as it turned out they had been selling drugs over the countertop and they thought I had turned them in.\n\nI had no idea they were doing that until I started thinking back on it.",
            "God, my ex had something similar happen to him, he worked for a guy building houses for about the same time, six weeks and then suddenly one morning got yelled off the work site and accused of calling the labor board on the foreman. When my ex asked for pay (he didn't get anything for the six weeks) he just said \"so sue me\", which my ex went ahead with and did, but the guy refused to pay. And then five years later he starts calling again, threatening to put a lein on our house (which would not work, he has zero claim) if my ex didn't retract the sueing cause having it on his record was affecting his credit. It's been 7 years since everything started and the guy still hasn't paid, but his credit is also fucked because of it so he's just screwing himself at this point.",
            "If you're gonna do the time anyway,  might as well do the crime!",
            "Thou shalt not poke a bees nest when you wish not to get stung.",
            "I can’t remember who or what it was but I remember hearing an ad about how you can get a reward by turning in your employer who uses unlicensed software, so really, could have been anybody.",
            "Take a shot every time OP says sacked lol",
            "Yo, I am a ADHD guy who never held a job for longer then 9 months, until that is I started welding. It might not be for you, but could be worth it.\n\nI get distracted quite easily myself, but when your helmet is down and your welding, literally the only thing you can see is your welds, hard to get distracted when you can only see what your doing.\n\nIt's not hard to learn if your city offers any training, I got a free course that was only about 2 months, additionally (depending on state/provincial laws) you technically don't need a welding license depending on what your doing. I have one but I don't need one for making grain augers.\n\nThey let you listen to the radio provided you wear earplugs, the loop hole I found was bone conduction headphones, though I personally listen to audio books. They are quite shitty headphones unless your wearing earplugs then they are the best.\n\nThey think I'm a focused driven worker, I just zone out and enjoy my books.",
            "It would have only been sweeter if you had told him that fact.  I didn't report you then, but MF'er I'm reporting you now!!",
            "Wouldn't it make more sense to get diagnosed and treated if you have ADHD?",
            "Don't you also get a cash reward for reporting that? This might buy you a pizza :D",
            "If you suspect its ADHD and its impacting your ability to work, get it seen to mate.",
            "Unfortunately those audits only work if they agree to them. Only certain products like Microsoft Volume licensing requires the company to sign a contract to allow audits any time, and certainly not one-off student licenses.\n\nBut you've demonstrated he's not the brightest bulb so he may just voluntarily make it worse for himself.",
            "The BSA gives you a cut of the fine, IIRC.",
            "My company did this once.  I'm still not sure how to feel about it even years later.  We did IT outsourcing.  A company called us about potentially taking over as their IT firm.  We told them we needed to do an audit of their entire network/systems first.  When we did this we found that they were running their entire office off the Home and Student version of Office which is illegal.  We told them that step one would be to upgrade to either Standard or Professional and that we would sell them copies.  It would get pretty pricey honestly because they'd need like a dozen or so copies.  They told us their previous IT firm had no problems with them doing it with just the Home and Student version and that company had pitched to them as it saved them a lot of money.  When we said we wouldn't do any work for them unless they upgraded, they fired us.  We reported both them and the previous IT firm to Microsoft.",
            ">WHY DO YOU ALWAYS PLAY THE VICTIM, STOP PLAYING THE VICTIM!\n\nChrist, I have experienced this in more than a few jobs.\n\nTry to appear remorseful?\n\nStop being a victim.\n\nRespond with unemotional acknowledgements?\n\nYou aren't taking this seriously.\n\n\"Calmly stand your ground, and acknowledge where you did wrongdoing?\"\n\n\"You must think you are so clever.\"\n\nI too have ADHD, I am medicated now, but even before I honestly feel I put in more than most other workers, but that doesn't matter if you aren't the bosses favourite.",
            "Hey man, I only recently got officially diagnosed with adhd and found meds that work alright for me and the difference is INCREDIBLE\n\nLike, I can fucking do stuff now. It has truly revolutionized my life. I don't know your reasons for not pursuing diagnosis and treatment, but I can not fucking recommend it enough.\n\nI'm rooting for you",
            "When someone accuses me of something I didn't do, I tell em I may as well do the crime since you're expecting me to do the time. Usually the crime in question is eating the last ice cream so I then have to go buy one and eat it maliciously.",
            "NAL, but isn't there some legal repercussion for firing someone while they are on sick leave without prior record of complaint?",
            "I can tell you personally what happens when Autodesk receives these reports, as I have been on the receiving end and had to pay for it.\n\nFirst, they will ask you to verify the software license key, and will give you a specified amount of time to comply (if you don't they'll refer you to their legal team who will decide if it's worth suing you). When you do, they will demand you pay $5,000 USD for every unregistered copy of Autodesk software you are using to cover a 3-year license.\n\nThe penalty is rather weak for a business but it adds up if you are using more than 1 illegal copy. Otherwise, that's the extent of the penalty. He gets a 3-year license out of it but has to pay for it.",
            "Sounds like the guy I was working for in 2005. Was using interns and never paying them. Was definitely using unlicensed software. Guy had massive anger issues. One day he flipped out on me, accusing me of not doing any work, etc. What I wasn't doing was dealing with his pointless busy work and vanity projects, I was helping devs work on the actual product. \n\nFast forward a few years, find out his company tanked and he was being sued by his business partners for embezzlement.",
            "What does he think calling you would achieve if you were actually the original reporter?\n\nDoes he actually think that he can bully people to protect him or retract reports?",
            "This is so satisfying, good move lol. Fuck that dude and his business 🤣",
            "\"I'm not accusing you but did you do it?\" \n\nI'm thinking \"Okay so A, you **are** accusing me but B, you're too much of a coward to say so.\"\n\nScrew this narcissistic b.s.",
            "Am I missing something? Where’s the MC?",
            "[deleted]",
            ">When you're fired you have a right to ask why and that's easier to do in conversation (best in person). I literally didn't have a problem when he sent a list of my shortcomings.\n\nEveryone should get feedback, especially if they have things they need to improve.",
            "This isn't malicious compliance in any way. Petty revenge maybe. Had you sued him, yes. Reporting him bc he asked if you did, no.",
            "THIS IS HILARIOUS. Imagine having the BALLS (and not in a positive way) to call the person you think ratted you out, like they won’t report that shit, too. But he was wrong and harassed you and guess he gets what he gets 🤣🤣",
            "Oooh, I remember seeing this post in another subreddit. Good on you for going the extra step and reporting that a-hole. A lot of folks were cheering you on!",
            "He does not sound like a well man.",
            "Depending on your state, him terminating you while you are on sick leave could be illegal. It sounds like he needs his unemployment insurance rates increased.",
            "What a douche. Just pay for the damn software, you're supposed to be a professional.",
            "If you're going to do the time you might as well do the crime.",
            "Autocad is expensive as fuck too",
            "I just love that you guys use the word sacked that way. As an American, I picture him tackling you forcing a fumble.",
            "I worked with a friend at a parlour of popular ice cream chain back in high school.  My friend was a shift manager that was hired by a GM who eventually got sacked for stealing.  The new GM proceed to lay off every shift manager the previous guy hired including my friend, claiming that she was untrustworthy because she was hired by a sketchy GM.  In reality, my friend was more or less a model employee, who worked very hard and was completely above board in her conduct.  Because this company was stingy, to avoid paying severance my friend was offered a few weeks notice before her lay off.  On the day of her last shift, which happened to be Thanksgiving, she showed up at my house durring dinner and handed me two giant boxes of my two favourite flavours of ice cream (icecream shop  style big boxes).  She informed me that if she was going to get laid off for being associated with a thief she may as well steal on her way out.",
            ">WHY DO YOU ALWAYS PLAY THE VICTIM, STOP PLAYING THE VICTIM!\n\nIf ever there was a classic, textbook definition of projection, this would be it. Also, if this is how this fuckwad treats strangers, I wonder how he treats family members.",
            "> he raised his voice and shouted 'WHY DO YOU ALWAYS PLAY THE VICTIM, STOP PLAYING THE VICTIM! \n\nProject, much?",
            "It's a real shit move to sack someone for something you never even brought up to them (in some places this could be wrongful dismissal once you're past the probation period, but that's usually longer than 6 weeks), obviously a terrible boss and a plain lunatic to boot",
            "You could go the extra step of calling him and giving him an \"exit interview\".\nPlay like you've had it with his shit and that his performance was unacceptable.\n\nIts not too late to do this, even if he's fired already.",
            "If he calls again, laugh. Laugh long, laugh hard. Then hang up. Call the police and report him for harassment. You could also try and report him to the ICO. I'm pretty sure that \"calling to give someone shit for my crazy conspiracy theories\" is not an accepted use for personal data you keep on file about past employees. \n\nDon't worry about contacting the police. 101 is there to help, it's not wasting police time. As for legal action against you. I'm no legal expert but I think you're fine. Very extreme to think of reporting software theft as whistleblowing but it probably fits https://www.gov.uk/whistleblowing you're good.",
            "Not a very smart employer, what the fuck does he expect to do if it was you? You don't work for him anymore, and he broke the ToS",
            "Had a similar bad experience working in landscape architecture. What is it with these guys?",
            "This is the one time I think a post would benefit by having the title end with \"lol\"",
            "Former IP lawyer: BSA do not fuck around. Had some small time clients that did something similar, they got absolutely roasted",
            "If a phone call starts with \"How are you doing?\" or \"How are you today?\" - I GUARANTEE you the call will immediately go south.",
            "Yeah what a dick, I had a company like that. I fucked up admittedly, However I fixed addressed the issue and made note to not do that. However someone they just had hired, sat me down to fire me. Someone who they promoted the same day to fire me. I was disappointed especially with my vocal Expression about the company (local and knew everyone, Mistake cost maybe 500 bucks, Not like some of them there who made *cough* 400k mistakes) and How I would love to stay there permanently and long term. They contacted me later accusing me of stealing data (almost a year later...) and attempted to get me fired from my current job. The data that they accused of being stolen was made on unlicensed pirated software. Autodesk locked it and the machine and they assumed it was me.... Ended up reporting them like you did and they had to pay around 1.5 million plus fine (percentage of profit made from using the software pirated). Felt great, But I'd never do it again.",
            "You might be entitled to a reward for reporting him too/. I know when I had classroom training for Mastercam at our local dealer they had notices posted around the office about \"bounties\" for reporting \"pirates\" I think it was like $500 or something like that.",
            "Autodesk takes a pretty serious stance on pirating their software.",
            ">We only ever used the student version of autodesk\n\nHe is fucked.",
            "his lack of action on \"fire-able offenses\" until you were sick and out of the office seems highly suspect. hopefully you pursued legal action or got unemployment to seal any gaps in finances",
            "I worked in computer retail for 3 months before. I quit because there were too much overtime without any compensation. Month or two later, ex boss calls and yells at me for not doing inventory correctly for some mouses. I know I'm not involved because the mouse he was talking about wasn't even released when I worked there. I got pissed off to say the least and filed complaint to ministry of labor (Korea) for overtime without compensation, pay below mininum wage and not drafting employment contract. We settled on money part for around 500 usd. But contract part is just illegal, so he got fined for around 5000 usd. Him and his business got record for worker mistreatment.\n\nHe also called me last year (probably on accident) and I just said \"what the fuck do you want\" and he just hung up",
            "Honestly call him and let him know you went ahead and followed through with a report and he should be expecting an audit lol. Give him something to stress about bastard",
            "Buuuuut that's not malicious compliance...\n\n'Complying with a request in letter but not in spirit.'\n\nThere was no request.",
            "yo as terrible as this situation was, this is a great thing for you.  6 weeks and you learn a VALUABLE life lesson and get some payback.  cuz the next time you meet someone like that in a job interview you’ll nope the fuck away",
            "If you're going to get accused for it, might as well do it!",
            "Reddit ia generally filled with peoppe of no educational background, but a lot of nuanced \"knowledge\" to compensate for a lack of a traditional degree. So don't be too upset when you've hit their insecurities. You've tried to give the benefit of the doubt and moved on but in the end you did the right thing in my eyes.",
            "Love this, nothing wrong with reporting all the illegal shit a wanker of a boss does once you've left the company.",
            "I got \"evicted\" from of a  pharmacy because the narcissist chemist thought I had reported him for not wearing a mask . I replied nope, wasn't me, but I am now. His reaction was enough to LMAO but I held my poker face and then reported the fucker.",
            "He fired you while you had covid? He just loves doing illegal shit that can cost him a lot of money, I get the impression he isn’t very bright.",
            "I would see a specialist for your \"ADHD\". Never good to diagnose yourself as it may be dangerous. You may have something else too!",
            "Yeah. Congrats, you have had your first boss with undiagnosed narcissistic personality disorder. I hope you find a healthier workplace.",
            "Cant you get a reward or something for reporting unlicensed software use? You should look into that op, could be a nice windfall if you qualify. The cherry on top of the MC, if you will.",
            "If an employer is worried that someone will report them, then that probably means they need to correct the infraction that they're worried about, rather than maintain a state of paranoia that someone will report them",
            "Saw your edit, awesome that you’re doing something about it! It’s kind of interesting; because of a period of WAY over-diagnosing it, what followed was a period of doctors being a lot more hesitant, and even (especially in my case — my brother had it WAY more severe, and it skewed my parents’ perception) denial of symptoms by parents and other caretakers. I was always bright, but I struggled with the speed at which I read. Retained really well once I read. I think back to the tutoring I had for this, the teachers who recommended it, and I wonder, why did nobody catch this until I did in adulthood?!\n\nFor real though, can’t recommend enough *finding a psychiatrist* that you trust and like. A general practitioner is great but it really isn’t in there purview to make that sort of assessment. It sounds like yours has given a recommendation of sorts, so just follow up. Making that initial appointment was by far the hardest step for me.",
            "What happened after you reported him?",
            "May as well alert Microsoft, too. Bet he's using something out of license from them, too. \n\nAnd Adobe, if they ever used any of their products.",
            "Petty and stupid? That’s a winning combination.",
            "Can you use some more parentheses please?",
            "You're really into parentheses.",
            "My philosophy is “If you make me do the time, I might as well commit the crime”.\n\nIn other words, if I have to listen to being accused unjustly, why shouldn’t I just do the thing I’m accused of?",
            "The Boy Scouts of America handle software piracy?",
            "Love it, I just hope your dad doesn't work there, I wasn't clear on that",
            "Omg, I’d have said right on the call, “I didn’t, but thanks for the info... I’ll call the appropriate numbers right away to report it!”",
            "If you're going to do the time, you might as well as well do the crime.",
            "[You can feel the punishment but can’t commit the sin.](https://youtu.be/pekhxxngQ3s)",
            "😂 I love it! Good for you! Karma is a bitch, as they say. Cheers!",
            "I’m not mad at this. He did it to himself.",
            "Old boss framed me for stealing $50, so I quite and reported him for hiding his weed behind the safe at work.  \n\nWeek later I found out the local PO searched didn't find any behind the safe.. but did find a ton IN the back of the safe.   About 8 years worth  of jail time.",
            "[deleted]",
            "What did he hope to accomplish?  Like you could unreport your report?  Dudes two beers short of a case.",
            "I have been drafting for 20 years. They always want it faster. Autodesk will also rip him a new one.",
            "I’m not sure about where you are, but in the United States I’m pretty sure ADHD is protected by the ADA and you can sure for discrimination.",
            "> he didn't want a graduate employee\n\nThis is confusing me. Does this mean... a seasoned employee? I'm thinking of graduate degree and by context clues I'm pretty sure I'm wrong....",
            "What an immature douchenut. Well played",
            "Good on you and thank you! I’m an ADSK employee and this brings me much joy. Sorry for your sacking though, but glad you’re out of that toxic work environment.",
            "If your dad works in IT in the same company, tell him to watch his back, because that guy will seek revenge against you through your dad.",
            "Double jeopardy. Might as well.",
            "Sounds exactly like one of my old bosses when I worked at a landscaping / gardening store lol. From my experience 90% of the people I’ve dealt with in that industry are absolute bell ends and will break the law without a second thought",
            "saw your post in r/legaladvice the other day and i'm glad that this is the outcome.",
            "Autodesk's piracy and licensing department is no joke. They used to make just as much off of fines for unlicensed software as they did for legit copies. Source: Worked for a reseller for a couple years.",
            "Way to dig your grave, boss hahaha",
            "Wait, isn't Autodesk free now?",
            "[removed]",
            "I work with Autodesk products, and I have been doing some research a few weeks ago. Apparently if they get a report for unlicenced use, they can initiate an investigation and not only charge the amount they think you owe them, but also give a fine. This results in a 5 number bill, sometimes 6 or 7. \n\nNot sure how it goes around the world, but where I live theres a seperate agency that checks licences, and if they have good reason to beleve you use unlicenced software, they can check every computer and building that is used by the company. If you report to them and their investigation is succesful (resulting in a fine) you can be rewarded with €10.000",
            "I had a job where for 5 months they did nothing but lavish praise on me, then out of the blue said they were unhappy with my work. A week later I was escorted out. \n\nTheir business is barely afloat a few years later. Absolutely bonkers.",
            "This is why I don’t answer calls from unknown numbers. You can yell at my answering machine all you want.",
            "Story aside - cool it with the parenthesis",
            "Mate, the first two paragraphs coulda been written about my experience last year, just in a different field. Hope you find something better soon!",
            "Well, if you're gonna be told off for something regardless of if you did it or not, you might as well do it.",
            "Maybe it's just me, but I'd prefer being fired over email. Less bullshit small talk and exit interview shit. Short and sweet, tell me why, tell me when, and tell me my severance package. All I really care about, not like you are convincing anyone to let you stay after they already made up their mind and done the paperwork for firing you.",
            "Lol u did right, report dicks like that who think rules dont apply to them. \"Unlicensed\" is just different way to say that they didnt pay for the software that they should have.",
            "Yeah fuck that dude I would have taken a shit on his desk",
            "Good for you! These kind of people deserve to get fucked. Similar story, ex-boss owed me money. I wrote it off until he accused me of stuff. Sued him through the Department of Labor (found out that’s really easy and free btw). Got my money. Side note: 1yr later his company was sued for injuring a customer with a faulty medical device and went out of business.",
            "Reverse uno card played!",
            "Good for you for making the report. Being falsely accused is one thing, but him not hearing you on the \"hey, it wasn't me\"... and then continuing...? yeah, I'd make that report too, especially if they were shady to begin with. \n\nDon't poke me, I'm a dragon.",
            "\\*Face slap\\*  \n\nIt's one thing to use the student trial version for home or personal use, but anyone running a business deciding to pirate the software is beyond stupid if they are using that software for more than an actual trial period (ie couple days to a week to see if it's worth the purchase).  He is running a business, so making money off the software.  It was a question of time before he would be found out.\n\nFrom the sounds of it, he probably got the software copy at school of from another employee that was trained how to use it.  Never bothered to actually buy the license.\n\nIf he \"hired\" any co-op students, that would probably be the first suspect in my opinion.  I mean if you are not even paying them or under training (ie not providing usable experience in their field) them, don't expect them to cover your ass if they see something illegal.",
            "Well done I would say",
            "Anyone complaining in the comments is prob also a douche boss lol",
            "OP dodged a bullet by getting fired and not working for that prick anymore.",
            "Technically not reporting him puts software engineers like your dad out of work.",
            "If he thought that was an okay way to terminate someone, then he probably doesn't treat his employees very good to begin with.....I wouldn't be surprised if he just pissed off some current staff member",
            "Well played on the MC!\n\nI was diagnosed with ADHD the summer after my sophomore year of college, and let me tell you--my life would have been so much easier if I'd been properly diagnosed as a child. I'm glad you're working with with your doctor now on the diagnosis, though. Getting on the right medication will literally change your life for the better, for real.",
            "Go see a psychiatrist. I was just like you, undiagnosed until age 25. It changed *everything* and life got much better.",
            "Go you!!!",
            "Not really malicious compliance but it felt really good to read.",
            "Stop playing the victim, I’m playing the victim",
            "I'm not sure it's complying with anything, but it's definitely /r/ProRevenge",
            "Have you tried gently punching him in the face?",
            "It's weird that he sent back a list of your \"shortcomings\" after firing you. That's a big no no wtf are you doing kinda thing.",
            "The date or time stamp of your actual report will show him that it wasn’t filed until he kicked the hive.\n\nYou shouldn't feel obliged to respond to people who are rude to you simply because they couldn’t be bothered to read correctly.",
            "\"I have undiagnosed ADHD so I wasn't mad.\" What the fuck does this have to do with anything?",
            "My boyfriend and I were having a bad day but this story makes us feel better about this crappy world and crap bosses like him.",
            "[removed]",
            "This is why I don't answer restricted number calls.",
            "What sort of teenager bullshit story is this?",
            "[deleted]",
            "You're kinda playing the victim.",
            "This is more petty revenge than MC, to me MC implies you were asked to do something a certain way, did it to the letter but in a way they didn't actually mean, knowing full well that's not what was meant, but that you can't get told off for it because it matched exactly what was said.\n\nEither way, a good story though, shot himself in the foot by being a jerk",
            "This behavior is totally acceptable.\n\nYou will go far if you keep this up!",
            "[removed]",
            "I used to see this a lot in places I’ve worked before. Over the years it has become less common, probably because software companies figured out how to crack down on people like your boss. I’ve also been on the side of (very indirectly) enforcing such licenses, and lemme tell you some idiots out there still think they can copy software and sell it.\n\nAlso, RE: your edits, is it just me or are there a lot more people on Reddit now that sound like they’re bosses/business owners and trying to hide it? What normal people without skin in the game get mad at people like you over the stuff they’re salty about? Maybe the pandemic has them with a lot of free time they waste going to Reddit and being all mad their moronic choices are getting called what they are online?",
            "[removed]",
            "Pretty sure it’s not illegal (depending on jurisdiction) just against the user agreement. This is based off america though.",
            "So you're just going to post this everywhere until you find a sub where the mods don't remove it for not fitting the sub.\n\nAt least next time you post it, I won't see it, since you already hit the 3 subs I follow.",
            "[removed]",
            "HAHAHAHA... he reported himself.",
            "I saw this same post on not today. How can we fast forward to today again?",
            "I feel like OP is leaving out details. There’s 3 versions of every story; your side, their side, and the truth",
            "[deleted]"
        ]
    },
    {
        "post_id": "mvcam8",
        "author": "marblechocolate",
        "title": "Douche gets more than he wanted, complains, then less than he wanted.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mvcam8/douche_gets_more_than_he_wanted_complains_then/",
        "score": 25291,
        "num_comments": 431,
        "created_utc": 1618998951.0,
        "selftext": "I've worked in bars for years and this has to be one of the best \"f\\*\\*\\* yeah!\" moments of my time.\n\nI worked with this guy who was always on it. Super smart, never lost for words, very funny and genuinely one of the most professional bartenders I've worked with.  This was an exceptional night.  We worked 2 to a station on really busy nights (like 3/4 deep kinda night) so I had a front row seat to this gem:\n\nGreasy douchebag is waiting in front of our station with his elbow on the bar not facing us.  Getting a little annoyed that he is blocking people getting served, Sam taps him on the arm, \"Hey, man!  You want anything?\" \n\n\"In a sec, mate.\" as he shoos him off and continues greasing on this drunk girl.\n\nStarting to change his attitude, Sam quips back  \"You are blocking people from the bar, man.  Shit or get off the pot!\"  (oooo...  I start to slow down.  Where's this going??)\n\nGreasy douche face screws up and looks Sam up and down.   \n\"Gimme a Coke\" he barks with no manners.\n\nSam whips a glass behind his back and catches it in his left hand, ice in the glass, glass on the bar and throws a straw in the air as he pours Coke from the soda gun.  \n\n\"$2.50 thanks\" as Sam spins around an enters it into the till.\n\nDouche is staring at the drink.....   \"What is this?\"\n\n\"A Coke... as you asked.\" Sam said with impatience and vex.\n\n\"That is not what I asked for...\"  he responded.   \"... If I wanted ice, I would have asked for ice!\" pushing the glass back at Sam.\n\nSam picks up the glass  with both hands and did something that I was not expecting.  **He apologised!** \n\n\"You are so right!  I am so sorry!  How stupid of me!  Let me fix that for you.\"\n\nSam grabs the soda gun, pours Coke all over the bar counter.  The douche jerks his arm away, not because he notices it, but because his shirt getting wet.  His anger, palpable.\n\n\"If you wanted a fucking glass, you would have asked for one!\"  Sam spouts as he throws a straw in the puddle, turns his back, walks off and flips the bird.\n\n&#x200B;\n\nMy hero",
        "permalink": "/r/MaliciousCompliance/comments/mvcam8/douche_gets_more_than_he_wanted_complains_then/",
        "comments": [
            "Give Sam my number. Sounds like my kind of guy.",
            "I worked security and as a bouncer and whenever racists shouted at my colleagues who were another ethnicity I would always ask the colleagues why they didn't tell me they were black/asian or whatever the racist had their panties in a twist about. \n\nTheir little brains spinning as they looked at us both...me a white guy saying to a colleague all indignant \"you didn't tell me you were black!\" \n\nWe used to double down and say we were the only gay security or door team in the area as well. Fucking halfwits would then explode so we could have fun 'ejecting' them.",
            "That's the great thing about a bartender doing this kind of stuff, they make 90% of their money from tips... and everyone that witnessed this will love him for it (and tip appropriately).",
            "The story is great but the unsung hero is OP's formatted writing, even the title: \"then less than he wanted\". \n\nReally nice post to read with your spacing too, I wish they were all written like this.",
            "Haha I remember serving a drunk douche like this once and when he asked for lemon in his coke, I just looked him dead in his eyes and dropped a whole lemon in his drink, making his coke overflow on the bar.\n\nHe was not even mad and ended up walking around with a whole lemon in his drink for the rest of the night lol.",
            "Epic.\n\nDo not fuck with a good bartender that is in the weeds.\n\nA good friend of mine is a great bartender. Nicest guy ever. But if he is swamped and someone pisses him off, watch the fuck out.\n\nAs a regular, I can spot it. The only thing to do is give him some quick, simple orders to get him back in the flow. No chit chat, no jokes. Order PBR. 1.5 seconds later, you are drinking it, and he is happy to actually be making progress.",
            "Sam sounds like a fucking legend.",
            "There’s one doctor (we’ll call him Dr. Jerk) at my hospital that is very arrogant and expects us (nurses) to read his mind. He then blows a gasket when we follow what he ordered as part of an order set (pre-selected tasks and meds and protocols and such) instead of doing what he REALLY wanted, like we’re supposed to know. One time a colleague of mine told me that Dr. called her  and was yelling at her over the phone over something like trivial and she cut him off to say “Dr. Jerk, I am not Mrs. Jerk, you cannot speak to me that way. Please call back when you’re ready work together respectfully.” and hung up on him. A little later he called back, a completely different and polite attitude. She’s my hero for that.\n\n-edited for typo",
            "Sam is doing the lord’s work and doing what every server/bartender wishes they could do.",
            "“greasing on this drunk girl”\nThis phrase is golden",
            "Reminds me of a story my Mom told me.\n\nShe worked at a fast food restaurant, in her teens or something, and had an encounter one day the pushed her over the edge.\nThe customer asked for a specific amount of ice in their drink (ie half ice or something), and she complied and handed the customer the drink. Well, I guess the customer thought there was too much, and handed it back to Mom with a whole glass of attitude as well. So Mom took the lid off the drink, reached in, grabbed a handful of ice, threw it on the ground, and then handed the drink back saying \"here you go\". Badass.",
            "When people would block the bar on busy nights, our barback would pull out a bar-rag and use the gun and pour water on the bar to get the idiots to move. They'd usually yell about getting wet and he'd respond,  I've got to clean the bar and you've been blocking this area for 20 minutes.",
            "Shit. Noice 👌🏻😂 I'm going to be so very specific about what I say next time I go out drinking lol. Jic 😉",
            "I did something similar once as a server when one of our line cooks was a huuuuge douche bag and always geeked out on coke. He started screaming at me to refil his Parmesan cheese (not my job) so I unscrewed the bottle, scraped it into a line and threw a straw down and told him to go fuck himself.",
            "So when I saw your title I got all excited. I was telling my best friend \"I know this story. This is a bartender story.\" But what I was *expecting* was a bartender getting accused of skimping on the shots in a mixed drink because he wasn't measuring, so he measures it out and oh, look, he was using two shots instead of a shot and a half. Here's your (lighter) drink! So I completely called bartender, but damn, I did not know where it was going from there! Thanks for the laugh!",
            "I don't get being rude, especially to people who are preparing/handling things that you're going to injest. Yall never seen 'waiting'?",
            "Reminds me of when I was a teenager.  I was at a church activity and one of the leaders asks me a favor, if I would bring him some water.  I complied, then emptied the cup on him.  \"You didn't ask for a cup.\"  He took it in stride, but got his revenge the following Sunday.  He had whoever was in charge of printing the Sunday service agenda put in that I would be singing a solo.  Didn't actually happen, he just wanted to see me sweat.",
            "I expect that moment to be stolen and appear in a movie within the next 5 years.  It is such a perfect little vignette of a moment.",
            "You just made my day!",
            "Now greasefuck, take your $2.50 counter coke and go go go ...",
            "Please give us more stories about Sam! He’s so cool I’m in awe",
            "Legendary!!!",
            "Is... is that allowed? Tell me he didn't get in trouble!",
            "I'm finding the Covid restrictions in my area are a god send in dealing with arse holes, because they can never follow the rules, so you can just immediately kick them out.",
            "Douche got his comeuppance. MCs like this are rare gems. 10/10 recommended.",
            "I will literally suck Sam’s dick. He sounds like a fucking powerhouse of a person.",
            "Legend!",
            "The legends are true. There is does exist the one true smartass come to guide us in the ways",
            "I’ve been in the bar biz for over 20 years and all I gotta say is... Fuck yeah, Sam.",
            "[deleted]",
            "[deleted]",
            "This is the best story of a douche getting served that I have ever read!",
            "As someone who has bartender for way too long, you have made my day. Thank you.",
            "Holy shit that is fucking amazing.",
            "To me, the best part of this is the straw.  It's here we see that Sam is a man who can appreciate the finer details.",
            "Love it, though I can't help thinking about how you've now got to deal with a sticky bar until people start to clear out",
            "Legend.  I had a similar coworker. Snappy retort for anything. Slayed the ladies.  Every time a popped collar douche canoe asked for a drink special he always gave them warm well gin.  Everything I needed to know about life I learnedin the bar...",
            "One guest won't come back, but every other person at that bar will definitely return. Give that man a raise.",
            "This is gold",
            "Oh God!!!  This made my day!  I think I love Sam!!!",
            "Happy cake day!",
            "I don’t believe a word of that story, but the writing made it entertaining!",
            "[removed]",
            "U should work for Netflix",
            "It might be cringe, then it gets weird.",
            "After a few drinks, I asked a bartender I was friendly with for Coke. He said he didn’t have any. I said, “Sure you do.” He insisted he didn’t. I pointed to the Coca-Cola and said, “No, A Coke.” Jolly laughter, a glass of the wet stuff and a generous tip ensued.\n\nHe soon pulled me aside and whispered in my ear that he had promised not to sell and only had half a bump left, but I could have it for $25.",
            "[removed]",
            "Can i have his number, im not looking for a relationship or anything this dude just seems cool",
            "YEAAAAAAAAAAAAAAAAAAAAAAAAAAH\n\n\\*explosions going off in the background\\*",
            "because he is so unlikable now.\"",
            "This is the guy",
            "I wanna be best friends with Sam",
            "I mean yeah, but then he gets busted.",
            "Thank you for sharing this story, had a good laugh. Happy coke day.",
            "Great story and happy cake day man",
            "Simple. Compliant. Malicious.\n\nThis better be Top All shortly.",
            "Your customer sounds like all the bartenders in my town.",
            "Excuse me but I think I’m in love.",
            "This was the best malicious compliance I have read",
            "I want to be like Sam when I grow up",
            "I want to go to this kind of bar",
            "Say it again Sam.",
            "That's awesome.",
            "Sam is worthy of being my barkeep.",
            "The customer also didn't ask for a straw. Sam was generous on that one.",
            "You can say fuck on the internet, little one.",
            "Ok, but that sounds like so much more work for the bar staff now. Whoever had to clean that up got way more punished than the douche did.",
            "> \"not because he notices, but because his shirt getting wet\"\n\nSo because he notices?",
            "Happy cake day and what an amazing guy",
            "[removed]",
            "So the problem was a guy at a bar was... standing at the bar? So the bartender poured coke on him?",
            "Happy Cake Day OP 🎂🎈🥳",
            "This is, quite possibly, the best thing I ever read today. Thank you!",
            "Douche shorts *and* classism- what is this timeline",
            "A god among mortals 🏆🏆🏆\n\nLmao who down voted this??",
            "i like slime, he seems like a tender.",
            "Please tell me you didn't report him",
            "So much ableist privelage in this thread. If Sam put peanut oil in the coke and the patron suffered from peanut allergies and complained because Sam almost killed him, would the appropriate response be to pour the laced coca cola on him? Well many people suffer from cold urticaria. A real condition that could cause a severe allergic reaction when skin (or god forbid an esophagus) is exposed to cold temperatures. \n\nPeople don't always ask for things a certain way because they are Karens. It could be life threatening if the bartender/server just decides to do things on their own willy nilly. Should we not go to bars & restaurants? Are they only reserved for \"normal\" healthy people. Please be more considerate.\n\n[https://www.mayoclinic.org/diseases-conditions/cold-urticaria/symptoms-causes/syc-20371046](https://www.mayoclinic.org/diseases-conditions/cold-urticaria/symptoms-causes/syc-20371046)",
            "NICE!",
            "Picks up the glass with both hands? Is \"Sam\" a recent hire at a Florida bar?",
            "The hero we need",
            "Finally somebody gets held accountable for this shit",
            "The Valar really need to add 48 more hours",
            "Omg.  This is absolute gold!",
            "BRAVO! Sam is the hero bartender we need but don’t deserve.",
            "Get 'em Sam!!!",
            "Sam is the GOAT",
            "I must learn this power!",
            "Wooooooow",
            "Happy Cake Day!",
            "“3/10. Bartender gave me my glassless coke, but put a fucking straw in it when I didn’t ask for one.”",
            "Hurrah for Sam!",
            "You know who the type im talking about.",
            "Shoulda put some cocaine on the counter in case it's still not good enough",
            "Perfection lol",
            "That was very big brain right there. Cheers to Sam!",
            "😂😂😂😂😂😂😂😂😭😭😭😭😭😭😭"
        ]
    },
    {
        "post_id": "i0kzgi",
        "author": "forshuregirl",
        "title": "So you need a certified copy of my bachelor degree that you just issued? No problemo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/i0kzgi/so_you_need_a_certified_copy_of_my_bachelor/",
        "score": 25232,
        "num_comments": 744,
        "created_utc": 1596111247.0,
        "selftext": "So, this is a little one, but it still fullfilled me with satisfaction.\n\nDuring my last semester of my bachelor degree I already applied for the masters degree at the same university. So I go through the normal application process and get accepted (yay!), but as I didn't have my bachelor degree at that point, I had to produce a certified copy of my degree as soon as I could. Yes, I had to give a certified copy of my bachelors degree to the university who issued that degree in the first place. And no, these were not different deparments. It was all done by one (!) lady in the examination office!\n\nBut whatever, weird bureaucracy is weird. And BOY was it annoying at that university. Because all students of my faculty had to got through one lady. And I think she just hated to do anything. Like, seriously, she was so annoyed when you showed up at her office to just do anything. When I turned in my bachelor thesis, she straight up said that she is so fucking annoyed that all the students turn their thesis in at her office. Well, we don't have another choice?? There is seriously not other way to turn your thesis in. And don't ever think about asking her anything...\n\nSo, I am already looking forward to picking up my bachelors degree (no we don't have a fancy celebration). Normally you would get an e-mail when your degree is ready, but as she fucking hates our guts, you just have to guess when it is ready. We don't get an e-mail. Two weeks after your last grade is put in the system, it is probably ready. So, I did just that. I show up at her office and horay my degreen is ready.\n\nLady: \"Here.\" (without even looking at me)\n\nMe: \"Thank you, I need a certified copy of that.\"\n\nLady: (really annoyed): \"Excuse me, WHAT?\"\n\nMe: \"I need a certified copy. Could you please copy it and certify that it is a copy of the original?\"\n\nLady: \"I know what a certified copy is! You can get that at the town hall.\"\n\nMe: \"I know, but I can also get it here. I know for a fact that you have to give me one if I request it.\"\n\n(5-second staring contest ensues)\n\nLady: \"\\*sigh\\* FINE!\"\n\nShe takes my degree back, turns around, copies it and signs that it is a certified copy.\n\nLady: (hands me the degree and copy) \"HERE!\"\n\nMe: \"Thank you. Now I would like to give you a certified copy of my bachelor degree for my application for the masters degree. (I hand her back the certified copy).\"\n\nLady: \"ARE YOU SERIOUS?\"\n\nMe: \"Yes, I thought if I am already here, I could turn that in as well. So I don't have to come back again.\"\n\n(Another 5-second staring contest)\n\nLady just takes the copy out of my hand and turns around. And with that, I lef with the biggest grin on my face.\n\n&#x200B;\n\nWhat did she expect? That I got to the town hall (15 Minute ride), wait there for probably 1-2 hours, get a certified copy that would cost me 13 Euros (at uni one was for free) and then come  back another day? HELL NO! Especially because she had the weirdest office hours ever. It was something like 2 days a week for 1,5 hours in the morning and one day for 1,5 hours in the afternonn. So I probably would have waited days to turn that in.\n\nBut her face when I asked for a certified copy was just glorious.\n\n&#x200B;\n\nEDIT: Ok, this blew up way more than I thought. I am glad to hear that I am not the only one experiencing it. And yes, this happened in Germany. But I can't tell the university without maybe getting in trouble. Also, thank you for the Gold, Stranger! :)",
        "permalink": "/r/MaliciousCompliance/comments/i0kzgi/so_you_need_a_certified_copy_of_my_bachelor/",
        "comments": [
            "Ugh. I had to do something like that once at work (government). I needed to fill out a form and give it to, we will call him Joe. So I fill it out to the best of my knowledge. I give it to Joe and he says “you need to fill out this field here”. It’s some ID number associated with my account. Ok, but how do I get that info Joe? Blank stares. Ok, well, I’ll try.\n\nBegin half a day of going to visit my coworkers, my boss, the floor admins... how do I get this number? Various iterations of “I don’t know” or “go talk to Bob”. “Try Linda.” I’m running around the office like I’m on a scavenger hunt. Which, of course, I am.\n\nBut alas, no luck, nobody knows what this number is. I go back to Joe and tell him, sorry, I just can’t find it.\n\nJoe stares at me for a few seconds. *Then he sighs, opens a drawer, pulls out a stack of paper, finds the magic number and copies it onto my form*.\n\nHE HAD IT THE WHOLE DAMN TIME.",
            "People who are upset that they have to do their own job....gotta love it.",
            "This reminds me of a friend... he was working on his master's degree, but decided not to bother finishing, and instead ended up working in a lab at the university for about 20 years. One day, he decided that he should finish that degree. One of the benefits of his job is that he can study for free if the field of study relates to his job. So he had to get the description of the remaining class he was taking, and have his boss sign off on it. As it happens, the professor teaching the class was also my friend's boss. So he had to sign off that the course description he wrote for a class he teaches relates to the field in which his assistant works. Fortunately, unlike in OP's story, the people involved in the circular bureaucracy here were more amused than anything.",
            "Sounds like my experience. You don't happen to study in Germany?",
            "When I applied for the masters program at the same university where I got my bachelors, they required the transcript from the 3 hours of credit I'd gotten at a community college during high school. They'd also required that transcript before I got accepted for my bachelors. The problem was, the community college had moved since then, and getting the records from them at this point was a huge problem. \n\nSo I had to try and argue with the person in this office that they already had the information. I'd given it to them 3 years previously. \n\nAnd they said, yeah, but that was when I applied for my bachelors. This was for my masters application. \n\nIs that a different office?\n\nNo, it's this same office.\n\nSo you already have the information, in this same office, but I have to get it for you again and bring it here? \n\nRight.\n\nEventually I figured out (with no help from the people actually working there) that if I filled out one of the dozens of forms over on the wall, they would give me a full official listing of my credits that went toward my bachelors, including their acceptance of the transfer credits from the community college. Then I went and got back in line with this new printout and handed it to the next person as evidence of the transfer credits, which they accepted. It was ludicrous.",
            "In HR lingo she's what we call a \"quit and stay.\" They essentially quit doing their job,  do just enough to not be fired and make everyone miserable.",
            "Seems like all our unis are the same. I  applied for my masters degree at the same uni and had to upload (the only application option was online) like 20 documents. Including my bachelors degree I got from them and things like a CV.\n\nSome days later I get a letter that my application has been received and a list of documents to provide if not already done. It listed all the documents I uploaded but also had a section about documents needed from students that did their bachelors with them, which was basically only 1 small document. *After* I had to upload all the documents to even be allowed to send in the application, you could literally not submit the application if you didn't upload everything.\n\nOh and our office lady was the same, down to the ridiculous opening times and hating to do any of her job.",
            "\"Thank you for renewing your car insurance with us.  We will need to see a confirmation of your No Claims Discount from your previous Insurer or your insurance will be void\".\n\nUm.......RENEWING my insurance...from the same insurer?  This should be fun.\n\"Sure, no problem I will get onto that straight away from my current insurer\"\n\n\"Thank you.  Is there anything else I can help you with today?\"\n\n\"Why yes there is.  I was wondering if you can help.  I have just taken out another year of car insurance and the new insurer is being a bit of a dick and demanding confirmation of my NCD from my old insurance company under threat of voiding my insurance.  As you are my old insurer, is that something you can help me with?\"\n\n<silence for several minutes>\n\n\"There wont be any need to present your NCD sir\"",
            "This story reminds me of when I tried to go get my bachelor’s degree in my school in France...\nSo they sent an email in June saying our degrees were ready (1 year after graduation, that’s just how it is in France) and that they were printed and ready to be collected at the school’s administration. At the time, I was doing an Erasmus in Germany and my classes weren’t over until the beginning of August. That time of year, my French school was closed, so I had to wait until mid-September or so to get the degree. Well, no problem, it’s the same for every Erasmus and they told us to come get them “whenever we could”. \n\nSo comes September. It’s Monday morning and I’m passing by my school to collect my degree. I get in the lady’s office and told her I was here to collect my degree and get this: she told me “oh but we don’t deliver degrees on Monday morning”. \n... Excuse-me, what?? How? Where is that specified? And most importantly... why?!\n\nI kinda frowned and responded “... but we received an email back in June saying the degrees were printed and stocked here. So you... just have to give it to me?” After staring at me annoyingly, she went to the closet and gave it to me in a matter of seconds. I left and never put my feet in this administration again. \n\nI just... sometimes, I swear, they do this with the ultimate goal to just complicate our lives as much as they possibly can.",
            "I used to have admins/counselers that help you choose the correct class paths act so fucking annoyed when they were two hours late to our scheduled meeting. I remember asking one one time, \"are you mad at me or something?\" and they snapped out of it lol",
            "It's beautiful how this issue seems to unite the University students of Germany. I had the same issue in Bavaria",
            "This reminds me of the home mortgage I just refinanced with the same exact lender I currently use, I was just getting a lower rate.\n\nThe underwriter grilled me for a letter of explanation as to who I was writing $1800/month checks to.\n\nUm, you guys. That's my current mortgage, with you, the one you're buying out, from yourself. Could you not, like, look that up?",
            "Is this at a German university? This is so German it hurts.\n\nI applied as an international and gave them an original copy of my transcript. Those are very cheap and easy to get to the point where no one at the uni for my bachelors will certify a copy cause the copy is already certified!\n\nNope. German bureaucracy insisted on a certified copy. What do you mean I gave them an original and verified copy? Buts its not certified!!!",
            "On one hand the bureaucracy sounds very German, but the lack of work ethic or pride in her job also seems decidedly un-German, so I'm at an impasse.",
            "Oh god, flashbacks to my days in college. I was applying for a concentration in my major and we only had a week to do it, everything had to be turned in by Friday. One of the requirements was a certified transcript showing you had taken the necessary classes for that concentration. Luckily the transcript office was like 30 feet down the hall. I walk over there and ask for a transcript. I was told they would not give me one, they had to mail it so I needed a address. I asked if I needed an address for the door that was RIGHT THERE! Yes, apparently. I said fine, I would find out the address, then they told me it would take 6 weeks, to get it 30 ft. I turned around and walked away. Went and told the dept head and his words were “well you should have known you would need one and ordered it 6 weeks ago” This was a Tuesday, he posted the requirements on Monday. I decided I didn’t really need to finish my degree and ended up dropping out shortly after. Literally doing ANYTHING at the school was like that. This is a pretty big college and I have never met anyone who went there who actually enjoyed it or thought it was well run.",
            "The biggest delays in our modern era are the result of putting off 30 seconds of paperwork.",
            "Years back when travellers cheques were a thing, I (Canadian) was buying some travellers cheques for a short trip to the United States. I told the teller that I wanted $400 in cheques and $100 in cash (or something like that). Teller told me they could only sell them in $500 (or whatever value they set) values for cheques but that I could buy the $500 and then cash in $100 immediately for US cash. Okay.\n\nIt took an HOUR to do this transaction just to buy the cheques. I have no idea why. Incompetence had to be involved. Anyway, at the end of the hour I added my second signature to $100 of the cheques and handed them back to the teller. She then asked me for photo identification to prove my identity. Fuck me. I talked to some low tier manager who gave me a toll free number to call to complain. Every person I complained to agreed it was stupid, but that they were following bank policy.",
            "TU Berlin?",
            "When I graduated I went to the ceremony with my cap and gown and went up on stage to get my degree. They give it in a cardboard tube. When I sat down and opened it there was no degree. Just a note saying see the Registrar.\nSo I go to the Registrar's office and am informed that I owe the University $35.87 (Approximately. It was in that range.) I say \"no way\" and go to the accounting office to see what the balance is.    \nThey tell me they owe me about $16.00. Again I say \"No way\". I was a Comp Sci student and new how to handle my payments.    \nSo they say \"Go to building X. Go to the basement and talk to the woman in the last desk on the left.\" I do this. She listens and says come back in a few hours. When I come back she says the balance is 0 and hands me a note to give to the Registrar.    \nI go back to the Registrar's big, wood paneled office and hand him the note. He swivels in his big leather chair behind his big oak desk, rummages around in a cardboard box that holds about 10 cardboard tubes, finds mine and gives it to me. I have officially graduated.",
            "YOU are asking ME to do the job that I am PAID FOR ??!!!",
            "Was that Freie Universität Berlin - Economics? Because it sounds like that",
            "When I started teaching I had to get a temporary teaching license from New York. There was an office building in Brooklyn where I shuffled from room to room getting stuff stamped and approved. My next stop was room 28 which turned out to be a large desk in a hallway with two gentlemen sitting behind it. The first gentleman approved my paperwork, stamped it and said \"room 28A\". That was the guy sitting next to him, white line dividing the desk, ingraved plastic sign and all.",
            "Some people legitimately don't want to work and they should all be fired.",
            "I work at a university and these people are the bane of my existence. I have to teach them new business practices and it's beyond exasperating. People like her think that they can justify their job by being the only person who can do something and they are somehow more valuable because they're the only person who remembers how things used to be done back in the stone age. Weird thing is that they're not all old people who have been in the position for a million years.",
            "That was perfectly executed.",
            "At the state school I went to, doing anything at the business office was a hassle.  Everyone was just treated as numbers, so I started referring to myself by my student ID# whenever I talked to them.   Every time the conversation went: \"Are you Turnout? No, I am *student ID number.\"  \\*confused look\\** \"You treat all the students as just numbers, so I thought keeping my real name out of this conversation would be easier.\" \\*Queue shitty look\\*",
            "Well done! I was 90% sure that this has been taking place in Germany, and you confirmed it in another comment. Absolutely relatable, we might have even been to the same university but experience has told me this is not a singular phenomenon but rather typical of how some of our miserable administration people handle things. I believe something’s broken in them for sure and people with a contempt for other people seem to end up in offices dealing with people, somehow.",
            "I think the only thing you could have done to complete the icing on this cake would be to ask her for a signature and date stamp on a letter stating that she has received the certified copy, *just in case* it should happen to go missing...\n\nIt's wonderful when you can have the opportunity to force the hand of someone that chooses to operate in this manner.",
            "You make the Vogon proud.",
            "You know, if she just did her job it would go so much faster.",
            "You honestly should keep a log of her attitude and turn it in/report it to the right department. If she doesn’t want to work, she shouldn’t and someone who wants to work should take her job.",
            "Sounds like she hates the burocracy of it all.\n\nSure sounds like a miserable existence.",
            "Years ago my husband and I owned a towing company. We needed paperwork from the DOT and I finally got ahold of the administrator for that department. I didn’t have a fax machine or printer at the time (not uncommon at that time) and we didn’t do anything by email either. I needed her to send me almost 300 pages of information and documents that she very obviously did not want to be bothered with. I finally got her to print them off and mail them but wow, civil service people can be difficult to deal with.",
            "Until you said euro I thought this had to be the same office lady as at mine in the states. Everytime you asked her to do something that was literally her job, her response was *loud sigh* \"FINE!\"  \nShe nearly caused me not to graduate because she didn't file a bit of paper along with my thesis. The thesis showed up in the system, but not the form that apparently had to go with it, and I went into her office and she found it on her desk - and I was like THEY WERE STAPLED TOGTHER how did you not get this right? I too was applying to grad school at the same uni, and so it nearly messed that up too.  \nApparently she has clones that work in universities across the world...",
            "\"Stop making me work\" - that woman",
            "University bureaucracy is hilarious.\n\nI had a similar experience with a work-hating departmental secretary...I was getting some transfer credits accepted as class equivalents to fill a major requirement. If you transferred credits, they counted as general credits, but if you needed them to be a specific equivalent, you had to jump through a bunch of hoops.\n\nYou had to have:\n\n * A copy of the syllabus, certified by the department who taught the class you were trying to get credit for.\n * A copy of your transcript, also certified by the department to make sure your grade was high enough to be counted\n * A letter from the department saying they accepted it as equivalent, and which *exact* classes it was equivalent to.\n * Some paperwork through the Dean of that colleges office, certifying that the other people knew what they were talking about.\n\nThen you had to take all that to the Dean of *your* college, and they'd give you credit.\n\nI knew what they'd do. They'd go down that list, and tell you you needed the first thing you didn't have, but not all the other things you also needed. So you'd go and get the thing they said you needed, and you'd get it and come back, and then they'd tell you the *next* thing. I'd have had to go to the department in charge of the class like three times, with three different sets of paperwork.\n\nBut I was wise to their tricks by then, and I looked up what I needed, and got it all done before I went to my Dean for the first time. I walked in, and I said, \"I need these courses to count toward this degree requirement.\"\n\nAnd the secretary did *exactly* what I thought she would, with just the sort of dismissive sneer that would have been completely enraging if I hadn't planned ahead.\n\nBut I had, and I pulled out each document just as soon as she asked for it, and got all the way to the end without missing a single one, and then got to watch while she had to fulfill my request *right then*, without being able to run me around at all. Absolutely the peak of my college career.",
            "would the town hall even have had the record right away? she was probably counting on getting rid of you for a week or two while they got their copy.",
            "Ugh my school did this too. Had to take an English comprehensive test for nursing. They mailed me the results and I had to drive them back to campus to turn them in myself - 1 floor down - the envelope had to be unopened to be accepted or it was invalid",
            "I just had my Royal College of Surgeons degree certified in Philadelphia, USA in order to have it recognised by the UK General Medical Council.",
            "This sounds so much like Germany... literally all secretaries at the university just hate their job and students with a passion",
            "“You want me to run everything by you? Well lace up them runnin’ shoes, because I’m about to do a marathon.”",
            "I hate bureaucracy so much. Universities are some of the worst offenders.",
            "Remind me so much my Uni in France. Same angry and lazy lady who didn’t want to do the work she was paid for.",
            "Why do I feel this is Germany?",
            "Gift that woman some eye drops for losing two staring contests after 5 seconds",
            "Haha, this literally happened to me at my university when I signed up for my masters program, just with slightly different details.\n\nI went to turn in my fees for my masters and they informed me that I still hadn't turned in my transcripts and that I couldn't be officially enrolled in the program until they had them on hand. But I literally just graduated from the same university, why don't you have them on hand, I asked... well, that's not their department. I have to go downstairs.\n\nSo I literally had to go downstairs in the admin building, get a copy of my final transcripts, walk back up a flight of stairs and give it to another person. Like, fucking seriously? Why the fuck do you need me to get a certified copy if you're in the same god damned building?! It's not like they charged me for the copy or anything (you get a certain number of copies for free per year - it's either two or three as I recall).\n\nFucking nightmare bureaucracies that universities are...",
            "I had something simple happen when I went for my Masters.  They needed copies of transcripts to admit me for my Masters when I had already submitted them for my undergrad.  It’s in the dang file people.",
            "She sounds a bit bitchy, but I can understand her a little bit. She‘s just a deskslave and they usually don‘t come up with these idiotic rules, but have to follow and enforce them. It‘s usually their bosses who have the bright ideas but have never to suffer through those bright ideas.",
            "This doesn’t just happen in Germany. There was only one adviser for my department who was so categorically unhelpful I actually had to research and tell her how to do her job multiple times. One of those occasions, she still didn’t get it, so *I filled out the form she needed to authorize* for her and that, too, got fucked up somehow (I think she signed it but didn’t submit it on time or something). Everyone really loathed her and most just avoided getting the help they needed. I eventually complained to the university and the department head and encouraged others to do the same. In my last year, they finally hired a second adviser. It was glorious.",
            ">But I can't tell the university without maybe getting in trouble.\n\nWhat? Get in trouble? With whom? Do you not pay for university in Germany with your own money? As someone with a good number of college professors in my circle, I endlessly hear about the fear students have of reporting anything untoward or demanding basic services. These professors are frequently frustrated when students complain about the university's practices because they themselves can't complain but the students are the customers and are the only people who would get results if they used their positions as such.",
            "Bureaucracy is bureaucracy. Most bureaucracies have this kind of glitch in the at least a few places.",
            "There’s no way you would get in trouble for complaining about this. These people want your tuition money.\n\nWhat a stupid fucking bitch.",
            "Someone turn this into a tifu sex fantasy please?",
            "As part of permanent visa application, I've had to submit a Statutory Declaration (like a Sworn Statement or Affidavit) that states the medium of instruction and examination of my degree in English Literature (Honours)...was English!\n\nThis is to prove that I have functional English (level 1 of 5). The visa that I'm currently on required proficient English (level 3 of 5).",
            "Lisbon university? This hits home in so many ways....",
            "I work at a university and this sort of lack of desire to do anything, lack of desire to improve processes, massive pointless bureaucracy, and shitty attitude is pretty damn common.  From what I'm starting to gather it's systemic across a lot of universities.  But of course, the pay sucks compared to market rates for roles so it isn't shocking why people are like this.  Pick any of those reasons as to why I'm looking for a new job.  This will be my last and only job in a university.",
            "If I was that lady I would be offering if anyone needed a certified copy since I could do it here for free. I’m sure some people actually do go down to the town hall and come back another day...",
            "I can't imagine what it's like having to give your university a copy of the degree they issued. I'm also doing my masters at the same place and I just had to click a button that I am saying they already have the relevant records they require. Easy as Sunday morning.",
            "If I had the spare $$$ I’d give you some gold. The bureaucracy can get so ridiculous sometimes.  Cheers to you!",
            "this womans chain of leadership should be notified of her attitude.\n\nthe college should have 3rd party audit done to the application process. what happens if this person up and dies or quits?",
            "Sounds like we went to the same school. When I finished undergrad, they held onto my diploma and claimed they didn’t have my home address to send it to. They certainly knew where to send my tuition statements though...",
            "did you also ask her for the Passierschein A38?",
            "I absolutely hate the kind of people who grumble at doing the bare minimum of their job. Like what the heck were you expecting when you were given your job description? It's not everyone else's fault you hate your job, just do it",
            "This has to be RWTH Aachen, the bureaucracy is insane and the staff are always pissed off at everything",
            "I was helping an international student to get his student card, we waited in a long line to reach a lady who should have his card. She denied and sent us to international students office, and they said \"How it can be here? We cannot even produce cards\" and sent us back to another lady. Finally that lady found the goddamn card, which is ON THE FIRST LADY'S GODDAMN DESK.",
            "Damn. Bachelor's degrees are so normal in Germany, they don't celebrate it!\n\nIn the US it's more like... Hurray! Now I have to pay for this! I hope it was worth it!",
            "What’s funny is we had “that lady” at my university.  Fortunately, she was pretty nice, but it was a surprise to have a flashback to that office!",
            "I studied Informatik in Germany, in Oldenburg, and we had the lovely Ms. Ring that pulled a leg out for us! Completely different experience.",
            "That just Kafkaesque! I got one or two certified copies of my degree automatically. Never even needed it. Every company I applied to did it electronically, so I just scanned it and sent it via e-mail.",
            "Lady definitely could have a better attitude about it. But blaming her for the system's insane set up, is likely unfair. This is probably how her boss, or boss's boss, has things set up and she is just the poor (although less than kind) soul who has to do the work.",
            "I honestly don't get people like this - why are you doing this job if you hate literally every part about it?",
            "behold the horrible beauty of red tape\n\nglorious, isn't it?",
            "What do you want to bet that she \"loses\" it and you have to do it all again?",
            "Argh. I hated that when I worked in graduate admissions. We had the same rules for all applicants - which was for equity. \n\nBUT the university screwed over its internal applicants something CHRONIC with the bureaucracy. \n\n😢😢😢",
            "I cannot tell you how happy this made me- there’s a lady at my unis admin who is exactly the same",
            "This is deliciously petty!",
            "I pity the woman. She has to live with herself every day. Nice story",
            "How unnecessarily bureaucratic. I used to work at uni in Australia. For any internal applicants for honours or post-grad courses, we'd just use an internal transcript.",
            "This is one of the best! I also want to add that at 41 I still have to deal with folks like this regularly. Up until a few years ago I always approached them with dread. But recently I decided fuck it. I stroll up and kill them with kindness. I'm grown, if they respect me then I respect them. Otherwise then I return the favor.  Don't let people walk on you just because you are kind.",
            "Is it university of Bremen? Because it fucking sounds like it.",
            "She got schooled",
            "\"Ugh, FINE, I'll do my job!\"",
            "How sad her life must be to be stuck working a job she clearly fucking hates.",
            "What a proper cow lol",
            "Literally dozens of them!\n\nCongrats, but seriously.",
            "This is glorious.",
            "Out of pure curiosity, were the words \"This is not possible!\" ever uttered in this office at any point you ever had to go there?",
            "Trying to get you ready for life outside the university.",
            "Double check that she doesn’t “accidentally” “lose” your paperwork.",
            "In the US, you have to pay 30$ each for those, get duplicate copies, and submit them to the same department....",
            "I too once had to do my job, how’s this lady so special?",
            "Without even reading the edit I knew this was Germany!  I did a year at Johann Gutenberg in Mainz and it was SUPER weird how the office hours worked and what their paperwork process was....CRAZY!",
            "I KNEW IT WAS IN GERMANY",
            "I'm not sure if Kafka is smiling or generating electricity from his grave.",
            "Am I a Karen for wanting to complain to her manager on your behalf?",
            "Deutschland? Bei mir läuft es ähnlich...",
            "Oh my yes I live in Germany too and the people at the Studierende Verwaltung are grumpy as heck",
            "After reading the first few sentences I just knew this would have to have happened in Germany. Bureaucracy in Germany is the weirdest shit, I honestly hate it haha.",
            "German here: 100% real red tape... \n\nTo reply, please fill out Passierschein A38 first",
            "Can’t wait till I can get degreen.",
            ">Lady: \"I know what a certified copy is! You can get that at the town hall.\"\n\nThat's not how it works (at least, not in America). All the town hall can/will do is certify \"This is a copy of that. I have no idea what that is or where it came from, but this is a copy.\" I can print up my own birth certificate, go find a government official, and get a \"certified copy.\"\n\nWhat you needed was a university official to certify that the document itself is valid. How is your town hall going to do that?",
            "Turn her in to the department chair. No one should have to deal with that. Administrative staff do not get tenure like the profs do.",
            "LOL. Good one !",
            "I wish I could’ve seen this exchange.",
            "Germany?",
            "This is like the text version of the Samuel L Jackson starring at the grinning cat meme. I love it!",
            "Are you by any chance in France?",
            "What a horrible lady, she sucks at her job",
            "Is this germany? It sounds alot like our weird system.",
            "this isn't malicious in anyone's eyes but hers. (or other insane peoplee)",
            "I love those working hours. Our ladies were the same. We had two of them, but they were extra nice.",
            "Hihi I had to do the same! In my case the young lady thought is was funny :p",
            "This sounds like Germany, right?",
            "Enjoy your 'degreen'",
            "Hahah this was amazing! \n\nAlso congrats on your bachelor's degree (I'm about to get mine in January!)",
            "That desk lady sure sounds like the life of a party",
            "Oh this is just delicious.",
            "Congrats.",
            "I had thr same situation (getting a masters from the same place as my bachelors but they are taking their sweet ass time with it) all i had to do was place a phone-call, they looked up what courses i had and then fixed it. Took 5 minutes :p"
        ]
    },
    {
        "post_id": "70pwlt",
        "author": "BitchCobbler",
        "title": "Asked my husband to put the pillowcases on the pillows.",
        "url": "https://i.redd.it/0rjvp8k93imz.jpg",
        "score": 25211,
        "num_comments": 361,
        "created_utc": 1505679030.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/70pwlt/asked_my_husband_to_put_the_pillowcases_on_the/",
        "comments": [
            "Your husband is a graduate of the philosophy that if you do a job too well, it's yours forever. ",
            "I hate your husband at work",
            "[deleted]",
            "You should just put your pillow in the pillowcase...let him fend for himself",
            "\"Ok wiseass, put the pillows *INSIDE* the pillowcases.\"  \n  \nComes back to find pillows sandwiched between the pillowcases. ",
            "My husband does that shit too.",
            "[deleted]",
            "\"Put the pillows on the bed the put the pillowcases on them\" is what I can imagine you saying ",
            "This guy programs",
            "This would be funny to me if I didn't know that married women (even professional and working women) do the lions share of the work done at home. ",
            "This is how divorces happen. ",
            "[deleted]",
            "Is he lazy, dumb, or trying to funny? ",
            "Give him a deconstructed dinner and see if he thinks that's clever",
            "This is more malicious incompetence than malicious compliance. ",
            "that is not a good sign for your marriage.  \nI wish you the best of luck. ",
            "I can imagine myself doing the exact same thing and being serious about it. I have a tendency to take things very literal sometimes lol\n\nI remember a couple of years ago when I was working in a convenience store, my boss told me to \"go put the meat in a bag and then put it away\" (the meat was in a plastic Tupperware container) and without thinking much about it, I literally dumped the meat out of the container and put it directly in a plastic bag and then put it away. I don't think I've ever felt any slower...",
            "This isn't even malicious compliance for me. I'd do this too, but only because the instructions weren't specific enough. ",
            "https://www.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic",
            "This seems too easy to fake to be faked XD",
            "We might just be married to the same person.",
            "Put him on the curb",
            "Well that was your first mistake. Be specific :)",
            "I'm not seeing the problem here? Request fulfilled, please provide booze.",
            "Where did you hide his bo...no, don't tell me!",
            "Those look like nice pillows. I wish I could find some that don't fall flat after six months.",
            "This is how you properly have your pillows \n\nhttps://i.imgur.com/vogvM0R.jpg",
            "Good man ",
            "he did as you asked ... what more do you want ?",
            "u/natmeng this will be me",
            "You might want to buy a pregnancy test, he's showing symptoms of being a dad.",
            "He will get the hose.",
            "Cat.",
            "Lol something Amelia Bedelia would do, I'm sure",
            "i fail to see the problem here..",
            "I'd break up with him",
            "Dudes got mad listening skills.",
            "You got what you asked.",
            "The oldest trick in the book 😂 It's not that I'm lazy and can't be asked to do what you asked me to do, it's that I'm just a stupid man who can't be relied on like you intelligent superior woman.",
            "Seems to me he delivered exactly what was asked of him. Below budget, ahead of schedule, no scope creep. What more could you ask for?",
            "Guess you guys have a baby on the way.",
            "He's technically correct....the best kind of correct",
            "I am fairly sure that this isn't malicious.\nSource: I am a husband",
            "Delegation without proper instruction. Husband management 101, failure. ",
            "He probably though \"strange request\" but just did it because he loves you. I have done similar things an been told off for taking things too literally. Next time maybe 'put the pillows in the pillow cases' would work better. I would like to think he was genuine, but it is possible that he was just being a dick",
            "He did what you ask. ",
            "A true hero",
            "Saving this one for the next time I'm asked to put the fitted sheet on the bed.",
            "You need way more pillows.",
            "Isn't that sort of thing the woman's job?  Kidding.  Some guys are stupid or just jackasses.",
            "/r/MaliciousCompliance",
            "Do you want more prepositions? Because that's how you get more prepositions. ",
            "Your husband and I could be pals",
            "Well,he did ",
            "He got you there",
            "Divorce",
            "showed this to my gf. said she would kill me if i pulled this sass",
            "So after you both had a good laugh he came back in and put on the pillowcases properly, right?  ",
            "This is 100% what my boyfriend would do",
            "Welp. Time to file for a divorce.",
            "Get a divorce. He's clearly evil, and will teach your pets to keep one paw in the room you tell them to get out of",
            "This guy obviously likes sleeping on couches",
            "This is why, in my house, we use the word \"equip\". \n\n\"Please equip pants\".",
            "Just throw the whole husband out 😂",
            "Thought I was on r/madlads for a second!",
            "1.  Take out life insurance\n\n2.  Smother him with pillow when he sleeps\n\n3. ...\n\n4.  PROFIT!\n\nO_O",
            "LOL. DAE husband retarded? Lol. Me 2.",
            "r/NotMyJob ",
            "honestly leave him",
            "/r/notmyjob",
            "My wife knows better....pillows in the pillowcases...that preposition nazi",
            "I see he did exactly what u told him to ;) ",
            "Your husband deserves a firm handshake followed with a head nod.",
            "He's practicing his dad jokes... hint, hint. ",
            "The trick is to act just incompetent enough that they stop asking you to do things. I pride myself in this balancing act.",
            "If you are like my wife, you clearly asked for this and you are rephrasing your command now.\n\nI can perfectly see myself in that situation asking myself \"Why on earth does she want that? Whatever, I'm not opening the Pandora's box by asking\"",
            "This is something my SO would do. He hates laundry. ",
            "Oh, you meant AROUND the pillow.",
            "My husband would do this. ",
            "Honey i know its going to take more effort to ask than do it myself but im no feeling fully in control today,  maybe this will help.. Harold i washed the pillow cases,  they're not going to put themselves on the pillow now are they harold... Little shaming mix.. You feeling ok today harold? Ahhhh my feeling of control is back ",
            "When Amelia Bedelia is life. ",
            "Ok so it's not just mine then. 😕",
            "Would you happen to be pregnant?",
            "I've done similar dumb things....\n\nMy mom: Put the towels in the dryer when they're done washing\n\nSo I did.....the next morning she asked why I never turned the dryer on. I mean, I did follow her instructions of putting the towels in the dryer!",
            "I don't get it....what's wrong here? ",
            "I see that he did exactly what you asked. Sooooo, what's the problem then?",
            "I laughed out loud... GJ!",
            "Not my job bro",
            "I would leave it just like that too ",
            "HE WAS CLOSE, THE ITEMS NEEDED WERE CLOSE TOGETHER",
            "My friend did something similar when his mom asked him to run the vacuum cleaner through the room",
            "r/notmyjob",
            "Checkmate.",
            "Literally........................ ",
            "Subscribed!",
            "R/notmyjob",
            "Yep, this seems about right!",
            "your welcome",
            "At least he did half of the job.....right?",
            "[Reminds me of this](https://imgur.com/VBb4lXm)",
            "Savage. ",
            "Why didn't you do it yourself? ",
            "He'll get to it, jeez\n"
        ]
    },
    {
        "post_id": "8jpdtw",
        "author": "mastorms",
        "title": "His name was Charles...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8jpdtw/his_name_was_charles/",
        "score": 25202,
        "num_comments": 602,
        "created_utc": 1526419962.0,
        "selftext": "\\[Edits at the bottom.\\]\n\nThis happened to me, circa 2004. Warning: This story is NOT funny. Malicious Compliance of a different color. Changed my life for the better. Still gives me chills.\n\n\\-\\-\\-\n\nWorking McDonalds Drive\\-Thru. No speaker. Two order windows and a third pickup window. Charles is working Window 1. I'm working Window 2. Charles is black, ripped, tall, huge, has prison tats all down his arms, somewhere between half an ounce or two of fat on his body. Picture Terry Crews with darker skin and black tats to the wrists. Charles is equal parts charming, soft\\-spoken, humble, and ambitious. He knew where he had been and was determined to change his life. Probably one of the best men I'll have ever met.\n\nEnter Green Minivan...\n\nWe had both taken orders at the same time and mine was long gone. Charles' order was taking FOREVER. Probably 4 minutes just taking the order before payment. I come over to check on Charles. Before I get close I notice he's blocking the frame of the window so I can't hear anything. It's an awkward position for him and blatantly obvious. He moves his hand out to me out of sight of the van and gives me the stop sign. \"Back off.\" Got it. Time passes. Manager on duty comes out to check the issue. He waves her off. She protests, I tell her to wait and see. Something is deeply wrong.\n\nSuddenly, Charles points the van down to the other window and LEAPS into action. Slams the window, shoves past us without a word, and races to the third window. Manager and I look at each other, check for other cars \\(none\\), then follow at a distance. Manager had been running the order but Charles took over and personally handled every part of the order with the speed of a madman and quality of a 5\\-star restaurant. He grabs a new batch of fries. He has the cook triple check each burger. He breaks a cardinal rule of the store and shows the van all the kids' meal toys we have for personal preference. Drinks and condiments are handed out and Charles gives them a genuine smile and enthusiastically thanks them for being customers. \"Have a great night. We'll see you soon.\"\n\n\\-\\-\\-\n\nCharles waits until they are out of sight before returning from the window and visibly shaken, walks back to his register. Manager starts to fuss about an explanation she's owed but Charles just says he can't yet. His legendary zen calm is severely damaged. After a few minutes to get a drink, wipe the sweat off his face and compose himself he opens up. Van had rolled up. Charles had greeted them with the usual: \"Welcome to McDonalds, what can I get for you this evening?\" and his winning smile. White father driving waits for Charles to finish and with a loud sneer had turned to the wife and for all to hear said: \"You order, Hun. I don't talk to N\\*\\*\\*\\*\\*s!\"\n\nWife turns to the two young kids, probably 8 and 10. Impressionable. Learning. Watching. They had locked eyes on Charles. They'd seen his tats. They'd listened to the hateful otherizing of 'those people' from birth. Charles decided that he had it within him to reach for something better. Father be damned, he's long gone. Charles decided that he had a message for those boys. The wife patiently and sheepishly took the excrutiatingly and needlessly complicated order from the father and then had to speak past him to Charles. Same for the kids. Light mustard. Three pickles. Etc. Perfectionism.\n\nCharles reached down inside himself for something that neither I nor the manager possessed and he gave the wife a genuine smile as he whipped out the order. The father knew he had been served a dish he thought impossible to serve. It was served with kindness and compassion and a compliance that defied everything he'd told them about 'those people.'\n\n\\-\\-\\-\n\nThe kids both waved to Charles from the back of the van as the father pulled away. They liked their new friend.\n\n\\-\\-\\-\n\n\\[Edit: \\-Wow. I'm deeply honored at the responses this got. I was thinking a few hundred might see it and say it was neat.\n\n\\-Thank you for the gold. I'm honored to be a witness to what Charles did and to honor his story.\n\n\\-It really happened sometime between 2002 and 2004 in Arlington, Texas. The dates are fuzzy because I was a dorky college kid \\(17\\-18ish\\) and was dealing with lots of other issues at the time.\n\n\\-Here's a Google StreetView from 2008 that shows the store as it was. The layout was weird. Window 1, Charles' register for ordering, was facing West. Window 2, dorky college me's register, further down the curve of the building facing SouthWest. Window 3, pickup food and drinks facing South. [https://goo.gl/maps/pA4aGK8oW272](https://goo.gl/maps/pA4aGK8oW272)\n\n\\-For those that have asked what makes this MaliciousCompliance, I've had \\~15 years to think through it all:\n\n1. The stated intent was for Charles to be forced to serve them in a degrading and humiliating manner. The spirit of the order was goading and baiting Charles with an impossible task. Racist, Asshole Father \\(RAF\\) wanted Charles to slam the window in his face. Simply DOING HIS JOB was a slap in the face of the request. Ergo, Malicious Compliance.\n2. RAF had thought he was clever by making his reprehensible statement, but what he'd also done was write a check that his wife was forced to cash. RAF wouldn't dare sully himself by deigning to speak with one of Them, but he'd ordered his wife to do his dirty work. By taking the order, Charles was humiliating RAF and allowing RAF's demand to debase his own wife in front of him. By dragging the order out 'to make sure we get it right' he made the wife add insult to injury by repeating things from RAF to her to Charles and then back again.\n3. In my mind's eye, I can picture Charles staring very intently at a sweaty, greasy RAF as Charles holds his hands out waiting for payment. I can imagine Charles gently holding her hand mere inches from RAF's face and then placing the change back in hers. You won't talk to me, therefore you'll have to watch as I touch your wife with my hands, right in front of your children.\n4. The last part of the order was also the most crucial. If any part of it had been less than perfect, the magic would've been lost. Charles made sure that nobody else handled anything for them. He was responsible for EVERYTHING being perfect. That's why he hustled. The order was made excellent by Charles doing all the work. You hate black people, yet every bite of this meal is going to be the best meal you've ever had here because I MADE IT BETTER.\n5. The RAF drove off with his tail so tucked it must've hurt. His wife had been dragged through the mud by his own demands, some black guy had made friends of his own children, and the coals from Charles' fire had been heaped onto his head, again, all in front of his own family because of his idea of being snarky or funny and racist.\n\n\\-I wish I knew where Charles was or what happened to him. I love the idea of seeing where those boys went and what impact he had on their terrible childhoods. This is Reddit though. Arlington, Texas, 2002\\-2004, Charles from McDonalds on Matlock and Sublett.\\]\n\n\\[Edit 2: I mentioned Charles explaining to the Manager, Payal, what had actually happened in a comment and included it here for closure. \\-I left out the manager's reaction afterwards. She freaked out on him and demanded to know why he did that when she was supposed to slam the window in the dad's face. He was still cooling off with a drink but stood up to his full height and stared her down. He's like 6'3, she was 4'11 and suddenly felt her size. That's when he explained that what he did wasn't for Charles, her, me, the dad, or even 'that poor woman he's got speaking for him.\" It was for the boys in the back and ending ignorance with him. \"If I had responded with anger, I'd have proved him right and he could turn to them and say 'see? They're nothing but angry N\\*\\*\\*\\*s.' I gave them a message. I might be the first black man to ever show them something better.\" \\(Severely paraphrased from 14\\-15 years ago but that whole thing is seared into me.\\)\\]",
        "permalink": "/r/MaliciousCompliance/comments/8jpdtw/his_name_was_charles/",
        "comments": [
            "God DAMN this may be the best thing I've read in this sub yet.",
            "That's some turn the other cheek shit right there.",
            "Adding Charles to my list of role models along with dogs, Bob Ross, and Mr. Rogers\n\nGodspeed, Charles. You makin all of us proud.",
            "Way to go Charles! ",
            "I think a part of his plan was personally touching everything.  That would drive the father insane, also.",
            "Dude, you had me so fucking worried that it was some people from his past that had caught up to him. Fuck me, I was worried for Charles for the whole duration of this story.",
            "I think Charles just became my role model. Let him know some of us are rooting for him. \n\nThis really resonates with me, my ex fiance's father was a full blown racist, prior KKK. He changed everything after two years of dating his little girl and watching me be the best man he could ever wish for her to have.",
            "Next time I have to deal with an ignorant asshole I’m going to ask myself: ‘what would Charles do?’",
            "[deleted]",
            "I want to buy Charles a beer.",
            "This is some Daryl Davis stuff.\n\nhttps://www.huffingtonpost.com/entry/black-man-daryl-davis-befriends-kkk-documentary-accidental-courtesy_us_585c250de4b0de3a08f495fc\n\nhttps://old.reddit.com/r/IAmA/comments/uo2qv/i_am_daryl_davis_black_man_who_befriended_kkk/\n",
            "[deleted]",
            "I got really scared that this was a hostage situation or something and your friend might have died and saved you guys. So relieved it wasn't",
            "I read your \"not funny\" warming and was about to stop because i figured itd be said. But it was the opposite.\n\nBigotry is sad, for sure, but what Charles did... That's absolutely beautiful.\n\nThank you for writing this.",
            "\"Never wrestle with pigs. You both get dirty and the pig likes it.\"\n\nGood thing Charles ain't the pig.",
            "Holy *shit*, Charles is a damn hero.",
            "Man, this was a touching story.\nIt is SO hard sometimes to be more than what people expect. To greet hatred with love.  Charles, wherever you are, we'll pay it forward.",
            "This story deserves about 5 million upvotes.  Sadly, I can only give it one.",
            "Charles is a legend",
            "MLK Jr looks down and smiles. ",
            "Charles is by far a better person than I am.\n\nYears ago when I worked for McDonald's, I was back in the drive\\-thru booth. The crew member next to me \\(who's name I sadly forgot\\) was taking orders for the 2 lanes our store had, and I was at the window handling the money for each order. At some point, a car pulls around and a lady is driving it. She pulls up to my window, looks at me, looks into the store and sees my co\\-worker, and loudly exclaims \"Well had I known a \\[n\\-word\\] was taking my order I wouldn't have come here!!\"\n\nI don't know if my co\\-worker heard that, but I was PISSED. He was a refugee from Somalia, and working at McDonald's because he thought it was the American Dream and wanted a better life for himself and for his family. I narrowed my eyes at the lady and through gritted teeth, asked her to repeat herself because I wasn't sure I heard that right. She did. I had heard her right the first time. \"Us whites have to stick together, right?\" she added.\n\n\"No. We don't. Since you clearly don't have a shred of decency within you, you can just go somewhere else.\" I replied and closed the window, then locked it. She hadn't paid for her order yet, so I zero'd it out and informed the managers on duty what she had said and what I had done. She stood there yelling at the window for a bit, and even tried to bang on it, but I didn't budge. I didn't even look at her. Eventually, a manager opened the window and told the lady to GTFO and not come back.",
            "Hope that redneck bastard choked on his fucking big mac.",
            "I grew up with blatant racism and bigotry. Rather than turning into a racist/bigot myself, what actually happened was the furthest opposite you could get. Each hateful word made me more empathetic toward the marginalized. Each off color joke made me more defensive of their character. As I got older, early to mid teens, I’d push back more and more, challenging their ‘beliefs’ to the point I got into a somewhat physical altercation with my stepdad over it. Imagine a 36 yr old man in a shoving match with his stepdaughter over his racism. I’m glad to say neither of my parents have a racist bone in their body today. I did my part. I re-raised them in so many ways, but this one is my proudest ‘mama’ moment. There is only a slight prejudice toward LGBT groups left that  I’m working. The problem there is just a lack of education and understanding at this point, but we’re almost there. What they don’t know, though, is that their beloved grandchild is gay. Boy are they gonna be surprised when it’s finally time for them to find out. ",
            "He didn't kill it with kindness. He tactical nuked it from orbit.",
            "Oh man I was so worried for Charles ",
            "Killin' him with kindness. Absolutely amazing.",
            "Why do people think black people are inferior? As far as I've ever thought was that their skin had evolved to better protect them from the sun. I don't think I'll ever understand the prejudice and hate, and I am sorry Charles and other black men and women have to put up with such attitudes. Kudos to Charles for handling the situation with grace and using it to hopefully teach a few life lessons. I hope one day people become better. ",
            "The best posts here are those where the offending party ask himself \"Why did I said something like this?\" when he got \"served\" with the results. This is one of the best examples.",
            "Excuse me, i didn't come here for the feels! Take my updoot",
            "Charles for president",
            "Damn Charles... you really were in charge all the time",
            "I wanna meet Charles. He sounds like an amazing dude.",
            "I'm imagining Charles as the real life John Coffey. ",
            "Yeah!  Kill ‘em with kindness!  Show those kids how wrong and hateful/pathetic their father is.  Sometimes the best “revenge” is making some bigot’s kids go against them.",
            "Dude had something to prove. ",
            "He's a stronger man than I would've been.",
            "It hurts to know genuinely nice people have to deal with that. Hope Charles is doing well these days.",
            "Charles went beyond.  Charles won a spiritual battle that day.  There’s no way to defeat someone like that.  Charles is a goddamn saint.  ",
            "This hit me harder than Wonder Woman!\n\nWE CAN BE GREAT!",
            "I hope he was the employee of the month for that alone. Hero among men.",
            "Here it is. The best thing I'll ever read on Reddit.",
            "This sub needs a hall of fame.  And this needs to be in there.  This is the ultimate.",
            "This is so heckin' wholesome! I don't think I could have done what Charles did. ",
            "All hail Charles, the best person",
            "Great story, well told.  Thank you. ",
            "I just want to hug Charles now. He is a good man.",
            "I specifically ordered no onions... dammit... :')",
            "Putting aside the great story, this is beautifully written, OP.",
            "We need an AMA with Charles and see what he's up to today!! ",
            "Fucking Charles ...BRAVO !!!!!   BRA fucking VO !!!!  ",
            "That man deserves a goddamn medal. ",
            "AMA request: Charles and those boys in the backseat. ",
            "Goddamn. Charles is the man every man hopes to be.",
            "I would love to buy you and Charles a drink.",
            "Wish he ended it with \"you three have a lovely night\".",
            "When you said Charles was blocking the window I thought _for sure_ that some asshole was aiming a gun at him and Charles was trying to protect you.\n\nNever been so glad to be wrong.",
            "Possibly one of the greatest stories I've ever read. I'm mixed, black dad, white mom. I've seen and heard mild racism, but nothing on that level. I have friends who have though. A friend working at a lumber type store was called a nigger to his face, took it in stride, and did his best to help the customer. It's up to us, and all like Charles, in this world, to make tomorrow better. I hope that Charles will eventually see this, and feel all the love and respect that people are pouring out to him.",
            "Mental note,  Stay the fuck out of Arlington, Texas.  ",
            "Holy shit, that's like 30 minutes from me! I'm a Ft. Worth kid, who somehow ended up going to school in NY.\n\nSadly, the kind of attitude expressed by the father is common, in my experience. Especially when you get out into west Texas.\n\nI grew up hearing my Papaw (I know) call Tiger Woods, Niger Woods. Never thought anything of it. one day, it clicked. And I realized how wildly racist they are and how casually I absorbed it.",
            "Grew up in Arlington. That McDonalds while not in an entirely rough part of town isn't in the best part of town. Good on Charles for how he handled the situation.",
            ">That's when he explained that what he did wasn't for Charles, her, me, the dad, or even 'that poor woman he's got speaking for him.\" It was for the boys in the back and ending ignorance with him. \"If I had responded with anger, I'd have proved him right and he could turn to them and say 'see? They're nothing but angry N****s.' I gave them a message. I might be the first black man to ever show them something better.\"\n\nFuck, I'm crying now...",
            "Charles deserves all the good karma. No one deserves to be treated like that. ",
            "This story was incredible! Racism is sadly still a thing. your friend has his head in the right place and a head level enough to take the brunt of it long enough to teach those kids an important lesson. They were given the opportunity to make up their own mind. Racism probably ended with that generation in that family! \nWell done Charles",
            "Not malicious at all.  Is there some sort of wholesome sub this could be posted to?",
            "The beauty of this is the dad must’ve been livid and likely taken it out on his family, further reinforcing the fallacy of his stereotypes in his kids’ minds. I’d like to think that in the intervening years those kids have paid back in spades for the valuable lesson learned.",
            ">This story is NOT funny.\n\nIt kinda is though",
            "Anyone can be a dick...but it takes a real man to put forth the effort to do what he did...i hope he's alright...because it would have been easier to take the low road and do something nasty and lose his job....he should be commended for his actions. Bravo man! ",
            "You guys should have said, \"well we dont serve to racists\" would have been nice ",
            "Fuck man this is some incredible shit. Team Charles. ",
            "This almost made me want to cry. So beautiful. Charles had the right attitude about how to deal with racism. We should all follow his example. Bless him wherever he is. ",
            "[deleted]",
            "I know this is late AF but I have to say something. I'm from the DFW area as well and know exactly where matlock and that McDonald's is. I can't believe that happened around here. I know bigots are everywhere but still. Fucking horrible people everywhere. I just have to say not all of us Texans are like this! Idk if I could handle that situation as well as he did. And I'm just a pasty white guy who can't stand bigotry like this. \n\nIf I was that manager I'd be banning him from my store for life.",
            "I wish I could upvote Charles a million times over. Such strength!",
            "Jesus fuck he Shokugeki-No-Soma'd that order.  In a goddamn McDonalds.",
            "I need to hug a black man named Charles. ",
            "What a legend! Godspeed Charles ( ಠ ͜ʖ ಠ)",
            "Black man? \nI'm calling the police.",
            "My friend worked at that location for a couple of years I'll be sure to share this with him!",
            "Charles didn’t react that way to defend himself, he reacted that way for the children. God bless you Charles!",
            "If this post doesn't at minimum make it to the first page for top of all time I will be upset.",
            "You left out the part where his pubes ended up in the burgers.  \nSeriously though, even if you're incredibly racist, why act like that to someone who is *serving you food*?",
            "[deleted]",
            "yea this is the best post this sub has ever seen. ",
            "Wow dad! You just have to be mean and you'll get really good service?!1? /s",
            "Where is Charles today?! We need an update. ",
            "Dam  this is raw. I cant understand why these prejudices need to be perpetuated in society still. Assholes everywhere :(",
            "After the week I've had, this brought so much joy to my heart.  I'm never gonna forget Charles's story.",
            "charles if a god damn god. he is the jusus within us",
            "Wherever he is, I hope Charles is still the same gracious and noble man.   I hope he is ever blessed.  ",
            "This is the definition of killing with kindness. Charles is a damn Saint. ",
            "Tell Charles I wish I was half as composed as him, and that he's a fantastic person.",
            "Wow. You won't joking about the chills.",
            "More people in our world need to read about this. They need to understand that human beings that are different from them deserve to be treated with respect if there is ever a chance of making the world better. Hats off to Charles for he person he is becoming and props to you Op for your ability to tell the story. Thank you!!",
            " Fucking amazing. What a great guy, very few people on this Earth would've handled that so graciously. ",
            "Jesus, with the way you started it, I thought Charles had died defending you...  I'm happy with the way it ended, though. :)",
            "Just came home from a long shift in a crappy mood after dealing with crappy customers all day. This made me want to cry. In most cases it would be a back and forth between the customer and employee for something like this and so easily could have turned violent but no. He turned this around into a lesson to be learned not only for the wife and children or the \"man\" in the van, but for himself. He made this a positive experience despite being called that fucking word. He did it because he knew he was better and wasn't going to let some ignorant idiot bring him down. Charles you damn hero you made my night.",
            "Fuck.\n",
            "This is a beautiful story. ",
            "I have tears in me, guys. So proud of Charles. Another great person to look up to and emulate! ",
            "Amazing story. I got chills reading it. He’s part of the man I strive to be. \n\nI’m hopeful Charles is out there somewhere and the internet does it’s magic so he reads this post. It’s very obvious to me he’s touched many lives. ",
            "Heartwarming - thanks, OP.",
            "That was a one two punch and you've touched my frozen heart.  Well done.",
            "Man Charles is a Fucking badass ",
            "Sounds pretty funny to me",
            "my name is jeff",
            "I like Charles too.",
            "I love this. Good for him. He swallowed one of the hardest pills life has to offer him, along with his pride, and did everything he could to try to leave an impression on those kids. I hope it worked. I hope they rejected what their father was trying to teach them.",
            "God. Damn. That man has the patience and temperament of a saint. I'm not even black, but when I had customers throw around the n-word, I always kicked them out. But his reaction? Beautiful. ",
            "Brilliant.",
            "Charles you’re a god damn hero. I hope you still keep in contact with the guy and if you have parted way I know he’s somewhere better in life. ",
            "8 20 am and I'm crying",
            "I wans to meet charles, shake his hand and buy him a drink. The man deserves a peace prize.",
            "This is the best and worst thing I’ve read in a long time. If you’re still in contact with Charles, tell him that Reddit collectively knows him as a good man.",
            "Charles is probably one of the coolest people on Earth. I hope he's doing well in life and that he a genuinely kind and lovable man :)",
            "What a man, this is honestly one of the greatest posts on Reddit. ",
            "His name was charles paulson",
            "The world needs more like Charles. \n\nThanks for the lesson Charles- i am more humble today. I bow down to you. ",
            "Weird....my heart feels so warm.",
            "Now I want to be Charles's friend",
            "That's next level compliance.",
            "o7 Charles.\nIf only we had more people like him.",
            "Damn Charles, killing them with kindness!",
            "That dude has legendary character. With all the intimidating strength and looks he has, he chooses to use completely opposite means to an end. Not even just walking away, he somehow channeled all his energy into making the best positive impact he could, even though it was just a fast food order.\n\nI feel like there's some kind of fortune cookie proverb for this, like:\n\"No good deed is insignificant\"",
            "Here I am thinking there’s going to be a shootout and Charles was trying to protect everyone. This is so heartwarming. I really hope for Charles has amazing opportunities in is life. He sounds like a genuine, sincere, and all around stand up guy. ",
            "You made it sound like this dude was somehow gonna get robbed, shot, or kidnapped. ",
            "Charles Dicketry! ",
            "Charles must've done something to the driver if he refused to talk to him - a nagger...",
            "This some Tarantino shit. The Hateful Eight, or Django unchained? ",
            "This is both malicious and wholesome compliance. One of the best stories i've ever read here.  \nR/wholesomecompliance",
            "My god this was amazing, I was spellbound throughout the whole thing. ",
            "If we had more people like Charles, this world would be such a better place :)",
            "Thanks for your story",
            "I think one of you nerds with the Google-Fu should reunite these two so Charles can know what a positive effect he had on OP and the rest of us.",
            "That was beautiful. Good on you, Charles. Wherever you are now, I'm hoping that your balance, composure, and outmost clarity of mind had brought you to a better place in life. ",
            "this puts a smile on my goddamn face. the best way to deal with a racist is to destroy his resolve. ",
            "Can we use some Reddit magic and find Charles to credit him?",
            "I hope he reads this. All of them. Bit Charles especially. ",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/halloffame] [Malicious Compliance: Racist Asshole Father gets his pride rekt.](https://www.reddit.com/r/HallOfFame/comments/8kq2x8/malicious_compliance_racist_asshole_father_gets/)\n\n- [/r/pantheonofheroes] [The Post that started it all: \"His name was Charles...\" from r\\/MaliciousCompliance](https://www.reddit.com/r/PantheonOfHeroes/comments/8jvili/the_post_that_started_it_all_his_name_was_charles/)\n\n- [/r/therealhero] [Charles.](https://www.reddit.com/r/TheRealHero/comments/94sg2d/charles/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Well deserved gilded post!",
            "This is amazing. This is how ignorance is stopped. Not through fighting, violence, etc.",
            "A lot of people commenting they thought he was blocking a gun or something.  I actually thought his woman was in the van and he was getting a blow job. 😉",
            "I hope Charles is doing really awesome somewhere today.",
            "Wow. What an awesome man is Charles. This honestly brought tears to my eyes. Thank you for sharing this. ",
            "Holy fuck that was handled well! Staying calm in the moment like that must have taken a lot of effort. Charles is one badass dude! I love that he took it upon himself to try and change their view too (instead of just slamming the door in their face...even though I bet that would have felt good!). ",
            "Charles is a super hero!",
            "He reminds me of the man from the Green Mile in prison and huge but kind as could be putting everyone looking at him to take a real look and think.",
            "Sounds the dad was a real McAsshole.",
            "Satyagraha. kill em with kindness.",
            "Endless respect to this man.",
            "His name is Charles... and he's a heartbreaker. ",
            "Just wondering, do you still talk with Charles? He seems like a great guy.",
            "Having never met this man, I can honestly say there is no one I respect more than him. ",
            "This really impacted me. You were truly privileged to know a man with this strength of character. I know I'll be thinking about this story for a long time...especially the next time I'm tempted to lash out at someone for some trivial moment of disrespect against me. Thanks for sharing.",
            "Is there a /r/halloffame?\n\nIf yes, ADD THIS POST THERE\n\nIf no, WE HAVE THE FIRST POST...",
            "Wow that was amazing. What a beautiful human being. ",
            "I miss Texas and miss this McDonalds.",
            "To say that Charles is a better man than me is a massive understatement. ",
            "Fuck's sake I live in this city and know where that is.  Lived here all throughout the 00's too.",
            ":Crying now: Amazing story of a good guy, by a good guy. Thank you.",
            "Charles is the hero Gotham deserves. That's downright Biblical of him.",
            "Charles is a certified badass mother trucking fucker",
            "Nope unfortunately he came way after you did 2013 to 2015",
            "Wish I had the money to buy this one gold. I’ll settle for upvotes and sharing instead",
            "AAaaaannnndddddd crying at work, that's a first.  But seriously, THANK YOU for sharing this.",
            "That was beautiful. I hope Charles is doing well ",
            "That man is legendary. I wish I had whatever he was made of.",
            "Wow this story sent chills down my spine. What a man that Charles is!",
            "I'd give gold but I'm poor :(",
            "Legends will speak of the name charles",
            "I know I’m late to the party but damn, I used to live in Arlington (a few cities over now) and I remember that EXACT McDonald’s.",
            "Aw, sorta wished I knew what happened to Charles. Hope he's doing alright. For reference, how old was he at the time?",
            "Charles sounds like a god!!!",
            "*This story is NOT funny*\n\nI was like oh shoot. Realized it’s probably serious. \n\nI read. \n\n\n\n\n*Enter Green Minivan*\n💀 I died laughing and idk why",
            "Charles is my hero and I don’t even know anything about him beyond that he spent some time in jail, is ripped, soft-spoken, and is able to rise above. ",
            "What ever became of this hero known as Charles?",
            "Wow, this might be the least malicious thing I've seen on this sub. I guess racist dad might have been embarrassed, maybe.",
            "Too bad McD doesn't have real crow pie or he could have served a freebie to the father just to spite him.",
            "[deleted]",
            "[deleted]",
            "Unnecessary cruelty (whether it be racism, sexism, or just being a jerk for no reason) really bothers me. Charles handled himself amazingly well. We need more people like him in the world. And less like RAF.",
            "Excellent writing sir, I couldn’t stop reading. I feel like Charles is *my* buddy after reading that. I’m sure you’re both awesome people. Unfortunately WHITE TRASH like that driver will always exist. Scumbags. Charles was the better man by 10,000 %. Give him Reddit’s regards.",
            "I somehow doubt this",
            "CLAPCLAPCLAPCLAPCLAPCLAPCLAPCLAPCLAP.  Charles is a legend",
            "Twist ending:  Charles slipped the wife his number, then banged her later on. Wife left her husband and remarried Charles, who helped raise the kids. Kids call him dad. \n\nRacist asshole dad, having ruined his entire life, eventually puts a shotgun in his mouth and pulls the trigger with his big toe. Nobody notices he died. \n\nThe end. ",
            "[deleted]",
            "That is NOT how I expected it to go.\n\nFuck me if it wasn't awesome.  And god damn it.  I am a MAN, and that brought the beginnings of a tear to me eye.",
            "[deleted]",
            "> \"You order, Hun. I don't talk to N*****s!\"\n\n🧐 Saying this in front of a black guy in 2004? Hmmm... I don’t really believe it, but I’ll give you the benefit of the doubt, I guess...",
            "And those kids? Grew up to be Abraham Lincoln. ",
            "This sub regularly hits front page but I usually skip past the long reads and I find the malicious compliance is rarely satisfying as it is usually too unrelatable and literally feels like just someone getting something off their chest that was really only important to them.\n\nBut I have already read this twice and balled both times. Good job on the brief intro. ",
            "Charles is the real hero here! \nI'm a 35 year old white chick who works over the phone with travelers, when I get a phone call that starts out with some one complaining I make it my goal to get them to THANK ME by the end of the call. However when I talk to upset folks it's normally due to an experience they have had in the past or that they have had with another government agency that I have no control over. In 15 years I have only been been judged by the color of my skin once (someone yelled at me over the phone to \"enjoy my white privilege\" before hanging up on me- it was unprovoked & this person just wanted to yell at someone... it happens when you work for the state & answer a toll free phone number.).\nI struggle to imagine treating folks like this with dignity when they judge others based on the color of their skin. Charles is the real MVP!      ",
            "I hope this is forever the top malicious compliance ever!!!",
            "This is incredible. What an absolutely stellar human being. I am so glad he was so courageous as to show those children the value in seeing a person for who they are, not for the colour of their skin. He would have had every right to slam the door and walk off, but he didn’t, and that is so inspiring to me. \n\nRacism makes me sick to my stomach. I can’t truly understand what it must feel like to be on the receiving end of it, I can only try to sympathise, empathise, and fight against it\n\nThank you so much for sharing this.!"
        ]
    },
    {
        "post_id": "sopcb0",
        "author": "ArtfulMortician",
        "title": "Chick tries to gatekeep my nationality? Time to ascend to a form further beyond!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sopcb0/chick_tries_to_gatekeep_my_nationality_time_to/",
        "score": 25150,
        "num_comments": 1567,
        "created_utc": 1644444359.0,
        "selftext": "For context:\n\nI am a 20 something British-American male living in a very southern and undereducated part of the US. I have been here for a while now and generally when I tell people where I am from, I get a little push-back because I don't really have as thick of an accent anymore.\n\nOnto the story:\n\nI work in a small office, we have a rolling line of temps that come and go, most of them are barely high school graduates or people with very little in the way of worldly experience, this is important for later.\n\nSo one day, they bring to usual parade of new-hires around and I do my introduction\n\n\"Hi I am OP, I am one of the recruiters here at Company X. I am married with two dogs and I am originally from the UK.\"\n\nNormally, this is just a throwaway line that I use as an icebreaker and it normally rolls right off. Until this one wonderful young woman pipes up,\n\n\"Um, you don't sound Bri-ish (She, of course, left out the t very purposefully.)\n\nMe: \"Sorry love, forgot the coat and tails at home.\" I say as I drink my Twining's.\n\nThe group kind of laughed it off and I figured it was a pretty open and shut deal.\n\n**Nope.** \n\nA couple of days later, word gets around that this chick has been telling a bunch of people that I'm not British and that I'm \"lying for clout\". She said that I don't even sound British and that she is dating a British guy and \"knows how they act.\"\n\nSo, rather than be a mature adult, I do the very British thing of *Malicious Compliance*\n\nI need an intern to bring me some tea? \"Would you mind climbing the apple and pears and pouring me a cup of Rosy Lee?\" \n\nI started wearing 3 piece suits, a pocket-watch and a monocle I found at a thrift shop. I went **Super-Saiyan 3 British**\n\nObviously about 3 hours into the first day, my boss wants to know what is up, I tell her and she finds it so hilarious that she assigns that intern to me for *the rest of the day* I kept using odd British rhyming phrases and sayings and she would have to keep asking me to \"speak normal\" \n\nI would reply, \"But I thought you know how us British people act.\" \n\nShe quickly realized her error and we've been cordial ever since.\n\nNowadays, I keep my old red passport in my desk drawer just in case someone pulls that stunt again.\n\n**And for the record, I'm not British, I'm ENGLISH, and a Scouser at that!**",
        "permalink": "/r/MaliciousCompliance/comments/sopcb0/chick_tries_to_gatekeep_my_nationality_time_to/",
        "comments": [
            "You could talk like John Bishop. She'd need subtitles.",
            "Well-fucking-played, old chap.",
            ">I am married with two dogs\n\nJust wait until she starts in on your canine polygamy",
            "In the early days of tech support being shifted to India, I was working at Dell Headquarters in Texas. The guy who sat behind me was from London. \n\nNormally, this wasn't very noteworthy. He just had the most interesting accent on our team. But, one day he gets this lady on the line who is really upset because she called home support first and her call was sent to a call center in India. \n\nAfter fun with cross-continental and cross-departmental transfers, she's on the phone with Phillip, and I hear half of this conversation...\n\n\"Excuse me? Yes, this is Dell Headquarters in Austin, TX.\"\n\n\"Well, yes, you're correct. We're technically in Round Rock, TX, but most people don't know Round Rock, so I usually say we're in Austin. Yes, I'm sorry.\"\n\n\"No, I'm being honest. I'm in Round Rock right now.\"\n\n\"YOU WANT TO TALK TO SOMEONE WHO SPEAKS ENGLISH‽ I AM AN ENGLISH MAN!!\"\n\n...he transferred her back to India.",
            "Being both English and British is the price you pay for having four countries in your country.",
            "A Scouser using Cockney rhyming slang? God, you lot'll nick *anything*, won't you!",
            "You should have just spoken Scouse.\n\"Dey don't do dat doe dooday\"",
            "Used to work with a pasty fella, some years ago, went by Chris. He loved, I mean, LOVED, filling out papers, as oftentimes they wanted ethnic background boxes checked. And he very clearly had a moderate accent normally, but went full off the rails when excited or angry. He always marked the African American box. He is American by citizenship, since 1995. Welsh by heritage, as his folks were Welsh. And African by birth, specifically South African. But, alas, no box to tick for South African.  Folks would give him grief, and he always came back with asking them to explain how he is wrong. Is it wrong for someone born there, to claim being born there? \n\nCuriously enough, the only coworkers that took issue … were the white ones! Imagine that.",
            "A scouser?! You sure that's your passport?\n\nI keed, I keed...!",
            "I've had the opposite problem.\n\nI'm from a very southern part of the US. After graduating from college, I took my first trip abroad. Wanting to save money and also have a good time, I stayed in hostels. Most of the other people were Australian, British, or spoke British English. \n\nThree weeks in, a couple of lads, English, showed up at the hostel. After chatting for a while, they said, \"You're from <Specific part of England>, are you?\" \n\nThey refused to believe I was American until I pulled out my passport.\n\nAfter I went home and got back to work, a new coworker asked me how long I'd been there. Turned out that she meant in the States, not at that job.\n\nI checked with some friends after that and they confirmed that I was \"talking funny\". Apparently, I had unknowingly and unintentionally developed a rather convincing regional English accent during the trip that took a week or so to go away.",
            "I remember being in a mall store getting a Xmas gift and hearing the sales lady with a particular British accent.     I recognized it but could not place the source initially.\n\nThen I finally did.   When paying for my item, the sales lady was the one was working the cash register.\n\nI asked her, \"Does the phrase 'All Creatures Great and Small' mean anything to you?\"  \nHer face lights up and replies that yes, it does.   She grew up in the Yorkshire Dales area and new the TV show.     She was very surprised to have someone know where she was by her accent.\n\nCould I have done the same if she was from Cornwall or Norwich?  Probably not.   But thanks to PBS in the 70s I could!",
            "Yer get this sort of thing all the time. As I am Scottish 2nd gen army bratt raised in Lancashire, you can imagine my accent. Well you would probably be wrong, it is randomly posh just to confuse people even more. My mum went to an army school in Germany that insisted she speak properly, so she lost her accent and I ended up picking up her accent up when I started school. It really does not fit in anywhere, especially as my sister has a strong scottish accent and my chameleon brother picks up accents everywhere.\nI have even been told by someone that I cannot be scottish because I don't have a scottish accent and it would be like her claiming she is Irish when only her mum is Irish and she has never lived there. Unlike my scottish parents and grandparents etc plus living and spending lots of time there.\nI could of started spouting doric all day to mess with her:\nhech, that wifie has me trachled with all her bleetin and a dinnae ken what she's havering about.\nAlso any excuse to say fairy boots in a sentence.",
            "I think the thing I loved the most is the rhyming slang. As an Aussie, we like a bit of that too.",
            "I am extremely impressed that you found both a pocket watch AND a monocle in a thrift shop in the same trip!",
            "Seriously hilarious. I received the same stupidity when My father died so we moved back to small town, Kentucky in the heart of the Bible Belt from Sunny Diverse, California.  Because so lived in Cali all my young life, I didn’t have an accent at all. And I was actually born in Small Town, Kentucky. Anyway, a kid from the next town over asked me where I’m from. I said the towns name & he said, “England?”\n\nTalk about a major face palm. 😂🤦🏻‍♀️\nSO many towns in Kentucky named for European countries.",
            "As a Southern American whose bestie is a member of the Commonwealth, I salute you. That is freaking hilarious.",
            "Smashing good time",
            "But your red passport is British, not English, and if you are a Scouser, why are you speaking in cockney rhyming slang?",
            "Cheerio!",
            "Bloody scousers....",
            "Even a Welshman respects this 🖖",
            "I say, bloody brilliant there, old bean.",
            "Pip pip you scally.",
            "> I went Super-Saiyan 3 British\n\n<3",
            "Mate, that's a fun story but I think you missed a golden opportunity. If you went full scouse I'm pretty sure you would be completely unintelligible to them!",
            "Hilarity ensues. I love it.",
            "As another English person who is now living in the US BRAVO!!!! INDUBITABLY WHAT WHAT WHAT.",
            ">I went Super-Saiyan 3 British\n\nlol\n\nI'm seriously trying to come up with something else to say, but that line was such perfection with the picture you drew in my head...\n\nlol",
            "LMAO at lying for clout in a southern town in SMALL office. People just talk to hear the sound of their own voices.",
            "Upvote for being a Scouser",
            "Two points made me laugh. \n\n1) Rather than be a mature adult, I do the very British thing of Malicious Compliance. That right there is exactly what the Brits do. \n\n2) I just imagine some manager coming in to see your three piece suit. “What the fuck is this”\n\n3) Passport is Maroon, and if you didn’t complain about how it used to be a better blue before this whole euro nonsense your clearly not British enough.",
            "Did anyone ask you to go back to speaking American?",
            "\"Super Saiyan 3 British\"\n\nI'm just imagining Lord Grantham with long golden hair and energy aura",
            "> She quickly realized her error and we've been cordial ever since.   \n    \nThat right there is aggressively British! Lol, well played!",
            "As a Scouser you should have just put their car up on blocks and sawed off the cat",
            "I thought the archetypal phrase for a Scouser in a suit was, \"Not guilty, your honour\".",
            "Well, that’s aw’right then, innit. Laters!!",
            "[deleted]",
            "[\"Don't ever call me fucking English again.\"](https://youtu.be/ySD0u4RXXcI?t=111)",
            "What the actual fuck is a Scouser doing using rhyming slang?",
            "Her: \"Speak normal.\"\n\nYou: \"Sorry love, you rogered the boogley on the pinch punch first of the month, had to call you on the codswallop, and make you take the biscuit on the sticky wicket.\"",
            "I'm British, in my 30s, and have lived in America for nearly 10 years.\n\nThe only time I've had pushback was when an old boy on the phone told me I needed to learn to speak English.\n\n*\"Speak English? I AM English.\"*",
            "English people are in fact British",
            "English not British.  \n\nWelsh it.  You Scot to be kidding me.  Irish I could come up with some better jokes.",
            "Dude, put on a THICK scouse accent and they won't be able to understand you. Like someone else said, do a John Bishop",
            "American by location but TEXAN by birth. But we all love to hear y’all talk! No disrespect intended— but just find an accent fascinating. ( cause we don’t have one)😎",
            ">I am a 20 something British-American male living in a very southern and undereducated part of the US.\n\nI am so, so sorry...",
            "British people don’t drink twinings",
            "that's just good fortune",
            "Good show old boy!",
            "A Liverpuddlian?! GASP!",
            "Ahhhha, I’d have tried some local slang! Tara Tara love!",
            "This is gold! Also want to be your coworker now, especially since the boss lady looks like a fun one.",
            "\"Freshen yer drink, Guv'nor?\"",
            "Well done, mate. I'm also from a very Southern state (think Sweet Home) and spent a year in Liverpool for my Masters degree. Scousers are some of my English speakers.",
            "OK, but the monocle put it over the top. Delightful. ❤️",
            "\"...southern and undereducated...\"\n\nThe Department of Redundancy Department would like word.",
            "No you're not, there is only London, all poms wander in-between Terry-Thomas and Michael Caine. The rest of the country is a lie to justify regional theatre.",
            "My grandfather was an Earl and an O. B. E. so that makes me an earlobe.",
            "I'm Australian. While living in New Haven, Connecticut, I got asked \"Which part of the south are you from?\" To which I replied \"Pretty far.\"",
            "If your a scouser, why didn't her car end up on bricks? 😉",
            "I love it. It took me a moment to translate \"apple and pears\" and \"Rosy Lee\" into \"stairs\" and \"tea\".",
            "Next week, he'll be wheeling the purple bins out and ending every sentence with 'la'",
            "LOL my Grandparents , bless them, were English. Grandad was London cockney by way of Wales and Gran was from the posher parts of London by way of  Southampton. It was hilarious when they got going , especially if they were excited about something . Grandad would slip into his cockney and Gran would be sounding posher with every word she spoke. Anyone who didn't know them was probably hard pressed to understand a word they were saying hahaah",
            "Did she expect full cockney? In that case...\n\nFaw con'ex':\n\ni am a 20 some'hin bri'ish-american male livin in a very sou'hern an' undereduca'ed par' ov 'he us. I 'ave bin 'ere faw a while nah an' generally when i 'ell people where i am from, i ge' a li''le push-back because i don'' really 'ave as 'hick ov an accen' anymawe.\n \non'o 'he stawy:\n\ni wawk in a small office, we 'ave a rollin line ov 'emps 'ha' come an' go, mos' ov 'hem are barely 'igh school gradua'es aw people wi'h very li''le in 'he way ov wawldly experience, 'his is impaw'an' faw la'er.\n \nso one day, 'hey brin 'o usule parade ov new-hires around an' i do my in'roduc'ion\n\n\"hi i am op, i am one ov 'he recrui'ers 'ere a' company x. I am married wi'h 'wo dogs an' i am awiginally from 'he uk.\"\n\nnawmally, 'his is jus' a 'hrowaway line 'ha' i use as an icebreaker an' i' nawmally rolls righ' off. Un'il 'his one blinder young woman pipes up,\n\n\"um, you don'' sound bri-ish (she, ov course, lef' ou' 'he ' very purposefully.)\n\nme: \"sawry love, fawgo' 'he coa' an' 'ails a' 'ome.\" i say as i drink my twining's.\n \nda group kind ov laughed i' off an' i figured i' was a pre''y open an' shu' deal.\n \nnope.\n \na couple ov days la'er, wawd ge's around 'ha' 'his chick 'as bin 'ellin a bunch ov people 'ha' i'm no' bri'ish an' 'ha' i'm \"lyin faw clou'\". She said 'ha' i don'' even sound bri'ish an' 'ha' she is da'in a bri'ish guy an' \"knahs 'ah 'hey ac'.\"\n\nso, ra'her 'han be a ma'ure adul', i do 'he very bri'ish 'hin ov malicious compliance\n\ni need an in'ern 'o brin me some 'ea? \"would you mind climbin 'he apple an' pears an' pourin me a cup ov rosy lee?\"\n\ni star'ed wearin 3 piece sui's, a pocke'-wa'ch an' a monocle i found a' a 'hrif' shop. I wen' super-saiyan 3 bri'ish\n\nobviously abou' 3 'ours in'o 'he firs' day, my guv wan's 'o knah wha' is up, i 'ell 'er an' she finds i' so 'ilarious 'ha' she assigns 'ha' in'ern 'o me faw 'he res' ov 'he day i kep' usin odd bri'ish rhymin phrases an' sayings an' she would 'ave 'o keep askin me 'o \"speak nawmal\"\n\ni would reply, \"bu' i 'hough' you knah 'ah us bri'ish people ac'.\"\n\nshe quickly realized 'er erraw an' we've bin cawdial ever since.\n \nnowadays, i keep my old red passpaw' in my desk drawer jus' in case someone pulls 'ha' stun' again.\n \nan' faw 'he recawd, i'm no' bri'ish, i'm english, an' a scouser a' 'ha'!",
            "To be fair to the poor girl, if you’re a scouser you don’t TECHNICALLY speak English, so she was probably confused by the multiple languages being thrown around. /s",
            "Love how some people equate British to how often you use cockney rhyming slang.... \n\nSays the Scottish lass who no one believes is actually from (city) because I moved a lot and my accent reflects that 😂",
            ">I am a 20 something British-American male living in a very southern and undereducated part of the US.\n\nBut... *Why?*",
            "Should have gone full Scouse instead 🤣👌",
            "If you’re Scouse, you should’ve just stole her car and burned tires on her lawn.",
            ">\"Um, you don't sound Bri-ish (She, of course, left out the t very purposefully.)\n\nAs opposed to the normal American way of pronouncing it \"Briddish\".",
            "\\>scouser \n\nno wonder you didn't sound british to her. scousers barely sound human. \n\nwith love from Newcastle",
            "I completely lost it at “monocle”. Well done!",
            "Rephrase that you are not English you are scouse and that’s enough ✌🏻",
            "I ran across a guy from the UK working in a factory in small town Iowa. Never got around to asking how in the Hell he ended up there. He was just happy that I didn't think he was Australian.",
            "> a very southern and undereducated part of the US.\n\nYou know, you can just save yourself some trouble and say \"Florida\" :P",
            "You sound sort of insane. Glad it all worked out.",
            "You didn’t do any of this, but fun story.",
            "[deleted]",
            "is this a made up story? sounds like a lamer episode of the office",
            "\"petty revenge\" rather than \"malicious compliance\"\n\n\n\nMalicious compliance is the act of intentionally inflicting harm by strictly **following orders or rules**",
            "Jolly good!",
            "Glad she learned her lesson and didn’t double down again after you went Plus Ultra British on her.",
            "Would she have thought I'm not really American because I have a New England accent and not a southern one?",
            "Fookin colonists...",
            "But, did you see that ludicrous display last night?",
            "As an aussie living in Yankee land I find d this extra funny since everyone thinks I'm a pom since I don't talk like crocodile dundee or Steve Irwin...mate.",
            "Honestly I'm a little disappointed you didn't go for the shell suit and porn mustache, but the coat tails and monacle works well too.",
            "I love that your boss was 100% on board.",
            "Good job! Being English and living in Idaho I feel your pain. Oh, and if one more person asks if I'm Australian I'm going to lose it. pip pip.",
            "Should have told her her ma’s her da with a wig on and left",
            "I am British American but use American mainly. Put me in a room with someone who learned British and there it goes. My coworker and I spent a week in Okinawa and after day 3 I was worried about returning to work and sounding British, it went back to American a day after we returned.",
            "I can imagine her confusion if you had gone from an american-neutral accent to full on scouse.",
            "What a doylem",
            "Waaa",
            "Feel fortunate!  I went to school in England for a couple of years as a young boy.  When we returned to New Jersey, the school system put me into speech therapy to get rid of the British accent I had picked up. America decided I wasn't speaking correctly.",
            "Brilliantly done! My Nottingham born husband got a huge kick out of this. His Dad is from Liverpool but doesn’t have the Scouser accent any longer (more RP than anything else).",
            "Bloody good play ol chap! I dare say the Queen erself would quite enjoy a cuppa with you",
            "Get out of Mississippi while you can.",
            "Jeezus.... Scouse is a very distinct dialect. What did she think you were? Just someone watching a bit too much BBC America? \n\nGranted, if you've lost some of the accent it's not as harsh, but I assume some of your pronunciation still sounds a bit like you're clearing your throat?",
            "A scouser you say?  Well, you must know the guys from A Flock of Seagulls then!",
            "Should've broke out in full scouse, she would've thought she was under attack",
            "As an American raised in redneck nowhere from crackhead county, might someone explain to my uninformed ass what exactly a Scouser is?\n\n~~Totally not too lazy to Google it or anything. Plus, Google likes to misinform me...~~\n\nAnd, please forgive me, I'm just dumb, not malicious (this time), the whole British vs English thing?",
            "This is pretty hilarious! \n\nI work for a company in Wisconsin, and I live in Texas. On the daily, I get asked where I’m from because “you don’t have an accent!” \n\nI usually shrug it off and say something along the lines of “I was born in California, and moved to Texas when I was 6”. I immediately get a “ah! That makes sense!” \n\nThis happens DAILY!",
            ">\"Would you mind climbing the apple and pears and pouring me a cup of Rosy Lee?\" \n\nI absolutely lost it here!  Haven't laughed like that in a while.",
            "Scouse not English!!\n\nNext week juat put on your thickest Carragher-esque Scouse accent and see how she fares. I'm from just over the Mersey in New Brighton but can put on a good full-on Scouse accent and it's hilarious having my Fiancee's American friends try and decipher what i say. Even throwing in the colloquialisms like 'jarg' and 'boss' proper throws them.",
            "Nice one",
            "Spot on, chap!",
            "Story worth sharing, thank !",
            "Super Saiyan 3 British! I’m dead. Thank you this is how I wanted to go. F*cking hilarious.",
            "So question, why English and not British? I feel like that may be a stupid question, please forgive the curiosity.",
            "Well done arkid.",
            "I have friends from Walthamstow and had a friend from posh Cumbria.  \nThe accents and attitudes couldn't have been more different!\n\n(I did get told off by the mother of my Walthamstow friends, for calling them Cockney:   \n\"We ain't Cockney! We wu' n't bohn undah dah bayles!\")",
            "Good on ya! Thanks for the laughs like out loud even. That was so funny!",
            "1) This is brilliant, perfect malicious compliance\n\n2) Do/did you by any chance live in coastal Georgia? The way you write reminds me really strongly of a high school friend I lost touch with, who was also English but had been in the U.S. long enough that their accent had softened. Probably a long shot, but it wouldn't be the first time I randomly reconnected with someone via a popular Reddit thread!",
            "If even the English don't want to be British you might as well dissolve the UK.",
            "I'm in a similar situation to you and know how frustrating it can get when this happens! Well played old son.",
            "Leave it to the Brits to maliciously comply in the most cultured way... and queuing... mustn't forget the queuing...",
            "\"living in a very southern and undereducated part of the US\"\n\ngiven what they pay teachers these days that would be ***all*** of the us...",
            "The voice I read this in changed completely with the last sentence.",
            "I SO love the  ~~British~~ English sense of ~~humor~~  humour!\n\n*lol, sipping your Twining's*\n\nNicely done, OP!",
            "Why is the 't' silent in 'Bri'ish'?\n\nBecause they drank it all.",
            "What ever happened to \"I'm not British I'm scouse\"?",
            "Scouse not English",
            "Wokeness and low intelligence has such a special chemistry",
            "Gave her the old stiff upper Brit'",
            "Confused by the continuous identification as British then the last line yelling that you’re English and not British, I thought that was a problem only us Scots had. I absolutely love the malicious compliance though, I don’t think there’s a single thing more inherently British.",
            "Our passports are dark blue again now, not red; Gotcha - you plastic limey!",
            "Why did you marry 2 dogs?",
            "I'm from the Toon. What's a toon? It's where the geordies live. What's a Geordie? Someone who's from the Toon.",
            "I dont believe you're British either. The _REAL_ British thing to do is take her cubical in the name of the Queen, take her seasoning and spices out of her lunch box and sell them back to her, and lastly tax her to use her equipment necessary to work and then tax her to work there. THATS THE REAL BRI-ISH WAY.",
            "Jolly good show. Let us retire to brandy and cigar room",
            "First time I heard rhyming slang, I just kept short circuiting “They are speaking English.  I understand the words, but now if it make sense! What’s going on here?”\n\nYour boss is awesome for going with it.",
            "I sometimes like to switch to an Oxford accent just to keep people on their toes.\n\nI am American, though.",
            "SSJ3 British! I'm just imagining OP hunched over, screaming and grunting with effort as he grows coattails, a top hat and monocle 🧐🎩",
            "This is really annoying when people try to tell you who and what you are. I’m a hella white passing but I’m half Mexican and when people find that out or hear me listening to Spanish music they always laugh at me like I’m lying.",
            "I enjoy a few cups of twinnings early grey every morning, and I'm a Gerry! It's good shit!",
            "Super Saiyan 3 British! 🤣🤣🤣 Respect.",
            "I like the dragon ball reference!",
            ">\tI need an intern to bring me some tea? “Would you mind climbing the apple and pears and pouring me a cup of Rosy Lee?”\n\nI fucking lost it. \n\nFull on Morpheus, “He’s beginning to believe” moment. \n\nI hoped you were gonna go the whole hog and when I hit monocle, I lost it again.",
            "Wait you are married with two dogs?? 😵",
            "It’s cockney rhyme and slang but besides that I want to know how you lost your scouse accent, that a strong accent to lose.",
            "She doesn’t scouse",
            "Damn I would have just went up to her in front of everyone and just ask why she’s lying and gossiping about you , to embarrass her. But I mean wearing your country’s national dress code also works too I guess..",
            "Taking the mickey!  Every Scouser's right.",
            "Reminds me of the time some Kiwi chick told me I'm not Indian because I eat beef.\n\nYou don't have to be on the armchair to be an armchair expert.",
            "Imposter detected: Scousers don't speak rhyming slang.",
            "Should've gone for a tracksuit, 110s and a perm.",
            ">Scouser \n\nThere's yer problem. Most Americans don't know what a scouse accent is",
            "Cheeky nandos",
            "A Scouser, using Cockney!\n\nWell, I'm offended. *<sips tea angrily>*",
            "Cringe.",
            "Trust the scouser to get leary haha. Well in lad.",
            "You’ll never walk alone, mate. Good on you.",
            "I was thinking \"fair, if youre a southerner or something, the accent mught go pretty quick\" until you mentioned you were a scouser lmao. Couldnt have had a more identifiable accent!",
            "Shame you couldn't go crazily Scouse on her, but I expect that wouldn't be what's she'd think of as British",
            "This read was the dogs bollocks",
            "Scousers are from the North, though. I respect your Englishness, but we all know you guys are more like us than the real Southerners. Also, you're down the side with all the Celts, so you're defo in with us if you want to be.😉",
            "The least believable bit of this is a scouser claiming to be English.\n\nThe interns onto something.",
            "I lived in London (Camden) for a year and I still have no idea how 'normal' British people act.",
            "Scouser first, English second, British third 😉",
            "Only one important question. Red or Blue, OP?"
        ]
    }
]