[
    {
        "post_id": "t6sefc",
        "author": "InterestedObserver20",
        "title": "Promote me but won't bump up my hourly wage? Sure thing, I'll just use your rules to give myself a 50% pay bump.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t6sefc/promote_me_but_wont_bump_up_my_hourly_wage_sure/",
        "score": 24903,
        "num_comments": 348,
        "created_utc": 1646426463.0,
        "selftext": "This happened in a company I worked at over a decade ago.\n\nI was a technician working on large machines, we had numerous clients and were assigned to a given site. The site I worked on was across a border so I couldn't live near it, and had an hour commute each way every day. I got no expenses or mileage for this because it was my assigned site.\n\nAfter working for this company for a while I got promoted to stop doing routine maintenance and work on more complex projects. Most of these projects were on a site near where I lived so that suited me just fine. However, the company told me they didn't have any budget to increase my wage, which is where the malicious compliance came in:\n\nI combed through their rules and regs as well as my contract, and found that if you had to travel to a site that was not your assigned one, you got paid as if you had driven from your assigned site to whatever other one you were working on. My assigned site was classified as being 1.5 hours from the site that I was doing most of my work on, so I was allowed claim those 1.5 hours as hours worked on my timesheet. So every day I would put down 1.5 hours commute there, 1.5 hours commute home, and 8 hours regular work. \n\nAnything over 8 hours worked a day was paid at OT rates, so for those 3 hours \"commute\" I was getting paid 4.5 hours. Because my contract said my assigned site was site A, and I was mostly working at site B, there was nothing they could do about it and my country has pretty decent employee protections so I'd have had to agree to a contract change, which I obviously was not going to. They told me numerous times they were going to change my assigned site but until the day I quit they were never able to.\n\nThe length of my commute most days was 10-15 mins each way.\n\n&#x200B;\n\nTL;DR - I used the company rules to get paid an extra 4.5hours each day for driving for about 25 minutes.",
        "permalink": "/r/MaliciousCompliance/comments/t6sefc/promote_me_but_wont_bump_up_my_hourly_wage_sure/",
        "comments": [
            "No room in the budget for raises, but always plenty for OOP$!",
            "Goddamn you got paid a day and a half every time you went to work? Nice.",
            "I see it was one of those “we think it should be this way when it benefits us, but we want it to be that other way when it benefits you” kind of rule. \n\nYeah, that’s not how it works. Good for you.",
            "This is a nice one! \n\nThere's no such thing as a promotion without a pay increase. That's simply called a title change. Make sure you always push back on that terminology.",
            "So if we're assuming you charged 8 hours a day before the promotion and now you're charging 12.5 hours a day at the same pay rate, you essentially got a >50% pay raise all because they didn't want to give you a raise.\n\nSave* a penny, cost a dollar\n\nEdit: spelling*",
            "\"We don't have the budget to officially increase your wage, but we apparently do have the budget to give you the equivalent of a 50% pay increase for weeks/months when it's classified as OT\"\n\nEither their accountants are really bad (or really stubborn) and couldn't/wouldn't shift funds around to ultimately save the company money in the long run by just giving you a raise, or the company had so much bureaucracy that getting anything done according to common sense was almost impossible so it was easier to just let you claim the OT. The latter seems more likely, since even though you were doing most of your work at Site B they still weren't able to make that your assigned site by the time you left weeks/months later.",
            "You are the hero we deserve.  You rule.\n\nHave a wonderful weekend",
            "A really good boss would have pointed out this loophole if their hands were tied about a pay raise",
            "It fucks me off when companies have that attitude. Company I work for always have that excuse when we ask for a raise, but the owner just bought himself a new Audi RS etron. And, to further twist the knife, they make use of a lot of temp drivers that literally costs the company DOUBLE per hour to the temp agency what we as the permanent staff cost, so they can employ 2 drivers for the price of one temp driver. And the temp drivers only put out about 50% of the work we as permanent staff do cause they don’t know the routes etc. So now all of us permanent guys are on a slow strike, only doing as much as the temp guys. We are patiently waiting for them to bring it up, cause the amount of failed deliveries are mounting at an astronomical rate…",
            "I did something similar a long time ago. I lived in A, worked in B and for a long time worked on site C. A,B and C were  same distance from each other, about 1 hour drive. Good mileage allowance.\n\nOne day I drove A-B-C and got picked up on that when I claimed mileage. Only allowed to do that when I needed to do something in the office.\n\nSo, it turns out I needed to do something In the office almost every day, either putting  in a mileage claim or to collect the claim (they paid cash).\n\nWe were living on the mileage allowance, didn't touch my salary, and of course the driving time was OT.\n\nThey had a rule that to claim mileage allowance you had to register a fairly new car. I did that and then bought a old car to actually drive with.",
            "I just know they were mad lmao. Good job!!!",
            ">and my country has pretty decent employee protections\n\nAh, there it is. I knew this couldn't have possibly happened in the US.",
            "I used to be on call 24x7 for an IT support company. The on call rate was good, but the remuneration for each call was low.  \nSince we didn't get many calls out of hours the company decided to change it round, thinking that we were being paid for doing nothing if we didn't get called - the on call rate was lowered significantly, but the payment each time we got called was increased by a lot.   \nSo you can guess what happened - suddenly the amount of calls we got out of hours increased by a large amount.  \nBecause we'd ignore the warning alerts we got during the day, which we used to address so that a critical wouldn't occur overnight.  \nSo now basically every alert went to critical out of hours.  \nThe company reversed the policy and the number of out of hours calls went down.",
            "Nice. A simple shorter distance clause would have saved them. \n\nEx: We’ll pay you either home to the unassigned location, or assigned location to assigned location; whichever is shorter. Pretty standard I would think.",
            "[deleted]",
            "I once worked as a contract employee for a company that required me to self-classify as a 'sole proprietor of an independent company' for tax reasons.\n\nThis also meant that I was allowed to review the company's accounting information regarding my contract wherein the total amount dedicated to hiring me was stated. I did some quick math before signing it and nearly doubled my anticipated hourly rate to account for 95% of the allotted budget.",
            "I worked for a bank in my earlier 20s and when I started my apartment was right up the road. \n\nWe had to work every other Saturday at another branch, and milage was counted from your \"home\" branch to the other one. This was no big deal for me, the other branch was about the same distance just in the opposite direction, so milage was about double what it took to get there. \n\nA couple of years in, me and my wife moved closer to our home town, making my drive to work a little longer, but again no big deal. \n\nMy manager covered Saturdays at a branch closer to my new house, and when she retired I immediately volunteered to take those Saturdays, really only thinking about decreasing my Saturday drive time. \n\nWell when I went to fill out my expenses I realized that I was about to claim a significant amount more on my milage. I tried to be honest and tell them it takes me about 2 minutes to get there, so I don't really need it, or just give me less. And I remember that HR lady looked at me, and just said, these are the rules and thats how it has to be. So I just said okay and kept taking my extra gas money",
            "They probably realized that they could give you a raise or just let you claim the rules to your benefit......At ~780 OT hours in the year, that's not a bad raise",
            "They got cheap on you and you got paid. lol",
            "Just curious, could you not have still done this had they given you the raise meaning they would have been out even more? (Even though you'll likely say you *wouldn't* have, and I believe you)\n\nPerhaps it was a calculated move on their part? Don't give you the raise and risk you using the loophole or give you the raise and risk you still using the loophole costing them more. \n\nSeems like they weren't able to change your contract location so this was the lower risk outcome.\n\nEither way, good for you!",
            "I work as a manager trying to promote a few of my staff. No luck, flat out was not going to happen. However, year1 I got them bumped up a pay grade, year 2 I got them a title change and a “market adjustment” in their merit increase. Not an official promotion but I won the stupid game.",
            "\"No room in the budget to pay me? I hope you have room in the budget to replace me!\"",
            "> and my country has pretty decent employee protections  \n  \nFound the non-American.",
            "Ditto... but they inadvertently gave me the right to sign off on my own pay raise. Shit gets weird when the CEO gets caught, embezzling millions.\n\nNASDAQ auditors notice when your mortgage, car, and wife are on the balance sheets you CCP loving bumblefuck",
            "I don't know if you know, but bored panda published your story\n[article ](https://www.boredpanda.com/employee-denied-salary-raise-uses-company-rules-gets-paid-extra/?utm_source=google&utm_medium=organic&utm_campaign=organic)",
            "Nice",
            "They rehired me and a few other guys at higher contract rates with overtime rather than a salary increase. It's all about who has to sign off on it and who claims it as a win or loss.\n\nIn the budget, that's fine. Out of budget, hey we aren't taking that loss!",
            "They'd have replaced you if they could afford it - good job advocating for what you're worth.",
            "That was extra super nice execution!",
            "Well done sir!  I always love hearing stories like this.",
            "Nice",
            "I feel like r/WorkReform would enjoy this story",
            "My hero!",
            "Not all heroes wear capes.",
            "Fully compliant with the rules provided.",
            "This is gold!! Crossposted in r/antiwork\n\n[https://www.reddit.com/r/antiwork/comments/t6uuqp/promote\\_me\\_but\\_wont\\_bump\\_up\\_my\\_hourly\\_wage\\_sure/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/antiwork/comments/t6uuqp/promote_me_but_wont_bump_up_my_hourly_wage_sure/?utm_source=share&utm_medium=web2x&context=3)",
            "Know your worth! Don't work for free!",
            "Dang, essentially got a 56% pay increase. That's really nice",
            "I'm gonna be honest, this sounds like fraud instead of malicious compliance.\n\nI've seen that clause where it says any travel to a work site can be constituted as work, but it's always been from the starting location. Even if the wording is as you say, you'd still only be \"travelling\" 15 minutes from work site A to work site B. That's extra 75 minutes of \"work travel\" was never performed.",
            "> I got no expenses or mileage for this because it was my assigned site.\n\nWhy would you?? That’s your office.",
            "Could they have just sent you back to working at your old site?",
            "This is a standing ovation worthy ‘Bravo!’",
            "This is hilarious but if the company really wanted to fuck with you they could have made you physically have to check in at your assigned site, then drive to the other site, and then back to the assigned site just to check out, every single work day (since you were claiming the travel both ways). Granted, you'd still be getting paid the OT but this way you'd still have to drive those 3 extra hours which doesn't sound like fun at all. Lucky they didn't decide to go that far.",
            ">I'll just use your rules to give myself a 50% pay bump\n\nEveryone else does this.\n\n*Welcome to The Club.*",
            "😂😂😂",
            "[removed]",
            "[deleted]",
            "That doesn't make sense. It just seems like u lied rather than malicious compliance by putting down 1.5hr travel time when it was only 20mins?",
            "a decade ago is story telling and not relevant.",
            "This is WONDERFUL.",
            "Huzzah!",
            "Lovely MC",
            "Nice.",
            "Did they say anything when they figured it out? or was it all done through payroll or something",
            "HELL YEAH FUCK THOSE GUYS!!!!",
            "I’m surprised they didn’t just start sending you back to site A.",
            "\"The site I worked on was across a border so I couldn't live near it,....\"\n\nWhat? Why? Why not?",
            "How is it “an hour commute each way every day” in the first paragraph, but then “the length of my commute most days was 10-15 minutes each way”.   So its not an hour commute, its just 10-15 minutes",
            "Nice loophole",
            "Wish this would work in my situation.",
            "If they wanted to MC you right back they would have had you check in and out at your assigned site before commuting.",
            "The good old \"we dont have enough budget for payrises\"    xmas work do rolls around and bam somehow that table is fulllll of expensive wine all payed for of course by work which doesn't include the free bar.   Something that always annoys me.",
            "Lovely.",
            "I'm sure that helped make up for the gas money you spent while driving an hour back and forth to the old location!",
            "I'm surprised they didn't MC you back and make you work at the original site again.\n\nGood job, though, knowing your contract."
        ]
    },
    {
        "post_id": "7ve0ki",
        "author": "None",
        "title": "Difficult customer DEMANDS we place her very heavy sofa onto her delicate wooden floorboards .... you got it",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7ve0ki/difficult_customer_demands_we_place_her_very/",
        "score": 24832,
        "num_comments": 939,
        "created_utc": 1517827845.0,
        "selftext": "Back in my ware house days there were occasions where the customer service Manager (who is still a great friend of mine even to this day ) would ask for myself and a few ware house workers to help him re-deliver and re-install a repaired / re ordered sofa for a customer.\n\nThe day of the re delivery the Customer Service Manager (CSM) pulls me aside and warns me that this lady is extremely difficult and aggressive.\n\nIn this instance she ordered a leather sofa in a high quality leather, paid top dollar , waited for 22 weeks and on delivery decided she didn’t like the colour.\n\nNow normally the company doesn’t do re orders for change of mind when it comes to choosing the wrong colour... but this lady made such a fuss and complained so much that the General Manager made an exception.\n\nWe get to the home and our contract driver is just unloading.\n\nThe customer has chosen a MASSIVE three seater recliner with a metal frame and bracket on the bottom.\n\nNormally with the metal bracket comes special plastic stoppers that go on each foot of the frame and each edge of the metal bracket so that no damage will occur to a customers floor.\n\nAs we carefully navigate the sofa into this ladies lounge room she starts bitching loudly that us warehouse workers are-\n\n- dirty\n- idiots\n- lazy\n- too slow\n\nWe begin to unwrap the lounge and this lady is getting impatient. She’s bitching to the CSM\n\n“How much longer is this going to take?”\n\nCSM re-assures her that we are taking our time to ensure that the sofa is unwrapped and in perfect condition.\n\nWhat we also note is this lady has light wooden floor boards... so I immediately move to start placing the stoppers on the floor.\n\nThis woman starts shrieking -\n\n“Why is he touching my lounge? Is he BREAKING IT?”\n\nMe - “ no miss I’m just—“\n\nWoman “don’t talk to me... get your filthy hands away from my lounge “\n\nMe “I just need a few seconds to put these rubber —“\n\nWoman “ put my lounge down... NOW!! Or I’m calling the manager “\n\nI shoot a look to the CSM and he just shrugs. \n\nWe place the sofa directly onto the floor boards and we can already hear a scrape.\n\nCSM hands the lady his paper work . She signs off on a successful redelivery, and signs off that we have assembled the lounge as required and placed it where she wants.\n\nThis lady smirks at us and plonks herself down onto the lounge. There’s a scraping sound as the metal frame digs into the wooden floor boards.\n\nWe grab all the plastic packaging and make our way back\nTo the store.\n\nGuess what was waiting for us??\n\nA customer complaint... according to this lady we damaged her very expensive floor boards .\n\nCSM shows where this customer signed off on a successful re-delivery and that we assembled and placed the lounge to her satisfaction.\n\nShe got exactly what she asked for \n ",
        "permalink": "/r/MaliciousCompliance/comments/7ve0ki/difficult_customer_demands_we_place_her_very/",
        "comments": [
            ">Now normally the company doesn’t do re orders for change of mind when it comes to choosing the wrong colour... but this lady made such a fuss and complained so much that the General Manager made an exception.  \n\nAnd this is why people continue to act like douches.  Because it gets results.   If she was that difficult and aggressive, that's even more reason to stick to the policy.  ",
            "I don't understand people that act this way. Just let the workers do their job. ",
            "Because telling off professionals when they are just trying to do their jobs has always ended up great for all parties involved. ^/s\n\nSeriously...\n\nSeriously? ",
            "I hate this shit.  It’s ramped up to the point where, if you have a legitimate complaint about food/deliveries/any retail item, you almost HAVE to make a huge fuss/shout/ask for management.  Entitled little brats make normal people feel BAD for sending food back, or things of that nature, because we don’t want to be “that guy/girl”.  But since we’ve gotten to the point where upper management just caves for people making a huge scene that, like toddlers, they’ve learned they can get away with it and get results.  Makes me sick.",
            "I have never taken that kind of abuse from a customer and I worked *pizza delivery* for years.\n\nI honestly don't know how I would have handled that. Sounds like you didn't literally backhand her, so you are doing better than I would have. Seriously. ",
            "I have never understood how people can act this way and think they will get anything close to good service.\n\nthe closest comparison I have to this is when I hire movers.  I've moved a handful of time and have hired movers to help me.  Every time I have had lunch and Gatorades waiting for when they needed them and encouraged them to take brakes when ever they needed.  And every time they have been very appreciated and been more than happy to work past their schedule stop time to ensure the job is complete. \n\nI've never had an issue.",
            "God, I always hated delivering double recliner sofas. They seemed way too often to end up going through a doorway that was too small into a room that was too small. And, like clockwork, the customer would say something dumb, like \"at least it's not a hide-a-bed\". I'd rather deliver a hide-a-bed any day.  They are lighter and easier to move with half the steel, and don't flex while you're carrying it. ",
            "Back in my retail days, when TVs still had tubes, I was loading a 32\" for a woman and when I got outside instead of an SUV or minivan that could actually haul it she had a newish luxury car (late 90's Mercedes or something).  I figured the best option was to angle it in the trunk and tie down the deck lid but it look like it could rain so she wasn't having it and wanted to see if it would fit in the seat if we removed the box.  I spent way too long trying to convince her not to but she was adamant.  I did the best I could with some of the packaging to protect her upholstery and and got it situated in the front passenger seat without damaging anything and she left.  Went back inside and told my manager and warned her that the woman's leathers seats were likely to get mangled by the TV before she got it back out of the car and that she should expect a call.  We got the call the next day and the manager pushed it up to corporate so I don't know if she ever got anything out of it.",
            "I think she just needed to sit down ",
            "Personally, when I have someone in my home to do work I can't do myself, I express gratitude.\n\nRecently, a plumber came to my home.\n\nNow I don't have a basement full of shit.\n\nI said thank you.",
            "I can't count the jobs I walked out on because it was either that or choke out rich, entitled crotchgoblins. Took a couple years before I decided in a kitchen was where I belonged. Lol",
            "I hope when I'm rich I'm never this much of a dick. Not that it's something I really have to worry about.",
            "I would have been fired so quickly....\n\"Listen, bitch. I get paid to deliver YOUR sofa to YOUR house for YOU. You disrespect me or my employees again, and you can take your old ass back to the warehouse, strap this fucker to the roof of your dinky little dodge dart, and bring it home yourself. Because we get paid to help customers, not to be abused by them. So you are goinflg to apologize, we are going to finish our work here, and you are never going to come back to us for another order. Because frankly, we dont want to do buisness with shitty, abusive human beings\"",
            "I miss one of my previous jobs for a shipper. \n\nMy first day there the owner let me know not to be treated or talked to improperly. I wasn't there to deal with people's bullshit. Come in, tell me the receiving address, I pack your stuff up, you go. He said if I ever felt like I was being berated by someone who had no real reason to do so to pick their stuff up, put it on the edge of the counter and tell them to take their shit and go. \n\nThis is also the same guy who on that first day opened up a drawer to a nightstick/pepper spray/36 revolver inside and let me know the arsenal was free to use - especially for intimidation to get trouble to leave before it escalated (lol), but that's for another day.\n\n",
            "I work at a furniture store and work with the delivery guys a lot, sometimes helping them with deliveries if they need an extra hand. The number of people that treat them like dirt just because they're \"manual labor workers\" is astonishing. It seems like every day they have to explain to someone that no, I did not personally take a hammer to your brand new coffee table because I hate you, it just came in that way and we can get a new one for you.",
            "Had something of the like happen to me. About a year ago I was installing kitchen appliances for a high end electronics retailer. \n\nOne day we came across an order to uninstall a 10 year old dishwasher from this lady’s kitchen and install her new one. Now the issue with older dishwashers is that occasionally, the homeowner will replace the floor in the kitchen with a thinker flooring and won’t put it under the dishwasher. By doing this, they are essentially blocking in their existing machine. \n\nSo of course as we are disconnecting the old unit, the customer is being insanely pestering about her brand new floors and how “if we break ‘em, we buy ‘em”, so it’s safe to say we weren’t taking any risk (plastic floor mat, cotton globes, booties, walking to and from our truck for every tool so we don’t leave any laying around). \n\nAs we are looking under the machine we see it, they raise the floor a good inch, meaning in order to remove the dishwasher, they would have to remove their flooring. \n\nYeah well she wasent having it, she went on a tirade about how we were paid to do a certain job and if we didn’t do it she would have us fired yadda yadda. We insist we can’t remove the machine with the floors there. So she decides to call her husband and have him come home from work, out company pays us to stay and wait for him to come and attempt to remove it so we can install the new one. Husband arrives 15 minutes later seething (match made in heaven) and blows straight into the kitchen, checks the latches, grabs the inside of the dishwasher, and YANKS the unit from the counter. Dittzlefritz didn’t really think that one through, he tears up over a 6 square foot of beautiful wood flooring, leaving skid marks and blistered broken wood. \n\nIm not saying it felt good to watch, but I didn’t loose money so I sure wasen’t mad. \n",
            "This is why I got out of customer service, they're idiots.",
            ">  this lady made such a fuss and complained so much that the General Manager made an exception\n\nNoooooooo, that just encourages this behavior, it's a never ending circle.",
            "Halfway through reading the post, I forgot what CSM stood for. When it came up again, for some reason I thought it was \"Chief Sofa Manager\"",
            "[deleted]",
            "I just wanted to give a big \"THANK YOU!\" to all the people in here talking about how they've treated their delivery guys with respect and kindness. I worked for a company for about a year that did everything from household moves to fine art deliveries, in every state West of the Rockies. You would not believe the amount of work you can put in for people with more money than you'll ever see in your life, only to get bitched out and/or not given a tip.\n\nOne lady sat there eating *an entire chicken*, drinking what I assumed were mimosas (we got there at like 8 or 9am), while we packed up her entire house. She then had us grab a bunch of stuff out of a barn she had on her property, which wasn't part of the plan at all and added a significant amount of time to the whole process. She left before we were finished, telling us she didn't have any cash on her and would tip us upon delivery, which sucked because we knew we likely wouldn't be involved in that since we had several teams of guys and a lot of this stuff ended up in storage for a couple weeks before they actually moved into the new place. I talked to the guys that delivered it and she didn't tip them, either. This is a woman who lived in a *huge* house on a *huge* piece of land in Napa Valley, so it's not as if she was economically disadvantaged in any way.\n\nFunny thing is, I feel like it was the \"regular\" people we worked for (middle class types) who were more consistent (and generous) with their tips. Guess you don't get rich by \"wasting\" money on stuff like tipping the guys who just made your new life possible. \n\nOk, sorry /rant",
            "This is the sort of person my boss would tell to shove off.  I don't care how expensive the one order is, this is the sort of business you never want.  Put up with it and do the slightest thing wrong, in this case she reaped what she sowed, but she's the sort that will tell literally everyone she knows about how horrible the service was and blah blah blah. If they're unreasonable, refuse service completely.  Never put up with their shit.  It's not worth it.",
            "Gosh that was rude and disrespectful. total jerk move. not all 'customers are always right' is right.",
            "I'm always amazed people are this shitty to strangers in their house. Like they can come back and kill me after work if they want.  In gonna be nice af",
            "You can really tell the quality of a human, from how they treat service workers. After working in different service fields, i have vowed to always treat people in those fields back with patience and respect. Nice customers make those jobs much more bearable, and no matter how shit your day has been they dont deserve your shit to be taken out on them. I have also learned that treating people well and seeing their reaction to be treated well, makes my shitty days better and makes me a tad bit happier",
            "I really don't understand the need to act that way. You'll get your sofa where you want even if you don't act like a bitch. How surprising. ",
            "The difference between this story and my old jobs is the ending would be me meeting with three different bosses telling me how I failed this situation and have to formally apologize to the customer. ",
            "Is he BREAKING IT? ",
            "If that bitch complained at me like that I'd put the sofa down and go home. I'n paid to do my job, not listen to abuse.",
            "If only there were a way to review customers behavior the way customers use yelp to review businesses. Sometimes avoiding a bad customer saves far more time and money than taking their business.",
            "Not only ignorant, but shrieking in lack of patience too! She sounds charming to say the least",
            "> As we carefully navigate the sofa into this ladies lounge room she starts bitching loudly that us warehouse workers are-\n> \n>     dirty\n>     idiots\n>     lazy\n>     too slow\n\nMmmm...Sweet sounds of self righteous  customers.\n\nI guess rude people share vocabulary all around the world <3 \n",
            "Makes me sad to know entitled snobbish people to this degree exist. ",
            "How do such people not learn at some point in their life?\n\nAlso, real hardwood floors look fantastic. Then they don't. In days gone past, everyone knew that wooden floors would wear down, and that was expected and accepted.",
            "> “Why is he touching my lounge? Is he BREAKING IT?”\n\nThis thought process has always confused me -  \"I don't know what you're doing, so you must be ***breaking*** it.\"",
            "I deliver furniture, as well. I can attest for this post that it happens all-too-often. Customers feel that they need things to be 1000% perfect and don’t want the delivery guys to do anything that might jeopardize or damage their furniture (even though 9/10, we know what we’re doing far more than the customer). \n\nIn those [sometimes] rare instances where customers are being huge assholes and just tell you to leave it where it is (after the fact you’ve made an attempt to warn them of the dangers of something getting scuffed or scratch), it’s mind boggling when they turn around and complain that something went wrong. After working in this field for a while, you start to notice that there is a special breed of customers that act similar in this way. You try to do everything you can do ensure that the furniture is safe and perfect and the house is not damaged in any way. Regardless, they will find something wrong with it (even if in some cases, there is no problem). \n\nIn this case, I’ve had something happen to me in the same affect. Not quite parallel to the post, but enough to understand exactly where he’s coming from. At some point, the customer just has to like a self-righteous, entitled bitch. I understand that they pay thousands of dollars for their furniture and they want it to be in perfect condition, but you need to allow the delivery guys to do their jobs and trust that they will do it right. After you do something so many times, you know how things go. It’s especially worse when they start insulting you. I’ve been called many names as well. It’s not an enjoyable feeling while you’re hot and sweaty and the customer is already getting on your nerves. So at some point, if the customer wants their shit left where it is without regard for safety of their home and furniture, fine. Sign the ticket accepting the delivery and we’ll be on our way. Just don’t be surprised when you notice something is wrong. \n\nAll that said, I understand where you’re coming from. It sucks, but there’s nothing you can really do it about it. From that point on, the managers can decide how to handle it. At least they know that this lady is a massive bitch and you guys tried to do everything right. She signed off on it, so it’s on her now. ",
            "I'd bet every dime to my name this bitch, and others like  her, never worked a day in her life. She found a husband who was wealthy and has never actually accomplished anything on her own.",
            "We have friends like this customer.  WE. WILL. NEVER. EVER. EVER. GO. OUT. TO. EAT. WITH. THIS. FRIEND. She complains about the free water, free bread, food, appetizers and deserts.  It's embarrassing.  Hope she and this lady enjoy being alone  :)",
            "When they put my large and heavy new bed in I gave the workers cinamonbuns and soft drinks. \n\nI had them bring it BECOUSE I'm lazy, they do my heavy lifting the least I could do is be nice about it.",
            "I don't believe I am a slow or a lazy person but there is something to be said for a hard labor job. I would move furniture for a living before I would work in an office with all of those petty people who think they are better than you. I've been there and done that. I cook now and I wouldn't do anything else. I love cooking but the most rewarding job I ever had was landscaping. Getting paid to mow lawns and plant gardens and things like that. Sure it was really hard but I was outside and in great physical shape because of it. I don't know where I was going with this. Oh well.",
            "Great story! but I hate it when managers make exceptions for assholes, the end effect is not only is the asshole getting better service than someone that is kind, but it also reinforces their idiotic behavior to continue expecting the world to cater to their every whim. ",
            "You do occasionally get the opposite.\n\nI had to reject a delivery when the guys dropped my brand new couch, carrying it through the front door. Entry was slightly elevated, but had no railing - picture a paved porch about 4-5' up, and 5-6' wide. \n\nI warned the guys to be careful of the edge when they walked in. They were like \"yep sure, no worries.\"\n\nGuy carrying back end of the couch stepped right out into space, didn't hurt himself, fortunately, but dropped his end of the couch hard onto the edge of the porch. They tried to carry it in the rest of the way, and I went \"hold on,\" looked at the edge of the couch where there was now a big v-shaped ding.\n\nI said \"back on the truck, please.\"\n\nTook a couple of weeks to get it back, but it was good then.",
            "She’ll continue to act this way until companies stop giving in to her bullying and demands. I don’t understand why they always get their way. \nIf someone is as difficult as she is, no one will listen to her slander about the company that stood up to her. ",
            "I delivered furniture for years so I can share in this experience. One thing I would have done was had her sign for everything *before* we dropped it on the floor. \n\nMy favorite was delivering a king size mattress to a very old 3rd floor row home. Now, most houses won't take a king mattress cleanly save for some larger open concept homes. Some bending is usually required to get around corners or squeeze up a staircase. In most cases it is nothing the mattress can't handle. \n\nExcept in this ancient third floor row home. They ordered the largest heaviest pillow top they could find and after lugging the thing in the door my partner and I look at the stairs. The ceiling was low, I had to crouch and tilt my head to the side not to scrape it, and I'm only 6 foot. The stairs ended into a long hallway with only a few feet between the wall the stairs. Not only did the mattress not fit up the stairs, but we couldn't get the thing to angle around the corner at the top without mangling it. We'd then have to repeat the process for the next flight.   \n\nSo the guy I'm working with explains all this (and its freaking obvious to anyone with a modicum of spatial awareness) to the customer who gets heated and screams at us about being lazy and not doing our job. A whole line of profanity and insults follows. So my partner says look, we'll take it up, but you have to sign for it now. So, she finally signs realizing that yes, we will leave that shit on her first floor. \n\nNow the guy I worked with was a very large dude you just don't want to mess with. So he's like, hang on, we're not going to shove this thing up there and break our backs, I have an idea. He gets two tie downs from the truck and wraps the around the mattress and ratchets the damn thing in half. We then leisurely carry it up to the room. Once we get it there we pop the tie downs the damn mattress sits at a damn right angle. The woman was so angry I don't think she could get words out. We grabbed our things and left. \n\nShe complained to the store, but too bad for her she had signed on the dotted line which ready, all merchandise has been received in good condition. She threatened to sue but never did. I'm sure a lawyer told her she shouldn't have signed the paper. ",
            "i cant beleive people act like this. im by no means a polite or friendly outgoing person, but even i am always polite, maybe even overly polite, to workers, servers, strangers.",
            "this could be intentional on her part. force the movers to make a \"mistake\" and then use the damage to her floors as leverage for free stuff",
            "I feel ya OP, I do warehouse work and delivery for a furniture store as well.\n\nI love the ones where the piece they bought will not fit into the door of the house and they can't understand why.",
            "> This lady smirks at us and plonks herself down onto the lounge. There’s a scraping sound as the metal frame digs into the wooden floor boards.\n\nShe 100% knew what was going to happen. She was just accustomed to getting good results from being a monster, and/or she was hooked on the high of anger. If she was poor instead of rich, she'd own a Rottweiler, treat it harshly, and let it roam the neighborhood off leash. Different method, but the goal is the same: Cultivate external drama for excitement because your inner life is empty and sad.",
            "I always hated rich clients when I cleaned carpets. First of all, I didn't make a cent more. And secondly, bored wives were the worst. If they were so busy, why did they have 3 hours a day to complain about a wine stain next to their god damn bar?\n\nHot water and industrial cleaners didn't get it out, and I *guarantee* being a bitch won't either!",
            "I keep hearing people parrot the words, \"Every life is valuable\" and \"All people have the same worth\",  I promise you that this is absolutely not true.",
            "Next! ",
            "A wise man once said, \"Eat a dick you ol' bitch!\"",
            "You use the term “lady” even though there are more appropriate names for her. You’re a kind person. ",
            "She needs to be late term aborted like in that Christopher Titus stand up.",
            "Keep 'em coming DarklyNear!\n\nLove hearing these stories!",
            "I fucking hate cunts like this. Like oh my gods",
            "> General Manager made an exception.\n\nThe GM needs a bitch slapping.",
            "I have a friend who does custom furniture repair and installs and I used to go with him as an assistant on service calls.  I've seen my fair share of customers like this.  Imagine spending 3 hours taking apart an entire sectional sofa to replace a bent or broken support beam and putting it all back together to find out that the customer doesn't like the way the sofa \"feels\" now.  Apparently they had been sitting on the sofa with a bent/cracked support beam for a while and had grown accustomed to it and didn't like the way the sofa felt with the corrected support beam.",
            "Rude person stops experts before completion of their work.\nWonders why work done is not satisfactory.\nComplains to company about the decision the person made.\n\nPeople, why you do this..?",
            "This story is my everyday hell, hahaha.",
            "I love people like this. Just come in with an attitude from the very start and expect you to bend over backwards to please them. Uh no. I go the extra mile for nice people I’m going to give entitled douche nozzles the bare minimum to get them out of my face. ",
            "At the 22 week mark, I would have written it up as a loss, and delete her order for the sofa. I’d rather lose business with this type of customer, than have to have them as a customer",
            "I hate people so much",
            "Wow you seem like a good guy to put up with that. I don’t think I could handle it. Stories like this make me boil and I would love to see workers just walk out on something like that. Like just leave this heavy ass piece of furniture right in the middle of her fucking door and be like “alright see yah!Peace!Move it yourself bitch!”",
            "A sastifying story to start a nice Monday. Also fuck that bitch.",
            "I just feel like the lady’s personality was magnified mainly because I don’t want to like in a world where someone like that actually exists ",
            "I wanna start my own business just so that I can have a radical business policy that not enough companies are doing: in the event of a customer that is over the top and abusive, you tell them to fuck off. Simple. \n\nAm I so greedy that I have to bend over backwards for a single sale and go to the ends of the earth in a vain attempt to satisfy the insatisfiable? Screw that!",
            "Contrary to this womans belief it isn't that hard not to be a dick. She got exactly what she deserved lol\n\nAnd I hope you and your coworkers didn't get any trouble!",
            "Why do people never learn....bitching gets results, but you may not like them. being polite and working with the guys makes them willing to work with you and avoid damaging things. it's almost like they like people who aren't bitching about them all the time....",
            "i find her behaviour unbelievable",
            "Was it possibly racial by any chance?"
        ]
    },
    {
        "post_id": "e8iews",
        "author": "UrPokemon",
        "title": "We get 250 pages to print per semester...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e8iews/we_get_250_pages_to_print_per_semester/",
        "score": 24807,
        "num_comments": 1134,
        "created_utc": 1575936101.0,
        "selftext": "http://imgur.com/a/m7gxQBd\n\nMy roommate and I attend a university where we are given 250 pages *per semester* to print as part of our attendance. Well, we hardly used it since we have our own printer, so we went over to the print room and asked them if we could have our ~500 pages. They said that the pages were only for printing and not a quantity of letter paper we were entitled to. So we said okay.\n\nWe then went to 2 of the computers in the print room, opened word to a blank document, and printed our pages out. We then walked out with that thick stack of paper without being noticed. There has not been, and there will likely not be any fallout.\n\nEdit: My roommate is u/jpbthehuman\nEdit 2: added *per semester*",
        "permalink": "/r/MaliciousCompliance/comments/e8iews/we_get_250_pages_to_print_per_semester/",
        "comments": [
            "I went to a small university. \n\nWe had free black and white printing, copying, and scanning. \n\nWe had a \"limit\" of like 500 pages per semester. But I reached that limit when I was conducting a study of my own. I went to IT to get more added to my limit, fully prepared to pay for more, and the dude was like, \"does 1000 more sound good?\" And then he sent me on my way. \n\nI loved my university.",
            "That's awesome! At my university we get nothing, we have to buy ALL of our print credits!!\n\nI had to print a big term paper today and it cost me $13.82!! I only had $10 in cash on me so I had to pay for it with debit\n\nEdit: spelling, and because so many people are commenting about it. I own a printer but only have BW ink, and didn't want to buy a color cartridge. Since I've always had my own printer I'm not even sure exactly how much they charge. I think it's 10 cents per page for BW, and I thought it was 25 for color, but looking at the price I was charged for 23 pages in color that doesn't seem right. \n\nI figured it'd be worth it to just print at the school for once, but I was oh so wrong.\n\nAlso, please excuse my poor grammer in this post and my comment replies. I have 4 exams in the next 4 days. My brain is mush.",
            "You're a better man than me. I would have printed 250 pictures of a black submarine exploring the Mariana Trench during a solar eclipse.",
            "[deleted]",
            "I am a teacher. We were given 5000 pieces of paper for the ENTIRE year. It sounds like a lot, but with 100+ students, every test, worksheet, etc just DEPLETES the reserve. It's craziness.",
            "IT in higher ed here.  Students are super crafty.  We limited them to only printing 40 pages at a time, they figured out they can just print 1 through 40 and then just 41 through whatever in two separate jobs.  We removed their ability to print off \"copies\" of the same document, students just copied and pasted the same document over and over in the same file.  Hell, we found out students were circumventing papercut print release stations by using the USB slot in the printer.  We had to turn off all USB slots on all print release printers on campus.\n\nStudents always find a way I game the system.  I ain't even mad about it.  I always applaud their ingenuity.",
            "We got 125 a week and you better believe that I printed out blank sheets of whatever was left in my quota every week. I graduated years ago and my parents still haven't gotten through all the paper I gave them.",
            "What is funny is that it still takes up ink to print out the tiny yellow printer identifiers onto the paper, so it would have been cheaper for them to just give you the paper.",
            "Not to be that person, but why not save your ink and print your stuff at school until you run out of your quota then switch back to your printer? Isn’t ink way more expensive then paper? Or does the convenience factor outweigh that?",
            "Once I accidentally made my mate print out like 50 pages of the same document in year 7. He was printing out one page for me and one for himself, so when he left his laptop unattended, I added a bunch of documents, thinking it would show up as individual jobs on the printer and he'd just have to delete them all and be slightly annoyed. But oh no, why would it do that? He saw only 2 jobs, thinking it was his paper and mine, so he printed them both. He came back with a fat stack of documents and a really confused look on his face. The printer actually ran out of paper, so when someone refilled it, it continued printing. I thought I was gonna get in so much trouble, but no one knew, so I got of without so much as a slap on the wrist",
            "This comment has been edited and original content overwritten.",
            "Bruh students pay thousands just to be there and they're still limited on paper usage?",
            "In a lot of universities, printing can happen anywhere, including classrooms. It may be shady, but some folks just pop the tray and take a stack. It's not a good practice, but universities don't make it easy for you to spend money on things you need.",
            "I did this same thing at my school. We got $25 every semester (three per year plus summer). In my last semester, I had reached the maximum $100 in my account so I used it to print everything I needed for my DnD group that was starting after I finished school. The full descriptions of each players’ class (8 classes), each spell casters’ list of spell they could learn, combat tutorials for each player, blank monster stat blocks, blank spell cards, like 100 blank character sheets, item tables, d100 loot pools, and a bunch of other stuff I’m forgetting. At $0.07 a page, I still had like $50 in printing credit so I printed blank pages for notes and labeling enemies, etc.",
            "Dang. you just reminded me to use up all my print credits for this semester. I still have like 295 more pages left.",
            "Did you have access to a high speed copier as well? Print one page via the Word doc and then run it through the copier for 249 copies.\n\nDone that way one of you gets his 250 from the copier and the other gets 250 from the printer.",
            "I would've printed pictures of zebras with the caption \"horse\" underneath",
            "My school gives us $25 per semester, and black and white pages are 6 cents per side. Color is 23 cents. I almost never run out of printing money, but by the end of the semester, I think I’m going to about $5 over. It really sucks.",
            "So... I... I mean... shit, am I missing something? Are there people with a real need for paper? Is there a place I can donate to or for people like you that need... paper?\n\nI want to make fun of you but I feel like there is something tragic here I’m missing. Are you okay? Can I send paper somewhere to people in need? I mean I’m using 4 ream of paper just as a monitor stand and now I feel like a real ass denying some needy people their paper.\n\nWhat did you need it for?",
            "[deleted]",
            "Uninstall and reinstall the printer on the network.  If it's anything like my schools was, reinstalling the printer will get around the addware they are using to monitor the pages printed per student id.  Then print as much as you like.",
            "[deleted]",
            "That’s awesome! Nicely done.",
            "Lmao go gators baby",
            "its great to be a florida gator",
            "Wtf these guys get free prints but choose to pay and then do this shit? Are they slow?",
            "[deleted]",
            "My college had a similar thing. At the end of each semester, I got everyone in the Gamer's Guild to buy cheapo binders and use up their print quota with printing off rule manuals for various RPGs. We had quite the library by the time I left.",
            "I would have printed a textbook so people can use it for free.",
            "I would've just opened the printer.",
            "I graduated this year as a mature student. I'm too old in the tooth for the new paperless policy they brought in my final year. We used to have £30 worth of credit for the year and our tutors would print off our sizable booklets we needed for our classes. The medical and law side of our course is quite extensive.\n\nSo our first week, we were informed that we would now only have £5 for the whole year and our tutors weren't allowed to print off our booklets anymore. Anything over the £5 we would have to pay and top up ourselves. \n\nNone of us had ever ran out of credit before, so really didn't know how much the course material cost to print. We all went to print our booklets (like 80 pages per subject) meaning our whole allowance was used after just 1 subject and we crashed all the printers on 3 different floors. \nAlso it took forever, meaning we lost a whole day of teaching. \n\nAll the class was complaining. We weren't expecting to be charged this much just for the essential coursework. \n\nI didn't even bother printing anything and went back to class. I said to the lecturers that I wasn't printing them. I said the higher ups were trying to encourage us to go paperless then so be it. I'll just download the booklets to my laptop and if anything needs filled in, I'll just be handwriting. \n\nAfter hearing about this, the rest of the class did the same. \n\nThe very next day, all of the rest of the coursework was already printed out and an apology was made lol. \n\nPoor planning. They should have listened to the lecturers and did it on a needs based as I understand some classes didn't need such an amount of coursework printed. With notice we could have maybe sorted it. Instead of wasting time",
            "Great use of printer policy! However, you can save on toner by using the school's printers.\n\nAs a side note: way back in the early 1980's, my husband and I typed our college papers on an old manual typewriter. (We still have it, but it needs a new ribbon.) For nice, error-free term papers, we paid someone $1.00 per page to type it on a brand of electric typewriter called the Selectric. It had just enough memory for one typed line where the typist could correct it before moving on to the next line. This was cutting edge tech then! Have to say I like our current tech much better!",
            "When I was at college, they introduced a similar policy.\n\nUsed to have to use your student ID to acyivate the printer.  Students would get 100 pages per phase (it was a nautical college - we don't use terms or semesters - it's a rolling programme).  Staff would get 10,000.\n\nOne lecturer would \"accidentally\" leave his ID on a desk whilst he attended to \"urgent matters\" elsewhere.  \n\nThe man was a very outspoken critic of the policy.  The main college had issues with people abusing the system for personal use.  The nautical college generally didn't.  The real kicker - the nautical college provided a very high percentage of the funds to run the main college...",
            "The best bit is the uni probably had to pay the company that runs the printer for each blank page you printed",
            "Print count is tracked by software. Student Aids can't manually set those and IT staff isn't an administrator of said software. In fact we* don't have any idea who is. You did a smart in a sea of stupid.\n\n*Worked at ASU as IT support for CLAS for 5 years.",
            "Shame on you, wasting all that white ink.",
            "r/madlads",
            "Such a simple and pure MC, love it!",
            "Know what's more malicious about this?  Those big office printers are almost always leased.  And the company almost always pays by the page to use the printer.  So the free paper you got likely cost them a few pennies a page more than it would have if they had just given you a ream of paper.",
            "At my uni we got a fixed quota of pages we could print, and would have to pay for more. Cool thing was there was WiFi everywhere on campus, and networked printers in nearly every building, so you could just walk up to a printer to get its name, then use the school-issued computer app to find that printer and print to it (mostly black and white, the good printers were in the library and cost more from your page quota).\n\nThat said, the fixed quota wasn't nearly enough (obviously) - and bugs with the app meant sometimes you could send pages to print, but they wouldn't print, and yet your quota would be deducted. \n\nSo, I discovered later on quite by accident, *if you were connected via LAN,* nearly all the printers (even the good ones!) could be accessed directly via their IP address. And you could get that IP address by pressing the hardware buttons telling the printer to print a test/info page. I abused this loophole, especially on the high-quality color laser printers, *so much*.",
            "We had a student try to get around paying for printouts once. He was printing copies of his resume for the job fair. Set the printer to print 99 copies of each printout, then printed one from the computer.\n\nOur accounting method was to query the printer for pages printed before and after the job. He was charged accordingly, then had his account locked for tampering with the printer.",
            "We get $63 exactly per semester at Pitt. $0.07 per black/white sheet and $0.49 per color sheet. I have no English classes or essays to print for so I have printed out every 20 page double sided Bio lecture PowerPoints and so many color pages for my art class and I still have $19.53 left. \n\nI might print some lined paper since I always run out of it.",
            "I have never thought to do this with my remaining print allotment but I am now obsessed with this, so thank you.",
            "Well aren't you lucky. I attend a \"internationally recognised\" university and I have to pay for my printing every single time. Why don't they do this?",
            "You should create a marketplace for students who have unused credits to donate to students who have to print more.",
            "my final review plot was a hefty $72.50 and that was just the final drawings. my school gives us $20 for printing per semester, but professors ask for prints, models (don’t even get me started on that cost) every class... the system is rigged, why doesn’t any of my tuition go to printing or model supplies?? how come they spend $113 *million* on stadium renovations, while 50 year old educational buildings fall into disrepair??? \n\nlife is pay-to-win and colleges are the greediest, dirtiest business out there!",
            "250? I got 200 per course where I am\n\nMade use of some to print out a DnD players handbook, but that's about it.",
            "Classic UF printing lab",
            "Congratulations, you now have paper.",
            "When I was in college they had *paid* printers in the library.  It was only like 10 cents a page but the principle was ludicrous to me. So, what I started doing was hitting up the teachers lounge printer pretending to be a student aide.  Free copies for 2 years m’boy",
            "I used to work for a university computer lab and we basically always told students if they wanted blank paper they'd have to print it out. No one really cared but couldn't have people just taking paper whenever cause it'd be \"stealing\"",
            "I will admit I did this too. Should be on /r/frugal",
            "At our school it costs 20 cents to copy something but it is free to print. You can just scan the things you want to copy and then print them...",
            "Our EE department had that kind of page limit when you printed via the print server they had. But the printers weren’t fire walled off or ACL’d to only print from the server, so you could walk up to a printer, print the diagnostics page, and print directly to the IP shown without any limits",
            "lmao oh yes i remember sitting in the library and seeing students take up all the printers doing this. i always wondered if they actually used the paper or preferred to just be wasteful",
            "250 pages for free is better than most universities. My school was like 5 cents per sheet",
            "They actually stopped us from doing this at my University a few years back. If you print blank pages now they will just keep them. We have a similar system and I guess students were doing this en masse. I'll usually just print out an ebook or something. Can't let those print dollars go to waste!",
            "You’re University gives you free pages!? I’m at one of the largest in my state and we don’t get shit.",
            "$30 printing was built into the semester fee, so it’s a waste if you don’t print. $0.06 cents a print. Near finals I’d usually have $22-25 left.\n\nSince my hobby was firearms for sport, I’d print the rest in paper targets from black and white to colored (15 or 20 cents). Nothing crazy, just thick grid lines with a red box in the center from some website.",
            "Is this why we can’t get free healthcare in America?",
            "r/madlads",
            "You forfeited free printing so that you could spend money using your own (expensive) ink cartridges...",
            "Is it just me or is it super disturbing that a University is having every student waste 250 pieces of paper *just to prove attendance????*",
            "We had a print quotum as well. The printer was a PostScript printer that added a cover page with your name and student number, which counted against your quotum as well.\n\nProblem is, we needed to print some syllabi. Luckily, those were PostScript files, which could be sent directly to the printer. Also, invalid PostScript files might print a bit, but would not be counted against your quotum except for the cover page.\n\nSo the solution was a small script that concatenated literally the word `crap` to the file, and sent it to the printer in the middle of the night. It would print it faithfully, until it reached the crap at the end of the file. \"Oh dear,\" the printer would say, \"that's an invalid PostScript file. I better act like nothing happened and not count it against this poor student's quotum.\"\n\nThe next morning,I would find the document printed, waiting in the tray or on the shelve, only having had the cover page subtracted from my quotum.",
            "Just a note for why these policies exist: As soon as we implemented a 300 page per semester limit, we started saving $10,000 per month on paper/ink/repairs. That's your tuition money going to better things than that one dude who prints out a downloaded copy of his text books each semester.",
            "Why would you print at home when you can on campus for free? The paper isn't where the money waste is, it's the ink.\n\nI mean, seriously? There are much better things you could have gotten out of it. My college gives us $100 to print and I use it.\n\nOP getting karma for being a waste and throwing their own money away.",
            "FYI fresh paper has a static charge to it. If it runs through a printer this is lost. \n\n\nThis paper would very likely JAM another printer as the pages get pulled in multiple at a time. \n\nI learned this while on a service call in the late 1990’s where someone was printing their own letterhead and then printing on it a second time, in bulk.",
            "that's always so stupid to me. I'm paying you enough money you could print 50,000 pages a year and you're telling *me* what to do or how many pages I can print out??",
            "paper is far and away the cheapest part of the printing process. and printed pages at the school are likely counted as they come off the printer. so whether you use the paper from this year or next year you still only get to print 250 pages on their dime each year. this doesn't sound to me like the win that you think it is.... you basically got a free $30 ream of paper, had to sit around forever while it fed through some type of laserjet, and you still have to pay out the ass for you own printer ink?? maybe i'm missing something here....",
            "This reminds me, back when I was in college, whenever we needed to print posters for student clubs, we could get around the quota by crashing the print server with Ctrl + Alt + Backspace, as soon as the print job started.",
            "Shouldve printed 250 blacked out pages, using up all the ink.",
            "[deleted]"
        ]
    },
    {
        "post_id": "tc1vef",
        "author": "Aesthia13",
        "title": "My BF wanted me to do an IQ test to prove how intellectually superior he was.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tc1vef/my_bf_wanted_me_to_do_an_iq_test_to_prove_how/",
        "score": 24783,
        "num_comments": 1027,
        "created_utc": 1647037726.0,
        "selftext": "When I (F) was 17 at the time, I had a boyfriend who was VERY pretentious. I personally always found that funny, so I didn't mind. However,  he was hell-bent on proving how much more intelligent he was than me. \n\nOne day, he was bragging about an online IQ test he did and how smart he was. He begged me to do one as well. However, I had just smoked and was high so I refused. After some more begging, I decided why not? It could be fun. \n\nDespite being high I scored higher on the IQ test. He was so pissed it was hilarious! He never bragged about his IQ test again.\n\nAnother time, he really wanted to show off by playing chess against me. I'm really bad at the game and told him so. But I knew people who were good and they gave me the advice to never have a pawn that was not protected by another. So I did just that. Half way through I had captured most of his pawn and he raged quit!!!! AT CHESS!!! He flipped the board and broke some of his pieces.\n\n\nNeedless to say, a week or two after we were no longer together. I made him too insecure and he went back to his ex who he called extremely stupid...\n\nAt least he gave me A LOT of laughing materials for years to come.",
        "permalink": "/r/MaliciousCompliance/comments/tc1vef/my_bf_wanted_me_to_do_an_iq_test_to_prove_how/",
        "comments": [
            "anyone who wants and needs to prove that they're smarter usually isn't",
            "Anyone who wants to play chess only against people who won’t win has issues that need a therapist.",
            "Bullet dodged successfully",
            "I used to play chess with my wife, then girlfriend, and I was really impressed how quickly she went from not knowing how to play to being a real challenge. 30 years later she has 4 degrees and is principle scientist at her company. She's smarter than me, she makes more money than me, she's better looking than me. All because I'm good to her and can make her laugh.",
            "My xhusband was like this, but much more covert. He would likely act like neither bothered him, or invalidate the test & say he was taking it easy on me with the chess game, or “punish” me somehow, hours, days, weeks, months, or even years after.\nAs we speak, I’m trying to talk my daughter back into going to college because his self-worth is SO wrapped up in how smart he is, that he convinced her she’s not “college material” so she couldn’t surpass him. I know that’s what he’s doing, as farcical as that seems, because he did the same with me. Then, when I went back to school a few years ago, & especially when he heard about my 4.0, he wouldn’t pass up a chance to laugh at my “easy” classes & my major in Psychology, AKA “unemployment”.\nSo freakin’ slimy. \nGood job putting that creep in his place!!!!",
            "The fact that he bragged about getting a high \"IQ\" from an \"online IQ test\" tells a lot about how intelligent he is.",
            "What a fragile individual",
            "Around 20 years ago, I worked with a guy named Thomas who always thought he was smarter than everyone else. He had taken an online IQ test and bragged to everyone at work about his score of 145. He tried getting all of us to take it and would ask about it every day. I finally broke down and took it just to shut him up and scored 149. Surprisingly, that did not bother him as much as I expected.\n\nThere was a girl named Kristy that also worked with us who he kept pestering to take the test. She confided to me that she had already taken it, but scored much lower than Thomas. She did not want him to know because she knew he would never let her forget. I told her to just tell him she finally took it and scored 155, because I knew that would drive him crazy.\n\nLater in the shift, Kristy tood me that she had told Thomas she had scored 155 on the test. He did not believe her. He knew, beyond a shadow of a doubt, there was no way she scored higher than him. He told her the only way he would believe her was if she sent him a screen shot of her score. I told her to let him know that she would email it to him.\n\nThat night, I went home and took the test again. I knew which questions I most likely got wrong, so it only took me a couple of tries to have the correct answers to all of the questions. I printed those out and took them to Kristy the next day. That day, she told Thomas that she forgot to email him her results but would do so the before work the next day.\n\nWhen I saw Kristy the following day, she was grinning from ear to ear. She said she had to take the test a few times to miss the right number of questions and finish in a time frame that gave her a 155 score. When she did, she emailed a screen shot to Thomas. He was very upset that she had scored higher than him.\n\nI made a point of rubbing it in when I saw Thomas that Kristy was smarter than him. He still couldn't believe it, but could not deny the \"proof\". The second time that I mentioned Kristy's higher score to him, he smugly said something like \"Well, she scored higher than you, too.\" I just looked him straight in the eye and said, \"The difference is, it doesn't bother me that Kristy is smarter than me. I know it just kills you, though.\" He went on for the rest of the day about how he couldn't believe Kristy was that smart.\n\nOnce in a while during the time I worked with Thomas, I would bring up the fact that Kristy was smarter than either one of us. He passed away a few years ago. I never did tell him what really happened.",
            "My wife is crazy smart. I never really understood this bit, but one of the things she really liked about me when we first started dating was that I was cool with it. I never tried to claim that I could also get a PhD if I wanted nor tried to diminish her for intelligence.\n\nIt was apparently a problem she always faced with guys she dated for some reason. I still don't get why. Who would be anything other than flattered if a smart, beautiful woman likes you?",
            "Great story. He's probably still mad. \n\n(Point of information: You do know that those online IQ tests are invalid, don't you?)",
            "Dating is designed to weed out losers; which you did.",
            "\"People who boast about their IQ are losers\"- Stephen Hawking",
            "I have an ex who was a snowboarder while I was a skier. I was healing a broken ankle at the time, but I could ski very gently on easy slopes without issue (not the smartest decision, but I never said I was smart). He wanted to try skiing. I offered to hook him up with another skiing friend to teach him the basics because I was neither in condition to teach nor was he the kind to learn well from a romantic partner (which is totally fair). He refused, and made a point of announcing multiple times to \"don't feel bad when I pick this up quickly. I'm just good at this stuff.\" He insisted on running an advanced run. I told him I wasn't comfortable with my ankle the way it was but he begged and I surrendered. At the top I reevaluated and decided it was not a good idea, and took ride of shame down the lift. Needless to say, I enjoyed casually skiing up to him on my ginger lap at the bottom of the hill to help him untangle his limbs from an otherwise easily avoided crash had he taken my advice to seek lessons and start small. He called it quits on the skiis only a few runs in, and we didn't last much longer after that.",
            "I had a girlfriend once (no, I did, honest... stop interrupting) who was really good at chess having played in tournaments as a teen & she challenged me to a game.  \nI wasn't really interested in chess but I knew the rules.  \nSo we sat down to play, both of us fully expecting me to lose, quickly and badly.  \nLong story short, I had no idea how to play offensively so I just settled into full on defence mode and stayed that way... for several hours.  \nWe abandoned the game in the end when she decided that she just couldn't beat me.  \nMy ineptitude made me entirely too unpredictable and there was no way she could lure me into any traps 'cos I was too dumb to recognise any of her bait. lol  \nHappily, she didn't have an egotistical bone in her body, so we were both able to laugh about it and it wasn't an issue.  \nOf course. we never played again. 😁",
            "Anyone who needs to brag about their IQ is super insecure.",
            "[deleted]",
            "Did he do one of those \"If you can name these 3 plants, you have an IQ of 142\" tests?",
            ">\t he went back to his ex who he called extremely stupid…\n\nYou’d have to be to date some with that fragile of an ego. Lol",
            "Lol one of my brothers has spent his life hell bent on making me look stupid. I ignored it as it wasn't worth the battle against his arrogance.  Just the other day he popped off with one of his usual snide remarks and I finally confronted him on it and told him my documented IQ score. Instant silence from the peanut gallery and he has been oddly pleasent ever since lmao.",
            "Smart people don’t need to brag about being smart … and most smart people realize there are loads of things they don’t know",
            "It's actually sad that many men are intimated by smart women.  I find it to be an incredibly attractive quality.  Where's the fun in perceiving oneself to be mentally \"superior\" than the other?   \n\n\nBeing a \"power couple\" is #relationshipgoals",
            "Reminds me of my first bf (of course now ex)\n\nWe were studying the same major and we had this class together really hard and difficult to understand. For some reason I was good at it and the day after one exam the teacher said there were only like two perfect scores and so I told my bf \"hey, I'm sure I'm one of them\" and so he goes \"yeah, sure, whatever\" and even after explaining how I thought the exam was easy and everything he still refused to even look at that possibility.\n\nNext day our teacher returned our exams to us and, as expected, I was one of the perfect scores and the teacher even asked me to be her assistant next semester. Bf was pissed and, even tho it took me a while and some cheating on his part to take action, I broke up with him eventually.\n\nCurrent bf won't even hesitate to call me smart. Hope you too find someone better ♡",
            "The real IQ test is how long you stayed with him.",
            "Tbf neither proves anything, losing once at chess and having a lower score in an online iq test is both worthless. Getting mad about either is pretty stupid already",
            "I dated a girl in high school who begged me to take an iq test that she had taken online, and in her defense she scored pretty high on it like a 135 or close to that. She always had to be better than me at everything so she figured I wouldn’t do good on the test and had me take it as well, and she was right I had to guess my way through the test and my iq score came out to be 159 and I remember just looking at her and saying damn I guess you are the dumb one in this relationship and her dad busted out laughing",
            "If you're dumb you want a smart partner to help you navigate life. If you're smart you want a smart partner to respect and keep you on your toes.",
            "It is hard to be happy when your ego insists you must constantly reinforce your self image by comparing yourself to others.  True happiness comes from accepting you aren't special and working to be better every day.  Some others will be better than you - learn from them.  They aren't a threat, they are a potential teacher.",
            "He was obviously somewhat right about his ex - she took him back.",
            "When I was 17, I was with a guy who had a proven very high IQ. He was already taking university courses in Switzerland because he had skipped a few classes. He always said “it’s good you’re pretty because you sure are stupid”. One day, I visited his advanced physics class that was also in English for an extra challenge for the students (at university). \n\nI knew an answer he didn’t. I had never been good in physics in my life, it just made sense to me in the moment. Don’t remember exactly, something about a vacuum. \n\nGlad I’m rid of him :) I never had problems keeping up with people intellectually, far from it, and have a masters degree nowadays. He actually failed his studies.",
            "Anyone bragging about their IQ score from a website has been deceived by that website. That's the kind of idiot that those scammers prey upon. Hope he didn't pay for that score result. Lol",
            "And then they all stood up and cheered with tears in their eyes.",
            "Why do I feel like Ive read this story before somewhere? 🤔",
            "This happened to me when I was 17. Although I'm old so there wasn't an online test,  but rather one that we took at school as seniors. (You also took it in middle school in my state but I didn't live here then) My bf at the time was a pretentious fuck who had a decent IQ (from the middle school test) and had been lording it over people for years. Everything was fine until I took my IQ test and scored 10 points higher than him. Now,  he wasn't jealous (like in OPs story), but became obsessed with me not \"showing\" how smart I was. He had preconceived notions of what smart people did and bothered me all the time about not doing them. \"You should use bigger words. You need to remind people that you are smarter than them. When you disagree,  you should tell them you are right because you are smart.\" Obviously,  that relationship wasn't going to last.",
            "Comparison is the thief of joy. \n\nThis guy will never be happy until he learns to accept humility.",
            "The man clearly did not want a partner, he wanted a fan.",
            "I'm pretty sure that wanting to feel superior to your partner is a red flag",
            "How is this malicious compliance?",
            "I prefer partners who are smarter than me. Gotta have someone to keep my smooth brain in check",
            "I've been married for 35 years and have never had the inclination to compare my intellect to my partner.  She's my foundation and reason for living.  I don't see how any measurement of our partnership would be productive.  I'm grateful that we are sill together and awaiting grandchildren together.     Keep looking and don't settle for less than someone who wants to share your life as equals.",
            "In the end it is not how smart we are, it is how we treat others that matters most.",
            "Man, my absolute favourite thing about my gf is that shes smarter than me. She understands the bullshit i spout about my hobbies, and her work is super interresting and shes smart enough to explain it to me. I love that i can learn something new from her on a near daily basis.",
            "lmao, rage-quitting chess after claiming you're so smart is top tier cringelord mindset.\n\nWhat a sad little life he must live",
            "A friend of mine took a 5 question online test years ago when dating sites were using the quiz as a marketing gimmick.  She scored something like 160, and it changed her in a good way.  Ever since then, she has believed that she is a genius, and this has greatly improved her self confidence.  I never told her that this silly, multiple choice quiz was probably not a true indicator of her intelligence, and I never will.  She's one of the kindest people I know, and she's full of self confidence.  That's what's important.",
            "My fiance is definitely smarter than me, but she has never once beaten me in chess, it's not a good measure of intelligence",
            "My ex long term bf (27M), when I asked him, told me that he is smarter than all of his ex's, so I asked him does he think that he is more intelligent than me. He said shyly \"Yes!\" So, I decided we should take an online IQ test. I scored significantly higher than him. He then said that the problem was in the test, so I proposed to take another. And we did, but this one I scored even higher. \n\nMonth after, he told me that I may be more intelligent than him, but that he knows a lot of the things I don't. Didn't see the point, still don't. I told him: \"I know things that you don't know too. It means we have different interests, nothing else.\" On top of that, he needed to add that I lack social skills unlike him (the truth is quite the opposite).\n\nAlso, he later insisted that we should play chess together, but we didn't. Starting to think it could have something to do with the break up.",
            "I think all you people need to get your act(s) together.  lol",
            "I feel like I’ve read this already",
            "Frankly, I find the chess story pretty hard to believe. No matter how smart you are, there’s no way you are going to beat someone who actually knows the game.",
            "lol that is great. sounds like a narcissist. a buddy dated one. one day she pretty much forced me into a \"match with mesna\" quiz book.i eventually said sure. i out scored her on a few tests and she lost her shit. like a switch flipped or something. it was hilarious.",
            "Lol I dated a guy who was proud of his IQ number, I asked him what it was but he refused to tell me unless I told him what mine was. I told him, then he said his. He just added ten points to mine and said that was his score. I've never taken an IQ test in my life.",
            "Lol where's that classic story about the guy who had two girlfriends. He was a Dom and they were subs. He made them all take IQ tests to officiate that he was smarter and they both scored better. Wish I could find the original.classic!",
            "I took an IQ test and scored 134. I didn't think that was very good but I told my wife about it. Well she had to take it to to show me up. She is an RN and I'm a factory worker, so she thought she was far smarter than me. She scored 121, but she wouldn't tell me what she scored. I had to go back to the site and look it up myself.",
            "Who believes this dumb shit? 0/10",
            ">Needless to say, a week or two after we were no longer together. I made him too insecure and he went back to his ex who he called extremely stupid...\n\nOn the bright side, you know his \"dumb\" ex, is *still* smarter than him! XD",
            "People who boast about their IQ are losers\n\n- Stephen Hawking\n\n\n\nI don't give a fuck about your IQ\n\n- sun tzu, the art of war",
            "Funny enough, IQ pretty much exists to center the idea that whiteness means one is \"superior\", but it really doesn't hold up. People can have disorders and disabilities where cognition and problem solving is concerned but overall we just take some specific tests and like to try and hold up an idea of hierarchy. It doesn't mean anything, it's racism not science.\n\nAnd so this boy using it to posture and try to lord over you is thematic, and continuing the tradition of these sad blustering men needing to be able to push down on others to feel valid themselves.",
            "Sounds toxic as all fuck. Good you put him in his place. Respect",
            "Anyone who boasts about IQ tests has never seen that episode of Frasier.",
            "The dude is a walking red flag. Yikes",
            "I'm glad that story ended with you breaking up.  That guy was a future abuser without a doubt.",
            "Dump him and ask him why he wasn’t smart enough to see that coming",
            "IME people who brag about being smart, don't tend to be.\n\nAlso, Dunning-Kruger.",
            "This reminds me of a story. I was also 17 at the time, and it happened at school (no phones allowed). My boyfriend had frozen a water bottle the night before, and it had partially melted. He said it was interesting how it looked like there was less water now, even though he didn't drink any of it. I said, \"yeah, that's because water expands when it's frozen.\" He said, \"what? No it doesn't.\" And I said, \"well, you literally have proof in your hand.\"  \n  \nWe went back and forth for a couple minutes, with both of us insisting we were right. So he says to me, \"I'm gonna ask [smart male student].\" Then he finds said smart kid, and asks him, \"does water expand when it's frozen?\" And the kid says, \"uh, yeah, I think so. Pretty sure.\" AND THIS MF BELIEVED HIM IMMEDIATELY. He just needed confirmation from an Intelligent Male^TM",
            "That's the dunning-kruger effect. Smart people are usually smart enough to realize they arnt that smart and that there's nothing to brag about.",
            "Thinking an IQ test is an accurate measure of intelligence is stupid, thinking an online IQ test is an accurate measurement of intelligence is just ridiculous.",
            "The 'ex' may indeed be stupid..... if, she took him back again.",
            "I’ll never understand men that want to be “smarter” than their girlfriend or significant other in general. How insecure are they that they need that in a relationship. Frankly in a plethora of ways I’m way dumber than my wife even though she doesn’t think so. For example I suck at math and I dropped out of high school and immediately got me GED because of a rough family situation as a teenager. So I literally have like a slightly higher than 10th grade understanding of math (I taught myself some things). She on the other hand graduated high school and has damn near gotten her associates degree from community college. Why she thinks I’m more intelligent is beyond me because it’s simply not true.\n\nEdit: perfect example I forgot to break up my post into paragraphs 😂",
            "Reminds me of that video where they have a bunch of people with high IQ’s rank themselves and the pretentious person got dead last lol",
            "Hes not that superior himself if he thinks an iq test in an accurate gauge in intelligence...",
            "Eewww, small d*ck energy 🤮",
            "So glad he is a past tense sort of memory for you.  You didn’t deserve that!  Rage quitting because some online test said he was smart is 24 kt. stupid.   Had you two stayed together, there is a significant potential for abuse.  He sounds incredibly insecure.  Glad you are no longer with him.  Guys who think their intelligence is proven off some Buzzfeed IQ test, not only lack intelligence but truly intelligent people will laugh at their pretentiousness.",
            "Every single person that has told me how smart they are has one thing in common.",
            "I've a mensa certified iq of 161. That's genius level iq, top 2% of the world.\n\nIt means nothing. It has nothing to do with how intelligent you are, or how successful you'll be. My brother scored 1 point higher than me and spent 10 years working behind a bar then another decade selling mobile phones via the telephone.\n\nIt just means your good at pattern recognition, spatial awareness and problem solving.",
            "Pedantry backfired lol",
            "If you have have to prove you’re something, you’re not.",
            "[deleted]",
            "\"People who brag about being smart aren't very smart\"\n\nI'm not quoting anyone, that's just my life experience so far.",
            "It seems from his tantrums that his IQ test results were negative!",
            "You cannot form a partnership with someone who competes as an adversary",
            "You were well rid of him. If he hasn't had a major come-to-Jesus moment about how terrible his attitude is, then I pity anyone who sticks with him for the long haul. It would be exhausting to have to deal with his childishness, insecurity, and fragile ego day in and day out. Who the hell wants to be with a person who is only satisfied when he can treat his partner with contempt?",
            "A better prank would be to deliberately do bad on the test so it gave you a score that indicated you had a mental disability, then he could feel guilty for taking advantage of you.",
            "Worked at a school with one teacher who bragged about his iq and his per km time on the treadmill. Half a dozen of us did the standardised end of year test for LOLs, then we also ran a 2k around the oval.\n\nGuess who came last in both",
            "Well, his emotional intelligence is quite low.",
            "I had a college roommate who was like that.\n\nI don't play chess. He did. I finally gave in and played chess against him while he had a few customers over (he slung weed), I lost within 3 minutes or so.  So I asked for a rematch.\n\nI still lost, but I managed to drag that fucking game out for 45 minutes. Meanwhile his customers were bored as shit and just wanting their quarter ounces.\n\n He never asked me to play chess again. I still can't play chess.",
            "anyone who takes an online IQ test is not as smart as they think",
            "Being smart is pointless if you're not also wise.",
            "Arrogance without the intelligence to back it up and play it off more subtly is probably one of the least sexy ways to come off",
            "I was like that when I was a teenager too.  I don't know how old y'all are now but I'm willing to bet he's changed and matured.\n\nAlso, online IQ tests lmao, what bullshit.  I once did one and got 144. I then obviously bragged to everybody I knew that I was a 15 year old with an IQ of 144.\n\n20 years later after many poor decisions, a failed attempt at post secondary, and a career in the trades, I can tell you with certainty that my IQ is not 144.",
            "IQ tests are astrology for incels and you can't change my mind",
            "I remember I had two coworkers arguing about which of them was smarter one time(they’re cousins, and pretty childish), and I just pointed out to them I’ve never had to tell anyone I’m smart to be treated as such. This reminded me a lot of that.",
            "Chess is not an IQ test. It takes hours of practice every day to improve",
            "My ex and I played chess online and he consistently beat me. He was more experienced for sure. I asked him how he approached the game and he said the classic - plan your moves in advance. Ok I said.  Then one day I saw an opportunity he’d missed and got his king in check and said ‘Check!’. He stared at the board and said no, it’s checkmate. And he was furious. Because I beat him. SMH",
            "My IQ is 95, damn near perfect score.",
            "Believing in online IQ tests is itself an IQ test.",
            "I'm 100,000% sure we dated the same guy",
            "> ...he went back to his ex who he called extremely stupid\n\nHow did he know, did she take an IQ test?",
            "This same thing happened to me with gf wanting to do them. I got 137 (because online IQ tests are dumb and I'm pretty sure I should be in the Gump range) and she got 98. She was not happy",
            "Oh I had a boyfriend that dumped me for beating him at chess too. \n\n\nThe bad part is I’m not that good at it and had only learned like 3 months prior but I did a similar approach. \n\nHe said “you don’t even know what you are doing, you won by accident “. \n\nI replied “Yeah buddy that either means you are super bad at it or it’s not as hard as people make it out to be. Which is it ?” \n\nOkay maybe my reply was why he dumped me. \n\nBut whatever not the first guy to dump me for being smarter than him and probably won’t be the last. \n\n\nIt’s worth noting I’m one of those people with a bimbo personality but am not, strictly speaking , a bimbo.",
            "Sounds like this guy cared more about his ego then you. Good on you for dodging a bullet there lol",
            "IQ tests online are bullshit\n\nWhy? Because even IQ tests at a trained psychologist are questionable in how valid they are. \nThey measure a set of tasks that we interpret as displaying fluid intelligence but it cannot measure intelligence perfectly simply because noone can produce a clear accepted definition of intelligence\n\nSo overall being consciencious and hard working is more important for success than IQ (well and being born rich is very useful)",
            "So funny. There was this guy once who was like this, full of himself who always berated his girlfriend in front of others and the thing that gave me the most pleasure was when the group got together and played trivial pursuit I always kicked is ass, he was so furious it was so funny. What he didn't know and I never told him was that despite me having reasonable knowledge, I had spent a lot of time playing that game when I was younger and a lot of the questions I remembered the answers to.",
            "Not seeing anyone say it but damn that's a good advice for chess. Imma look it up and use it next time I play chess",
            "Those online IQ tests are dumb I always seem to get a really high score like 150 high. I really doubt I am anywhere near it.",
            "LPT: These tests are garbage, even the official ones. The highest scorers have retaken the same test many times after a wait period. So if someone does this to you, delay and do the test in secret, then when they are watching take the test again with everything you learned the first time and blow them out of the water.",
            "Ohhhhh.....\n\nI am one of the unlucky people that scores high on those tests. It doesn't make me smarter. It simply means that my brain is a bit non-typical. \n\nI firmly believe that those tests are a useful tool, but the do better at measuring under than over. \n\nI hate, hate, hate talking about IQ due to some really bad experiences in high school concerning SAT scores...and not-so-great experiences in my career around \"perfect\" scores on skills tests. \n\nI eventually learned that the world is a much better place if I make sure I get a few answers wrong. \n\nSo...my ex had this thing about his intelligence. Don't get me wrong, he was an intelligent man. Just not as intelligent as he thought he was. I thought it wasn't important, and so what did I care? The conversation came up a few times about my IQ scores, and I would always dodge the numbers. \n\nWe had been together for a few years when he boxed me in. I don't remember exactly how it came about, but he surprised me with an at-home IQ test. A thing where you took the test under supervision, then mailed it in. \n\nHe said I needed to know, once and for all, exactly what my IQ was. And to make it fun, he would take a test, too, and we could compare scores. \n\nWell, shit. \n\nI finally agreed just to make him stop bugging me. I figured I could do my usual...deliberately miss a few. And he would be happy. Not a problem, right?\n\nHe gave my test first. I tried for middle of the road, where it wouldn't be obvious I was tanking the test, but not too good. \n\nThen I gave him a test. I wasn't being all that serious about it, and somewhere in the middle I got restless and left the room to get a glass of water.\n\nI walked back in...and found him CHEATING. (The kit came with an answer key.)\n\nI laughed. \n\nHe got offended. Told me he wasn't cheating. He was just checking. He wouldn't change any wrong answers. \n\nSo after I finished laughing,  he insisted on finishing the test. \n\nHe mailed them off. By this time, I wasn't worried anymore. How could my score be higher when he cheated?\n\nYeah....my score was higher. \n\nPoor guy.",
            "I once wound up at a small board game party where a new student at my law school was bragging about how great he was at a particular game we were going to play. I won't even mention the game, because I feel like anything less abstract than \"there is a game in existence I am really, really good at\" would be bragging too much.\n\nAnyway, I was really, really good at the game he was bragging about. I didn't have much to say while I was mopping the floor with him, and he didn't have much to say afterward.\n\nHe is now a judge.",
            "Pawn E4",
            "Looks like he had some issues with his own intelligence and was trying to validate it by trying to show he's better than you... he failed and faced reality, better sooner than later I guess. Also sounds like he had anger issues... bullet dodged.",
            "Love this, good on ya chick he sounded like a right tw*^.  Go get yourself a decent fella, trust me there are some left out there.  I found being a stoner blokes always had me down as stupid and thought  they could walk all over me.  Er nope, no you can't.  Took me 10 years to find a decent guy and we have been happy together for 4 years.",
            "Wouldn't a moderately smart person know you can win a game of chess without most of your pawns? The whole point of the game is that you can almost always get out of a tight spot if you're smarter than your opponent. So he really just proved himself wrong by throwing the game early",
            "That is sad, just sad. Good riddance to him.",
            "Omgosh my idiot x did try to do that to me years ago. I always just thought it was part of his weirdness but you just made me realise why. \n\nNo wonder he almost self-combusted when I beat the snot out of his score. You’ve made my day.  Congratulations on your smart choice to get rid!",
            "One of our first bonding things my wife and me had was reading books on the topic and then taking an official IQ test - we bet a bottle of wine for the higher score and drank it together :) celebrating 10 years of marriage this year!\n\nIf you ever get competetive about it, you're doing it wrong.\n\nGood on you, OP, that this is an ex!",
            "There are better people out there. Tell him why, and make him an ex. Life is short, spend it with people who respect and care for you.",
            "Tell him an real IQ test is incredibly long, tedious and boring. Any test u find online is not accurate in the slightest. I did one online and it said I had an IQ of 180... I do not have an IQ anywhere near that.",
            "Surprised it needed to be him to leave you",
            "Came for a funny story, left with a cool chess tip.\nThank you!",
            "Why is this posted on /r/maliciouscompliance?",
            "Haha. You're the best, OP! I love watching people who think too highly of themselves being thrown back to their place. You're a great woman, so don't let that kind of idiot make a fool of you.",
            "What's funny is that IQ doesn't make a person smarter.  It just means they have the capacity to learn more...  You can have a super high IQ and still be a total idiot...",
            "My ex-wife would find ways to remind me that she graduated from Texas A&M. I sent to JC. She came across an online intelligence test and talked me into doing it. It was a timed test that measured how quickly you processed information, not your education level. I scored much higher than her. She got very upset.",
            "Better off without him.\n\nI was with someone who kept praising my intelligence. I would throw round the conversation saying I might slightly beat her in terms of IQ, but she runs rings around me in terms of EQ.",
            "Reminds me of what happened with my wife and I a couple weeks ago. We both think it’s very funny, so everything below is in fun.\n\nMy wife is very smart, a teacher with multiple degrees (not saying degrees = intelligence, just giving info). While I wouldn’t consider myself a genius, I do think I have a decent head on my shoulders.\n\nShe sends me a link to an online IQ test saying she and her coworkers had taken it and was interested in what I would get. Turned out we both got the same score, but I completed it 4 minutes faster than she did (4 minutes to 8 minutes). While I know question and time taken is weighed differently with the test, the running joke in the house is how I’m 4 minutes smarter than her, or if she doesn’t get something I do, she will in about 4 minutes.",
            "I scored 142 on an actual IQ test and I’m dumb af.",
            "Some men are so shit lol",
            "His ex took him back? Apparently she *was* pretty stupid.",
            "Haha, so many high school douches be like that - what a fucking muppet.",
            "Anyone who thinks an IQ test or an MBTI test is a valid indication of anything shouldn’t be taken seriously",
            "Alternate title: my boyfriend is an insecure loser",
            "Smoking weed at 17 will lower your IQ tho… facts. The human brain at 17 years is not fully developed. Just saying… and I am all for weed being legal.",
            "My hunch was confirmed once it sounded like he needs to prove how intelligent he is. Your story did not disappoint in the least!",
            "Oh my god this dude sounds insufferable",
            "I did sort of the same thing in high school. I hated school, a C student, no plans for a big college, bf was on track for big things. He always kind of put me down (first boyfriend, I was shy and awkward, VERY different from how I am now) and I kind of took it.\n\nHe was going to take College Prep Reading and challenged me to take it and compare grades. At the end of the semester I had missed one vocabulary word on a test, the only thing I missed in the entire semester and I ended up with an H for Honors and he got a B-.   \n\n\nI ended up going to college but dropping out with a great career in the hotel then casino industry, he is indeed a great businessman as he wanted to be and we keep in touch once in a while. I can tell I intimidate him now because I knew what his “buttons” were, so it’s kind of funny. We’ve also laughed over that reading prep class when he dug out his transcripts a few years ago when his daughter was going to our old high school.\n\nNEVER let a guy tell you he’s smarter than you. He only tells you this in hopes you won’t notice that he knows he’s not.",
            "Never met anyone older than 13 and genuinely smart with a need to tell others about how smart they are. When someone is truly smart, people around them know it already.",
            "He did an online IQ test.\n\nAnd took it seriously.\n\nThat's fucking hilarious.",
            "You dodged a bullet there with that one very classic narcissistic behavior",
            "The Dunning Krueger effect incarnate",
            "Get high and then get high scores!",
            "Pro life tip: don’t date glaringly insecure people.",
            "I consider myself pretty smart (well more like I've been forced to acknowledge how many stupid people there are), but I have absolutely no issues having a SO smarter than me. That would actually be preferable.\n\n\nEdit: That sounded a little pretentious, I am self aware enough to know that it's about a 50/50 shot someone at my work is smarter than me (even \"if they are female\").",
            "Tell me you were able to safely get out of a relationship with a toxic manchild without telling me.\n\nGlad you're safe and free of that jerk.  Also you rock!",
            "Related, my ex would constantly try to test me on stuff one day he tested me on countries based on flags and I didn’t know most of them, learned to stay away from people that try to make you feel less based on how much you know…",
            "The pass mark was leaving him.",
            "He couldn’t stand being with someone “smarter” than he was. Needs someone to tell him “wow you’re so smart and wise, teach me more!”",
            "My dad likes to go on about how good he is with math. He knows the 4 basic operations and that's it. No square/square root, no sin/cos, no logs. He never took algebra, geometry, trig, calculus. But he thinks he's so smart because he can multiply 2 numbers together and he brags about it all the time.",
            "Tbh I think chess isn't even a good indicator of intelligence. The perception is probably the result of their histororical significance. I'm an avid chess fan and I'm decent at it because I practice and played a lot. It's the same as how I'm good at certain type of games because I play them a lot. \n\nIirc IQ tests are also not an indicator of intelligence. Richard Feynman's thoughts on the subject is definitely something yall should look up if you're interested",
            "i 100% want a girlfriend thats smarter than me. that’s hot stuff",
            "Jokes on both of you.\n\nIQ tests are under fire a lot because most people who do studies around the topic \"intelligence\" don't think it is too accurate a measure.\n\nAnd especially online IQ tests mean shit... like really....they mean NOTHING.",
            "OP to now ex-bf: \"This isn't going to work out. I need someone a little bit smarter.\"",
            "Lmaooooo. Thanks for the story and the chess tip!",
            "He sounds nice.  You made the best choice.",
            "online iq tests typically aren’t even accurate so him using that to brag about his intelligence is ironic",
            "My wife is vastly more intelligent than I am. I have never once felt inferior.\n\n\nSide note - after she got pregnant, her ability to recall information was permanently deteriorated.  I joked that our baby stole some of her brain.  I usually don't bring it up unless it's relevant, which is never.",
            "Awww poor fragile little boy finds out he’s not the main character 🤣😂😂",
            "I've known a few high-IQ people who have found ways to brag about their IQ scores.\n\nI have never known a smart person who's bragged about it.  And, when it actually has been relevant to discussions and I've found out what it is, it's usually somewhat higher than the people who do brag.",
            "He'd have to be really insecure to brag about an online IQ test! Those tests aren't accurate at all. I got 160 on one of those test and I'm obviously not nearly that smart. Almost nobody is that smart. I've also gotten as low as 90 on online IQ tests. Isn't the average IQ score 100? I'm not a genius but I'm sure that I'm at least average. Although, I bet most people who are below average think that so who knows.🤣",
            "I am sad for him. And his ex. Or is it a re-ex? A T-rex? Nevermind.",
            "This isn't malicious compliance.",
            "My ex was the same way. So I went and took the MENSA test and passed. Told him to do the same thing to see who scored higher… he never did, lol."
        ]
    },
    {
        "post_id": "urczov",
        "author": "ChiefSteward",
        "title": "Discipline Me for Being 22 Seconds Late Without Notice? Got it! Won't Happen Again!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/urczov/discipline_me_for_being_22_seconds_late_without/",
        "score": 24773,
        "num_comments": 1299,
        "created_utc": 1652756623.0,
        "selftext": "EDIT: By request: TL;DR at bottom. \n\nThis happened several years ago because it was some malicious compliance that lasted for years.\n\nMy former employer uses a points-based system to track attendance. The parts of the policy relevant to this story are:\n\n\nTardy with call-in prior to the start of shift: 1/2 point\n\nTardy with no call: 1 point\n\nAccumulate enough points and you're fired\n\n\n\nThere's a set of train tracks crossing the street that leads to this facility. Occasionally, trains will stop while blocking this crossing. If you're caught there in the last few minutes before you're supposed to clock in, you have a decision to make: wait or go around. Either way, you might be late. Sometimes you'll decide to go around and then the train clears the crossing and the folks who waited get in before you. Sometimes you'll wait and watch through the gaps in the train cars as folks who went around pull in to the parking lot while you're still idling at a blocked train crossing. To be clear, \"going around\" involves taking a lot of secondary county roads as well as a few field access roads (it's an extremely rural area), so you literally never know what kind of road conditions you're going to find along the way around. The roads may even be entirely unusable during the winter months where snow covers them.\n\nOne night, during my years on third shift, I was stopped at these tracks and decided to wait. Eventually the train moved on. I raced into the parking lot, used my key card to zip through the turnstiles, and ran to the punch clock. My clock in time was 10:30PM.\n\nThey have these biometric punch clocks that read your fingerprint to clock employees in and out. Sometimes these clocks just will not read your fingerprint. I got to the punch clock and it said \"10:30\". I'm golden. It doesn't track seconds. I entered my employee ID number and placed my finger on the sensor. Three beeps: failed read. Tried again. Three beeps. Tried once more. Three beeps. Nope, not trying again because by this time the clock was likely to tick over to 10:31 in the middle of reading my finger.\n\nWhen I got to my assigned work area, I told my team manager what happened. He said don't worry about it, he'd manually punch me in.\n\nI should have listened.  But I'm a worrier. \n\nIn the morning, when the front office people started showing back up, I went to the attendance office to confirm that my situation was all good. The office administrator decided to check my \"gate time\", and use that as the determining factor. I scanned my key card at 10:30:22 PM. That's a tardy, no-call. One full attendance point to be issued. I reiterated that it was a train stopped on the tracks, completely beyond my control. She advised me to either leave earlier (and just wait an extra half an hour for my shift to start on the majority of days) or else get a cellphone (I didn't have one at all back then) to call in with from the road next time.\n\nWell, what I did instead was start calling in absent \"just in case something comes up after I leave home but before I arrive at work\" in the evenings before leaving for work. The first few days the attendance office up front was just bemused. After weeks, they became annoyed. After months, they'd apparently complained enough and I finally got told to stop. During the course of this conversation they revealed that calling in too early before the start of your shift made it extra challenging to make sure the notice gets to the right members of management, because the message is no longer flagged as \"new\" by the time they're creating logs for the next shift.\n\nThis was great news for me. From then on, every morning before leaving the premises at the end of my shift, I used one of their phones to call in absent for my next shift that evening.\n\nThey tried to write me up for insubordination but the labor union slapped it down, pointing out that the collective bargaining agreement specifies the time we must call in by, but does not specify a time before which call-ins may not be made. Cue the huge grin across my face.\n\nI never forgot that my team manager tried to do me a solid though. If I was actually going to be late or absent for some reason, I would call that TM's desk line directly to let them know.\n\nEven long after I finally got a cell phone, I continued doing this; I'd just call-in on my way home, instead of sticking around to use their phones after my shift. Found out years and years later from some union reps that upper management never got over this. Drove them nuts that they got beat at their own game by something so simple. It didn't bring the walls crumbling down, but it was a persistent, enduring source of frustration and impotence for them. And really, knowing you can manage all of that with just a 22 second phone call a day... that's the kind of thing that gets you out of bed in the evening.\n\nTL;DR: I got full discipline for being 22 seconds late without calling in to give notice due to a stopped train blocking access to the workplace. So for the next 11 years, I called in absent from work every single day \"just in case\", then still showed up on time every time, creating a little bit of extra work for the person who decided to discipline me in the first place.\n\nEDIT: Probably the number one observation I'm seeing is that I should have just sucked it up and left for work earlier. I've commented this a couple times already, but so nobody has to dig for it: I usually left so early that I got to work before the 20 minutes prior to the start of our shifts that we were allowed to clock in. This stopped\ntrain event was a rare and unpredictable exception, but the crossing was regularly blocked for a few to several minutes by a moving train. Not to mention all the other random stuff that could come up on your way to work.",
        "permalink": "/r/MaliciousCompliance/comments/urczov/discipline_me_for_being_22_seconds_late_without/",
        "comments": [
            "I had a manager like this. I was outside shooting the shit before my shift, I think I still had like 5 minutes and my manager sticks his head out the door, looks at me and points at his watch. I knew I was not late because I synched my watch to the time clock. So I go about my day and my shift is over. So I put my stuff down and walk over to the time clock. Manager says \"aren't you gonna clean up\"? I just pointed at my watch and left. I didn't last long there",
            "What kind of workplace issues discipline for someone clocking in 22 seconds late",
            "Not only was it malicious, it was continuously malicious which elevates it into the ‚glorious‘ category.\n\nThat was a very satisfying read, thank you for that! 👍😊",
            "Being maliciously compliant one time because the office dweebs are being petty that day? fun.\n\nBeing maliciously compliant for *years after* even when they beg you to stop but aren't able to punish you for it?  Priceless.",
            "I don't understand this kind of petty behaviour from employers, the outcome is usually that your staff will apply the bare minimum effort during work time and will never work a second longer than they have to, even if something is on fire.\n\nIt's one of the hallmarks of incompetent management.",
            "[deleted]",
            "Unless the number of times a person is tardy is once per week, (22 seconds are you kidding!) it would be nearly impossible to fire a union member. Beside the union steward there is a union business agent and a union labor attorney to defend the member in a arbitration hearing.\n\nGood on you for making them…..uncomfortable!",
            "I work for a job that allows a 288 second grace period (4.8 minutes). I had a super who would harass me over my time even if I was in the grace period, so I made sure that I was never exactly on time. She hated it.",
            "I assume if you called in, but arrived on time, you were awarded 0 points?  Seems kind of a key detail that wasn't immediately obvious to me, at least.",
            "I used to have a point system like that at work. One minute late, up to half a shift was a half point. More than a half shift missed was a full point. Reasons were irrelevant, Dr notes didn't even change it. Guess who was never a few minutes late. There were times where I'd call from the parking lot and tell them, \"I'm going to be in at lunch. I got here a few minutes late but since I'm already pointed, I'm going to go run some personal errands. See you right before lunch.\"",
            "Did the points last forever, or would you reset back to 0 after an amount of time?",
            "I hate those infantilizing attendance policies.  I worked for an American company that makes recreational vehicles that still cater to a long dead \"bad boy image\" type clientele.  I knew I was running late and called my supervisor.  He said don't punch in and just make the less than five minutes up.  I did.  Someone else went into the computerized attendance system and reversed his \"fix\".  I got a disciplinary.  I may or may not have signed my name as Eat A. Bagodicks on the write up.  The HR tools never look at the signature because they are the dumbest mfers on the face of the earth.  Just glad my supervisor didn't get in trouble for covering my ass.  I managed to keep my job long enough to retire so I still won.",
            "The fuck sort of dystopian hell hole are you working in that has an attendance officer, a points system for being late that could see you fired AND would even consider writing you up for being mere seconds late? \n\n\nWhats next, removal of non vital organs for resale on the black market if you are late more than 3 times in a month?? \n\n\nThis is literally a brilliant plot line for a Sci fi novel I just decided to start working on right this very moment",
            "Have a co worker that did this with vacation days. Got into an accident on the way to work, and he called and tried to put in a vacation day. They denied him over the phone because days require a 48 hour notice, and they like to be petty about it.\n\nTheir pettiness costed him his $3000 attendance bonus. \n\nEver since that day he put a vacation in for every day. It drove them nuts, because there wasn’t rules for cancellation. He could literally show up without canceling it and they couldn’t do shit. \n\nBest part was they couldn’t get an accurate read on how much overtime they needed because of this, and their pettiness probably costed them thousands of dollars over the years.",
            "The vast and continuous maliciousness here is truly sublime due to the fact that the union could fully back it. Beautiful!",
            "Talk about destroying morale. Clock-ins do that at the best of times, let alone someone counting the seconds.",
            "I used to get so stressed out if I was running late that I would just call in sick. My work were super funny about even arriving less than 10 minutes early and they’d make passive aggressive comments or my boss would be eyeing me and tapping their watch as I walked in, even if i was early. I don’t know if it sounds stupid but it really caused me a lot of anxiety. \n\nI hated that job with a passion. Felt like they did it more to me because I’m very non confrontational and they could get a buzz of putting their ‘manager’ hat on without worrying I’ll defend myself.",
            "I think being told \"leave earlier\" is absurd if arriving earlier doesn't allow you to leave earlier.For NO extra pay, be forced to be on premises however much longer every day to accomplish nothing? Combined with the fact that the dynamic nature of the schedule means you were *on average already early most days, only occasionally being late;* then YES, leaving 10 minutes *earlier than you already did* EVERY DAY to avoid being 1 minute late every once in a while IS NOT WORTH IT.\n\nLets say you leave 10 minutes earlier every day, Should mean 10 minutes longer on premises every day (likely doing NOTHING and not getting paid).Over a year, thats 10 minutes/day x \\~250 work days = 2500 minutes = 41.7 hours a year of your life wasted.  Over 10 years that's 417 hours.  **That's 17 days you've sat and done nothing to be \"early\" for the benefit of appeasing management.** *(Again, that much MORE than you've ALREADY sat and done nothing because you'd more often than not be early anyway.)*\n\n\"Leave earlier.\" is the exact kind of crap managers WANT you to do because it benefits them ever so slightly regardless of how much it hurts you.\n\n**Hell. No.**  Life is too short to give it away for free to people that don't care about you.\n\nYour solution is *so much better.*",
            "I was hoping all your colleagues would join in on the fun",
            "I’m so confused by this story. You called in to work and said you weren’t coming in, but then did? I’m missing something here.",
            "Fucking Micro managing bastards, any company or organisation that's treats people like this deserves everything like this the workers can devise. Great bit about the union support as well though.",
            "My previous company had a point system like that. I would almost always come in a few minutes late (I was working 12+ hrs/day and was going to school). I work by myself, and nobody else depends on what I was making (was going straight to shipping). This was a new product and we were well behind on orders. My boss's boss noticed one day and checked on my points. Turned out I had enough to be fired more than twice over. Fortunately, someone above him was either looking out for me, or their profits (I was the only one trained on this new product, plus I was very computer literate and was helping the test engineering team way more than a normal operator had any business doing). The closest thing I did for revenge was that I stopped working so much OT.\n\nI also made bad sleep as an excuse and got a sleep study done while I was trying to not be fired. Turns out I had bad sleep apnea. A few weeks ago I was also diagnosed with ADHD which may be partially responsible for me being late to everything.\n\nI am very fortunate to be part of a company now where they are fine with me coming in past noon.",
            "I worked at a company once where a good employee was fired for clocking on exactly ON TIME three days in a row. Their reasoning? If he was clocking in at 8 am, he was not at his workstation at 8 am ... a one-minute walk away. They lost a good, hard worker that day.",
            "> I went to the attendance office to confirm that my situation was all good\n\nNo grown-up should ever have to worry about this.",
            "If I got a full discipline for being 22 seconds late I'd probably just go home, they already gave you the full punishment for something extremely petty - now they can deal with it.",
            "Ooof I had that situation at my current place, the barrier only come up at 0843 (when work starts at 0845) so I knew if I was only to get to work after the barriers had come down, I'd go round the village on the back roads.\n\nLuckily the timetables changed meaning that if I get stopped by the level crossing I'll be in on time (also my manager now isn't a clock watcher)",
            "I have staff that roll in 1/2hr late every now and then and the only thing they get from me is \"are you working the afternoon shift\" and that is at 6am.\n\nWhat kind of fucked up workplace do you work at ?\n\nLike if we have a crane lift booked for a specific time I would be pissed but god damn if i genuinely griped about 22 second my team would tell me to EAD.",
            "what alternate timeline were you living in where your job has biometric fingerprint punchclocks but you dont have a cell phone",
            "I wish more people had gotten in on this work hack though. Would have made it a bigger headache for them.",
            "We are allowed three minutes grace either side. So if I’m doing at 10 am, I can clock in before 10 am and be on time, but if I clock in at 10:03, I’m late.\n\nIt will then mark me down as arriving at 10:15.\n\nArrival and departure is in 15 minute increments. \n\nThere are some days when I get back to the Depot and finish my shift at about five past or something, and I then have the choice of waiting until quarter past or 14 minutes past, to clock out.\n\nIf I clock out between slots, then they pay me on the lower side so they gain the time money rather than me if you see what I mean.",
            "Not sure how 10:30:22 is not within the realm of 10:30",
            "Oof, pretty sure if they want to track you by the second they legally have to pay you by the second. Threaten a time theft lawsuit for stealing your seconds maybe and they would change their tune.",
            "I used to have an HR manager who would try to pull crap like this. Asked me to check cameras because he thinks associate X was late a minute or two. Always told him dvr time was off so I didn't know exactly when X arrived.",
            "My work commented on me being a few minutes late, so for a period I was bang on time. But lwft bang on time. \nThey complained about that too. \n\nThe best was when they asked me to visit another office for a meeting or trainimg etc amd id have to stay away from home. I put in overtime for each nihht i was away from 17:00 - 21:00 hours. When asked about it, i told them that i didnt want to be away from home, and that because of work i was, therefore i was claiming overtime, for a reasonable time, where i coupdnt be at home doing something i wanted too. Like gym, football, mates etc. \n\nThey told me I couldnt do it. But I continued.  Did the same through numerous managers. \n\nThen when i became a manager there was no OT, so i had to stop.  What i then did was to organise all these Meetings / training etc, for a time where i would benefit. Like a “slow” drive home on a Friday, would result in an early finish. \n\nWhen asked how the journey home was. It was always horrid, with breakdown, or road closures and took me hours. Reality was, i was home and kicking back!",
            "Deliciously malicious. Mmmm.",
            "22 seconds? Holy shit. Even grocery stores have a 7 minute leniency window.",
            "Managers who are incapable of managing people almost invariably fall to managing clocks.",
            "God damn. I only write my staff up if they are CONSISTENTLY 10+ minutes late on a regular basis. Shit happens and we work in a busy downtown area. \n\nRespect your employees and they will respect you 🙃",
            "I haven't had a timeclock job since the 80's. I worked at a large pizza chain delivering pizzas while I was in college.\n\nThe manager was used to me and all good, but occasionally there'd be a new assistant manager or a substitute manager who would  ask me to clock out and then come to the office to check out (go over and reconcile deliveries and cash). My answer was always the same, \"as soon as I clock out I'm leaving and  I'll reconcile on my next shift.\"  They never tested me on it and I always got paid fully.",
            "You shouldn’t have to take time out your life to stop being late by 22 seconds fuck those boot lickers.",
            "I once had a manager give me shit for being late without calling.  I’d been on a stalled subway underground with no reception, and by the time I *had* reception it’s because I had left the station, was 2 blocks from work, and was already late, so what was the point when I’d be waking in the door in 3 minutes or less?\n\nSo, from that day forward, I called her even if I had the slightest inkling I might be even a second late.\n\n“Oh, hey Manager, my train sat at Station X for a few minutes, so I might be late.”  (Get to work early, but hey, I *might* have been late!)\n\n“Hi!  I just got off the train and I’ll be there in 3 minutes, but since that’s 1 minute late I wanted to let you know!!”\n\nEtc.\n\nOne time she tried to tell me it was annoying, but I just said “Oh, well you told me I have to call if I’m going to be late…”\n\nKept doing it.  Lords I hated her.",
            "Staples call center and tech support used to do this, prob still do. I remember having meetings and people were asking HR, \"So if I pull into the parking lot and am going to be 1 min late, I might as well turn around go to mcdonalds.\" cause even if you were 1 second late you got a 1/2 point.",
            "I used to work for a company that gave a bonus if you were on time all the week. If you were even 1 second late any day you would lose the bonis. So what happened is if by any reason I was late, I wouldn't bother trying to get in time. On monthly reports, i was almost always the one employee with the most late check ins, lol. They tried to \"punish\" me once by suspending me for a day, but stopped when they saw I took it as a price.",
            "my work did this, it got me to the point where if i was gonna be a few minutes late id say screw it and go in 4 hours late, either way it was 1/2pt, so fuck em",
            "I get points even if I call in to say I am going to be late.  In order for me not to get in trouble I have to call in 2 hours before my start time.  Which is 6am.  \n\nThe system for hourly employees is fucked.  Even if you are in a union which I am it still sucks. \n\nI gotten written up and points for doing the right thing and not coming to work sick.",
            "I love this malicious compliance, my only complaint being - were I the person at the attendance office - I would have asked for an unofficial original excuse for each absent call. “Is it Bigfoot outside your door again?” “Tornadoes on your street?” “Too many papercuts to come in?” - I think this would have made the compliance equally delightful for attendance workers.",
            "So, why not call in for every day for the next year all at once and be done with it? :)",
            "I've had a free award for over two month and your story just warmed my cold dead heart, so I hereby pass on to  you this free award.",
            "My company has a 7 minute grace period.  Unless you're constantly in at the the seven minute mark,  you're still on time. Because life happens.  Sometimes you need to get gas or you sleep in a little.",
            "Love the user name. Congrats on that.",
            "[Work-to-rule ](https://en.wikipedia.org/wiki/Work-to-rule?wprov=sfla1)",
            "How many points was considered too many points and could cause you to be fired?",
            "Dude, non-corporate managerial is full of some micro-managing weird-ass fucks.",
            "My place of employment has a similar system of attendance, albeit without timestamps.\n\nIt's to the point that a lot of people call in and report themselves as absent for the whole week. If you show up there is no penalty and they just ignore the \"absence request\"\n\nBut if you do happen to miss for any reason, or are late, then you have taken most of the steps to alert management ahead of time.\n\nFMLA abuse is also a huge problem where I work, but that's a different story",
            ">To be clear, \"going around\" involves taking a lot of secondary county roads as well as a few field access roads\n\nYou could instead just fly over everything.",
            "This is awesome. You were very unreasonable in the face of completely unreasonable policies. \n\nSounds like the best way to handle it.",
            "Imagine if they had spent the effort they had on that, on literally anything else. (Utopia.jpg)",
            "Oh, companies that do this drive me nuts. At my first ever job on my first day, I showed up early, but didn't have access to punch in with the machine. Someone else punched me in...a few hours later. I was marked tardy.",
            "Being a thorn in their side sounds great",
            " Did they expect you to clock in ~before~ your shift started? Because I’ve seen companies get pissed at that too. Or did they expect you to clock in exactly at 10:30:00 and not a second longer? \n\nWhat a bunch of dummies.",
            "You've got to love unions",
            "I had a workplace somewhat similar.  We’d open at 8 and our shift started at 8.  We’d have to get there early because we’d have to use an employee entrance to get in so we didn’t have to have the front doors open.  The employee entrance had a fob access that we’d use, but would shut off from 7:55-8.  Yep.  Even if you got there 5 minutes early, you couldn’t get in.  You were forced to wait outside and be let in the front door and pretty much shamed for doing so.  There wasn’t really any repercussions for it beyond the “shame” and a brief talking to.  Also, we weren’t allowed to clock in until 5 minutes before our shift.  So even if we got there at 7:45 to make sure we avoided this whole thing, we couldn’t start clocking in until 7:55.  There would be a line of 20+ people waiting to clock in at that time.  If you clocked in early, they would go back manually and change the time to 7:55.",
            "Production warehouse. Fired for 1 minute late. I have the most respect for people who can do that work. You are treated like a robot.",
            "You did this for eleven years? That is tremendous dedication to the bit.",
            "Good for you! I had an employer who did that whose name begins with the first letter of the alphabet. Next door was a wind turbine blade manufacturer and down the road was a commute train station. Between the two, you never knew if you would be late or early. Tardy without a call was a point. You could get 3 points in 6 months before getting a warning and then next tardy would be termination. We could only clock in no more than 5 minutes before our shift or our manager would yell at us (and you’d get a point if he didn’t like you 🙄). So many people would just abandon their job at two points because it wasn’t worth the stress to be on probation. So much unnecessary anxiety over something we couldn’t change.",
            "\"So for the next 11 years ...\" made me hope to God this is a true story!",
            "\"It didn't bring the walls crumbling down, but it was a persistent,   \nenduring source of frustration and impotence for them. And really,   \nknowing you can manage all of that with just a 22 second phone call a   \nday... that's the kind of thing that gets you out of bed in the evening.\"\n\n&#x200B;\n\nBRAVO! BRAVO!",
            "Doing that every single day for 11 years? The dedicated balls on this guy, holy crap.",
            "This is a level of petty that most of us can only DREAM of achieving.\n\nWell played, good Sir or Madam, well played.\n\n::polite golf clap::",
            "You clearly worked for the Sith. I was in a crew of 10+ for a night shift, anyways the old people lined up to clock in first because we all shared ONE time clock machine. By the time half the crew clocked in, they were all 1 minute late. Store Manager calls me in years later, \"you have been late for an average of 75% of your shifts for 3 years so I'm firing you.\" I laughed and said '1 minute late right, because of the ONE time clock?' He replies, \"doesn't matter, late is late.\" The Sith Deal in Absolutes.",
            "If it makes you feel any better I’ve been sacked for being accused of leaving early, when in fact I had worked over my hours and left late. I contested this accusation amongst others but I’m the one sacked. It’s a fucking shitshow out there. \n\nReading stories like yours makes me happy!",
            "You are great.  You really weren't late at 10:30:22.  Not until the clock strikes 10:31:59 does 10:30 end.  Just like midnight isn't until 00:00:00. 11:59:59 is not midnight.  \n\n\n\\*edited to correct to the correct decimal.",
            "Point systems are a joke. I had an appointment one day that Id told my boss about 2 months ago and said no matter what's going on a work I absolutely must keep my appointment or be forced to wait another several months for a re schedule. He said that's fine. It wasn't. My appointment was right before the middle of the day and was close and rather quick so I decided to come back to work. When I reviewed my timesheet 2 weeks later, I got a point for clocking out more than an hour early and another point when I clocked back in for being \"4.5 hours late\" to my shift. Id have been better off just going home. I was told nothing can be done, ( basically the computer was God, a point is a point and the records were his Word). Then I was told not to look at it as a punishment, just a way of tracking how much work you're missing. Furthermore, points never go away either. So I asked him why are there employees who have been working here longer than a couple years, surely in that span of time it's not unusual to have at least 10 appointments (For the almighty Computer hath decreed: Woe is the man who hath more than but 10 marks, for he shall be banished from this land for all of eternity). If a point is a point why havent they been fired? \n\nSilence, frowny look, wrinkled forehead.\n\nA few months later we were very very busy for a week and they were handing out mandatory OT like a drug dealer with free samples. After my third 14 hour day in a row I fell asleep driving to work in the morning. Thank god nothing happened, but I turned around went home and called out, also saying I will not be able to work longer than my standard shift the remainder of the week. A day or 2 later the boss pulls me aside and gives me a stern, cringy, little talking to. \"Are you SURE you cant stay and sacrifice some personal time so your co-workers don't have to pick up your slack? You do a lot of good work here, but your attendence has 'raised some eyebrows' upstairs and I'd hate to be put in a decision to have to let you go.\" \n\nWell that did it. I shot back, \"Dude, we just had evaluations last week. You were in the room. There are 26 points to my name in the system, all for legitimate reasons. In fact I came prepared with a folder full of documentation and Dr notes to be prepared to fight for my job. But I didn't need it. Not only was the word attendence never uttered, but your boss said I got one of the best evaluations in the company. I got a RAISE! Call me selfish, but I intend on making it home to my family alive, with enough time left in the day to actually be a part of my family instead of feeling like I'm just a tenant in their home. We both know the point system is a useless metric intended as a tool to use as leverage over your employees who are busting their asses to make you money. My shift is over. I'm going home. If I still have a job tomorrow I'll be in, and we can have an intelligent discussion about a realistic amount of overtime I'd be able to sell you\"\n\nWork to live not vice versa. Your boss isnt gonna be at your deathbed offering comfort in your final moments. Your family will",
            "This makes me happy that I have salaried employees a.nd I don't have to worry about this petty corporate point shit. Show up an hour late and leave 2 hours early, idgaf, as long as the work gets done.",
            "Former young worker (now middle aged worker) here:\n\nI used to aim to be there right on time. “They aren’t paying me for those 15-20 minutes to be there early, so I refuse.” \n\nEventually I realized the karmic penalty of that mindset. Stressed any time something unexpected happened. Flustered and breathless before I even sat down at my desk. Every morning, before my day even really got going, I was worried and anxious. \n\nOne day I just decided to aim for being there 20-30 minutes early. Waking up 20-30 minutes earlier had almost no effect on me – in other words, it was equally difficult to wake up at 6:00 than it was 6:30. \n\nI wouldn’t clock in when I got to work. I’d go make a big coffee. I’d use the bathroom. I’d tidy up a little. When start time came, I was relaxed, caffeinated, and much more zen. \n\nGetting to work early (sometimes ridiculously early) was for the benefit of me, not my employer. \n\nI own a business now, and when I’m meeting a client, I arrive ridiculously early and hang out in my car listening to podcasts until it’s a much more reasonable time to meet. When I fly, I get there sometimes 3+ hours early so I don’t have to stress. \n\nYou have to get up and go to work anyway. Just a necessary PITA of life. Might as well make it as easy as possible on your overall mental health.",
            "This whole attendance points/ punishing employees business is just bananas. You guys know that, right?",
            "I have no awards to give. But please accept my upvote as a consolation prize.",
            "You went for that long itchy burn. Wonderful",
            "Former third shift in hotels, here. \n\nGod damn, OP, I love this!",
            "Wow. Sounds like my current place of employment. I wonder if you worked here? Maybe not, since I don't have a union. But the main staff might.",
            "This dude was a nasty prick in someone’s ass alright lmaooo",
            "I don't understand what you did exactly but it sounds like you got them good",
            "Is this particular facility located in Southeastern Oklahoma by any chance?",
            "Stories like this remind me all the time of how awesome my supervisor is. I don't have to punch in at all, and my boss doesn't give a shit about lateness when there's not a specific scheduled need to be on time. I work my hours, stay late when I'm needed or whatever. He wants the work done, the work gets done well, and he's happy.",
            "And yet they were still too proud to admit they were willing",
            "My assumption here is that initially the company was forced to make plans to cover your potential absentee.  Then you actually show up and that coverage would need to be cancelled.  Is that correct?  \n\nAfter doing this for so long, I would imagine that the company would understand that you were actually showing up for work on time as usual.  Were there ever times when you called in absent the day before and was actually absent? I would imagine that chaos would then ensue trying to get someone else to cover for you.",
            "Fuck them for no grace period but at the place I work there are numerous time clocks all over the building and lines at all of them so it might take 2 minutes from the first person to the last to use the clock. Tardy happens after like 5-6 minutes.",
            "This is just beautiful",
            "Yeah I got delayed by a bunch of ducks crossing the road once...was told to leave earlier.  Wtf? Act of nature.",
            "I got given out to for only being 2 or 3 minutes early. \nIf he wanted the job to start 30 minutes earlier - advertise it as such.",
            "22 seconds? Fuck that bullshit",
            "When I was hourly here at my job they told us that your scheduled time was the time you were supposed to be at your workstation and ready to start. If you weren't at your station at 6am you were late.",
            "My job gives five minutes leeway to be late in case there's a line at the time clock, *but* you have to call in. And you can only call an hour early, unless you take the whole day off. We can't clock in early. \n\nAnd if you're five minutes late, you have to watch your time the rest of the day because you can only miss 8 clicks (hundredths of an hour) without getting written up. We can clock out up to 8 clicks late to make up for it, unless we're on OT (these union rules get complicated).\n\nWe're not supposed to get there more than 15 minutes early for some reason, *but* I was told by the top manager that if we wanted our jobs, especially on probation, we'd plan ahead in bad weather or for the train, even if it meant getting there half an hour or more early!",
            "Ahhhh, my kind of malicious compliance.",
            "OP do you happen to work in a prison? All of the jargon and details sound the same to my experience with one.",
            "My old job used to have 5 minutes leeway, 6 minutes you were late. After 2 hours it was a full days absence. So if you got sick and left 2 hours and 1 minute before the end of your shift it was a full days absence., You obviously still got paid for the time you were there. But you got a point. Late was 1 point. Write up at 6 points, 3 day suspension at the 2nd time you got 9 points (although they almost never did that, it was usually just another write up to let you know you're about to hit 12) at 12 points you were fired. Every 30 days without an absence you dropped a point.\n\nSo you call in and get 1 point, you go home sick twice in the same month you now have 2 points. 30 days from the last point or half point you need to be there full shift to drop a point. It was easy to get up to 6 points even close to 12 if you got caught in traffic. It was also pretty easy to get points dropped just by showing up.\n\nI got as high as 10 points one time when I went through a rough period of sickness/depression/burnout.\n\nThe thing is, if you knew you were going to be late, say 15-30 minutes they'd just call in sick and stay home. Since you were turning a half point into a full point you could make that full point up in 30 days. If you had 6 1/2 points you'd have to wait 30 days to work off that 1.2 point anyway. Might as well sit home and watch TV. \n\n&#x200B;\n\nThen I left and went to Walmart. Same policy except it took 6 months of no lateness/absence to drop a point. Insane. So if you were sick twice it'd take a full year of no absence to work them off.",
            "I just, I'm flabbergasted. Your commitment is amazing. Their insane commitment to not changing any policy after you exposed it as idiotic and kept calling for 11 years!!!!\nThose points were the most important thing apparently.\n\nthe people that run these workplaces should be put in reeducation camps. Too many psychopaths calling the shots",
            "Every manufacturing company I have ever worked for eventually makes it to one of those stupid attendance point systems. The company I work for now used to let us pretty much make our own hours as long as we ensured that the work was done and we were present when support was needed. Everyone I supported had my phone number and I was almost always willing and able to help. Now we have a point system, I have been asked not to answer the phone or emails because they do not want to pay me the time to answer. Long story short, I clock in within a few minutes of time required, I clock out within a few minutes of time allowed. And I am perfectly happy with it. But I will say that productivity and morale suffer due to the inconsiderate approach the company takes towards attendance. \n\nSpecifics of the productivity; if we are in the middle of a repair and quitin' time rolls up, I bet you can guess what happens. We quit workin' talk to the next shift so they know whats going on and go home. Then the next shift repeats all the same work verifying what we said is true and then finishes the job. It takes nearly double the amount of time it would if they just let people stay on shift and get it done before they go home. Oh well, not my clown not my rodeo I like to say. \n\nLong story shorter... \n\nCompanies that do this kind of crap screw themselves, not my problem I still get paid.",
            "https://imgur.com/a/YZOEopv",
            "I’m shocked that you couldn’t get out of being 22 seconds late if you had a union representing you. Unless the handbook says 10:30:00 (instead of 10:30) clock in time, then 10:30:22 should be good enough since the policy only specified the minute you had to arrive by and not the second.",
            "You did that to yourself you donkey, learn to take yes for an answer",
            "My work is so desperate if you are 22 days late they’ll be like do you have a doctors note? No ok well next time make sure you get a doctors note get to work",
            "This rules. Did any of your coworkers join you? Was it ever discussed?",
            "I feel you on the blocked train access.\n\nI work for a railroad that recently renovated the tracks in the yard and limited access to a portion of the yard.\n\nWith their Precision Scheduled Railroad philosophy, we are building longer trains than the surrounding infrastructure was designed to handle.\n\nIn essence, if you work a job on that side of the yard, you hope there's no trains barring your exit off the property. I got stuck for 2.5 hours once and that was the epiphany I needed to not tie up until I made my exit.\n\nNow, we're all getting overtime.😃",
            "11 years. Man that's commitment.\n\nThis is an elegant solution. It would have been so much easier if they had just treated you with some grace.\n\nPuts a smile on my face.",
            "I walked in a few minutes late one day due to bad luck at the red lights along my route. Boss said that I should leave a few minutes earlier per light in the event they're red. I told her that there are 10 signal lights between my house and work. If none of them are red, I'd arrive at work 20 minutes early and, because of the timecard rounding, the employer would have to pay me for 30 extra minutes on those days. She never brought it up again but would scowl on those rare occasions when the lights were not in my favor.",
            "For added oomph, tell the entire team to do the same thing, and that little trick will spread like wildfire through the entire company.",
            ">She advised me to either leave earlier (and just wait for half an hour for my shift to start on the majority of days)\n\nThis is always what your boss wants, by the way.  They want you so scared, that you show up early, and have to sit there bored; then, because you're bored, *they are hoping to get a little convenient, free labour out of you,* since it would just be such a huuuuuuuuge imposition for you to start work early, and get paid for it, that's unfair to the business!  \n\nBut, every time we want you to stay late, dog, you'd better fucking jump, because you know where the pound is.\n\nAlways treat your employer in good faith, because to them, you are a dog.  But, never be surprised, when you get rewarded like an obedient dog, if you submit to acting like one.  Workers should not be scared of the leverage our Masters have over us, *because we are not fucking dogs.*",
            "This is the type of petty ass malicious compliance that I came here for.",
            "Huh…reading these makes me realize I might have been screwed at my old job more than I realized…every morning before shift started, I’d clock in 15 minutes early, and some nights didn’t get to clock out until 30 or so minutes after we were supposed to close…and not a single bit of that extra time was given to me as money. I would get paid for the hours on schedule and that’s that. This was on top of having my coworkers constantly make fun of me for one reason or another and having my boss degrade me in some way as a form of “joke”. Sadly can’t do much as I live in small town USA and everyone knows *everyone*",
            "For people unfamiliar with cargo trains, it’s not like you can just go to work 10-15 minutes early to address the problem. Sometimes they stop and unload cargo. This can literally take an hour or more, and there’s no way to predict it. I’ve unexpectedly sat at a train crossing in Atlanta for nearly two hours before. \n\nI used to work near Atlanta airport. It was simply understood that if you were coming from Stone Mountain, sometimes you’d randomly be an hour late due to a train. The alternative was literally arriving at work an hour early every single day to avoid the occasional hour (or more) you could get stuck behind a train.",
            "For all those failing to understand the trains- I used to work across from one of the busiest train tracks in the US. Sometimes you waited 10-15 just for trains to pass by that were moving like normal. Some trains a really long. \n\nIf a train stopped, it could be 5 mins or hours. So even if you planned to arrive 30 mins prior... you still could be late",
            "That's over strict. Seriously. Most workplaces consider under a minute to be serious \"Who cares\" territory. That's time clock malfunctions, lines at time clocks, all sorts of minor delays.",
            "Years ago I worked for Walmart and was accused of stealing 1.5 MINUTES (yes, 90 whole seconds) from the company and I was coached aka written up and turned into HQ in Bentonville AK for stealing from the company.  After nearly 20 years employment with them, I had been debating leaving them and it was the push I needed to quit and start my own business.",
            "It's the lack of a two way street that bothers me in most employer-employee interactions.\n\nBeing 20 minutes late to work is allegedly a huge disruptive event at the work place, but showing up 20 minutes early means absolutely nothing to anyone and you damn sure aren't getting paid extra for it.",
            "Another temp job from hell was on the train line.\n\nSince I was not familiar with the trains in that specific neighborhood, I left early and ended up getting there at 7:50 AM instead of 8:00 AM.\n\nIt was still dark (this was January) and pouring rain (this was Oregon).  The door was locked, and since it was my first day, I did not yet have a key.  I called the main number; no answer.  I called the security desk; no answer.\n\nAt 8:05, the security guard let me in.  I went straight to my boss, and said, \"When I got here this morning, I was locked out and had to stand in the rain.  Can I get a key so that doesn't happen again?\"  His response was, \"You were not at your desk this morning when I got here.\"  Like, what part of \"I was locked out\" that I said literally one second ago did you not understand?",
            "I had a similar situation once. Former manager wrote me up for some similarly ridiculous tardiness, like less than 30 seconds (By this I mean 8:00:20 not 8:01:20). For me, because I was opening, unlocking the doors, turning off the alarm, turning on the lights, waiting for PC to boot and login to timesheet online.  This employer did not do well trying to stamnmer and defend his practices at the labor commisioners office, I made a couple hundred dollars in the process ( our labor commisioner can set fines) and I like to think he learned a relatively cheap lesson about wage theft from hourly workers.",
            "If you’re union why didn’t you just file a grievance about the uncalled for disciplinary?",
            ">a persistent, enduring source\n\nEven the grand canyon can be carved out by the tiniest stream given enough time. even the simplest, tiniest acts of praxis counts.",
            "Never underestimate the power of spite.",
            "I get you! I live on the \"wrong side of the tracks\" in my town. Which literally has three roads going out of it, all off them cross over those tracks. If I lived three blocks down, I'd be on the \"correct side of the tracks\". I usually get to work 15 minutes early every day. Every day. Unless there's a train. They usually stop to unload at the lumber mill. So..... Yeah. From 15 minutes early to 20 minutes late, it's a spread. Thankfully my supervisor views my perpetual earlyness as a makeup for the times I'm late.",
            "I work for a company that makes time & attendance software that does all of this. This is fucking hilarious, and I'll be sharing it with all my colleagues. Thanks for the belly laugh.",
            "Our retail store would do this. 3 tardies and you could be fired even if they were excused but a CALL IN was allowed by law, so... if you were running late you would get in less trouble for NOT SHOWING UP AT ALL  than for being 1 minute late. Our manager was not big on rules, so, rather than having people call out over a minute, it became a game of \"oh, I forgot to clock in. Can you edit my punch?\" or retroactively changing the schedule so that your new time was in the next quarter hour. Since the submitted schedule rarely matched the final schedule, the district manager never caught on and we never had to fire anyone over ridiculous 1 minute lates.",
            "That seems downright silly, firing people over a point system, regardless of circumstances. How much talent do they lose over this?",
            "Good thing you were in an union :)",
            "Not all heroes wear capes",
            "Ngl, I feel a bit called out for the being 30 min early comment. I know if I'm not there 30 min early everyday then something is gonna happen to make me late everyday",
            "What does tardy mean?",
            "This person works for Amazon at a fulfilment centre. Fulfilled with dread btw",
            "Truly a hero’s journey. Bravo!",
            "Did they ever change policy? With a labor union around I doubt it would have been easy without re-examining the bargaining agreement wholesale.",
            "I don’t like the managers response but sounds like you should have gave yourself a five minute buffer every day to deal with said train. Everyone has a “train” that slows them down on their way to work. Some just learnt to work around it.",
            "Lol Walmart?",
            "Sounds like a Walmart warehouse or something similar",
            "Maledictive compliance!",
            "Where the fuck you workin at, the ministry of truth?\n\nSeriously sounds like you got yourself a 1984-style dystopian workplace.",
            "This is next level petty!",
            "If ever in a situation where you are late. Just forget to clock in and when asked just say it must have slipped your mind. I use this all the time.",
            "Heh, I could swear you are talking about the same place I work. Hmm, if everything was 'OK' in 'Heaven', we may have.",
            "Omg this makes me so happy. Thank you. Thank you for your service.",
            "Reminds me of working at Joe Pitetryka in pawling NY…\n\nEdit - I guess it’s called Hudson Valley Plastics now.",
            "Walmart is famous for its terrible attendance rules. Not only can you not be sick more than x number of days a year, even if you have a medical disability, you cannot, for example, work through an assigned break time and take it later, because, if you are working a register, you get locked out a few minutes into that break. \n\nI haven’t worked there, thank and the gods and goddesses, but I know several employees, and witnessed the issues with the registers. There could be 25 people in line, and one person at the customer “service” desk, because the others were on enforced break. \n\nI no longer go there for anything.",
            "When I was in high school, my town was so small (it was technically called a village) that they combined it with the neighboring towns schools. Only problem was there was a train crossing between the two towns.\n\nIf we ever got stuck by a train we simply called the office and they marked it down so we wouldn’t get in trouble for being late.\n\nMy high school in BFE Illinois handles this situation better than your company full of adults.",
            "You kept saying calling in absent was really messing me up. Did you call in absent or called in for maybe/maybe not being tardy?\n\nGlad you were able to hassle them about it.",
            "Good on you. If I was so much as a second late for my shift, my old job would dock me for 15 minutes worth of pay.",
            "Absolute joke. 22 seconds?",
            "Wouldn’t this result in 1/2 point per day?",
            "Lol Capsule does this as well.  I just stopped showing up.  Will likely let them know that I won’t be working for them going forward.",
            "I manage a warehouse of 15 staff not a single one of us is ever on time, work a full day or really keep to lunch hours or tea times, but we've collectively knocked every project we've ever had out of the park, so the execs leave us alone, I dont think I've seen any of them onsite in 2 years. I really struggle to think that petty time penalties is considered good management?",
            "At my old job we have train tracks, the train broke down and blocked the road. It was right around 2nd shift change at 2:30pm.  \n\nThe one maintenance guy parked this truck and walked between train cars.  Now in meetings they talk about the importance of safety and not to do that."
        ]
    },
    {
        "post_id": "hkttbf",
        "author": "Cuboid-Homonym",
        "title": "Karen wants Guac.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hkttbf/karen_wants_guac/",
        "score": 24764,
        "num_comments": 785,
        "created_utc": 1593821064.0,
        "selftext": "This happened to me about two years ago but a former coworker just reminded me about it and I'm pretty sure it counts as MC. I'll try and keep it short but it is a little long.\n\nI used to be a service manager at one of the biggest locations of a popular Mexican grill. I won't say which but guac was $1.95 extra and we were required to ask everyone if they were okay paying that price.\nOne Sunday morning (our second busiest shift of the week) two of my line people called out so we were struggling to get all of our prep done before opening at 11.\n\nWe are just wrapping up when in comes Karen 10 minutes before opening through the side door marked EMPLOYEES ONLY with 15 preteen girls in tow. My cook recognizes her as she regularly comes in during the dinner shift and is extremely abusive and cruel to all the Latino workers. Karen tells me they can order whatever they want, THROWS her credit card at me and goes to sit down at a table and diddle on her phone. Now I can't ring up her order without her standing there because of the company rules and I am 30 weeks pregnant and just want to take my break. I prego waddled over to Karen's table to try and inform her of that when she literally flicks her hand at me to dismiss me. Not only have I been at the store since 7 and done two different people's jobs on top of my own, I have my son's head grinding against my pelvic bones and kicking me like crazy. I am in no mood. \n\nWhen I try to tell her again, she looks at me with what I can only describe as seething contempt and says \"What part of they can get whatever they want did you not understand? I don't care what you charge me as long as I get a receipt. Don't interrupt me again or I'll get your fat ass fired.\" Now I never cry but that almost got me. Motherhood is awesome but pregnancy suuucks. I finally manage to pick my jaw off the ground and stammer \"alright, ma'am, I'll ring up whatever they want and bring you a receipt.\" \n\nThe girls were really nice and most of them ordered double meat and they all got a bottled water and chips and guac. Every. Last. One. My cashier and I are just vibrating with glee as we ring them up and watch the bill climb to like $250. I brought the bill to Karen and was pretty excited when she didn't immediately check it. I made my own food and told the cook to come get me when the show starts. \n\nI'm halfway done eating when I see him waving to the camera, howling with laughter so I head up. Karen is foaming at the mouth SCREAMING for the manager and when she sees that that manager is me, she literally grinds her teeth and slaps her receipt on the table. She manages to choke out the word \"refund.\" The girls have all pretty much finished their food so I inform her that I won't be doing that because I would lose my job for giving away that much critical inventory (meat, guac, cheese) for free. Then I gently remind her that she told me twice that the could get anything as long as she got a receipt. She just keeps demanding a refund and calling me stupid and fat (again, pregnant). At this point, her screaming is holding up the very long line and customers are shouting at her to just leave. That's when she pushed me. F*cking hard.\n\nMy cashier caught me so I didn't fall down but two of our regulars, who are police, see it and immediately cuff her. In this state, any use of physical force against a pregnant woman is classified as aggravated battery or something like that. I felt bad for the kids and I was fine so I kept telling them I didn't want to press charges but they said that at that point it didn't matter because the woman had done it in front of on duty officers so she getting arrested. They had to call the kids parents to come get them because she was their CHURCH'S YOUTH LEADER and get statements. My GM came in and let me go home with a full day's pay. She tried to take the case to trial but they had video and like twenty witness statement so she ended up taking a couple years probation or something. All because I did exactly what she told me to.\n\nEdit: TLDR; Entitled Karen gets a bill she didn't want, gets arrested for pushing a pregnant woman.",
        "permalink": "/r/MaliciousCompliance/comments/hkttbf/karen_wants_guac/",
        "comments": [
            "Wait, what the fuck was she expecting? Throwing her CC at the server, 15 kids, and $250 for a bill?\n\nThat's roughly $16.00 a piece for lunch. That's not unreasonable.\n\nSo she was entitled and cheap?",
            "Please tell me she got banned from the store. The fact that she was regular enough for the workers to know she was abusive towards certain staff, but then actually physically assaultive as well?",
            "This is an awesome tale of MC but I’m mostly just glad someone was there to catch you and that you were supported and could go home after. Pregnancy is incredibly hard physically and mentally, no one needs to deal with that kind of abuse on top of it! That woman deserved every ounce of consequences and probably more.",
            "How little could she have possibly expected it to cost to feed 15 preteens? Them shits can EAT and there isn't exactly a dollar menu at that place.",
            "[deleted]",
            "I'm glad police saw this and charged her for you. I understand you probably didn't want to deal with it or was trying to be the bigger person but people like that depend on everyone else being the bigger person in order to keep being their awful selves with no consequence. This bitch pushed you while PREGNANT. If your coworker hadn't caught you, you and your baby could've gotten hurt. If somebody ever assaults you PRESS. FUCKING. CHARGES. Overall great story OP, fantastic MC.",
            "I am glad to know you or Mr. Man in the swimming pool was not hurt.",
            ">  I didn't want to press charges but they said that at that point it didn't matter because the woman had done it in front of on duty officers so she getting arrested. \n\nTechnically victims don't actually get to make the decision to press charges. But in many cases, without the victim's co-operation (e.g. testimony) there's not enough evidence so if the victim doesn't want to proceed they let it drop. In this case, they had all the evidence they needed without you.",
            "Yet another reminder why working on Sundays is terrible.",
            "Ah yes, that love for all mankind thing Jesus was talking about.\n\nFunny thing is, the worst customers I have ever dealt with, worked for churches. I used to do billing support for a cell company. I was in a management position and was reviewing a call of one of the agents. The caller was the most abusive person I have every heard on a call. The first 10 minutes of the call was this jerk berating and insulting the agent who was only trying to get the guy's phone number. This was in the mid-2000's and the computers wouldn't automatically bring up the account. We needed the phone number to get to the account.\n\nAfter the 10 minutes of pure abuse, jerk finally gives the number. I bring up the account and the name was \"For Christ Ministries\". The jerk, was the pastor. The poor agent struggled through another 15 minutes of abuse as he tried to help the jerk. After the call, I brought it to the attention of my boss. Her jaw dropped as she was listening to it. I then pulled a few other calls of the jerk's and found this happened every time. I went through the account and found pages upon pages of notes of agent reporting abusive behaviour.\n\nI made a report and we filed it with corporate. 2 days later my boss got a call. She came to me and told me to contact the jerk. Inform him that effective immediately, we are deactivating his account. Once I have inform him, deactivate the account. We fired him as a customer. I gladly called him and j teoduced myself as a manager in the company. I informed him that due to his repeated abusive behaviour, we are firing him. He started yelling at me and I cut him off. \"Sir, this is exactly why we are deactivating your account. Learn to behave like an adult. Our agents will be instructed to hang up on you immediately. Have a good day.\" and hung up. I then left a note that immediately opens when you bring up the account saying to hang up on the customer immediately.\n\nFor the rest of the day, random agents got a call from him. They hung up within 2 minutes of the call. It ended up being a morale booster for the floor. As for the agent who had 25 minutes of non stop abuse and took it like a champ. We bought him lunch for a week, ordered it in and everything. He was happy with that.",
            "Such stupid reports. The Karen thing began on reddit. Being an entitled asshole isn’t the result of being a part of a vulnerable group or identity.",
            "For once my username is relevant.",
            "This just made my night. Thanks for sharing and I’m glad you weren’t hurt!",
            "This gave me so much joy, I never had a chance to pull a move like this in my day's serving food (I serve beer now), so thank you for letting me live vicariously through you, OP.",
            "[deleted]",
            "What happened to her church leadership position? Did the community shun her? (I hope so!!)",
            "lol this was so entertaining. \nShe deserves it. OP you rock .",
            "Could have had a civil suit for assault.  You should have gotten something from Karen as you're the victim.",
            "It blows my mind how many people don't want to press charges.  Someone assaulted you and your unborn child.  Yes you were fine but you were lucky.  The person who puts their hand on another person needs to have consequences.  When people don't press charges there are no consequences for their bad behavior and they will do it again.  What if the next person isn't caught by anyone?  \n\nPlease folks, press charges.  If someone puts their hands on you press charges.  Those charges are there for a reason and you could be saving someone down the road from real physical harm.  \n\nI am so glad you two were ok and that the officers were there.",
            "“I won’t say which”\n“Guac was an extra $1.95”\n\nNot only did you tell us which chain, you gave us an approximate date range and store location",
            "I love when pretentious religious folks get busted for doing something unchristian like \nWhoring or stealing or drugs \nGood for you OP I hope you gave yourself a really good tip!",
            "Just a protip based on part of this story: always press charges.  Don't let being nice or trying to give someone a break get in the way, always press charges.",
            "You're a fucking badass, and your kid has an edge in life with a ferocious mama bear behind him 🖤",
            "If Karen had just done some basic math she could have figure at least $200 for 15 people. than add xtra. Did she think they were at the bell eating the dollar menu?\n\nWhat a witch.",
            "1. She either can't read, or doesn't care, the sign saying 'Employees Only'. That's trespassing, open for business or not.\n\n2. Does not plan to witness the transaction, so she therefore can't dispute the charges.\n\n3. Church Youth Group leader!? Fan-frickin'-tastic. \n\n4. Assaults a pregnant woman. Absolute scumbag Karen.",
            "yeah, that's pretty rich.\n\ndamn entitled people.",
            "I am so sorry for what you went through. While I understand your position, she should have been arrested. Glad the cops were there to see it. Hope your little one is a bundle of joy for you.",
            "Anyone have this post backed up? Would love to read it.",
            "Of course she's a Christian.",
            "My friend Chiphote Lay should hear about this.",
            "Jeez who the fuck pushes a pregnant woman?",
            "Fun fact, I’m a Chipotle cashier and I had to watch some scrawny white dude tell a Palestinian teenage girl to “go back to her country, because we never came to your country, so why should you be allowed in ours. ” I had a change machine that weighed about 10 pounds that I could have slammed him with. God did he test me.",
            "So, so lucky that you had someone to catch you and officers who were on hand and saw it with their own eyes. It could have gotten much worse. And kudos to you for holding your ground and staying calm the entire time!",
            "Besides the part where she pushed you (not cool) this was an absolute delight to read from beginning to end. Love a good comeuppance story.",
            "You have to be a million types of fucked in the head to push a pregnant woman because you didn’t want to pay for guacamole at Chipotle. Glad she got r/instantkarma",
            "Why didnt you press charges?\n\n\nThese types of people never learn unless they get a lesson they remember forever. \n\nDragging them through the streets being towed by horse is one thing that comes to mind.",
            "This is the perfect MC story! You were safe, justice was served, and for the love of god hopefully she was removed from that youth leader role. Hope you and son are happy and healthy!",
            "What a despicable, truly filthy human being and what a joyful gorgeous and deeply satisfying story!  Hope your toddler is doing well.",
            "Wowza! What a great story to read on my work break",
            "Holy shit I’m grinding my teeth I’m so angry about this. Glad you’re okay.",
            "I'm very glad you and your child weren't injured.",
            "I love stories like these. For extreme people, they need extreme lessons to help them understand that they aren’t the center of everything.",
            "Im 20 weeks pregnant and now I want tacos. Lol",
            "Ah, I also worked at Chipotle for six years. Saw so many of these types of customers.",
            "Why the fuck would you not want to press charges",
            "I hope she got banned from her Church, too... yeesh. \n\n\nSo glad you and baby were okay<3",
            "Yeah, I'll stop using the word \"Karen\" when people start using the \"N word\" as first names for their kids.",
            "Glad to hear that she was arrested! Her lack of concern for you and your unborn child is shocking! I also hope the parents of the girls she was watching ,know better in the future, than to put their trust into this reckless, inconsiderate ,unhinged , barely human person!",
            "She pushed a pregnant lady? She deserves a slap in the face. Disgusting behavior. I'm glad you and baby were fine!",
            "Wow. Most Karen stories are reasonably harmless but physically assaulting a pregnant woman is just awful. Glad you were ok",
            "Gotta say the name Karen is gonna be off the popular baby names list for AWHIIIIIILE",
            "And then Jesus clapped.",
            "Well, this is destined to be one of this sub’s top posts.",
            "Wow. I am so sorry you had to take physical abuse while in your condition but glad you were okay.\n\nThat woman was an abusive psycho and she needs to be monitored but especially, someone needs to cut her off from contact with the church kids. She had many symptoms of NPD, narcissistic personality disorder, and is unsafe to be around kids.\n\nI am so glad the cops were there.",
            "I bet she's the church's EX-youth leader now. I hope she's banned for life from that store/restaurant. What a GREAT example she's setting for those kids. (NOT!) LOVE when a Karen gets her just desserts!",
            "Fuckin' epic!",
            "This was absolutely MC and an awesome story.",
            "Love this so much",
            "I'm so happy you're okay!! What an awful cruel woman.",
            "> I kept telling them I didn't want to press charges \n\nYou are entirely too nice a person.",
            "“Karen: It’s a sturdy gal",
            "That's only $16 per order.",
            "What did she expect with *15* girls there? \n\nAlso I am very glad that someone caught you and you are okay!",
            "Worked at \"popular Mexican restaurant\", can confirm customers suck. \n\nMy favorite was somebody who once got mad that I wouldn't give him extra meat for free. He then screamed \"Well, how am I supposed to get fat like you?!\" He then called me every single name he could think of for gay and Mexican  he could think of and made an elaborate waddling motion to mock me out of the store. \n\nThis was also in the really rich side of town too. That customer fanbase was worse than the ghetto fast food places I worked at. I'll take drunk fools over rich assholes all day.",
            "Glad she got what she deserved! I’m confused though, 250 for 15 hungry people doesn’t sound like that much at all. it’s $16 a person for a meal out. chipotle is no fine dining experience but at the the very least she would be expecting to pay over 150! what a horrible woman",
            "She got what she deserved! I only wish instead of probation, that she was forced to work in a service industry. \n\nThank goodness the cops were there and took immediate action. Thank goodness your coworker was there to catch you. And thank goodness those kids had enough sense to be mortified by the terrible example of adult behavior set for them by their YOUTH GROUP LEADER.",
            "[removed]",
            "so not surprised she was a church lunatic",
            "Why is this removed?",
            "Why is it removed??",
            "HOW WAS THIS JUST REMOVED!!! I love you, I love this story. Everything is beautiful.",
            "Are you effing kidding me? Pushing a pregnant woman? I am quite rapidly losing my faith in humanity, if I haven't already.",
            "You are good people. \n\nSo hey, how are you liking being a mom? The kid's going through his own terrible twos right about now, am I right? ***THAT'S*** not as fun as they say it is!",
            "Uhh, I'm fairly certain I work at the same Mexican grill. This story is so relatable. I'm glad you weren't seriously hurt. Blessings on being a mom, friend.",
            "Level 10 of 'entitled'ness! She pushed hard a pregnant woman for giving her the correct bill - after being lazy enough to not stand to check the orders of the girls she was in charge of.  How can a person like this be a youth leader, especially that of a church? Somebody who is racist and abusive and violent and what not. Ugh!",
            "It's criminal how you had to work during 30 weeks of pregnancy. Maternity leave in the US is a joke. But good job on your self control! I'd have lashed out big time",
            "“Karen: It’s always intentional!!!",
            "I'm so sorry you had to experience this awefull disgusting behavioir towards. I rarely het aggrevated reading a post up here, but this one here made my blood boil. I would be close to jump her if I saw this is public.... Hope that you and your baby are doing well!",
            "This is a good one. Well, terrible, but hopefully a great story now. Sounds like you were ok, and that's o.k.",
            "Yeah if you interrupt a cops meal sufficiently that they have to get up and cuff you, you're  getting charged haha",
            "I don't understand how someone like that just doesn't get refused service at first offense. After she says \"I'll get your fat ass fired\" to me and everywhere I have worked that's game over right there. That's threatening staff. Job done. Remove yourself from the premises immediately or I will have no option to call the police. Feel free to tell everyone you know about what happened. We want to make sure rude people with no manners know they won't be served here.",
            "How many times can you tell someone the hole they're digging is a grave? Six feet long, six feet deep, a couple feet wide... and yet they're still shocked when they fall right in and get buried. \n\nSo glad you didn't get hurt. I used to work at said nameless-chain-that-may-or-may-not-have-started-in-Colorado and boy you get the whole gamut of customers. Some are phenomenal, they get to know you and they just love the food. Most just want food and to leave. Then there's the pieces of human trash.\n\nSidenote: I used to love making weird stuff and trying it on lunch breaks. Make a quesadilla with just barely melted cheese, quickly stuff it with burrito stuff, and wrap it. Toast it for some crunch. So much food. So good.",
            "Awesome",
            "Crossposted this to r/chipotle as I assume that’s what this restaurant was.",
            "The sad part is monsters like this women dont ever learn.  In fact you know she sat in the jail cell that day telling everyone that would listen SHE was the real victim.",
            "Glad you and tinykins are ok, and that the cops were there to see the whole thing! That's just icing on the cake! \n\nI used to work at a Mexican restaurant and people would ask for extra sour cream. I would always inform them that it was an extra $0.50. \"Yeah, I don't care how much it is, I just need my sour cream.\" But then when the bill comes they don't pass it off so quickly...",
            "Glad you were ok but the fact she pushed a pregnant women is enough that you shouldve pressed charges. She could've hurt you and your unborn child. Even if you were wrong theres no justification for what she did",
            "That was so satisfying to read - bravo!",
            "I love this, and I love you too. Glad you’re okay",
            "Yes girl yes!!!!!!",
            "Man, when you hear these stories, you can never believe how terrible people can be.  Then you read stories like this and you find that your cynicism and disgust in humankind is well justified.  \n\nAssault charges over $250 dollars...hope the lady thought it was worth it.  The stupidity and entitlement of people never ceases to surprise me.",
            "I would have low key got the kids to also order 2 guacs each. Guac in the food, AND chips, drink, guac...",
            "As someone who's worked years in food service, this is one of my favorite stories! So nice to know that sometimes the horrible customers get what's coming to them. Can't believe she was the youth leader, omg. 😣",
            "[deleted]",
            "[removed]",
            "I have a hard time believing this kind of thing really happens...",
            ">  I won't say which but guac was $1.95 extra and we were required to ask everyone if they were okay paying that price.\n\nIs that the one where the guac is free as long as you order the veggie burrito?  Because that's still my favorite thing.",
            "r/convenientcop",
            "This is awesome!",
            "Reading this got me so mad. Omg I want to punch her in the face",
            "Don't you dare take my guac from my rarri\n\nSicking fucking Karen.",
            "Now thats sweet sweet justice hitting it out of the park for once.",
            "Thanks for the story! convenient cops!",
            "That ending makes me happy.",
            "I’m sorry that this happened but that was a thrilling read. What a twat, poor kids though. I hope they enjoyed their food at least.",
            "Yep, that's a ban and a trespass warning and a picture by the register.",
            "Honestly if that happened to me I would give her the receipt one by one and try to make it look like one put it on the table and run to the back as she slowly realizes that hundreds of dollars were paid and influence the kids to get sides drinks toppings the whole package and see the Karen explode as I did EXACTLY as she wanted",
            "Oh this is good and juicy I love it. Sorry you got pushed and almost cried at the whole ordeal though",
            "Wow. I’m glad you didn’t fall over and your coworker was there. Also props on you for keeping your cook and keeping it professional. It’s already easy enough to lose your cool on a Karen never mind being pregnant as well!",
            "Happy to hear you are ok, congrats momma!",
            "I’m so sorry someone pushed you but so glad she got a free ride in the back of a police car lol",
            "Holy fuck. \n\nI didn’t go comment surfing but I hope everything was perfectly okay with you. She definitely deserved what came to her.",
            "This is beautiful. Fantastic story. Thank you so much for posting!",
            "What was the name of the woman and the location of the store? I'm interested to learn more about the case, if you don't mind sharing.",
            "r/all!",
            "I swear the aforementioned popular Mexican grill has some of the meanest customers in the whole service industry. Never before have I seen people seething with sheer hatred and contempt for the staff. They just show up and are like “bowl!” This is why I wash dishes...",
            "Sweet lady, it's crazy you took that all over a dining out experience. People are just cruel and crazy, and you handled that situation FLAWLESSLY. The highest of high fives to you. Total inspiration to keep cool in the face of total insanity. Thanks for sharing 😀",
            "Toddlers are fun. Be sure to pass on your experience so they'll be able to defend against future Karens!",
            "Salsaritas?",
            "As a youth leader, I make it my mission to never let my kids act up in public places, teach them to show respect to wait staff and servers, and always tip big because I know how hard large groups can be sometimes. I have a credit card with a reasonable budget, and I can't ever imagine just tossing it at someone saying \"they can get what they want.\" They always have guidelines for what they can spend.\n\nLet me apologize for this awful person. Sounds like this was probably the last in a long line of poor choices.",
            "No way I'd enable that behaviour. Respect is a 2-way street, you're out the store",
            "The post is gone but the comments from op aren't. I read a few but now I'm so confused.",
            "Has anyone confirmed that the baby was ok after all this nonsense by Karen? I assume so, but haven't directly seen it.",
            "This post made me get off the couch and make guacamole.",
            "Sad to hear that people from my religion are pushing pregnant ladies around and being total Karens but MAN that malicious compliance was sweet.",
            "That is awesome!",
            "The real travesty is that you have to work while pregnant",
            "“Karen: It’s not on me.",
            "In the first paragraph you wrote \"sire\" instead of sure just letting you know op also idk what that karen expected letting the kids order whatever they want and NOT expect a high price for 14 god damn kids? Karens don't stop to emaze me",
            "No more Chipotle for that bitch.",
            "Best ever.",
            "With that kind of content she wants out there",
            "Pardon my pronunciation of this phrase but, good the fuck on ya for being proper. Hope the babe is all good as such and fuck that bitch.",
            "Holy crap! What is wrong with people? How do you justify assaulting a pregnant woman? How? Where do people learn this _RAGE_ from? I’ve been annoyed at restaurants etc before, but never ever in a million years would I ever scream shout sweat or push people over. Da hell?! There is a polite way to handle almost any and every situation. Krikee"
        ]
    },
    {
        "post_id": "aqush0",
        "author": "RedWestern",
        "title": "Kick the main boss of the company out of your bar at a company drinks? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aqush0/kick_the_main_boss_of_the_company_out_of_your_bar/",
        "score": 24754,
        "num_comments": 1357,
        "created_utc": 1550221729.0,
        "selftext": "I don’t know if this is necessarily an MC, but it happened to my Dad. He was one of the three partners at one of his former companies (about medium sized). One day, he and his company went to a company drinks. I don’t think it was exactly a company party, but it was more than an after-work drink at the pub. \n\nAnyway, the bar was serving aperitifs, and my dad asked for his without ice, as he hates ice tainting his drink. The landlord, who was behind the bar, refused, and said the ice was mandatory. So he served my Dad’s with ice. Dad accepted it, took the ice out, and laid it on the drain rack that goes under the beer draughts.\n\nThe landlord ordered him to leave.\n\nMy Dad was half expecting it, but asked him to repeat himself. The landlord once again told him to leave.\n\nMy Dad said “Okay,” and started to leave.\n\nAnd his company all started to file out after him.\n\nThe landlord protested “No no, you don’t all have to leave. Only he has to leave.”\n\nOne of the other staffers said something along the lines of “Sorry mate. He’s the big boss. We all go where he goes.”\n\nSo they all left and went to another bar. \n\nThey had made a reservation at the bar they were leaving, but they hadn’t put down any deposit for it, and hadn’t bought any drinks yet. The aperitifs had been complimentary, so the Landlord didn’t even get paid for those.\n\nEdit: this is something that keeps getting flagged up, which is a valid point I didn’t explain properly. The drain racks my father put the ice on were on the counter between the bar and the customer. He didn’t reach across the bar.\n\nAlso, for clarity, “landlord” is what we call the guy who runs the establishment in the UK. Another word might be “publican,” although it wasn’t a pub in this case, it was a bar.",
        "permalink": "/r/MaliciousCompliance/comments/aqush0/kick_the_main_boss_of_the_company_out_of_your_bar/",
        "comments": [
            "Wish I could get the nice, awesome bosses that take us out for fun after-work stuff.\n\nBut no, I always get stuck working with the absolute dolts like this landlord.\n\nAnyway, that was a nice, short story. Thanks for sharing.",
            "[deleted]",
            "Womp-womp.\n\nGuy was probably trying to stretch the free drinks with ice, but he should have just let your da take out the ice cause the drink was already fucking poured at that point.\n\nHopefully this got him to work that stick out of his ass.",
            "I always enjoy the flip side where im forced to kick out soneone who is trashed in a large group (usually a boss if its a work thing) and the rest go \"if he leaves, we leave!\".\n\nLike yeah, I was hoping for that.",
            "I had one story like this before. We worked in an industrial manufacturing spot in the oil industry, and our boss's bosses came in. That means the company gets taken out for a big feast for about 10 people so nothing rediculous.\n\nWell they aren't the suit and tie kind of people. They're the Ariats and oil stained white shirt types.\n\nWe went to a decent italian place and when he tried to place a $1000 deposit they immediately told him to leave because they 'dont want our type ruining the reputation' of their restaurant before he could even finish talking.\n\nHe basically laughed, showed him the cash and said 'thats too bad, this could've been yours. Maybe o you don't like this type of clientele you shouldn't have opened a restaurant in West Texas.\"\n\nWe left, went to a steakhouse instead, and that was the first time I've ever had Surf and Turf, and he left a massive tip for the other place for not discriminating us.",
            "Similar-ish story.  When I was living in San Francisco there was this bar in the Mission let's call it Z which was well known for letting people smoke weed they brought themselves (this was during the medical cannabis years prior to full recreational legalization) because most of the bar was outdoor seating with rows of wooden picnic tables, port-o-potties, etc.  A real classy joint.  Well, they were also pretty well known for just randomly tossing people for smoking said weed or really for any transgression they deemed worthy at that moment.  Getting thrown out of Z at the time was almost a right of passage for a 20-something living in the city.  Well, one spring day my larger group of friends all decided to meet up at Z and we locked down an entire long set of picnic tables.  We hadn't even ordered our food yet and only maybe 2 of 15-20 people had ordered drinks when two of my friends who were seated at the end of the table got selectively tossed and rather rudely even for Z.  So the entire group was like fuck that and got up and left.  The last thing I saw as we walked out the door was the bar manager chewing out the bouncer who tossed us because he had just thrown out by far the biggest group in the place at the time right before all of us were about to order dinner, drinks, etc.  We laughed and took our business down the street.",
            "What a crap bartender. Other than diluting your drink, with or w/o ice creates almost like two different drinks even though they have the same ingredients. Not just temperature and water content, but also how the ingredients mix together is different. It should be such a standard request to have the ice removed even for drinks that are normally served with ice.",
            "This reminds me of a festival I was working.  The staff director tried ordering pizzas to the festival.  (Like $400 worth.)\n\n&#x200B;\n\nThe pizza place said they refused to bring an order to the park.  When she told them the amount she was ordering, they tried changing their mind, but it was too late, she had already decided to go elsewhere.",
            "It's one thing to not making small changes to your dishes after customer requests, but not even allowing them to consume their food or drinks their own way? That's a new low. ",
            "What the hell kind of snobby place is that where a bartender won't grant an extremely simple and costless request?",
            "N ice",
            "Somewhat related...  I stayed at a hotel on the campus of Penn State University.  Apparently there is a campus wide rule of \"no shots\" to curtail binge drinking on campus.\n\nWe were having drinks at the hotel bar (a beer and a shot) and the shot had to be served in a rocks glass with ice and had to be drank slowly (like multiple sips).  The bartender said she would have to stop serving us if any liquor was drunk quickly.",
            "I was on a Europe tour, and about 40 of us all piled into this club, and about 5 more and the tour leader were outside while the tour leader tried to organise the free drink tickets (the tour has relationships with certain clubs and gets benefits) except this time they didn't want to play ball. So the leader says, 'either you give us those free drinks or we all leave' the manager or whoever she was talking to looks at her and her 5 others and says 'guess you better leave'. So tour leader yells through the door that we are leaving and the manager watches his club empty of a bunch of hard drinking alcoholic tourists. The best part? On the way next door the tour guide ran into a second tour group and told them the story, so there went another 40 ish customers. AND The club next door apparently heard this and gave us all free entry and free drinks too!",
            "[deleted]",
            "Nice id say thats some malicious compliance",
            "I can't understand this.  Are snobby bartenders a common thing?  The dude doesn't want ice, don't put ice in his drink.  What's the big deal?",
            "I was chairperson of a student society. We met every week in a particular pub; we'd asked permission before advertising our meetings there. This one particular week the place was dead, we were literally the only group there. Whilst we had up to 70 people attend on weeks we were planning trips etc., our purely social meetings saw only about 15 people. As we were leaving the landlord pulled me to one side and said we weren't spending enough on drinks as most of us drank non-alcoholic drinks and would get one an hour. So I said no problem and we started meeting in another pub the following week.",
            "wait your dad was half expecting it? I totally would have taken the ice out and been very surprised to get kicked out. ",
            "\"Mandatory ice\" is bollocks though, there's no reason to do it. If the customer doesn't want ice then end of discussion.",
            "[deleted]",
            "Some liquor providers are not allowed by their insurance companies to serve straight alcohol (basically shots), but can serve as long as there is some ice or water in it. This was the case for the bartender at my wedding, it was in their contract.",
            "Two questions: \n\n- What is a \"company drinks\"?\n- What is a \"landlord\" in this context?",
            "How much of a sad sack of shit do you have to be to think you can force someone to drink their drink with ice??",
            "This reminds me of a story my dad once told me from his wild youth.\n\nHe and his friends were at a strip club one night. They were a pretty big group and the only ones there, having a grand Ole time and making it rain. One of my dad's friends apparently got too drunk and rowdy so the bouncers kicked him out. Well being the loyal friends they were, the rest of the guys followed suit, leaving the place empty. The strippers were PISSED lol.",
            "Your boss needed a bar that uses [whiskey rocks](https://www.amazon.com/slp/whiskey-rocks/ot9ze29wbou78xq) for those who like a chilled drink bit not the way ice dilutes it. That would have been an elegant answer to the issue.",
            "this is in the right place he probably knew what was going to happen and did it anyway.",
            "Who the hell serves drinks with \"mandatory\" ice.  He deserves to loss business. ",
            "Dude, that guy was asking to get fucked! Australia has weird alcohol laws I’ve heard. Any chance the owner was overzealously applying a law?",
            "I had this in happen to me in a bar in Australia, just kept taking the ice out and throwing it into the bars sink. After a few times of this happening they decided I was allowed to have my drink without ice. ",
            "I don’t know why, but it’s such a good feeling when a bouncer or owner doesn’t realize ALL of their patrons are in the same group and for whatever reason gives someone shit and everyone says “well, see ya later.” And everybody walks off. ",
            "Serves the guy right for being a dick about it. Literally takes no extra effort to put less stuff in a drink.",
            "Alpha as fuck.",
            "I mean what a Fucking idiot",
            "He handled it correctly and that landlord just realized he fucked up.",
            "\"Landlord\" or \"Publican?\" I'm assuming the American equivalent would be a bartender? Genuinely curious, what's the difference between a pub and a bar? ",
            "Why would you even insist on the ice? It makes absolutely no sense. I've been a bartender, I know you can get into trouble if you make the drinks in a wrong way, but only if the customer complains. Which will not happen if you make the drink exactly to his liking. ",
            "Proprietor maybe?  Establishment owner?",
            "YEAH! AT A COMPANY DRINKS!",
            "I took my department out once and the bartender was an absolute cock (pointless carding, slurs etc), so I yanked the 8 of them out.\n\nLove this story, enjoy my upvote.",
            "Why would you get kicked out of a bar for removing ice from your drink. What sort of controlling fuck face does that?",
            "Reminds me when I got kicked out of my ex girlfriends bday party. They didn’t realize when I left the 25 smoking hot 24 year olds would leave too. They let me stay :)\n\nThose days were fun. ",
            "To be fair though, it might not have been landlords choice. I work in a bar were, according to the liquor license we have to put ice in spirits. If we don't the bar and the bartender who served the drink could face a fine.",
            "\"You put frozen liquid where the liquid goes. Get out of my bar!\"",
            "Group of friends and I went to a dive bar that had music some nights. We go there to drink and guy at the door is asking $5 a person for the cover. We say \"oh didn't realize there was a cover, sorry!\" So he said \"oh how about $5 a couple then?\" Ahh no sorry we really didn't want to have to pay a cover..  \"how about a dollar per person?\"\n\nBut we ended up drinking across the street instead. We aren't asking for free stuff but we obviously weren't trying to trick the guy to get in for free. They would've made much more off of us just drinking! ",
            "I love it.",
            "Like a boss. Literally.",
            "Why is ice mandatory? To water down drinks or what?",
            "Bar owner for us Yanks.",
            "TIL: there's a difference between a Pub and a bar....",
            "What's the difference between a pub and a bar?",
            "Ice is mandatory?.. The only thing I can think is the ice was there to fill volume in the glass, and without it the glass would look empty. But to toss someone over it, yikes. ",
            "Your Dad is boss!",
            "Has no one else asked tf is an  aperitifs? ",
            "After years of working in Turkey, Romania and parts of Africa, my declining ice has never led to me being asked to leave, but people have learned about the risks of heavy metal toxicity and infection control, if they try and insist. I really don’t want ice, thank you",
            "PS a bar is a pub. Pub is short for public bar. ",
            "/r/prorevenge",
            "Gotta love the BDE of pulling out the ice and waiting with what I can only assume was a “Your move, slick!” expression on his face.",
            "I'm willing to bet that your dad didn't tell you the full story.",
            "I like to image that your dad is a big Ork  WAAAGH! BOSS in this story.",
            "Thats pretty badass",
            "Which country was this?",
            "Maybe not MC but an enjoyable story none the less! ",
            "Ice is mandatory? Someone needs to loosen up! ",
            "I had a terrible idot of a boss but he would have mandatory monthly meetings at the country western dance bar. He would tell us to bring our spouses or a friend and gave us all 2 tickets each for drinks. I think it was so he could tell people that he went out with people from work"
        ]
    },
    {
        "post_id": "sdon1t",
        "author": "TheUncleBob",
        "title": "Mortgage sold to a company that wants to charge me $14.95 to pay my bill online. So I send them a check every week for 1/4th the amount instead.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sdon1t/mortgage_sold_to_a_company_that_wants_to_charge/",
        "score": 24746,
        "num_comments": 1696,
        "created_utc": 1643254170.0,
        "selftext": "I figured someone here might get a kick out of this.  Last year, for like the 6th time since we bought our house, our mortgage was sold to yet another company.  I've never been late paying it, have occasionally made extra payments, never had any issues.\n\nBut this new company wants to charge me a $14.95 \"convenience\" fee to take a payment online.  This is absolutely stupid.  I can make a payment over the phone and pay another fee, or I can mail a check/money order for no fee.  Also, I can set up auto-pay, giving them access to my bank account, but that's a hard no from me.\n\nSo, I went online and my bank has a neat bill pay service where you can set it to repeat weekly, monthly, etc.\n\nTook the montly payment, rounded it up a bit, then set my bank to cut them a check every week for a bit over 1/4th the amount.  Doesn't cost me a dime - I don't even pay postage.  I'm sure the money comes out of the account a little earlier than the mortgage company actually gets it, losing me a tiny bit of interest or something, but man, it makes me feel better that for trying to charge me $15 for what is essentially an automated process for them, they now get to process 4-5 checks a month.  And, sure, I'm sure they have that whole process down to an art for minimal human interaction... but it's not zero.\n\nI really wanted to press my luck and send 1/30th of the payment every day, but I figured my bank might cut me off at that point.\n\n*edit* Wow.  I did not expect this to blow up like it did.  Thanks for the likes, rewards, and comments everyone.",
        "permalink": "/r/MaliciousCompliance/comments/sdon1t/mortgage_sold_to_a_company_that_wants_to_charge/",
        "comments": [
            "Gotta tell you my late mom’s story. They bought a house in 1975 and just like yours the lender changed hands numerous times.  My mom was old school and would keep every single canceled check in shoe boxes. For 30 years. When it finally came down to a few more months left the last lender sent notice that a bunch of months were never received and they now owed thousands in arrears. She copied the checks in question and they reluctantly sent them the deed.",
            "Had a work friend once that worked hard at a second job for about 4 years.  His plan was to pay off his mortgage early.  The mortgage co. told him that his mortgage had a prepay penalty, a relatively large one.  He consulted his attorney who advised home to pay it all except $200.  Then he advised him to pay it monthly by check for about $0.54.  After about a year, the bean counters at the mortgage co. told the customer service person to call my friend and make him a slightly lower penalty offer to pay the rest(I’m thinking it was about $200 plus the balance).  He declined, then strung them along for another year.  Same thing, they called to offer him only a $150 penalty, plus the balance.  He declined again, went about his business and was still paying them $0.54/month.  Midway through the third, they caved, he accepted their no penalty offer and wrote them the check for the balance.  He sent it via US Mail with signature of receipt returned to him.  He loves telling that story and in the end he didn’t pay them a cent of their silly prepayment penalty.",
            "This is weird. Where I live it's the other way around. Paying bills online is free - so is making a payment service to pay bills automatically, but taking an invoice to a bank to pay it costs a huge fee. Many companies also charge a billing fee every month unless you use the free automated payment service. Basically the more automated the process it is for the company and the bank the cheaper it is for you.\n\nYour story sounds like the exact opposite.",
            "Make sure they're actually applying these payments.\n\nI've seen horror stories of people who have done similar things and the mortgage company will just sit on the money because they aren't receiving full payments.",
            "Convenience fees make me rage hardcore.  You mean to tell me that as a reward for *paying my bills, ON TIME,* I’m being charged extra for the PRIVILEGE of making the payment in the easiest way for both parties?! Choke on a Popeyes biscuit. _,!,,",
            "It really bugs me that this kind of thing can happen with mortgages. Like, you sign up with your bank, and agree to their terms, and then they sell it to someone else who changes the payment rules.\n\nThis is one of many reasons I got my mortgage from a local credit union. While they couldn't make any promises, I was told they try to remain the servicer of all their mortgages. So even when they sell the mortgage to someone else, my payments are still handled by the credit union. It's been almost 10 years, and that's what happened -- I've gotten a total of 2 notifications of the mortgage being sold, but on my end, everything still looks the same, as far as how I make payments.",
            "Yeah my landlord did something like this to me. I was doing bank transfers online but they changed to an auto deduction system. New system tacked on a two percent fee onto my rent.\n\nPaying with cash at the post office is free and is fifty yards from my house next to the store I get my food from.",
            "Several states prohibit fees like this, or at least are very strict on it\n\nCalifornia\n\nFlorida\n\nMassachusetts\n\nMichigan\n\nNorth Carolina\n\nTexas\n\nWashington\n\nWest Virginia",
            "You are my hero. I've had Carrington Mortgage for years. They also charge a \"convenience\" fee to pay online. I hate them. But it's only $5.00 for me.",
            "Open another bank account for auto-pay. So bank account 1 is firewalled from account 2 auto-pay issues.",
            "Bonus: By sending them a check a week, you are lowering the balance a little bit faster (and making an extra full payment a year) which means you're paying the loan off faster and saving yourself (and costing them) interest.",
            "Good for you.\n\n$14.95 x 12 (annually) = $179.40 x 30 years = $5,382 = inconvenience fee\n \nDouble dipping since you already pay interest on the money you borrowed for the loan. I watched this become more common since the beginning of the Pandemic.  Such greed.",
            "When my wife and I were just dating she was renting a apartment. \n\nShe was about 4 steps from the leasing office. They had an app that charged you 5$ to pay your rent with, or, like in your case, giving them a check was free. \n\nEvery month on the first she would turn up with a rent check on her way to work.....at a local bank......then the leasing office lady would bring checks to that local bank and my wife would deposit them in the business account for the leasing office 🤣",
            "That is fucking hilarious. You're a hero. Companies suck so much for doing stuff like this.",
            "I'm not sure about processing fees, but when we signed our mortgage there's no late fee until like 15 days after the due date, but the company it got sold to sent us a new document without that, but our realtor told us we are entitled to the exact mortgage we agreed to, so had to call and our account gets a 15 day grace period.  It feels criminal to change the agreement just because it was sold.  What's to stop them from changing your interest rate at that point.",
            "This selling mortgages to others and it changes who you pay throws me for a loop, this doesn’t seem to happen in Canada, is it illegal or does it happen but the originator stays responsible for collecting payments? I’m pretty sure if someone sent me a letter saying you pay me for the mortgage now instead of BMO I would just stop paying",
            "The fuck is wrong with American banking?",
            "may I take the time to say, how much I wish the companies would take their 'convenience fees' and stick them?",
            "Report them to the Consumer Financial Protection Bureau. That charge is out of compliance with the CFPB's requirements for mortgage servicers and, if the practice is their s.o.p., may result in severe sanctions.\n\nhttps://www.consumerfinance.gov/",
            "Recently moved to southern Indiana.   The water company here charges 5.99 to pay the bill online.   Now I pay a dollar and snail mail them a money order every month.   Lol",
            ">auto-pay...that's a hard no from me.\n\nIs that the US equivalent of direct debit? I'm just curious why it's a hard no with you? Direct debit is the norm in the UK for most people, all my bills are setup as direct debit, easier than having to remember to pay things every month online and taking time to do it, and companies obviously prefer it, so they often offer a discount to paying that way too. \n\nI don't exactly like paying bills but at least this way there is no risk of late fees or something getting cut off because I forgot! \n\nJust curious why you'd rather create work and hassle for yourself paying manually every month? (when they didn't charge a fee that was!)",
            "> But this new company wants to charge me a $14.95 \"convenience\" fee to take a payment online.\n\nI was under the impression that, when a company buys your mortgage/loan, they are required to honor the original terms. A loan is a contract and it binds both sides.",
            "I keep getting amazed about certain practices in the USA.  \nWe will charge you extra if you use an efficient way of payment that requires close to zero effort on our side to process the payment.   \nPlease send us a pigeon with dollar bills attached to it's feet, we prefer it that way.",
            "I would have politely explained what I was up to and promised the bank it would only be a 1 month deal. Then id promise to move to 1 a week.",
            "I would do the daily check until the bank stopped him cause wtf not?",
            "I find it so strange that your mortgage can be sold to another company. The only time my mortgage has moved anywhere it has been when I initiated a transfer, which I only would do if the new bank offer a better deal.",
            "Open a $500 bank account at Bank of America, that way you can fuck with two companies at once who have questionable practices at best.\n\n1/30 payments all year.",
            "Is this one of those \"Tell me you're an American, without telling me you're an American?\"",
            "This is beautiful malicious compliance. Charging $15 to pay electronically is obscene. I hope they enjoy processing over forty cheques a year!",
            "If it has been sold enough times, you should request a copy of the promissory that you signed when you took out the loan. If they can't provide it, you don't owe them.",
            "I am a banker. If you explained the situation to me, I would gladly spend the 30 seconds/day sending them a check every day. Just don’t ask me to waive fees. That would ruin the whole thing we got going.",
            "More than likely it’s going as an ACH",
            "Great idea. The fee to pay online is complete B.S.\n\nBut, I hate to be the one to bring this up. Your bank is probably paying the mortgage company electronically. Very likely, no human interaction is involved for each payment.",
            "Add an extra $1.38 (or other minor, arbitrary amount) with the memo to “Apply overage towards principle” so they have to do some math as well.",
            "My mortgage company tries to get us to sign up for “autopay” every month. Every month I ask what discount they will provide me. \n\nTeller at the local branch gets a kick out asking at this point. Every month for the past 12 years has been paid by check in person with a printed receipt. \n\nOnline payments and phone payments are charged a “convenience fee” so we tie up an actual person each month and have them print a physical receipt. It’s only convenient for them.",
            "Someone correct me if I’m wrong on this but paying every week is going to pull more money from you than it would normally, but wind up finishing your mortgage early, and overall the interest you are saving on doing this for the mortgage is going to far outweigh what you lose by not having the money in your account collecting the tiny interest it would. I think this winds up being a big win for you.",
            "I feel your frustration. My mortgage was sold to a company (Truist, IIRC) that won't let you pay online unless you open up a checking account with them. A checking account that has a monthly maintenance fee. Fee can be waived, of course, if you keep enough money in the account and make enough deposits to the account... but why would I ever switch from my current checking account with no maintenance fee?",
            "That sounds illegal to me. You didn’t agree to that fee when you first signed.",
            "For getting rid of your tiger print 2004 check book. :  52 post dated checks. One envelope. Saves on postage.  Just a thought.",
            "Banks pull this sort of crap on Car and other large loans all the time. I had it done to me once by a certain \"Bank named for running after the $$\". They made a deal to have me drop my full payment to bring my loan current (I was behind by 28 days in December.. go figure!) and promised me Friday if I pay by the following Tuesday 9am I am good. They 'repoed' my car Saturday at 12:01 am, along with all my trade tools, materials, ect. \n\nThen after finding out it was a new manager looking to make a big impact after promotion on Tues AM, they said I could get my van back for the low payment of $2700 (and I only owed $2100 on the remaining balance!) and hounded me for 2 months to do this. Lost all my families business's business and personal business too. Researched this move and found out it was more common than you would expect.\n\nI have never had a car payment after that. Ill bus before taking a Loan on any car ever again.",
            "I work for Fiserv (the 3rd party company that runs bill pay for most financial institutions). Mailed checks have the obvious downside potential of being lost in the mail or delayed when being cashed. Reordering a replacement has a built-in 4 business day processing delay due to the reissue and delivery. You seem diligent, but your plan sounds like you haven't factored in the lost opportunity cost around all the manual review you've built in for yourself. Set it for monthly and find a better method to maliciously drain them of pennies: set your statements for paper delivery, use a call assistant to place calls and sit on hold while raising their call service levels, send legal debt validation letters (requires a response within 30 days), etc",
            "I worked in the automated check-processing business forty years ago. Even back then it cost a little over $1 to process a check. I once sent a check to the RNC for a penny, and they cashed it. Yay me.",
            "i paid my mortgage off down to like $31 dollars or so - i get a bill every month for about $0.28 - i didn't pay it off because i enjoy the idea that the bank is mailing me a statement for about 50 cents postage for no more than a few cents interest.",
            "I don't get it. USA is one of the most advanced countries in the world, and yet, for the stories I read here, looks like your banking/paying system is much worst than ours (Brazil).",
            "I’m currently doing the same thing with my HOA. The Board fired the old corrupt HOA property management company for a better one. However, their one downside is that you have to pay $3.95 for their automatic ACH payment system every month for dues. Instead, I request the payment book and spend the $.60 or however much a stamp costs. I’m gonna be signing up to do my banks bill pay soon so I don’t have to even pay for the stamp anymore. Lol",
            "You are probably saving on interest if none of your payments are late. Fractions of pennies but still. This is actually a pretty good way to pay mortgage. I would recommend adding $5 every time. You've be surprised how much of a difference it makes over time.",
            "Are Americans the only ones who still use cheques? No offence meant, it's just such a foreign concept to me. I've lived a whole bunch of decades and never owned or needed a cheque book. \n   My parents did, sure, but they were born in the fifties. \n   I received a cheque 4 years ago from medical or insurance or something. Had to take it into the bank to deposit it. During my lunch time, because... banks. Kinda inconvenient.",
            "Be careful. I had the same situation and they were not accepting my checks because they were not the exact payments. I usually paid more than what was actually due, and this company tried to foreclose on me because they were not posting my checks to my mortgage and told me I owed them months of back payments. I guess my unsolicited advise is to not play games with your home.",
            "It's rude they charged this fee. That said...\n\nYou should not make partial payments on your mortgage unless your loan servicer agrees to it. They can reject the payments or just guess how they should apply them.\n\nBill pay is also a bad method to pay your mortgage because the servicer has to guess how to apply it.\n\nRecurring withdrawal would have been your best option. I mean the servicer already knew your banking info cause you put it on your loan application.\n\nThis may have felt good to you but it is an automated process for the servicer. It did not cost extra resources other than the computer having to be on a picosecond longer.",
            "My house loan was originally through Wells Fargo.  They sold it to us bank.  About a year later I tried to get a store credit card for my wife and was declined cause my credit score was in the 400s.  It normally is mid 700s.  I asked why.  It was due to missing payments on my second mortgage.  I didn't have two mortgages.  Come to find out Wells Fargo never closed my loan they sold and was reporting me as having late payments.  I wrote letter to exuifax and Wells Fargo.  Exuifax said they would check with Wells Fargo who said yep its a real loan.  But when I asked Wells Fargo they said no.  I even sent exuifax the letter from Wells fargo with them saying they had sold it, and equifax wouldn't accept it.  I ended up telling the story to a loan office at us bank and they asked for power of attorney on this specific instance and started making calls. I fought with Wells Fargo/equifax for about 2 years.  Us bank ended up half threating them and had my credit score restored and the second mortgage dropped within 2 weeks.",
            "This happened years ago. I had a Citi bank account and Citi credit card. I had set up $20 auto pay at the time. It was the minimum required. I did this to avoid late fees in case I forgot to manually pay it off every month. Low and behold my minimum payment got bumped to $35 or $40 l, I forget. I did not realize and had a late fee. I was pissed. I called, got the fee reversed. I kept the credit card opened, kept paying $20 a month auto pay, and stopped using the card all together. I now get a mailed paper check every three months for $60. I mobile deposit into the account that pays the auto pay. I’m just recycling 60$ between accounts now at the expense of them cutting a check and mailing me negative balance check every 3 months. Screw em.",
            "Our mortgage company did this. We got a refund for the class action lawsuit that came out of it. It might be illegal to charge these fees",
            "The more I learn about what Americans have to put up with the more I think what in the actual fuck is going on over there",
            "New to the USA here, and I was shocked at how often cheques are used.\nThen I found the same payment method at my bank, and nearly shit my pants laughing.\n\nSo, businesses here won't take payment via card, or give me their bank details so I can pay directly but they are happy to let me tell my bank to send them a cheque in the post, then have the hassle of dealing with it.\nAnd more than that, banks are happy to have the cost of PRINTING AND MAILING a cheque! \n\n\nBanking in America is backward.",
            ">Also, I can set up auto-pay, giving them access to my bank account, but that's a hard no from me.\n\nWhy is this a hard no? They can't take out money that you didn't approve. Your checks have your account number and routing number printed on them anyway, which is what the autopay ACH would use. So what's the big deal?",
            "Stares open mouthed at the banking and billing fuckery from across the Atlantic. \n\nSorry US, your systems are terrible",
            "Find a sympathetic banker and explain the situation. They might give you a pass 😅",
            "I did that for years with my electric company. They kept insisting that I pay online but wanted to charge (like you) so I insisted on paper bills and cut them a check every month. Told them I’d pay electronically when they dropped the fee. When they did, I switched. \n\nStill pay my water company with a check, and plan to until they drop the fee as well.",
            "you’ll be making 4 extra payments a year (1/4 the monthly payment makes 48 weekly payments per year required to meant the monthly minimum) so any interest that is added for the day or two it takes to process will be far less than the extra 4 payments you send through which leaves you better off as they will go straight onto the principal.  At least that’s what would happen here",
            "I feel bad for anyone that has to pay $14.95 just to pay online.\n\nWhat is the company's name? I think Reddit users might be able to help.",
            "Be careful with this though. Mortgage companies are strange. If you don’t make a full payment, they will hold your money in a suspense account until a full payment is received. Then they will apply it to your account. If your payment is due on the 1st, but they aren’t getting a full payment until the 28th, they may be charging you a late fee every month.",
            "You guys can still pay by cheque? I don't think I've seen a cheque in twenty years. And whoever you got your mortgage from can just pass on your mortgage to another company without your approval?\n\nMan, America is whack.",
            "You should talk to someone at your bank and explain to them what is happening and what you want to do, they might have a way to help you do a check-a-day thing to piss them off, from my experience banks don't like it when companies make their jobs harder (and pushing a bunch of people to use check instead is doing just that).",
            "Love this. Amazing how companies just jack up fees for what essentially costs them nothing.",
            "You're lucky my bank wont accept less than a full mortgage payment.",
            "Just be aware that bank pay systems can take over a week to process and be mailed out. You don’t want that mortgage company hitting you with late fees.",
            "Doubt the person who came up with the convenience fee is gonna be the one processing those checks but still funny",
            "Great job OP. As someone who worked for a place that charged people to take payments, this is a great move. Reconciling shit like this is a pain in the ass. Not to mention the more translations they have the longer it takes the system to process. And forget about system failures, bc when they have them, they will have to trace back 4 times the number of your payments. When they mess up, they will remove all fees, and also set your account to not accrue fees for the future.",
            "Not a mortgage, but I once had to go pay a bank a $3 overdraft fee to close my account.\n\nTook the letter to a teller, older colored lady , she read it and first words out of her mouth were, “They oughta be ashamed of them damn selves”\n\nBest teller ever!",
            "Keep on eye on the mortgage, at least for a couple months.  I started sending half payment checks every two weeks from my bill pay, and my mortgage decided to count them as extra payments because it was a different amount than the monthly payment.  So they showed me as being a month behind when I had made that month’s payment.",
            "I know with cell phone plans back in the day, any change to the terms of service was considered a new contract and ergo grounds for termination of a contract the payee (e.g. You) no longer wished to be bound by, with no 'early termination' fees.  This included the odd cents that the carriers were charged by the government and passed on to their customers.\n\nI don't know if that sort of thing would apply here, but I'll bet it'd be fantastic if it did!  $15 fee? Nah, and I'm good on the balance of the debt kbye!",
            "Make sure those payments are applied to the principal as they're received. Believe it or not, you'll pay your mortgage off quicker that way.",
            "My Mom had her mortgage get sold to Bank Of America, she had a fixed rate and they tried to jack the price up the next bill, she called to complain, they agreed the amount was wrong and had actually upped the price even more. She finally got  a manager who assured her that this was happening and all legal and above board, at which time she said she'd contact the Attorney General's office and see what they thought.\n\nAfter getting put on hold for a quick meeting the rate and amount due magically went back to what it was. Always wondered how many people they fleeced who just didn't think to threaten to expose crooked banks?",
            "You're probably sick of hearing this, but as someone from another country, I find the very idea of the debt I have to a specific bank just being sold or moved without my consent absolutely absurd.",
            "Does your mortgage permit convenience fees?",
            "Genius",
            "Set it up to do it daily.",
            "All banks use 1 of 2 or 3 software packages that are coded and maintained by 3rd parties.  So the features of 1 bank are likely to also be the features of another bank.\n\nIn my \"business login\" (you might need ask the bank to create that) I see the option to \"create new user.\"  This creates a unique username/pw.  I can then assign rights to that user, so they can only see the account I want them to see, do the things I want to allow.\n\nI made a checking account solely for the purpose of doing paypal and wise transactions.  Paypal and Wise only see that account so neither has access to my real accounts.  You could do the same for your bank.  Setup a monthly transfer into the account from your main account, and let the mortgage co draw from that.",
            "I know I’m late to the party, but if you wanted to add an extra step of annoyance, if you hand write a check, and your signature “accidentally” drifts below the line and happens to go through the bank account/ routing number even just a little bit, the check can’t be processed by most computers. \n\nSource:  my mother in laws signature does this all the time when she gives the grandkids money for birthdays and holidays or whatnot.",
            "I used to pay my bank bimonthly to coincide with my paychecks. They sent me several letters saying that they did not allow partial payments and I would be facing penalties. But I remembered trading somewhere that they are required to accept any payment and apply it to the principal and interest in a prescribed order, and the wording of the rule sounded like it specifically supported partial payments.  I ignored their letters for many years and never had any real problems with them over it.\n\nBut after reading your story, now I know what they were being defensive about. Lol",
            "It's wild to me that they can sell on your mortgage, I live in the UK and i don't believe that can happen here.",
            "I dont understand why it costs so much to pay rent/mortgages online. My apartment charges $54 to pay online using my checking account.",
            "A fee for paying what you owe gives me the shits. You are a legend in my eyes!",
            "You could make this more optimal for you by sending multiple check all at the end of the month in smaller amounts like 10 checks for 1/10 the amount on the 25th or whatever to make it easier to manage and keep that interest lmao",
            "My mom's mortgage was sold to different companies making it a huge pain. So when I was house shopping I made a point to ask all the different banks/credit unions if they sold their mortgage or kept them in house. Places that sell them like to beat around the bush and try to make it not sound as bad. We went with a credit union that keeps it all in house.",
            "Make sure the extra money is going towards principle and not future payments. Depending on how their system works it could be continuing payments ahead of time and that won't help you save money.",
            "My bank politely asked me not to do this because they had to recalculate my interest owed four times a month…you are giving them more work than just processing checks- they should be adjusting your principal each time too hahahaha",
            "You could always get personalized checks with a picture of your butthole on them, or some other suitable image to send a message.",
            "Is it true that in USA you can’t transfer money to other accounts online via your banks app?  You have to use cash app etc for things like that ?",
            "In canada you you just set up a EFT direct debit from your account and it comes out monthly. Don’t give it a second thought. Costs nothing.",
            "Every time I read about how payment stuff in the US works I just shake my head and imagine actual post carriages blazing westwards, it's so backwards."
        ]
    },
    {
        "post_id": "f7v1q5",
        "author": "Ars-Torok",
        "title": "You are salaried right? Just stay up for this meeting.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f7v1q5/you_are_salaried_right_just_stay_up_for_this/",
        "score": 24703,
        "num_comments": 1064,
        "created_utc": 1582390085.0,
        "selftext": "Before we begin dear readers, a brief bit of backstory.\n\nI have found that every company has a Todd. You will know who your Todd is, because he is who you call when you don't know who to call. When the unthinkable happens and everything is on fire and there is no hope of salvation, Todd steps in to fix it. Todd spends his entire time just fixing the unfixable. He has been with the company since the dawn of time, knows the true names of several demons, and was in the room when the old magic was written. \n\nOur Todd has an elite team to be on call when stuff breaks. Each team member is the highest authority in the company for one specific thing or another. They are the elite. Their word is law and to question them is to question Todd.\n\nOur story begins shortly after I had accomplish greatest goal, and became the newest member of Todd's team. \n\nNow my company works with point of sale. We sell computers, software, printers, card readers, and pretty much anything you need to take money from someone else. \n\nAfter years working in the call center, I proved myself worthy of Todd's attention. I interviewed, tested, and became the specialist of Third Party Integration. My focus is the connection between our product, and whatever wierd stuff your company wants to use.\n\nExamples of this include getting smart lights to change on command from ordering kiosks, letting the staff control the new jukebox you bought with their employee ID cards, or getting the sales data for the day to report to your canadian counterparts in both French and English, but only if someone buys the poutine-saurus surprise that day. And other fun conundrums that only the client can fathom. \n\nIt is important to note that during my time in the call center, I was paid hourly. As a specialist, I would be made a salaried employee, and would be on call. After accepting the position,  I was told that I would have a trial period of one month to prove myself. I would remain hourly, but would have a pay increase to more closely match my expected rate as a salaried employee. I would have the title change and new responsibilities of my job, but I had this month to prove I was worth the extra denaro. \n\nThe first day of my new job. We get a call from one of our more needy clients. They lay out a series of demands\n\n1) all of their stores must be upgraded to Windows 10.\n2) as each store makes about $10k a day, taking them down for a remodel is not acceptable. \n3) All of these upgrades must be done overnight while the store is closed.\n4) if the upgrade fails, the store must be rolled back that night so thet can open hourly.\n5) the window of time to do one of these upgrades is eight hours\n6) the fastest they have been able to do one is ten hours.\n\nAll of this means one thing. They need a specialist to do the upgrades. One that knows their integration. I give Todd the \"Put me in Coach\" nod and a deal is struck. Todd is about to leave on vacation, which leaves me under the control of Steve, the director of The Support Center, who used to be my boss before i worked for Todd.\n\nI am now on overnights. Four nights a week I upgrade these stores. I supervise two to three technicians who are on site in seperate stores. I do all the software. They do the hardware. \n\nThis process is staggered based on timezones, so I generally am pulling twelve hour shifts. The OT is amazing, especially paired with the raise I got.\n\nFast forward a week or two. The initial batch does not go the best. I have a 40% failure rate. This is due to scripts provided to both the client and me by the various third party companies used by the stores, including their music, food delivery, and credit card processors. Everyone on their side knows who is the bad guy here. Talks are in place and we are moving forward. \n\nA meeting between the client and us is schedualed near the end of the week, right in the middle of my off time. As I said I am working twelve hours a day. I live a full hour from work, and for security reasons can't do these upgrades outside the office. I have ten hours to eat, sleep, get up, and eat again before work. Once I get to work, there are no breaks on the upgrade train. No lunch, no stopping. So i get home around 11 am each day. The meeting is set for 4 PM. I can't get any reasonable sleep, before the meeting or after. Steve demands that I be there to account for my failures. I already have another specialist designed as my proxy for these sort of meetings, because sleep is a thing. I also explain that I am still hourly, but he wont hear it. He insists that I need to be there to explain why the project is going so poorly, and that my explanation better not just be throwing other people under the bus. He tries to explain that i am salaried and therefore need to be there when the company needs me. Especially when I am the one who is screwing up. Again I try to remind him of my probationary period but he won't listen. \n\nAnd there my friends, begins the malicious compliance.\n\nI clock in at 10pm the day before the meeting. I do my upgrades, all three of which are successes, due to what I assume is a change in the third party back end. The scripts I am provided with work perfectly this time, and all goes well. The corporate contact I report to in the morning tells me the meeting is just to go over the new changes to procedure we went through that might, and I will get the cliffsnotes in my email. No need to attend the meeting. I thank them and sign out. Then I sit. For six hours I twiddle my thumbs, take a lunch break, (and a car nap) and wait for the meeting. When its time, I walk ipstairs to the top floor and the conference room, where everyone but Steve is shocked to see me. I calmly take my place and wait for the meeting to start, stating that I was asked to be here. \n\nThe meeting lasts 30 minutes, and consists of the new procedure, praise for my dillagence, and a quick overview of how the time table will change because of the past failures. It is noted that my performance has prevented a lot of the sites from failing when they would have otherwise, and the client is pleased with my work. Steve, who had previously blamed me for the failures, sheepishly agrees that I was a good fit for the project. Then the meeting ends with the best part. The person giving the talk states that she knows I am asleep right now, so she will go over the changes with me personally when I get in tonight. Meanwhile, the guy I asked to sit in on the meeting for me will work with them to set up the changes to be deployed, (about three hours of work) so that it's all ready when I get in at ten. The meeting ends. Steve makes a comment about the changes being done by someone with more experience and hints that it should be my responsibility. I cheerfully say that rather than waste my co-workers time, I will just do the changes myself. I have my third or fourth wind by now, and am ready to go. \n\nAt the end of day two, I have spent 36 hours at work. Caffeine is my only salvation, and we are almost done. Near the end, I am basically waiting for a technician at my last store to finish testing, so I tell him to call me, and shut my eyes for about half an hour, just to rest a bit. All is well. I get called, everything is green. The vigil is over. Two of my friends insist on driving me home, where I promptly pass out into the most heavenly sleep I have had in ages. \n\nI wake up to an email, asking me to head into work for a meeting with HR. It is my day off, so I am kind of perplexed. I head on in, and apologize for being fashionably late. The meeting is with the head of HR, who has a report that I was sleeping on the job. There is camera footage of my 30 minute power nap.\n\nI calmly explain that Steve had asked me to show up to the meeting, and then asked me to stay later to set up the changes, and by the time I took my nap (during what I called my paid 30 minute break) I had been in the building for 35 hours. I politely remind the HR head that I am on my trial period, and will be expecting overtime pay for that time. It came out to about 33 hours and change, due to my extended lunch break. \n\nTodd returned from his vacation and tore Steve a new definition of duties. From then on he would not be given control over Todd's team when he was away, and we would report directly to the CEO. The project completed without much incident. And I passed my probation with flying colors.\n\nEdit: a bit more info, since people are asking. Steve would later be fired several months later due to a similar situation where he threw someone so hard under the bus that everyone stopped and saw how uncool that was. He was replaced with new Steve, who is a superior Steve in every way.",
        "permalink": "/r/MaliciousCompliance/comments/f7v1q5/you_are_salaried_right_just_stay_up_for_this/",
        "comments": [
            "> I have found that every company has a Todd. You will know who your Todd is, because he is who you call when you don't know who to call. When the unthinkable happens and everything is on fire and there is no hope of salvation, Todd steps in to fix it. Todd spends his entire time just fixing the unfixable. He has been with the company since the dawn of time, knows the true names is several demons, and was in the room when the old magic was written. \n\nAfter reading this, I would like to find the Todd in my company.",
            "So someone reported you to HR and had camera footage of you during your power nap within 24 hours of it happening?  Sounds like someone put a bullseye on your back after that meeting.",
            "Getting called in on your OFF DAY because some fucking busy body spotted you \"napping on the job\" but failed to realize you had been at work for 36 hours is an absolute fucking nightmare, steve only got in trouble because his brand of miserable wasn't the right brand of miserable.",
            "Steve: Don't throw people under the bus!\n\nSteve: \\*\\*\\*Damn well would have thrown OP under the bus if the last three weren't a success\\*\\*\\*",
            "Arrogance, ego, pride... WTFever you want to call it, it never has a place in a corporate scenario. It’s always gonna cost someone a lot of money in the end",
            "[deleted]",
            "[If there's a *huge* fuck-up, call Todd.](https://i.imgur.com/vgjgaCi.jpg)",
            "\"...and tore Steve a new definition of duties\"\n\n&#x200B;\n\nMy friend, this sentence is a work of art!",
            "Lovely!  And the exhaustion was clearly well worth it!",
            "See, this baffles me. They know your schedule. They know the times you have to work with. if you HAVE to be at a meeting, why not do the meeting right at 11 am when your work for the night is over?",
            "[removed]",
            "I hope you got paid for having your time wasted by HR on your day off.",
            "I'd be more concerned about the company having someone specifically focused that you took a nap",
            "[deleted]",
            "Well this was incredible! And let me tell you, I feel you on the 35 hours-no sleep plan.\n\nI used to work two jobs, and every weekend would start at 5am Friday, work from 6-2, go home, shower, eat, other job from 3:30-3:15, drive to work, sleep until 5:55, work from 6-2, go home, shower, eat, and then last shift from 3:30-3:15. \n\nMy first job asked me to come in twice on Sundays from 8-12, and I swear, I tried. It did not go well, and I’m glad I was valued there, or I’d have been fired.",
            "Your company needs a health policy (work/life balance). In our company, 14 hours is maximum for anyone, including the literal CEO, President, VPs etc.. yeah 14 hours is a lot but also in the tech world, it’s common to see 10-12-16 hours a day on IT projects when there’s unrealistic deadlines to meet.",
            "Why would anyone want to be salaried? Time is our most valuable possession.",
            ">pretty much anything you need to take money from someone else.\n\nSo, handguns?",
            "Hr calling you for sleeping is a giant red flag of a company that does not care about results but cares about control, keep this in mind.",
            "“I live a full hour away from home”\n\n...interesting.",
            "If you are an apprentice todd, does that make you a toddler?",
            "Todd be praised!",
            "You live a full hour from home? That's an interesting conundrum!",
            "We are all very proud of you. Great story.",
            "I'm delighted at how this was written. Though, in every company I've worked for, there was no Todd. Only heathens.",
            "We don’t have a Todd at my work. We have a Jane. And she’s so integral for our success I turn to her for everything. She announced she is retiring this week. Our place will likely implode once she leaves.",
            "I love the way you opened your tale.",
            "I fear I'm the Todd in my office, luckily just my office, not the whole thing. I only know the true name of lesser demons, and they are the ip numbers of the printers",
            "I'm watching The Magicians, and Todd is the guy who is clueless and no one likes. This seems like a very different Todd. Although he is absent for 95% of the story",
            "Yep! Sometimes you just have to suck it up and \"play the game\" until things fall into place...lol. Good for you for keeping your composure and sticking with it!",
            "Yes yes, that's all well and good, but tell me more about this poutine-saurus...",
            "'At the end of day two, I have spent 36 hours at work. Caffeine is my only salvation, and we are almost done.' \n\nI felt this resonate with my soul.",
            "We had a systems engineer named Todd.   He was terrible. We use the name Todd differently than in this story.  “Stop being a Todd, and get to work.”",
            "My company pissed off our Todd and let him walk out",
            "I enjoy your writing style. You should write more stories!",
            "I know exactly who our Todd is and, unfortunately, while it isn’t me, I’m Todd Jr. When Todd is gone everyone comes to me, but my employer won’t pay me like a Todd Jr. They have also made it very clear that they have no intention of ever promoting me even to the Todd Jr position. It really sucks!",
            "I ... I’m horribly afraid that I’m the company Todd. Do Todd’s regularly get told things like “you know everything”, “Todd, how do I do [this very specific yet basic part of my job that I really should know how to do but haven’t bothered to learn because you’re here]?” and referred to as “our go-to girl/guy?”\n\n😭😭 I don’t want to be a Todd.",
            "The problem with being Todd is that Todd has a bus-factor of basically one. Todd will never get fired, and Todd will get done what needs to be done. Everyone can rely on Todd. But Todd never gets to take a vacation, and if there were a position above Todd it would not matter because Todd can never get promoted. He is too vital where he is at.",
            "Todd sounds like the best kind of anti-Chad.\n\nEdit to ask: did they get mad at you for all the OT? How much did it come out to on your next paycheck?",
            "I like this term Todd. I'm definatly using it.",
            "Good job!",
            "Great story and well written - thanks for sharing!",
            "36 hours without sleep? As someone with epilepsy, and sleep deprivation my #1 trigger, that would be life threatening. I can't believe workplaces are allowed to do do this to people.",
            "Bet the guys face was pure shock when you explained how long you have been up. You deserved a bloody power nap! I would have passed out....though I stayed awake for 24 hrs once but was a zombie.",
            ">He was replaced with new Steve, who is a superior Steve in every way\n\nBetter as in not horrible, or better has in a worse person.",
            "> At the end of day two, I have spent 36 hours at work. Caffeine is my only salvation, and we are almost done. ... Two of my friends insist on driving me home, where I promptly pass out into the most heavenly sleep I have had in ages.\n\nOh man, I've been in that exact situation and that feeling of collapsing into bed, knowing you can sleep as long as you like and everyone at work will not call you for the next 48 hours is beautiful.\n\nThe only difference was I took my power nap in the boardroom, under the table, and instead of calling me when the testing was done, one of the guys brought up a can of compressed air and gale-forced the top of my head until I woke up. I think he was just sore that I kicked his golf ball while we were putting around the office earlier in the night as we waited for a copy between servers to complete.",
            "But does The Todd give out high fives?",
            "My old company had a few Todd’s , they got bought by a VC company who promptly fired all of us before finding out what anyone did.   Happily our competitors knew the value of those Todd’s.   We all got new jobs quickly, the old company is slowing burning to the ground.",
            "\"I had accomplish greatest goal\"\n\nIs it wrong that I heard this in a Russian accent?",
            "Why do I feel like I worked for this store, back in my retail days? A lot of red, bullseye logo...",
            "What are the odds it was Steve who complained to HR that you were sleeping on the job?  Possibly to justify his attempts to throw you under the bus?",
            "I'd like to think I work with a Steve even though the situation is entirely different. Fast food service industry. We have a trademark which promises freshness. The only way the Steve I work with can serve customers fast enough is to very rarely fulfill that promise of freshness.\n\nSteve has been lashing out, which is weird because I, as his Superior, should not be spoken to the way that he did... But nepotism seems to be strong here because it earned him a promotion to make him my equal, and on top of that he has seniority over me.\n\nHe likes to call me and treat me as if I were useless, despite the fact that I constantly have to follow in his wake doing the second half of almost every task that he starts.",
            "I just hope they included more overtime for being forced to come in on a day off for another meeting.",
            "You weave a story like a master. I was feeling a bit sleep deprived by the end.",
            "I must know, did Steve report you for the 30 minute nap during 36 hours of non stop work?\n\nAlso, I'd like to know what Old Steve did during that bus throwing incident that shocked everyone.",
            "Steve deserves to be Karen's subordinate because of that shit.",
            "Steve 1.0 can fuck right off",
            "Fuck. I feel like I'm Todd AND OP.",
            "we used to have a Todd before she rage quit for being overworked.\n\nI was the sounding board for Todd, so I heard bits of of the old magic ways.  i know vlook and pivot tables. I became new Todd.  Todd agrees and shows me the ropes\n\nmy problem is the other depts that worked with Todd decided to cut the ropes on their side, one by one.  anything already established and written down can be addressed, but anything new now has to go through a review process, no side deals to keep the machine running  \n\ntry to do things through the proper channels.  \"todd didnt have to do that... you know what? dont worry about Todd's work, moving that to [not you]\". ropes taken from hands, replaced with bag. rage quit makes sense now. I am half a Todd. I am To",
            "How do I tell people that I aspire to be a Todd",
            "The ancient wisdom that boils up from the primordial ooze. \"A ten hour break is not eight hours sleep.\"",
            "Have not finished reading yet but this post has the best opening couple paragraphs I have read on reddit, ever.  Talent, right there - had to stop & say it.  Now to finish the read.\n\n&#x200B;\n\nEdit - strong closing sentence in the OP's edit as well.",
            "[deleted]",
            "This was super enjoyable to read! I’m happy to hear you didn’t get in any trouble lol good work!!",
            "Did you clock in for the meeting with HR? Got some more overtime.",
            "Amazing story and well written, Thanks for the read!",
            "That was an epic tale of Todd and his Acolytes!  All Hail Todd!",
            "I enjoyed reading this. Praise Todd.",
            "Hold up, those are beautiful.",
            "All hail New Steve",
            "We need a subreddit about Todd",
            "The story was written excellently! Was a very interesting read!",
            "Is Steve's wife's name Karen?",
            "This is some wonderful writing. An excellent read and am excellent MC. Thank you.",
            "I'm impressed -- my last overnight shift ran for 26 hours, and I was a babbling idiot at the end.",
            ">Todd spends his entire time just fixing the unfixable. He has been with the company since the dawn of time, knows the true names of several demons, and was in the room when the old magic was written. \n\nThat's because he was *supervising* the writing of the old magic.",
            "Every company needs an awesome Steve. \n\n/source: am a Steve \n\nExtra info: the bad Steves are the ‘ph’ version. Scum. It’s Stefan. Arseholes.",
            "I am the Todd at my store. (I work retail)\n\nI know how to properly do everything in the store, and how to properly get around whatever problems crop up. I'm the 3rd highest paid person in my store, below the store manager and the AGM. \n\nI have a new appreciation for my position, as it is, given the Store Manager and AGM ask me about procedure whenever it's something they don't know, or how to make computers or coding work they way that they need to. Like when there's a sale that is happening but the computers/registers are acting up, and aren't giving the sale.\n\nI'm the one who fixes things.\n\nI'm also starting to think I should be paid way more for what I do.",
            "And triple overtime at your increased rate. Well done,  you hard working SOB!",
            "Fellow POS POS here. The part of this post before the malicious compliance got my eye twitching. The rest seemed like the usual bullshit for these projects if you know what I mean. Great job seeing it through.",
            "I have been the Todd everywhere I've worked. It must be my destiny. Especially because *my name is actually Todd*.",
            "How did HR react to you having work 35 hours? I'd expect there'd be some OHS laws being broken for having an employee work that long.",
            "I just realized I’m a Todd. Damn it. No wonder my hair is turning grey.",
            "Fuck, I'm Todd. I did not sign up for this.",
            "Our Todd was named Kenny and I once drew the ire of most of our maintenance department for suggesting they take away all their tools and just issue them all a little card with Kenny's phone number on it.",
            "Your job sounds like ass and you should get out ASAP.",
            "Theres a lot of fun reading in the comments here as usual. I’m was Todd in a 24/7/365 industry that pretty much everyone deals with on a daily basis.  Had a boss for over a decade who wouldn’t give me time off unless I took it to the corporate level. Reason was I was the guy who got the “oh fsck” bail everyone else out when they ran out of ideas calls at all hours from several time zones. Oh yeah, that was in addition to my normal job.  Cost me a marriage or three. Glad that’s over and done with now.  Never was paid any OT because labor laws suck where I live. Now I consult and charge em by the hour or day to answer the phone or go on site somewhere.  Seriously, F companies that take advantage of their Todds like I’m sure some of you readers have had done to you.",
            "I know several Todds at my company. Truly indispensable. And then there are the people who THINK they are Todd and will spend all day talking about how much they've personally sacrificed and their depth of knowledge and no self awareness BLAH BLAH BLAH.",
            "I've been both a department Todd and a company Todd. In two seperate industries. It is easy to acquire the knowledge and know how required.",
            "Freaking Steve. Also congrats on your passing your probationary period! 😊",
            "My Todd is Melissa. She scares me. She created many of the processes that we use every day, which after the company growing a lot over the past few years need to be updated badly. We’re all to afraid to mention that because she created the processes and as previously mentioned, she is scary.",
            "What an amazing story. And you’re right about Todd - I even got lucky in that our guy was actually named Todd. That dude was our hero when he worked his black magic. I don’t miss that company, but I sure do miss him sometimes.",
            "Not getting a break over a 12 hour shift is illegal.",
            "Guess i am Todd. (Toddette?)\n\nAt the moment i am recovering from a surgery and everything is falling apart at the computer store i work.\nI am always the problem solver. I also like to give it 120% because i really like what i do.",
            "My boss is definitely the Todd in my company. Her job has a pretty quick turn-over rate - three year contracts, with very few renewed - but my boss has been here for 8 and is easily the one who knows the most. She WROTE the old magic, and if anyone ever messes with her she threatens to remove said old magic from the shared server. So lucky to have her.",
            "So what is the story behind Steve throwing someone under the bus with an enormous use of force?",
            "Real nitpick, haven't even finished reading yet,but I think you meant \"worth the extra dinero\" and not \"Denaro,\" as dinero means money in Spanish. I think you just spelled it like an American mispronounces it.",
            "I’ve read only the first three paragraphs and I’m loving this story.",
            "That's funny cause I've just resigned a job due to being thrown under the bus by a Steve. When I called him on it he lost his shit and spent a week bullying me. I have sent a massive complaint to HR about the bullying (I've seen him bully at least 2 other people in the past year) and about my manager not giving me the time of the day when I tried to talk about it. This manager happened to also shield another old staff member from repercussions of bullying their support staff.",
            "Luck is when opportunity meets preparation my friend.  Really well executed and highly impressive drive.  Wishin you much continued success bro=)",
            "A beautiful story.",
            "Sounds like OP was the real Todd all along.",
            "What a good read. You killed it OP.",
            "Honestly man, I was waiting for the penny to drop and you ending up getting fired or something... so glad the outcome was a win 👍",
            "Praise Todd, from whom all blessings flow",
            "I think I'm the Todd of my company.  We do have a guy named Todd, but he only knows what he is told to do.",
            "I thought I was on /r/talesfromtechsupport for a second there...:D",
            "Good riddance to old Steve!",
            "I love how you soldiered through the 2 days of strife that you KNEW were coming AND did it following procedure.  This is how future TODDs are created!",
            "i feel like my dad is the todd of his workplace, since he always is fixing someone’s mistakes",
            "Hooray new Steve.",
            "This makes me feel good to be a Todd :). At my old job at big brokerage place that rhymes with pells sargo, I was the same Todd. Always helping people with policies and processing."
        ]
    },
    {
        "post_id": "7c7mn9",
        "author": "Kushlord666",
        "title": "\"Go ahead call my parents\" \"Alright then if you insist\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7c7mn9/go_ahead_call_my_parents_alright_then_if_you/",
        "score": 24696,
        "num_comments": 706,
        "created_utc": 1510394133.0,
        "selftext": "The Background: This happened a few hours ago. I work at a large chain of pizza restaurants. Let's call it Pominos Dizza. Like most places, we get a few prank calls a week from pre teens. Usually it doesn't bother me and I'll go along with it because it gives me something to do when it's slow. But being a Friday night, we were busy and I wasn't having it. Me will be me, and K will be kid.\n\nThe events:\n\nMe: Hi thanks for calling Pominos Dizza, how can I help you tonight?\n\nK: *trying but not succeeding in holding in his laughter* Hey is Mr Wall there?\n\nMe: Um no sir there isn't one that work here.\n\nK: What about Mrs. Wall?\n\nMe: Nope none of those either\n\nK: Then how is your building standing up?!\n\nK: *laughter from him and background*\n\nThis went on a couple more times with classics such as \"can I place an order to your sisters house?\" And the CLASSIC \"is your refrigerator running? Then you better go get it!!!\"\n\nFinally I had had enough. I let the kids know I was done playing games.\n\nMe: alright look it says here that your dad's name is *dads name* (we keep names and addresses of past customers and their orders in the computer for future orders just to speed up the process) If you don't stop this I'll give him a call and let him know what's been going on.\n\nUsually this would stop the kids. I knew it did back in my earlier days of being a dumb kid. But some people just can't be bothered and have to push the envelope a bit too far.\n\nK: I know you won't. Go ahead and call him.\n\nOh boy he didn't have to ask me twice. I hang up the phone and get back to work for a little bit, knowing that the kid will be camped at the phone to answer it for the next 15 minutes or so.\n\nThe compliance: I get back to work, free of prank calls from the kid. I should of left it there, having solved the problem, but hey the customer is always right and at Pominos Dizza we always give the customer what they want.\n\nAfter the supper rush is done, around 45 minutes to an hour later I fulfill the request. I'm still me, D is dad.\n\nMe: Hello this is u/kushlord666 from pominos, how are you doing tonight.\n\nD: not too bad, what's the reason for the call?\n\nMe: unfortunately, we've been getting a number of calls from this number. We're really busy and its pushing customers away because of the wait times. Can you please have a talk with who I assume is your son and ask him to knock it off?\n\nD: Oh goodness I'm so sorry I'll have a chat with him and his buddies.\n\nMe: Thank you so much and thanks for choosing pominos!\n\nAt this point I think the story is done. Kid will get a talking to, won't do it again and that'll be the end of it. Boy was I mistaken.\n\nAround 30 minutes later a man and a chubby kid around 12 years old come into the store. I don't think much of it, thinking they're just getting a few slices for a snack. They come up to the counter and ask for u/kushlord666. \n\nMe: Yes I'm u/kushlord666\n\nD: I think my son has something to say to you.\n\nThe kid is visibly nervous. He keeps looking around the store, won't look me in the eye.\n\nK: I'm very sorry for calling you, I know you're busy and it won't happen again.\n\nThen to further the awkward suffering of the kid who I kind of feel bad for at this point, the dad places an order for carry out, and sits in our small eatery section where the kid has to try and avoid eye contact with me for the next 20 minutes. Left me a good tip too.\n\nAt pominos dizza, the customer always gets what they want.\n\nTl;Dr: Kid prank calls my store while I'm busy, dares me to call his parents. I give him what he wants. Gets forced by angry father to come in and apologize and brood in awkward suffering as I make them their pizza, while I got the last laugh and a 50% tip.\n \n",
        "permalink": "/r/MaliciousCompliance/comments/7c7mn9/go_ahead_call_my_parents_alright_then_if_you/",
        "comments": [
            "Respect for the dad for making things right with you and teaching his son that there is someone on the other end of the phone who deserves respect.",
            "In my head I'm imagining you and the dad actually saying kushlord666 instead of your real name ",
            "Wait he Made a prank call and got pizza! Kid probably doesn’t realize it, but he had a win win situation. ",
            "You handled it well. All kids go through shenanigans - it takes a village to raise a child and you were part of the village. Good on everyone!",
            "Dad sounds like a stand up guy teaching his kid some morals",
            "It sounds like you got the tip, but the kid got the shaft.",
            "You cold called a pizza sale for pominos......nice.",
            "Someone still has a landline? Good on his father for showing the little brat that there are consequences to their actions.",
            "[deleted]",
            "Lots of people saying it in the comments but I loved how the dad approached things. Taught him a lot more than taking away the phone or xbox for a week or simply just yelling at him WOULD HAVE (hehe shoutout all the people commenting \"should have\").",
            "The punishment perfectly fits the crime, too\n\nNot unfairly or severely humiliating - all embarrassment came from himself because he’s physically seeing the consequences of his own actions -, but a powerful message/memory and a life lesson\n\nI’m willing to bet he won’t ever be doing this again ",
            ">Pominos Dizza",
            "That father is a fucking legend.  More people need to be realistic with their kids.",
            "As a father myself, I admire that level of dadding. It would have been so easy to just lecture the kid and leave it at that. But to bring him in for an apology (which, by the way, takes dad away from whatever else he would rather be doing) is what hammers home the fact that there are consequences in life.",
            "I have done this, exactly *once*, for each of my kids. Oh, you want to break shit at the store? Get out your wallet. You like acting like an idiot at the grocery? Good, now you can look like one without opening up your mouth (have them take their shirt off, turn it inside out and backwards and leave it like that till we get home)",
            "I always just say, I'm sorry Ma'm, I can barely hear you, could you speak up please. After saying that a few times the kid always yells \" I'm not a girl! I'm a boy!\" Hasn't failed me yet. And you can hear their friends laughing at them. Stupid fucking amateurs! I was prank calling people before their dads even knew how to make a baby, little dumb mother fuckers.   \n  \nAlso if a customer is screaming at you, just wait til they are done and say \" I'm so sorry, I think my line is messing up, I can barely hear you.\" They also get much quieter and say something to the effect \"are you fucking serious?\" To which I say, \"Thanks, I can hear you perfectly now, how can I help you?\" Then they start speaking in a normal volume again. They might stray off again, you just rinse and repeat.   Even if you're on a recorded phone call, you've done nothing wrong and you were polite about everything and no one can prove that you could hear them. You win every time.",
            ">I should of left it there\n\n#Repeat after me:\n# SHOULD'VE = SHOULD. HAVE.\n\n#->SHOULD\n\n#->HAVE\n\nWhomst do you think you are??",
            "I'm really wishing you referred to yourself as \"Kush Lord\"",
            "Playing the parent card is great. They never mess with you again. I had a kid spray whipped cream on the window at work with some of his friends. His mom is a regular there so I let her know the next time I saw her and she said she'd take care of it. I went from seeing the kid every day there to not seeing him for over a month.",
            "Nice to know there are still PARENTS out there who discipline their kids...more often you hear the parent say 'Not MY little jonny...He'd NEVER do a thing like that...right jonny'? While jonny snickers...",
            "You should crosspost it to r/talesfromthepizzaguy",
            "Haha I really enjoyed reading through this",
            "They usually call us from hotels and just yell fuck you at us and hang up. The hotels don't like us telling them to figure out who it was and get them to stop or we will stop delivering there for the weekend. \n\nAlso if we tell a kid to stop and they don't we just label them as such and don't take orders from them anymore. ",
            "I worked nights at hotels for a few years and got some prank calls...kids are terrible at it these days. We used to call hooked on phonics and pretend to be abused children that just wanted to learn to read...haha...good times. /children are terrible",
            "\"I'm still me\" ",
            "Good on the Dad for actually disciplining his child. And good on you for handling everything the way you did. And good on pomino’s for those 🔥 large 3 topping carry-outs for $7.99. Great story all around.",
            "The best of this story was imagining the dad actually saying Kush Lord 666. It got a giggle out of me",
            ">K walks up to the counter and asks for /u/kushlord666\nim sure that's exactly what he said lolol",
            "[removed]",
            "Pominos Dizza: Annoyed the Void!",
            "That’s superb parenting ",
            "Good for that dad.",
            "Sounds like a good dad. That kid will be alright. ",
            "TBH That was a good move the dad did, making his son apologize face to face with you, it'll make him think twice before doing it again rather than suffer no consequences and just do it again.",
            "Now that’s good parenting.",
            "That kid has a good dad, and you helped him teach his son a lesson that will probably contribute to why he grows into an exceptionally good man in the future. Good on you. ♥️\n\nIn fact this is such a good story it kinda makes me want to order from Pominoes Dizza more often. 😉",
            ">yes, i'm kushlord666\n\nno need to flex on us\n",
            "*should have  (not should of)",
            "Thats a solid dad right there. \n",
            "That brought tears to my eyes. Good parenting right there. ",
            "What a good dad that's not something you normally hear about anymore, now it's just \"you assume my kid did that, how dare you\" ",
            "That child is lucky to have such a good Father. Constructive parenting, and considered OP. I'd buy him a beer.",
            "This sounds like an episode from Full House or something... so wholesome!",
            "What an awesome parent! Respect people’s time or I’ll take yours. ",
            "This was an elaborate hoax by this kid to get his dad to order pizza. ",
            "A wholesome revenge story? I'm confused.",
            "WHAT\n\nSome good parenting and a justice boner?! I can't handle it.\n\nGreat story!  :)",
            "Wow thats a tame response. I did a prank call EXACTLY ONCE as a kid and they called the police on me. I got a phone call from the police department not 5 minutes after the call telling me that i had to call back and apologize or they were gonna send a cruiser by to have a word with me. I was nine. ",
            "Fuck dude. This is amazing",
            "Kushlord666 is exactly the screen name I'd expect my local dominos guy to have. I was there last week and handed him a $20. He said it felt funny and held it up to the light. I said \"it's real\". Turns out it \"felt funny\" because he burnt his finger taking dabs earlier.",
            "See? That. *THAT* is some good parenting. Don't punish the kid with something unrelated. Make that kid see the outcome of his stupidness. Props to that dad for both teaching his kid a lesson and giving you a good tip for your suffering.",
            "I've only had one customer ever dare me,  and that was that I wouldn't call the cops on her after using her head to open the door. \n\nShe lost. ",
            "More parents like this, please.",
            "Many more pranksters would benefit from such a dynamic learning experience. \n\nI would have given him a broom to use while he was waiting. ",
            "That's some quality parenting right there.   ",
            "Updooted because kushlord666 is an unbelievably sexy username ",
            "Respect to the dad for teaching the kid some manners retrospectively",
            "I'm laughing thinking about you literally saying \"Hello, this is Kushlord666 from Dominos\"",
            "The real story here is kids don't know how *67 works anymore.",
            "People don't withold their number when they make prank calls?  I'd be signing their numbers up to every bulk spam list going.",
            "This should give /r/talesfromretail at least some succour, if not a rush or even a boner!",
            "I was really hoping the Dad would say something like,   “I am shocked and appalled. It’s time we had a father son talk, but Seymour told me he would be hanging out in your store. Could you ask over your loudspeaker for a Seymour Butts?”",
            "Having been a 12 year old who frequently did dumb shit that needed to be publicly apologized for, this hurt my heart while I giggled my ass off.",
            "Dominoes sells by the slice now?",
            "Once when I was closing at Mcdonalds this nasty dude came through the drive thru and long story short we made him call my friend \"Daddy\" throughout his order if he wanted food. I fucking miss working there",
            ">Around 30 minutes later a man and a chubby kid around 12 years old come into the store. I don't think much of it, thinking they're just getting a few slices for a snack.\n\nWoah where are you where you can just snag a couple slices out of a dominos?",
            "Yeah, my boss usually yells, \"Wu Tang Clan ain't nothing to fuck with!\"",
            "Why would you fuck with the people who make your pizza? That's just dumb.",
            "jeez waiting them out...harsh",
            "Thats a good dad right there. ",
            "Now that's fucking parenting good on that dad.",
            "Should have*\nIt’s not that hard.\nFunny story though!",
            "Great parenting, kudos to the dad.",
            "Should of? ",
            "> I get back to work, free of prank calls from the kid. I should of left it there\n\nNah, if you had, the kid would have done it again when he got bored.",
            "This was all a ploy by the dad to be able to get away from mom and go get some pizza.  ",
            "That is good parenting. Really nice of the Dad too.",
            "Kid learned a valuable lesson, dad got a dizza, you got a nice tip. Win-win-win",
            "Thats good parenting ",
            "Is your refrigerator running? Who thinks that's funny? I think at 12 what would be a funny prank call is just tell fuck you and hang up, now that shit was classic.",
            "Pomino's Dizza *upvote*",
            "So you're saying, kid pranked you, and got rewarded with pizza? Like I've always said, \"If it's worth an ass whoopin', do it.\"",
            "That dad ate the whole pizza in front of his son.",
            "I like your user name, lets hang out i have some Hizza Put left",
            "Prank calls were so much easier before Caller ID.",
            "I'd like to order a boneless pizza please",
            "When I worked at a supermarket a mother brought her absolutely distraught 3 or 4 year old son back in after they did their shopping because the little guy had stolen a 45c lollipop from the stand near the checkouts. She was forcing him to apologise to me and he was so upset he could barely speak and every hole in his face was leaking. I felt so sorry for the lad. \n\nBut I mean it was fair enough. Need to stop that shit while they’re young. ",
            "http://i0.kym-cdn.com/photos/images/original/001/312/079/177.jpg_large",
            "Delicious on multiple levels",
            "As much of a little shit that kid was on the phone, this probably taught him a lesson he won't forget, and he'll be better for it. Sounds like he has a decent parent too.",
            "I guess good parenting works up an appetite. ",
            "just to be clear, you worked at pizza hut, right",
            "Oh behalf of pizza workers past and present, I salute you!",
            "Should have not should of*",
            "Good dad teaching a good lesson. Kudos to all parties involved for a successful teachable moment with no butthurtness. ",
            "As an employee at a Hizza Put, these kind of customer interactions are the things that keep me going back in to work. It really sucks dealing with shitty customers, but sometimes the cool customers make up for it.",
            "That's what I would do as a dad - have my little shit apologize and learn a lesson, give the place some business and leave a good tip.  Extra props if you make the little shit pay for the pizza out of his own pocket.  \n\n",
            "i'm sorry but using your username in the story made it all the more hilarious for me, imagining a father asking for a kush lord at a dizza joint",
            "Man.  I wish someone would prank me with the wall one.    That’s actually my name, I could say yes 🤣🤣",
            "*Should have left it there\n\n######This action was *not* preformed automatically, and is clearly satire. But as a Euro-Commie you probably can't understand that since they removed your funnybone at birth and replaced it with a manifesto.",
            "Hello this is Kushlord666. ",
            ">I *should of* left it there\n\n*twitch*",
            "Absolutely hilarious story but if the father was a grade A asshat couldn't he get you in a lot of trouble? Especially if you're a chain? I guess if you're franchised, no one gives a shit unless the owner sucks. ",
            "[deleted]",
            ">\tshould of left it at that\n\nShould *have* left it at that.\n\nOtherwise 10/10 malicious compliance -- would read again.",
            "An engaging story, heavily damaged by two measley letters. I'm happily reading along a well written interesting story, thinking \"Oh boy, here comes the good part,\" when...\n\n> I should of left it there\n\n**BANG** (Needle scratch)...  For the love of Pete. \n\nIt's \"should've,\" or \"should *have*,\" but *absolutely not* \"should **of**.\"",
            "You are a god",
            "/r/ProRevenge",
            "Once they came in and apologized I would have given them something free, like garlic knots or something, as a good faith gesture...",
            "Dude.... Feeling bad for that kid is what is wrong with today's youth. It's not like his father beat the shit out of him. The kid just had to apologize for being a little shit... Seriously, Dad still bought him pizza. \n\nHonestly, that's good parenting by the father. DO NOT feel bad for that kid. 10-15 years ago it would have been a lot worse. ",
            "Props to the dad for what he did. ",
            "> supper\n\nMinnesota confirmed",
            "You should post this to r/pettyrevenge too. I love it. ",
            "Hehe kushlord love it ",
            "I did it 'backwards' as a young adult.\n\nLittle pizza joint where I grew up was right across the street from the primary CO building for the Baby Bell.  It was also home to a lot of bars.  This was just after cellphones became affordable, and I had one.\n\nWe'd sit in the pizza joint, and call the bank of payphones across the street whenever a drunk walked by.  Asking them stupid questions, and getting a little show.\n\nI remember the manager or owner or whatever saw what we were doing one time, and found it pretty funny, because we weren't being loud, and they disliked the drunks too (attempts to run without paying, piss all over the bathrooms, etc).",
            "Now that's a dad that knows how to properly punish their kid. With SHAME!",
            "Good patenting ",
            "Kid might have been uncomfortable but he got pizza (I assume)",
            "Good ole Pominos Dizza ",
            "It's the small things in this story\n\n>Pominos Dizza\n\n>I'm still me, D is dad",
            "Props to you for calling the bluff, and super props to the dad which will teach that kid a valuable lesson he'll carry into adulthood. :-)\n\nI'm not sure how this is malicious compliance though.",
            "This isnt malicious compliance... dares do not count",
            "Excuse me, now it's just called \"Pominos\".",
            "The dad handled that absolutely perfectly. Successfully taught his son a lesson, made up for his son's actions in the best way possible, and got himself dinner to boot! ",
            "Damn, good guy dad over there. :-D",
            "What kind of pizza you got at pominos pizza",
            "That's great!\n\nI also once worked for Pominoes Dizza. Had a guy call and threaten to rob us with a bomb. Had to explain that he would have to choose between blowing us up and robbing us because I didn't think he could do both.\n\nHe didn't do either.",
            "That's good parenting. ",
            "> orders carry out\n\nAt that point I just assume the dad told his kid that the kid's allowance was going towards dinner that night.",
            "That's a good dad.",
            "What a great Father this little Dick has!",
            "This makes me incredibly happy. As a former manager of a smaller chain of pizza shops in my former state I had to deal with prank calls a lot too. I can’t believe that kid didn’t know how to make his number private though. Thats day 1 shit.",
            "> Then to further the awkward suffering of the kid who I kind of feel bad for at this point, the dad places an order for carry out, and sits in our small eatery section where the kid has to try and avoid eye contact with me for the next 20 minutes.\n\nDefinitely the best part.",
            "Look, I was built in the 80s, alright? This is exactly the kind of parenting that I used to get. It's basically what kept me on the straight-and-narrow.         \nI hear too many stories today about parents who defend their kid to the bone. Teaching positions have become hell because the parents windmill all around their kid, \"protecting\" them from any \"harm\" in the form of criticism.     \nI want more of this kind of parents ( from OP's story) - you're doing it right, teaching your kid personal responsibility.",
            "Or that kid just got his ass fucking beat tonight.",
            "Man, that brings back memories...  When I was maybe 8 or 10 years old, I pocketed some sweets from a sweets store while walking past it with my mom. When we arrived at home my mom discovered the candies and made me return to the shop, hand then back and apologize.\nThat feeling of shame stuck with me for many years...",
            "So are you working at Pizza Hut?",
            "This made me really want some Pominoes Dizza",
            "I wish I had a dad like that.",
            "TIL people still call the pominos",
            "You need to get that dad a free pizza.",
            "that shit got better with every beautiful letter  \nBravo!",
            "Well shit he won't be doing that again",
            "dumbass didnt use *67",
            "You had me at Pominos Dizza",
            "Great parenting ",
            "/r/TalesFromThePizzaGuy might love this",
            "I work for the same place and have a ton of stories over the years. I had a few similar to this and one pretty extreme result of a prank call. Gotta love the pizza business.",
            "Amateur. At least prank places that don't keep your address on file. Sounds like the kid won't be prank calling for awhile. ",
            "So the kid didn't even have the sense to call from his own phone? Or at least use a code to make the number he was calling from blocked from caller ID?\n\nWow. Got what he deserved. And just what he asked for.",
            "i work at a pizzeria myself and i usually work the AM cashier shift, i fucking love prank calls because otherwise the job is a total bore. ",
            "You should call the dad again and say the kid is still doing it, that will be the last laugh! ",
            "Should've*",
            "Fathering done right.",
            "I've worked at a place suspiciously similar, and just ordered from tonight.",
            "Kid still came out a winner he got to build character in learning humility and pizza ",
            "So you managed to get a sale out of a series of prank calls?  Nice work.",
            "My last year's English teacher was called Ms. Wall.",
            "People think \"no spanking\" parenting is for wussy PC liberals or something, but this sort of punishment is sooo much more effective and sensible. ",
            "Props to the father for bringing his son and forcing him to apologize and acknowledge that it was a real dick move.  Lesson taught and learned. ",
            "Solid dad right there.",
            "did this really happen? those prank calls seem way too weak to be real",
            "Domino's sells slices??? Liar!! ",
            "I don't want kids but now I want kids just to be like this dad.\n\nAwesome.",
            "That fucking dad is the best person ever\n\n50% tip, JFC"
        ]
    }
]