[
    {
        "post_id": "nm0omr",
        "author": "WolfPetter42",
        "title": "Leave If I don't Like It? Fine I'll Leave.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nm0omr/leave_if_i_dont_like_it_fine_ill_leave/",
        "score": 22464,
        "num_comments": 1416,
        "created_utc": 1622094457.0,
        "selftext": "This story was posted in Child-free, and I was told you people here may like it, this isn't exactly the same as my other post but it'll be close enough, I don't wanna just copy n paste. \n\n&#x200B;\n\nLast year I went to my Uncles house for Thanksgiving, I cooked the turkey the day before and put it into the fridge before going to sleep on their couch. I woke up to their young kid screaming in my face to make him chicken nuggets at 4 am in the morning. They never make him behave, nor punish him for anything he does, so I ignored him and went back to sleep after he decided to go scream at his parents he wanted nuggets. Cut to 9 am, everyone is getting things ready for the day, cooking is beginning for the dishes that need a few hours in the oven. They didn't buy a turkey, they asked me to buy one, I decided to cook it the day before and thought we could toss it into the oven an hour before the time to eat arrived so it would be warm, however their kid started randomly coming up behind me and screaming as loudly as he could into my ear. I asked them to make him stop, seeing as I prefer my hearing intact and don't like anyone just screaming in my ear for no good reason. \n\n&#x200B;\n\nI was told by my Uncle, word for word 'It's our house, if you don't like it, leave.' \n\nThey where shocked when I actually did just that, I opened the fridge, took my turkey out, got into my car and drove away. Not one minute after leaving I was getting spammed by calls and texts asking, begging, or threatening me to come back with the only turkey for thanksgiving. When I got home, I called him, and told him 'You told me to leave if I didn't like it, so I left, play stupid games, win stupid prizes' then hung up, and blocked his number. I have many stories about them refusing to control their kids, then them having to deal with the consequences that result in this.",
        "permalink": "/r/MaliciousCompliance/comments/nm0omr/leave_if_i_dont_like_it_fine_ill_leave/",
        "comments": [
            "You quit them cold turkey",
            "[deleted]",
            "I have a relative by marriage that was never taught any sort of respect or self-control in the slightest.  Now he's a preteen and he is getting bullied and absolutely annihilated by other students for his disruptive annoying behavior.  Of course his parents are blaming the school but I suggested at the last large get together that I had brought this up maybe six or seven years ago and they got mad at me.  I think my exact words were if you don't teach him some respect some big kid will.  Not advocating bullying it's just there's a certain range of acceptable behavior and if you fall outside of it most any given group of people will put your ass in check.  And if you have not had your ass put in check by your parents at some point it's going to come as a very big surprise and a difficult lesson.",
            "To be perfectly honest, I would have been out of there, too. \n\nGetting woken up at 4am by a screaming child old enough to demand chicken nuggets and entitled enough to expect you to make them for him at ridiculous o’clock is bad enough. \n\nBut parents so utterly spineless that they enable their bratling when it’s repeatedly screaming at a guest is beyond belief. \n\nI wouldn’t go back if I were you.",
            "Sounds like a condom advert.",
            "Did you eat the turkey anyway?\nHow was it?",
            "I cannot understand parents who don't teach and enforce basic respect.\nAt my house, you might have my kids excited to tell you about a story or wanting to show you something but they would never be rude about or scream in your face.\nMy job as a parent is to raise individuals with the best chance of thriving as adults, not to let them think the world revolves around them.",
            "What did you uncle expect? He threw down and yo took it up. You left with the bird. He should have thought about that before he opened his yap.\n\nNow as far as the kid goes, I have a story of a family gathering - cousins from out of town, etc, on a big cook out. And a total brat who ran around kicking people, and his parents let him. Until brat tried to kick this one woman. Who happened be a Judo black belt. She just pivoted out of the way and he misses. Stupid kid tries to kick her again and again she dodges, and this time the kid fall one his butt, hard. Now the kid is mad and he tries it again. This time, the woman reaches under his kick and flips him onto his back and she tells him \"Don't do that again.\" Yes, he tries it again but this time she grabs him, flips him onto his stomach on the ground and she put her foot on his back so he can't get up. NOW the parents came over and the woman told them what he did. The kid is demanding him mommy beat up the woman. Daddy says,\"time to teach him a  lesson. Have at, with our permission.\" So for the next 10 minutes or so the kid kept attacking the woman, kept getting flipped, held down, etc, until the kid tired out and quit. Woman tells him, \"I went easy on you. I could have broken your arm at any time, so the next time you go to hurt somebody, they may not be so easy on you.\" At least the kid quit doing it at the gathering.",
            "I can barely tolerate my 18yr old cat screaming in my face to get up and give him wet food at 4am. I'm not tolerating it for some kid. Nice, short and sweet MC.",
            "I was a nanny to many children over many years, and the one question I always got from parents is \"How did you do it? I see such a difference, but how?\"\n\nI treat children pretty much like I treat adults. They aren't dumb, and I won't patronise them. That also means facing adult consequences (obviously not exactly, but the concept of it). I won't raise my voice, hit, or force them to do anything but they will have exactly none of what they want and consequences brought on by themselves which they will then deal with. Just like an adult. I also don't really use baby voice. The difference was night and day, and I maintain contact with all my kids to this day.\n\nAll this to say that \"Kids will be kids\" is a bullshit excuse. They will be kids, yes, but that just means doing silly things or making kid mistakes, like anyone else. It's not a pass to be insufferable, and certainly not a pass to be lazy as the guiding adult in their lives.",
            "\"Know what? Chicken Nuggets sound like a great idea. If you didn't scream at me, maybe you would've gotten some as well.\"",
            "I would like to hear more stories. That was quite a satisfying story. I'm glad you didn't put up with that nonsense for long!",
            "I’m so sorry for you. Your uncle is an awful host and a terrible parent. You’re better off without him! \n\nWe never allowed our child to behave that way by immediately discouraging bad behaviour and teaching alternatives. Our Child-free friends loved her (pre-pandemic) as I made sure they would only have to deal with the cute and never the ugly.",
            "[removed]",
            "That sounds like the parents do a stupid mix of \"parenting\": on one side, let the kid \"roam free\" and make their own experiences but on the other hand protecting them from any repercussions.\n\nI can accept if parents are like \"my child is a human being so I don't get involved, please don't address me but the child directly\". Ok no problem. But if those same parents are also \"don't treat my child like that\" ... well ... then it's a problem. If a child acts shitty towards me, it should learn that this will come with an appropriate reaction. If they always get shielded by their parents they of course learn that they can do all the shit they want and will always be fine in the end.\n\nI had a neighbor who treated their kid that way. However that stopped when the kid went to school. Because there were no parents there. And suddenly they had to get by with other (more dominant) kids and with teachers who didn't give a shit.",
            "Read allthe commentary and relized the aunt and uncle are raising their own murderer.",
            "Chicken nugget stuffed turkey, the classy way to incorporate chicken nuggets into thanksgiving dinner.",
            "How old is the child? I remember a couple of times when I was sufficiently insolent to adult guests, I got slapped and my parents were like \"Well you asked for it\". I guess these days you'd be jailed and sued though so probably not worth it.",
            "The kid you're describing gives me similar vibes to this kid\n\nhttps://www.reddit.com/r/WatchPeopleDieInside/comments/g7ixbp/nice\\_try\\_kiddo/",
            "As a parent, I'm so glad you left. That's ridiculous that they were letting their kids behave like that and potentially damaging your hearing. (I have sensitive ears so I get it.) If someone would have given me that ultimatum with their kids being absolute brats, i'd have taken it too! Good on ya!",
            "My step-grandson came up behind me and screamed in my ear when he was 5 or 6. I reflexively backhanded him and he never did it again. \n\nIt really, truly was a simple reaction as it happened so fast.  The look of utter shock as he found himself on the floor would have been satisfying were it not for the pain and ringing in my ear.   come to find out he had been doing this to his mother and she \"had been asking him nicely to stop\".  He continued to do it to her... but not me.",
            "[removed]",
            "This is just beautiful",
            "Narcissists spawning narcissists. My oldest sister is a spawned narcissist. She made my life a living hell, as our narcissist mother and her tagged teamed hate onto the family scapegoat, me. Grrrr",
            "Honestly I respect the restraint you showed at 4:00 am. I'm certainly not coherent enough at 4:00 am to think \"it's not my child and I won't have any right to discipline them\".\n\nBut it would learn not to wake someone up for nonsense.",
            "Reason number 117 for a “license to have a child” to be a thing.",
            "that kid is gonna grow up to be a tendies guy",
            "When I coached little league, during the first team meeting, I would explain to the parents that if they have a problem with their child being told that they need to ask for a different team.",
            "Love, love, love your story!  My comment isn't about the kid---life will be tough for him. But, I love that you had the courage/audacity to take your turkey and run!  I'm pretty old and was raised with the idea that anyone older than I knew better and \"deserved\" utmost respect.  I can't tell you how much that philosophy brought pain to me in life.  I still struggle with being the \"good girl\" when others are acting like arseholes.  Good on you!",
            "I love the story. Short, to the point and perfect MC. We need more stories like this!",
            "Thanksgiving well spent, kudos.",
            "Was your tummy ache from too much turkey offset by your glow of justice served?\n\nThat was pro!",
            "Brilliant.   I can't imagine the chaos at their house.  Please do tell other stories too.",
            "Good for you. \n\nMy father disowned me for disagreeing with religious beliefs, so I was like, OK peace out! Sucks but I’d rather be without a family than inside one that treats me like shit for being who I am.",
            "Anyone waking me up at 4 a.m. by screaming in my ear should not be surprised if they get struck.",
            "You rock! More stories, please...😄",
            "Jesus that's horrible. Mine can get bossy sometimes (rude way), but that's toddlers. You still gotta like, enforce appropriate behavior. Screaming about nuggets at 4am?! Hard no.\n\nMine has asked for nuggets at like 930am on weekends and because of her food struggles we just kinda go with it. But she's gotta ask politely! None of this screaming for things shit, we don't play that game.",
            "This is the right way to deal with the situation. Hopefully they'll learn something from this.  People nowadays really think that just because people are family they can really treat them like shit.  You're not obligated to let anyone treat you like shit just because they're blood. Fuck all that you enjoy that turkey along with a side of self respect.",
            "Feral children are the worst.",
            "Not to worry. The prison system will discipline him later. \n\nYour response was epic.",
            "For next time I would bring a airhorn to a gathering so everytime the brat is acting like that you can just blow it.  If someone complains just state that if the brat continues screaming at you, then everyone will have to suffer.  I am sure people will get the idea.",
            "I have a kid and I would be mortified if he ever behaved in that way. Who on Earth refuses to discipline their unruly child?! That kind of shit is not on. Good on OP for taking the Uncle’s one good bit of advice and getting out of there.",
            "that kid will be a blast when he grows up.",
            "That wonderful and special child could be a star someday...in a birth control ad",
            "Win, win. Toasted turkey bacon sandwiches for a week.",
            "i almost expected you to cut pieces from the turkey, but leaving was even better",
            "You turkey!\n\nYou stole their turkey!\n\nCome back!\n\nlol",
            "Guess they will be eating chicken nuggets for Thanksgiving",
            "Good for you.  What did he think was going to happen?  I think it was very insulting to say that to you.",
            "Y'know what? Good for you. Your uncle shouldn't provide directions he doesn't want followed. He should be ✨proud✨.",
            "I’m mostly bothered by the idea of pre-cooking the thanksgiving turkey",
            "Yeah that shit ain't flying around me. I'd give the dad one warning that if he won't parent I will. Also I would've been posting pics of that turkey non stop and tagging them in it lol.",
            "Sounds like a 4chan kid",
            "Put the child in the oven",
            "That kid is 100% destined for prison",
            "I have a kid and I don’t blame you one bit. Would have done the same.",
            "If you wake me up at 4am, screaming in my ear, you will be face-punched. \n\nIt’s a reflex and I take no responsibility for it.",
            "Holy shit, this kid should be in a cage. I would have left too.",
            "Fan of chicken nuggets I am.  Herh herh herh.",
            "While in all honesty, I'd (still) be awake at 4AM, some crotch goblin, ankle biter, rug rat screaming at me for chicken nuggets would make me seriously reconsider my sleeping arrangements for a holiday. I'd left sleepovers at friends' houses that late over less as a teen (though scared the crap out of my mother when I unlocked the door and walked in).",
            "That was AWESOME!!!!!!!",
            "BRAVO 😂",
            "Its too bad spanking is out of fashion.  Sounds like this young whippersnapper was in desperate need of corrective action",
            "Spent the next three weeks eating turkey then. 😁",
            "*Fucked around and found out*",
            "This is so great. Imagine trying to find a turkey last min gah good luck! Lol. They really need to control their kid though.",
            "That’s awesome, you got moxy",
            "I am child free. But I love my nieces and nephews. I have enough contact with them where honestly I would have asked told them to stop screaming myself. Luckily my nieces and nephews usually like playing games with me, so if I want then to do something I can usually be like \"if you behave now we can go do _____ after dinner\" or something like that. \n\nBut yeah having a kid where the parents refuse to reign them in fan be very very frustrating. And it is really bad parenting, and is not good for the kids development into a full functional human being. I hand one nephew who was going down that path until their second kid came and then they got better with him. Which is funny because he actually listens well when you are firm with him. It just took his dad a few years to learn that. He isn't a bad kid he just for a while had parents that never stuck to their word about discipline. It's learned behavior.",
            "Yeah, that kid would get slapped real fast if he did something like that to me. My cousin's first born was left uncontrolled like that. They got upset with me when I disciplined him, saying dumb things like \"you can't talk to our child like that\". Eventually I told them \"if you don't raise your kid right, others will do it for you, and they won't be half as nice. It's not our job to teach your child right from wrong.\" \n\nThis resulted in me cutting myself off, and being cut off from them for 4 months. 4 quiet, blissful months. Eventually our relatives made us reconcile, but after a stern talking to from our grandma, it seems their approach to parenting has shifted a bit. The kid is better behaved now, and has stopped a lot of his bad habits. Took him two more years to stop pulling boogers out of his nose and hiding them on the backs of furniture, or walls, but he figured it out eventually. Eugh.",
            "Children with children. Gotta love it. Yeah I'd be staying away from that degenerate family as well.",
            "How old was the kid screaming about the nugs?  Just asking because I'm legit curious.",
            "...and THAT is how to handle STUPID like a boss!",
            "Please tell more of these stories",
            "We’d all love to hear the other stories you have!",
            "Guaranteed your the “bad guy” in their eyes. Good one yea",
            "I am a parent of 5. While you should expect some amount of noise and such (only 1 at home any more, but it could be chaos years ago) that kind of behavior is unacceptable to recur (you can't always prevent the first time - kids are inventive!).\n\nI can't stand ppl who never tell their kids 'no'. <shudder>",
            "U did the right thing. Feel no guilt",
            "This is an unusually short and exceedingly satisfying post. Thank you.",
            "You should call that kid \"Veruca\" every chance you get.",
            "Yeah we are going to need you to give more stories, saying you have them is a legal binding contract to give them",
            "Reading how people stand up for themselves makes me feel more confident somehow",
            "The play stupid games win stupid prizes got the thumbs up from me haha",
            "You want Karens?  Because this is how you get Karens.",
            "They're raising bombs with that parenting method. Literal loose cannons just waiting to be fired off. I feel sad for the kids because they can't foresee how damaging their parents' leniency is to them. When I was that age, I wasn't even allowed to stay up long enough to go to someone's room to scream. If I woke before my bedtime and made enough noise to be discovered, it was straight back to bed for me with extra time for screaming unnecessarily.",
            "You don't have to be child-free to not tolerate that behavior... That's crazy! Good for you for leaving!",
            "I pity that kid's poor teachers. Bad behavior from the kid, and it sounds like there isn't going to be any support from the parents.\n\nIt is me, btw. I am this kid's teacher. All teachers are.  Every year, we have this kid. Tricks for convincing parents that their kids are the problem, not the teacher, and what they, the parents, can do about it is an important section of the teacher play book.",
            "The real question is, did you eat the whole turkey?",
            "If someone has posted this already I apologise.\n\nRaise your kids, spoil your grandchildren.  Spoil your kids, raise your grandchildren.\n\nThe crap they are allowing will \"echo down the ages\".  (Thanks Maximus.)",
            "I am slowly reaching the conclusion that most people who have kids shouldn't have them.",
            "there will be a time he screams in someone's ear that doesn't give a shit and they'll just punch him in the face",
            "Your uncle is a slow learner, apparently. In your other story he says almost exactly the same thing - \"If you don't like it here, move out!\" So you did!\n\nAfter how you were treated then, and given how unpleasant that household and its occupants were, it was a gesture of heroic generosity for you to agree to Thanksgiving with them at all! I can see why they invited you, though - too lazy to cook (and too cheap to buy) their own turkey.",
            "Awesome! Best story I've read today! Good on standing up to the bad parents."
        ]
    },
    {
        "post_id": "15csr6p",
        "author": "Superb_Raccoon",
        "title": "Take my ID and tell me ask me \"What the fuck are you going to about it? OK...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15csr6p/take_my_id_and_tell_me_ask_me_what_the_fuck_are/",
        "score": 22422,
        "num_comments": 916,
        "created_utc": 1690638421.0,
        "selftext": "So when I was a wee Superb_Raccoon... but still Superb... I was in the Navy.\n\nRecently 21, we decided to go to a bar that had a decent local cover band. So we show up and I present my ID. Grant you, clean cut and close shaved I did not look 21... but my out of state ID was no good and all I had was my Military ID.\n\nDoorman decides he can fuck with me. \"This is fake. I am keeping it.\" My eyes bugged out. \"Dude, that is a Military ID. Give it back.\"\n \n\"Nope, mine now. $20 bucks or fuck off.\"\n\"I can't get back on base without it.\" I said.\n\n*\"Then you better cough up $20 or fuck off.\"*\n\nOh I see. This is a shakedown. Fuck off huh? **OK.** Cue malicious compliance. \n\nBuddy who drove and used State ID drove us back, we go into the Officer of the Day's office to report my lost/stolen ID.\nOOD is a crusty old bastard, but fair. Actually a Mustang, he takes orders from the President and God... and we are not sure of the President.  He might tell him to fuck off if it is a stupid idea. \n\nHe listens. My buddy backs my story. His eyes narrow in an evil, evil way.\n\n\"Chief! Can you come up here? I got a present for you.\" \n\nI started to shake a little, am I headed for a few days in the brig for losing my ID? Fuck.. there goes any chance of a bump to E4.\n\n\"Seaman Raccoon here says the doorman at Joe's took his ID and wants $20. Pull a driver and one of those Jarheads at the gate and go down their and sort it out.\"\n\nThe Chief looks at me like fresh meat. \"Come on you two, we are going for a ride.\"\n\nSo we all pile in the van with a couple of marines in BDU and sidearms. It is quiet on the way there, chief don't look too happy. \n\n\"Can't believe I gotta deal with this shit. Well, at least I don't have to sit at the desk all night.\"\n\nSo we roll up. Place is pretty packed. Doorman don't look so tough as the Chief stalks up to him like a storm cloud spitting lightning and two armed Marines flanking him. I am hanging back.\n\n\"RACCOON! This the guy with your ID?\" \n\n\"Yes Chief.\"\n\nChief gets up toe to toe with him. Chief is short and wide, but is built like a brick wall. Gym Muscle doorman takes a step back, but dude has nowhere to go in the the little entrance way.\n\n\"Give me his ID now, or I will start looking for it myself.\"\n\nID is produced. Handed to me. Doorman ignored. Chief pulls the door open looks at the room, motions for the marines to \"Make a hole to the bar, make it wide.\" \n\nThe do so, calmly shouting to move people out of the way as the music and talk dies down. Chief grabs a chair, stands on it, then uses his parade ground voice.\n\n\"All Active Duty Military.  This site is now on the Prohibited list. Pay your tab and get out.\"\n\nHe gets down, walks out with Marines tailing him... and half the bar follows them out. Very few are active duty this far from base, but many are Reserve or Retired. They don't like shit like this either.\n\nPlace went on the List and was still there when I transferred out 6m or so later.\n\nYep. I \"fucked off\"... Hard and Fast.",
        "permalink": "/r/MaliciousCompliance/comments/15csr6p/take_my_id_and_tell_me_ask_me_what_the_fuck_are/",
        "comments": [
            "Imagine losing half of your entire clientele, over a power-tripping muscle bro and $20\n\nKudos to your superiors for having your back. Great story",
            "I've heard similar stories from other veterans before and this is the worst thing that can happen to a business that depends on the military. You don't fuck with the active duty or veterans, they will boycott your business into the ground even if it's their favorite place in the world. We take care of those who take care of us.",
            "With an announcement like that you’d lose a lot of civilians too. If whatever’s going on in that bar gets the military to ban servicemembers from going there, I’m not sticking around either.",
            "What an incredible show of \"you're messing with the wrong guy here\" - I wonder how many $20 shakedowns he actually got away with. Probably no more after that, a place could go bankrupt on the prohibited list.",
            "That establishment may have been on their radar for some time. This may have been the motivation to deal with it. \n\nWhy? It's possible a few IDs had needed replacing and no-one had said why. Now that they had a specific culprit the stars aligned.\n\nAlso, Racoon you may have saved a lot of other sailors $20. This is a good lesson in speaking up.",
            "Marine here, my dick gets a little harder when places get put on the Off-Limits list.\n\nI personally know a man that was the reason why a certain Waffle House right outside Ft. Stewart was put on that list. \n\n Long story short, they served my friend undercooked pork and eggs and refused to correct it.  He happened to be a Public Health Officer or something of that nature and decided this place was a health hazard to the Soldiers.",
            "Many years ago when I was in the Army, I came back from Germany shortly after Desert Storm, and took leave in Connecticut before heading to Ft Polk, which was my next duty station. I was 95B, Military Police. I was 22 or 23 at the time and in shape.\n\nCalled up some friends, they wanted to go play pool in Springfield (Massachusetts).\n\nSince I had been out of the States for a bit I only had my military ID on me.\n\nThe bouncer said that the ID was bullshit, that he was going to have to confiscate it, then claiming I wasn't showing the drivers license because it showed my real age. I said give it back and we will go somewhere else... He started pushing us out, I reacted, he tried to throw a punch...\n\nWe were a few seconds from one or both of us having our asses kicked because there was no way in hell I was letting him take my ID when the owner came over shouting and asking what was going on. The bouncer tried to say I thought I was a badass and trying to start a fight with him and didn't mention the ID. \"I might get my ass kicked and end up in jail but I will get my ID back.\", he tried saying I was making up a story as my friends were shouting about the ID (they were regulars).\n\nWe finally got him to show the ID after some shoving and pushing and the owner shouting. The owner glanced at it, started shouting at the bouncer and waved us in. We never paid for a drink all night and I didn't see the bouncer the rest of the night either.\n\nI am not much of a bar person, so have only dealt with bouncers a few times in my life, and they were usually pricks.",
            "Also good for r/MilitiousCompliance",
            "Great story! On the opposite end, when I did my basic training there was a bunch of pizzerias in the city.\n\nWe started out trying a few different ones, and one of them loved service guys, a real great guy. First time we went in there and ordered pizza, like 5-6 guys, we just ordered the pizzas, but he grabbed a couple two liter cokes for us, on the house.\n\nSince that day every single one of our 160 man company only ordered from that spot, if you were on guard duty and called with delivery to the front gate and ordered 2+ pizzas there was a complementary 2 liter coke with the order.\n\nHe was a good guy! Great pizza, great service!\n\nAnd I know this has nothing to do with your story but I felt like sharing.",
            "We dealt with this crap at popular bars in San Diego back in the late 80’s and early 90’s.  Navy, 21, military ID…not good enough to get in.  Absolute BS, but yeah, word would get around and folks would avoid those places.  Fucking brilliant business plan to locate your business in an area teeming with young sailors and Marines and deny them entry.",
            "CACs are federal property. Good luck justifying stealing one.\n\nHave some gold. Great story.",
            "Back when Canada started making the $2 coin the mayor of Kingston (Ontario) got into a little tiff with the base about some minor shit and basically stated that the town doesn’t need the military.\n\nSo the Base Commander, just to prove a point, ordered that ALL military personnel at the base be paid in $2 bills only. So for a couple of months all of the base from Pte to Col were paid in $2 bills and the town was absolutely flooded with $2. The mayor apologized and the troops went back to being paid the usual route.\n\nA bunch of years later, there was a bar that the troops loved to frequent and some college kids came in and started causing shit with those high and tight types, instead of removing both groups, or even just the instigator, the manager kicked out all of the military types. So the BComd banned that bar. It shut down less than a year later.\n\nThere are so many stories like this where a town or business learns the hard way just how much of an impact 3000-8000 decently paid people have on the local economy.",
            "No one can pick on those Navy squids, but US! - The Marines",
            "Me, reading about trip back to the bar in the van: “Haha, bouncer’s ’bout to get his comeuppance at the hands of an angry military officer. Great ending!”\n\nMe, reading about what happened next after OP’s ID was returned…out loud, to no one in the room with me: “Oh, sh*t!” 😳\n\nMilitary doesn’t play!",
            "As far fetched as this story might sound to those who didn’t serve, I can tell you this is almost exactly how they would’ve handled it.  I’ve even watched a gunny call down to one of those shady car dealerships trying to pray on the young and dumb newbies and tell him “He’s bringing the car back and you’re giving him his money back or I’m coming down there myself to get it.”",
            "Had a similar situation in Gutersloh. One of the lads got coldcocked up by some Turkish guys in a bar called “The Temple” absolute shithole but one of the only places to go after 2am. \n\nMilitary police ask for CCTV footage and the bar owner refuses. Bar is place on the out of bounds list and the RMP stag on outside it to stop squaddies going in. \n\n2 months later the Bar relents die to a severe lack of customers and it turns out the perp was a mate of the owner.",
            "I fucking LOVE this story!\n\nFormer Army reserve here. The local town where we did our drills, fucked with us all the time. I was an MP and frequently had to go off base and \"sort shit out\". We once had to put a popular place on \"the list\" because of one bartender. It was awesome. They're closed now. \n\nThanks for sharing this.",
            "Verrrrryyy very nice.  I would assume the owner of the bar, took Mr. Muscle Doorman and gave him lessons in good manners.",
            "This is the kind of leader I can imagine men following without question into war.",
            "Right, any place put \"Off-limits\" is going to be in a world of hurt. Not just active duty, retired, reserves but their spouses as well cannot go to those places.",
            "We went to see our son graduate navy boot camp a couple years ago, and he showed me the list of prohibited places. I wondered what a place could do to land on that list. This wasn't one of the possibilities I had considered!\n\nGood on you for putting them there so they can't take advantage anymore. I wonder how many other sailors were taken for $20 when they visited.",
            "As a former military member, this story made me a little hard.  Source: as an OR-6 I filled the same role as that chief a number of times. The ONLY mf that is entitled to fuck with my guys is me, or anyone appointed to do so by me. \n\nGood on him, and good on you for sorting that the right way.",
            "\"Jarheads\"!!! I was a Navy brat, and I grew up hearing that term a lot because of the Marines that were stationed as gate guards at the time. I don't think they use Marines for guards anymore. I loved looking at them as a kid; I thought they were fascinating!",
            "Since legislation was brought in, on this side of the pond, requiring training and certification for anyone working security, the worst of the bullies have been kicked out of the job. It's very easy for them to lose their licences, so they've cleaned up their act considerably.",
            "That was a Superb move you made!",
            "Betcha that doorman's career was measured in *nanoseconds* after that.\n\nYou should post this on r/MilitaryStories. They'd love it, and you.",
            "Can’t believe a dumb bouncer would do that when he KNOWS it’s a military town. That’s gotta be one of the dumbest moves out there.",
            "Heard a story, took place at base near Biloxi, 30+ years ago. \n\nThe town in general was shitty to military personnel.  In fact, the guys were instructed to ‘travel in groups large enough to repel hostile attacks. ‘\n\nSooo….stuff still happening and they decided to confine everyone (including off base personnel) to the base for two months.  \nThen, they paid every person in cash.  In $2 bills.  Told everyone- go spend.  So towns people would realize where the towns money was actually coming from. \n\nPretty clever.  Some businesses hit pretty hard.  Like the lingerie model shop- I guess strip clubs weren’t really a thing at the time.",
            "When i first started bouncing, I was told “no one ever fakes a military ID.”  It’s just not done.  Who even knows the consequences of getting caught doing such a thing? \n\nGuy thought he had an easy $20 mark.",
            "Hopefully the owners found out why it was put on the list.",
            "Ho. Ly. SHIT.\n\nThis went to 150% and I was only expecting 120 XD perfect ending",
            "This is the kind of story that I come to this subreddit for.  Good story and well-written.  (ignoring the typos)",
            "Whatever you might say about the military, it’s a terrible business decision to fuck around with them",
            "Great story, lol.  Gotta love those old Chiefs.  Sounds like every one I ever met, lol.  \n\nHad something similar happen at one base while I was there.  Just the threat was enough, though. \n\nBig Marine base, and many of the folks in town didn’t like us much, even though they were more than happy to take our $.  \n\nLong story short, a lot of problems with the local PD and municipal Courts, and many of the local citizenry.  Lot of altercations between Marines and local boys. \n\nA committee of club/bar owners got together and requested a sit-down with the new Base Commander.  Complained about Marines constantly coming into their places and causing trouble. \n\nBoss listens politely, knowing all the time that it’s bullshit - we were rarely the ones who Started the trouble.  \n\nThey end up with “What are you going to do about it?”\n\n“I appreciate your bringing this to my attention, Gentlemen, and I think I have a solution.  I can make your places off-limits to my people, and we’ll see how long you stay in business.”\n\nImmediate and unanimous change of heart, lol.",
            "Am a chief, and have never been given a pet marine to take to a bar… my life suddenly feels very unfulfilled",
            "Passports and military ID cards are federal property and must be returned.",
            "Man, its always the old timers too. Sure, they're the first one to string you up by your balls from the flagpole if you fuck up. But no one but God himself better fuck with their soldiers, and even he needs to clear it with Chief first.",
            "It's been decades ... but *very* satisfying MC.",
            "Well done. I had a car dealership f around with my wife, charging her way too much while I was in the field. I took leave, and camped in his lobby, driving away all his business. After I got a refund went to the provost off limits for all military personel as a preditory business. Too bad, so sad.",
            "It's been mentioned by others, but do consider posting this story in r/militarystories (note: crossposting won't work). I'm sure the guys and gals there would love it.",
            "I was laughing my ass off reading this, imagining that Doorman shitting himself when the Chief and those Marines got in his face, probably thought he was going to get his whole ass handed to him right then and there. Probably got fired by the owner of the bar, too, HA HA HA.",
            "I was once at a bar with some friends early afternoon in college, was with one of my friends rugby team, they went there a lot. We were at a table with a pitcher of beer. Well bouncer comes over to card my table of 4, friend first, yeah that's fine, then mine and he just slams it down on the table and says \"nope, you're out of here.\" Now the owner is with him, he sent the bouncer to card us.  I start pulling out school ID's, old drivers license, health insurance cards, slapping them all down like he did my ID. Got to last card in my wallet and said \"oh and here's my fucking fishing license and slapped it down.\"  The owners then turns him around just says ok, sorry you are good. IDK why it made me so mad, funny thing was the other 2 people at our table were both 18 year old girls, but because of all that they didn't get carded.",
            "Appears gym monkey door guy arrived at the find out portion of fuck around. 🤣🤘🏼",
            "r/prorevenge",
            "r/MilitiousCompliance",
            "Sounds like something out of a Jack Reacher book, just lacking the headbutts and throat punching",
            "As our granddaughter once said . . . at the tender age of 7, \"Go ahead.  Do it.  See what happens.\"",
            "FAFO right there",
            "Good. I would have gave him a fucking ear full the moment I got my ID back.",
            "Ohh you know that bouncer probably been making bank! Especially with ones who have snuck off to that bar 🤣 their not going to go telling anyone. However they will pay that 20 rq. lol",
            "I'm curious as how you become the \"two marines flanking the chief\".\nIs it a rotation shift? Do you need to be the angriest?",
            "Please post to /r/MilitaryStories. This is how a senior Non-com should take care of their people.",
            "Good story! Consider posting this in r/militiouscompliance and/or r/militarystories",
            "Oh, wow. For the attempt of a quick 20 bucks, the guy loses the bar THOUSANDS of DOLLARS of business, probably every WEEK.",
            "I have such a freedom boner right now and I don’t even have the right equipment to make a boner with! \n\nr/MilitaryStories and r/MilitiousCompliance would love this.",
            "Stupid as stupid does.",
            ">So we all pile in the van with a couple of marines in BDU\n\nAhhh you fucker!! We don't wear BDUs. Lol\n\nStay salty my USN brother!",
            "You’re a great storyteller! Thanks for sharing!",
            "I feel bad for the owners of the bar in this scenario lol, assuming they were unaware of this sort of shit.",
            "“Make a hole to the bar, make it wide.”\n\nThis shit right here.. is golden and ultimate.",
            "This was beautiful, props to your chief and OOD for putting that brick for brains in his place, and certainly hope he got fired for the result of that stunt 🤣",
            "Lol. What a way to lose your job... Please tell me that bouncer was fired... Though, I suppose whether he was or not doesn't matter. He definitely screwed himself over with his own dumbassery... Imagine the nerve of trying to shake down someone who can get you arrested...",
            "So what would you do here if you were just a casual civilian with no powerful group to support you? Call police? This is extortion right?",
            "Bouncer here\n\nThat doorman is a dick.",
            "Post this and your other story in r/militarystories, they'll love it",
            "I’ve decided this is my favorite Malicious Compliance ever. Love it.",
            "\"I can't get back on base without it.\" I said.\n\nBuddy who drove and used State ID drove us back, we go into the Officer of the Day's office to report my lost/stolen ID.\n\nIs the office not on the base, I take it?\n\nOkay, i got it. He can't get back on base without reporting it stolen and going through an ordeal to get it replaced. Of course they wouldn't just kick him out of the military, I'm dumb today.",
            "[deleted]",
            "Semper Fi!",
            "They'd love this over in r/militarystories",
            "Gunny highway vibes.",
            "Attended college in a navy town...this shit is hilarious.",
            "I loved this - best MC I've read in a long time!  Thanks for sharing.",
            "This is the best story I have ever read here.",
            "Really sucks. Have to wonder if the owner knew it was happening or not though. Could have just been burned by one sketchy employee.",
            "Fucking Seaman Raccoon had me dying. That's almost as good as the kid \"_. Samples\" eho joined the navy....making him.....Seaman Samples....",
            "You could have involved the police too. That’s a crime what door boy did.",
            "This story is the definition of FAFO.",
            "Everyone's a tough guy until they mess with the wrong one and the real tough guys show up. Super satisfying story, and thank you for your service.",
            "The doorman FAFO.",
            "This is a great story!",
            "> Pull a driver and one of those Jarheads at the gate and go down\n\ntheRE, FFS.",
            "Can you please edit your story and spell chief correctly? It’s a great story but the spelling nerd deep inside my soul is screaming. Sorry.",
            "Hilarious story, brought to life even more by your good writing, ty for sharing a great memory and tyfys 🫡",
            "This must be old - marines aren’t supposed to wear cammies off base unless they are commuting to and from work or a field op, and haven’t been able to for at least 10 years. Taking issued weapons off base into a civilian bar also seems off, unless they were MPs.",
            "Epic",
            "Fucking great story! Haha",
            "\" you may have power now but you're not god! You're a doorman ok, DOORMAN, DOORMAN, DOORMAN!!\"",
            "I was actually kind of hoping for something akin to a felony stop for stolen government property. But this is pretty good I guess",
            "poooor doorman/s",
            "Hahaha my nephew just Joined. Can’t wait to hear his stories",
            "That is a beautiful story.",
            "Glorious!",
            "This was one of the most satisfying things I've ever read.",
            "great story....love it",
            "I guess loosing his job was the least of the doorman's worries.",
            "Nice. That’s how big bros are supposed to handle shit for their lil bros.",
            "You speak like a military man, love it",
            "That's pretty awesome when the big guys have your back.  Seems rare these days.",
            "I'm sure the folks in these subs will like this story...\n\nr/militiouscompliance\nr/militarystories\nr/usmc",
            "I was an MM4 stationed in NTC Orlando in the early 80's. The list of off limits places along Orange Blossom Trail was ponderously long.",
            "r/titlegore",
            "There are very few who can spin a yarn like a sailor, and you, sir, have upheld that tradition in the finest tradition of the service.\n/salute",
            "Currently active duty myself. \n\nThe ID we have now is priceless. If some musclebound punk decided to snatch one of my guys ID, ooooo trust me itll get ugly. \n\nGlad that CPO did what he did. Love good leaders"
        ]
    },
    {
        "post_id": "14a7eyx",
        "author": "SpaceKnightLife",
        "title": "Man wanted me to flirt back so I did^^",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/14a7eyx/man_wanted_me_to_flirt_back_so_i_did/",
        "score": 22427,
        "num_comments": 1529,
        "created_utc": 1686847985.0,
        "selftext": "This just happened and I’m still laughing my butt off. I’m a 25 year old MTF trans women that’s been on HRT (hormone replacement therapy) for 3 years now. Because of this, my body looks naturally feminine. Like it takes people awhile to catch on. My voice is softer and it hurts to deepen it. This is important information I promise. \n\nI work as a vendor for one of the major beverage companies. Basically I go to stores and stock shelves of my companies products. I’m listening to music, a playlist of video game themes remixed, with one ear bud in, like allowed, when a mid 30’s year old man walks over. \n\n“Wow, girl you are super thick. Wouldn’t mind taking you home with me,” he said with a bit too much confidence. I just continue working, ignoring him. He continues,” Oh come on don’t be like that, I’m quite large under these pants if you know what I mean; something a sweet ass like yours needs.” \n\nI continue to ignore, getting embarrassed and very uncomfortable. That’s when the music turns to the theme from Halo and he says what I needed.\n\n“Come oh cutie, say something to me.” \n\nInspired by the music, I instantly had a thought. It hurts, a lot, to do a masculine voice however in that moment I took a deep breath and turned to him. I looked at him with a very enthusiastic smile and he looks like a kid in a candy store, bouncing a bit like,” oh boy I actually got one.” \n\nGoing back to my roots, I took a deep breath and in the most deep, masculine voice I could muster I said to him,” You’re cute as well, sure I wouldn’t mind having my way with you.” \n\nAfterwards I start coughing, my throat hurting yet it worked. The dude jumped back a good foot and yelled out,” oh hell no!!! Fuck this, uh uhhhh. Nope, hell no.” \n\nHe ran out of the store so fast, constantly looking over his shoulder as if I was following him. \n\nThe stores workers were laughing their asses off, mostly all the female workers. One came up to me and asked,” how did you do that voice? I could never get mine to sound…… oh you’re trans. That makes sense.” That made my day and is why I’m still laughing in my car writing this.\n\n\nUpdate: Whoa…. This blew up way more then I thought it would. 17K upvotes and over 1,000 comments. Thank you all so much^^\n\nThere’s a lot of the same questions and comments so Im gonna add a little clarification’s here. \n\nThe reason it hurt so bad is when I do a deep voice I don’t just deepen my voice. I basically sound like the roach man from men in black, gargling my words. \n\nNo, not everyone clapped afterwards. That’s a lot of people’s comments and it confuses me why people are saying that. \n\nAgain, thank you all so much. This is absolutely incredible experience^^",
        "permalink": "/r/MaliciousCompliance/comments/14a7eyx/man_wanted_me_to_flirt_back_so_i_did/",
        "comments": [
            "This really reminds me of the story of the girl who could tell when she was gonna have a nosebleed and said \"Hail Satan\" to the kid beside her in class just as one started.",
            "(deep voice) \"Stop, it's uncomfortable when I get hard at work\"",
            "*\" I looked at him with a very enthusiastic smile and he looks like a kid in a candy store, bouncing a bit like,” oh boy I actually got one.” \"*\n\nlol, I was expecting OP to say that, now that would have been funny!",
            "Look him in the eyes and say, \"Well, I've been looking for a new bitch.\"",
            "I have a friend who does a \"man\" voice. It's not really manly but for whatever reason it makes ALL the men I know uncomfortable. The women find it hilarious but the men are deeply disturbed. Lol",
            "Way back in 1999, I worked at a coffee and bagel shop where my manager was a trans women (MTF) and she would do that to every weird dude who tried to hit on her or her girls at our store!",
            "Im the only male that works at my local store that has the balls to fuck with the gross old men that hit on my female co workers. Theres this gross, gross little man that comes in and is constantly making the girls uncomfortable. One day he asked one to go to dinner with him and before she could say anything i went \"oh but you wont ask me to go?\" He went right quiet and said \"Thats not fucking funny\". Yes it was you gross little perv yes it was",
            "[deleted]",
            "(deep voice) \"you should see how large MY cock is, are you into docking?\"",
            "This is deliciously malicious, but please be safe. It’s shitheads like this that murder trans folks. I don’t want you to be a statistic.",
            "> I’m quite large under these pants\n\nSo am I 😜",
            "People just walk up to people and shit like that?",
            "I hope this isn't insulting as I don't mean it to be, but [this is what immediately pops to mind](https://www.youtube.com/watch?v=CM9HDgGrajI) upon reading this.",
            "I am shocked that men still say shit to women they don’t even know like, “I wouldn’t mind taking you home with me,” and getting offended when the woman (tries to) ignores him. How is this still happening? And how do men actually think it will work? No one deserves that. Men, stop that shit right now, and tell all your friends to stop it.\n\nOP, glad you got him good! But I am sorry that you are working so hard to be accepted as the woman you are, yet you still need to revert to your masculine side to *protect yourself from predators.* “Just” being a woman wouldn’t have been enough to stop him. Making him think you’re a man worked like magic. Other women don’t have that weapon in their arsenal. Men just need to stop being threatening bullies as a way to get a woman to pay attention to them.",
            "I’m 1000% convinced this is why a lot of men are against trans rights. They are afraid they can’t just hit on women willy nilly now without consequences. He absolutely should not be hitting on a woman who is obviously working and obviously ignoring him. He definitely deserved whatever he thinks he got. When in reality all you did was give him what he wanted.",
            "go to OPs other posts. this is most definitely made up.",
            "[deleted]",
            "This entire interaction feels like it was plucked from a 90s lifetime movie.",
            "This is fiction",
            "Op which song? Finish the fight or mjolnir?",
            "Then the whole store started clapping.",
            "This reads like fanfic",
            "Do men really think lines like that are attractive? I’m a guy and even I don’t understand it. \n\nIf I was a chick and a guy said that to me I’d put my boot far up his arse.",
            "Thanks for the chortle.  You go, girl.",
            ">That’s when the music turns to the theme from Halo and he says what I needed.\n\n>“Come oh cutie, say something to me.”\n\n>Inspired by the music,\n\nAre you an anime character?",
            "This is going to become a copypasta.",
            "Omg I would have loved to be perusing the aisle, and stumbled on that conversation. I totally believe this happened. Dudes are disgusting, and I’ve had weird shit like this happen to me. I just didn’t have that ammo to use 😂. I think next time I’m going to have to use a come back, like “you should see how big mine is” and throw them off! This is great",
            "This is great! Proves my point. Men are afraid other men are going to treat them the way they treat women. You go girl!",
            "Unreal that people actually believe this obviously made up shit",
            "You used your superpowers for good :) :)",
            "[removed]",
            "That's fucking hilarious. I hope it didn't hurt inside",
            "/r/thathappend\n\n\nKeep dreaming",
            "On today's episode of \"Things that are made up and didn't happen.\"",
            "This is so made up lmao",
            "[removed]",
            "This is both incredibly hilarious and makes me so mad that he literally ran away after you basically uno-reversed him 😒 like he thinks HE’S uncomfortable after your one comment?",
            "This never happened",
            "Of all the things that didn't happen, this one didn't happen the most",
            "[removed]",
            "Yeah, sure, this definitely happened, exactly like you say it did. . .",
            "If your throat really hurts from making a deep voice you should probably see a doctor. That is not normal at all.",
            "And then the store clerks raised you above their shoulders, chanted your name and clapped their hands raw, while the gentleman in question raced further to the horizon whilst occasionally looking back and shouting \"hell no\".\n\nCool story",
            "“All of the stores workers we’re laughing their asses off…”\n\nI’ll take things that absolutely did not happen for $2000 Alex!",
            "This did not happen come on",
            "cool creative writing",
            "[removed]",
            "This didn't happen",
            "Horse shit. Men, even the most scummy, don’t talk that way. Unless you’re in Italy. And even then, it’s quite rare.",
            "You fucking go girl...!!!!",
            "Reminds me of another story I saw on Reddit. I think the person might also be trans MTF. They were on the subway at night (wearing a dress). Sitting near a bunch of women. They were approached by some nutcase who pulled his pants down,  flashed his man parts, and said, \"What do you think of this?\". Our hero pulled up their dress, pulled out their on man parts, and said, \"What do you think of mine?\". The idiot ran off",
            "Is it bad that this was the first thing that [popped into my head](https://youtu.be/AmTqU79WBEc)?",
            "Dr. Girlfriend Voice",
            "LOL That is FABULOUS! Sorry you had to hurt your throat to do it, but it was worth it.",
            "Where do people get the audacity to say these wildly inappropriate things in the first place oml 💀",
            "Why does it hurt to do deep voice if transition didn’t affect your voice at all..? Did you undergo some procedure to soften your voice?",
            "Who the fuck talks like that to a stranger in public? Absolutely unthinkable.",
            "What does MTF mean?\n\nAlso, do people really speak like that when they see random people",
            "My best friend from childhood is trans, and she was in choir and had a huge range. Similar to OP she has a very soft voice, but on a whim she can break into a baritone to freak people out. Love her so much lol good job OP!",
            "A women that I think is very pretty came out as trans to me after months of chatting. We weren’t ever going to hook up regardless but I was flattered that she felt safe doing that. Totally different situation. It’s just one of those things I’ve been thinking about lately. She is one of the prettiest women I have met in real life.",
            "So instead of clapping ev1 laughed",
            "Made my day!",
            "Yeah imma call bullshit on this",
            "[removed]",
            "Why do people believe this shit?",
            "Kind of reminds me of this:\n\nhttps://m.youtube.com/shorts/R3V86de6m18?cbrd=1",
            "My favorite story of a drunk cowboy is New Orleans was from a ruff old guy who said he went in a bar and sat next to a beautiy of a woman. She turned around and said In a deep baritone \" Are you one of us?\" He said \" I guess I ain't \" finished his drink and left.",
            "Imma call that bluff tho 😍😍😍",
            "Omg this actually reminds me of a time when I was delivering a package to an office and the guy at the front desk called me beautiful, and I looked visibly confused since it’s the first time I was ever hit on and he repeated “you’re very beautiful” and I said “I’m beautiful?”. That’s when he immediately stopped smiling and said, “you’re a boy?” Where I responded yea I’m a boy and after a few seconds he started smiling again and said “you’re still very beautiful”, afterward he asked me a bunch of questions like what’s my number and where I live and all that stuff. Weirdest interaction I’ve had so far",
            "God I’m imagining you reaching deep down and pulling out some James Earl Jones shit from somewhere you didn’t know you still had. Well done girlie!",
            "Not going to lie, I thought you were going to reply after he says he's quite large under his pants with \"So am I'",
            "This made me think about [this video](https://www.reddit.com/r/TikTokCringe/comments/det2d8/trans_woman_is_constantly_asked_to_reveal_her/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button) \n\nAnd I'm not trans but when I had long hair (like below my shoulders) and still shaved completely which gives me a fairly feminine face, the number of times I was mistaken for a woman before I answered in my pretty deep voice can't be counted",
            "Aaaawh god, I was having a bad day and this made my day, lol! Brilliant! xD xD xD",
            "This is great but I would have said \"I bet mine is bigger\"",
            ">when a mid 30’s year old man walks over. \n\n*is 33*\n\n*weeps*",
            "Nothing makes me happier than knowing there’s a fellow sister in the industry 😄🥰",
            "This is amazing! As a woman who has dealt with this from sleazy guys on more occasions than I could count, thank you for this story! The Halo theme was a bonus for me because I game and used to play Halo online a lot, and I used to have guys telling me to “get back into the kitchen where you belong”. Right before I beat them to oblivion. Thank you so much for the laugh!",
            "I wish I could get my voice to go low. I would do this all this time at the shop.",
            "As a woman...thank you for your service. I find trans women the most relatable when Im online. You seem to get the feeling of what we go through and I hope to understand what you must have to go through daily.\n\n&#x200B;\n\nStay safe and sane!",
            "there is a peruvian trans comedian called \"Dayanita\". She nade her whole comedian carreer doing this gag, roflmao",
            "When I was in high school I was a witness to this story. \n\nMy class had some guys that were straight up perverts they always cat called any girl with a big butt. Well ironically enough the girl with the biggest butt had enough and decided to teach them a lesson. So when the group cat called again she said out loud for the whole room to hear:\n\nNever go after a girl with a fat ass if you’re tiny penis can’t get past the cheeks. \n\nThe beat red boys were sent to the principals office after that and they never misbehaved again.",
            "You know every female in the world would kill to be able to do that voice at least once to get a man harassing them off their ass.\n\nBravo!!!",
            "very much enjoyed this story except i’m not sure i’d call what he was doing flirting. i’m not sure what you call it but flirting seems so…. mild.",
            "This didn't happen",
            "no offense but \n\n>a playlist of video game themes remixed\n\n\nthis is so on brand for a trans woman lmaooo",
            "why do you wish you could vote republican",
            "The HALO theme?? LMAOOOO",
            "[removed]",
            "🧢",
            "Does lying on the internet make you hate yourself any less?",
            "[deleted]",
            "never happened",
            "[removed]",
            "I'm mtf as well, I've done pretty well on my voice training and anymore I cringe feel utterly uncomfortable when I use my old voice.\n\nHowever, my coworkers have learned if I drop into my old voice, a customer is about to get chewed out and it will be glorious",
            "Just revisiting this absolutely delusional post",
            "That opening line of his gave me every cancer:( jfc",
            "riiiiiiight",
            "[removed]",
            "aw i love cute reddit fantasy fictions!",
            "[removed]",
            "[removed]",
            "How could anyone believe this creative writing? No one talks like this character you've invented.\n\n\n\n\n[\"Oh come on don’t be like that, I’m quite large under these pants if you know what I mean; something a sweet ass like yours needs.”](https://i.redd.it/1sl4mdsmr2661.jpg)",
            "Ah yes. One of my favorite stories was from a friend. They would later come out as trans but at the time they were just a guy with absolutely luscious hair. Truly the most beautiful you've ever seen.  \n\n\nThey told me that sometimes they'd walk down the street and someone would catcall them from behind. And they'd turn around real fast and flash a crazy smile with their very masculine jawline.",
            "\"I used to have one of those too!\"",
            "That's when I found, you don't mess around, with the funky cold medina.",
            "Boom headshot",
            "So first good for you no matter who u are u don't need to be objectified.  So question for my curiosity, the hormone therapy naturally lowers your voice making it hurt to use a deeper male voice?  Just never knew this.",
            "Only 3 years on estrogen and your body already looks naturally feminine? My trans girl-friends would like to speak to your doctor immediately",
            "this is gold thank you for making me smile in the morning",
            "Sorry to hear you got treated like that but a great comeback OP.\n\nAll the best with your transition and for your future.\n\nDoc from Australia.",
            "What if he said \"aw hell yes that's exactly what I was looking for!\" ?",
            "This was an absolute power move. Respect.",
            "You’re a fuckin’ hero ma’am. I would have been obnoxiously yelling ‘HA!’ If I had witnessed such an exchange.",
            "Hahahahaha",
            "I think I just fell in love with you I'm laughing so hard (I rarely smile much less laugh)",
            "You should have followed him. \n\n\"Wait! You got the ass I need too.\"",
            "You go girl!",
            "Oh my god I love this so much 😆😆😆😆😆💀",
            "Diversity win, even creeps think you pass",
            "This is beautiful! It's sad that transphobia is so rampant, but you used it to your advantage SOOO well! (I feel like being nonbinary helps me appreciate this in a way that I wouldn't, if I were cis. lol)",
            "Wow that was quite an interesting read! I love how you handled this situation haha! Good for you!",
            "Lol! That's the *perfect* way to get rid of a creep! Good on you! I hope your voice didn't hurt too much after that, but that's a story for the ages!",
            "Wow that HRT therapy really works. This story had the same kind of tedious unnecessary details as my girlfriends stories. Science is crazy",
            "I don't believe this at all. I believe OP got hit on but literally every other part seems like a weird lie.\n\nA weird sort of lie trans people tell about passing.",
            "You fucking QUEEN!!!",
            "What a bizarre thing to lie about lol",
            "Post history shows u posted as a male 2 year ago. You claim to have been on HRT for 3 years. Curious!",
            "Stunning & brave i cried for 10 hours so inspiring",
            "[deleted]",
            "Sure, Jan.",
            "This sounds like wish-fulfillment, but it's well written so I choose to believe it.",
            "Sure OP. Sure.",
            "Reminds me of the t-shirt (pun not originally intended, but if the heels fit…)\n\n“My GF’s D—- is bigger than yours”",
            "Nothing like sexually confusing an overconfident person.",
            "Fucking legend.",
            "Thing of beauty, OP! Thank you!",
            "I'm so glad you were able to scare the shit out of this idiot and send him running...but I do worry that nowadays these idiots are gun carrying psychos that will shot a transwoman especially if their ego was destroyed or they were embarrassed.  Enjoy the hell out of this moment but please be careful."
        ]
    },
    {
        "post_id": "pz6isn",
        "author": "tee_ran_mee_sue",
        "title": "Are you sure you want me to take part in this go kart race? Sure thing, boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pz6isn/are_you_sure_you_want_me_to_take_part_in_this_go/",
        "score": 22405,
        "num_comments": 936,
        "created_utc": 1633089712.0,
        "selftext": "A few years back, I started my first job as a mechanic and was informed of a mandatory monthly kart race in the local track which was promoted by my boss and owner of the company. \n\nHe didn’t care if you enjoyed it or not, he booked the time slot and we all had to show up (after working hours and paying our own ticket to drive). It was supposed to be a team building exercise and I could see the boss really liked race cars through the various pictures and trophies in his office. \n\nDuring the week, in anticipation to the event, boss would motivate / participate in setting the mood for the upcoming race. It was the only topic that week and I was told by colleagues that this was really important. \n\nI knew that, on the evening of the race, I had to pick up my girlfriend and that would clash with the race, so a couple of days before, I told my supervisor that I would not attend the race. It was after hours and on my dime anyway so I didn’t think it would be a problem. \n\nSome 20 minutes later, I’m summoned to the boss’ office and he’s not looking happy. He tells me that building the team spirit is one of his priorities and that I’m new there so I was to give a lot of focus to this monthly event if I was to keep working there, because it was part of the “core culture of the company”. I really needed the job so I just said “Sure thing, boss”. \n\nOn the evening of the event, I drive to the kart track and, upon arrival, I see my colleagues all in jeans and t-shirts and my boss in full ballerina attire. He had racing overalls, racing boots, gloves and even a custom helmet. It downed on me the reason for the event and why so much attention was given to it: kart racing was his thing. \n\nWith about 15 racers, I asked to start dead last. Boss man listens to me talking and intervenes in front of everyone that we were there to race and not to just drive around slowly. Up until that point, I wasn’t really paying much attention but I decided to comply and show how much the “core corporate culture” was important to me. \n\nStarting from last, I proceeded to overtake all other karts, including boss man on the outside of a fast corner (overtaking on the outside is often seen as a bold arrogant move). After just a few more laps, I reached him again and, as I was about to lap him, he went into the pits and stepped out. \n\nI duly won the race and, as I left the track into the bar (the real team building event), someone tells me that the boss had left. At the bar, the topic of the evening was how I had outraced everyone and how the boss, who had won all races since ever, was livid with my performance. \n\nToo bad for him. I guess I forgot to add to my resume that I had raced karts competitively as a kid so I knew what I was doing and shattered his “Ricky Bobby” dreams. \n\nAfter that, I was always courteously invited but never again required to show up to his events. I went a few times but arrived late on purpose so I would just take part on the bar thing and not the race.",
        "permalink": "/r/MaliciousCompliance/comments/pz6isn/are_you_sure_you_want_me_to_take_part_in_this_go/",
        "comments": [
            "Monthly mandatory unpaid events to stroke the bosses ego …. Smhh",
            "\"Why is no one having fun?...I specifically instructed people to have fun!\"",
            "My favourite ones are paintball with bosses. First time I showed up, I only brought a mask, I knew the rental markers well enough. The bosses all had mid level tournament markers. Next time I brought my hockey sized gear bag. That was when they found out I played, at that field, 2 to 3 days a week and had been for a few years.",
            "You should submit the overtime... if the time is company mandatory then it's company paid.",
            "In the navy, we call this kind of thing, \"mandatory fun time\"",
            "Mandatory \"fun\" for work: \n\n* I'm getting paid / on the clock for this.\n\n* Work is also footing the bill.",
            "A little lesson in humility never hurt anyone. Maybe he should use it as a lesson to not force people to do things they don't want to do on their own dime.",
            "Update needed: who picked up your girlfriend, or is she still waiting?",
            "After the race, should have gone with:\n\n\"Boss, my first race was a lot of fun, we get to do this every month?\"",
            "Years ago someone came up with a \"Mini Indy\" go-cart racing deal that went from city to city. The company I worked for dived in head first as there was some charity involved and it was a good political event for the company. I was ordered to attend. I was into go-carts, but I wasn't into this as it was a stock 5 HP Briggs and Stratton engine. Top speed maybe 30 MPH. Plus the rules were are very restricting. Engine RPM was checked, no changes to the gearing was allowed and so on. I had a go-cart at home that would do well over 100 MPH so this was like driving a moped when you were used to racing bikes. I had raced cart some so I think the owner believed I was their \"ringer\".\n\nAnyway, I refused to do it and was told in no uncertain terms by the owner that I had too. It sucked that I was a salaried employee so no money in it either, no incentive for me to show up, let alone participate. A few other employees were all into it and more wanted to participate, but couldn't as only so many could be involved. The owner would not let me drop out and have someone else that wanted to take may place. \n\nThe racing had been announced daily throughout the company and everyone was encouraged to attend. The night before the race there was a large banquet we were required to attend and a bunch of stupid games the racing teams played. I participated, but didn't put any effort into it and got a bit of heat from it as it was obvious I was not trying. \n\nThe day of the race there was nobody there except the few employees that were required to be there, not even the owner of the company that was pushing this down our throats. I was one of the drivers and when it was my turn I just took a leisurely drive around the course and finished in dead last. My manager that was involved was busting my butt for not pushing harder and I just looked at him and said I needed to get paid more if I was expected to compete. A second heat I was in the cart had a minor breakdown so I DNF. I got a bit of backlash from it the following week, but it was worth it. I also reminded him I didn't want to participate and perhaps some other employee that was interested would have been a better choice.\n\nThere was other issues working for this company, but I left soon after.",
            "Our place tried to have health and wellness days. At least they were paid time.\n\nThe day was: first half talk about health issues and the second some fun activity, like an obstacle course or big inflatable joust games.\n\nThey could actually be fun for me as I like challenges and am in decent shape. The funny/sad thing was many of my coworkers are not in good shape. So… two people injured on the obstacle course. A couple on the bouncy stuff. My partner wrenched his hip just playing floor hockey. \n\nThe “wellness days” were accounting for most of our work injuries. Now they just give us the “wellness” money in reimbursement for gym memberships or running shoes. Things that promote fitness.",
            "Similar scenario, different sport. \n\nCompulsory fun, work function. Pizza and ten pin bowling. Boss was highly competitive, gym junkie type person. I wasn’t on the same team as boss, couple lanes over. \n\nFirst game, I just chilled. Wasn’t trying hard, but getting back into my routine. Wasn’t the highest scorer, but didn’t embarrass myself. And was high enough to attract a bit of attention- a few people hinted at challenging me during the second game. \n\nThat was when I found my line, and settled in. Second place was 20 pins below me. That was about when I revealed that, it may have been 25 years earlier, but state level representation at a sport leaves some skills in the memory banks.",
            "This brings a smile to my face - I've often clashed with my bosses about team building events outside work; I'm just not interested, and they often threaten my employment if I don't show up, which is such nonsense.\n\nThat being said, this strongly reminds me of a time in my late teens, so I'm going to piggyback a bit.\n\nA friend of mine was BIG into Halo multiplayer, and whenever we got together at his place that's all he wanted to do. I wasn't a big fan because I'm not a huge multiplayer gamer, and it gets boring fast, as he'd grab either a sniper rifle or a vehicle and kill you over and over again, making it un-fun.\n\nEventually, he realized I wasn't really enjoying myself and stopped demanding that I play. In the background though, I was enjoying the story mode of the games in my own time, and had even started pushing through them on the highest difficulty.\n\nHis brother though would often smack talk when I came by to hang out but refused to play, calling me a pansy, and telling me I had no guts to face him as though he was the best ever. I'd just shrug it off and do something else while they played.\n\nFinally though, one day he pushed the wrong buttons while they had a 4 player game going, and I finally agreed to play once if it would shut him up. And proceeded to 10-headshot-in-a-row-killstreak my way through the match like a machine, because if I can beat the legendary AI, a couple mooks who always do the same things over and over again aren't going to be that tough. A few minutes in, the friend who gave me his controller even started actively cheering me on as I put them in their place.\n\nI finally put the controller down with an 8:1 KD ratio at the end, and the brother's just watching me agape. And never asked me to play again.",
            "I hate working for companies that promote the Mandatory Fun activities.  Especially if it is non business hours and at personal expenses.  Also with the underlying thought that you will probably be fired if you don't attend.  That last part is what pisses me off the most \n\nFor Christmas one year the owner's kids came up to everyone and said they wanted to send their parents on a two week European Cruse.  They asked $300 from everyone to cover he cost of the gift.  I never gave and had each of his grown kids come up and start pushing me to give my share of he money.  This was actually broughtthe day they fired me.",
            "When I was young, I thought car races were won with better cars. To some extent that is true, but the older I get the more I realize that the driver is often more important. \n\nThe one that had me in stitches was a Top Gear episode where they took a woman who was an experienced race driver to the Nurburgring track and she raced a bunch of amateurs in sports cars in a lorry. And proceeded to wipe the track with them.  Lol",
            "If I am not being paid, it's not mandatory.  Simple as that.\n\nWe did kart racing once.  It was on company time and the company paid for everything.  That's how you do a team building exercise.",
            "In college I had a shitty job at a shitty company with a shitty manager. They had shitty mandatory monthly events that I hated. Prior to the third one, I told my boss I didn't want to go as I was not feeling well. He threatened my job, so I showed up. About 15 minutes in, my stomach is churning and I head to the restroom. I \"accidentally\" stumbled and projectile vomited all over him...in his hair, in his ear, down his shirt...  For the remaining time I worked there, he always kind of jumped back whenever he saw me approach and never again insisted I attend those stupid events.",
            "Paintball with the work team in the 80’s was fun… this was before it turned into a full auto festival.\n\nMy arch nemesis with his military training would boast about his probable victory. So I made sure he was my first kill every round.\n\nI was a Lt. in “the big red 1” paintball team in the late 70’s and early 80’s. Team sniper mostly. Usually climbed trees for a good hide. Nobody ever looks up.\n\nWhack !\n\nDammit !",
            "I have a standard policy that I have never broken:    \n\n*I do not provide personal financial resources for company business.* \n\nNo passing go, no $200. I have had managers scream at me and I just wait for them to stop screaming and I just repeat my position. They have threaten to fire me. I simply tell them the same thing again. I don't give a fuck if they do fire me. I still won't break my rule.",
            "[removed]",
            "Back when I was a teenager I used to street race. After getting busted one too many times I got pushed into a police program to give people old police cars to prep for the local stock car league. Any thoughts I had about being a good driver got rapidly sorted out. In the lowest bush league  stock car class there was I never managed to finish better than mid-pack. Years later I found myself working for a manager that had a track prepped Corvette who thought a good team building exercise was to make his people go to the local go cart track. I went to the first one and just watched and learned he was terrible. He’d lock up the brakes, turn in early, and everything he did was herky jerky. I had no doubt that I could stuff him into the walls at will and help him understand that having the money to own a track prepped Corvette didn’t mean he could drive it. Of course, I also realized that he did my reviews and I liked my job so I was always careful to arrive too late to participate. In hindsight I wish I had taken the advantage of the situation to step on his ego, but c’est la vie.",
            "Just as an FYI if it's a mandatory work event they have to pay you, and they have pay to get you where you need to go (not driving necessarily, but the tickets).\n\nSo be sure to record the hours and submit expense reports.  And don't back down.",
            "He sounds like a sociopath.",
            "My dad worked for a roofing company and the company owner would throw a huge Christmas party every year and footed the whole bill. Every employee got to bring 1-2 people so he was feeding and entertaining hundreds of adults and children in a rented venue.  I went to like 3 of them and they were a good time. There were also company picnics in the summer, I don't remember if they were every year but at least every year that there was a storm and sales were good. OPs boss is a douche.",
            "I remember the time that my boss thought it would be a good idea to have a paintball session as a team building exercise.\n\nReally. Having coworkers shoot each other to increase bonding and teamwork.\n\nNone of my coworkers have ever been in the military. Very few of them have ever held a firearm.\n\nI served in the military, as a police officer and as a private security professional overseas.\n\nBoss man was all dressed up in fatigues and acting really tough.\n\nSo I went hunting...\n\nI lit Boss Man up more than once and he never even knew it was me until later.\n\nBy the time was the game was over he looked like he had been dipped in paint.",
            "Ha! Good on you!",
            "Mandatory + unpaid = illegal.",
            "Back in the 80's I worked for a company that was just starting to embrace \"Team Building\", particularly for managers.  My boss was a Viet-Nam vet who always said what he thought, since he had survived getting shot at and nothing phased him much anymore.\n\nSo when he was told that all the managers were going to attend an Outward Bound course that involved humping a pack and sleeping on the ground in a tent, he thought about it for a minute and then said \"Last time I had to do this, I got to shoot people.\" Team building ended abruptly.",
            "What happens if you don’t have fundage available for the race ticket?  I can buy milk for my kids or race my boss…",
            "Hahah I love this. \nThis reminds me of when my husbands friend had a similar “compulsory karting event” at his white collar job. \nEveryone including our friend was absolutely sick of an arrogant dude from their IT department winning all the time (mainly because he was as light as a 12 year old boy). \nThis particular Christmas party you could bring your spouse or a guest. So he asked my husband to attend. \n\nHusband is third generation car racer. Has been in karts since he was 4, raced across many different disciplines semi professionally and now races F2. \nSo obviously husband obliges. \nShows up. Doesn’t say a single word to anyone. \nPut his own helmet on (refuses to use the ones at the kart track) and absolutely obliterated them all. \nGot out of the kart. Accepted the trophy that had been engraved with the company logo etc that he doesn’t even work for. Then shook hands with his mate and just left without saying a word 🤣",
            "Yeah, that's less \"team building\" and more \"boss wants to feel good about himself.\"\n\nAlso, if it's mandatory, they have to pay you for it.",
            "Had a similar situation with billiards. Manager would show up with a custom cue in a case. Would make a spectacle of opening it, and assembling it.\n\nHe was annoying as shit, and would constantly pester us to play some 8 ball pool with him.\n\nI've never played competitively, but I have been playing 8 ball pool since I was 6, so I am pretty good, tooting my own horn and all.\n\n&#x200B;\n\nGenerally, when I'm playing with unexperienced players, I will goof around. I rush my shots and avoid any ball control techniques like stops or follow-throughs. Im just having fun.\n\n&#x200B;\n\nManager came over and was watching our game, dropping comments about what to do, how to do, and how bad we were doing.\n\n&#x200B;\n\nSo I hustled him. I challenged him for a game, I let him win. I challenged him for a rematch, I let him win. He wanted another match, and I beat him just barely. I was \"psyched\". I was going around telling everyone I had beat him with a house cue vs his $600 custom cue. That got him riled up, and he wanted a winner takes all rematch, with a substantial bet. He called it at $1,000. I said nah, $1,200. He took it. After a coin flip, it was his turn to break, and he got 3 balls in.\n\n7 shots later, I call my pocket and he forfeits. He refused to pay because I was clearly hustling him, and I had an unfair advantage because I played him.\n\n&#x200B;\n\nSo I pocketed the 8 ball and fouled at the same time, which means I would've lost the game. \n\nBut because he forfeited, it didn't matter. He was pretty mad about it for a good while.\n\nBut, the next time we went on a team outing, he avoided making bets or just being an annoying showoff.",
            "Do you have any kart racing tips? Every time I go, they’re all basically same-powered.",
            "That reminds me of the time that the company I worked for then (known for tires and blimps) was having an event at what was then called Sears Point. And the big thing was that everyone at the meeting there would get to take a ride-along lap on the track.\n\nSo, I was one of the last to arrive. Because I had to stay at work and close up the shop before I was able to drive out there. But my district manager made sure I got to do my ride-along lap anyway. However, the driver got a little put off by my reaction to the way he drove. He wondered why I looked bored as he rounded the turns on that lap, when everyone else had been freaking out at how fast he drove. He did around 85 to 90 MPH around the track.\n\nThat was when I told him that my father had driven on the local NASCAR circuit when I was a kid living in San Antonio. And that the first car I ever drove was his '65 Mustang stock car that he used to race with. When I was 6 years old. And that I regularly drove faster than the speeds he was driving on the track.\n\nI could see his ego deflate faster than some of the tires I had replaced that day while at work.",
            "I would've checked my state's labor laws because a company event can't be mandatory if you have to pay to go on your own dime, I'm almost 100% certain of that even in the South where labor laws barely exist. Also if it was mandatory you should've been paid if you were hourly.\n\n&#x200B;\n\nSite's from a law firm out to make money on such cases, but bearing in mind that bias this article sums it up:  \nhttps://www.employmentlawyernewyork.com/news/latest/what-should-i-do-if-i-m-asked-to-attend-a-work-event-on-my-own-time.html",
            "You lost me at paying your own ticket. I would forget my wallet every single year. “Sorry bossman, you got this or is it see you on Monday?”",
            "I worked at a go Kart track and when guys like said boss would come in we would always make sure to keep an good eye on them and made sure they got the slow Kart. we would also offer to have them race the youngest driver we had if they wanted to show their skills. we knocked a lot of people down a peg or 2",
            "\"Ricky Bobby dreams\"\n\nlol\n\nNice burn",
            "Wait, if that was a condition of the employment, wouldn’t actually be considered part of work and therefore working hours? I feel like the boss in an attempt to grow his ego might be overlooking the possibility of a future class action lawsuit from current and previous employees.",
            "What a fucking baby. Mandatory monthly event just to show off his racing skills",
            "The karting will continue until morale improves!",
            "Those are some huge red flags, wtf",
            "He's a sore loser for something that's mandatory, not on the clock, that he doesn't pay for? Good you smoked his ass",
            "You achieved kart blanche with your participation requirement!",
            "\"If this event is required I expect to be paid for my time as well as ticket. Otherwise this is probably something the department of labor would love to hear about.\"",
            "You should have told him that by leaving like he did, that didn't exactly uphold the team building core values the event was supposedly set up to promote.",
            "The only thing that could have made this more perfect is if the boss's chosen sport were not go-karting, but MMA.\n\nWell done!",
            "We had a go-kart race with my old workplace  (restaurant, where I was a waitress) as our end of year event. Boss paid it with the tips received throughout the year. The thing is this was in NZ where people don't tip, unless they're foreigners and you're awesome. I speak German and I had a German lady come in regularly and tip me twice. My boss would take $10 straight out of my hand and say loudly \"in the jar!\" $10 on a pizza in NZ is bloody rare.\nThat $20 was the only tip ever received by me. He didn't share the tips out between people to make it fair, he would literally pull money out of hands to then pay for a go-kart race.\nI feel your frustration OP.",
            "Compare and contrast with a friend of mine's boss.\n\nHe was a silent partner in his brother's go-cart track. At least once a month (and often multiple times a month during the summer) he'd close up shop early and buy a bunch of beer.\n\nBring your friends! Bring your family! Free go-carting, snacks and beer!\n\nIt was honestly a lot of fun the times I went, although I always got my ass kicked. Not by the boss, or his brother. Nope. The 17-year old redhead girl that helped out with ordering.\n\nI carded her a couple years later at an 18+ venue. She kept her driver's license in a clear plastic pouch along with her license from the FIA. She said it kept her from getting tickets.",
            ">After that, I was always courteously invited but never again required to show up to his events. I went a few times but arrived late on purpose so I would just take part on the bar thing and not the race.\n\nThat is very polite of you. One of those things where you know you never have to race again to be a legend.",
            "\"So if I do not show up to something you are saying is mandatory but I am NOT being paid for, I will lose my job?  One moment, I have to call my attorney and ask him to prepare to file a unlawful termination lawsuit\"",
            "This reads like a \"The Office\" skit",
            "You should have kept going and winning every time until he asked you to stop",
            "Competitive events are a bad idea for morale boosting/team building from the ground up.",
            "I would have gone and kicked his ass every race.",
            "You should have bought a speed racer helmet just to fuck with him further.",
            "Reminds me when i was new at my current job they invited me to partake in gokarting that they do from time to time.\n\nIm an IT guy and work at a logistics focused organization so there where a bunch of truckdrivers and mechanics and really super car oriented people who all boasted about their driving skill and joking with me that driving for real isnt like driving in video games and that i would get lapped since i didnt even have a license and such.\n\nQue me basiclly growing up in a gokart, spending most of my childhoos up untill late teens driving and competeing all around europe being a prospect for driving proffessionally etc. Pretty much only stopped cus money and found other passions in music and IT also i was honestly not good enough to be a pro driver but still race gokarts regularly and used to be #1 ranked racer in the adult class at my local gokart club before I moved for this job.\n\nI did not get lapped.",
            "FANTASTIC!",
            "Fuck that I would keep winning just to piss him off",
            "I would not attend any mandatory team building event that I'm not getting paid for.  You want me there, you pay me.  End of discussion. \n\nMy old employer, one of the managers in my department would gather us all together for a few hours to play a bunch of stupid team building games in one of the conference room.  The thing was, we were all paid for it, and it was on company time. I'm not sacrificing my free time because you want to force team building.",
            "If he was really into kart racing and not a stupid human being, he would've seen how awesome you were, said something along the lines of \"Holy shit, dude! You're amazing! Where'd you learn to drive like that?!\" And then you two could've had a long and lovely conversation that stoked both of your mutual loves' for go kart racing and you could've made a friend.\n\nInstead, he decided to be a bitch.",
            "In my experience, as long as they're competent enough to stay on the track, the person that wins the go kart races is the skinniest one. Nothing more or less than that",
            "What a sore loser xD. Glad you whooped his ass at his sport. Hahahaha",
            "When the boss wants to be Enzo Ferrari.",
            "At least Michael Scott would maybe pay for your ticket.",
            " you should have kept turning and lapped him over and over\n\nThen tell him you feel the team building\n\n\"My first race was fun but how come everyone else is so slow?\"",
            "I had a boss who was a great guy except that he considered team building events to be taking everyone out to a bar to get totally plastered.\n\nThat's fine, except for those of us who don't drink. I never enjoyed those outings, and eventually begged off.\n\nIt also backfired for one of our staff, who would notoriously get so plastered that he ended up crashing at somebody else's house because he was too drunk to drive.\n\nThey had the audacity to pull him in the next day and tell him he drank too much. The irony was lost on them.\n\nThe same boss had a pretty good leadership team, consisting of like-minded people, all golf people, except for one woman, who was Vietnamese, had known mobility issues, and was not much for physical activity.\n\nHe asked me to set up a golf event for the leadership team. It took a lot of talking on my part to get him to understand that she would gain absolutely nothing from the event, and riding around in a golf cart, I'm sure was not her idea of a good time, not to mention not exactly team building.\n\nHe be grudgingly agreed with me and figured something else out.\n\nWhat lengths some people will go to to get the company to pay for these kind of events.",
            "You should have gone regularly and given him a little humble pie.",
            "I knew at some point you were going to reveal yourself to be some sort of competitive driver and it was still worth it. Top story mate",
            "“Full ballerina attire.”  Fucking priceless OP",
            "Your choice to participate but not humiliate at later occasions is admirable. Well done.",
            "I had a boss like that! Urgh. Shortly after starting there it was announced we'd be doing that the following week. I was like ok cool whatever. As a bonus it got postponed 4 times, because boss had personal plans. But he'd hold it over our heads, we'd get dressed accordingly on the day, and half way through the day he'd cancel. For 4 weeks.\n\nSo it finally happens and man that shit was awkward  - the boss and his two pets (his party buddies) were all super wasted on coke...\n\n...and guess how competitive that made them! Hilariously. They burnt rubber (that flew into my fucking eye, of course) and were bracing themselves so hectically so they could just keep going fast, that two of them had the most intense bruising for weeks after on their legs and torsos. \n\nIt was such a circle jerk I hated every second of it.\n\nThe next time we went booooowling. Now it's all dandy if you like joiner sports but it's not my vibe",
            "Company I worked for had Christmas \"parties\" every year that they would pay 5 hours ot on. I would show up stuff myself with free food and go sleep in the car as the third shift mold each I had to work that night anyway.",
            "An unpaid activity cannot be mandatory.\n\nShould have gotten him to put the requirement in writing, then report him for wage theft.",
            "team building on the clock? I’m there! Off the clock? Sorry I’m doing something that night boss… you did the right thing though OP since you needed the job.",
            "I flat out refuse to do anything for free. If my boss wants me to do something. That’s work. I don’t work for free.",
            "Nothing like kicking a pompous boss's ass.  Nice work!",
            "A true hero is my description of you.  Been cool if you sandbagged a couple of races and then bet big money against your boss.",
            "This sounds so familiar. I was an American working in the UK in my 20s. My work colleagues were always happy to tell me American cars, drivers, and motor sports were all terrible. I really didn’t care. The office had a number of F1 fans so they took us all to a kart track for an all day weekend event. It was free food and racing so I didn’t mind. I have karted in the US but certainly not like In any sort of organized level. To my own surprise, I proceeded to overtake everyone, repeatedly! My particular kart wasn’t fastest on the straights, but somehow I figured out the corners. No one wanted to compare notes on lap times by the end, but my slowest laps were still faster than theirs. I have to admit I got some good enjoyment out of it after all their talk.",
            "\"You must race properly.\"\n\n\"No not like that!\"",
            "You had me laughing at his \"Ricky Bobby dreams\". Well said.",
            "Thats unbelievably pathetic of your boss",
            "um, so why was the boss a ballerina?",
            "You OWN ticket? Not your ticket, but your OWN ticket? That's awful. I could see if he made you paid your ticket to drive, but damn, your OWN ticket to drive, that's something else.",
            "I'm surprised the Boss didn't whine on Monday that it wasn't fair, since you had experience.",
            "😂🤣👍",
            "If you ain't first you're last",
            "“Can I just not go”?\n“The Firm discourages not attending”.\n“Bring your wife”.\n“My wife”?\n“The Firm encourages family”.",
            "Shake 'n bake!",
            "\"He booked the time slot and we all had to show up (after working hours and paying our own ticket to drive).\" - that's a no from me :)",
            "Happy for you for winning go karts",
            "I had a boss who took a couple employees out to lunch to talk about their careers and what not. End of the meal, the boss asked for separate checks and made the employees pay.\n\nNow if this was a social lunch I'd be on with it, but this was sold to them as a working lunch. (Both employees had brought a lunch that day)\n\nI told them to expense it, sadly I don't think they did.",
            "If you're not first you're last!.",
            "Nice!!! \n\nI just stuffed most coworkers into the wall when we went karting. \n\nFelt pretty great.",
            "Sounds like boss went to a seminar, heard about team-building events, and \"improved\" on the information given: pick an event that everyone will like (pick something I like, and everyone else will like it because I tell them to), and pay for it as a company expense (naah, it's going to be so much fun that everyone will be happy to pay for their ticket, and go with a cash bar).",
            "Team building my ass, he wanted a way to easily show who's top dog here",
            "You, sir, are a storyteller! I was waiting for the 'and actually, I know what I'm doing' and you held back till the penultimate sentence. Delicious ML, great job.",
            "Seems convenient that we find out at the end that you’re the racing master. Racing was your boss’ thing but come to find out it was your thing as a kid and you didn’t offer up that information at any point beforehand. It’s like the classic trope of badass forced out of retirement for one more job",
            "I just got back from karting. Similar story, guy books staff event karting as he is good at it. I go to the circuit and practice a few weeks before. I don't tell anybody.  I'm not that bad. Race day today and him and 5 of his buddies are there. I came third, .6 seconds behind him. So I beat his buddies and very close to him, I said it was my first time and was a bit clueless. He got quieter and quieter.. I loved it. I'm 20 kg heavier than him also. The staff member said 10kg adds .3 secnds. We did the maths and I would have won if I didn't eat cheeseburgers. Very satisfying to humble somebody",
            "Get absolutely fucking obliterated, bossman's ego!",
            "That's what he gets for coming between a guy and his girl on date night.",
            "Mandatory monthly event that you have to pay for so that he can win. I would have been very tempted to punt him at lap 1 turn 1.",
            "The beatings will continue until morale improves",
            "Wowza. Talk about illegal. Hello Department of Labor.",
            "I can imagine some of the difference in racing skills. We once had an after work cart + dinner event (own timeand paid for us). We were the last group that evening. After us the local team started their practice rounds. On first lap they improved our best of day laptime with many seconds (all 10 of them) and kept improving their best time for at least 5 more consequetive laps.",
            "I would have yelled “blue flags, blue flags!” as i lapped him just to rub it in",
            "Looks like your power fantasy",
            "Fucking love this one.",
            "This literally sounds like a The Office episode with Michael Scott trying to have everyone hangout with him lol",
            "Do you work for a paper company by any chance?",
            "If I was OP, I'd go to EVERY Go-kart race going forwards just to stick it to the boss.",
            "25% of the company time is spent stoking this guy's ego with his hobby.  Yikes.",
            "Is mandatory events for work that YOU have to pay for a common thing? Fuck that",
            "For anyone who has any idea, is not attending a 'mandatory', non-paid-time, out-of-pocket 'work event' a fireable offense? I know at-will employment laws exist, but even they have stipulations.\n\nI'm just curious if OP could've told his boss to go kick rocks and not had to worry about any *actual* reprocussions\n\nCorrected 'right to work' to 'at will employment",
            "Someone get this person on the grid. u/tee_ran_mee_sue to F1 Mercedes for 2022.",
            "Outstanding effort!",
            "I'd have raced a second time and kicked his butt again, just to show who's the alpha male on the track.\n\nOf course, that probably would have gotten you fired on some made-up grounds.",
            "If you’re in the States and depending on which state, this could be a highly illegal requirement from your boss lol",
            "Dat unexpected little twist. Well told.",
            "I love go kart tracks!  Been kicked out of every one I've ever been on.",
            "This reminds me of a workplace proximity associate who had a HUGE ego about her Words with Friends prowess.\n\nI accepted her challenge and trounced her thricely. After that, she never challenged me again, and clammed up about it when I was around.\n\nToo bad for her. I guess I forgot to clue her in on the fact that my parents **FORCED** us kids to play Scrabble all the damn time - *AND* read books, *and* harped on spelling, vocabulary and the like...\n\nPlus I got really lucky with tile selection.",
            "Good.",
            "Michael Scott?",
            "Haha, well done. He got what he deserved :-D",
            "Maybe he’s bringing the team together in a shared hatred of him? The real way to build *esprit de corps*.",
            "I'd enjoy it if the boss was paying for it, and if it wasn't mandatory. The boss was crossing a line.",
            "You should’ve told the boss that if he wanted your time he needed to pay for it. It’s illegal to expect slave labor. Driving a go cart is labor if you don’t want to do it.",
            "Hahahahaha. What a way to crush his ego.\n\nFrom last to lapping them multiple times.\n\nMasterpiece.",
            "Honestly I'm glad to see someone get their ass handed to them like that, especially at events like this.",
            "You should cross post this to r/Karting I’m sure they’d get as big a kick out of it as I did.",
            "I had a repair tech come into my work to fix one of our machines I think 2 years ago. He talked up about his karting and going to Vegas for championships and whatnot. I told him there's a local place I go to if he wanted to do a race. We went and did two races and I kicked his ass, he was kinda quiet about it after that. I'm not that good compared to the bigger regulars I saw there or on their monthly leaderboard. But I've put in about 350 races there since I was 16. Gah, I can't wait to go back.",
            "You should definitely reap the karma of posting this to /r/irlsmurfing!",
            "Sounds like a rare case of being able to book a sick day in advance like HR always want.",
            "That bosses name, Michael Scott.",
            "This makes me love my job even more. Our version of this is my boss sending me to our other shop on the clock to prep the company rally car, then clocking out and going drifting in the middle of a snow storm.\n\nI definitely could have stayed clocked in, but at 10pm on a Friday imma strap in and learn trail braking instead.",
            "Honestly, that's some Michael Scott shit lmao.  Did he also take you guys out to Chillis after for an award ceremony??  Which Dundie did you get?",
            "US Army\n\nEdit: here we go. 😂",
            "Too bad for my boss that I neglected to mention that I was actually 2x F1 world Champion Mika Hakkinen and smoking his ass on the kart track came easily.",
            "Great story!\n\n>Starting from last, I proceeded to overtake all other karts, including boss man on the outside of a fast corner (overtaking on the outside is often seen as a bold arrogant move). After just a few more laps, I reached him again and, as I was about to lap him, he went into the pits and stepped out.\n\nHow is that even possible though? The karts I've raced (not a ton) were always tuned so closely to one another that it was pretty much impossible to pass anywhere but the inside of a turn. Admittedly I'm not an amazing driver, but I can usually lap the last few racers (often young kids or old guys). I've never even had enough time in a race for more than that.",
            "Required to attend for work, but on your own dime and time? Sounds like wage theft.",
            "I understand that maybe they cannot pay for drinks, but the fact that you had to pay for your own ticket to race is complete BS.  If they are not paying you the least they can do is pay for you to race karts.",
            "Thanks for this. It tickles my pickle.",
            "Is your boss Michael Scott?",
            "If he is still doing this, and you are in the US, report him to the federal or state department of labor. If your job makes something mandatory, they are required to pay you for it. Every time. No matter where they force you to meet. I worked at a bank and one of my bosses would insist that we join another department for \"team building\" events. Only he didn't want to pay for them. Turns out, the Dept of Labor said they had to pay me for the time. Also for mileage if I drove straight from work to the event. My boss was quite angry over this. His boss was greatly amused by it. And I got retroactive pay for all the events I had attended.",
            "Is your name Jim and your boss Michael?",
            "Were they crappy karts with a predator motor? You kept it wide open in the corners with braking so you wouldnt slow the motor? Easy to add up seconds for those things to wind back up.",
            "When I was fresh outta college, I worked a couple different jobs with essentially mandatory outside-of-work events and happy hours.  That kind of shit should be illegal",
            "I guess your boss needed that. It is considered normal where I am that such events are either during normal hours paid as normal work or overtime if it is outside of normal hours. And of course, company is supposed to pay for everything excluding alcoholic beverages.",
            "LOL Mandatory unpaid after hours events?  How about mandatory kiss my ass I'm not your property.",
            "> and my boss in full ballerina attire. He had racing overalls, racing boots, gloves and even a custom helmet.\n\nI'm sorry what? None of those items is part of a leotard, tights and tutu set. Yes, I'm being serious.",
            "I’m sorry, i know you said you were a mechanic but by chance is your boss’s name Michael Scott?? Because…",
            "Not sure if id look good in anything",
            "Are you *sure?*\n\nWell I *was*.",
            "Reading the title i was really hoping for this (being a racing fan myself) and i was not disappointed 😁👏",
            "Good thing the source material.",
            "Loved the part about voluntary opt-in?",
            "\"Now it is time for the matador to dance with the blind shoe-maker!\"",
            "I like the idea of it, except for the part where it was both mandatory even if you had other plans, and most of all, that they didn't pay for your ticket. In my world, it's one or the other at the most. If you force me to go to an event after hours, I wouldn't expect to also have to pay for the \"pleasure\". \nThough I would gladly do it if it was cart racing, because that's actually really fun.",
            "Delightfully devilish.",
            "I love this so much",
            "OP wins the Corporate Grand Prix!!!!\n\nGet in there OP!",
            "You'd think you'd be excited to race if you used to do it. Pretty stupid you were forced to pay for your ticket and it was during personal hours though.",
            "Raced karts as a kid as well. I loveeeee when people say hey let's hit the go kart track."
        ]
    },
    {
        "post_id": "9qy1yg",
        "author": "twinsisterjoyce",
        "title": "\"Please change your facebook review to a positive one\" ok.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9qy1yg/please_change_your_facebook_review_to_a_positive/",
        "score": 22335,
        "num_comments": 362,
        "created_utc": 1540373032.0,
        "selftext": "A few years ago i bought a new shed/sunroof combination for my garden, it was pretty expensive and thus i also paid for the company to build it. Knowing me, i would mess up so i was happy to pay for a professional to come fix that for me.\nThe shed has a roof with a bitumen topping, it looks like very thick sandpaper. The professional builder tacked it in place and that was that. I asked him if no glue would be needed to keep it in place, but obviously i know nothing and that was a dumb question. Lo and behold, 6 weeks later a mild storm blew off the entire bitumen topping of the roof. \nI called the company only to be told i should have known this would be a temporary roof and these need to be changed like every year. (Can you smell the BS?) I replied it has only been 6 weeks, you need to come fix this. Nope, a storm was the reason for damage, act of god, no help from them. Well ok, they promised to send a new roll of bitumen so i could replace it myself. I waited, no bitumen.\n\nI went to their facebook page to find lots of people complaining about similar stuff. I wrote a review warning people to not buy their expensive sheds as they get built wrong and any damage resulting from this does not get resolved by them what so ever. (Mind you this shed was over a 1000 euros)\n\nA half an hour later i get a phonecall from said company. They tell me they will come the next day to put on expensive shingles to make up for the damage, at their own cost. BUT i do have to change my review. I waited for them to come fix it, and they held to their promise. So did i.\n\nI wrote on their page how they came and fixed my roof, even exchanged the material for a much more expensive solution, the very next day, at THEIR OWN COST! Needless to say this caused a sh\\*tstorm of customers demanding the same solution. \nYou're welcome, assh\\*les.\n\nTLDR: company messes up their own product, refuse to solve the problem. Only want to resolve it after an angry review on their facebook page. After they resolved the problem i changed the review to a very positive story, resulting in many many others demanding the same.\n\nSince people keep asking; yes they came to fix the roof.",
        "permalink": "/r/MaliciousCompliance/comments/9qy1yg/please_change_your_facebook_review_to_a_positive/",
        "comments": [
            "Penny wise, pound foolish (in a way). They wanted to save every nickel and dime in the original work but ended up having to fork out more expensive resources so as not to let the scathing reviews damage their company image.\n\nShould’ve just done the work properly in the first place, then. They deserved the loss in having to put things right for the other customers.\n\nEdit: Thank you to all who pointed out that it was my cake day! I hadn’t even realized :P",
            "I swear I get turned on reading these. ",
            "You’ll want to write ```\\*``` instead of ```*```, so it won’t put the text in italics",
            "It was cold wasn't it?  Asphalt shingles have to get hot enough to slightly melt the tar strips on the bottom before they stick together properly.  That is why the vast majority of roofing is done in the summer.  If it is done on a cold day you have to heat them manually.",
            "They were probably expecting it though, after very likely firing some people and blacklisting a contractor. They asked the review be changed, not removed.",
            "[deleted]",
            "I almost had a similar experience with Frontier Communications. Frontier Communications is an internet and cable company that in my opinion, is the worst company to ever deal with. In my personal case, they offered me wifi that they promised would go for speeds of 25 MBP. I only recieved around 6-12 MBP. Download speeds for 1gb movies and game updates was about 1-3 hours. They claim on their website that you can recieve cable internet or dsl internet. When I called them they told me only locations they decide can recieve cable internet and other \"special offers\" \n\nOn the installation date they told me between 2-4 the technician would arrive, but he came around 7. It wasn't even the Technicians fault. He stated the company refuses to let him work earlier. So he has to be in by 12 or 11 but he can't work until 1pm. He also had to deal with an issue that took 1 hour. Yet the problem was the company refuses to relieve him of his route and give the other routes to other technicians. This way someone else could of came to install the internet. \n\nThe first two days were find, I didn't expect what happened next. For the next 3 days the internet kept turning on and off at random times a day. Since I am a nerd and love technology, I can easily access the router and do alot of configurations and fix issues, so I checked the router and honestly, the routers are not the problem. Every time I lost connect it was the fault of the company. From their end, the connection kept falling. However, being the young foolish man I am, I called the company. You would think it would be quick and painless, right? Nope, I spent about 3 hours on hold waiting for some one to pick up. When they did pick up, they told me to hold for another department, so I would wait for another 1-3 hours. Then they had the audacity to tell me it's a problem on my end, when I'm clearly on my routers admin page and can see it states the connect is disrupted, and it's being disrupted from its origin point, aka the company. \n\nFor others it's worse, they sign contracts and could be charged up to 200-400 for cancellation fees. They recieve only 1-2 MBP. \n\nAlso, the customer service is horrible from what I heard. In my case most were respectful, except this one lady with a disgusting attitude.\n\nWhen dealing with companies like the one you dealt with and the one I dealt with, it's best to look at reviews. Also while on the topic of companies, avoid FYE at all cost. They scam you by using your credit card without your permission to subscribe you to magazine subscriptions and a V.I.P. access pass. My mom has called 3 times and the first 2 they claimed to cancle everything. One more time and I am going to seek legal experts and see if we can sue these bastards hard. ",
            "I wonder what kind of bitumen shingles they used then. At least the ones I have seen used (hell, goes even for the rolls) have needed this wax paper removed from the underside because they get glued on place by heat from the sun melting whatever gluethingy is there already.",
            "I used to work in a manufacturing plant that made bituminous roofing and I will say that the type of roofing you are describing is most likely an ice and water guard. If this is the case it is not designed to be the top layer of roofing. The product is popular in cold environments. You put a layer of the ice and water guard on and shingle over the top. This prevents ice build up in the edge of the roof and will protect the plywood underneath for longer than just installing shingles. Just a PSA for those trying to save a buck and just installing this on your roof. ",
            "Perfect.  Absolutely perfect malicious compliance, because you did EXACTLY both what they said and what they wanted.  They can't even claim it was malicious even though it was because it's exactly everything they could have asked for, just not the results they wanted.",
            "My dad had a sunroom added on the back of his house, with the sunroom roof tied into the existing asphalt-shingle roof.  The old overhang on the back of the house was left intact, just inside the sunroom now.  A few days after the job was complete, they got some moderate rain;  one of the skylights leaked, and there was also a steady drip from the corner of the old overhang.  The company came back and fixed the skylight installation, and discovered that the leak from the overhang was actually prexisting - a detail of the existing roof had been done incorrectly several years prior, causing water to get under the shingles and down inside the overhang, to drip at the corner.  Nobody had noticed until the sunroom was added, because no water came inside the house.  It had nothing to do with the sunroom company's work... but they fixed it anyway, for no charge.\n\n&#x200B;",
            "Sounds like they blew it",
            "Goooood!",
            "€1000 for a shed?! Does it give out blowjobs or something?",
            "Wait, I thought Europe had extreme regulation that prevented this fly-by-night BS?",
            "Nice one! ",
            "hope you edit your review again after to note their bullshit practices!  \n even if you got a new roof, they should have NO more customers!",
            "Bubbles? Is that you??",
            "We do. But it is pretty hard to actually get your rights. I could have gone to a consumersorganisation, that would have been the next step.",
            "Nope its called bitumen. Its tar mixed with gravel on a sheet of plastic.",
            "Well played, twinsisterjoyce, well played!",
            "Nice! See I'm such a stickler I probably would've stood my ground and said no, and would end up getting screwed in the end. Your method used honesty and compliance as a weapon!",
            "Ahhh this gave me a justice smile.",
            "Well done. You should cross-post this in r/prorevenge\\+1",
            "Usually when I get asked to change m reviews to a positive one I say something along the lines of \"and contacted me *personally* so I could change my rating which really shows that they care about their customer's opinions.\" What you did is way better",
            "I have come to the conclusion reading stories like this that the only way to get incompetent people to *do* anything is to either cost them money or embarrass them publicly.",
            "Even better, the review was entirely truthful, so they couldn't complain about a fake review.",
            "I will never understand companies that even remotely think this is a good idea to do.  Build it right or find another business to be in.  You will make more money in word-of-mouth advertising, and a lack of revisit repairs, than you will ever save on cheaping out on materials.  One lawsuit... that's all it takes... and your profits for a year or more are gone.  Don't be idiots... do it right.",
            "An act of god? I always thought storms were an act of clouds.",
            "Fonteyn. They did have some changes in their company after a huge fire, but what i can see is the customers still get treated as shit.",
            "Do you mean felt roofing? Because it doesn't need glue, they just must not have used enough tacks and the wind got under it.\n\nEdit: why downvotes? He says it's like thick sandpaper which sounds like felt roofing, if so I've done dozens over the years and they don't need glue.",
            "This is brilliant. My favorite malicious compliance yet. Pure, 100% honesty. ",
            "GHO or JEHO should be your new official title.  \nGenius of the Highest Order or Justice Engineerof the Highest Order.",
            "So what's the name of the company if you don't mind me asking?",
            "This is the best one I've seen in a while. Well done!",
            "Did they mess up your product though? It’s not hard to put a roof on a shed properly, you have to try if you wanna fuck it up.\n\nGetting it ripped off in a storm seems like fair game really. ",
            "The ending made me laugh so much, I needed that, thanks",
            "This is great.  Textbook MC.",
            "Great compliance OP! Can someone clarify what a bitumen roof is? Asphalt shingles? Tar?\n\nI cant imagine people but unprocessed bitumen on their roof...",
            "The justice boner.... So goooooood ",
            "Was this Carolina Sheds?",
            "I love this! Well done you! ",
            "No, a dutch company.",
            "justice boner",
            "Doin' the lords REAL work. Good on ya.",
            "Haha awesome",
            "I like it!",
            "^(wow I am astonished)",
            "There are. I would have complained to a consumers organisation if they hadn't resolved the issue. ",
            "Damn. Hopefully they don’t try and get retribution. ",
            "What a lovely and positive review. *snerk*",
            "I still can't tell if they came to fix the roof or not.",
            "[deleted]",
            "You did the right thing. Fuck companies who screw over their customers!",
            "That is beautiful",
            "My wife and I are going through something similar with Netgear customer support right now. After countless phone calls and literal hours on the phone with no real resolution, it took negative reviews and comments on Facebook and public forums to finally get them to take our complaints seriously. I'm glad that they're *finally*, after three months, offering a solution that starts to make things right, but I can honestly say that this is the last Netgear product I'll ever buy. The customer service experience has been abysmal.",
            "They replaced a sunroof with shingles? And you were okay with that?",
            "It worked out in this case, probably because the company was small enough and in financial trouble, but be aware that a lot of companies aren't going to go to these lengths to fix a bad review. \n\nIt's always a good idea to call the equivalent of consumer protection in your country as well, who will apply pressure to fix the situation.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/screwyoublessthem] [\"please change your Facebook review to a positive one\" ok.](https://www.reddit.com/r/screwyoublessthem/comments/9r3jyc/please_change_your_facebook_review_to_a_positive/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Great story, and is the shed situation resolved? If not let me know where you live i might be able to help you out (work at a hardware store myself)"
        ]
    },
    {
        "post_id": "lsjs97",
        "author": "janethebrain1298",
        "title": "I took it all",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lsjs97/i_took_it_all/",
        "score": 22282,
        "num_comments": 750,
        "created_utc": 1614294967.0,
        "selftext": "My boyfriend and I broke up a few months ago, but there have been complications with the apartment because we are both on the lease, and blah blah blah. But I found a new place to live and moved out last weekend. I got the important stuff out, but there were still a few small boxes left and I didn’t go through the kitchen because I didn’t know what my new roommate had. My ex helped me move, and everything was going very well and we were being cordial. \n\nWell, last night, my ex asked me to come over to pick up a few of the small boxes that were in the closet, and to say hi to his dog who was sad that I was gone. So I go over there; we are hanging out. I play with his dog. Everything is good. Then I asked him if he minded if I took the dish brush because my new house didn’t have one. I asked because I bought this dish brush just a couple weeks ago, and I even splurged on a nicer one (like $5 lol). \n\nSide note: I am the only person in our relationship who ever bought household items like this. I just moved into a new place where the rent is higher. I’ve had to pay for a moving truck, and all the other little things associated with moving somewhere new. The last thing I want to do is go to the store and drop another $50 or so buying a bunch of little things I literally just bought a couple weeks ago. \n\nApparently asking for the dish brush triggered him, and he made the ridiculous dictate (at 8 pm on Wednesday, mind you) that I could take anything I that’s mine TONIGHT, but anything that was there when I left THAT NIGHT would be his property now. \n\nI, annoyed, said no, that I don’t agree to this. I immediately said the dish brush was not a big deal. I told him that I did not come prepared (with boxes, bags, etc) to get everything I wanted from the kitchen.  I said I could do this tomorrow or any other day of his choosing. I begged him to compromise. I told him I wouldn’t take the dish brush or anything that he said he wanted. However, he only tripled down, and refused to budge from his ridiculous demand. \n\nSo I became very irate. I told him that if he was going to make me move all my dishes out in plastic trash bags tonight, that I was going to take every last thing that was mine. Again, I am the only person who ever bought anything like pots, spices, utensils, cleaning supplies, etc. I was planning on leaving most of it with him because my new roommate already has a lot of this stuff, but I decided that if he was going to make such a ridiculous rule, then I would take it all. I took the dish brush, the sponges (used and unused), all my spices, the soap, the utensils, all the pots, the Tupperware, the toothpicks, the toilet paper, the pillows, the wall hooks, the coat hangers...I even took the light bulbs. I took it ALL! \n\nDid I yell? Yes. Was I petty? Absolutely. But I think it is quite petty to make a demand on the spot, that everything I don’t take tonight becomes his when this was not the pretense under which I came over, and I was obviously not prepared.",
        "permalink": "/r/MaliciousCompliance/comments/lsjs97/i_took_it_all/",
        "comments": [
            "Omfg I did this to roommates once. They were awful, never washed their dishes, something was broken literally any time I left the house, they'd leave food mess in the kitchen for weeks, etc. One day me and one of them got into it and she yelled \"everything in this house is YOURS, that's yours, and that's yours, and everything in there is yours,\" etc. Mind you, this started because I asked if she knew who broke the pantry door from its hinges. I'd like to add that the reason \"everything was mine\" was that none of them had ANYTHING moving in, and came up with excuses as to why they couldn't get something, like a broom or lamp.\n\nSo I looked around and thought \"yes. yes, everything in here IS mine.\" So I moved out a month early without telling them. I paid my share of rent for the last month, and my share of the other bills was up to date, but I moved out with all my stuff while they were at work.\n\nThe dishes, living room furniture, kitchen table/chairs, cleaning supplies like broom, mop, and vacuum, the floor lamps in the living room that had no wired lights, the washer and dryer, the internet router (I canceled the internet that was in my name after all), toilet paper and paper towels, garbage bags, garbage cans, shower curtains, plunger... Basically anything that wasn't in their own bedrooms were mine, so i took them.\n\nPetty? Yes. But it sure felt good",
            "He can buy it back at your garage sale.",
            "I found out an ex was cheating and moved out while he was at work.\n\nI found out he was cheating with like 3 months left on our lease. We decided he'd move into the 2nd bedroom (what we were using as an office) and his new gf wouldn't be allowed over until our lease was up. That lasted a whole week. I told him since she's not on the lease she can't stay at our place. He argued he'd just take me off the lease, as a threat, bc I have a fear of being homeless from childhood. I called his bluff and he did it the next day.\n\nUnbeknownst to him I had actually pre-emptively been looking at new places closer to my school so I could give up my car (I had been looking with some friends). We found a super affordable house that was ready sooner than I thought we needed, but I called the guy and he approved the 3 of us and we got the keys. So a couple days of being taken off the lease, I started my move. Moved all my bedroom stuff out first so he didn't notice. Then the 2nd day while he was at work my friends and I took EVERYTHING. I was actually too naive to do it - one of my friends just started packing up things I was going to leave.\n\nOne of our last arguments was that I should pay for more of the toilet paper bc I'm a girl. He made $80k/yr and I was going to community College and living on savings, and everything was 50/50 because \"I had cats\" and I was young and didn't know better... Even though all of the furniture was mine. He didn't like to clean and ate frozen meals or off paper plates, so I had to pay for 100% of cleaning supplies too (and do all of the cleaning). To not deal with arguments, I just bought all the toilet paper too. \n\nShe ripped the shower curtain down even though our new place had glass doors in the bath. Rolled the toilet paper off the wall and took it. Put the sink Sponge in a ziploc.\n\nLiterally the only thing left was his computer+desk, his clothes in a pile (I bought the hangers, the guest bed, and guess dresser) and one mug. 🤣🤣🤣\n\nAlso, the girl he cheated on me with and moved into the apartment was banging her meth dealer and using my ex as a gravy train for her + her dealer. He paid all of her bills and came over on my birthday a couple months later to \"drop off my mail\" / gloat how she cooks and cleans \"without fights.\"\n\nAbout 6 months later he calls me freaking out. She stole all of his new furniture and emptied his bank account.\n\nLook at God.",
            "Even the lightbulbs, hilarious.",
            "He invited you over “because the dog was sad”? Nah, he wanted to have sex with you one last time and got pissed when you started talking about dish brushes instead!",
            "When I was going through my divorce,  the judge awarded him possession of our home, and me, possession of everything in the home.  I was so angry.  My sister, BIL, and I rented a uhaul and loaded Every. Single. Thing.  I took all the furniture except for our bed. That caused a fight and it ended up being left on the neighbor's lawn.  I took the toilet brushes, toilet paper holders, even the thingy you use to squeeze all the toothpaste out.  He got the walls and the roof.  I wish I could have seen his face when he went inside to nothing!  ...good times!",
            "I’ve done this before. I had an extremely passive aggressive roommate who lied about me to the landlord and tried to get me kicked out. My sister and I decided to get an apartment together and I only told my landlord I was moving out when the lease was up. I ended up paying double rent for one month but it was worth it because as soon as my new landlord let me know I could move in I packed up all my stuff that night while my roommate was sleeping. \n\nMy roommate was always so cheap and would refuse to contribute anything to the house and would even refuse to buy lightbulbs for the bathroom. (We showered in the dark for a couple weeks before I caved and bought them).\n\nI took everything that night: the table and chairs, the pots, the dishes, the dish soap, the lightbulbs, furniture in the living room, etc and put it in my room. I even put my all my groceries in a cooler outside because it was the middle of winter in Utah and there was enough snow outside to keep them cold. \n\nThe next day I got a text from the landlord saying my roommate accused me of stealing some of her things. I told him to call the police and we can talk about it because I took absolutely zero items I didn’t purchase myself. They never brought it up again. I moved out with all my stuff that day and I wonder what poor soul had to be her roommate next.",
            "Hope you took the doormat. People always forget the doormat.",
            "[Did you get the ice cube trays?](https://m.youtube.com/watch?v=MA86SuA2qFM)",
            "> I took the dish brush, the sponges (used and unused), all my spices, the  soap, the utensils, all the pots, the Tupperware, the toothpicks, the  toilet paper, the pillows, the wall hooks, the coat hangers...I even  took the light bulbs. I took it ALL! \n\nEven the last can of [Who-Hash](https://youtu.be/Z_SFt_WNHfU?t=145)?!\n\nSorry, not trying to call you a Grinch. I agree with your actions. That list just gave me a flash back!",
            "Ooo my sister did this once.  He was not a good one.  When they broke up suddenly everything she had every bought for the apartment was gone.  He was shocked his apartment was left bereft of any life or interest because of course she was the one that added anything like that to the place.   He was upset and claimed that she had bought that stuff for him - gifts you know?  They weren’t gifts.  He was sadly very mistaken. \n\nNope.  You act like a jerk you don’t get to keep anything that’s mine. \n\nI don’t have quite the shiny spine of my sister.  Someday though.",
            "I would bet a million dollars that he was pissed because what he wanted was for you have sex with him, not ask for another item separating you further.",
            "It's not petty if it's your purchases. Good for you getting out of there with all YOUR stuff!",
            "You learn who they really are when you leave. Partners & bosses.",
            "What was his reaction to your pettycompliance",
            "Good for you! Hope he thinks to go get TP before his morning poop",
            "Petty, though funny as fuck! 😀",
            "Good on you! I found myself in a similar position years ago with an ex who told me whatever I didn't take that night I couldn't come back for. So I took everything that was mine and would fit into my car. All the linens, cleaning supplies, cooking and eating utensils, toothpaste, soap, extension cords and power boards.",
            "Had an ex pull this move. We worked together, he dumped me on my birthday because I didn't want children. At work in front of everyone about 2 weeks later (i'm living on a friend's couch, all my belongings that I could fit were still in my car) he asks me to \"get the rest of my stuff soon because it's making it hard for him to move on.\"\nKnowing he was going to be at work the next 6 hours, I called all my friends and we emptied the apartment. My huge ass TV he had used to play video games, my dishes, even the fucking shower curtain. \nFuck people who pull shit like that.",
            "Bruh I was done with my roommates leaving the kitchen a mess when everything in it was mine. For whatever reason, they kept forgetting this. So I left a few weeks early very last minute and they had no silverware, no dishes, no cooking supplies. All during finals month.",
            "It sucks, but he did you a favor by revealing his true feelings.  Now you have a clean break and know where you stand with him.",
            "Waiting to see his post about his crazy ex who took the lightbulbs when she moved out",
            "You’re like the grinch but for break-ups! Lol Did you even take the last can of who hash?",
            "SHE EVEN TOOK THE ROAST BEAST",
            "I had an ex do this to me. Except I didn't demand anything of her. I actually would have taken her back. She came by while I was at work and took all the kitchen stuff. The only stuff that was actually hers was the pots and pans set that her parents gave her for xmas. She took all the kitchen stuff leaving me with nothing. But she forgot to grab a bunch of other stuff like her tv, turntables, some gym equipment she had, tones of makeup and various feminine products. I attempted to call her to get her to pick up the rest of her items making a point to mention that I was not happy that she didn't even leave a plate and fork for me. I didn't say just what stuff she had left behind. She didn't call me or text or anything. After a week or so I called a mutual friend to ask her what the hell I should do with her stuff. Friend comes back and says \"she says if she left it behind she doesn't want it\", I almost immediately put her stuff up for sale or for free. I had gotten rid of it within a couple weeks. Maybe the day after I got rid of the last of it she sends me a message to leave the rest of her shit outside in boxes. I told her I tossed it as soon as she told our friend she didn't want it. She freaked and started to tell people I had been stalking her and such. Saying I had been abusive for our entire 6 year relationship. When she was the one who was cheating on me. She is honestly the worst person I have known now. Iv had people come up to me since to apologize for believing her shit after she fucked around on them.",
            "When you can't argue fair, you deserve what you get. Sorry you were in a relationship with a child and hopefully things get better.",
            "I did this exact thing with my ex. Took all the toilet paper. And the paper towels. And the towels. And washcloths. They were *mine* after all.\n\nIt gave me great pleasure to think of him taking a morning shit and having literally nothing to wipe with.",
            "She took the Who’s feast, she took the Who pudding, she took the roast beast. She cleaned out that ice box as quick as a flash. Why,  she even took their last can of Who hash.",
            "How The Grinch Stole: Nothing Because It Was Theirs To Begin With",
            "....and that’s why he’s your EX boyfriend!  Good for you.",
            "This is amazing, gives me big “I’M TAKING THE DOG, DUMBASS” vibes from Legally Blonde. \n\nAnd speaking of legal, you typically have 30 days to remove belongings from a vacated lease (at least where I live). If there was anything you needed desperately you would’ve been able to retrieve it!",
            "Lmao I literally just went through something like this, the crazy is going around! When he put unreasonable restrictions on how much time I had to get my stuff then I was like fuck it then I’m taking everything lol. Good riddance and good luck! 💕",
            "Well this just goes to prove:\n\n&#x200B;\n\n\" The idiom to **cut off your nose to spite your face** means  you shouldn’t do something out of spite or revenge that will end up  causing more harm to you than to the person with which you are angry. In  other words, do not let your overreaction lead to self-harm. \"",
            "What your ex was trying to avoid was an endless needling of \"I bought that, I'd like it back\" and then two days later \"This was mine, I need it\" and then two days later \"I bought this, I'm taking it back\" and so on.  He absolutely overreacted, though.\n\nI've been there, only I was the one who had bought most things and had packed up the girl's stuff and left it in boxes at the front door for her to move out.  She insisted on doing her own once-through before the door closed for good.  She went through the entire apartment but couldn't find anything.  I had very neatly split her stuff and mine with surgical precision.  She had to call out *something*, though, so she decided a *whisk* I had left in a drawer was hers.  I didn't argue.  I let the whisk go.",
            "Not petty at all...when I went back to where I lived with my ex (out of state), I took EVERYTHING that I bought,  even hand soap because like you, I was the only who bought anything house related.  Spices too.  Took it all. Good for you!",
            "I did the same when I moved out from my ex's house he was left with a bedsheet because it had a hole in it and the cabinet we split purchased at target because it wouldn't fit down the stairs",
            "I once had to move out of an apartment I only had moved in 1 year earlier. My landlady’s adult son moved in.\n\nthis annoyed me a lot because I had bought a lot of stuff extra for this apartment. It had very high ceilings, so new expensive curtains, different hanging lamps, I installed a new showerhead, a longer satellite cable... the floor in the kitchen had holes in it so I paid somebody to put a nice pvc floor on top of it. I changed the light switches (and luckily kept the old ones). The toilet seat was broken, I bought a new one (didn’t find the time to throw it away, so the broken one was still in the basement).\n\nI had thought I would stay in this apartment for a very long time.\n\nSo when it got to the point that I was moving out, I asked the son if he would give me some money and I would leave the stuff behind, everything I wouldn’t be able to use in my new apartment. I wasn’t greedy, the amount was low and I find rather generous (maybe 2% of the money I had spent).\n\nHe said no and was rather nasty about it, expecting me to give it away for free.\n\nBefore I had moved in, I had filmed every single room in the apartment, so I had proof what it had looked like before.\n\nSo yes, I took every single item I had bought and installed, I even put the broken toilet seat back on. And yes, I also removed the lightbulbs. I had to pay to get my nice kitchen floor removed, but I think that was worth it. I donated it to a local kindergarten they cut it up for some crafts projects.\n\nThe look on his face when he realised that he didn’t even have a showerhead 🤣🤣🤣\n\nSo worth it.",
            "play stupid games, win stupid prizes.",
            "I wish I'd done something like this when I split up with my girlfriend. She was not good to me in the end but I still loved her so didn't want to do anything to make her life harder. She did not return the kindness and when I got home on the day she moved out virtually everything was gone. I even let her keep the cat. Three years later I still miss the cat but have nothing but bile for her. I should have just told her to get fucked and kicked her out, but it's never that easy in the moment.\n\nIt's taken me about this long to get my life back to where it was.",
            "Should have taken the dog",
            "The wall hooks?",
            "Even the light bulbs. Brilliant. I love it.",
            "An ex-roommate donated all of my mismatched thrift store SPOONS to the college cafeteria when she moved out. They did not match the plain cafeteria flatware, so for the next two years my friends and acquaintances would randomly hand me a spoons in the dining hall and laugh.",
            "Good for you, but technically i don't think he can claim your stuff without giving you a reasonable deadline.",
            "It seems pretty clear that he was hoping that you coming over might lead to the flame being rekindled, and when he realized that you were still done with him he was hurt and lashed out. Was he immature about it? Absolutely. But breakups suck and when people are distraught it can bring out the worst in them.",
            "Good for you and you cleaned his apartment too lol",
            "Did anyone else think of the Grinch that stole Christmas when she was listing the things she took?",
            "According to your post, you asked him multiple times (even describing it as begging him) to compromise and he refused. That completely justifies calling what you did anything better than petty.",
            "I was sharing a duplex with two other guys whilst in grad school. I had been visiting my parents and was coming back and was keen to watch the Mets playoff game.  The guy had  his girlfriend over and were watching a movie in the Living Room. But I want to watch the Met's game. And its my TV. So I took it up to my bedroom and watched the Mets game.  \n\n\nThis was the same guy who said: We have a 3 bedroom duplex but two people could share the Master bedroom and still pay 25% each. I am thinking \"no way anyone would do that\"...I took a room, we found another roommate, and he and the other guy ended up paying the same amount to share a room.",
            "I am browsing reddit while I breastfeed my 9 month old back to sleep. May not have been the wisest choice. I laughed out loud so hard I woke the baby back up! 🤦",
            "Reminds me of me leaving my first student home a few years ago. The new tenant agreed to taking the floor (and paying me for it) and to taking the fridge. Which means I got a bit of money and didn't need the hassle of the removing the laminate floor. The day before he is supposed to get the keys and also the day I have to give the keys back, he let's me know he won't but the laminate and fridge, but would be okay with me letting it there. He probably wanted it free because well laminate flooring is expensive. So I decided to remove everything from the house: I removed the laminate flooring, the under flooring part, the fridge, all the light bulbs, even the curtain rails, even the rails in the bathroom and the shower curtain. Took me a while but I was very happy leaving the keys after that. Too bad I couldn't see the new tenants face though.",
            "When I moved once, my roommate/landlord threw a foot when he saw that I took the dishwasher tabs I had just bought the day before, and the trash bags too. I didn't leave him without anything, I left 3 bags and 3 tabs to give him time to go buy his own. \n\nHe was fucking livid, over dish tabs and trash bags that I bought. He was adamant that I had bought them for the house, not myself.",
            "I did something similar years and years ago.\n\nIt was a pretty rough breakup with the girlfriend and she'd given me a window that she's be out to get all of my stuff.\n\nI went in with the mindset that I'll be taking pretty much everything since it was all mine but as the day went on I just wanted to get out so I grabbed all my personal items and the stuff already packed and left.\n\nLater that night I got a call from the ex screaming at me for being petty..... it turns out I unintentionally taken the cutlery, but left the plates. Taken the dining table, but left the chairs. Taken the bed frame but left the mattress. Everything I initially started packing had a counterpart that I left behind.\n\nI think that brought me more joy than taking everything would have.",
            "Honestly? You helped him, majorly. He *wanted* you to erase any hint of your existence from his daily life. Immediately. And you helped him do just that. This will just allow him to forget you faster and move on sooner.",
            "Win. \n\nAnd he’s going to have to remember this because he’s going to need to run to the store in asymptotic format. \n\nFirst he’ll need to run to the store and do a big shopping, probably 2-3 in one week. \n\nThen he’ll forget something, go again. \n\nSo basically it’ll go like this\n\nStore visit 2-3x in 1st week\n\nStore visit once a week or two later \n\nStore visit the next month\n\nStore visit the next month  \n\n3 months later will need something again\n\n6 months later the same\n\n9 months the same\n\n16 months later he’ll need another thing you took that he forgot about, like a hook o something\n\netc \n\nA long-term win",
            "Someone else may have already mention this but, his reaction wasn't just because he was being stupid and intractable.  Dude was trying to win you back. Plain and simple. He used the pretense of the dog missing you to indicate that he was actually the one who wanted you back.\n\nYou asking for the dish brush meant you were moving on.  He wasn't prepared for it, so he lashed out.  Probably didn't think you'd actually call him on it. \n\nSome people just can't seem to express themselves in a healthy way. Obviously your ex didn't and left you wondering what the hell just happened.",
            "Sweety he wanted to bang you and threw a tantrum when you started talking about your stuff instead of falling for his game.\n\nThe dog was sad... Sure. \n\nYou did great this is the finest thing I've read this week",
            "I was hoping you also took the dog.",
            "Girl you are not petty for taking all that stuff YOU bought, like wth what did he even buy.",
            "and his bellls and bandangles",
            "You stripped it like the Grinch did the Whoville Christmas... Excellent!",
            "You were right to take all of your stuff. But, in any breakup, the best option is to get out clean and quick. Multiple trips make the break agonizing for both sides. He was not going to want you to keep coming back to pick up different things. Yes, I know he played the “my dog misses you” line but I think it was pretty obvious that it was meant to be a trick. When you asked for the brush, I think it became clear to him that the break was real. Once it was real, he wanted you out 100%. My guess is he didn’t care about the brush or plates.",
            "There is something about breaking up and moving out that triggers the other person to just revert into a spoiled child once they realize you really are leaving.  I will never understand how or why but in EVERY situation where I've moved or helped a friend move, the other person always saves their insane antics for either the last day of moving, or until there are literally one or two boxes left. Hence why my new rule is that if two people break up and I'm helping with the move, we move everything in one day. Even if it's being temp. moved to a storage facility. Everything goes in one day and there will not be any \"oh you can just get it tomorrow.\" No. Because 9/10 I promise you \"tomorrow\" the locks will be mysteriously changed, the apartment will mysteriously flood, they'll tell you someone broke in and only stole your stuff, or tomorrow will be the day they decide that they wanna be petty and not open the damn door or throw your stuff outside.",
            "I did this, sort of, when I moved out of my apartment I shared with my (now ex) husband. Moved out personal items the day before, and while he was at work, packed up the rest of the apartment and left. I left all his things, most of the furniture, but took all the kitchen items as he never cooked once. I registered for all those things for our wedding, and wrote every single thank you note for all our gifts. Wasn’t about to leave them behind. \n\nGot a call asking why I took all the kitchen stuff and only left him with expired food. He couldn’t cook anyway, and I love cooking. Also, don’t cheat on your spouses and then gaslight them into thinking they’re crazy. He had it coming...",
            "I had a live-in boyfriend (actually fiance) once that took a lot of pride in his clothes. He started getting progressively mean to me, and I had suspicions that he was cheating on me.\n\nOne night after a big fight he told me he was \"going out\". He never came home, even though it was a workday. Before I went to work that morning, I called him several times - called his buddies. No one answered except for a mutual friend who told me that I should \"ask him where he stayed the night\".\n\nEven though I was going to be late to work, I took ALL of his clothes - even his suit and dirty laundry in the chute - and put them in trash bags. I then packed up all the bags in my car and drove to work. I left them in the alley of my workplace. He called at noon asking where all his stuff was and I told him to ask the bums in the back alley behind my work.\n\nWas it petty? YES! Did it feel good? Absolutely!",
            "My friend came home to an apartment he had shared with his girlfriend. She left him and took literally everything, even the light bulbs in the ceiling lights.\n\nlol.",
            "I would have taken the dog too ...",
            "My story is a bit different. I'm a nice person with a good heart. I'm a cancer, I blame it on that lol. Well, i let this girl stay a couple of nights at my apartment.  I met her through a acquaintance I previously knew. Well this girl gave me this huge sob story about how she lived with her sister but shes always kicking her out and the sister petitioned for her kids, they are fighting this, her and sister make up, she moves back in but couple days later she is kicked back out. Idk something more is going on with that. Anyways, this girl will randomly show up at my apartment crying asking for a shower and a warm place to lay down. So I let her. Well then it starts becoming more frequently and more nights. So, I have a 2 bedroom and the second room belongs to my daughter. Shes at her dads till summer and she will be coming back home with me full time. I guess I didn't notice that whole she was  coming and going she was slowly moving her things in. I dont go into the second bedroom and I don't when shes here. (I dont want her to think I'm like going through her things or anything like that, plus I don't like being all up in someone else's business). So, working and not checking on what's going on, this girl has done made herself at home here. She's starting to bring people over, leave with them, or have a couple different men coming over. Guys... I have just let a damn prostitute into my apartment. So, I tell her no, this isn't working out. This isn't what I agreed to, you have clearly overstepped the boundaries of my genuriosty and hospitality. She started acting like she was all gangster and hard, telling me that I had to make her leave and what kind of person am I. So, this goes on for a couple days.  She told me that she would get out when she was good and ready and had someone to come get her and her things. My neighbor was telling me that she was always leaving after I would leave for work and she would always show up a bit before I would get home. So I got a idea. I'm done playing game with this bitch. She thinks she is going to continue to lay up in my home and try to bully me. I don't think so. So, my neighbor was right, I had \"left\" for work and instead i parked a couple buildings downs where I had full view of my front door and that. It wasn't 20 minutes later she climbed into the back of a uber and left. As soon as I saw the uber turn onto the main road I had no time to waste. I rushed back to my apartment and the FIRST thing I did was changed my locks. After I changed the locks I relaxed a little bit. I however went into my daughter's room where she had taken up the unwanted and unwelcomed residents, omg, she had trashed the room. There was burn holes all over my daughter's bedding, mattress, stuffed animals, and the carpet. She had taken a sharpie and written on the walls, scribbled on the walls. She had taken my daughter's tablet and her xbox and had it in a duffel bag under the bed. She either threw something at the tv or threw it down bc that's what it looks like when you turn it on. So, after I packed up all her shit, I sat it out the front door and proceeded to call the police and request a officer to come out so I could make a report. I pressed charges against her for destruction of my property, I found drug paraphernalia and she had left a app on my daughter's tablet that showed her actively prostituting herself. I swear it couldn't have been planned any better but just as the officer was looking at the tablet, she SHOWED UP!! She saw her stuff outside and began beating on my door telling me get my ass out there, to open the door before she comes in and beats my ass. She turned around and decided to climb through my window. Omg, I couldn't believe just how awesome this was for me. I wish I had a camera to take a picture of the look on her face when she looked up and saw that officer as she was climbing in. Apparently he had a partner who was outside looking around the complex and was walking up on her after he heard her beating and yelling. He was standing behind her when she tried to climb back out the window. It was most definitely the best \"you got what you deserved\" type of moment for me. Also taught me to NEVER be nice and let anyone sleep over and show up to do it again. So yeah, that's my story. A bit different than the other ones on here",
            "Well done. 👌",
            "Good on you",
            "Just imagining you as the grinch now.",
            "Lol! That’s so awesome I’m happy you stuck it to his ass",
            "Extra points for taking the TP too!",
            "Shoulda walked out with the dog.",
            "He was trying to catch you off guard and take ownership of your stuff cause he knew once you poked the bear of one thing you wanted to take  you might take everything. I’m so glad you called his bluff",
            "Get a short video of you throwing it all in a dumpster and send it to him. Then of course pull it back out of the dumpster",
            "How long did this take and was it hard to maintain that level of fighting for the whole process?\n\nI don't know why I'm so curious about this",
            "> the toilet paper... the light bulbs\n\nWow. Just wow. I applaud you. Evil, but justified.",
            "I bet the dog loves you more than him",
            "Should have taken the dog.",
            "It sounded amicable but you should have taken stuff like pots, tupperware, and utensils as important stuff - they are expensive to replace.  I do wonder what he said when he \"discovered\" that all the toilet paper was gone.",
            "LIGHTBULBS!?!  Good for you :-)",
            "Should have cleaned out the fridge as well.",
            "You rocked it! He asked you to come over to see the dog and grab somethings. The ultimate there after was bs.",
            "I knew a guy who lived with roommates in an apartment that had a washer/dryer hookup but no washer or dryer. He ended up finding a washer and dryer at the dump and repairing them. He set them up in the apartment and everybody had the benefit of in-unit laundry. He bought a house not long after and wanted to take the washer and dryer with him, but his roommates started this huge fight over how they \"belonged to everybody\" and that he was screwing them over blah blah. So, he took the dryer door off its hinges and left with that instead.",
            ">...I even took the light bulbs. I took it ALL!\n\nI just picture OP laughing like a maniacal evil villain and I love it. I’m sure he regretted everything in the morning, probably overwhelmed with emotions and took it out by being an asshole but that what he gets. Good for you.",
            "I was expecting something much different from the title.",
            "What about the pupper?",
            "Go take that dog.",
            "You forgot the kitchen sink 😂👍",
            "I was sure this post was going to be about drugs, but im pleasantly surprised it isnt.",
            "Omg I cracked when you said you took the light bulbs!! And how was he just watching you take EVERYTHING including the goddamn light bulbs?! LOL",
            "When I saw the toothpicks I laughed for real.",
            "I actually helped a friend of mine do this- there were 4 of us- me, a second friend, her, and her boyfriend. Her roommates were positively awful (to the point of getting a cat, even knowing that she is fatally allergic) and we evacuated her last October- we showed up, cleaned her place out inside 90 minutes, and took it all. Her roommates had no idea- everything that was even remotely hers, we grabbed. And the kicker? She paid the majority of bills. And since they contributed to a possibly fatal allergy, I'm pretty certain they were blacklisted from the complex that week. I love stories like this- just absolute pettiness. Because you're not the messenger- you're the deliverer. [Related story via Tumblr (and Facebook)](https://m.facebook.com/story.php?story_fbid=1843270825785175&id=303894029722870&sfnsn=mo)",
            "I did this once with a roommate. I ended up taking the shower curtain and hooks too. There wasn’t another shower curtain to replace it, so I bet that was fun for them.",
            "One of my prized possessions is a pan. It's a very nice pan. It has history. It's mine. I know where I got it from, why I got it. It's got a \"made in\" that isn't China.\n\nAn ex tried to claim it as his. Nope. Made him return it.  He did win on some stupid dishtowels, but whatever.  I've got my pan.\n\nI love that pan. \n\nHardly ever use it, but whatever. Still mine!",
            "Taking the spices is no joke. That shit is expensive.",
            "It being a weird ass demand and me being a dude who's gone through breakups too, I thought I'd try to understand why he acted the way he did:\n\nBro got break up> \nBro sad> \nBro try be cordial> \nBro bottle sadness> \nBro apparently knows not to be a dick and that relationship is over> \nBro feels loss of control because important life event is out of his hands> \nBro understandably internally pissed😡 at situation> \nBro unconsciously create situation where Bro has control (ultimatum)> \nBro would rather loose all stuff than feel without control> \nBro loose all stuff> \nBro more sad> \nDoge more sad\n\nBruh",
            "well you bought them they're yours. **he was ridiculous though** , shame on him for snapping at you .",
            "this is not petty at fucking all",
            "[THE FUCKING LIGHTBULBS!](https://media.giphy.com/media/3o7aCWJavAgtBzLWrS/giphy.gif)",
            "\"I even took the lightbulbs\"...guys, i know OPs true identity now, it was the grinch!",
            "Sounds like he wanted you back and then started being childish when it wasnt happening.",
            "Damn I love this!!",
            "I love you and I am Extremely proud of you.",
            "You’re a wonderful one, mister Grinch 🤣",
            "poor pup, not knowing why \"mom\" left",
            "Did you take the lightbulbs out of the lamps and the half toilet paper roll?",
            "Lmao 🤣 I wanna know the aftermath of him coming home and just realizing he fucked up",
            "love to see that this made it over here from aita lmfaooo",
            "Wahahaha good for you!! Fuck ‘im!!!",
            "Oh, the spices! I have like 100 different spices at any given time. I think I have a dozen different kinds of salt, alone! There is no way in hell I'd just give them to someone, let alone an ex. Good for you!",
            "Yah he got pretty douchey not gonna lie",
            "Petty? Maybe but he started it. NTA.",
            "Happy cake day y'all!",
            "wife and i did the same when we moved out of our roommate situation. we were going to leave a lot of the cookware and such, but they decided to be petty assholes. they started stealing out things, eating our food, using our toiletries, and forcing out stuff out of the house a month before we moved. so we said fuck it and took everything.",
            "you were going to be nice enough to leave him everything but he couldnt give you a brush!? a brush, really?",
            "I wish I did this. Living vicariously through you, sharing that sweet satisfaction of sticking it to an entitled asshole. My ex is still sleeping on my mattress. I hope he has dreams about the other guys I fucked on it years ago.",
            "Ima be honest, I thought I was in a different sub with that title.",
            "this situation turned out pretty fairly. he made a demand, OP (reluctantly) accepted and played to her advantage. both got what they asked for, but necessarily wanted.\n\nEdit: the only one I feel bad for is the dog that was sad that she left. good dogs deserve all the company and love in the world.",
            "Op be looking like the grinch dragging everything out in trash bags.",
            "I love it! Good for you",
            "This feels so like... The Grinch, I fucking love this.",
            "Insert gif of Lucille Bluth: “Good for her.”",
            "Damn good thing you broke up. Sounds toxic af",
            "Hell yea, as someone who hates ultimatums and ALWAYS responds in the worst way to them. I fully support you OP 👍🏼",
            "He was petty.\n\nYou were being solution oriented and pragmatic about the situation at hand.",
            "Even the light bulbs! That's Ross and Chandler energy!!",
            "The lightbulbs lol amazing",
            "Light bulbs!! Kudos.",
            "My ex kept my shirt and sweater lol and I returned everything of hers. Very sad.",
            "if he's gonna be ridiculous, you will be ridiculous, good job on leaving that relationship",
            "So... Not such a cordial breakup then lol",
            "I think you were very fair.  You even taught him a lesson for his life, if he's smart enough to recognize it.",
            "Good shid",
            "Hey! Didn't you post this on FDS too? I'm so happy to see this story getting out, I laugh again as I see it!",
            "She took the ice cube trays! What kind of sick bitch takes the ice cube trays! -Tom Arnold",
            "He wants you to stop coming by. It’s not that complicated. \n\nDid he offer you to help move or did you ask him? \n\nHow many time’s have you stopped by between the move and this event? \n\nIt’s very easy to manipulate a post to make it seem like you’re the victim.",
            "OK\n\nI love it so far\n\nBut...the SEQUEL!!\n\nWhat was his reaction while you were draining the apartment? Did he even open his fool mouth once again?",
            "*\" I even took the light bulbs. I took it ALL!\"*\n\nGood job!",
            "I used to work with a guy that was quite the lady's man.  He was Mr. Cool, late model Mustang convertible (this was early 90s), etc.  He was seeing a woman that we worked with.  He normally got out an hour or so earlier that the rest of his shift, due to a \"modified\" schedule.  One Valentine's Day, he left at his normal time, she left early, about a half an hour after him.  She pulls up in front of his place, only to find him in his car with another woman.  A woman who was his long-term girlfriend.  A woman who he was living with.  Ooops!  He came in to work the next day driving a late 80s Nissan/Datsun piece of junk; the Mustang was actually in the girlfriend's name, so she took it away.  When he got home, she had move out, along with all of her stuff.  He had **A** chair, **A** table, etc.  She even took the roll of toilet paper.  She also moved to Florida.  After a week of begging and pleading, she came back to him, with all of the stuff for the apartment.  He got the car back, but all of his \"[Mr. Cool](https://Mr.Cool)\" was gone.",
            "Even the light bulbs!",
            "I can see why you dumped him. Good for you!",
            "Play petty games, win petty prizes.",
            "Yes! Even the lightbulbs.",
            "I can see why you broke up.",
            "It was never going to work not sharing finances in my opinion I find it weird couples that don’t share money the whole I paid for everything is weird to me 🤷🏽‍♀️",
            "Good for you!",
            "She even took the ice cube trays. What kind of a sick bitch takes the ice cube trays?",
            "Legally he couldn't just take it anyway. There's a long process he has to go through in order to legally claim it.",
            "Definitely MC. Just go back over it and break up the wall of text, clear up the angry typos and I am sure it will be well received."
        ]
    },
    {
        "post_id": "hotr89",
        "author": "Wintertodt",
        "title": "Buy my program when you fire me? No? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hotr89/buy_my_program_when_you_fire_me_no_okay/",
        "score": 22244,
        "num_comments": 1324,
        "created_utc": 1594404083.0,
        "selftext": "Long story short:\n\nI was employed at a rather large factory which is one of the largest plant based companies in the world, recently bought by an investment firm not so long ago.\n\nAnyways, I developed a program which was used at the factory, it could tell whenever any machines were not running, even if it was due to a manual stop or anything else. My program knew the reason why the machine was idling. This program made it so much easier for the entire factory, workers were happy because they didn't need to do any manual work and write down every time the machine stopped.\n\nLead up to about a year ago.\n\nFactory appoints a new chief, all the old employees that were in a leader position was let go because it was time for \"new blood to come in\". There was talk a lot of talk about selling off parts of the factory, including machines and so on. This included programs that I had developed, including the program that identified whenever a machine stopped. I developed this program on my spare time, showed it to the old management and they liked it enough that they wanted to use it on every station in the factory. Every machine was to use this program, all that had to be done was for the program to be maintained weekly. This was around 5 years ago or so.\n\nWhen the newly appointed factory chief wanted to let the the old employees, me included, leave, it was not known that I was the person behind that program. Anyways, at my meeting with HR and the factory chief I said that I was willing to sell them the program and teach someone how to maintain the program. The factory chief laughed in my face and said it was company property and that it was simply \"their program\"  and not mine. I offered to show them the source code and everything but it lead up to the point where if I was to tamper with the program before my departure, they would sue me. I was officially let go, 2 month countdown began and after 2 months I was free.\n\nAfter a week or so, they noticed problems with the program, it would stop loading, stop registering stops and it would mislabel stops. I knew that this was when the fun was about to begin. After a month, I was called in to the office and was told that \"I had tampered with the program because it had suddenly stopped working.\" I let them know that someone had to maintain it. I was ordered to teach someone how to do that job and I told them \"after you pay me for the program rights\". They wouldn't budge and I was told to return to work.\n\nWhen I had a week left, I strolled around the factory floor for a while and noticed that no stations were running my program anymore. I asked some operators why that was and they told me that \"it just stopped working, now we need to fill out forms every time the machine stops manually.\" I shrugged and told them to thank the factory chief.\n\nI left after that week, got a phone call about a month after I left where they begged me to sell them the rights and teach someone how to maintain it.\n\nI never sold them that program, instead I sold an improved version to another factory nearby, where I am now employed.\n\nEdit: I see some are saying that I am in the wrong based on US law, just editing here to let you know that this did not take place in the US. I made the program during my spare time at home on my own computer. After introducing the program to the former factory chief, I was allowed to try it out on one machine and test it. The maintenance was done on my office computer. After a few months I was allowed to roll it out for the entire factory. It wasn't done overnight, lots of debugging to do. I have not heard anything from the company for nearly a year so it would be weird for them to suddenly come after me now. Just wanted to make that clear.",
        "permalink": "/r/MaliciousCompliance/comments/hotr89/buy_my_program_when_you_fire_me_no_okay/",
        "comments": [
            "I've been in a similar situation, except that any tools I develop on my own time to make my work easier live on my home server. I may access them from work, but I make sure my tools are never created using company time or resources.\n\nI automated a process that used to require about four days of data entry down to about two hours of graphic design. The days of tedious work were entirely automatic, leaving me time to make things pretty and customized for each client. The clients absolutely loved this quicker turnaround and the personalized product, so the company started pitching my work as a more expensive tier.\n\nWhile informing me that I was being terminated immediately the company demanded that I leave my tools exactly where they were on company computers. So I did; I left my bookmarks in place.  \nAnd then I went home and moved the tools to a directory that was inaccessible to the Internet.\n\nThey're back to taking days to produce cookie-cutter dogshit.",
            "Good on you. Unless it was the CEO who came forward and apologized with a nice sized check I would have done the same thing.",
            "I am retired from a global manufacturing company. One of the pre-employment forms I was required to sign stated that they would own any patents I received while I was working for them and for a period of two years after my employment ended. Any extra compensation I would receive would be determined solely by the company. This included patents not related to their products. Two months to go and it will expire. Paperwork is ready to go when that happens.",
            "There were really people who thought this took place in the U.S. with a *two month notice* of termination? I'd be lucky to get 15 minutes to clear off my desk\n\nEDIT: We do have the WARN Act that requires 60 days notice for mass lay-offs and plant closings, but OP was definitely not talking about a mass lay-off if new people were brought in to replace the old.",
            "I had a similar thing happen to me at a restaurant I worked at. The kitchen was made for 8 (5 people when not in a rush) but you know how they like cutting costs. They started firing people and others began quitting so that meant I had to make due for a while by myself for the weekdays. I was basically running around to all the stations but still managed to get orders out on time. I went on vacation (by which I mean I just requested 2 weeks off months in advance so I could relax at home) and everything went to shit. My boss tried to work the kitchen by himself and the group chat messages he sent seemed to imply that I had help.\n\n\"Why did nobody prep? Anon, who does the prep for you?\" I did the prep for myself and others.\n\n\"Where do you guys keep the sauces?\" I made the sauces everyday.\n\n\"Anon, who helps you out on your shifts?\" Bitch, nobody helps me because that's how you made the schedule.\n\nThe reviews from the 2 weeks I was gone were hilarious. I quit soon after and the GM got replaced by a better one according to what my old coworkers said.",
            "My mate got made redundant from the graphic design dept of a big company. He owned the rights to all the fonts they had been using for years including their company logo and header. Boy did he make them pay.",
            "A guy at my company put a line of code in all the software he built to look for his name in the employee database before running. If his name wasn’t there the program would stop. \n\nPretty clever but it took like 15 minutes to fix it after he was let go",
            "If you fire the farmer, don't come crying when the tomatoes go bad. \n\nOoh that sounds like a good idiom.",
            "You are not in the wrong. You offered what they needed they refused the offer. You did not sabotage anything. They could hire outside IT people to replace you. Cheap bastards that they are.",
            "Someone in r/talesfromtechsupport had the great comment that a well-done Logic Bomb isn’t triggered, it’s just allowed to trip after regular resetting of the fuse isn’t maintained.",
            "Not this, but I feel pretty satisfied that the day I do quit my job and find a much needed better one, a lot of the tasks I do and invented for my position will be overwhelming for them.  \n\nI programmed a lot of excel spreadsheets and charts that pull automatically and compile data in specific ways from certain exported reports. One set that I do at the beginning of every month took about 4 hours work for 15 people down to 30 minutes for me (they were copying numbers manually, everybody using the same reports). Also, I have found new ways to track data that, knowing my coworkers, would be very hard for them to figure out the process.",
            "All of my programs are written in Common Lisp. Good luck finding someone to maintain that shit when I'm gone",
            "Intellectual Property had always seemed weird to me.  I've made software for most of my employers even though I'm not filling a developer role.  I've never asked for compensation, but many of my coworkers have suggested I should.  \n\nIt's pretty easy to estimate the millions of dollars I've saved them and their customers.  For now, I'm grateful to be employed.",
            ">Edit: I see some are saying that I am in the wrong based on US law, just editing here to let you know that this did not take place in the US. I made the program during my spare time at home on my own computer.\n\nIf thats the case then I don't see what the other people are moaning about.  If no company time/resources were used, then I can't see how the company would have a claim on it.",
            "> recently bought by an investment firm \n\nThe second I saw that, the alarm bells started going off.",
            "I haven’t even gotten past the first paragraph because every time I read the phrase “plant based companies” I crack up all over again. I know you mean it’s a factory with different plants (buildings with their own functions,) but plant based is such a buzzword-phrase and I can’t help but picture a company literally made of plants.",
            "Lol why do ppl always think everything happens in the US? Come on, it's not the only country in the world. :^",
            "I worked for a company that wanted everyone to sign intellectual property agreements that gave the company ownership of anything you designed during the course of your employment and for 6 months after termination. That agreement was one of the hire-on papers that I did not sign. I just took it with me and they never noticed that I didn't turn it in.\n\nDuring the course of my employment, I developed several proprietary tools that the company used and incorporated into their policies. Work would stop without my tooling. I owned the patents, but I never tried to charge them for the use of my inventions...until I was terminated. After termination, I had my lawyer send them a cease and desist letter for the unauthorized use of my tools. They tried to fight back but had to comply when they realized I owned my own intellectual property. In order to continue operating, they had to lease rights to my tooling until they could develop alternative tooling that didn't violate my patents. \n\nFor about 6 months, they had to pay me for the use of my tools (which was significantly more money than my paychecks were). I felt vindicated.",
            "Awesome story.   More of a fuck you than MC but glad I read it either way",
            "As an automation engineer, just curious how you made your program. Connecting to a plc? Using python? How did you run the program? I am always looking for ways to make my machines smarter.",
            "You met your obligation the minute they declined your offer of a walk thru of the software and escorted you out the door. \n\nUnless you signed a Intellectual Document, small modifications and reselling of the product was allowable.",
            "In this thread: so many angry US employees that are so angry about other countries being a bit more lenient towards the little people in terms of IP/labor laws.",
            "Here's another good reason for creating a paper trail. I know it's hard to foretell when you sit down at your home computer at night that what you're doing may be the focus of a lawsuit from your employer, but creation records and calendar entries such as \"tried my program the first time on ___\" would have gone a long way (I think) toward them admitting that the program was not theirs.",
            "This reminds me of the new pub manager that fired a bartender not knowing that the business’ liquor license was in her name, inadvertently closing the place down.",
            "Even if it was in the U.S., the fact that you didn't write it on company time or using company resources makes it yours. You were just nice to your bosses and coworkers and let them use it like it was freeware (which it essentially was).",
            "Note to self. If I ever write a program to use at my company - Write in Maintenance bugs so the program goes to shit  in 30-60 days. \n\nAlso FUCK companies that come in an wreck peoples lives for the hell of it. The world needs a worker revolution.",
            "What kind of program just stops working randomly on hardware that's not changing? I mean, yeah, bugs happen but weekly maintenance or it becomes useless? Why?",
            "> Edit: I see some are saying that I am in the wrong based on US law, just editing here to let you know that this did not take place in the US.\n\n*Even if* you were based in the US, it wouldn't matter.  Unless the company is a tech company in the business of writing software or, at the very least, a business large enough to have its own IT department, they were unlikely to have a *contract* with you that your creative work is their property.  Your creative work does *not* belong to your employer by default, but it is standard for businesses in the business of generating creative work to include explicit rights ownership in their employment contract.  If they did make you sign such a contract, as you pointed out, you did it on your own time and your own property, which would make their case very weak no matter what their employment contract says.\n\nFinally, even if your initial work was their property, you are under no obligation to maintain it unless you specifically signed a contract that you would support and maintain that software, and such a contract would be highly unusual for someone who was not employed as a software developer in the first place *and* it would need to include some sort of compensation for continued work (contracts generally can't compel an individual to work for free).",
            "I work at a college where the web developer basically created his own software that was vital to all operations, this thing was like the brain to the rest of the software. He was basically forced to look for another job and I had to hold the fort down until they found his replacement. I quickly realized his software cannot be replaced easily. Long story short he now works for our competitor and we pay him as a freelancer to maintain his software lol.\n\nDude was a genius to double dip like this. We laugh about it all the time.",
            "Lol fuck US law even if you were in the US. Money grubbing bastards trying to take credit for your intellectual property. Idgaf about bs NDA's (they're nothing more than legal robbery), it's fucking theft no matter how you look at it. Glad you stuck it to these scumbags.",
            "For a moment I thought maybe I found answers to an old work fiasco that occured a few years ago.\n\nI worked in a Fab, and for a time all the machines were linked to a really efficient program that kept track of *everything.*\n\nThen one day, it was phased out and replaced with a subpar version. We had to doctument everything from then on, and things just were never as efficient as it used to be.\n\nWord on the grape vine was that higher up \"stole\" the program, got caught, and the company that owned the program \"refused\" to let us buy the rights to it.",
            "Firing all employees in leader position to \"get new blood\"? What is this, Soviet Russia?\n\nIt always makes me very appreciative of living in Finland when I read these type of stories. In Finland it's kind of in the opposite direction, where it can be difficult to fire an employee even if they're bad at their job... but idk how often that's a problem, the trial period should be long enough to fire anyone who doesn't live up to expectations.\n\nI almost made a their/they're mistake... what has become of me",
            "I don't get why people think everything happens in the US. You are \"part\" of the English speaking world and your laws are not everyone's.",
            "For those saying you're in the wrong.\nFuck them, investment companies buying up shit are a fucking cancer.",
            "This reminds me of my first job out of college. \n\nI had to do several reports on the computer and use logic to figure out who had lied on what report then go double check and fix the errors till everything  actually balanced out.\n\n(as an example I could tell they did not use cucumbers from bin number 45286 as the production happened at 4 am and that truck came in at 6 then the report was submitted at 8. They just found a bin of cucumbers and wrote a number down). \n\nWell I wrote a program that started to automatically do a lot of this and would give a step by step read out of why what it was saying was true and the reports you had in your had were not. \n\nI finished the program (on company time) and was starting to debug it when I and my immediate boss were called into the General Manager's office and he let the two of us know that my position in all of North America had been removed and that I needed to pack up my things. My General Manager had no idea I was being let go till after he said hello on that very same phone call.\n\n\nI showed my boss what was up with the program (he was a good boss) and THEN I took off. He was super uncomfortable about the whole thing when I didn't just grab my things and go but damnit I put 3 months into that program and it wasn't just going to go unused!",
            "[deleted]",
            "Unless you signed a non-compete/non-disclosure, you are not obligated to assist or protect the former employer.  Good on you. Sucks to be them.",
            "What kind of simple monitoring software does need weekly maintenance? I mean come one, this was some kind of booby trap in the first place, right?\n\nAutomated monitoring, whatever the source (network, usb, ...) doesn't need weekly maintenance.\n\nEdit: Just found your [explanation](https://www.reddit.com/r/MaliciousCompliance/comments/hotr89/buy_my_program_when_you_fire_me_no_okay/fxk8tuw/). So it wasn't a bug or maintenance to be done in/on your program but on the software running/logging the machines.",
            "I had something similar. I DID make the scripts while on company time, but they were for my own use and stored on my PC, with a network share to the folder that I'd give to some friends/other techs could access to use. Nothing official at all.\n\nI get fired. I did nothing to any data at all and left everything as is. I find out that weeks later when they finally pull my computer and wipe it, some other people in the company had found them and we're using the scripts on production servers... Unfortunately for them, they just were linking to my scripts over the network, and did not copy them elsewhere. A dozen servers stopped letting people log in because the login script couldn't find my scripts any longer, so it'd hang for minutes.\n\nToo bad there are no backups of desktop PCs, and I don't work there to recreate them.\n\nI'm sure they figured out how to make them later on.",
            "About your edit: no it’s not illegal here in the US. You were not under contract that any program you made was their property, therefore no ability for them to sue. They wouldn’t pay you for a program you created, so they lost it. Karma always runs its course",
            "Good for you for protecting yourself",
            "This sort of thing happened to me, except it was not used by the company, I built it all on my own time, and they took it anyways. lol.",
            "If I’m wrong, somebody please correct me, but doesn’t US law say that if an individual is doing something for their job, they have to be paid for the time spent doing it? So if OP made a program, the new head wants to keep it, don’t they have to pay OP for time spent making it, and maintaining?",
            "You wouldn't be wrong based on US law. You'd be in the wrong based on standard contract terms used in the US, which say anything you make on or off company time belongs to the company.",
            "The story of Evan Brown in the USA\n\n https://web.archive.org/web/20140108235257/http://unixguru.com/\n https://repository.jmls.edu/cgi/viewcontent.cgi?article=1118&context=jitpl",
            "I don't really care what u.s. law has to say about this (I know he says this wasn't in the u.s.). If you weren't paid to specifically develop this code for the company and maintain it, then fuck them. You automatized a part of your employer's process and enriched them, therefore it should be your property.",
            "I’d wager that chief got fired eventually.",
            "The edit makes my heart grow warm at the fools assuming they knew how the relevant law worked because they assumed it was in the US.",
            ">I see some are saying that I am in the wrong based on US law\n\nOf course you'd be in the wrong if you're in the US.  It's the corporate utopia where workers are virtually owned by the corporations.  \n\nI'm in Canada and we share some of that stupidity with American companies who has some vfx studios in Toronto.  Some of my friends had to sign contracts that basically say any creative thing they do, even at home,  while employed by xxx company (a certain mice mascot) is the property of the corporation.  It's insane but it's a valid contract here in NA.",
            "Companies don’t give a shit about someone’s contributions.  They only care about the result that is right in front of their face.  In their view planning only takes place by people who don’t know shit, or by managers forcing a schedule down a developers throat.  They are the same person usually.\n\nInnovation occurs at the small team level or individually.  Management just hinders it.",
            "In the US, the legality of \"owning\" the program depends on documentation you signed when you were hired.  (In the case of you developing the program in your free time, as you did.)\n\nI have worked for companies where as soon as I was \"off\" the clock, my time was 100% mine.  I have also worked for companies that wanted ANYTHING I developed to be theirs.  I didn't stay long at that company.",
            "Could you explain why the fuck program just stops working after some time if no changes to equipment are being made? What do you mean by 'maintain'? All in all, the story sounds like made-up bullshit",
            "First, congrats to the OP. Sounds like, at his new company, he has had the opportunity to further develop his program. And that is nice.\n\nRegarding the US, when I started in the computer industry (mid 80s), it was common for the company that hired you to have you sign a separate agreement that stated words to the effect that they have the right to own and/or the right to first turn down anything that you design before you could market it yourself.\n\nFor example, when he designed the Apple I and Apple II, Woz was working for HP. In fact, HP could have claimed ownership of the early Apple designs. But because the machines did not fit into HP's business plans, they told Woz that they weren't interested. In fact, they turned Woz down [5 times](https://appleinsider.com/articles/10/12/07/apple_co_founder_offered_first_computer_design_to_hp_5_times)\n\n>...Wozniak continued, \"I designed the first Breakout game for Atari. So I didn't really work there. They tried to hire me, but I said 'Never leave Hewlett Packard, I love my company, I'm loyal.'\" Wozniak added that it took them 4 straight days and nights to design the game. \"We both got the sleeping sickness, mononucleosis,\" said Wozniak.\n\n>His loyalty to Hewlett Packard made him reluctant to leave the company to start Apple with Jobs. Wozniak reminded reporters last week at the Computer History Museum that he had proposed his idea for the Apple I computer to Hewlett Packard, but they \"turned him down 5 times.\" \n\n*Anyway, best of luck to the OP, always nice to see someone rewarded for their hard work.*",
            "Good on you.\n\nSo many stories of bosses and managers sucking at communication, not having respectable conversations... the whole greed thing i guess.\n Unfortunate for situations where they can get away with it.\n\nI have 2 engineering friends that made significant savings for the company, and didnt get much credit and stuff from it but are still doing really good in their line of work. (In Australia)",
            "If you're good enough to do something, never do it for free is perfect for this.  Although your intentions were noble, in a capitalist society they were all top eager to fuck you.  \n\nI did something similar as a I developed a financial tool for work but it was on work time and despite spending more time outside of work actually developing it, the idea and backbone started at my work and I was paid my regular salary while completing it.  This is in North America so patent law is pretty straight forward.  Fast forward to it's implementation and I got a coffee mug as a thanks and no actual thanks or formal email.  It still improved the lives of many of my coworkers so I'm happy! \n\nGood on you for getting the last laugh.",
            "A classy problem of higher ups they don't think about people they think solly about money... If you are slow they come and tirade how useless you are but if you are fast once because everything went well and you were lucky they go to their boss and brag about how good they are you get nothing but less time to to the same task again ... If you are low in command or not in command at all you earn no praise.... But if you fail you are the sole responsible...",
            "This is why you always put a failsafe into your code so you can shut it down remotely. Always.",
            ">I never sold them that program, instead I sold an improved version to another factory nearby, where I am now employed. \n\nThis is also r/prorevenge - wow.",
            "Was this a PLC or HMI application?  And usually companies make you sign paperwork stating that any inventions/programming/innovations/ideas developed for the company by the employee are the property of the company.",
            "[deleted]",
            "Just wanted to comment on your edit. Fuck them, even if it’s illegal you did the right thing. Laws in the United States aren’t exactly fair to begin with. Those people that whine about you breaking the law are usually the ones who break it constantly anyways.",
            "Americans assuming everything is America is the most amusing part of this post.",
            "Could you explain why the weekly maintenance was required/how that could not be automated?",
            "I know you edited you weren’t in the US, so how does the law work there for this type of situation?  I know where I live within the Us, if I create something that improves the process it’s seen as just me doing my job and it’s the companies IP.  There is a clause in every employment contract i’ve ever signed stating something to that effect.",
            "Maintained every week? The fuck? My original from 2001 was still working before they switched to SAP and a new MES system. That was 10 years ago. And the one I developed back then is still running. I haven’t touched it since 2013 and haven’t worked at the company since 2014. And it still works.\n\nBut then again. I severely hate doing the same shit over and over.",
            "Love how people assume this story is based in the US lol",
            "I’ve never created software but I have created workflows. \n\nI worked for one of “those” companies where I got their mail order business set up and running, writing down the process for each employee they would need and how to automate (and what systems to buy to do so) if they wanted to do so. \n\nBy the end I was bringing in £100k of revenue on my own, working flat out, and the boss didn’t see any reason for giving me any staff or help (or encouragement or pay rises...) so I eventually quit. \n\nWent back in a few months later to one of their stores for some supplies, shop manager runs down to see me. Says they had 6 people doing my old job (that I did alone) and still had orders backed up for weeks.\n\nI asked why they weren’t following the workflows I had created, that required no more than 4 people. \n\n“What workflows?” he answered. Told me everything I needed to know.",
            "Meh, fuck ‘em.",
            "I mean I'm no programmer, but how did it just stop working?",
            "/u/Wintertodt  did you make these scripts and programs so you can grind on Runescape while being paid?",
            "But did you get the phoenix drop yet?",
            "In regards to your edit, there shouldnt be anything illegal about it. The company had ben using your personal property to help further the company and when they company said, we dont need you anymore, you just took your stuff and left. Which just so happened to be the code",
            "I’m surprised the original management never bought the software from you to begin with. Seems like something they would want to ensure they could keep and a nice payout to you for increasing productivity",
            "Wait programs need to be maintained? How does that work",
            "Becoming a competitor is the best payback. I envy you",
            "> I never sold them that program, instead I sold an improved version to another factory nearby, where I am now employed.\n\nHoly shit, what a mad lad. Was not expecting that ending.",
            "It sucks that these types of stories are so dang common, a company/factory makes use of a persons set of skills, and rather than keep paying them their labor’s worth, they terminate their employment and get “new blood=cheaper labor” to keep running their pre-existing top tier systems. Im glad some of you guys were smart enough to keep them from using the systems you implemented.",
            "I’m with you! If a company takes work from me that I willingly give to the company then only I own it because ethics totally makes sense you guys!!!!",
            "I actually had a similar experience. Used to work IT for a title company. There was this house baked program that pulled down info on foreclosures and stuff into our databases. Two people knew how it worked and how to support it. Me and the dev who wrote it. I ended up quitting because I was severely underpaid and overdue for a raise. When I brought this up to my boss, he suggested I get a roommate if money was tight and I laughed and said \"Get ready for notice to come soon buddy.\" A week later I had a job paying double and told HR I quit because I could make more money with less stress delivering pizzas (it's true, I used to deliver pizza in college). Having happily burned that bridge, I moved on w life. A couple months later, old boss calls me in a panic bc the program isn't working. I asked why the developer wasn't fixing it and they apparently laid him off for no reason about a month prior. I just laughed and said, \"Man, it sucks to be you right now. Enjoy digging through his spaghetti code\" and hung up.",
            "Blows my mind how short sighted some employers can be. My company started up a shark tank type competition to crowd sorce the next big think. Hundreds attended the meetings at each office with keen interest. Then during Q&A at the end, someone asked how a winner with the best idea would be compensated. The answer was essentially none because it's on company time. Makes sense right? The rule though was that you'd only get to use company time if you made to the third and final round because they didnt want a bunch of people producing garbage on company time. In other words, spend hundreds of hours of personal time and we'll talke your idea for free. Net result was a bunch of abstract ideas that were not thought through and no actual value having been derrived from this program overall which died a slow awkward death. They eventually tried to aweeten the deal with a promise to pay for a week long entrepreneur course . . . Too little too late and I dont know if any of the winners ever got to attend.",
            "Wow.  Some of you posters are smart as shit.  And practical.  I’m super impressed.",
            "I met the guy who invented friction stir welding. A multi-billion dollar process used worldwide for aerospace welding. Because he was employed by TWI at the time, they seized the lot off him. Just claimed it as theirs, and won.",
            "Sorting the comments by controversial and seeing the butthurt corporate stooges makes me smile.",
            "What kind of program needs maintenance?",
            "Funny I read this today... my team had a meeting yesterday about we have to come up with the exact same thing... basically a program that will record exactly why the machine has stopped, to make trouble shooting the stop faster for the maintenance team and easier to identify what actually caused the downtime we are basically using a data entry system that the supervisors enter it and then everyone has there own interpretation as what actually caused the machine to stop and was it a maintenance issue or production. So there is definitely still a value for this and a demand we are a billion dollar company that still hasn’t figured it out with thousands of employed techs..."
        ]
    },
    {
        "post_id": "oy4c7y",
        "author": "supirgey_fahgeet",
        "title": "Find a new job? Ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oy4c7y/find_a_new_job_ok/",
        "score": 22236,
        "num_comments": 644,
        "created_utc": 1628117212.0,
        "selftext": "I was working for a small local store chain (17 stores across the state). Paid $1 over minimum wage, apparently had decent benefits if you were full time (they made sure no one was), and wasn’t too terrible. \n\nThen last week the entire staff at a different store quit at once. Didn’t think much of it until our boss’s boss came in and said he needed people to go cover that store. It was 42 miles away. Do we get any sort of raise or gas money? “No, we don’t pay you to drive to work”. Will we work 8 hour shifts? “No, you’re all part time employees”.\n\nOf course, everyone started voicing their disapproval. Half of us don’t drive at all, and most share a car with a family member. We’re making maybe 20k a year and now they want us to drive over 1 hour each way in traffic to work a 3-5 hour shift? The manager(director?) got upset and said, “I will be back tomorrow and expect 4 volunteers. If you don’t want to be a team player, I suggest you find another job”.\n\nSo I did just what he suggested. Went online and found companies offering entry level positions for several dollars an hour more and some even had a signing bonus. I had two interviews set up the same day and ended up taking a warehouse job that paid $3 more and had a $1000 bonus after 120 days. Two other coworkers got a job there as well and we’re encouraging everyone at our store to apply. Apparently the job market has gone crazy lately but none of us were really looking we we didn’t realize we were underpaid.",
        "permalink": "/r/MaliciousCompliance/comments/oy4c7y/find_a_new_job_ok/",
        "comments": [
            "Good for you. Boss sounds like a mega dick and is probably eating his words right now.",
            "All the employees of the other store quitting at once should be a red flag ….",
            "“No, we don’t pay you to drive to work”\n\nYou do if the location of work is different to the usual one. What a twat.",
            "Oh this is gold. It really blows my mind though how these people get into a position of power/ownership. How in the world was this business model successful enough to open 17! stores, yet alone 1?",
            "This is the way to go. Even if your happy where you are, it doesn't hurt to have a \"is the grass greener on the other side? \" mentality.  You have to do whats best for you.",
            "LOL, \"hrm, an entire store of employees quit en masse, I better respond by antagonizing my *own* employees!\"",
            "I’m so thankful you were able to do this. Hope to other employees as well. There’s a reason jobs are open, and it has very little to do with “willingness to work”, as employers would like us to believe.",
            "Guaranteed that boss found some news outlet willing to interview him on the \"shortage of workers\" because they're \"sitting at home\" instead of working.\n\nPeople kept telling those in lower-wage positions to \"get better jobs\" for years... And now that it's happening...",
            "So now he has 2 stores with mass exodus.  \n\n\nWill he go for 3? 4?  all of them?",
            "I hope you go into everyone of those stores and encourage all your former colleagues to look elsewhere. Teach the \"boss\" who really keeps his business running. Maybe he'll start treating people right.",
            "I would definitely suggest that anyone who isn't happy at their job should look for a new one right now. Even if you're happy, there is a ton of good paying jobs thar need to be filled right now. Tons of them have sign up bonuses too, hopefully this is the end to unpaid internships.",
            "If you tell your employees that they can leave if they don't like their jobs, don't be surprised if they leave.",
            "Even if you're sure you will never leave your job, it's important to keep an eye on job listings for your field. This applies to all jobs, from entry level and all the way up. You need to know what competitive pay is for your skill set and what prospects are out there. Knowing what you are worth to your employer is important.",
            "Sounds like your boss did you a favour. We all need a push sometimes.",
            "Hmmm.  Wonder why this chain has issues retaining workers?",
            "Congratulations",
            "Leaving your old job was definitely the right choice. Just be careful. Warehouse with a signing bonus sounds a lot like something that rhymes with Shamazon, and they will eat you alive if they can. \n\nIf you’re looking at how everyone banded together to affect change in the workplace, keep that in mind. Working together as a united front is your most powerful tool against companies that want to use you up and throw you away.",
            "Did you ever hear the story... the tragedy of Darth Capitalist... not a story your boss would tell you... Incompetence leads to quitting, one store  quitting leads to another, and profits are reduced by failing to continue to exploit labor...",
            "The Big Quit continues",
            "Please tell us what that arse of a manager/director said or did when you all quit as well.  Just tell him, \"We did as you suggested.  We found other and better jobs\".  The demand to drive far longer for no more pay was just idiotic management.",
            "Good, encourage others now you dont work there. For real take the time to stop by and \"shop\" and tell other employees to leave.",
            "The boss is not paying attention to the world around him.  Oh, well.  Too bad for him.",
            "Oh yes. You’re all underpaid. Almost everyone working is underpaid. That’s why everyone is offering huge sign on bonuses and raising their starting wages in a last ditch effort to get employees. Somehow the covid shutdown made people realize they didn’t have to be treated like slaves to survive so now companies are scrambling for help.",
            "People keep saying \"no one wants to work\" nah. No one wants to work for much much less than they're worth and be treated like shit.",
            "You might share with r/iQuit\n\nServes them right",
            "In my opinion, one of the best things to come out of this pandemic is the worker shortage. \n\nI've worked minimum wage jobs for 5 years now, in a state where the min wage was being slowly raised every (I believe) two years. So regardless of the \"raises\" I got, I always made min wage, which sucked, because everything else was increasing too. \n\nFor the first time ever I'm actually be offered competitive wages and bonuses to stay on for my job. The owners are, for the first time ever, sending our emails and telling us how much they appreciate us, giving us little bonuses here and there. It actually feels nice.",
            "Yaaasss!! 🙌🏽That boss won’t be suggesting their staff “find another job” again soon.  Hopefully they’ve learned that with that threat comes the threat of being listened to 😂",
            "Hopefully where you end up will treat you better as well!  Good luck with your new adventure.",
            "Congratulations on getting a better job with better benefits, I hope you can persuade more people from your previous company to switch as the old job does not sound beneficial. Karma is going to bite your old job in the place where it hurts the most.",
            "The one good thing about the current work situation is that a lot of jerk places will be paying a price.",
            "I can't remember the last time I went to a store in my area that WASN'T hiring. I've even had managers at drive thrus and tire service companies ask me to spread the word they are hiring to anyone I know who might be looking for a better job. This is the golden time of the workers having the market on their side to shop around. Swap if your current job is shoveling you under or trying to make you shoulder the burden of business at your expense to save a buck or get a power trip. I've seen some local businesses go under this summer not because they weren't popular, but because they weren't willing to treat their workers decently or pay them what they deserve.",
            "I hate that line “team oriented” or “team player”\nCompany boys can go fuck themselves, I work to live not live to work, i’m here for a pay check not your personal fucking approval.\nYou want brand loyalty? Then you best be paying well, have good benefits and a flexible gravy shift.",
            "LOL, his words \"I suggest you find another job”, and you did. there is a reason when employees quit in mass and you knew that was going to be a hot mess.",
            "Cool story. Good for y'all",
            "You need to visit your old place to ask the manager about missing wages (even if you were paid right) \nJust to see how they're getting on",
            "Employees are willing to work.  They're just not willing to work for minimum wage or slightly above and be treated like rubbish. If the job so bloody easy, let the mangers/owners do it!",
            "What kind of idiot didn’t realize that labor, especially lower wage labor is in tight supply right now? That guy deserves to get grilled",
            "Job market is crazy right now. Left my current company for a 20% raise. I thought I was asking for a lot but they gave me exactly what I asked for without a counter offer. Best time to find a job is when you have one.",
            "17 stores across the state you say? More like 15.",
            "It varies by state and industry, but they might have to pay you if you're being to travel outside your established work place. \n\nBut you made the best choice. I hope that chain goes under. Wish I knew which one to make sure I never go there.",
            "What happened? Any volunteers? Did you convince everyone to leave? Don't leave us hanging!",
            "I don't think he understands the concept of volunteering",
            "This is literally the best time for employers to be dicks because everyone is fighting for employees and will pay out the wazoo",
            "We have places that used to pay minimum wage now offering $15/hr with $1000 sign on bonus. Low wage workers have not been in a better position during my 40 years",
            "More people need to realize that the \"ruling class\" is wildly outnumbered and depends in the average worker.\n\nStart throwing your weight around and demand better pay and treatment.",
            "\"We need you to do more at work!\"  \"ok pay me more.\"  \"No, if you don't like it quit!\"  \\*quits  \\*\\*shocked pikachu face\\*\\*\n\n&#x200B;\n\nYes the job market is crazy right now.  All these jackasses who got away with paying slave wages for so long are getting RUDE awakenings.",
            "This is what makes my blood boil when I hear store managers and owners complaining about labour market being bad. Yeah it's bad for you now but it's been like that for us for years when you paid absolute minimum with no benifits and expected us to work as like we made six figures. Now that workers finally have some leverage, they wanna complain.",
            "I see quite a few local restaurants closing or not reopening due to \"lack of staff\".\n\nI assume many of these are really \"our staff realized they could do better elsewhere.\"",
            "Glad you found a better job. Some people are unbelievably unreasonable.",
            "This thread is filled with stuff like this and all I can imagine is OP being in either the South or Midwest. IDK if my assumption is correct but I do know there is too much corporate competition ( free market ) in costal blue states for employers to be this callous towards employees....for the most part.",
            "Sounds like a store chain with the word \"Dollar\" in it",
            "Whomever owns the store may have some issues with the manager/director when their sales drops through the floor.",
            "Good for you!  I'm so sick of hearing upper management complain about people not wanting to work. PAY YOUR PEOPLE AND THEY WILL WORK!!!",
            "Good for you.  Cue yet another crappy employer crying that he can't find anyone to work for him.",
            ">Apparently the job market has gone crazy lately but none of us were really looking we we didn’t realize we were underpaid.\n\nwe should always be searching! But we don't...\n\nWhat was your boss's reaction?",
            "Your former boss surely sucks at poker",
            "How did your boss react when you told him you and the others took his advice?",
            "Good for you! Watch your old boss cry about there being a “labor shortage” now.",
            "Looks like someone fucked around and found out.",
            "I have been telling this to all of my friends! The same way that you’re fed up with your job, the people that were working the job you just accepted got fed up with theirs… and so on, and so on. Now is the time to level up! I quit my job of 6 years, applied to a new/ better one the next day & was immediately interviewed and hired… after about a month into it I wasn’t really feeling it & applied to another job… same thing, immediately interviewed and hired. Went from a part time bartender with no college degree to a full time job making great pay with benefits, paid time off, and am no longer getting off work at 2am. Now is the time to level up!",
            "Side note: Anyone that gets made to do that can sue your employer after they switch jobs.\n\nDepartment of Labor specifically states that time spent traveling to a special assignment is work time and must be paid.\n\nSo say your commute is normally 10 minutes each way, and they now sent you an hour each way for this infrequent job. Then they must pay you 50 minutes each way.",
            "The boss will find he now has 2 stores with no staff..",
            "Workers collectively beginning to understand their power and demand better pay, better conditions and better overall treatment is my favorite thing to come out of the 2020's. We love to see it!",
            "Amazing that they didn’t learn their lesson from the first store, but decided to go to the second store and make the same mistake? Think they’ll learn, or will another store quit all at once?",
            "Follow up with how your current employer takes the news please",
            "British government 'named and shamed' 191 companies for paying less than minimum wage : worldnews. August 5, 2021\n\nIt's not the first time either that they have done this.",
            "Scott Adams said in one of his books, \"You know your company is doomed when the smart people leave  as fast as a cheetah from a salad bar.\" Good Luck!",
            "Remember, there are 15 other stores that haven't heard the good news about how there is a better life out there if you just open your eyes.\n\nAt least let them know about the [strike this October](https://octoberstrike.com/)",
            "There’s a labor shortage now. It’s a seller’s market.  Get a new job now. Don’t feel too bad about leaving for a better offer. If someone is paying you more, it means they need you more. That’s how markets allocate scarce resources efficiently.",
            "Gosh, with leadership like that in this job market, I can't begin to guess why the entire staff at the other store quit all at once.  \n\nI admit that I was hoping to hear that everyone quit at the next meeting after being told they weren't team players.",
            "Some companies act like nothing exists outside of the company and you should be grateful to still have a job. Doesnt provide much motivation to stay",
            "Looks like he'll have to find more volunteers to cover your store at this rate lol",
            "It really takes a special sort of stupid to attempt solving \"too many people are quitting\" with \"let's encourage quitting\"",
            "Absolutely. All the jobs in my area are starting at much higher rates, even fast food because they can't get enough people to work. It's kind of crazy. I got offered two jobs at the same time, and I'm sure I could find a different one if I got sick of the one I took. \n\nAlso I know there are laws in some states about forcing you to drive to another location. They have to pay you for travel, even if you're part time. It really depends on the state /country though.",
            "\"Kids these days just don't want to work\" /s",
            "I honestly feel so bad for working class Americans. It’s so strange to me that the super patriotic Americans also seem to be in this financial class",
            "Gee, i wonder why the other store all quit at once?🤔. How out of touch do you gotta be to think employees are gonna drive that far for minimum wage?",
            "What kind of sorry excuse is \"be a team player\"!?",
            "There’s a Mexican restaurant down the street offering $20 an hour and full time for cashier and cook positions (PT also available) and $25 an hour for shift leads. I’m a teacher now making around $50/hr now but a few years ago I would have been allllll over that! The value of labor is changing and I hope it sticks",
            "I applied for a grocery store job in my home state at the beginnings of Covid (late April, early May of 2020). Minimum wage, part time, seasonal. I had a panic attack during my first training shift and never went back. I have 8 years of customer service experience, all of it cash handling, and my first job was a Cashier at another brand. They were so impressed they actually begged me to reconsider, but there was no way I was being locked in a plexiglass cubicle for 5 hours a day for $9.35/hr. I got a job at the local tobacco store and started at $12 which then got bumped to $13, and now that I've moved I'm back in hotels for $15.50.\n\nYou will always be worth more to someone else.",
            "So do you know if he go his volunteers? I want a happy ending where the boss doesn't get his way.",
            "And now the company needs coverage for two stores!\n\nI wonder if the manager tried for three?",
            "Companies need to learn that without us workers they will not survive, maybe start paying and treating us better would work?",
            "Not this chain, but the Burger King sign saying We All Quit made national news.  [https://www.klkntv.com/we-all-quit-local-burger-king-sign-goes-viral/](https://www.klkntv.com/we-all-quit-local-burger-king-sign-goes-viral/)",
            "Boss's boss shouldn't have been at your location trying to browbeat you into working there, they should be at the store without staff doing the work themselves.  Being a small company as you say, the \"manager\" has even less reason to be where you are.",
            "Please give us an update where the bosses boss comes in looking freaked and begging people to stay, string him along a bit, make him dance and caper around maybe? And then quit.",
            "He destabilized an entire workplace environment and probably thought he was doing the right thing.",
            "A lot of people don’t realize how under paid they really are",
            "I wonder if the employees at the other store all quit because he tried pulling the same thing for a different location that all quit at once and it's just an infinite loop",
            "According to the Fair Labor Standards Act (FLSA), if a worker is required to travel outside their commute area or to another city for a special one-day assignment, it's considered \"work time.\" The most the employer can deduct from that is your normal commute. For example, if your normal commute is 5 minutes and they require you to travel 45 minutes to a neighboring store, then they owe you 40 minutes of work.",
            "Congratulations!",
            "Good job! This is one of those encouraging MC stories that might be able to help people in similar positions. Far too many bosses have failed to understand that we're currently in a seller's market when it comes to labor, and this dude just lost two locations finding out the hard way.",
            "And now they have 2 stores that need to be staffed lol",
            "What did your boss say when you said goodbye I’m leaving haha",
            "awesome. woulda been better if you had coordinated the quitting",
            "When I was young in the 1970's, I worked at a fast food franchise. Some fast food stores are owned by the corporation, but a franchise is a little different. The franchisee has to pay a big payment to get the store. \n\nThen, he has to buy all his supplies from the corporate suppliers, which...theoretically are cheaper due to mass corporate purchasing contracts (but, to be honest, I think the corporation was screwing the franchisees in the keyster).\n\nThe main thing that I learned is that...for ever dollar that he pays his employees, that is one less dollar that goes into his pocket.\n\nSometimes...he would rather have a new untrained employee getting minimum wage, than to pay more for an employee that is experienced.\n\nCustomers may occasionally complain about poor customer service, but...the bastards always came around to the business that had the lowest prices.  \"I have seen the enemy, and he is us\" -Pogo",
            "i always tell younger people to work at a job for a year or 2 and start applying for a new job demanding higher pay.\n\nif you are declined, you still in the same position before you applied and have lost nothing.\n\nif you are accepted, you just gave yourself a raise or your company freaks out with your 2 week notice and bumps your pay and repeat in 1 to 2 years.",
            "If volunteering is compulsory then it isn't volunteering.",
            "How the shit can anyone think they can treat employees like that right now",
            "Capitalism Yay!",
            "He said the wrong thing in this job market",
            "I had the exact opposite happen to me whe I worked at a national big box store, they tend to not “spark” joy in people. They had us clock in at our store then drive to the other store and we got reimbursement for lunch, bought at the big box store. I worked like 60 hours that week and 10 of it was driving. Can’t remember if we got mileage as well.",
            "Congratulations! Don't stop there.",
            " Good for you for not taking their bs.",
            "That shit where (according to the owner):\n\nYou lose money for the owner? TEAM PLAYER. \n\nOwner lose money for you? FUCK YOU.",
            "Good for you!   I hope many of your coworkers did the same.",
            "Funny seeing the situation in the states, here in Hungary people would go and pray in a church for a job that pays 5$ or more without it being a 3 shift job, though our cost of living is lower, and our income tax is astro high",
            "If this is US and boss said those words in this job climate then boss deserves the blast that is coming. \n\nJust don't expect to get a proper reasoning to this. A 'nobody wants to work' -sign might come up on the door. Like it's employees fault the system is literally at it's end with high inflation and 20k yr paychecks.",
            "As tough as it can be, getting a new job is the way to go when bosses and companies think that way. Working people (literally anyone who needs a paycheck and isn't living off dividends) have rights that are always being challenged by owners and other corporate leaders. Things need to change more but until then, I hope you all left for better working conditions and pay.",
            "Look for a goodwill clause in your contract to cover yourself incase you are accused of “poaching” staff. If you are employed by a company and start actively enticing employees over with a goodwill clause stating that you won’t do that when you leave, you may have an issue. Just cover yourself",
            "I'm giving my notice! In 15 min you'll notice I'm not here any longer!",
            "You should always be looking for a better job.",
            ">we didn’t realize we were underpaid.\n\nthat's why it's \"crazy\" - people are realising.",
            "Gotta love free market mechanics at play.\n\nDont like your job? Another company will gladly take you in and probably pay you better, especially now with the labor shortage.",
            "Ive worked a handful of jobs and its amazing that the worst were all retail. Paid the least, expected the most from you. That crap how no one is fulltime, keeping hours low. 20 hour schedule for the week, spread over all 7 days, crap like that.",
            "And employers keep asking \"why can't we find anyone to work???\"",
            "It’s nice to feel comfortable at work and not have to look for something better. \n\nOnce a month, take a look at the same resource boards you found your better job on. Just look, if it sounds better, drop by and get a “feel” for the place. \n\nYou never know how it is until you show up and see how they operate.",
            "They will get the loyalty they have earned. And their business will suffer accordingly.",
            "You just discovered why the whole other store quit. Lol",
            "Fucking love to hear it, the last restaurant I worked at was horrible and I wish I could’ve quit there with everyone else all at once together but sadly jobs aren’t easy to find around my area.",
            "Someone probably already said it, but I believe they are required by law to pay you drive time if you’re going to a different location",
            "This story warms my heart, we need more of this.  Make it even better, don’t leave a notice, they don’t deserve one.",
            "Glad from a tragic mishap something potentially awesome gave way buddy .CONGRATS",
            ">I suggest you find another job\n\n... This is a dumb time to say that",
            "I recently graduated with a Master's in Engineering  but was also doing some maintenance work for a candle company here in Scotland, I started with them when I had pretty much finished my honours degree so they knew where I was at education wise, anyway, after graduating they wanted me there full time which was fine, had a chat with the owner, promises were made about setting up an innovation department to develop new products and equipment for customers etc, all stuff that would allow me to grow and expand my knowledge base but more importantly allow me to work towards becoming chartered (very important for engineers in the UK), 6 months down the line and I'm still spinning plates to keep the place running (I have a scarily vast skill set which just so happens to tick every box from a plant maintenance point of view without ever being qualified to do so e.g. working on 3 phase panels) I have no additional staff to help me nor is it likely we are going to get someone suitably qualified (qualified electrician would cost a small fortune to hire and the company didn't see the need as I was handling it all) anyway at 38 and having been hands on my entire working life and I'm physically starting to get a little burned out, my knees aren't great anyway, and I had a mishap at Xmas involving a circular saw and 3 fingertips (not work related) so I speak to my direct manager for the 10th time letting him know my concerns and that I'm planning on putting in my 4 weeks notice, we sit down for a meeting with the ops manager who has just laid out a roadmap for a MAJOR reorganization of virtually the entire production side of the business (which I knew was coming up) and I hit him with the good news, his face sinks but we come to an arrangement where I agree to work beyond my notice to complete the major moves and infrastructure upgrades as long as I receive the pay rise I was promised at the start of 2021 (they like dangling carrots) and it is backdated to the start of January, this is all agreed upon and the works start, everything goes well....infact everything goes really very well, the last part of the move is the transplant of the pouring line which I laid out a timescale for in a Gant chart and send it off to the relevant people (including the ops manager) so everyone knew when this is going down, I brought in an electrical firm to handle the installation of a new DB to serve the pouring equipment, had staff in place for the 2 and a half days expected work and bought some relatively inexpensive equipment to handle the move of the main line, everything was completed on time and with the minimum of disruption to the rest of the business and before the move the new layout was discussedwith the relevant people who were happy (this was important as the electrical contractor had installed outlets and switchgear in key locations to suit the equipment) however the ops manager who was on holiday during the move came back and decided he didn't like the layout and ordered all work stopped while the management had a meeting (meetings were all too regular and mostly unproductive) I was asked to come along while the ops manager gave us his big plan for the pouring side of production, and all I could think of was \"you knew when the move was being done, this should have been discussed before this point if you had something to input\" after the meeting I'm feeling particularly pissed off so I ask my direct manager WTF? he replied 'this Is a very dynamic business things change regularly' my reply \"there's a difference between dynamic business and simply being a bad manager and the ops manager is a bad manager\" technically there was one major challenge left and that was the re-assembly of the glass curing line (cures paint) which needed both mine and the electrical contractors input to work on as well as input from a supplier in China to make sure the installation allows for the new glass decorating line that was due to be installed in August, after the last meeting I thought, fuck this, and loaded up my tools and walked, I was already 3 days past my notice period and knew there was nothing legally they could do to make me stay any longer, afaik the curing line has only just been rebuilt and is still awaiting to be commissioned and the glass decorating line is nowhere to be seen!\n\nTLDR: company was using me for all the wrong things, handed in my notice and agreed to work beyond to complete jobs, ops manager fucked around and found out that I can just walk... and did",
            "Yeah not smart on any manager / owner paying super low wages to make waves. \n\nMost people making minimum wage or just above have a plethora of opportunities out there because there are still those people that think their self worth is $15-$20+ an hour with no skill sets so would rather drag out their unemployment benefits for as long as possible instead of returning to the workforce. \n\nStill waiting to see if my younger nephews and cousins find their mythical unicorn jobs that are outside, pay well with great benefits that you only have to work a few days a week at and start with weeks of vacation time. I’m sure such jobs probably are out there, just have a hard time believing late teens / early twenty year olds have the experience to lane them.",
            "did the store close because of lack of workers? would have been a good ending if this was the case",
            "Do employers often hand out signing bonuses for positions that pay a few more dollars per hour over min wage? I've only seen it for mid/senior lever positions 80k+ salaries. Just curious.",
            "The market is hard up for people willing to work right now, especially in the US.\n\nThe federal unemployment bonus resulted in a lot of people making more money sitting at home than they would at work.",
            "Heh, stupid boss. Hey, that's probably go well in r/stupidboss. Doesn't realise the world is changing around him and gets caught with his pants down.",
            "Imagine WANTING to work 8 hours a day holy shit",
            "In my state it's illegal to have employees drive for work and not pay them. May be violating labor laws. Look into your local laws and report their asses if they are violating laws.",
            "You now make more than your old boss",
            "$1 an hr\n\nwhat the fuck is the USA \n\ny'all are a third world country",
            "What do you mean by \"went online\" bro? Hook the homies up",
            "Please update with an edit if management reaches out, I'd love to hear how it goes",
            "I’m not a lawyer, but I’m pretty sure it’s illegal to force you to work in another location if that wasn’t part of your original hiring contract.",
            "Good for you!",
            "Please Update us if you find out more details, like if that boss gets into deep shit, or if it closes down",
            "This sounds like a small chain I know about in Idaho…is it?",
            "I’m currently in a similar situation. One day these weirdos will understand that they need us more than we need them. You’re absolutely right. There’s so many opportunities for work out there right now so why the hell would I stay with a company that has no concept of appreciation for our time.",
            "Yeah right now I get $10.50, when our states minimum wage is $9. I really like my job. But I promised when I got hired that I would stay there 6 months, and when that 6 months is up, I will definitely be browsing the job pages.",
            "The boss: \"What? Why did everyone quit?!\"",
            "Would love to know what happens tomorrow",
            "this makes me happy",
            "Wholesome story",
            "Usa has record breaker number of business open. during the pandemic. And they also need to higher ppl. = High demand of workers. \n\nUsa. Has 7 million new companies open up. What if half of them higher people? 3.5 million ppl in new jobs. \n\nhttps://www.journal-news.com/news/new-business-filings-in-ohio-keep-breaking-records-why-businesses-are-opening/O4EGGQTAXZE3FGPJOGNEAORSX4/",
            "Maybe this will force the higher ups to appreciate their staff! Well done",
            "What was the idiot boss's reaction when you all quit?",
            "Pity you didn’t share what his reaction was (I suppose you probably don’t know)",
            "[deleted]",
            "Good for you, getting out of that shit.\n\nMay I suggest taking up a trade and joining a union?\n\nI too used to work retail, then warehouse work. Joining a trade union was the best decision I've made.",
            "Shoot, even Walmart gives you gas money for anytime that you drive to another store. If you have to travel to a store that’s 1.5 hours away and your shift starts at 7am, you leave by 5:30am to be there at 7. Then you work your 8 hour shift (+1 hour for lunch). When your shift ends at 4, you then drive back to your store. Assuming you get back at 5:30pm, you get paid for all of that. The travel time, the driver also gets any gas reimbursed if they have to fill up on the way… all of that is approved. If you have to travel more than 2 hours one way, they get you set up in a hotel for the duration of your time helping at another store. One of the few perks of working for them. When that happens, they have OT and reimbursement built in for just that purpose. And to have a state wide store chain having that many locations… well, that’s on them. 🖕🏼 good riddance to them.",
            "Update us of the fallout in a few weeks",
            "My dad started his own engineering business on a shoestring -and quickly became successful because a popular guy from the engineering business down the road came and asked Dad for a job. He was a skilled guy who had been working for years for an absolute swine. He'd had enough, walked out and Dad was glad to get him. Dad gave him a fair wage and treated him with respect. Within months, the guy brought ALL the mechanics from that company-and, vitally, he brought the lion's share of the customers. Dad's business was virtually handed to him on a plate. I don't know if the old company boss ever realised that, if he'd just treated people reasonably, his business wouldn't have failed.",
            "Don't forget to say \"Thank you for your advice and patronage. Without your incentive I would never have thought of changing job when it clearly was the best option for me.\"",
            "I once got a job at a place that had a 100% turnover rate the year before.  I soon learned why.   This was a stepping-stone job for me, so I managed to stick it out for 3 years, but at the end, this was the only job in my life where I simply walked out one day.  I had planned for months, then dropped my resignation on the boss's desk at the end of my shift, and was out of town in an hour.  I never returned.  \n\nI see it as valuable experience, because if I ever reach 'boss' status, I know exactly how *not* to treat my subordinates.",
            "This is awesome! Good for you. Now you know why the others quit.",
            "What was the name of the store?",
            "Great for you. This is the time for workers to step up and demand more, the conditions have never been better!",
            "Always be looking at jobs just to know who’s paying what. \n\nAnd always talk with your coworkers about pay, and working conditions, and hours. There’s a very good reason your employer doesn’t want you doing this-it gives you, the employee, power. \n\nPower to refuse doing shit unless you’re paid more, power to organize and collectively bargain, and power to find better work and pay elsewhere, leaving some middle manager-and the company-high and dry when it comes to having a workforce they can exploit.",
            "..... I've been travelling for an hour + each day for 4-6 hour shifts for 5 years..... I thought it was normal.",
            "You probably make more than your old boss",
            "[deleted]",
            "Did in your interview ask why you were leaving.",
            "Sounds like Amazon. People love to hate on it but it’s 15-18 starting and full time if you want it. 1000 dollar signing bonus. Then random bonus during the year",
            "It amazes me how managers and company owners can't keep employees and can't see that they are the problem. My daughter is one of a couple still around after her company hired a bunch of people. They don't allow breaks, the owner keeps the tips, they tolerate workers coming to work high, they talk to the workers disrespectful, and play favorites/have inappropriate relationships with certain workers. They are shocked when they can't keep good employees. Amazing."
        ]
    },
    {
        "post_id": "eirstl",
        "author": "EricCartmenez",
        "title": "\"Would you just do your fucking job?\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/eirstl/would_you_just_do_your_fucking_job/",
        "score": 22236,
        "num_comments": 491,
        "created_utc": 1577931807.0,
        "selftext": "When I was 19 years old and a fresh high school (or my country's equivalent) graduate, I had no idea what I wanted to do with my life. The one thing I did know is that I needed money, so I started applying for all kinds of jobs. After a few weeks of writing applications, going to interviews and waiting nervously for replies, I was hired as a full-time sales assistant an international company making smartphones, TVs and other electronic gadgets. \n\n\n\nSaid company was in the process of opening their first official store in my country and I, as I was hired about 3 months before they were due to open, helped them however I could. I created one-pagers (basically posters that show all the hardware inside a device plus a picture), translated manuals, put security tags on products etc. Whatever they wanted me to do I did, sometimes until late at night, still foolishly thinking that this initiative would maybe be recognized in one shape or another.\nAlongside me they hired 4 other people: 3 more sales assistants and a store manager, all of whom were young and ambitious, just like me. The grand opening went very well, business was booming for the first 2 weeks and everything seemed fine. That's where the problems started.\n\n\n\nThe first thing we realized we didn't have were guidelines on how to handle returns and warranty cases. As the company's electronics had been available online long before the store opened, some people now started bringing in their devices to get them fixed or swapped out, none of which we knew how to handle. This annoyed a lot of customers, being given the information that only devices bought at our specific store would be handled under warranty only made things worse for us. We were getting abuse on a daily basis that ranged from curse words to death threats, once we even had to call security because a customer was threatening us. This stress caused one of my collegues to quit, understandably. \n\n\n\nThis, as it turned out was only the tip of the iceberg. Some of the other problems we had included:\n\n-Having a break room with no access to fresh water, no fridge, no microwave and of course no bathroom (all big no-nos where I live)\n\n-Resupply came in sporadically at best, sometimes we were resupplied twice a week, sometimes there were no deliveries for three weeks, making it very hard for us to tell our customers when their devices will be arriving.\n\n-The store manager was so incompetent, he couldn't even finish our schedules 3 days in advance, allthough giving the schedule two weeks in advance is mandatory.\n\n-One of my collegues thought \"fuck this\" about a month after our grand opening and went on sick leave, which where I live basically gives you immunity from getting fired, so now we where two men down.\n\n-The bosses upstairs apparantly wanted us to provide tech support over the phone, which again none of us where trained to do. We did our best, but only really ended up with more threats in addition to having our official store phone number constantly blocked by these calls. Also, we were expected to take over social media communications as well, meaning we now had to answer questions on Facebook, Twitter, Instagram etc., putting even more strain on our small team.\nIn the end, the manager couldn't deal with the stress anymore and broke down about 2 months after opening. He even sought psychological counseling after quitting. While I was sad to see him go, I thought that now my time had come to prove myself.\n\n\n\n\nI took over most of his duties, still only earning about half of what the manager made. Naively I worked 60 to 70 hour weeks for almost 3 months straight, still thinking that this would somehow pay off. I made sure to tell my bosses how much more I did than we agreed upon in my contract, but they didn't seem to care. That is, until our sales figures dropped. All of a sudden I had two of them come into the store unannounced, basically drag me into a back room and start lecturing me on how badly the store is performing. The conversation went something like this:\n\nBoss 1: \"So, why would you say the store's sales performance has dropped so much since (Manager) left?\"\n\nMe: \"Well, a lot of customers are unhappy with the way we h-\"\n\nBoss 2: \"Our products are very competitive, why are you still struggling to sell them?\"\n\nMe (slightly disgruntled): \"Well SIR, as I was trying to say, the customers are not happy with our service and running a store with just two employees is almost impossible. If we could hire two more assistants, maybe we could focus better on our numbers...\"\n\nBoss 1: \"The interviews for those positions are ongoing, you will have new employees soon. But you were hired for a reason, so would you just do your fucking job?\"\n\nMe:\"...yes sir.\"\n\nAfter that meeting I felt defeated. Doing all this extra work, staying late, taking responsibility for things I had no business taking responsibility for, the threats, the uncertainty, the stress, the sleep deprivation, all for nothing. And that's when it clicked in my head: \n\n\n\nFuck those guys. The wanted me to do my job? Fine. From now on, I would do exactly what my job description says, nothing more, nothing less.\n\n\n\n\nThe next day, I came in early, opened the store, everything normal. Until the first tech-support call came in. I picked up the phone and, after listening to what the caller wanted, told them that I was only a sales assistant and therefore not qualified to answer their questions. Hanging up the phone without saying goodbye, a postman came in with some special documents for the store manager, requiring a signature. I said nope, sorry, not gonna sign that, I'm not a manager. After being informed that these were court documents and need to be signed for immidiately, I just shrugged and said: \"Not my problem, just doing my job here man.\"\n\nLater that day, after my collegue had arrived, we got a delivery of new product for the store. The delivery guy handed me the manifest, asking for a signature. Again I declined, stating that I was just \"doing my job\" and the manager would have to sign that. After making it clear to him there wasn't a manager on site, he left, taking all of the new product with him, product which we desperately needed. But I was beyong caring at this point. About fifteen minutes later, I got a call from Boss 1, asking me why noone had signed for the delivery. I told him that, as there was no manager on site, nobody there was allowed to sign that document. After a few choice words, he hung up the phone and I went back to work, chatting with customers and generally not caring about anything.\n\n\n\nHalf an hour later, Boss 1 and 2 descended onto me. They rushed into the store demanding an explanation for my behaviour. \nI simply replied: \"I'm just doing my job sir, just like you asked me to do.\"\n\nBoss 1: \"What the fuck do you mean? Then why has nobody accepted today's delivery or the documents we've sent you?!\"\n\nMe: \"Well, that's the managers job. I am not a manager.\"\n\nBoss 2: \"Yes you fucking are, what the hell are you talking about?\"\n\nMe: \"Uh, no, not only would my pay be pretty poor for all the work I am doing, my contract clearly states that I am a sales assistant and as such shall only fulfill duties related to that position.\"\n\nBoss 2: \"And who the hell is supposed to the managers job if not for you?\"\n\nMe: \"I don't know, but I would gladly do it, if you doubled my salary of course.\"\n\nBoss 1: \"Hahaha! (actually laughing in my face) Who the hell do you think you are? We can have you replaced with someone cheaper in a heartbeat!\"\n\nMe: \"Okay then, go ahead, I quit, effective immidiately. Bye.\"\n\nAnd then I just left. My remaining collegue, upon hearing me quit, also quit immidiately, leaving our former bosses wide-eyed with no employees to run their store. I had also taken the liberty of informing the board of health and labour about our working conditions, as well as getting myself legal counseling for some issues related to bonusses not being paid out. The store ended up having to completely shut down for about 2 weeks until they had a skeleton crew back together to run it.\n\n\n\nThe kicker? About a month after I quit and with my lawsuit for unpaid wages now pending, I got a call from Boss 1, telling me he wanted to accept my offer of doubling my salary to become the store manager. He said noone was willing to take the job now that word got around how awful things are in the store. The following conversation ensued:\n\n \nMe: \"Frankly Boss 1(I used his first name here, just to piss him off), I don't much like getting laughed at, so I'm afraid if you want me to come back, you're gonna have to quadruple my initial pay.\"\n\nBoss 1: \"What?! Are you insane?! We can't afford that, how are we supp..-\"\n\nMe: \"I don't give a fuck Boss 1, I really don't. But I've got an idea! How about you pull your head out of Boss 2s ass and just do your fucking job?\"\n\n*Click*\n\n\nEDIT: Wow, reddit gold? Thank you, kind stranger(s)",
        "permalink": "/r/MaliciousCompliance/comments/eirstl/would_you_just_do_your_fucking_job/",
        "comments": [
            "It’s so satisfying hearing when an employer denies a higher position from an employee but still expects that level of work, only for them to double back when shit goes wrong.",
            "As a reminder to all, always do a little more, but not too much. There's an equilibrium to life and going outside of it can be bad.",
            "Reminds me of a job I had a long time ago at a sex toy and lingerie store. There was no malicious compliance so I've never told the story here. But basically after my first two weeks, when I finished my training, every employee in the store quit. I was the only employee for about a year. I was working from open to close, managing the store, working the register, cleaning, doing inventory, all of it. And I did a goddamn good job. Sales even went up because on weekend nights working late, I started to become friends with all the people that would go to the bar next door. It was a regular biker hangout, and they would always come over and buy a bunch of random shit. Anyway, the owner finally brought somebody in for me to train. Awesome! So I trained her. A week later the owner informed me that she would be the new manager of the store. I was like what the fuck? I just trained her. Why is she the manager? He told me it was because she had previous management experience. I was like what the fuck do you think I've been doing for the last year? I have literally been working 16-hour days, every day, no days off, managing this entire store by myself for a fucking year. And you're going to make her the manager? Fuck you. I quit. And this conversation happened right in front of her. A few weeks later I was hanging out with some friends at the bar next door and noticed that the place was closed. I guess she quit too. Oh well.",
            "Delicious, malicious compliance. Nice one OP.",
            "I'm a boss myself. I hate it when actual bosses (in this case, I'm gonna use your bosses' example):\n\n* think that being a boss you just boss around\n* thinking an employee can do everything\n* only focused on numbers\n* not caring about real problems reported\n* can't seem to figure why the numbers \"fell\"\n* blame the people underneath them for \"numbers falling\"\n* laugh at their very own employees who are full time inside their store\n* when every employee quits, have no idea how to handle a store themselves\n* thinking \"I'm a boss I don't need to think why shit is falling apart\"\n* thinking low pay is enough for people who actually cares about doing their jobs and goes the extra mile\n\nAnd the lists goes on and on. But yeah, you gotta earn the actual \"boss\" title from the ground up.\n\n\\+1 for how you handled the situation.",
            "IANAL, but you also probably dodged a bullet there by not signing the court documents for your former manager",
            "> I was hired as a full-time sales assistant an international company making smartphones, TVs and other electronic gadgets. \n\nI swear... if that said \"*big national carrier that was the official handler for* an international company making smartphones, TVs and other electronic gadgets. \" I would so swear I know you.. Because a frighteningly similar situation happened here some years ago with one of our biggest carriers/ISPs and their stores. I swear my friend could've written this up until the point the boss called you back. And even that I'm not sure, my friend didn't mention is but that doesn't mean it didn't happen. Right up to the details of no water/fridge/etc in rest room.",
            "That job sounds like a black hole. Glad you didn't go back.",
            "This is some fucking beautiful MC! Shitty management sucks so much when you are a hard working employee, good on you OP for knowing your worth.",
            "Just a reminder to all, employers exist to extract the value you produce for them. If they're not going to pay you for it, don't do more than you're obligated to.\n\nAlso this story was a banger - good shit OP",
            "Glorious. I hope you're doing better now!",
            "This is exactly what contracted employees should do. If they want you to be a manager, sign you up. Else, let the employees do what you pay them to do.",
            "[deleted]",
            "I love when the \"give-a-shitter\" breaks!",
            "If there is one thing I will try to get my kids to understand when they get to working age, it is that there is a difference between being a \"go getter\" and a doormat. By all means, do extra duties, and even reasonable overtime to try to make a good impression. But the first time you see signs that your superiors do not acknowledge that work or give some schedule flexibility in return, go somewhere else as soon as possible, and don't worry about a two week notice.\n\nMy nephew worked at  a large national pizza chain, and was just about worked to death before he quit. They constantly scheduled him back to back shifts, or shift that might give him 8 hours to sleep (On paper, less then that by then time he got the store closed and prepped for the next day). When he'd ask for a day off or some longer time between shifts, they would laugh at him. When he finally walked out they called him 2-3 times to come back saying \"how valuable\" he was...He told them next time they should try showing that value by working with the next person to schedule times that didn't almost kill them.",
            "That ending was so god damn tasty. I’ve had a few bosses I wish I had the balls to do this too. Well played.",
            "\"Your gonna go places, kid\" as they used to say. Keep up that attitude and the work ethic and you will do just fine. If more employees had the freedom to stand up for themselves there would be a lot less shitty bosses.",
            "Just curious if your legal claim for unpaid wages ever was settled.",
            "My boss is the same. We work in Software Development though. A guy who's been working there for 10 years asked for a raise due to a couple of people leaving, and replacements not being found (it's a special technology), and the boss told him he was replaceable. Insanity. To this day we still haven't found anyone.",
            "Good boss: \"What problems are you encountering, and how can we help you solve them?\"\n\nBad boss: \"This is a perfect system. You must be the problem.\"",
            "For all the crap big corporate companies get, it's been family owned businesses that were pure cancer to work for. I will never work for a small mom & pop family company again. They treat any non family like they are just the lowest form of trash. The work you do will never, ever be acknowledged and all credit for work you do is given to one of the family members for hiring you. My pay barely ever increased, and when it did, even if just by a fucking quarter, all the sudden my work load was increased because another 25 cents equals a 50% increase in work load. Fuck family owned businesses so hard. It's why I dont give a shit when big companies run them out of town, maybe 1 in 10 give a shit and treat their non family employees with respect but fuck'em.",
            "[deleted]",
            "Boss 1's lawyer would like a word with him about directly contacting an ex-staffmember who is litigating the company.",
            "This is the content I'm here for. Well done, OP!",
            "Very, very nice",
            "Bosses all around the world don't realize until it's too late that we don't need them, they need us.\n\nThank god I live in a civilized country with strong employee protections and universal healthcare completely separated from employment.",
            "When I was 16 I worked at McDonald's in high school.\n\nA customer came in and ordered a crispy chicken sandwich. Sadly, we didnt have any cooked, newer guy fell behind. \n\nI told the cashier that we would be waiting about 7-8minutes for it, but they didnt hear me so I had to repeat myself. The customer tells at me over the counter, \"will you just ****ing do it already!?\"\n\nWhat bothers me most is that they apologize to the cashier and said \"I'm sorry, I just hate it when people dont do what they are told.\" On top of this, my manager wrote me up for the incident.",
            "You should have just quit instead of putting that last day in. The moment someone in an air-conditioned work environment tells you to fucking do your job, you already know you're going to quit and that they are never going to promote you. The extra day is undue stress on you, a power move that was always doomed to fail.",
            ">Boss 1: \"The interviews for those positions are ongoing, you will have new employees soon. But you were hired for a reason, so would you just do your fucking job?\"\n\nThe proper response here would have been, \"Yes, sir, I was hired to do A job. But currently you have me doing FOUR jobs because of mismanagement and chronic understaffing, and in violation of National Laws I might add.  Which should I stop doing?\"\n\nBut the conclusion was still satisfying.",
            "I applaud you OP.",
            "Ah god, that tasted good from here. Good on you.",
            "This... This is art",
            "As a person in a somewhat similar position at work right now, this read like a steamy romance novel. Good for you mate you're an inspiration.",
            "I like your story. The pacing was nice and the ending was nice too. \n\nAlso your story highlight something I learned the hardway too. They don't give a fuck about you. If you take on more responsibility they just assume it's the norm. They'll balk at paying more when ask for raise and such. It's better if you find another position in a different company. At least this is for programmer world.\n\n\nI hope you are at a better working place now.",
            "I rarely ever read posts of this length, but this one was so worth it! I wish I could have seen Boss 1's face on that phone call",
            "Truly satisfying. Beautiful story!",
            "Always disappointed when the MC results in quitting, because we don't a first hand account of how much worse things got from there. For real though, getting the hell out was the smart move there; even quadruple pay would have barely been adequate for what you were dealing with.",
            "Well played Sir!",
            "This post is a refreshing find in a world where everyone is demanding more of people that don't get enough pay and merits for it, and people that are basically just living for their jobs. I wish you all the best for this new year, and hope you will find better opportunities and people to keep in the upcoming days.",
            "The company i was at was the same. Took in 2 'freshies'  for a project in the red. Refused to pay higher than 'bench pay', stating insufficient head count. Those 2 were supposed to work in the project to 'gain experience' but they were in fact the only 2 onsite plus a lead and pm supporting offshore team of 30 (very crucial role). When threatened to leave only did the company relent.",
            "Bit late to this post but this is exactly what is happening to my bf right now. He’s a part time employee at a small convenience store. Now my bf is a great person, honest, friendly, hard working, gets shit done. This store doesn’t see many employees like this come through their doors often, so of course management take advantage of that. \n\nHe’s worked there for over 18 months now and they get him to do EVERYTHING outside of his pay grade. When he should be either on tills or on shopfloor stacking shelves, they have him lock up the shop at night, manage everyone else, manage money in the safe, run OTHER shops in the area when they have no staff, even fucking bake bread when they run out??? These are the roles of a supervisor, not 19 year old part time staff.\n\nDespite being on a 12 hour contract there was a time he was consistently working 40 hour weeks, the highest being 51 hours. Although now he’s at university abroad the hours problem has been mostly resolved and is now back to part time during the holidays (although definitely still works over 12 hours a week, but he needs the money so doesn’t mind)\n\nNow of course being the protective gf i am this has always bothered me. He’s always been quite a low-energy person, so this constant work takes a lot out of him, meaning he also can’t enjoy free time or time with me bc he’s so physically and mentally exhausted from working there. I’ve pointed out numerous times how they take advantage of him at that shop, his family and friends have too. He acknowledges it too, but he never did anything about it. He’s a student, he needs the money, so i kinda understood that and kept my mouth (mostly) shut.\n\nI think the final straw has come now during the christmas period. He was promised new year’s eve/day off if he worked christmas eve and boxing day. He instead ended up working both shift patterns anyway. And now today they expect him to run the shop and lock up after everyone’s gone. Now hes had enough. He messaged me today saying he was annoyed and if they say anything he’s gonna finally have that conversation with them. Hes a part time employee. Either promote him to supervisor status so he can do all the work they expect him to, or he remains a part time employee and simply does the bare minimum. I’m so glad he’s finally taking a stand on this it’s been over a year of this happening. I’ve sent him this post as inspiration, hopefully he takes some notes.",
            "I had one of that type of a boss a while back. He berated his employees all the time. I was just entry level but like the OP I was given other tasks to the point of I could do my original task. He laid into me about being lazy, not getting my work done and would not hear what I had to say. After about a month, I was doing critical tasks - management level - stuff that the business had to get done daily to stay open and stocked. Finally, I was in the back receiving a stock shipment, when I should have been doing my original job of floor sales, and the boss comes back and starts yelling at me, right in front of the truck driver. The shipment was maybe half off the truck when boss showed up. Boss starts to yell at me, and the truck driver looks at me and says, \"is this the way this MF AH talks to you?\" Boss starts to yell at the truck driver (independent carrier line) so the truck driver says, fine, MF, I'm out of here. I already got the signature for delivery. If you want the rest come by the depot and pick it up.\" Boss goes ballistic and grabs the truck driver by the shoulder. Driver spins around and raises his arm like he was going to deck the boss. Boss lets go, driver shuts the trailer doors and off he goes. Boss then decides to yell at me, but I got some spine and told him \"I quit. Now\" and walked out. I got a threatening call from boss an hour later, then one at closing time (I was the one who closed up). A week later I got a pleading call from the boss to come back. Nope. Turns out the boss was not doing the tasks he was supposed to do - instead getting everybody else to do his work. Regional came by and fired his butt.",
            "Story so good I have to question it. \n\nIt was smooth.... too smooth 🤔",
            "Perfect. I savored those words. Loved it. Well done OP. Reddit is proud.",
            "Malicious compliance AND revenge, in one story. Well done.",
            "Make sure you cross-post to r/pettyrevenge. Great story!",
            "If Michelangelo were alive today, he would make a statue of you in honor of all the retail workers out there. Bravo!",
            "Österreicher sitzen nicht einfach nur rum.",
            "Which  country, out of curiosity?",
            "God, this was so satisfying to read, thank you! When I was an intern, I've never been mistreated, but I'd always do way more than necessary. Despite that, now I am struggling to be hired from that same company. Anyways, I am glad you quit and I wish you the best!",
            "Don't do too much extra work for someone who's not prepared to do anything for you.\n\nIt's not worth the effort.",
            "Bosses never value a productive employee until the employee quits.",
            "The reward for giving away work above your pay grade for free is almost always: more hard work above your paygrade, which you are expected to do for free.",
            "I normally give it a month if I am filling in for someone.  After a month, if that person has not been replaced, I ask for a raise.  In the past I have gotten some nice raises for it.  Last time it was my boss that left, so I wanted the promotion,  I had done the work for the past month- they gave the job to the lowest preforming member of the team- so I left for about 10k more per year to a competitor the day after the have me an employee of the quarter award.",
            "That was very satisfying to read, thank you",
            "That last line is way too good to be true. I’m calling bullshit",
            "This makes me want to have an orgasm. Good job. I am proud of you for standing your ground. This is one of my favorite posts i have ever read on this sub.",
            "Great story, hope you have another job.",
            "Probably one of the best MC stories I’ve read",
            "This perfectly embodies this sub in my mind. Great story.",
            "This bosses fucked up so so hard. Glad you did what you did OP.",
            "If I had a fucking award, I'd give it to you. Bravo.",
            "Working for the private sector seems shitty",
            "This very much reads like a creative writing exercise but I enjoyed it",
            ">*Click*\n\nugh. i felt that in my soul.",
            "This was a great read before bed. Thanks op",
            ">Me: \"Frankly Boss 1(I used his first name here, just to piss him off), I don't much like getting laughed at, so I'm afraid if you want me to come back, you're gonna have to quadruple my initial pay.\"  \n>  \n>Boss 1: \"What?! Are you insane?! We can't afford that, how are we supp..-\"  \n>  \n>Me: \"I don't give a fuck Boss 1, I really don't. But I've got an idea! How about you pull your head out of Boss 2s ass and just do your fucking job?\"  \n>  \n>*Click*\n\nEPIC!!!",
            "‘Our phones are VERY competitive, it must be your fault no one wants them’",
            "That was so satisfying, thanks for sharing the justice boner. How did the legal case go?",
            " Nobody cares about loyalty or dedication. \nEverybody cares about profit so don’t think for a minute that it’s appreciated. (In terms if large companies/corporations)",
            "OP I love and believe you, and those higher ups are the worst sort of idiot bullies who immediately started to exploit you because you were nice. I'm so glad you called bullshit and realised it was bullshit rather than going along with it. I hope you're not jaded. \n\nOk, so with that as an understanding: \n\n> as there was no manager on site, nobody there was allowed to sign that document\n\nSurely anyone can sign for something being delivered?",
            "Where the hell do you live where people threaten you daily over smart phones lol I'll make sure never to go there",
            "This kind of shit should be completely unaccaptable. This is Banana Republic style management yo.",
            "This is the literal definition of this sub",
            "it's a cliche, but givers have to set boundaries because takers never will.",
            "That must have felt so good.",
            "Retail sales is 2nd to the bottom of employment opportunity.  The only thing worse is telemarketing.",
            "Whats it like living in a country with laws that protect workers?\n\nAsking for an American friend",
            "Ooof. I fucking hate managers and supervisors who see hard workers as just another body. \n\n\nIrks my soul",
            "So how did the lawsuit end? Did they have to pay you out what they cheated you out of? Hopefully!",
            "I love when imo the bad guys get their comeuppance.",
            "Yeah this is definitely real",
            "You basically experienced the American working environment for a couple months nice",
            "Hmmmm Korea I assume",
            "....god america sucks  \n\n\nall those caveats of \"where I live\"  \n\n\nWe really need stronger labor laws in this country, this kind of abuse is basically encouraged here...",
            "Totally true lol",
            "Cool story bro.",
            "That was an amazing read. Fuck asshole bosses like those. Respect your employees or you could get fucked over.",
            "Very nice work.",
            "That was beautiful, tastier than today’s dinner.",
            "Beautifully done OP. This is the kind of malicious compliance I dream about.",
            "glorious",
            "This made my day",
            "nice story op",
            "Bravo! I got to tell a shit boss to shove a job up his ass and walk out. Thank you for helping me relive that feeling.",
            "Glorious.",
            "So delicious. I love it!",
            "Q",
            "This really does read like it could have happened. I hope it did. Good shit op.",
            "> you know what they want to know.",
            "This is just a guess, but were you working for Xiaomi?",
            "Is this India?  This sounds like India.",
            "this is the best thing ive ever fuck read LOL",
            "this was a good read. well done my dude",
            "This reeks of revenge porn",
            "[deleted]",
            "This was a Japanese company, correct?",
            "Textbook malicious compliance. Amazing job you two.",
            "Ugh, your mom sounds like a lawsuit.",
            "I swear I have read this story before.",
            "This is an actual strike tactic, by the way, work-to-rule! Great for if you want to protest by bringing the workplace to a grinding halt, but can't afford to - or aren't allowed to - go on an actual strike. Nice work, OP!",
            "Did I just read Jim Halperts report on his experiences in Florida?",
            "this is a nice story for r/antiwork",
            "Amazing\n\nI bet that desperate call was like, just wow",
            "My heartrate doubled reading this.",
            "Such a satisfying story. I hope you are doing good op.",
            "Oh this is so good. I should not have read this before going to my own job",
            "Hell yeah!",
            "Wait, you have to do is look.",
            "A bad boss will have employees do what they say, A good boss will have employees do what they intended. \n\nGlad you got out of that shithole of a job lol.",
            "Can we do this for our polititiins?",
            "Best damn news of 2020",
            "BRAVO!!!!!",
            "I loved the story and how you got out of there but a true and honest thank you for holding them accountable after the fact. I’m so glad you’re fighting for your wages and called in the violations.",
            "love it! well written nice revenge OP",
            "You learned a valuable lesson.",
            "I wish I could give this story more than one upvote.",
            "This post hath erected my sails",
            "FUCK YEAH way to stick it to them. I hate hearing about shitty employers but damn is it ever satisfying hearing about them getting their just desserts.",
            "Solid gold.",
            "This is literally every company nowadays",
            "\\*slow clap\\* that was amazing. I wish I had the courage to do that at some of my old positions. Well done, sir.",
            "Holy shit! It must have felt fuckin glorious to hang up that phone call, excellent delivery",
            "Having worked a similar position back in my university days, this hit me right in the feels. Pretty much had to deal with the exact situation but my younger self lacked the tact to do what OP did. Nicely done!!",
            "Totally worth the reading! Great story!",
            "I’m hooked.\n\nAnd then what happened?",
            "Its baffling how dumb your bosses actually are to believe that they can treat employees like this and just expect everything to work, while the store is figuratively burning down around you.\n\nlol",
            "You are a GOD.",
            "And this is why labor is forever and always the superior of capital. This was beautiful.",
            "This could go in /r/ChoosingBeggars.",
            "Glorious!",
            "Hmmm, there's a Samsung store in Sheffield UK that closed then reopened a short while afterwards...",
            "Great novel. Couldn’t put it down",
            "Boy I feel smug and this didn’t even happen to me. I’m pleased as punch, OP, hope you’re doing better these days.",
            "How to Boss is not taught in school and it should be.",
            "DAGA KOTOWARU! https://knowyourmeme.com/memes/but-i-refuse-%E3%81%A0%E3%81%8C%E6%96%AD%E3%82%8B",
            "[removed]",
            "I actually believed you until the other employee quit as soon as you did. My bs detector went to like over 9000...",
            "Absolutely BEAUTIFUL!!!!",
            "this is GLORIOUS!!!!!!!!!!!!!!!!!!!",
            "This sounds, at best, slightly embelished.",
            "Going on sick leave requires doctors to sign off on it. It’s not a fuck this thing and you making that stupid statement completely ruined this whole complaint",
            "[removed]",
            "I love this so much.",
            "[deleted]",
            "Is English your first language? If so your grammar is atrocious. If not, then I suggest you attempt improving it."
        ]
    },
    {
        "post_id": "rm64n5",
        "author": "StormingSunshine",
        "title": "Want me to quote you on size instead of time? Okay you can pay more",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rm64n5/want_me_to_quote_you_on_size_instead_of_time_okay/",
        "score": 22222,
        "num_comments": 709,
        "created_utc": 1640182676.0,
        "selftext": "I am a store front window painter. I typically give quotes for jobs based on supplies and time to do the job. I recently had a business owner ask for a mildly simple design on a small window and gave her the price of 150 and did the job. The business next door wanted a very simple design on bigger windows and so I did the job for 250. After I painted they didn't like my price and wanted me to charge by square foot instead of complexity and time. I had them sign a contract stating the price per square foot regardless of design and that payment was due immediately. Then I measured the windows and the price came out to 500 dollars. Made for a nice Christmas bonus.",
        "permalink": "/r/MaliciousCompliance/comments/rm64n5/want_me_to_quote_you_on_size_instead_of_time_okay/",
        "comments": [
            "…huh. Maybe I’m in the wrong kind of art. \n\nI love that they signed the contract FIRST without even guesstimating!",
            "I run into similar situations as a welder. I had a lady ask me to make her a cross with only horse shoes and no visible welds. Easy enough. But she didn't want used shoes, she wanted new. So I gave her the price of each option. She insisted on new. When I gave her the final price she agreed. I make this thing then she backs out as I'm delivering it at no extra charge. So I ended up putting it up on my FB page for sale plus shipping if needed. I made an extra $200 on that thing. So the lady called me like a week later wanting her cross. I enjoyed telling her I sold it and made a nice profit on it. This is less malicious compliance and more petty revenge. But still.",
            "People who know nothing about art trying to determine the cost of art will never not be both frustrating and hilarious.",
            "What??? You charged them? Money??You should have done it for free, think of all the exposure and likes you would have gotten.",
            "This reminds me of my uncle that combines other farmers crops. He charges by the acre but one guy insists it be by the hour. Now my uncle figures it out to about the same but this guy generally has better than average crops and thus takes longer to harvest. Even after telling him this he still wants to pay more.",
            "This is why I never give employees shit about riding the clock or leaving early. You did your work? You did it correctly? I won't get yelled at for your fuckups?\n\nAwesome, here's your pay, go home and chill. \n\nHad a guy powerwash my house, he did in 2 hours what would have taken me all day. \n\nAwesome, here's your check. \n\nIf the job is done right then I don't give a shit about how long it took. I'll even pay more if something unexpected comes up. \n\nIf it ain't done right though, they hear about it until I'm blue in the face or get money back.",
            "I was a subcontract for a video job with an Investment Firm earlier this year. The person facilitating it and I settled on a price based on what the company was paying her. \n\nHer and I had a contract for a certain amount of money, but for some reason she didn't get one from the firm. So after I was about 3/4 of the way through editing 40 short videos for them, they said they weren't paying her as much as they originally promised because they'd just pay me directly and instead of the flat rate I usually charge for a project of that size, they wanted hourly. \n\nI was not impressed. But when the time came to send them the invoice, it ended up being about $800 more for them to charge hourly than what I had originally agreed upon with the other person. (She was a friend, so I was doing her a favor). They had no clue until she accidentally let it slip what I was charging her. They threatened to take me to court over it.\n\nSent me a big long email about it. I just responded \"You decided to change the deal by cutting her out. You wanted to pay my hourly rate so you did. I'm happy to highlight the emails you sent regarding this\".\n\nOnly time I heard from them after that was asking me to do all their social media posting because they couldn't figure out how to download the videos and then post them. \n\nBusiness went under six months later and they never even used the videos....",
            "did you intentionally choose a price per sq ft that you knew would go higher than your regular rate, or did you used some standard price that happily worked out to more?\n\nThey deserve what they got either way, just curious how much this was planned vs coincidence ;)",
            "this reminds me of when i used to wash windows as a side gig. i would charge $1/side/window so the window would be $2 inside and out (some chose just for outside). often businesses would jump at it because it sounded cheap. i could have 200 windows done in an hour and a half and it would be $400 (tax free). i was always met with blank stares and a WTF look as owners/managers would write out a check.",
            "Wow. Well done. I’m glad you got your money’s worth! Are you going to move forward with a standard contract for your jobs now?",
            "My family owned a restaurant and we paid our artist 7k to do a mural that was 15ftx30ft, took him a month to paint.\nHe could have charged us more but said we treated him so kindly and gave us a discount…\nWe gave the man free meals during his project and ended up being a close family friend",
            "What i hate is when the client says its an easy job. Shouldnt take too long.\nIt takes as long as it takes.\nThe actual job cost $10 an hour.\nPlus $90 an hour for the 40 years it took me to learn it.",
            "Tattoo artists know this game all too well.",
            "I've found that things like this boil down to the 2/3 rule. There are three primary aspects to every job:  \n1) Quality  \n2) Time  \n3) Price\n\nThe customer can pick 2 of the three, in most situations.",
            "Could you imagine being so cheap as to try to haggle over a few bucks in price, while also so stupid as to not run the math to see if you are going to save money.",
            "Do these people think that you would calculate a rate based on volume that would be cheaper than your rate based on time?\n\nYou set both rates. You are not going to willingly just lose money.",
            "Charging by the square foot makes no sense anyway. You could probably do a giant candy cane or whatever pretty quickly, but a tiny intricate design that takes 10x as long should be 1/10 the price?",
            "*never* assume you know more than the person you are paying to do a job. \n\nUsually doesn’t work out in your favor",
            "Haha, yes!  Business!",
            "Painting x $, design x $, cheap bastard priceless",
            "My mind went straight to the gutter when I read that title...",
            "Okay question; \nI’ve been seriously wanting to get into window painting but I have no idea how to get anyone to want me to paint their windows; how did you start?",
            "\"After I painted they didn't like my price\" - That's them admitting to being dishonest in business.",
            "Nice job OP. People just don't seem to understand the value of talent and good work these days. Glad you could be fairly compensated on an agreed assignment!",
            "Hahaha can't complain about that, it was the customer's request. I do steel work and normally quote time and materials too. Every once in a while I get a customer that wants a straight bid so alright here you go, time and materials +50% and itemized I guess.",
            "Painting a wall a solid color costs more than what people expect to pay for an actual artistic mural.",
            "...just by reading the contract they should have seen they were going to have to pay more. I don't understand people sometimes... nice to have that bonus though.",
            "I don’t understand what they thought they would gain from this. They look at a more complex, smaller piece and think “ah yes, the reason ours is more expensive is because it’s too simple.”",
            "Art stonks. /\\\\/\\\\/\\\\",
            "tremendous backfire on the store owner, and well done by you for making them sign a contract very clever! 👍🏻.",
            "\"This is a six foot window. That is a three foot window. What are you charging me 4 times as much as you charged them, it's only twice as big?!?\"\n\nYes, that window is 3x3 = 9 SQUARE feet. This window is 6x6 = 36 SQUARE feet. This window **is* four times the size of that one, and will take me roughly four times as long to complete. And now I have to charge you an extra $50 for math tutoring.",
            "This is the way",
            "Lol. r/stupidtax",
            "They didn’t do the math.",
            "As far as I’m concerned, any kind of artisan or tradesman doing something quickly is no reason to expect to pay less. It’s a perk of employing someone who is well practised and efficient. \n\nYou get to know your tools and refine your methods, things are done without mistakes that cost time and materials and the whole process is just much smoother and less stressful.",
            "It's like going into a fast food restaurant. The price is there. You want it, you pay for it. If you don't like it, you might get a redo. \n\nI'm sure those people didn't learn anything.",
            "Here's my quoting system. Sites 1 hour away worst case scenario 3-4 hours so 6 hours max. Might as well quote a day so 8 hours. It gets approved show up while in the area finish in a hour.",
            "I thought you were discussing having sex. I prefer large and a short amount of time.",
            "It's a wonder how some people stay in business. SMH.",
            "Every once in a while people should do the math for themselves.",
            "That is a cool job you have.",
            "This was my best laugh today. I love it when people shoot themselves in the foot like that.",
            "Wait what sub am I in?",
            "Say what you want. I prefer the consistency of knowing what and how much I'm paying instead of getting a discount today and a different rate another, all based on rhe whims of \"an artist\" when i want a worker.",
            "Maybe insurance was paying?",
            "Okay but I just find it extremely weird",
            "I've got a coworker who is redoing the floor near his washing machine.  He was telling me about it and was wondering how many boxes of tiles he had to get.  He kept complaining that it was difficult, since each type tile was slightly different in size.  I tried to explain it was done by square feet, not number per box, but he just didn't get it.",
            "They learned their lesson:  never to hire you again.",
            "Two months later…\n\n“Okay, looks like she was"
        ]
    }
]