[
    {
        "post_id": "stlz2e",
        "author": "MisterBowTies",
        "title": "Manager changed my schedule as a power move, so I stuck to it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/stlz2e/manager_changed_my_schedule_as_a_power_move_so_i/",
        "score": 21564,
        "num_comments": 600,
        "created_utc": 1644982842.0,
        "selftext": "A few years ago I worked at a physical media chain in New England. My location was new so when I was hired I was interviewed by the district manager and a higher up because the manager hasn't been hired yet.  When i applied I  made a very small window for availibility, but I was also willing to close or work later shifts and work all weekends, so they agreed, and even though it was a set schedule I did come in multiple times to cover someone else. The manager they hired was an absolute control freak, it didn't start bad but it got ridiculous. She HATED the fact that I had a set schedule, not because I was needed at other times, I was working the least desirable shifts,  it was because she didn't control it.  She even said that. About a year and a half of working there, and her dropping hints that \"we might need to renegotiate my schedule\" again, for no actual reason,  she scheduled me to come in 4 hours earlier on the day before my weekend \"just to shake things up\". I brought it up and she told me to make plans , essentially just get over it.  I was mad but I did just that,  my wife and I planned a date night when I would have normally been working. On the day in question I get a call saying that the person who was closing that night instead of me (she swapped me with a less reliable employee)  had called in sick and I needed to come in my normally scheduled time.  I was so happy to tell them that I was sorry but couldn't change in such short notice because I made plans. \n\nThe assistant manager (who was just as giddy as the manager was to tell me about the shake up) had to do a split shift and cancel a tinder date because I did as I was told and made plans instead of being upset.",
        "permalink": "/r/MaliciousCompliance/comments/stlz2e/manager_changed_my_schedule_as_a_power_move_so_i/",
        "comments": [
            "My go to on days off hass always been \"I'm at a bar/home drinking, you really want me to come in?\"",
            "Hah, I love this.\n\nSomething about management in retail seems to attract control freaks.\n\nI have a similar story - for the longest time, my schedule was fairly normal and I had nothing to complain about - I'd often work morning or mid day shifts. Sometimes I'd need to close, then open but it wasn't really a problem since it didn't happen very often.\n\nThen two things happened. First, the person in charge of scheduling moved to another store, and second I started having to travel by bus. Neither of these things was a problem *at first* but it quickly became apparent that the new person in charge of scheduling *really* wanted me to constantly close and open two or three times a week. Since traveling by bus meant that I spent an average of an hour or longer traveling between home and work, I actually could not *get* an eight hours sleep between shifts.\n\nI spent a good month trying to explain the problem to her in a way she'd understand, and she kept telling me it was just a temporary thing from one week to the next. Finally she got tired of my complaints and told me that this was my problem and she just didn't care. She would not budge, or do anything to help me period.\n\nShe made it my problem, so I solved it. I changed my availability so I couldn't close on any day. Angrily she told me I couldn't do that, that I *had* to be able to close or she'd cut my hours. I called her bluff. Aaaand, yep. She did. For one week. Turned out, she couldn't afford to *not* have me do earlier shifts after reassigning people to close.\n\nHaving a stable schedule where I can sleep regularly is a lot easier on me, I gotta say.",
            "I can relate. Lol.\n\nI was a full time employee at a job and the manager would cut my hours AND ( very immaturely ) would put all the employees names on the schedule in order of who he liked best to worst. One of the last times he fucked with the schedule was when he dropped me from a 5 day week down to 2. When I complained to him I got a \"sucks to be you\" answer back. He scheduled very unreliable people to work 5 days a week for the next 3 weeks. \n\nAll the people he scheduled flaked on him. One quit. One was not even available to work the hours he scheduled, but he did not check. I guess he was just too excited to take my hours, and demote me to the bottom of the schedule.\n\nHe then texts me that I am now on the schedule at 5 days. I shot back a text telling him I was not available, as I took hours at my pt job when he cut my hours. He was pissed. Lol\n\nFelt great",
            "I had a similar experience with my second ever job, working at a movie theatre.\n\nI specifically took a night off of work to go watch an opening night movie with my dad. The thing with about my dad is that we don't really have a whole lot in common, but we both love superhero movies. It's basically the only thing we bond over and it means a great deal to me.\n\nSo we were going to watch one of the earlier MCU movies, and I booked the night off about a month in advance. I okayed it with my direct reporting manager and the location manager. I told them that it was going to be an opening night for a widely anticipated movie and I wanted to make sure that there wasn't going to be an issue. I got the green light.\n\nAbout 3 hours before the movie started, my direct manager calls me and asks if I can come in as the two other people working my shift came were both sent home due to being ill (nasty flu that was going around the theatre at the time).\n\nI told him that I had the time booked off a month in advance and that both him and his boss signed off on it. \n\nIn no uncertain terms, I was told that if I didn't come in that it \"may be seen as you not needing the hours and therefor they could be given to someone who was more in need.\" At the time I didn't really realize that I was being blackmailed into coming into work or getting fired.\n\nI ended up going in and covering the absolute hellish nightmare of a shift that was left for me and my dad went on to see the movie without me, which really pissed me off because (and this rings true to this day) I have seen every MCU movie on release night with my dad, with the exception of this one.\n\nMuch to my manager, his boss and corporate's chagrin, I had already covered someone elses shift that week and was already over 40 hours. Now, considering I was \"part time\" (in this case, it means keeping me at a solid 39 weekly hours as to avoid giving me benefits), this meant that I was entitled to overtime. It seems like nobody bothered to double check this schedule because I had a total of 60 hours that week due to shift coverage and the impromptu last minute call in.\n\nMy manager was fired after corporate called and gave his boss hell for scheduling me well over my hours for that week. Due to the aforementioned bug that went around the theatre, it meant that I also couldn't reduce any upcoming shifts I had as I was one of the only ones crossed trained across all of the different areas.\n\nAt 16 years old, seeing that next paycheck be nearly double what I was used to seeing was a bittersweet moment, although I still would have much rather had spent that time with my dad.",
            "I remember working for a  company that insisted everyone sending in a availability sheet before being hired. Well I  gave them one that said I was available 24 hours a day 6 days a week except for one day where I was busy for a 12 hour period, in the evenings of a day in the middle of the week. One day when I allow myself to be free from anyone's commitment.\n\nThing is, they never gave these availability sheets to the schedulers. First 2 weeks,  they'd ask if I could work that day and I would say no, why can't they see my available hours?? Turns out that management never hands those sheets in to those that need the information. Needless to say I never really lasted long there",
            "As someone who had to do scheduling, I appreciated those that had a set and reliable schedule as that provides fewer shifts to worry about.  It actually makes the job easier and more predictable for everyone.",
            "I worked for a copy center and the owner of most of the Arizona locations decide that from now on, everyone needed to punch in within the 60 seconds of their assigned time. If they didn't, they were considered late.\n\n8:00 on schedule, at 8:01 you were late and docked 15 minutes pay. Two late arrivals would result in a write-up.\n\nHere is some background, prior to this policy, most employees stayed later than scheduled to take care of customers or orders they were working on. It was commonplace and employees did it without any concern or question and customers loved it.\n\nAfter about a month & a half, every employee at every location was written up except my store and one in Ahwatukee. (Ahwatukee was the store closest to the owner)\n\nMy store was visited by the owner who was proud to say her idea was proving to be working at my location. I then informed her I had altered the timeclock, so it was 7 minutes slow. I explained that I only docked pay if they were 8 minutes late.\n\nShe wasn't happy and I was expecting a potential termination with my disclosure. She asked why would I do that against her wishes, and I replied that her policy was anti-productive and destroying store moral. I also added it created a danger that was going to, \"*likely get someone hurt or worse rushing to work*\".\n\nNo termination, but she had a habit of delayed retaliation, A week goes by and Ahwatukee has just 1 female employee who is the last employee left without a write up (also the owner's favorite employee). She was running late and called into the store to have someone unlock the backdoor so she could slip in as quick as possible.\n\nThe girl at the store was confirming that she would unlock the door when she overheard the car the girl was driving being hit by an 18-wheeler after the car ran a red light. She continued to listen as the girl in the vehicle drew her last breaths and died.\n\nThe timeclock policy the next morning was rescinded, all write-ups wiped away, the owner paid for the store workers mental health counseling and covered all the funeral costs.\n\nI know when the owner heard what had happened, with all the details, she could remember our conversation, hear my words of warning and feel their sting.\n\nEven with rescinding the policy and erasing any effects, she had changed the employee mindset forever across all her stores. No one and I mean no one would stay past their scheduled shift. The productivity fell 10% - 15% or more because employees passed work on rather than finished it. The norm became that the last 15 minutes of an employee's shift was used to shuffle 30 - 40 minute of work to the next shift.",
            "When I left retail hell for a better job, I told the boss (who basically pushed me to quit with his micromanaging bullshit) I would be willing to work part time from 4:30 PM to closing time, *Wednesday through Sunday*.\n\nI explicity told him I would not come in on Monday or Tuesday-those were my days off at my new job, and I was going to have two days to myself no matter what. \n\n\"Yeah, sure, okay!\"\n\nThe very next Tuesday, the phone rings.  \n\nMe: Hello?\n\nCoworker: *Wellread!  Where are you!?*\n\nMe: At home, in my living room.\n\nCoworker: *Are you coming in tonight!?*\n\nMe: No... why *would* I?\n\nCoworker: You're on the schedule!\n\nMe: Nope.  I told [Manager] I wouldn't work Monday or Tuesday.  I made myself pretty clear.\n\nCoworker: Well, he put you on the schedule!\n\nMe: Well, then he's on crack, because I'm not coming in!\n\nCoworker: Well, what am I gonna do!?  I have a doctors appointment at 6 o'clock!\n\nMe: What time is it now?\n\nCoworker: It's 5:50.\n\nMe: Well, you'd better get going if you're gonna make that appointment!\n\nCoworker: What about the store!?\n\nMe: I really don't care.  It's not my problem.\n\nCoworker: ...\n\nMe: ...\n\nCoworker: ...\n\nMe: [CLICK]\n\nIt felt great being in a position where I could finally basically tell those jerks I was working to live, not living to work.",
            "My first ever job was as a cashier at Walmart.  Started end of June, was starting college in August.  I handed them my class schedule, said i needed at least half an hour on each end in order to get from the college there.  All my classes were between 8 AM and 4 PM.  I worked 10-7 all summer.  Then suddenly, the first week of college, im scheduled 8-4, M-F.  Went to management and said they had my class schedule, why did they schedule me -only- during class?  They said i wasnt allowed to change availability within 90 days of starting, despite that being my availability listed at my hiring.  Then said the only one who could change was store manager, who conveniently went on vacation first week of college.  Yea, i never went back",
            "Holy fucking shit. How do people look at something that is working fine and decide they need to take a big shit on it because they don't feel they've asserted dominance? \n\nThis is literally work they don't have to do. Them doing work is contributing to employee churn and losing money for the business. \n\nThe only person that wins is the tied up person in their basement that takes less of a beating because they've managed to hurt people outside their torture dungeon.",
            "Many moons ago I was the only full-time employee in my department, (this was before Sunday trading) my day off was usually a Wednesday.   \n\nTuesday nights I would have a few drinks, one Wednesday I get a phone call from the Department manager demanding to know why I wasn't in, I told her it was my day off.   \n\nshe told me it wasn't and that I had to get there immediately, I told her I needed to shave 1st, nope she wanted me there and then.  I arrived at work looking and feeling rough, she pulled the schedule to show me I was due in, I argued with her that the schedule had been changed.   \n\nShe was so sure she was right that she got the master copy, oops she was wrong, someone had changed the schedule, it was my day off, I didn't get an apology but I did get reimbursed my travel costs and got paid a 2-hour shift at time and a half.  Much better than an apology",
            "I never understood why scheduling was so hard. When I finally got to a position where I was doing the scheduling, it was incredibly easy as long as their weren’t too many PTO requests. I think In the two years I did scheduling there I only denied one person a day off they requested because so many people put in a request for that same day way ahead of time or had school so they were normally off and her request was submitted like a week before that day off. I explained the situation and she was perfectly fine with it.",
            "😂😂😂 Oh I really wish I could have seen her face. What happened the following week?",
            "Once worked for a well known video game store while working a full time job at a dealership. Basically just wanted some extra cash flow for the holidays, but told them exactly what days and times I worked at the dealership, letting them know I was unavailable because I wasn’t letting a little job fuck up my main job.\n\nThe second or third weekend, they called me on a Saturday, which I had indicated I can only work after a certain time, asking why I wasn’t there at 8am, and told me I should’ve called in to get the schedule. This happened a few times. I basically just stopped taking their calls after a while and never truly told them that I quit, oh well.",
            "Worked at a smoothie shop for my first job.\n\nAccording to my contact they would need two weeks notice about my availability and, if so, wouldn't schedule me and i wouldn't need to find a replacement if they did.\n\nI scheduled off a Saturday morning for an Easter parade as i was in marching band. I let them know at least a month in advance. The schedule came out, i was on it, i told them, they told me to find a replacement, i told them i wouldn't per the contract, they told me i would. \n\nI didn't. They called me surprised as fuck because i was an awesome worker, but still chewed me out over their mistake. Told them i had scheduled that day off well in advance and that they messed up by not scheduling someone. Told me I was disrespectful, off all schedules and essentially fired unless i came in to grovel and apologize - i told them something like \"gotcha\"  and hung up. Decided i was done working there,  ignored all their calls trying to reach me, and enjoyed the rest of my senior year of high school without a job.\n\nShowed up like a month later to buy a smoothie and the general manager basically begged me to come back and that they had made a mistake, and he apologized to me for what the store manager had done. Seriously, i was a great worker and made the fucking best smoothies and sandwiches because i love smoothies and sandwiches, i was really reliable, it was a really sweet job aside from the store manager. I laughed, refused the offer, and took my smoothie.",
            "Worked 2 jobs in college and was looking for a 3rd. New restaurant opened and I’m like heck yeah let’s do this. They held a mass hiring and with my resume I also submitted an availability schedule JUST to be sure they understood and were willing to work with me on that.  After I got hired, submitted it again to the manager. First week after training I am scheduled for a shift in the middle of my class. No biggie, I call and get it sorted with the assistant manager. Next few weeks go the same way. Scheduled on a day & time I clearly outlined as NOT AVAILABLE. Assistant manger that kept fixing my schedule quits, new manager takes over. I show up for a shift and leadership is having a meeting in the main room I am stocking condiments on all the tables. I hear new manager say “this one here (my name) never shows up, I don’t even think she’s real” I look up, raise my hand and say HI IM (my name) REMEMBER WHEN I CALLED YOU ABOUT MY SCHEDULE THE OTHER DAY, I BROUGHT ANOTHER COPY OF MY AVAILABILITY. They quit and not long after I did too because kitchen staff were useless and caused me to lose soo much in tips because they were not able to keep a manager either.",
            "I never understood why it is so hard to plan out schedules in advance.   \n\nMy friend works at a grocery and gets his weekly schedule a day before that week starts.\n\nAnd most people that work there would be willing to work a set schedule, so why wouldn’t they do at least a month to month schedule?",
            "When I ran restaurants, I did month long schedules. Most staff had a predictable schedule yar round. \n\nMade hiring easy too. \n\nWhy management chooses to focus on the most mundane aspect of the job boggles my mind.",
            "I used to take the worst shifts and cover if people were sick when I was working for a Discounter back in 2016. I was working part-time for max. of 20 hours a week according to my contract but I regularly worked for 30+ hours a week. Shifts were given out on thursdays for the upcoming week. It happened a couple of times that I was working until 8 pm on a friday so I made plans for my evening after work and I once got asked if I could stay for 2 more hours (shift started at 1 pm) and when I told them that I can't cause I made plans they called me inflexible and an egoist. From that day on I stopped taking extra shifts for the next 3 months and later quit. After leaving the job they still had to pay for 2 full months cause I had so many overtime hours.",
            "I love it when a(n assistant) manager manages to cock block themselves.",
            "My wife returned to work at a retail store after a few years hiatus because of our son.\n\nShe chose a store outside a mall because she wanted to see sunlight…\n\nShe wanted 3 * 8 hour shifts a week but the ended up being 6 because you would need to issue breaks etc… fine.\n\nAfter 2 weeks of schedule aggravation, I told her just stick to your guns.\n\nOtherwise that won’t be 3 days of shifts but 24 hours over 7 days a week.\n\nAfter her departure, they asked someone to open the store and work for 3 hours. Clock out go home. Come back and work the last 3 hours to. Basically a 7 hour unpaid break.",
            "In high school I worked at McDonald's and they really respected the availability of it's employees. Except for every single half day of school. All high school students would be scheduled to come in early on half days of school which always led to people like me saying \"um no I can't I have to babysit my brother on half days.\" It was infuriating because it'd happen every single time.",
            "I have never understood why retail seems to be so resistant to having set schedules. My dad, it is retirement, worked at Home Depot. And I was planning to come out to visit him, and he said something about not knowing his schedule. I was like, what? You’ve worked there for all these years, and they can’t tell you which days you were supposed to work until right before? It just seems like such a lot of work, to redo the schedule all the time. I get that you might be asked to cover someone who’s requested their normal time off, or you and a friend might decide to swap days one week\n\nBut I didn’t understand how it benefits managers to have to do that scheduling work over and over again. Just have a set schedule, and deal with minor tweaks as people bring them up.",
            "I just love when this shit backfires! \n\nKinda unrelated but it just reminded me of my first job. After I became part of a work council my boss tried to make me quit my job since he couldn't legally fire me and I was a serious pain in his ass.\n\nI didn't leave for another year and a half. He started not paying me on time or only partially in an attempt to finally get rid of me. Didn't work. \n\nThen he had the (bad) idea to double my hours in a final attempt to make me quit my job. He knew I couldn't work full time, he couldn't even force me to work more than my contract said. However, to his surprise, I gladly accepted the new workings hours and payment - trap card activated! \n\nBecause due to not paying me on time repeatedly before, I was already in contact with a lawyer since I wanted to resign prematurely (with substantiated reason). I did so the first day of the next month when my new working hours applied. When resigning prematurely with substantiated reasons you immediately stop working for your employer but still get paid for as long as your period of notice is, in my case: 3 months + the remainder of the month (basically another full month). He had to pay me for double the hours and I was loving it.\n\nBut that's not all. Because additionally I then got a compensation fee for him doing all these shenanigans as well as payments for unused holidays (I had 2 1/2 of unused holidays). And guess what? That payment scales according to the payment from the last 3 months of employment. You know, the time when I didn't work a single hour but got paid double the money. \n\nThat all was not at all apparent to him initially until my lawyer sent him my legal claims. He was furious and even threatened me over the phone which cracked me up (my lawyer was VERY upset about my behavior in that instance, I said some things I shouldn't have said tbh). But well, it all worked out fine, I got a better job while I was still getting paid by that idiot and even met him a few years later in a business meeting. I decided to not be a dick about it. He ignored me.",
            "I wonder when employers/managers will recognize that their most important asset is their employees?",
            "Nice! I had a manager pull this crap and try to make it even worse when i have my notice. (back to back to back schedules.. So 11p-7a, 3p-11p, 7a-3p and so on. Came in on my last week for a 3-11 when she had worked 7-3 and told her to change it. She snarkily replied \"nope you'll just have to deal with it.\" And tried to walk out the door. I stopped her and said actually you will. Bye. and walked out. She didnt realize a 2 week notice is not an obligation.. its a courtesy to her.",
            "Glorious.",
            "I don't know why they bother even offering availability sheets. I have never known an employer to stuck to them.",
            "You build your life around the crappy shift nobody wants to do and she’s complaining about it? The mind boggles.",
            "It highlights one of the weird phenomena of management.  That those character traits that allow someone to rise to a position of power actually make them a bad manager in many cases.  Like this person could probably be relied on to have an inch perfect store.  Because they are a control freak.  But when it comes to flexibility with humans they can't get past their controlling tendencies.",
            "I had a similar issue working at McDonald’s when I was at uni. I told them, during term-time I could’ve work night shifts on certain days because I had 0900 lectures. \n\nThe first time they mis-scheduled me I worked it but told them I wouldn’t do it again. The next week they did it again and when they called asking why I wasn’t at work, I just quit. Don’t respect my time I won’t respect yours.",
            "I used to work in a Pizza Hut about ten years ago in South Dakota. My manager at the time was a raging alcoholic and she would regularly show up to work drunk or just not show up at all. I remember her calling in sick one time and she called me saying I had to come in to cover her shift to which I replied \"no\" because it wasn't my responsibility to drop my plans for her drunk ass. So weird to me people thinking that they have to be submissive in the face of such bullshit.",
            "I was working at a franchised McDonald's location and, to be fair, when I hired on it was being managed very well by the franchise owner's son.  Very 90's style management, encouraging enthusiasm, but mostly treating employees fairly.  Cost of living was cheap in the area and the \"fifty cents over minimum wage they offered was sadly competitive for the area.\n\nI'd been working there about eight months when I decided to go back to college.  I was too old to qualify for most of the McDonald's scholarships, but I was still highly encouraged to do this by the store manager and I was promised, in writing, that I would always have the ability to restrict my schedule as needed to accommodate my classes.  I thought it was excessive considering this was a stupid part-time, minimum wage job.  I only held on to the paperwork because I thought it was silly.\n\nAnyway, a year rolls by and Franchise Owner's Son gets promoted and a true witch takes his place.  The worst kind of middle-management control freak that you've ever seen.  She treated the store as if it were her own little kingdom.\n\nAt the time (I don't know if it's still done this way) the store manager in a given location within a franchise got a big end of year bonus that was related to both the total profits earned by the store and by how many \"milestone\" type goals the store hit for both store improvement and community betterment.  It's a tiny store in a dinky town so it's never going to show much profit in dollar amounts, but if she can show on paper that the store is going above and beyond in self improvement and community improvement, her bonus gets bigger.\n\nSo while she really pushed us to take advantage of getting a small bonus for filling out a form saying we took so many credit hours.  But, at the same time, she wanted to \"promote\" all of us as much as possible to Crew Trainers and such.  You get like and extra nickle an hour but have a lot more responsibilities, including requiring an open schedule.\n\nI'd already been there almost two years by that point.  On top of that, I was twenty-five years old, I wasn't one of the ignorant high school kids that she was used to dealing with.  I just wanted to do my job and earn enough money to pay for my books.  I didn't give a crap about her games.  I had a perfect record and the store had a policy of never firing anyone, anyway.  They would just stop putting them on the schedule until they eventually found another job.\n\nShe tried that with me, but since she hired people for reasons other than their reliability, they always ended up short-handed and several of the other managers liked me.  So I'd get my ours and then some by being \"called in\" more often than not.\n\nI had classes from 4PM to 11 Monday through Thursday, so she deliberately scheduled me to close Sunday night and open Monday morning through Thursday morning.  Ironically, this pissed a lot of other employees off because it gave me every   \nFriday and Saturday off.  Had to or else I'd go into overtime.\n\nWe eventually reached a detente, due to events that were a much longer story.  Suffice it to say, I eventually quit by storming out in the middle of lunch rush and vowing to never set foot inside the building again.  Over-dramatic, yes, very much so.  But it felt really good at the time.\n\nAnd the really sad part is that she's hardly the only manager I've seen to commit themselves so deeply to these petty power games.  And she had more motivation than most.  Some don't even have money on the line.",
            "I applied for a retail job for a second job, and gave my availability on my application as weekdays open-3. After a couple years we had a new manager who pulled the same thing, she started cutting my hours because my availability wasn’t good enough. I wasn’t some young kid scared of loosing the job so I just pointed out my availability hasn’t changed from what I wrote on my application. \n\nShe ended up giving in because I was one of the few people that could handle the store alone, because there was always supposed to be at least two but the managers had morning phone meetings a few times a week.",
            "Similar thing happened to me at bk. I said I won't work weekends. I was scheduled to work a weekend. Told them right out to redo the schedule because I wouldn't be there. They did because they needed me much more than I needed them. I eventually got promoted to crew supervisor then quit. .",
            "One time two other employees and I called in sick for our job . We were the only three that could do the job . The manager that told us two days earlier said that he could get \"anybody\" to do our job got fired because he was expected to fill at least one of the jobs but he couldn't do it . Point made . Nobody has bothered us since .",
            "Happened years ago where I work.  An old nurse would jokingly tell people \"great work back there, you go home now.\"\n\nA new nurse who never met the guy took it literal and left mid-shift.",
            "Lol, I would never answer any correspondence after my shift. Try calling me. It's on silent.",
            "Oh no not a tinder date how will they EVER survive",
            "Sounds like insecure management. How the hell do these jokers get hired.",
            "Asses gonna hole, no matter what field you're in.",
            "If the manager ever makes a stink about you saying no, tell her you will be informing the district manager that you will be going to your set schedule, and nothing else.",
            "Wait was it the assistant manager or manager who fucked you? \n\nBecause from your last paragraph In which you say the assistant manager who tipped you off about the shake up had to cancel a tinder date it moreso sounds like you fucked over the assistant manager than the actual manager unfortunately and he was helping you.",
            "Reading all these posts makes me really appreciate having a union.",
            "On days that I don't work I put Bailey's in my coffee. I always have a \"can't come in, been drinking whiskey\" excuse. \n\nFor one of our Christmas days somebody got me a small bottle of midtier whiskey. I thanked them kindly and told them it was a very nice brand. I've still never drank it.",
            "And over here they just change the manager that makes the schedule every 6 months regardless of if they know the crew that works.",
            "I had a part time job many years ago when they changed the manager. The new manager hired an extra person and cut everyones schedule by one shift to 'make everybody hungrier'.\n\nHer reasoning was that people would be more eager to come in when someone else was sick if they were feeling the pinch. Not that this was a problem for our store of course.\n\nI explained that I needed all my shifts to make ends meet, and if she continued I would need to resign and find another job that gave me enough shifts. She quietly gave me my shift back although things continued to suck for other people until someone else quit.",
            "well, you seem to have made her an 'out-of-control' freak. \\[pity...\\]",
            "what is a \"physical media chain\"? Are we talking, like, Newbury Comics?",
            "Didn't I read this exact story a couple months ago? Or am I just getting bad deja vu?",
            "There is no requirement that you answer the phone. None.",
            "Whats with these excuses?\n\nI just say 'no'.   \n\n\"I don't feel like it.\"...  or \"Good Luck\".",
            "Why do managers feel the urge to change something thats benefiting everyone 🤦🏽‍♂️",
            "where is the malicious compliance?",
            "Do you feel like Malicious Compliance stories are getting boring lately or is it just me getting dulled to them?",
            ">The assistant manager (who was just as giddy as the manager was to tell   \nme about the shake up) had to do a split shift and cancel a tinder date...\n\nYou work with losers.",
            "Newbury comics?",
            "[removed]",
            "u/RobobutlerMMXV bring champagne! OP here is a genius, and we need to celebrate 🎉",
            "“ About a year and a half of working there, and her dropping hints that \"we might need to renegotiate my schedule\" again, for no actual reason, she scheduled me to come in 4 hours earlier on the day before my weekend \"just to shake things up\". I brought it up and she told me to make plans , essentially just get over it.”\n\nTotally lost track of the story here. She told you to make plans? For what day? Huh?",
            "[removed]",
            "I thought they weren't allowed  I change our shifts for scheduled employees in England without the employee's consent",
            "clear as mud",
            "So you said no to coming in a off day? How malicious of you.\nThis doesn’t belong here",
            "Sick minded people.",
            "I love figuring out how to get pay back on these dickheads."
        ]
    },
    {
        "post_id": "imouwg",
        "author": "None",
        "title": "Women can't wear pants in your courtroom? Alright, then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/imouwg/women_cant_wear_pants_in_your_courtroom_alright/",
        "score": 21559,
        "num_comments": 800,
        "created_utc": 1599255330.0,
        "selftext": "One of my law school professors was a public defender (an attorney who represents poor criminal defendants) in Philadelphia, Pennsylvania, before he came to my school. He told me a story about a particularly uptight (read: sexist) male judge and a fiery female public defender who did exactly what he asked.\n\nCourt begins. The attorney walks in, wearing a conservative pantsuit that wouldn't be out of place in any courtroom in America. The judge, an old man, raises his voice, points his finger at the attorney, and says, \"Do not come back into my courtroom until you are properly dressed. Women do NOT wear pants in my courtroom.\"\n\nThe attorney does not respond. She simply walks out of the courtroom.\n\nA few minutes later, she returns, wearing her suit jacket and...that's it. You see, her jacket was cut long, so by itself, it fell to a little bit above her knees. She simply walked into the restroom, took off her pants, and came back to court.\n\nThe judge never enforced that \"women cannot wear pants\" requirement in his courtroom again.",
        "permalink": "/r/MaliciousCompliance/comments/imouwg/women_cant_wear_pants_in_your_courtroom_alright/",
        "comments": [
            "At my old job, skirts were allowed but not shorts, so one male co workers got himself a skirt. Nobody ever said anything. One day management asked him if he wanted to say something for pride. He did, he said : \"I'm straight and my legs get hot, thank you.\" In front of 200+ staff.",
            "As my uncle (an ADA) once said; \"Lawyers are the masters of malicious compliance.\"",
            "That is a very Philly thing to do :)",
            "Must be a philly tradition.  Students at Penn in the 70s got rid of the \" jacket and tie must be worn to the dining hall\" rule by wearing jackets and ties with no shirts and boxers.",
            "Nice. USPS should do this too with their \"no shorts\" baloney.\n\nEdit: I'm not talking about current policy. Apparently nobody knew about the push to ban shorts in post offices a few years back.",
            "My wife and i had to go to the courthouse for paperwork, but had to be in the courtroom for a moment first.\n\nI was wearing shorts, as it was tennessee summer. The bailiff ANGRILY removed me from the room, chewing me out about \"respecting the court and office given to public servants\" which is the worst kind of bullshit.....so i came back 20 minutes later with the emergency sweatpants wifey kept in her car. \n\nBright pink, capri cut, juicy on the ass. I am a bearded, chubby guy who eternally looks sleep deprived. It made a wonderful contrast.\n\nThe bailiff looked like he wanted to fucking murder me, but couldnt say a thing. I am still sooooo happy about that, 8 years later.",
            "Old fart was embarrassed. Makes me wonder how many more women he looked/talked down on over the years just for not fitting his antiquated stereotypes..",
            "Did my work experience aged 17 at a solicitor's office and it was a rule that women couldn't wear trousers to court whether magistrates or crown. I cycled everywhere and nowhere had changing facilities so I bought some culottes.",
            "Thats a wtf moment for the people in the corridor outside the courtroom",
            "I did something similar to my grandfather. When I was a teenager, I had a pair of boardshorts in raucous colours. My grandfather objected, and said “take them off!” So I downtrou’d there and then. He burst out laughing and said he couldn’t complain, I did exactly what was asked of me.",
            "This reminds me of a story a lawyer friend told me about a pregnant lawyer. Apparently, even if you're visibly pregnant, you're still expected to dress professionally, even though a properly fitted set of professional garments is only going to fit comfortably for a relatively short time for a pregnant woman. \n\nThis pregnant colleague of my friend had to give some important talk (outside of court) while dressed professionally, and standing for the talk. When the talk was over (I want to say it was at least 1 hour, perhaps more), her boss caught up with just as she had hurried back to her office. He said he had something important to share, but she retorted \"I am changing out these clothes right now. If you want to talk while I change, fine by me. But I'm not spending another second in these clothes\" and proceeded to start changing clothes with her boss in the office. Her boss fortunately got the hint, and left the office quickly to give the pregnant woman her space.",
            "She definitely has me beat, but I'll share my story from the opposite gender.\n\nI got some grief from a judge for wearing nice shorts, the kind you expect to see at the golf course or Church. It was late June in southern Arkansas, so hell if I was wearing pants to deal with an expired vehicle registration.\n\nSo she starts with, \"You know, shorts *really* aren't acceptable attire in the court room.\" I found this ridiculous, considering the perfectly \"acceptable\" presence of low-cut sun dresses and open toe shoes on women.\n\nSo I replied, \"My apologies, your honor. I'll be sure to wear a skirt next time.\" The bailiff beamed at me and stifled a chuckle, but sadly I think the judge was too distracted by papers to really register my snark.",
            "This reminds me of my absolute favorite interaction with a judge I like a lot:\n\nIt was a Friday last fall, one of the first in months I didn't have any cases, and it was warm enough that I came to the office in cargo shorts and a polo shirt because I just had some discovery review to do. At like 10:30 am I get a call from this judge's clerk, who tells me that my client had tested positive for cocaine on a random urine screen that morning and because it was his third positive test in a month or so the Court didn't want him to leave the courthouse and wanted to address the bail violation. Since he was in person, I had to be too. So I figured \"No big deal. This is why I have a backup suit at my office\" . . . only I had forgotten I had dropped it off at the dry cleaners because it had been a while since I'd done that. So I call the clerk back and say \"I wasn't expecting to come in. I can be there in shorts and a polo\" and the clerk checks with the judge and gets the OK. \n\nSo I come in to the courthouse, talk to my client briefly, and then we head into the courtroom where they're finishing off another hearing. The courtroom is pretty deserted; outside of the court staff and us, there's one other defendant and his lawyer on the record with another ADA, and then my ADA. The judge smirked as soon as I walked into the courtroom, but finishes the case in front of him. As soon as the case ended, as the other parties were getting their stuff together, he went \"Mr. \\[Last name\\], if you want I can have my bailiff take a report from you.\" Confused, I went \"What do you mean, Judge?\" to which he replied \"Well, it seems like someone stole half your pants. That's an injustice that I imagine you can't stand for. Or probably shouldn't, anyway.\" The entire courtroom burst out laughing.\n\nI'd like to think that softened the judge up not to take my guy into custody, because it sure wasn't any legal argument I made!",
            "When I was in law school I worked as a clerk for a judge. He wore Hawaiian shirts under his robes. His only decorum rule was no sunglasses. He was awesome.",
            "My grandmother's great rebellion was wearing pants which her mother said where for whores.\n\nMy grandfather was a man at odds with his times and enjoyed seeing the anger it causes in my great grandmother.\n\nI miss them both every day.",
            "I expected the punchline to be that she came back to court wearing a big poofy ball gown.\n\nBut this was just as good",
            "We have a judge with this same rule.  He's retired and only fills in when they're shorthanded.  It's absolutely awful to be in front of him!  He is pretty sure women shouldn't work outside the home in the first place, and (gasp!) PANTS as well?  \n\nThe. WORST.  The last time I saw him he threatened to hold me in contempt for being (literally) 8 minutes \"late\" (he actually started early).  I told him I had a potty training issue and he didn't care.  Would have put me in jail if the DA hadn't intervened.",
            "Shit like this would never fly in Canada or any European country. He would be disciplined so fast by the Chief Justice that it would make his head spin.\n\nThe USA is so ass backwards.",
            "Reminds me of the time 'minis' and pantsuits started to be the fashion. \n\nMeeting friends for lunch at the 21Club.\n\nI walked in wearing a smart grey wool pantsuit. 'One of the 'maitre d's' said \"I can't seat you wearing that-Madam.\"  I didn't leave the foyer- just dropped my pants there and then!\n\nMy jacket was just above the knees- smart looking mini. When he picked his jaw up from the floor- he seated me.\n\nSoon after I saw Jackie Kennedy there wearing  a pants suit- I never had to 'drop my drawers' again!",
            "My cousin vinny - joe pesci wore that prom suit - lol that movie is as close as you can get for realistic southern people/place (Fred Gwynne nailed it) - whats a ute?",
            "It's deleted...\n\nWHAT DID IT SAY?!",
            "What always baffled me as a lawyer from another country, that apparently in the US judges use the phrase \"my courtroom\" regularly.\nWell, it's not \"your courtroom\" - it's the courtroom of the United States/particular state, and they make the rules, not you.",
            "If the Judge was (more of) a dick, he could have held her in contempt, for mocking, or shit like that...",
            "This sounds like something out of ally mcbeal. Also a way to make sure the judge rules against your client on every motion for the rest of your career.\n\n\"He can't do that!\" But he will.",
            "... How the hell does a suit jacket get cut so long it falls just above the knees?",
            "Every judge has the same middle name. And it's \"God\". Family Court is the worst. Judges have no oversight and no accountability. They can rule against you for any reason, or no reason. They can rule against you because they don't like you, or if they're having a bad day.\n\nWatch YouTube videos of hearings, and you'll see judges literally SCREAM at people.\n\nEvery single one of them needs to be taken down a notch. Too much concentrated power. Too fragile egos.",
            "\"and now I'm going to file a sexual discrimination lawsuit. Expect to receive the certified mail shortly.\"",
            "I like a girl with a short skirt and a loooooooooooooong jacket",
            "Never seen a post removed in real time before. Why did it get deleted?",
            "The dress code at the harris county, Texas courthouse for the district attorneys is still that women wear skirts or dresses for trials.",
            "Now that takes guts!! Good for her!!",
            "Can men wear skirts?",
            "Mrs Gambini, are you mocking me with that outfit?",
            "OP:\n\nOne of my law school professors was a public defender (an attorney who represents poor criminal defendants) in Philadelphia, Pennsylvania, before he came to my school. He told me a story about a particularly uptight (read: sexist) male judge and a fiery female public defender who did exactly what he asked.\n\nCourt begins. The attorney walks in, wearing a conservative pantsuit that wouldn't be out of place in any courtroom in America. The judge, an old man, raises his voice, points his finger at the attorney, and says, \"Do not come back into my courtroom until you are properly dressed. Women do NOT wear pants in my courtroom.\"\n\nThe attorney does not respond. She simply walks out of the courtroom.\n\nA few minutes later, she returns, wearing her suit jacket and...that's it. You see, her jacket was cut long, so by itself, it fell to a little bit above her knees. She simply walked into the restroom, took off her pants, and came back to court.\n\nThe judge never enforced that \"women cannot wear pants\" requirement in his courtroom again.",
            "There's a similar story about [Katherine Hepburn,](https://en.wikipedia.org/wiki/Katharine_Hepburn) who was famous for wearing tailored trousers when it wasn't really accepted.  \n\nStory goes some constipated studio exec told her she couldn't appear on set wearing pants.  She got stopped at the gate.  So she took off her trousers, and walked across the lot in her panties.  This was probably in the 1930s or 40s.",
            "Why was this removed?",
            "This happened in more courts than you can believe.  \n\nI remember a woman attorney being held in contempt of court for wearing 'skorts.'   in the 90's.",
            "I tried this at a bar that didn't allow sweatpants. I asked, \"so if I take off the sweats I come in?\" And they said I could. I pulled my pants down and was not allowed to enter.",
            "Power play would have been to drop trou in the courtroom, then calmly fold them and place them over the back of the chair.",
            "how can a judge with such repressed beliefs be judge ? how can you trust his/her judgement",
            "The judge asked and the judge got.  Never upset the judge.",
            ":( I wanted to read this",
            "Holy shit this was removed right as I was about to read it",
            "Women in my country can only wear sarees :( My mom spends a shit ton of time dressing every day.",
            "Much more delicious than my semester spent in preparation to use my final against the Public Speaking professor who insisted we ladies HAD to wear a dress or skirt, heels AND *PANTY HOSE*. Like....where the heck are those even still sold?\n\nAnyway. Made a decent enough presentation of it, because the next class she taught didn't have to abide the outdated clothing regulations, and I got as close to a 100% as she would allow. :)",
            "I wish I could confidently ask how long ago this happened, but even with the zoot suit fashion reference I’m afraid it’s like the 1990s...",
            "Ah yes, following the letter of the law but not the spirit. I fucking love this. Yes I am a lawyer.",
            "Single female lawyer, having lots of sex",
            "[removed]",
            "Yay for old white men being in charge of the entire planet",
            "I had a (male) college professor who said that women in my profession (teaching) shouldn’t wear high heels, as they are impractical.\n\nNow, I did not even own a pair of heels, but I went out that day and bought a pair of heels and wore them every day to his class. I even missed the bus once and walked about 3/4 of a mile, some of it up a steep hill, in those heels and still made it to class on time. I have a naturally loud walk, and I didn’t try to hide the fact that I was coming down the hall in heels. \n\nI now wear heels fairly often to work, because goddammit if I’m not going to make myself a few inches taller, look great and feel great.\n\nThe point of the story is that women like me want to prove anyone and everyone wrong about what we can or cannot do, and we will throw that shit back into your face so fast you won’t know what hit you.",
            "Dang I can only hope that judge got disciplined. Sexist POS.",
            "I was hoping she was gonna wear a giant, ornate ballgown",
            "/u/lawtechie.",
            "So badass.",
            "NICE",
            "How untouchable do you have to feel the tell a female lawyer to take off her pants on the job?",
            "What kind of suit jacket is that long?",
            "I thought she would come back wearing a formal gown or something but this is so much better!",
            "\"Judges. If they were any good, they'd be lawyers.\"\n\n- Homer Simpson",
            "That’s a power move right there! I would have found one of those jumpsuit that are so flowy that they look like skirts when your legs aren’t too far apart.",
            "Ugh. That’s still a thing with some judges\n\nBrilliant response by that attorney, though.\n\nEdited to add: in my experience, it wasn’t an open rule, but attorneys knew that some judges were prejudiced against female attorneys in pants and they passed the info on",
            "Thankfully a new generation is taking over",
            "Yaaaaaaaas! this is the kind of passive-agressive malicious compliance i am here for!",
            "I was expecting her to come back in wearing a ballgown or a wedding dress or something like that. I like this better though, that really took some (figurative) balls.",
            "Ask the professor of yours, if you are still in contact with him, \"do these type of people, like the judge mentioned, or the police personnel who are coming in news for wrong reason are generally attracted to these positions and work to achive them Or is it they become such arsehole when they get the power?\"\n\nTldr: Do they become the arsehole when they have the power or do they work hard to be in the position to be an arsehole?",
            "What a perverted judge, but then again this is America",
            "[removed]",
            "I fully hope she did raise (anonymous) concerns against discrimination against that judge. Seriously...",
            "Alright, when I visit Philly, I'm telling women that they cannot wear pants all the time.\n\nI'm sure they are going to take it literally but I'm also going to tell them they cannot have sex with me.",
            "Um, how is this not openly discriminatory? Out of a judge?",
            "I will say, this sexism is not all that unusual in the courtroom. I go to law school in Virginia, and we had to go to this professionalism event that basically told the female law students to get a skirt suit.",
            "System is fucked if people like him can be judges",
            "Whats up with posts suddenly get deleted the moment I want to read them, back them up, this instant!",
            "Why has this story been removed?\nWhat’s the point in keeping the headline up if there is no story attached?\nWhy is this now trending when the only thing to read are the comments?\n\nEdit:\nOk it seems to have reappeared. \nIgnore the above, unless it disappears again.",
            "Wow. I'd say she showed some balls but that could be misinterpreted...",
            "Next step is women can't wear jackets. At end it will be a strip club.",
            "Oh boy that makes me fire hot piston mad. I'm a lady. Have traveled all over the us alone. Specifically in Philly amtrac screwed me over. I'm in a suit (w pants) conductor says \"woah lady are you a lawyer or something\"? Screw dresses. I'm a gypsy lady. Travel to scary places alone a lot. Had I been in a skirt no way things go wrong Im dead meat.",
            ":) Pants on fire !",
            "It's always where the sun don't shine in Philadelphia",
            "Listen judge, this isn't Little House on the Prairie, mmkay?",
            "Looks like someone took the slow train from Philly.",
            "Yeah right",
            "That's fucking golden!",
            "Is her name Annalise Keating?",
            "I've witnessed a judge sending male lawyers to go get a damn tie if they want to talk to him in this here Federal court.",
            "Sounded to me like the dirty old man got what he wanted...",
            "That's Philly for you. Love seeing my area on here and the comments that ensue.",
            "Hero!",
            "She sounds like a hero",
            "Daaaaaaamn. I fucking love her",
            "Well, that's one way to do it. Love how she handled it.",
            "How did that guy make it all the way to being a judge...",
            "What kind of rule is that lmao",
            "I refreshed the page and now story is gone...wtf",
            "[removed]",
            "damn, i missed it",
            "Need link to post unremoved",
            "Why do Judges get to be such assholes??\n\nWhy does the Judge get to even say something like that? It has nothing to do with the verdict. Or Law. At all. Yet you always hear about \"How dare you X or Y in MYYYY Courtroom.\"\n\n&#x200B;\n\nLike fuck you, Your Honor.",
            "Aw, what? Removed?",
            "Haha, I get it, you removed your pants 😂😂😂",
            "Kids from Philly probably think Ed Werder is actually Ed \"Water\".",
            "Philly Guy here can confirm it is your cake day and Philly does not give a fuck.",
            "I think I know that PD, is she currently a member of the PA State Assembly?",
            "This one had me laughing",
            "You'd think a judge would know damn well better than to voice that, especially when the courtroom proceedings are *being recorded.*\n\nThat sounds like an open-and-shut slam-dunk case.",
            "I bet she was waiting for that hence the fast MC. Kudos on her though.",
            "Well it started off like an episode of Aly McBeal that I once saw, but I liked the ending better. :D"
        ]
    },
    {
        "post_id": "pwsb9i",
        "author": "None",
        "title": "\"Well, this is Red Lobster, and we do things the Red Lobster way.\" - said by my manager before navigating us by the book straight into a blizzard of shit.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pwsb9i/well_this_is_red_lobster_and_we_do_things_the_red/",
        "score": 21547,
        "num_comments": 785,
        "created_utc": 1632781923.0,
        "selftext": "This happened several years ago, and I am forever relieved I don't work in a restaurant anymore. Solidarity to all kitchen workers for the endless bullshit you have to deal with.\n\n***\n\nAt the time, I was working in the kitchen as an \"assembler\". This can be one of the most clutch positions on the line, as you take all the food being prepared by the other cooks and organize it into tickets that can be taken out into the dining room.\n\nAccordingly, it is often a bottleneck for food leaving the kitchen - if you have a slow assembler, cooked food dies under the heating lamps. Grilled salmon dries out, fries become soggy, linguini alfredo hardens into concrete, really horrific shit. It is **imperative** that food not sit in the window.\n\nI was working a weekday lunch shift, which is normally pretty slow. We must have provoked the wrath of the restaurant gods on this day though, because out of nowhere the store got hit with a tsunami of customers.\n\nI could just barely make out the other cooks through the clouds of shrimp scampi, fryer grease, and cheddar bay biscuits flying through the air. I knew the shit blizzard was headed my direction, and began putting empty plates up in the window with the \"shape\" of each ticket that was to leave the kitchen, a technique I had learned to help survive bullshit like this.\n\nOn the other side of the window, coordinating the servers, was my manager, Cuntface. Shouldn't use his real name, actually, let's call him \"Bob\" instead.\n\nBob was a bit hyperactive and had an irritating tendency to micromanage kitchen processes, a problem compounded by his not knowing how the fuck to run a kitchen. When I began putting empty plates in the window so that the incoming, Interstellar-sized wave of seafood had something to land on, he stopped me.\n\n\"What are you doing?\" Bob asked.\n\n\"I'm putting the plates and their sides in the window because we're about to have a very high volume of food coming through\", I replied.\n\n\"Well, this is Red Lobster, and here we do the things the *Red Lobster Way*. We plate the food when the food is ready, and we don't put sides on early.\"\n\nI tried explaining that the *Red Lobster Way* was designed by sentient suits and ties physically incapable of holding a spatula; that our sacred *Way* (as dictated in the Good Book of Employee Training) had died in the trenches of last year's endless shrimp special; that, while I appreciated the job, I wasn't prepared for an honorable death at the hands of this rush to uphold its most obscure tenets - but he wasn't having any of it. Bob insisted that I take the plates out of the window and *only* pass him plates and tickets that were 100% completed.\n\nKnowing full well that Bob was flying us by-the-book into a storm of shit, I put on a feces-resistant raincoat, rubbed some Vick's under my nose, and braced for impact.\n\n30 minutes later, the window was chaos. Finished food was left dying in the wings of the window, while I - swiftly enough to avoid reprimand, but with the fatalistic, mechanical motion of a flood pump removing water at a fraction of the rate at which it's arriving - plated up one finished ticket at a time.\n\nBob was equal parts confused and furious, like a toddler whose toy was suddenly taken away. \"What's this food waiting on?!\", he cried, gesturing towards a shriveled up steak and its associated sides.\n\n\"Well, that order is waiting on some fried shrimp, and I need to wait for the ticket to be complete before I plate it up.\"\n\n\"*Why* is the ticket missing fried shrimp??\"\n\n\"Unfortunately, I'm not manning the fryer, sir, so I don't know.\"\n\nThis continued for the better part of an hour. It seemed like every ticket was missing one little thing that kept it from leaving the kitchen.\n\nAfter the rush had passed and I was dumping its precipitated, liquid shit from my galoshes, Bob approached me with the twitchy, nervous energy of a coked up boxer. Well, that, or a hyper-caffeinated, insecure manager who needed to assert his dominance over the underpaid crew of some bunk ass seafood restaurant.\n\n\"Can I, uh, speak to you in the walk-in for a moment, /u/namesrue?\"\n\n\"Sure thing.\"\n\nWe walked to the cooler as I struggled to remember how to fight off an attacker armed with a kitchen knife from my days in dish.\n\n\"So...what happened back there?\" Bob asked, arms folded, shifting his weight from one foot to the other.\n\n\"You said we should follow the system, and we did\", I replied, mentally noting that he was standing in front of the walk-in's only exit.\n\n\"But there were a lot of missed items on those tickets. We had food dying in the window.\"\n\n\"I saw it, yeah. It was pretty bad.\"\n\n\"So why was the food missing?\"\n\n\"I don't know, I wasn't cooking the food, I was assembling it. I am the assembler.\"\n\nThis line of questioning continued, with Bob trying to somehow pin the catastra-fuck of the last hour on my willingness to comply with his orders, while I blithely insisted that I did exactly what was asked of me. After not being able to move past this point for several minutes, Bob made some sweeping statement about \"doing better next time\" and left.\n\nIncidentally, the next time I was assembling and Bob was on the other side of the window, nothing was said about the *Red Lobster Way*, and the rush went smoother, albeit with some hotter plates and servers having to return for delayed items. I guess we ended up doing better, after all.",
        "permalink": "/r/MaliciousCompliance/comments/pwsb9i/well_this_is_red_lobster_and_we_do_things_the_red/",
        "comments": [
            "As someone who both cooked and ran expo in a red lobster I felt this post in my soul.",
            "I don't envy ANY of you behind-the-window staff.  I have a hard enough time coordinating the timing on my \"dinner for two\" and I've been cooking for damn near 20 years.  \n\nThank goodness for air fryers and ovens that keep parts of the meal warm while I unfuck the rest of it.",
            "Used to be a short order cook not long ago where the only manager over me was the owner. Small. Locally owned. The kitchen would run great until she decided she needed to come back to help. Any time we actually got busy she'd freak out and tell all the servers to stop taking orders. I was never backed up enough to where I'd want to do that and we only had one flat top, 3 fryers, with enough seating for ~200 people. \n\n\nThe moral of this story is : If you don't know how to run a kitchen, please stay out of the damn kitchen.",
            "\"died in the trenches of last years Endless Shrimp Special\"...lol!",
            "FUCK YOU REDLOBSTER ----source: used to work there and quit...Set a lobster free on my way out.",
            "Worked in restaurants for 10 years, worked in corporate restaurants for 5, and I can tell you what OP already knows - that corporate restaurants are run by absolute buffoons who have no idea what the fuck actually goes on.",
            "God, I worked in restaurants for years and I felt this in my soul. If I had a dollar for every manager I worked with who was navigating a shift straight into a blizzard of shit I could have quit years earlier than I did! \n\nGreat writing OP, I could smell the grease and hear the Cooks  swearing a blue streak in the background. 😁",
            "\"On the other side of the window, coordinating the servers, was my manager, Cuntface. Shouldn't use his real name, actually, let's call him \"Bob\" instead.\"  - Knew I was reading until the end when I saw this.  Here have my free award for today.",
            "Sometimes it's a struggle to get servers to run a ticket that is waiting on a single entree. I find it's a hell of a lot easier to explain to a guest that, while missing some items, they are being prepared fresh from the oven and will be out shortly, instead of saying \"oh, we are busy, and your food got taken by another server who didn't read the fucking ticket right\".",
            "Love your writing style here. And great story",
            "Can someone explain the differences between the two methods, one has a empty plate under the hot lamp and one has the food on the plate under the hot lamp whilst waiting for the entire order?",
            ">I tried explaining that the Red Lobster Way was designed by sentient suits and ties physically incapable of holding a spatula\n\nThat's *semi*\\-sentient...",
            "I worked in a restaurant for thirteen years. I can't tell you the number of times done know-it-all manager completely broke our will oiled machine and ruined lunch or dinner service.  \n\nNever again, not even of it were my own restaurant.",
            "This was a fun read! Thanks for the laughs!",
            "A joy to read, thanks!",
            "You should have kept doing it the Red Lobster Way until you got Bob to ask you to stop.",
            "Do you know why this post makes me sad?\n\nHalf way through it I realized how funny it was. How much I was smiling while reading it. The writing felt clever, and fresh. But they were working at a chain restaurant, dying for minimum wage, probably too tired after a shit shift to do anything creative or truly useful to society. Our systems suck and I hate them.",
            "Omg this gives me flash backs to when I worked drive through at Fazolis there was always this one manager that insisted on always doing kitchen even though he constantly forgot to make orders but would insist it's drivethroughs fault somehow",
            "One of the best stories I've read here.  I had quick glimpses of the kitchen as I was reading it, seeing all the plates of food coming up, waiting to be plated and trayed to be carried out to the floor.\n\n\nThe only restaurant work I've ever done was at a Pizza Hut that did carry-out and delivery orders only, so I wouldn't know the first thing how it really goes down.  But your story is one of the few that I actually imagined seeing myself doing, including having the \"chat\" with Bob in the walk-in.\n\n\nWhat managers fail to understand is sometimes the \"correct\" way isn't always the \"best\" way, especially in a rush.  As long as food is still properly cooked, orders are plated, and customers are happy, then don't fuck with perfection.\n\n\nI imagine the \"Red Lobster Way\" is fine for a normal rush, or what might be considered a normal volume during peak times, but when you have a HUGE influx of customers, especially during certain times of the year (Mother's Day, Father's Day, and Christmas seem to be very popular), it'll still work, but you're going to have a fuckton of angry customers.",
            "I was working Breakfast Shift at the hotel and it was rather quiet, so I was doing some of my side prep and getting stuff ready for the next day along with some misc prep for the lunch crew. All of the sudden we get a rush on in the front along with seating a 40 top and soon the ticket machine was spinning non stop.  \n\n\nI abandon my side prep and start staging in preparation of getting rolled over. Word travels fast and the pastry chef flies over in a panic to 'help'. It's just me on the hot side and another cook on the cold side and you would think that any help would be welcome but...  \n\n\nI had seen our pastry chef 'help' on ihe line and knew the chaos and clusterfuck wreck he left behind wherever he strayed. So I exclaimed, \"OMG, YES! I just got finished prepping a round of gravy and it is dying in the hot bath. I need to get that iced down and put away as soon as possible before anything else!\"  \n\n\nTo which his eyes popped wide and the ran off to get to THE MOST IMPORTANT THING EVER!  \n\n\nAs soon as he got off the line, I jumped in and rocked out everything that came through. I had worked with the wait staff for 6+ months at this point, so they knew how best to work with me and everything went as smoothly as things could while on fire.  \n\n\nAbout midway through, the Sous Chef popped his head around the corner to ask if I did actually need anything. I thanked him but said we had it covered. He nodded and went back to getting the catering ready.  \n\n\nPastry chef came back in a flurry shortly after everything died down to see what was next. I said, \"Oh thanks! It died off pretty quick, but you were a lifesaver taking care of that for me!\" To which he left with a satisfied smile.  \n\n\nI proceeded to clean up my area to get it ready for the lunch crew and took my carts back into the cooler. I also cleaned up the scorched earth mess that the pastry chef had made when I sent him on his task. And with everything done, went to go check with the banquet guys to see if they needed anything before I left.  \n\n\nSous chef said, \"Yeah, I want you to tell if you actually needed the pastry chef to do that for you or if you sent someone who is TECHNICALLY a supervisor to you on a wild goose chase to get him off of your line when facing a rush with a surprise forty top.\"  \n\n\n\"Well, you have seen how he helps.\"  \n\n\n\"Yeah...see you tomorrow.\"",
            "It's a shit blizzard Rand!",
            "My wife received a W-2 from Red Lobster once. She has no memory whatsoever of working at a Red Lobster.",
            "I use to run a lot of positions at Boston market, but backup was the most stressful. Backup is a floater from the cooks to the server area, trying to replace sides and mains before you actually run out. The book said to cook things with certain tools, but when shit hit the fan I’d be running mac and cheese in the steamer, the microwave, and the ovens lol. Shit would get real fucked when we had to resort to putting chicken in the oven vs the roticery. \n\nI’m a lawyer now, but may god have mercy on my serving brethren",
            "I hope you're now doing something that utilizes your wonderful writing style.  Bravo.",
            "Fuck this restaurant. Red Lobster is a death trap. I saw employees slip on tile and get concussions and broken ribs. But of course they were just shy of full time, so no health insurance. \n\nWhen I was 20, my arm landed in the frier. All the way down, I felt the metal hardware at the bottom:\n\nI had just finished washing my hands and there were no towels, so my arm was completely soaked in water. As I was coming down the line to get a towel from the dish washing area, one of the employees spun around and slammed the basket down over my arm as I was mid-stride and down into the hot oil it went.\n\nThis was during a dinner rush and the entire kitchen gasped as I yelled (out of surprise) and pulled my arm out and wiped it across my clothes (while realizing halfway that if I was burnt, my skin would be coming off.) \n\nAnd my arm was steamy, missing some arm hair, and completely 100% OK. Not a single blister. Nothing. \n\nThe managers door has line of sight down the line, he saw the whole thing. I walk over to him, roll up my apron, and told him that I respectfully quit. I told him I probably won't get lucky a second time and I'm not testing it. He was still in shock at what he saw and finally mustered a nod. \n\nThe restaurant we were at was run flawlessly (it was located down the street from the local health department), the food was perfect, and fresh. The manager was fine, and the kitchen staff was wild and crazy and tight knit. But shit, that place was a death trap. One of the most dangerous kitchens ive ever been in.\n\nEdit:\nThank you Leidenfrost Effect!",
            "This was delightful to read. Thanks not just for providing us with some good MC, but for also being so entertaining along the way",
            "I just quit red lobster after working for them for 8 years. Fuck them.",
            "Former bartender at RL, I still appreciate you. Between my rail and Togo you guys always had my back (if not my biscuits). There's a reason your drinks were always perfect after your shift. \n\nI always thought that we shared a feeling of a dread when a manager walks into your flow. Mine would come in the bar to help on a Saturday night wondering why all of the servers are looking for drinks. Let's see our bar is three deep, Togo's are coming in left and right and you just sat half of the restaurant in the last 20 minutes.\n\nThen just grab tickets from the printer like a cvs receipt and start doing each one by one effectively bottlenecking us. Like bro pour five buds not one and then a Pina colada....\n\n\nEdit: Cheddar biscuits and raspberry coulis were the shit.",
            "Never worked in the cluster fuck that is a red lobster kitchen but have done my fair share in other good joints.\n\nGlad you got out alive from the varying degrees of shit storm found only in the back ends of kitchens.\n\nThis hurt yet bright a smile to my face, good to know others have dealt with cuntface...I mean Bob.",
            "God I feel this one. Been in a large chain restaurant a long time also and letting the assembler or equivalent position make judgment calls about which trays to send out incomplete , which ones to wait for completion, and when to pre-assemble side items is the best thing a manager can do to alleviate the bottleneck. The manager should also understand how and why it works, obviously.",
            "Worked there for too long and put up with waaay too much abuse. I remember I once got blamed for somebody putting the same date dot on everything because I \"was the only one there\" at the time she was inspecting it.\n\nThe finally fired me when they had decided I had stolen a lot of food and, being the mastermind I am, decided to place it in a bag in the walk in, and *ask if I could have it since it was expired.* Apparently counts as theft.",
            "> my manager, Cuntface. Shouldn’t use his real name, actually, let’s call him “Bob” instead. \n\n😂 I’m still peeing myself",
            "So many lit majors workered in the food industry. One day I might put into words the events of the 8 hour shift while being tormented by the song, \" A Country Boy Can Survive\" on repeat by Satan himself in the body of a head chef.",
            "\"Feel that? The way the shit clings to the air, Randy? It's already started, my good friend. The shit blizzard.\"",
            "\"The Red Lobtser way\"\n\nlmao",
            "[deleted]",
            "The fact that a human being actually uttered the sentence \"And we do things the Red Lobster way\" is darker and more hilarious than any dystopian satire imaginable.",
            "Okay so, never worked in a restaurant, but as a diner; I'd rather get 70-90% of my order out and wait for a few extras than have the whole meal arrive dried out of cold. Kitchen and wait staff work way too hard for way too little pay.",
            "When I was a flight attendant, we took stupid service direction memos from never-worked-a-full-airplane managers and literally threw them in the trash. I might listen if you’ve worked a full 757 from DCA to LAX with 28 special meals, 14 wheel chairs, 6 unaccompanied minors who look suspiciously under the age limit,11 double seat assignments,  42 pillow requests, one oven in first class on the fritz, 11A locked in the lav, and 3F is “chilly” - please turn up the AC.",
            "Are you an author? Where can I purchase some of your stories?",
            "Off topic, but: I have wanted to try RedLobster for years. I love seafood. Never worked out to be able to go. \n\nRecently, had a special anniversary. Decided to try RL delivery. I was so excited! (I know, pathetic, but it's been a hard year and a half for a lot of us...)\n\nI. Was. SO. Disappointed. \n\nIt was AWFUL. And overpriced, even if it had been good. Which was just insult added to injury. \n\nAh, well. Another dream, crushed under the iron weight of corporate ruination.",
            "I don’t like cheddar bay biscuits.",
            "I do NOT miss working in restaurants at all. I loved being on my feet and getting exercise all day, but that is a tough job.",
            "You salty dog you, that narrative was impeccable!",
            "Fuck Darden.",
            "> I guess we ended up doing better, after all.\n\nThanks to Cuntfa- I mean Bob's excellent leadership, adaptability, and flexibility?",
            "Same.  Worked line-cook for years at a buncha places.  Some of 'em would have obscure-ways of dressing the same \"steak 'n eggs\" platters so they could charge different amounts, usually amounting to \"how much of the diced onions/peppers did you put on top of the steak and/or eggs\", coupled with their chosen sides.  (Fries are 4 minutes, onion rings 4.5, diced potatoes on the griddle were 6, AND those had the option of more peppers/onions/cheese.)  I was hired as a *cook*, but they'd frequently try to lump in \"...oh, and also you're prep, and the window (if one of our servers isn't there right-that-second)\".  Blaaaaaaaaaah.  (extra bonus points if they schedule you x4 others, and specifically tell you \"Oh...we brought you in today to be the DISH WASHER.\"  I *might* have had the same look of disgust, as Jason Lee did in \"Dragon: The Bruce Lee Story\".)\n\nThe last day I worked there, they had me on the line (and had a call-in on the prep/dish station), so I was furiously trying to ensure steaks were at mid-rare, while the sides came out on time (granted, only 2-3 orders at a time)....but ALSO trying to be the \"assembler\", all the while juggle in pre-portioning more potato chunks, tossing in more sweet potatoes into the large \"de-skinner\" thingy we had, AND occasionally running a rack of cups/plates through the dish machine.\n\nAfter 8 hours of it (10pm on a Friday), my boss had the audacity to tell me A) \"some customer thought your steak was perfect, and wanted to kick-a-buck to whoever cooked it\" as they handed me a singular dollar.  Secondly.... B) \"....our overnight guy got popped for meth, is there any chance you can fill in for the next 6 hours?\"\n\nKnowing FULL AND WELL THAT THEY JUST MADE HALF THE KITCHEN DROP IN THE PAST WEEK....I said \"No, I'm afraid I still have friends waiting for me\" (a blatant lie, as I have no friends), took off my apron, and tossed it onto the flat-top as I left, *kinda* hoping it'd somehow catch fire and burn the place down.  \n\nI get it, you're looking to get rid of the druggies, while keeping the people that *can* do the job (and that you believe you can bully around, and \"convince\" them to work longer hours until you find more people to fill less-important slots), but...naw, fuck this, I've seen THIS enough to know when I should cut out too.\n\nInstead, I was called (many times) on Monday asking when I'd be in, and that I'd need to pay for the apron I let \"expire\" due to \"....oil-related burns.\"  I told 'em I ran outta gas on the way in, payday wasn't for another week, and I'd be out-of-commission until then, so they'd best find *someone* to handle their cooking.",
            "You're a talented storyteller. It seems like I see this problem every day more and more, people with some amount of \"authority\" and zero practical knowledge butting in to sate their inflated ego. It could all be so simple, but they have to make it harder",
            "You should be an author and give up the service industry life. That was a great read.",
            "You have a great narrative style.  Keep up the good work (the style, not the Red Lobster job).\n\nAs a customer, I try to make the server's job easier when the restaurant is busy.  \"Bring what you can when you can and don't worry about one item being missing unless it's the only entree.\"  I know far too many people who raise hell about their cole slaw being missing when they get their burger.  C'mon, people, show a little compassion for the kitchen folks, it's not like they WANT to not send the full order!",
            "I’ve got nothing to add, other than I love the way you write.",
            "Reddit is this safe haven for writers that never got the opportunity to flourish, and I am here for it",
            "You’re a writer, not a server.",
            "gotta love management that constantly berates the wrong person and asks them questions they can't answer. it's a way for them to avoid doing their fucking job.\n\nit's always the \"micromanagers\", ain't it? almost like \"micromanaging\" is just taking little shits everywhere and giving people more problems.",
            "Your writing style is incredible!\n\nAs someone who has also worked in a Darden restaurant (the Pasta Palace), I feel your pain.  Luckily I was able to overcome out of corporate restaurants and life was much better.  I don't often miss the restaurant industry though.",
            "I did enjoy a good endless shrimp.",
            "\n\"We walked to the cooler as I struggled to remember how to fight off an attacker armed with a kitchen knife from my days in the dish pit!\" - This had me dying! Lol",
            "I am always at a loss to understand how the Bobs make it to management.",
            "Rock on OP, that was an awesome retelling, kept me on the edge of my seat.  Thank you!  Bummer you had to wait until after the storm to empty those galoshes, darn ruined socks.",
            "Dr. Zoidberg is the only Red Lobster who won't ruin your dinner.",
            "I love all the servers/writers sharing stories ! It's like reading a good book where I'm in on all the jokes. (no /s, full on compliment, I enjoy your writing)",
            "Hurry up and write that novel!\n\n(SpongeBob voice) I NEEEEEED ITTTTTTT!!!1",
            "That was beautifully written",
            "Delightfully written. Brought me equal parts joy at reading your prose, horror, and righteous indignation on your past self's behalf. Bravo to being honorably discharged and on to better things.",
            "Loved it!",
            "Well, sir, I hope you apologized sincerely for forgetting to do it the Red Lobster Way, and promised you’ll return to the method he wants…(because the eye twitching from that would be fun to watch.)",
            "Love the way this was written lol.",
            "That was so well written.",
            "*that our sacred Way as dictated in the Good Book of Employee Training had died in the trenches of last year's endless shrimp special*\n\nMade my day. \n\nSolidarity brave solider",
            "Darden Restaurants, the owners of Red Lobster, Olive Garden, Long Horn Steak House, and others, lost a class action lawsuit about 15 years ago because they were fucking their employees out of their proper pay. I won't eat at  any of their restaurants on principle. Fucking corporate blood suckers.",
            "This is one of the most beautifully phrased descriptions I've read. You are a poet and you were definitely wasted in food service.",
            "I worked as expo and did every position in the heart of house.  Dishwasher, production, fry, grill(my favorite) assembler, broiler (bitch job to me if you had someone lazy), alley coordinator, baker/salad.  I worked all shifts both mornings/nights and did truck for 7 years.  I also was the only person to break down the broiler on Tuesdays  no one else knew how to and I always opened every Sunday.  \n\nI feel this in my soul and I got a lot of shit from servers but I knew what the fuck I was doing and my managers acknowledged it and left me alone.  There are much better jobs out there with a much better social life/work balance.",
            "Do managers have to take a course on how to be an egotistical prick or something?",
            "A shit BLIZZARD Randy",
            "Ive worked in reasrurants, thank you for that post!",
            "Lobster Hell solidarity. 13 years of that crap. Mainly server but all FOH positions including the oh-so-bs \"service professional\" (i.e. do the work of a manager for a hell of a lot less and with no perks). I still have nightmares of being in the weeds but I also remember with glee the day I finally quit and got to throw those damned fish shirts in the trash.",
            "At a different restaurant called or sounding like shenanigans, I was what was called 'quality assurance', the heartbeat of the kitchen and namely the entire restaurant including the bar because a lot of people ate at the bar and I got shots from the bar during some of my shifts but I digress...\n\n\nOne of the greatest jobs I will remember I love that job",
            "As a customer, if I have to choose between a cold entree and waiting on a side, I'll always wait on the side.",
            "It is refreshing to know that this shit place is as bad for workers as it is for customers. I never got why you would always have to wait for hours even in an empty restaurant - the idiotic  MBA procedure culture would explain it.",
            "I’ve promised myself never to work in a restaurant again. Highest intensity work for the least amount of pay. And hoping that the FOH got enough tips that they’d feel bad for the kitchen guys and toss us $50 to split amongst five people (the places ive worked in)",
            "The absolute worst thing a manager can do is hang out on the line while the expo is doing his thing. Did it for about a year before serving.",
            "This was the most eloquently written MC I have ever seen sir. Bravo",
            "I worked two part time jobs for a while my senior year of high school; a server/hostess at Bob Evans and a hostess at Red Lobster next door. Bob Evans was first for about a year, then I left and went next door thinking I would like it more. Hell no. The staff was much more stressed out, some of my hostess coworkers were uppity and my manager was a real hag, who went absolutely apeshit on me in front of the uppity coworker and some guests when I smiled a little too big for her when she offered me an early out. I told a BE coworker and she talked to my old manager and he immediately offered me my old job back if I was miserable at RL. I put in my two weeks at RL, and started back at BE the next day after school, alternating between the two until I was done at RL.\nThere were the usual bad days, but realized that my coworkers and most managers at BE were more friends/family and actually cared about each other. That store eventually closed and became an IHOP and after graduation I moved to a different state and ended up working at a Bob Evans there for three more years. I met my husband there, too",
            "Red Lobster was the worst job I ever had, and my only job serving. I had nightmares about serving for years after I quit. \n\nI was falsely accused of smoking meth in the bathroom during a BUSY AF Saturday night. Police showed up and told my boss, “this kid ain’t lying, and he’s not high.” \n\nAfter the police left, my manager was on the phone with: my General Manager, two other assistant managers, and the District manager. They talked about about if they should still just, ‘let me go.’ And my General Manager, who was supposed to be cool,  told the assistant manager who wrongfully accused me, “it’s your call.” The accusing manager still wasn’t thoroughly convinced I wasn’t getting high or messing around on company time. She couldn’t dare believe her intuition was wrong…\n\nAll the while I was sitting in this folding chair in the cash room listening to the conference call like the peasant I was. I was so broke and finding work in my home town was hard. Never again. I’ll die in the streets…\n\nEdited: For grammar and language.",
            "Well-written! Thanks for the chuckles.",
            "Dude, real talk, fucking excellent writing. If you wrote a book about your full Red Lobster memoirs I would buy that shit and read it cover to cover.",
            "Worked as an assembler, we called them quarterbacks for some reason, at RL for about 2 years. Luckily our managers didn't give a shit about how we did things as long as our ticket times were fast. Very accurate portrayal of the shit show though.",
            "This must be the most well written post I have ever read! 😍 It was a pleasure! 🥰 Are you a writer?",
            "TIL that most of the restaurant industry--including every restaurant I've ever worked in--has expediters while Red Lobster has \"assemblers.\"\n\nRed Lobster is fuckin weird, lol.",
            "Somewhere in there I started reading this in Anthony Bourdain's voice and it was very nice.",
            "I worked at pluckers in Dallas and our “assemblers” were the kitchen manager and us servers. Our assembler/kitchen manager always had empty plates and trays at the ready. As long as we were making money from the customers, and making 90% of the customers happy with our food and service our store manager didn’t give a fuck if we were following their corporate guide or not. Op is absolutely right, this manager sounds like a fucking blockhead.",
            "I've had this kind of manager before too....what is with these people who don't understand how shit low the position they're in is?",
            "Never worked in a restaurant before, and I could FEEL your pain. You’re an excellent writer, here’s some silver!",
            "Every time I see a post like this I think of the Spongebob episode where Mr. Krabs sells the Krusty Krab to a chain and they bring in a chain manager and the whole thing goes to shit.  \n\nIt amazes me sometimes the ppl who are left in charge of things... like for his position why in hell wouldn't you just promote someone from the kitchen?  Oh yeah probably because that person wouldn't have a degree and check all the boxes the suits want...  God forbid someone with a ton of OJT and no degree in basket weaving be a manager...",
            "CATASTRAFUCK IS MY NEW FAVORITE WORD! \n\nTHANK YOU FOR THE WONDERFUL STORY! :D",
            "I hope you're now a successful writer because that was fucking incredible to read.",
            "You have a real talent for engaging writing, my man. Mad respect for anyone working in restaurants. I worked at Michael's for a time and that was enough to convince me that the vast majority of people are operating on a single malfunctioning brain cell.",
            "Please hit r/writingprompts sometimes and give us some of this sweet word juice you used here",
            "You're writing style is awesome haha",
            "As a former Red Lobster employee I loved this story.  As my stores go-to clutch assembler, I knew what kinda shot lunch you were heading into.  Ice seen it happen far tooany dinner rushes with the newbies assembling.\n\nGood on you for not losing your cool and not letting the FOH blaming it on you.  As a server, you never puss off your assembler. They are the ones that will sneak your order out faster when you forgot to punch it in, and they will be the first to offer up the freebies, shrimp, fries, salmon, or even sometimes steak.",
            "Solid story. But mostly, thank you for just saying the restaurant's name instead of something like \"I worked at a place that served LOBSTER and it made me see RED, 😉 do you get my reference, I am being slightly coy and I believe this is funny\"",
            "I had a shit manager once who didn't understand the job at all. I was bar, but I've got more than enough experience to help in the kitchen from places that needed a little backup. \n\nI walk through the kitchen as casual as anything taking what i can see is the smart route to not get in anybodies way, approching from angles so that people see me coming, greeting everybody, sometimes I'm offered something to eat, on my way to the walk in to get fruit for the night. \n\nI call behind/backs if I'm not absolutely certain that somebody knows where i am, but on this occasion everybody did; then the manager tries to cross the kitchen to talk to me (he could have waited 2 minutes for me to leave the kitchen) he walks straight through, taking the opposite route to me where they were clearly busy doing some prep for the dinner rush. \n\nHe immediately gets bumped, then shouted at to call behind, then in about 3 languages he's got people shouting abuse at him. \n\nThat guy was terrified of the kitchen after that.",
            "Soooo many restaurants looking for qualified people right now. The standard response is, “govt checks are paying them to stay home”. \nHow many experienced workers moved on after realizing this type of work environment isn’t worth the money?",
            "I'm confused how having the plates prepared for food to land on would prevent the same food from being killed by the heat lamp if it's still waiting on additional items",
            "“Catastra-fuck” is now my new favorite word. Thank you.",
            "It’s called expediting I’ve never heard it called “assembling” that’s great",
            "So this is why every restaurant is understaffed right now",
            "You're a really good story teller and I hope Bob learned to not be such a total shit",
            "Good story well written! Gave me flashbacks of my restaurant days ...",
            "I really enjoyed your descriptive writing. What a good read!",
            "That manager is a chump. If I was expoing I would have been helping you plate that shit  before we got ass hammered. The problem with working for Darden or any of these places is it all comes down to how reliable and decent the people are around you. Then you get a Bob, or cuntface, that ruins it all.",
            "You are a really good writer, my friend. That was a quality read. If you aren't getting paid to write things yet, you could be.",
            "This is hilarious. OP you're a really good writer.",
            ">Knowing full well that Bob was flying us by-the-book into a storm of   \nshit, I put on a feces-resistant raincoat, rubbed some Vick's under my   \nnose, and braced for impact.\n\nI'm still cracking up... great  writing style!",
            ">a problem compounded by his not knowing how the fuck to run a kitchen.\n\nYou already said he was your manager why say it twice??",
            "Absolutely hilarious writing style, I love it!",
            "Are you a writer cuz damn this read better than most novels, kudos",
            "I'm going to have to remember some of your words that you made up. Catastra-fuck. That's great!",
            "This is absolutely excellent. I'm dying hahaha. Please continue writing, your great at it.",
            "Great, now I want shrimp scampi and endless shrimp. You monster. 😭",
            "Where I live unless it’s a really fine dining place (but even then) the culture is that the food comes when the food is ready. The fastest to prepare things (usually veggies) come first, and noodles come last",
            "That sounds like a good song title from my band, Menstruation Cup Removal.  \"Shit Blizzard\"   \nwould be a hit.",
            "Oh man do I not miss being a line cook. Weekends at the cheesecake factory were never not a complete cluster fuck with managers being bureaucratic knowledgeless pain in the fucking asses.",
            "This was written by someone who has obviously read kitchen confidential a few too many times, and I mean that in the sweetest way possible.",
            "Sounds like Bob was too scared to confront the cooks so he wanted to pin the blame on you",
            "Former RL manager, when shit hit like that I didn’t  care if you were warming bags of linguine up your ass if it got the food out faster. (Being the assembler fucking sucked, put me on broil all day everyday)",
            "My wife's third shift at the Red Lobster in Tuscaloosa one of the cooks stabbed another kitchen worker.   She never returned for another shift.  It can get tense in the kitchen",
            "I worked at red lobster for three weeks. The manager had hired only under 18 dishwashers other than myself at age 18. I had severs yelling at me throughout every shift and the manager wouldn't do anything. I worked 12 hour shifts, scrubbing mostly scampi ovals, every night. I was rewarded with free pasta once. I walked out on mother's day after being yelled at by servers for two hours and was the only dish washer on shift. I also dropped three tubs of scampi ovals which mostly broke, before I left. I hope every single server was demoralized and left with no tips. Fuck that place, fuck darden.",
            "This story should have a warning label!\n\n😂😂😂😂😂😂😂",
            "You have seen trailer park boys and  \nI compliment all the shit references.",
            "Holy shit Red Lobster Gang! Jason if you're reading this im doing good and gor a better job!\n\n-Garrett\n\n\n\nOP, any chance you worked in takeout as well? That was my position, stressful af when it got busy because unlike Expo, there is no cap for orders based on table limits or waiting. Geez I remember having to put together 20 orders at once with some other workers",
            "First in first out in dishes. Nice.",
            "Front of house managers are almost always the cause of backups in the kitchen on busy shifts. Never worked Red Lobster but I worked in a restaurant. The GM would try to do the assembly when it got slammed and he was the WORST at it. He was so slow and messed up tickets constantly.",
            "I fucking LOVE running expo and I will take no shit. I'm not sure if I could have done what you did or if it would have been a showdown.",
            "I’ve worked dish pit, KP, sautee, frier, cold apps, and damn near everything between bar back and sous but expo is the one job that very few acknowledge when it’s going well but BoH and FoH both shit on the second that ticket times make anyone go into the weeds. \n\nBeen there and don’t miss it. Feel for ya bud",
            "Just wanted to throw out there: restaurant work is hard shit for sure, but corporate chain restaursnt work is a whole different lvl of fucked. There's some great spots to work, just avoid the large corporations that don't care about u, the food, or the customer(beyond their wallets)",
            "Please tell me the second time you asked him whether to do it the wrong way or the _Red Lobster_ way?",
            "This reminds of the UCLA red lobster meme",
            "Red Lobster was the absolute worst service industry job I ever had. No competition. I quit after a few months bartending there. \n\nServers would forget about their drinks then say they were melted so they’d pour it out in the drink window. They also took bets on how long before they could make new bartenders cry.",
            "Is that not expo? Why would they make up a name for expo?",
            "There are nurses, and there are emergency-room nurses. An ER nurse is NOT a trainee...when three gunshot wounds come in at exactly the same time, the ER nurse is juggling three balls at once.\n\nER nurse knows what the doctor will ask for next, so ER nurse has it ready just as the doctor asks for it. There may be a checklist somewhere that staff are expected to memorize, but...every GSW is different.",
            "When I was a kid I learned from the Star Trek novels to always trust the experts. Scotty would bust into the Captain's room, declare he needed the personal workstation to fix the engine and the Captain would help him carry it out.",
            "I love your writing style. I’d read a book written by you.",
            "I expedited for about four years in three different restaurants. At the first I got really good at it. To the point where I was handling Saturday night rushes mostly on my own with a manager helping at the peak. One of the two managers understood me, and just followed me. But one Saturday the shitty manager ended up on the line with me. Almost immediately he started telling me I was doing things wrong and making me change my whole system. Within minutes the servers were all yelling at him to stop fucking things up and let me do my thing. Good manager comes in and screams at shitty manager for destroying the dinner rush. Shitty manager eventually apologized. \n\nI got extra tip out that night from some of the servers because they realized just how good I was. Sometimes I actually really miss being an expo. I was really damn good at it.",
            "[removed]",
            "Back in the day I worked at Bdubs. Our kitchen was way too fucking small for the size of the restaurant….they pretty much doubled the restaurant seating without any changes to the kitchen…\nWe almost never had a problem because our main couple kitchen expos were out of this world good, but they’d be stressed the fuck out. We’d have a 25 minute wait on food but the severs couldn’t get the food out fast enough…when we were running on all cylinders it was a site to see. \nWe were right across the street from the mall; and dinner time before Black Friday one year we had 6 of our best kitchen staff on and whipped through it no problems. Really earned our shift beer that day. A great expo changes everything.",
            "Good story, great even. But we both know the biscuits aren't on the line and you wouldn't have to see through them 😉",
            "Fuck, you’re an excellent writer",
            "Hey Bob: If you don't know how to run a kitchen...why are you a MANAGER OF A RESTAURANT? Commonsense says a manager should know a thing or two about what they're managing.",
            "Honestly one of the biggest fuck-ups you can make in a restaurant is messing with the window person when it gets busy. Towards the end of my restaurant career, that was the last thing that would make me blow up on someone. There's too much shit to keep track of to have someone standing over your shoulder trying to backseat drive, and when window guy loses their place, everything goes sideways.",
            "I always loved expediting as a banquet manager. \n\nI'm from a loud Polish/Italian family from NY. Father was a drill instructor, and I'm a dad too. I used to be normally loud, but once I started expediting, my day to day voice became quieter, and I could get out my loudness in the kitchen. \n\nNever had to say shut up or quiet down like my other managers, but damn did the staff just quiet down knowing that there's no way to compete with my projection, and never had to repeat a table/ticket number. \n\nGod I miss that.",
            "I could have managed the kitchen I worked in for about a year and a half. As in, I could say hi to customers once and then eat free food and watch movies in the office.",
            "Fuck this is amazing. OP, I hope whatever you’re doing these days makes use of your talent with the written word.",
            "I rather enjoy your writing style :) If you don’t write in your spare time, you should consider it!",
            "You're a great story teller. I enjoyed every metaphor.",
            "Man what were you doing in a restaurant you should be writing! Sorry for the shit you went through but I was also quite blown away by how well you've written this.",
            "If food dies under the heat lamps, then what is their purpose?",
            "Ah yes Red Lobster. A truly shit hole of an employer. I quit them mid shift with both middle fingers in the air as I walked by the “grill master”.",
            "\"Bob was hyperactive and had an irritating tendency to micromanage   \nkitchen processes, a problem compounded by his not knowing how the fuck   \nto run a kitchen.\" \n\nI don't know whether to laugh or cry. You are a very good writer. Bravo.",
            "I worked at red lobster as well a few years ago and briefly as a prep cook (assembler) as well. It's hilarious because I know for a fact I have had this exact argument with management as well. I don't think you can be a prep without having one. It makes sense for regular steady service to avoid as you said giving guests hot plates but not for a hurricane like mothers day",
            "Bob learned it is better to manage with the restaurant gods than against them.",
            "The respect I have for people that do that plating role is enormous. As a FOH manager i would occasionally take over the pass if the monkey running it was about to be overwhelmed, hardly ever was it the platers fault.",
            "Not trying to attack you, but isn't expo's job to look for the shrimp that ticket needs before they're needed?  Or is that not the Red Lobster way?",
            "This has real Hunter S Thompson vibes, bravo.",
            "Absolute masterpiece",
            "You both tried to do the job.",
            "That's how things go where I work as well. But we, the kitchen staff usually insist on plating the entire order before sending it out and our boss insisting we ship what we have already and the rest can be taken later. But I find it just weird.",
            "Very entertaining storyteller! Vivid imagery!! Love the way you write. Sorry about your boss being a dick. Always people out there who have to try to assert their authority because they want to feel powerful. Ughhh",
            "I gave up on red lobster years yes even decades ago. We had one near our office and we ordered and waited 45 minutes — no food. So we left only having an hour lunch. The second time my salad came with the root still in it — you know the core above the cut line. The third time i got a hair in my soup. I was done. Never again.",
            "I hadn't been keeping track but it appears they've been sold again to Thai investers. https://www.restaurantdive.com/news/golden-gate-capital-sells-remaining-stake-in-red-lobster/584426/",
            "Fellow kitchen worker here, I know the pain especially when you have THAT manager",
            "I really want to take a moment to appreciate how well this entire story is written. I would buy a published book of such incidents if each were written this well. Thanks for the laughs!",
            "\"Knowing full well that Bob was flying us by-the-book into a storm of shit, I put on a feces-resistant raincoat, rubbed some Vick's under my nose, and braced for impact.\"  \n\n\nSuperb!",
            "Red Lobster ex-employees unite. We need a support group.",
            "Ex fry guy checking in here. I just quit by the old no call no show move. My gm called me when I was about to tee it up on the 10th hole about 7 beers deep. “You’re supposed to be here unloading the truck.”\n\n“Yeah, about that, I’m gonna have to quit.”",
            "Bravo! I spent years at Applebee's as a server/expo. I felt this. Sounds like a delicious moment.",
            "I feel your pain. Weird that job is called an assembler at red lobster. Never heard it called that before. I’ve also heard red lobster is a crap place to work. Unfortunately that type of FOH manager is endemic to all restaurants…",
            "I work at a Chick-Fil-A and reading this makes me glad I work counter and drive through rather than kitchen. Sounds like a freaking nightmare",
            "I hate anyone who is willing to put policy before practicality.",
            "Daaaaaaaaamn. I'm happy I've only ever done fastfood type stuff. What you had to put up with is the exact reason that I have never taken a job at a restaurant.",
            "This is hilariously written and horrible all at once. Also, what year was this? Do people still eat at Red Lobster? Are there still Red Lobsters?",
            "\"trust me, the faceless suits that have never even seen a spatula before know how this works, not you, the one with years of experience doing exactly this\"",
            "We called it \"running the wheel\" or Expeditor back in my day. Who ever was running the wheel was in charge of the entire restaurant, from how fast the hostess sat people, to getting more people to help wash dishes, to when steaks were put on the grill, everything. I loved doing it and I was really good at it, and I'm so happy I'm not doing it anymore. I hated having people who thought they knew better come in and try to run things differently while in the middle of a rush. I was not always kind to them in the moment.",
            "I read this with the same satisfaction I would get when I sit at a bar after my own shift watching other people suffer in the weeds sipping on my drink of choice.  (20 years of serving, barbacking, bartending, managing and now owning.)\nThanks for the proper storytelling of how robots cannot survive in restaurants.",
            "I’m an editor. If you ever want to write about back pain (the subject of the website I run) you’re fucking hired.",
            "I am crying laughing at just the title OP!!!!!!!!",
            ">and the rush went smoother, albeit with some hotter plates and servers having to return for delayed items\n\nSeriously.... I've never worked in a restaurant, but as a customer, it would've been zero issue if a waiter did something like...\n\n>Here's your entrees, but they're still make your side dishes.  It should just be a minute.",
            "I love your writing!!",
            "Just over 8 years spent as a server/bartender/AC/expo at the Crimson Crustacean, and I felt every bit of this post. Had a little bit of PTSD flashbacks of burnt hands and arms from grabbing near-glowingly hot plates because they \"need a help walk\". So glad that I never have to deal with Endless Shrimp again. I actually tracked the number of guests who had a mullet that came in during Lobsterfest, and how many came in during Endless Shrimp. I expected for there to be more during Endless Shrimp, but wasn't prepared for just how many more. The only solace that I got from having 'Merica's finest (who brought the kids from the next trailer over as well as their own to trash my section) camping at one of my tables for over an hour, and devoured hundreds of shrimp, was knowing that shrimp contain a decent amount of iodine in them, and that one of the side effects of consuming too much iodine is painful, explosive diarrhea.",
            "I am so glad the places I worked didn't have this mentality. Not saying smaller is better, but as a small, well-run place, we did well not letting shit due under heat lamps",
            "I could read stories from you’re life in food service all day long. It was fantastically written, and brought back a bunch of long ago buried by a bucket or booze memories of my 10 years in the food game.",
            "Hey!  You're a really good writer.  I worked in kitchens, so the story is all too familiar to me.  But I like the way you told the story.  I hope you keep exploring and developing you're writing, you've got skillz!",
            "This reads like Jim Lahey. If you didn’t base your vernacular on him, you should watch Trailer Park Boys, it’s beautiful.",
            "We called it “makeup” at the outback back in the 90s. I was fry and sauté. I good makeup cook called the shots and expo dealt with it. When i had a bad makeup cook, i would watch his tickets to time it right. When makeup is in the weeds, the while restaurant was in the weeds",
            "Fantastic storytelling my man",
            "Is it just me, or did anyone else think, \"Looks like this person watches Critical Roll.\" after reading that?",
            "TY for sharing.",
            "this is beautifully written, like those articles that writers in the 50s would get paid a living wage for by like the New Yorker or something",
            "Really great writing style, hilarious and I felt like I was actually there (I've worked in couple of kitchens long back). Look forward more of your stories!",
            "I hate people like that! Also, this was so annoyingly written",
            "Now that was a well written MC story.  I wish everyone had your flair for writing.",
            "This is some fantastic writing! Great job and good riddance to your service industry woes!",
            "You have a gift for storytelling.",
            "So now that you are done with Red Lobster hell, you are a writer, right?  Cause if not, you should consider that as a valid career.  You have talent."
        ]
    },
    {
        "post_id": "oiwg06",
        "author": "AcrobaticSource3",
        "title": "I have to wear work clothes in the office after hours? Okay, enjoy losing the account",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oiwg06/i_have_to_wear_work_clothes_in_the_office_after/",
        "score": 21512,
        "num_comments": 615,
        "created_utc": 1626112126.0,
        "selftext": "I like to keep fit. So after my work day, I usually go for a run in the nearby park. (I have stayed away from gyms, especially during COVID.) When my day is over, I slip into the women’s room to change and then leave immediately. Except there was this one day, a few weeks ago, when someone (“Becky”)  on another team was having trouble running macros in Excel. I don’t know the specifics of the document, but suffice to say, it was the final piece of the puzzle for a big account.\n\nSo, having changed and on my way out, I hear Becky call me over and asked for some help before I left. She’s a good kid, new to the company. So of course I stop to explain a few things. That’s when her team leader (“Louis”) stops me and says that I shouldn’t be in the office working in my workout clothes. I’m not wearing anything too immodest, but I am wearing clothes suited for running, so sports bra and shorts. I don’t want to brag, but I am in good shape and rather...well endowed. Louis is sort of a middle manager who isn’t powerful enough to be a kingmaker, but just powerful enough to cause a stink about company policies. He’s also a repressed prude.\n\nI explain that I was on my way out, not just hanging out to work, and stopped to help Becky. Louis is nearing none of it. He insists that I either change back to my work clothes or leave the premises immediately. I’m not going to let Louis push me around, so I apologize to Becky and leave the building.\n\nLater on, I learn that night was a deadline for some client deliverables and Louis’s team didn’t make it, costing the company the account and lots of money. (Low six digits annually.) Louis was fired for losing the account—and for making Becky do a part of the project that she wasn’t qualified to do, and that he was supposed to do himself.\n\nBecky’s still with the company, and she and I are now paired in a mentorship program. I wish I could say that I jog past Louis sitting on a bench in the park every evening, but things don’t always tie up that neatly!",
        "permalink": "/r/MaliciousCompliance/comments/oiwg06/i_have_to_wear_work_clothes_in_the_office_after/",
        "comments": [
            "Louis can wear whatever he wants in the unemployment line.",
            "What gets me is that he wouldn't listen to you enough to actually process the information. Or maybe he did, but being reasonable is in opposition to lording it over someone when the opportunity arises. Good job all around, OP, as you showed all your strengths",
            "[deleted]",
            "Frankly, that Louis's team was that far behind on their schedule that they were struggling in the last few hours showed that they were not competent.  If they had to deliver by that night, the last day or two should have been for double checking work and making sure it was right/presentable.  The panic late hours should have been 3-4 days before that evening.  So Louis was just incompetent and certainly not a good team leader anyway.",
            "My ex delivers alcohol for a living. A very fancy hotel was one of his stops years ago. There is no official \"uniform\" per say for delivery drivers at his company but they are all encouraged to wear t-shirts with the logos of the alcohol they distribute. So fancy hotel got a new loading dock manager. Hubs showed up and started unloading the 375 cases that they had ordered, there was a wedding there that weekend. Well new loading dock manager threw a fit that he wasn't in a suit and tie. Told him to leave. He called his dispatcher explained the situation and waited outside for it to be resolved. It wasn't resolved by hubs delivering the alcohol as ordered and needed. The new loading dock manager refused to allow him to unload in a t-shirt and work pants, so dispatcher canceled the order. Well 2 days later, the big politico's daughters wedding happened and guess what...no bar because none of the alcohol was delivered. Hotel lost a ton of money, tons of business and loading dock manager was fired.",
            "Sounds like precisely the event that was needed to bring his dickishness to the surface.  Presumably the pressure of the deadline and the fact that you were clearly more functional than him while also being in gym kit / about to go for a run, likely triggered him.\n\nImagine sending somebody away who is critical to get your account secured...\"cutting your nose to spite your face\"",
            "So did Louis roll up to the desk like\n\nOh. My. God. Becky, look at her butt.",
            "Nice. One could say you had full re*dress*",
            "Hey, you like running! Can you run these macros?",
            "Nice job, extra satisfying in that justice was properly served and new girl wasnt thrown under the bus. (he probably tried to though)",
            "Great fallout, and I used to exercise over my lunch hour, which definitely meant some time in the office in exercise clothes, so I get it. \n\nLouis wasn’t 100% in the wrong in this instance though (just 98% wrong). Dudes can run shirtless in the park but should keep their shirts on until they leave the office building. Similarly, walking around the office in just a sports bra (no shirt over?) is a bit much too. My gym doesn’t even allow shirtless or sports-bra-only exercise (sans pool, of course) and it’s a typical/public gym. That’s … not really work appropriate, even for “just passing through.”",
            "Based on your post history, this entire story is cosplay nonsense.",
            "[deleted]",
            "Ah see the real crime was he foisted HIS work off on an underling.  Had she managed it, he was going to take credit. His plan crashed and burned.",
            "How is a sports bra okay? If he was leaving to go swimming and walked up to you in a speedo I'm sure this post would be different. If it's a bra wear a top over it pretty simple.",
            "They say every time a worthless middle manager eats shit an angel gets it's wings.",
            "Management and their idiocy in regards to uniform, especially when you’re not even on the clock.  One time, I came early into work wearing a white pair of sneakers instead of black ones.  I just wanted to grab something to drink and go chill in my car before starting my shift.  My boss’s boss was there and immediately chew me out for wrong color shoes.  Even after I told her I wasn’t on the clock yet, (I kept my nasty black shoes in the car and change shoes before and after my shift) she still continued lecturing me about proper uniform because she wasn’t going to back down in front of my manager and staff.",
            "Oh I’d get fired if I walked with only a sports bra on around my work. It’s not professional. I agree with the other guy.",
            "So.. no shirt? Just sports bra and shorts? I would prepare myself for more interactions where coworkers in the office talk to you about your attire.",
            "I am going to get voted down on this, but I kinda agree. A sports bra may not suitable attire for a business at any time and I get that it might make colleagues feel uncomfortable.",
            "...and the \"not-bragging-but-I'm-well-endowed\" part of the story is relevant...somehow? ;)",
            "1000% a dude wrote this",
            "Not the same situation obviously, but similar because someone was being a dick. I used to be a CNA at a nursing home working an evening to overnight double shift. I had gotten...something...on my scrub top, nothing too crazy, and not much. So I washed the area, and was letting it dry.\n\nSo I'm sitting at the nursing station, in a tank top(I'm a slender male) and the RN supervisor came to my floor and was like \"You can't be like that, you have to put your top back on.\" I tried explaining the situation, and arguing that; 1, it's wet, 2. The residents are in their rooms, no one can see me, and 3, They wouldn't care either way. My quality of care I'm providing doesn't reflect what I'm wearing. \n\nHe was very persistent, and I reluctantly complied, and wore a damp top. Honestly more so because I didn't have the energy to retort, but I just found the whole situation dumb.\n\nAnyway I'm glad, in your case, he got fired. For being incompetent, and obviously for making an unneccesary fuss about what you were wearing.",
            "Yeah this didn't happen.",
            "Louis just wanted to flex and in his mind, wanted YOU to comply with HIS way of using company policies to good corporate view (very likely his superiors would have agreed with you on that day for trying to do what you did). Guess you showed him that you had a choice, and you have guts, the result of his inflexibility was glorious.\n\nGJ on preventing another power tripper being in your company OP.\n\nCheers.",
            "Great malicious compliance.",
            "That was a lot to type with one hand.",
            "Turned out Louis is no longer in the office working regardless of what he is wearing.",
            "‘I don’t want to brag, but I am in good shape and rather… well endowed.’\n\nRIP your inbox",
            "So satisfying when micromanaging microdicks get their just desserts",
            "[removed]",
            "I mean absolutely fuck the idea that you have to be in office attire after being briefly called in to help someone, but a bra? Under no circumstances is wearing just a bra without a shirt okay in the office, working or not. I’m baffled at the number of people arguing that or overlooking it.",
            "I mean if he thought it was inappropriate he absolutely should’ve taken it off line. There are ways to handle something like this if a Middle manager chooses to do so that can actually be effective.\n\nMy opinion of that company’s dress code policy is irrelevant but I do think that there’s a leadership opportunity here. If you choose to enforce some kind of standard or whatever there are right ways to do it and wrong ways to do it… Calling out a subordinate in front of another subordinate in such a jerk manner is the wrong way to do it… Talking to the “offender” off-line and in private not in front of their peers or subordinates is the right way to do it….Having no other options than black and white is the wrong way to do it… Figuring something out that works for everybody involved is the right way to do it.",
            "[deleted]",
            "Trash takes itself out.",
            "Good for you.  I run on my lunch hour from my work, and end up wearing my running clothes in the privacy of my own office for a little while after until I can get cleaned up and all.  I just find it easier to do as part of my work day, especially as I have a team under me and I need to basically work an \"extra\" hour a day so that I am here for customers until we close and have made it very clear that, I have no problem staying the extra hour, as long as I have a full hour to work out while at work (as you said, COVID=no gyms and running on treadmills sucks!).\n\nGood for you to not only be helpful in your intentions, but for sticking up for yourself by in fact leaving when he stated his little ultimatum--and let come what may with the work.  I feel at work too especially when it comes to excel and computers that I am the only one who can do it, so please respect me enough to just let me fix the problem for all of us instead of being resentful or obtuse.  He got what he deserved.",
            ">When my day is over, I slip into the women’s room to change and then leave immediately. \n\nThat's not a very nice thing to do, Brad...",
            "Louis should have been fired. Simply for not going for results. I don't give a fuck if you're in a chicken suit. You're producing results, all I care about.",
            "It is inappropriate for Louis to be 'managing' you. He should have contacted your manager about the dress-code issue and let your manager handle it appropriately.",
            "I’m in sales but I’ve got a manager that likes to ask a lot for help on basic things such as excel formulas. I happen to have a masters in business operations, so I’ve got a lot of Microsoft suite certifications. Anywho, she’s been getting upset with me over the last 2 months anytime I have an input about how to improve our department and has directly told me, “you need to stay in your lane and just focus on your job”. Cool beans, my job is to improve myself, not this department. I’m putting in my notice tomorrow and taking some time off of work. Starting a new degree program at the end of August, and the goal is to manage buildings instead of sales teams. We’ll see where I’m at in 2 years. Thanks boss for reminding me I need to focus on myself and not this department.",
            "Hah, he got what was coming to him. “Work after work but also look work appropriate” no thank you? I’ve done what you’ve done before especially when cycling or going to the gym right after work. Or if I had to come on a Sunday I’ve absolutely come in sweatpants.\n\nI WILL say though, bra and shorts are as “immodest” as you can reasonably expect in public, so I don’t super agree with you there, it wasn’t knee-length tights and a wife beater or anything. Not saying at all that it had to be, you’d “clocked out”! Just saying re: description because I run in a sports bra and running shorts and like… I have more modest bikini sets than that LOL",
            "Seems that plenty of people genuinely get upset about women’s bodies existing. But part of me thinks this guy knew Becky shouldn’t have been given that piece of work and he was trying to get rid of you before you realised and told somebody.",
            "I actually agree that workout shorts and a bra is not appropriate to wear in a typical office. What I don’t agree with is dying on that hill when you have a deliverable that will cost you your job if you miss it.",
            "100% cap",
            "I am retired from the military,  I have always said in reference to leadership; The empty barrel makes the most noise.",
            "Louis. i is dissapoint.",
            "Amazingly fast karma for Louis",
            "That’s awesome, I was worried that was going to end badly for Becky too but that was the best possible outcome.",
            "> He insists that I either change back to my work clothes or leave the \n> premises immediately. I’m not going to let Louis push me around, so I \n> apologize to Becky and leave the building.\n\nsay what now?",
            "I enjoyed reading your experience lol",
            "Every company I’ve ever worked for would have fired Becky for that.",
            "Oof, I wonder if Louis tried to throw Becky under the bus. Sounds like the kind of guy to do that",
            "Well endowed with huuuugggee .. tracts of land!",
            "[deleted]",
            "Ooooo karma",
            "Fuck dress code police in the workplace. Had one boss give me shit when I stopped by on the weekend to get my sunglasses I left at my desk. Was in shorts and a t-shirt, nothing that bad, and got \"talked to\" for daring to walk 10 feet on the production floor to my desk and back out the door. (Note - call center, no customers in sight anywhere ever).\n\nAnother job much further down the line, I used to like wearing hockey jerseys as light jackets when weather was mild. Company had a no sports apparel policy, which was fine. Had one self appointed member of the dress code police follow me to my cube every time I wore a jersey to make sure I wasn't wearing it as my work attire.",
            "So you were just walking around your office in your sports bra? I change into workout clothes all the time but I’ve never gone as far to walk around in just a bra. It’s not appropriate.",
            ">I wish I could say that I jog past Louis sitting on a bench in the park every evening, but things don’t always tie up that neatly!\n\nI enjoyed the rest of your story and agree with the general sentiment of it, but I would just like to remind you that no one should have to be homeless for any reason.",
            "I’ve never understood that. Unless you have clients coming through or something why does everyone hve to be absolute in their uniform-ness?\nHey there’s an idea, show up one day in casual dress and be like “oh well my business cloths got ruined and I didn’t have time to get new ones! But since I’m out of dress code compliance guess I can’t work okaaayyy byyyyeeeee!” 😂",
            "I would watch this movie.",
            "Karma is a powerful thing!",
            "Karma ? fate... SHit happens ? :D",
            "That is so AWESOME! When a “deserving” prick, gets their just reward!!!! Love it!!!!",
            "This is not malicious compliance. Its simply compliance.",
            "It's very very clear from op's Post history that op is actually a guy.",
            "This isn't really malicious compliance, you just did what he told you to do. But the consequences were really sweet. It fits the spirit of the sub, even if it doesn't quite fit the letter.",
            "Her karma ran over his dogma.",
            "Louis the type of person to say it's normal that his girl doesn't get wet",
            "💪",
            "\nBack when I was college, my uncle asked for a favor.  Could I tutor him on some software that he knew I used.  His boss was on vacation and dumped a spreadsheet on him.\n\nMy uncle's boss had my poor uncle convinced it was a very complex spreadsheet.  It was a complete joke.  I made a back up just in case but I fixed several formulas and put some in where things were being calculated manually.  Showed my uncle how to do everything in no time.\n\nWhen my uncle's boss got back, he was smiling.  Thinking my uncle had been lost but my uncle handed him all the figures and told him he fixed the formulas.  The boss was annoyed at first and then said, it was my uncle's new task to update the spreadsheet. Boss would present data at meetings as always.",
            "Good job!  I love it when the world works the way it is supposed to.  I hope Louis sees that he is the cause of his own demise.",
            "Should we call this karma or just desserts?!",
            "Louis did a great job of showing how powerful he wasn't.",
            "Loved this. Good on ya!",
            ">I am wearing clothes suited for running, so sports bra and shorts. I don’t want to brag, but I am in good shape and rather...well endowed.\n\nI'm having trouble visualizing. Would really help the story if you had some pics.",
            "I am sooooo over all of the dress code shaming that is out there. I do the exact same thing 3 nights a week. I change at work and go to workout. It is no big deal, Louis!  I just saw where American airlines wouldn't let a woman on the plane on a flight from Texas to Florida because her shorts \"were too short\".  Then the school that put a black bar across the girls chests for the school yearbook pictures. Is it that the male population really can't control themselves if they see anything they deem inappropriate (legs, cleavage, shoulders, etc.) It is it women who are jealous or prudes?   This is just another way to shame women and girls, and control them. We need to stand up for each other, for our daughters, for ourselves. If you don't like what I wear, easy enough...don't look.",
            "Wow, talk about karma coming back to bite him in the ass. He should've thanked you, not chastised you. Oh well, what goes around comes around.",
            "A petty little tyrant ruling over his petty kingdom and got burned.",
            "Misogyny cost him his job!   He will probably never understand that and will blame women his whole life instead of himself.",
            "All this dude had to do was stay out of it and he'd still have a job. Too dumb and sexist.",
            "good riddance to that frollo ass motherfucker lol",
            "> I don't want to brag, but I'm in good shape and rather...well endowed\n\nPics or it didn't happen. \n\n(Sarcastic joking.)\n\nAlso, good for you for how you handled the situation and well wishes in your future professional endeavors. It's also great to hear that you are now directly involved with mentoring your co-worker. Good stuff.",
            "You wore a sports bra, Louis wore out his welcome.",
            "Louis wanted you to go  back in the bathroom so he could get more video.",
            "Louis sounds like a straight up loser",
            "He deserves to be fired.\n\nIf this is where his priorities lie that close to a deadline for a major client...yeah, good riddance.",
            "Do you give him... *the finger*?",
            "🤣🤣🤣 Louis can go be a Walmart door greeter. What a fucking prick.",
            "i used to work at a promotional products company and it was common practice for women to wear yoga pants around the office no matter how thickkkkk they were…",
            "I love this story.  Good for you for walking away instead of changing clothes.",
            "I love this story.",
            "Wow, Louis couldn't wait to hang himself with all the rope you gave him.",
            "I'm so glad that Becky is still there and you are mentoring her! wtg.",
            "Nice, fun story :) .\n\nBuuuut i don't think this is really \"malicious\" compliance, just simply compliance?",
            "Louis just wanted a piece of that cake 👍",
            "hahahahahahaha.. Really raises my spirits to see an amazing outcome for once.",
            "Both you and Becky sound awesome.  Good on you for being a bro.  (well, whatever the female equivalent of a bro is, sis maybe?  Doesn't sound right)",
            "Louis probably was aroused, and could not finish.",
            "You definitely outclassed his wife"
        ]
    },
    {
        "post_id": "vuc1hp",
        "author": "timothy53",
        "title": "My first boss and how he got the whole team every certification available",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vuc1hp/my_first_boss_and_how_he_got_the_whole_team_every/",
        "score": 21494,
        "num_comments": 387,
        "created_utc": 1657290441.0,
        "selftext": "When I turned 14 years old, I got my first summer job and had one of the best bosses I'd ever had. I recently found out that unfortunately my mentor and someone I would consider a friend, John, passed away. Although its been well over 20 years I still use the lessons learned and the work ethic he passed on to me, although at times he could be hard he was more than fair and always did the right thing for those that worked for him. This is the story of John vs. the new president. \n\nBefore I get into the story I need to give some background and context on John. John was the textbook 'all American boy'. John had attended a prestigious boarding school somewhere in New England and eventually attended Yale back in the late 50/60's and was not only a scholar but a three sport athlete. He played football, he boxed and was a captain on the track and field team. Fast forward to when this story takes place and John was still in phenomenal shape for a late 60's early 70's man. \n\nJohn opted to move out to the country, start a family to follow his passion which was teaching at the local high school and coaching high schooler's in various sports. Obviously he was the high school football coach, taught track and field, he was an outstanding shotput athlete and could run the mile and many other long distances. \n\nAs a teacher, he had the summer's off and became a lifeguard at the local town beach, eventually becoming the captain of the lifeguards.  Over time he developed standards for the town/county/state lifeguards to pass. He really transformed what was a rag-tag style of lifeguard's into a full fledged official lifeguard corps, training academy and set the standards for what is still used today.\n\nJohn was eventually hired to run the lifeguards and manage an entire private beach club instead of working for the town beach. One of the biggest challenges of this, since it was a private beach club, John now reported into a President of the beach club who 'oversaw' how things were run. I started working for John as a helper on the beach and then eventually a lifeguard and for the first couple of summer's things were great. The President of the beach club took pride in having the best staff and making sure that lifeguards were well paid and to his credit safety was the upmost priority. This private Beach Club, certainly catered to the more 'wealthy' clientele who wanted a nicer club instead of going to the public beach. Some of the advantages were the amenities which were lockers, cabana's, private parking, a very nice restaurant that served great food and drinks. This was one of the few beach clubs that also had the ability to serve alcoholic beverages.\n\nOne of the good things John had instituted was that any returning member of the staff from the previous summer's automatically got a raise, this ensured that staff returned the next summer avoiding a lot of re-training and as you can imagine 'growing pains' with a new staff. What was even better was that if you returned multiple summers you still got an additional raise. Most summer's this was a dollar or two. As an example I started at 7.25$ at 14 years old (this was back in the late 90s) and by the time I was in college I was making almost 15$ an hour. \n\nTypically the president of the club serves a term which is a few years and when his term was up a new President was ushered in. Upon taking office the new president loudly proclaimed that he wanted to ensure that the club had 'fiscal responsibility' and he would be personally going over the books with a 'fine tooth comb'. His first order of business was to cut everyone's pay all the way back to minimum wage and fire most of the lifeguards. Now as noted above, the staff was there for a long time, knowing most the members and how to run the place. Prior to the start of the summer upon learning that their hourly wage would be cut, most of the senior staff immediately left and were quickly hired elsewhere. The lifeguards were spared at the appeal of John to ensure safety, although some senior guards left for other beaches and pools, John was able to convince the lifeguards as he would 'take care of things'. \n\nOnto the MC, while John agreed to have the staff take the pay cut, he convinced the new president that any lifeguards with additional certifications would get 2$ an hour on top of the base minimum wage. The new president obviously didn't consider that any of these lifeguards would put in the effort or if it was feasible to get any certifications in time for the summer season and he agreed to the plan. \n\nAs you can imagine, John basically established the process and curriculum for becoming a lifeguard and personally trained and hired most if not all the trainers in the town and county. John was also a volunteer fireman and new all the EMS personnel and not surprisingly had either taught them in school or hired them as lifeguards in their past lives. \n\nJohn quickly called in favors from every trainer and certifier across the county who were more than happy to repay all the favors John had done for them in the past. Most waived the training fee's and expediated the training sessions for the lifeguards and they 'wanted to promote' safety for the community.\n\nPrior to the start of the memorial day weekend and what is effectively the unofficial start of summer, all of us lifeguards and new staff become certified in pretty much every single possible certification that existed at the time. I mean I'm talking crazy complete overkill and unnecessary certifications for a 'regular' lifeguard. We got trained as either EMS and EMT's, although lifeguards had to be certified in CPR - we re-trained and got our CPR certifications again, Lifesaving ocean and pool rescue techniques, Certified Swimming Instructor, Certified Food Inspector (the club had a kitchen), Certified County Pool Operator license, Certified Sanitary Inspector (cleaning the bathrooms), we even had one guy who wanted to learn how to SCUBA, the county's firefighters had a water rescue team who coincidentally were certified SCUBA instructors, most of us guards become certified divers, open water divers, deep water rescue divers the whole works. I could go on and on about all the certifications we got.\n\nThe lifeguards not only went back to their original wage, but in most cases went well above what their previous wages were. At 18 years old and back in the 90s I personally went from making 15$ an hour to $27 an hour all due to the certifications and trainings. \n\nIt took a month or so for the fall out to happen, while the new president tried to renege on the deal, John was smart enough to have a formal arrangement in place and there was nothing the new president could do besides bitch about it. He winded up resigning his position 'to spend more time with his family at the beach'. We rarely saw him around that summer, and I think he eventually stopped coming all together opting to join another club. John made nice with the new president and explained his philosophy on training and keeping staff, the new president agreed and some of the senior staff winded up coming back with the promise of their original wage. \n\nA few weeks ago, I heard from friends and former colleagues that just at the start of the summer season John passed away in sleep of natural causes at the ripe age of 91. He was still working although not as much in the past, it was more of a I wanna keep busy type of thing then a need to work. Every morning he would take out the lifeguards row boat and get some exercise in, after all he was a Certified Rowing Instructor. \n\nRIP John, you were the best.",
        "permalink": "/r/MaliciousCompliance/comments/vuc1hp/my_first_boss_and_how_he_got_the_whole_team_every/",
        "comments": [
            "The world needs more folk like John. Rest easy now John you were clearly a good one!",
            "King of protective managers... Sorry for your loss.",
            "President: So John, I hear you have a lot of certifications. Which ones?\n\nJohn: Yes",
            "I am so envious that you got to know such a person.",
            "A friend who works for a major distribution warehouse company started out being a stocker at $15.00 hourly. Her boss insisted that she get forklift operator training, for certification,, logistics certification, quality control certification and programming certification to learn how to program the assembly belts that distribute the products on the assembly line. In six months she went from making  $15.00 hrly to  $30.00 hrly From the day  she was hired to 18 months later she was making $65.00 hourly. She pulls a Mon -Thurs 4/10 shift, paid holidays, 6 weeks of vacation, great health insurance, dental, 401k great discounts, incentives  including being fed catered food for those working overtime on evening and overnight shifts, bonuses and rewards for meeting production goals. Thanks to a boss who GAF and encouraged her team to take advantage of every opportunity the company had to offer.",
            ">He was still working although not as much in the past, it was more of a I wanna keep busy type of thing then a need to work. \n\nIt's hard to hit a moving target...  RIP John.\n\nEdit: thanks for the silver kind redditor",
            "Class act....all too rare in real life.",
            "A true relic of the past. What I would give for a boss like that now at 40 let alone college age.",
            ">  the new president that any lifeguards with additional certifications would get 2$ an hour on top of the base minimum wage.\n\n...\n\n> I personally went from making 15$ an hour to $27 an hour all due to the certifications and trainings.\n\n\nOh snap!  So it was $2/cert, not a flat $2 if they had certifications?",
            "What an amazing story and a fantastic boss and person. Thank you for sharing.",
            "I used to work with a widowed empty-nester like that. When her kids left the house in her forties she started taking a little bit of everything she could through the local community college. \n\nIn the 90's, when the company got email, the company policy was that you had to include all your qualifications as part of your email signature. She'd been at it for a good twelve or fifteen years at that point, so her email signature was a whole block of acronyms and initialisms almost two lines long.\n\nIt was a really odd bag, considering she was the real estate manager for a computer leasing company. \n\nStuff like flight instruction, phlebotomy, childhood nutrition and marine navigation.\n\nBut there were other ones she actually used. She was a certified fire inspector, meaning she called bullshit every time our sprinkler or extinguisher vendors pulled anything. Office and warehouse spaces were always beautifully lit, thanks to her certifications in industrial and commercial lighting design. Someone fall down and hit their head? She had EMT training, and she made sure our first aid kits were less of an afterthought and more something you'd see in a doomsday prepper's bunker.\n\nHell, when we did our yearly disaster preparedness runs we called her in. Certification in small engine repair and only missing the hands-on for a couple ASEs meant she was better than anyone else at diagnosing a generator no-start.\n\nOh, and the email signature requirement lasted exactly as long as it took for her to send an email to the CEO.",
            "Another quick story I just remembered about John. \n\nLater in life he got really into golf, and being the natural athlete he was, he got really really good. He went from never playing golf to being a scratch handicap in a few years. He also refused to join a country club and only liked to play at the local public golf course with his teacher friends, lifeguards (obviously) and the volunteer firemen. He eventually became the golf pro due to his charismatic nature and obviously his ability on the course. \n\nI asked him why he wanted another job, and he said well I get to play for free now! You could find John most of the week at the golf course either in the pro shop, on the course or if it was later in the day and hot out at the halfway house having a turkey on rye with onion and a cold beer. \n\nAnother golf related story, he let some the SCUBA guys go diving in the various lakes for golf balls, which they cleaned and resold for quite a profit. All they had to do was give John a few of his favorite brand, which I believe were Titleist 2's.",
            "Wow, great story. Worth the read.",
            "This is the way.",
            "What a great memory. Thanks for sharing John with us. May his memory always be a blessing.",
            "1) excellent story, you were lucky to meet such a person.\n2) Very well written, you obviously are good at telling stories.\n\n3) Chesterton's fence got taken down, and the consequences of the consequence, it was really expensive to build back up.\n\n\nOne quibble. What  does All American mean? I know zero people who went to boarding school and Yale and I hang around a whole bunch of PhDs in the STEM fields. I understand it from a sport context, but not growing up with privilege. At least John used that privilege for good!",
            "Shit, that's awesome!\n\nAnd with all those certifications, all of you got huge bonuses towards year-round employment in all those different fields.",
            "This is like an anime plot. The hero falls on tough times, but all the friends he's made along the way lend him their power and together they beat the villain.",
            ">His first order of business as to cut everyone’s pay all the way back to minimum wage.\n\nJesus Christ.\n\n>18 years old…. 90s… $27/hour lifeguard \n\nJesus Christ",
            "Anyone: Hey can the lifeguards…\n\nJohn: Ya they’re certified for that",
            "Why am I crying? This is beautiful.",
            "What a beautiful story of both an amazing man and malicious compliance. 💜",
            "I am sorry for your loss, and thank you for sharing this man's great take on life, truthfully inspiring.\n\nBest regards,",
            "Fantastic story. John was a great person.",
            "Dude. John was amazing! He sounds like one of the most Noble people that ever existed. \n\nMay he never be forgotten.",
            "This is fantastic! Thanks for sharing",
            "This is human excellence. I, and the rest of the world, am sorry for this loss.",
            "Thank you, OP, for the new mantra: \"Be more John.\"",
            "i never knew you john but i fucking love you",
            "Not only MC, but beneficial to the guards and there's a solid chance that at least some (if not many) people were helped or saved by the additional safety knowledge and experience. You go John.",
            "John sounds like an absolute legend R.I.P\n\nBut now I must the most important question of my life.      ARE. YOU. FORKLIFT. CERTIFIED",
            "I enjoyed this. John is the sort of good man I enjoy meeting. He sounds amazing. Your story made me sorry that I never knew him. Thank you.",
            "For economic reference, in the mid 90's, a college graduate was looking at around $30,000 to start (if you had a general degree, like business). Minimum wage was around $4.25 IIRC. \n\nSo these guys were getting paid pretty well thanks to the MC.",
            "After all he was a certified rowing instructor! 💀💀💀💀💀💀💀💀💀💀💀💀",
            "I am so sorry to hear about your loss. He sounded like a top guy",
            "I loved that last line about how he is a rowing instructor. Lmao",
            "John: The jack of all- I mean John of all certifications",
            "[deleted]",
            "Epic story, great write up:)",
            "John, the superhero!",
            "The world definitely needs more people like John.",
            "R.I.P. John.  Dudes like you are RARE and you will be sorely missed!",
            "This guy sounds like the true epitome of \"Be the best you can be\" mentality! I wish I could have known him and am genuinely sad to hear such a kind person has passed",
            ">He winded up resigning his position 'to spend more time with his family at the beach'.\n\n\"Where he drowned because the only lifeguard there was a minimum-wager.\"",
            "People like this are the wheels that turn the world. \nUnfortunately they often get ground down by petty burocracy.",
            "\"Regard your soldiers as your children, and they will follow you into the deepest valleys. Look on them as your own beloved sons, and they will stand by you even unto death.\" - Sun Tzu",
            "At first, the extra details about John bored me and was about to stop reading. I'm glad I got through the whole thing. \n\nA touching MC tribute.",
            "👏🏽",
            "I too had an amazing mentor who sadly succumb to his cancer in 2019. RiP Mike, I'm glad you missed all the covid, murder hornets, area 51 nonsense, and possibly ww3, you'd have been so pissed lol.",
            "That's a damn good boss right there.\n\nI'm sorry for your loss.  May you be far from the only one that was inspired by him.",
            "He sounds a brilliant person thank you for sharing.",
            "What a wonderful tribute! This sounds like a story his family would enjoy (re)hearing. Funeral homes usually have a tribute/comment section under the obituary. I know I appreciated every story i heard about my dad.",
            "A man worthy of the name John Legend. You are incredibly lucky to have had him in your life.",
            "Sounds like an amazing guy. The world needs more people like that. Hopefully his influence on you continues to be passed along to those you come in contact with.",
            "Hah, now I know where Hollywood gets the idea that some YMCA lifeguard (probably played by The Rock) can weld underwater, perform emergency surgery, fly a helicopter, parachute into a hurricane, and all the other ridiculous movie stuff.  They think you all train like astronauts.",
            "May his memory continue to be a blessing.",
            "What a wonderful man. This is a story that every manager and upper-level staff should read: treat your people well.  Thank you for posting this, and I’m sorry for your loss.",
            "This brought a tear to my eye!  People like John are rare and special and such a treasure to know.  My condolences, OP.",
            "Open water diving certification is possible, but you can’t get rescue diver certification without a lot of experience with diving.",
            "John's that dude with adhd levels of sporadic interest and focus, just without the adhd. Heavy interest in basically everything and the drive to get it all done.\n\nAbsolutely a boss.",
            "This is awesome...\n\nBesides the work ethic, making sure people know their stuff (and then some) even manage it in such a way to say a friendly 'up yours' to mangler supreme.\n\nMore people should be like John, and less like that 'new president' in the club..",
            "this was quite literally how the pay structure was when i was did Camp America as a foreign camp counsellor\n\ni signed up assuming it would be the American Summer Camp experience that we dont get here in Australia, what we see in the movies, being in a Cabin with X amount of kiddies and go camping etc....\n\nwhen i rocked up in Florida, they looked at all my Royal Life Saving/lifeguarding qualifications and just made me the head lifeguard of the pool and the lake\n\nso not only did i get a private cabin with no campers, but it was a day camp, so i got evenings and weekends off!\n\nso i had a waaaaaaaaaaaay more relaxed summer than friends who got sent to other camps, who got like 1 day off a fortnight, and were stuck with brats in their cabins\n\nand, to round it all off, we got paid in a lump sum at the end of the season and unbeknownst to us, the pay structure had a similar baserate increase per qualification as the OP, and i had quite literally an entire folder of relevant certificates, and ended up getting almost triple the pay of the other foreign counsellors at the end of the summer",
            "John, May the force be with you. You are a gentleman to the core. RIP",
            "Legend",
            "Rest easy, John. OP, thanks for sharing this memory with us.",
            "I hope John is up there having a good time. He earned it.",
            "John should have a movie made…. Well, not John but you get my point.",
            "He was great! Most bosses are only out for themselves. Wish I had one like him",
            "I love this. I knew a John like this but not quite as wily ... Rest in power friend.",
            "Raising one up to John and the managers that protect their people.",
            "What a great mentor. I bet you make him proud for your downline also.",
            "Sounds like a tremendous guy. What a great read too. RIP John.",
            "Enjoyed reading that, RIP John.\nEveryone needs a boss that has their back, never forget them!",
            "[deleted]",
            "Why do I feel like I've read this before?",
            "RIP John. some people are just so insanely.. good, at everything they do",
            "I had the experience of working with an old Ivy League genius as well. He was a company founder with patents galore, had a brilliant engineering mind. Unfortunately he was also super racist and thinks Cornell was ruined when they let the blacks attend.",
            "That is such a sweet homage.",
            "This is how I try to run my teams but I’m no John.",
            "This is the sweetest MC I have ever seen",
            "RIP, John. The Certified Sanitary Inspector and Certified Food Inspector was the *chef’s kiss*",
            "I only know John through this and I already miss him.",
            "John is the boss every boss should aspire to be.",
            "One of the best CMs I've read, if not THE best!  Thank you so much for sharing.\n\nRIP, John.  RIP.",
            "It's really dusty in here all of a sudden.",
            "Did this happen to take place on the Jersey shore? I think my junior guard commander may have been this John.",
            "May his offspring ever increase.",
            "A great story about an amazing person, thank you",
            "He sounds like an amazing man, I am sorry for your loss.",
            "He's off to his next adventure.  Travel well!",
            "Lovely story, I hope it's true. Either way this is a modern-day parable.\n\nR.I.P. J.",
            "Now THAT is a memoir I want to read.",
            "We need more people like John these days.",
            "Great story. Thanks for sharing. John was a good dude",
            "> $27/hr as a lifeguard in the 90s\n\nJesus",
            "I used to think THIS is what bosses do.",
            "All american boy! He was an absolutely awesome idol.",
            "There needs to be a statue of this man in his town.",
            "Party of \"fiscal responsibility\" vs Party of \"let's take care of the people\"\n\nParty on Wayne, Party on Garth",
            "The best kind of MC is the kind that helps those who would be shafted. Hell yes, John.",
            "Awesome man. Wish there were more like him around these days.",
            "This is literally taken word for word from a *This is American Life* story.",
            "How were you \"trained as either EMS and EMT's\"?\n\nEMT stands for Emergency Medical Technician but EMS stands for Emergency Medical Service doesn't it?",
            "*utmost",
            "RIP John. \n\nVery well written, thanks for the little movie I was able to play in my head.",
            "Apostrophe tends to imply possession or contraction.  Summers and summer's are very different things.",
            "[deleted]",
            "When I turned 14 years old, I got my first summer job and had one of the best bosses I'd ever had.\n\nI couldn't go any further. Like no shit. They were also the worst boss you had ever had!!",
            "[deleted]",
            "Dude contain your apostrophes",
            "WHOSE CUTTING ONIONS?!?! \n\nJohn was one of the good ones.",
            "TLDR",
            "Damn tears. RIP John",
            "Thank you for this wonderful story! <3",
            "Rest easy, John.",
            "We doing it for Johnny!",
            "This is an awesome story, and a great tribute to John!",
            "Thank you for this story - it was a good read!",
            "I'd never heard of a Yalie high school teacher until today.",
            "What a lovely story. Thank you for sharing it.",
            "After the terrible president resigned and the new one came back in, did you get to keep your $27 an hour or did it bump back down to $15 an hour?",
            "What a wonderful way to immortalise such a special man. The world needs more Johns.",
            "Thank you for this story!",
            "RIP John!\n\nthank you for sharing !\n\nWe need more compassionate badasses like this.",
            "RIP, John.",
            "Scuba certified life guard. That is awesome!",
            ">after all he was a Certified Rowing Instructor. \n\nThat line killed me 😂\n\nRip John",
            "Best one I’ve read all week!!!",
            "Great story, man. Sounds like he was a great man. RIP",
            "A toast to John and all those guys like him!",
            "He sounds amazing. Thank you for sharing this.",
            "RIP John.  And I'm sorry for your loss.",
            "a class act",
            "Why am I crying right now? John sounds like a really awesome person and I'm glad you got to know someone like him.",
            "What fucking LEGEND! Rest in Power John!",
            "I absolutely love this story, John is a stand up man for all time. Thanks for sharing this wonderful MC with us :)",
            "RIP John. A true gentleman and a scholar.",
            "wow.. this story definitely made me feel like I’m wasting (at least part of) my life as a couch potato, what with getting aches and pains in my early 30s",
            "Out of curiosity, did any of the lifeguards go on to jobs afterward where they could use their certifications?  I know that a number of the EMTs and firefighters I know started out as lifeguards in high school, and just stayed in the \"rescuing people\" field.  Coming out of high school with an EMT ticket and all those other things would be a fantastic step up.\n\nAlthough, honestly...  they might well be taking a pay cut for a beginning salary in the 1990s...",
            "John was like the Avatar of certs and I’m here for it. What a man.",
            "RIP John! You were amazing!!\n\nSo sorry for your loss OP.",
            "John's an absolute legend",
            "RIP John.",
            "What a wonderful story - thank you for sharing with us!  \n\nOn another note...may I ask: why do you use apostrophes to denote words that are plural?",
            "Here’s Johnny !\nVery nice",
            "Rest easy John. You earned. Give ‘em hell up there on the otherside.",
            "May John rest in heavenly peace. Bless his soul.",
            "What a wonderful story to honor his memory",
            "I'll raise my teacup to a man like that! You live on in the lessons you taught, John.",
            "Damn rip John it’s sad that all the good people from previous generations passed on and were now left with the shit ones. Wish it was reversed the world needs more guys like John",
            "Damn John was a G. Great story :)",
            "I'm so sorry for your loss. He sounds like a wonderful person. Thank you for sharing his story with us. May we all strive to be more like John! 💛",
            "F",
            "I remember reading this story before, or one that was so similar, as to just be uncanny.  \n\nHave you mentioned a version of this story on Reddit before?",
            "This is just beautiful. The world needs more Johns.",
            "Rest easy, king",
            "This made my heart happy. Sad he passed away, but his life and legacy sounded heartwarming and proud.",
            "Joe Biden was a lifeguard. He got in a fight with CornPop. \n\"End of quote. Repeat the line\"",
            "John sounds like an amazing man! Thanks for sharing his life with us.",
            "To everyone: be like John. Excellent life goals.",
            "Waiting for rSlash to read this.",
            "Great story",
            "John sounds like a great guy. His passing is a loss for your Community.",
            "It seems like John was an amazing man. I hope he was happy and rests in peace",
            "John, your legend lives on. I hope you're whipping the afterlife into shape lol",
            "We need more people like John in this world, sorry for your loss mate. RIP",
            "What an amazing role model.  I bet his memorial was a very special day with some wonderful stories told. RIP",
            "91? The good ones are always gone too soon. RIP John. You’re missed by someone who never knew you.",
            "Rip John,  the world needs more of this.",
            "F",
            "This world needs more Johns in it",
            "I did not know the man, but I feel the world is a better place because of him. For that, I mourn his passing.",
            "By order of the court of reddit, your license to use the apostrophe has been revoked. You may still continue to use single quotes as you please. \n\nSo ordered, this 9th day of July 2022.\n\nRIP John",
            "Wonderful story, thanks for sharing it - a great way to honour the memory of a good man.",
            "👍👍👍👍",
            "Man a boss like that, what a treasure",
            "F",
            "RIP John.",
            "What a nice story!",
            "(Applause!)\n\n\"ripe age of 91\"\n\nInspiration to live better and wiser to that age!  Love it!",
            "John sounds like an amazing guy."
        ]
    },
    {
        "post_id": "8cn7t2",
        "author": "mrissaoussama",
        "title": "\"Try your best at answering questions to our customers\"",
        "url": "https://i.redd.it/4877kgx6o8s01.jpg",
        "score": 21422,
        "num_comments": 75,
        "created_utc": 1523882519.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/8cn7t2/try_your_best_at_answering_questions_to_our/",
        "comments": [
            "I just switched off of r/Overwatch and got REALLY confused",
            "Maybe they can make a character that is a gelatinous cube and make that a skin.",
            "[Overwatch Twitter on getting new skins](https://i.imgur.com/ZhBJoRk.png)",
            "Hey guys it’s Jeff from the Overwatch team...",
            "Whoever is allowing the PR representatives to say things that aren’t just canned responses deserves a raise.",
            "It ain’t a screenshot though",
            "This is a bit too tame for malicious compliance, I think. It's just like a pedantic joke",
            "Teasing at it's finest",
            "Who put Zenyatta in charge of the Overwatch Twitter account?",
            "I mean they got what they asked for.",
            "Skin skins? Nudes confirmed. ",
            "[Missed opportunity.](https://imgur.com/lqzJoJ6)",
            "Ah shit",
            "That's not a screenshot, it's just a goddamned picture! \n\nI feel betrayed.",
            "Ask and you shall receive ",
            "Your epidermis is showing ",
            "I posted this at the same time :(",
            "This is r/madlads material",
            "General Reposti!",
            "Wendy’s vs. Overwatch.\n\nRight, fight, fight!",
            "Should’ve posted a foreskin",
            "Ur missing the past tense  only 30 million people used to like it ",
            "The sad thing is I can name most of the structures in this diagram. Yayy pointless knowledge from teaching 2 years of University anatomy labs! 😅",
            "What loser still cares about over watch\n"
        ]
    },
    {
        "post_id": "xnp4sc",
        "author": "WitchyWolf94",
        "title": "Boss says I can’t come in early to set up my cart. So I come in right at clock in. Coworker who leaves early gets mad at me",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/xnp4sc/boss_says_i_cant_come_in_early_to_set_up_my_cart/",
        "score": 21400,
        "num_comments": 540,
        "created_utc": 1664116812.0,
        "selftext": "TLDR: I used to go in early, coworker tried to use me, I told her no, boss took her side, so I stopped coming in early.\n\nSo this happened back in 2015 through 2016. I (now 28F) was working as a phlebotomist in a local hospital and I worked first shift, which was about 3 am to 3 pm. I loved to come in about 10 to 15 minutes early and just set up my cart. Nothing fancy, just metal wired shelving types and we had our own personal phlebotomist trays that we put in the top section of the cart. I didn’t always restock my tray before leaving my shift, so I’d typically come in early to organize it and get my metal cart ready. (It usually took me maybe 5 minutes to put my tray on a cart and put the handful of tubes I needed back in place, then I’d spend the rest of my time waking up in the break room with coffee)\n\n\nWell, one woman (can’t remember her age) who came in to work a few months after I started and I had issues. I found her lazy and rude. Examples: she would come in and snap at people when they tried to help her. She would take a book with her during morning rush (which was 3a - 6/7a) and sit on the floor to read and not come back to the lab to help after collecting her labs. She would hang out during the nurses celebrations and not come back for hours at a time. She wouldn’t clock in until the last second and then she’d clock out the earliest minute she could. When it was time to start the morning rush, she’d get mad if someone took the stack of labs she wanted and she’d go demanding them. She and I worked the same overnight shift, but I got tired of her attitude and switched shifts.\n\n\nWell, like I said, I liked to come early and set up my cart before I clocked in. And she figured this out quickly, so she would try to hand me the stroke or trauma pager (something that needed to be handed to the next phlebotomist who was scheduled to take it that shift, but she’d try to give me hers even if I wasn’t scheduled for that one), but I refused, saying “I’m not clocked in yet”. So, she just left it on my cart a few times without telling me, which lead to it going off for a call to the ER and I had to clock in early and when I saw her in the lab again, I told her to never do that again, the conversation got heated, which lead to a meeting with me, the coworker, and our supervisor. Our supervisor took her side and said “Just take it and if it goes off, you clock in and then I will adjust the clock in on the computer”, saying she’d shorten my time on the clock.\n\n\nSo I said fine. I set my alarm for later in the mornings and I started coming in the last minute I could to clock in at 2:59 am. Yes, it made me start my rush a little later, but the look on my coworkers face when she saw me later (right before she was to clock out) as she was trying to hand me a pager I wasn’t scheduled to have and I already had the one I was supposed to, was priceless. She complained to the supervisor, who tried to talk to me, but I said “Well I’m not supposed to be here until 3, so that’s when I get here and clock in now. I don’t want my hours messed up”. She didn’t even try to argue. The coworker was very upset. She even screamed through the lab, demanding someone take her pager so she could go home. It was still 20 minutes until her shift was done.\n\n\nEDITS: Added the TLDR and paragraphs as suggested! Thank y’all for the suggestions!!",
        "permalink": "/r/MaliciousCompliance/comments/xnp4sc/boss_says_i_cant_come_in_early_to_set_up_my_cart/",
        "comments": [
            "It always blows my mind people like this don't get told to get fucked more often",
            "I'd be super disappointed in your supervisor for trying to placate her just because she is likely emotionally draining to manage.",
            "Assuming you’re in the US, your manager is trying to time-shave- which is extremely illegal. Good on you for standing up for yourself!",
            "It's always surprising to me how unprofessional people can be in medicine. I had a shift last week where a paramedic who doesn't normally work our shift felt the need to lecture everyone on their history of PTSD and traumas. Blows my mind how people can act like that.",
            "I'm not in the medical field but I've had experiences like this too - both the bad coworker and manager enabling them.\n\nOne of them was so bad I outright quit the job - management was all behind her leaving her shift an hour early and making me take care of everything an hour before I was supposed to clock in, then working *hours* after I was supposed to leave the next morning. It was not unusual for me to work 11 or 12 hours a day though I was scheduled 8. Don't worry, they were editing the schedule so I never got overtime though. Wish I could say I'd quit the job over this, or that I'd reported it to someone, but I didn't know any better back then in the 00's.\n\nAt a more recent job, I was being told to do multiple impossible things by management - one insisted I had to stay late until my work was done every night, one insisted if I was in the building I had to start working no matter how early I was for my shift, etc. Upper management had a snit and told me I couldn't work beyond my shift hours period or they'd start writing me up. So I adjusted my availability so I wouldn't be sitting around for an hour before work, and started immediately leaving after my shift was over. Nobody was happy with that except me, and I got threatened a few times with getting written up because I wouldn't start early/stay late anymore. Unsurprisingly, they didn't. I would have loved to have seen them try.",
            "I used to end up at work  10-15 minutes early sometimes because road construction was horrendous and I could never tell when I would be routed onto city streets. One co-worker started meeting me in the break room, passing on patient info and then walking out the door. She clocked out the minute she saw me, even before I clocked in. The last time she did that, I told her I wasn't clocking in until my posted time and if she left, the lab wouldn't be covered. She complained to the manager and he finally told her she couldn't clock out and leave until after I clocked in. She couldn't understand  \"MLSGeek is here, why can't I leave?\"",
            "\"Just take it and If it goes off you clock in and I'll adjust the clock in on the computer\"\n\n\nIs your boss seriously telling you to clock in and start work early and then in the same breath telling you you're not gonna get paid for that?\n\nHow did you not laugh in your bosses face at that?",
            "Good for you standing up for yourself.  Most managers only want to avoid drama and they end up caving to the problem employees.  Either that or your manager is buddies with the lazy worker and will try to bully other workers so their \"buddy\" can take it easy. Employees need to hold their managers accountable and document everything you are told.  This way if something happens later, your butt is covered and your manager and the problem employee are left taking blame usually.",
            "Dealt with this in the restaurant business in college.\n\nI would come in early to stock the line because the morning guy had been doing it for 20 years, did all the morning prep, but did not do night prep to boot ( I don’t blame him)\n\nInstead, I had to come in, stock, and had tickets waiting on me, as well as no help the first hour\n\nI made $10 an hour… an extra body for an hour would have cost less, or they could have given me an extra 30 minutes",
            "In a good work environment, hard stable workers are rewarded.\n\nIn a bad work environment, nasty attitudes are rewarded as the bosses always choose the path of least resistance regardless of who's in the right.",
            "[deleted]",
            "I’m also a Phlebotomist- currently working at a plasma center and some of the people that they are bringing in just flat out aren’t certified. They also have no business in healthcare in anyway. I have Phlebs on the floor making donors cry because they want a specific person to stick them due to bad previous experience. But just because the Phlebs are taught the bottle is more important they force the donors into discomfort and as I stated before I’ve had multiple donors crying this week and not a single person was reprimanded. \n\n\nIt’s such a sad day to see people who really shouldn’t work in the field starting to dominate it because companies just don’t care about patients anymore. They only care about profits and will hire whoever will fill the role even if they barely fill it",
            "To start, your super shorting your time is illegal about 40 11 different ways.  Your solution is the right solution - for this job.  Maybe go to a different hospital?\n\nEdit:  Then I read other comments.  Yeah, your writing could be improved but it was completely understandable.  Not an issue, though.",
            "I am sorry this has happened to you. I have been a MT for 22 years and I want to thank you for your time and dedication, good help is hard to find.",
            "As a Lab Tech, I forgive you. Unhappy phlebs make for unhappy techs. Defiantly if she has time to come help process morning draw and just doesn't. Or is on 3rd shift and sits on the floor? The time it takes me to process cuts into time to actually run the damn specimen. \n\nDid she get a lot of hemolyzed or clotted samples? Was she at least good at her job? Or was she bad and a bitch too?",
            "Hey this is cool and all, but preparing for your job is part of your job and you should be paid for on location prep time.\nNot saying you're in the wrong or anything, just saying you deserve to be paid for work you're doing :)",
            "Damn! What an awful supervisor you have! You sign in early and she'll \"shorten your time on the clock\"? Does that mean you don't get paid for every minute you work? So some lazy ass witch can break protocol by handing you a pager you're not supposed to have? And she gets to leave early? Does she lose pay for leaving early?\n\nThat coworker should have been written up and then fired. Screaming in the lab? OMFG!!!",
            "Can confirm….. ICU RN.  We frequently drew our own labs out of necessity…… but we relied on some seriously EXPERT phlebotomists when needed and the good ones were constantly being used and shit on by the crappy ones.  It took well above our manager’s pay grade to finally make certain that only really competent/quick/accountable people could come to our unit……. The crappy ones like to come because even though it was a tough stick (or we would do it ourselves) they could often milk it into an hour of time off their regular floors when no one knew where they were and they were unaccountable.\n\nWe got to the point where we would call the phlebotomy supervisor and let her know when one of the bad ones was leaving with the labs, so they couldn’t claim they were still here.\n\nIn a union hospital it can take a LOT to get rid of bad apples…… but it was worth it to us to unite to get rid of them.  Peoples lives were at stake with stat labs…. We don’t have time for that shit…",
            "Doing patient care without really caring about the patient's welfare.\n\nShe should leave the industry and not work in the medical field.",
            "I've recently heard the term \"quiet quitting\". Which is basically doing the minimum in your job.  \n\nIt is abuses by co-workers and management of the \"going above and beyond\" attitude that make me do the minimum.",
            "Time to write her up for her outbursts. Remind her she has a contract yo work her posted/assigned hours and failure to do so will result in termination.\n\nMaybe is will wake her up or get her to quit.",
            "What does \"collecting her labs\" mean? And what's the \"stack of labs\" she went around demanding?",
            "Shitty supervisor.",
            "Supervisors who don't supervise and instead try to act like parents without wanting to be the bad guy, (\"Well, just be nice and help out your ~~sister~~ coworker\") are worthless.",
            "Isn't she endangering the lives of patients by leaving that pager unattended? I can't believe your incompetent boss would pretend to take her side on that when they knew you were right all along.",
            "Fucking CLASSIC lab manager behavior. Easily intimidated by bullies but still tries to be assertive with other employee. I hope you are in a better position now!",
            "If she doesnt want to do the job roughly ``30mins before she leaves cut her pay by 30mins people only ever shape up when pay gets stripped",
            "And that's why rule #1 of managing people is never appease a bully. (It's rule #1 for a lot of other things too(",
            "If this was in the US, it would be illegal for the supervisor to alter the clock in time like that. Unless you're salary. Then I have no idea what the law is about that, but I'd still frown on the inaccuracy of the time worked.",
            "A friend who works shifts is petty like that. No clocking inn so when your relived you can go. If you’re the kind of person who gives as good as you take, then she will be more than happy to come early and relieve you. If you’re a taker she’ll come early, sit down with her lunch outside your window and wait til the very last minute.\n\nEdit: I love her pettiness. One of the people who always want to leave early and never comes in early commutes by ferry. He’s in town 45 min before shift starts, but always show up 5 min before. Then he complains that he hasn’t been relieved 20 min before his shift ends so he’ll miss his ferry. They run every 2 hours or so.",
            "Love your MC story, and thanks for exposing so much about phlebotomy, I legit feel like I learned a bit about what it’s about!",
            "It bothers me the hospital doesn’t pay you for the 5 minutes of set up and a little overlap so this isn’t an issue.",
            "As soon as I read the title-I knew. I was a hospital phleb for many years. This is a never ending problem. There’s always one.",
            "Why was she so stressed about handing the pager? Was she worried she would end up stuck working extra time if the pager went off?",
            "I worked in a factory. Shifts went 7am - 3 day shift. 3-11 afternoons. 11pm -7am midnight.\n\nDay shift had all the whiny kiss asses on it. But also the front office folks.\n\nIt was customary to go on the floor a bit early to get the information needed for your shift and switch out with the folks who had been standing at the machines for eight hours. \n\nExcept day shift. They’d go on the floor after clocking in right at 7. Then they’d stand around a bit. Then they’d finally go to their assigned areas to get the info for next shift. This caused midnights to stay an extra ten to twenty minutes everyday. \n\nBut if afternoons did the same thing to dayshift, afternoons would get yelled at.",
            "As someone who works a crazy schedule 3-3 is the most psychotic shift I’ve ever heard of. 6-6 or 7-7 would be much better",
            "\nI feel sorry for the stroke and trauma victims, having workers there like that.",
            "Sounds like your hospital needs to be better managed",
            "Is that Entitled IDIOT still there?",
            "Good. You not her doormat.\n\nShe is a lazy bum.",
            "Fellow phlebotomist here, idk why but there always seems to be one of these every shift at all the hospitals.",
            "Years ago I worked for a company on a Navy Base that had certain rules such as OT was earned after 8 hours of work, not 40 hours, Sunday pay was 25% more, etc. So they would try to schedule us for under 8 hours a day, and then they decided that after 5 hours on the clock, you will be deducted 30 mins for a lunch break, despite 99% of the time not getting one. I never could get them in trouble over since they had US Government rules that trumped the state rules, so that may have been acceptable. We were hired as NAF employees (Non-Appropriated fund) and hired as flex so 0-40 hours with no guarantee.",
            "And people like that mate and reproduce more people like that",
            ">“Just take it and if it goes off, you clock in and then I will adjust the clock in on the computer”, saying she’d shorten my time on the clock.\n\nWAT",
            "good on you.\n\nthat supervisor is useless as such.\n\nBe strong. Be safe. Be well.",
            "Her frustration worthy character screams cringe and red flags...geez. Putting up with people like her calls for extra pay no cap",
            "You posted this under “malicious compliance” which, while I guess it could be considered that, it really isn’t. Instead of you going in 15 minutes early & stocking your cart *without being paid for that time,* you now go in exactly on time & use your working hours to stock your cart. That is all you are required to do. It’s like calling doing your job “quiet quitting.” No one is quitting. And you were not not doing your work or shortening your paid hours. In fact, your supervisor wanted you to come early, start working early, and not get paid for it. That’s just bullshit, not a requirement. When you do the job you are contracted to do, that is not malicious nor quitting (at any decibel). That’s doing the job you were hired to do.",
            "That supervisor was trying to also take advantage of the situation, mostly to not have to deal with the shitty coworker (but also because OP worked for free every shift)",
            "I would just talk to hr about the coworker and your supervisor and get them both fired. Shitty people don't deserve jobs",
            "I HATE people like that \nShe is the kind of ridiculous person that causes accidents to happen, it’s completely irresponsible for her to just leave the pager and walk away and your supervisor should have disciplined your coworker and not do the ((oh just take it to shut her up)) route \nIf that person has 20 mins left on her shift then she has the pager for another twenty mins common sense right? Maybe she shouldn’t be working in a hospital environment her energy sounds awful",
            "Hahahahahaha coworker got royally fucked over for trying to fuck someone else over. LOL!",
            "Jesus Christ. That coworker should have been fired immediately. I have never really been one to ask to go home early I just don’t get it.",
            "I'd assumed this kind of shit staffing and shit management to tolerate it was a unique feature of the NHS.  Guess it's more universal in healthcare than I realised.  Good job on the MC to handle it!",
            "Loved the story. The manager should be pimp slapped though as well. Did either explain their logic ???",
            "No malicious compliance here. You just work with shitty people.",
            "I had a similar situation. I work shifts as well, and the previous shift can't leave until I'm clocked in, changed into work clothes and at my \"station\". Since changing into work clothes was legally work time, I always came in about 15 minutes early because if I'm at my station after .0 of the hour or half hour, the previous shift can't leave until 10 minutes after. There also sometimes was traffic problems or paperwork so 15 minutes as buffer was fine. I'd usually be ready 5 minutes before my shift starts. and because I was there, the previous shift could already leave while I changed clothes.\nBut then my coworker T came around. Always trying to control things, and he disliked how I'd be too early and \"collect too much overtime\"..even though at the time I'd end my shifts up to an hour early and actually make ngeative overtime. Anyway T told me to \"clock in on time\", he wanted me to come early, change clothes and only then clock in right before going to work. so if I was 15 min. early I should change clothes and clock in so I'd make less than 5 min. of overtime.\nI did maliciously comply, and ended up clocking in riiight when my shift starts. so my shift starts at 10AM, I'd clock in at 10 and then change clothes slowly, and only then get to work. as result now everyone else had to stay 10 minutes longer. of course people were pissed and tried to give me shit, so I went back to my old system and they stoped complaining. T tried the same play once again, already made a MC post though about that one.",
            "I like that you're supervisor was going to only adjust your hours if the page went off the minute they handed you that pager you were clocked in legally and they should have started paying you the minute they expected you to be able to answer a page",
            "> She wouldn’t clock in until the last second and then she’d clock out the earliest minute she could.\n\nWhy are you adding this to the list that's supposed to make us hate her?\n\nYou have your set hours. Work them. You don't owe any more than that.",
            "> She wouldn’t clock in until the last second and then she’d clock out the earliest minute she could.\n\nIs this not what everyone does?? Why would you work outside of the clock?",
            "It sounds like your mistake was coming in early and working off the clock to set up your cart NEVER work off the clock.",
            "Well done.",
            "She was desperate to boss you around lol",
            "Night shift is supposed to stock carts at my facility . When the AMs get there they need to take their carts and go.",
            "Yeesh does your supervisor like her or something...talk about favoritism",
            "As a phleb this a tale as old as time. Still going on.",
            "It still blows my mind that in a manager meeting she told you to work for free. \n\nWhy the fuck are you changing my hours if I had to clock in to do that bitches job. Shorten her hours.",
            "Idk where you're from but it's for sure illegal to shorten your hours that you worked.",
            "I read this as she's a Phlegm otomist, so hock a loogie in her coffee.",
            "First off. If she ever just leaves the pager in your cart without telling you again. Chuck it in the trash (you never saw it). Let her take the heat for loosing it.",
            "I wish OPs would explain the technicalities. Like what is it that her job is or what is a pager in normal people language.",
            "No worries. I don't obsess much on the opinion of others. I just hope OP finds what she needs to be happy. As we all do.",
            "Quiet quitting strikes again",
            "Sounds like she needs a phlobotomy",
            "> : I used to go in early\n\nDon't go in early, work when you are supposed to. Don't work for free.\n\n> So I said fine. I set my alarm for later in the mornings and I started coming in the last minute I could to clock in at 2:59 am.\n\nYou should have been doing this anyway.",
            "I honestly would've dumpted the pager on the nearest surface and let it ring into oblivion. It sucks that someone has to suffer because your coworker is lazy, but action won't be taken unless it really hurts. This is how you force corporate environments to fix issues.",
            "Ah yes sweet revenge. Love reading things like this even if they aren't all real.",
            "That digressed into a word salad quickly. I was interested until about a third of the way into it. Take a breath and step back...",
            "awesome story. no compliance though. doesn't belong here.",
            "Clock in as soon as you get handed the pager and then make a DoL complaint if you get shorted on hours worked. \n\nReally, you should have just clocked in when you started working and complied with wage and hour rules.",
            "Did you do that cart setup before clocking in? Working for free, then being told to stop working for free and clock in and out when you are supposed to, is not malicious compliance. \n\nHonestly, I don’t see how the post fits here. It seems to just be “compliance”, especially after reading your TLDR. It was just a toxic work situation.",
            "Fucking Karen.",
            "Why were you doing work off the clock anyway",
            "What cart",
            "Jesus fucking christ. I couldnt make iit past the second sentence without saying get to the fucking point",
            "Hey Siri!  What’s a dad?",
            "[deleted]",
            "And 7 years later it’s still the highlight of your life. Grow up",
            "Fuck that sup",
            "And no one thinks to fire her?",
            "Just remember to work your wage.",
            "😂😂😂😂👏🏻🔥",
            "I feel like you worked with my Aunt Jerrie. \n\nFor that I must humbly apologize. She was a beast of a personality.",
            "In my experience, if you are at your job and are given a task or equipment off the clock and you cannot just drop everything and walk out the door, that means you are on the clock and need to be paid. Having the pager means your are clocked in, whether or not it goes off, because it means you need to be attentive to it.\n\nI just left an online gambling company in Michigan that wasnt paying 5 minutes overtime daily for people being relieved late, and chances are theres a huge payroll lawsuit going their way cause of it.",
            "My cousin is a nurse and she’s told me about all the immature, controlling, and manipulative coworkers she’s had to work with. I cannot believe the drama is so bad!",
            "I don't understand why people are so itchy to leave early all the time. Like are you allergic to money?"
        ]
    },
    {
        "post_id": "a7nyuc",
        "author": "Olympus_XIII",
        "title": "Dad gave me a 2:00 AM curfew... I complied",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a7nyuc/dad_gave_me_a_200_am_curfew_i_complied/",
        "score": 21397,
        "num_comments": 1001,
        "created_utc": 1545237149.0,
        "selftext": "Recently discovered this subreddit, and love it. First time poster, English not my native language, etc.\n\n&#x200B;\n\nWhen I was about 16 or 17, like any other kid at that age, I desperately wanted to go to a party all my friends went to. All of my friends were older than myself, so they had no curfew, or were allowed to stay very late. My dad, however, was a pain in the ass at that time. Or at least, that was my perception. He wouldn't let me go anywhere, and when I was allowed to go, he'd give ridiculous curfews that held no account with the nature of the event. E.g. going to the movies at 8, but demanding to be back home at 10... that kinda limits your choices, right? And you don't want to be *that* friend who puts constraints onto the group.\n\nSorry, I digress. Anyway, that particular day, I negotiated for him to give me a later curfew. After a while, he stated that 2 AM was the absolute latest I should be home. That sucked, because most of my friends had a 3 AM curfew AND the party was at least a half an hour bike-ride away. So this would mean I would miss more than 1h30 of the party (yeah, severe case of FOMO here). I tried to negotiate some more, but then I realized what date it was. Enter Malicious Compliance.\n\nYou see, it was the last weekend of October, on a Saturday. I don't think this is the same everywhere, but in the larger part of Europe *this means that Daylight Savings Time ends.* At exactly 3 AM, clocks are set back one hour. So I went to the party, not by bike. I asked for a friend to drop me off, making sure that I would be there exactly on time. I made sure that my dad didn't hear me a minute too soon (because then, I would be almost an hour late!). At exactly 3 AM (or better: 2 AM for the second time), I opened the door and got in.\n\nNeedless to say he was furious, demanding an immediate explanation as to why I was an hour late. When I said I was exactly on time, pointing at his own radio-controlled watch, I could see his face turn all kinds of red, and an awesome mix of defeat and anger in his eyes. He sent me to bed, knowing I was right, and I complied, knowing I was very wrong.\n\nNevertheless, it was an awesome victory!\n\nEdit: Some context on the curfew. 2 AM was definitely a reasonable curfew. Not exceptional though: it's very often something like 1AM for 16yo, 2AM for 17yo, and as of 18 you're legally an adult, so do whatever the hell you want.\n\nEdit 2: Thanks for the awesome reactions (and for the silver, wow!)! I always assumed this was the kind of story where everbody would know somebody who pulled this off.\n\nEdit 3: Holy \\*\\*\\*, this kinda exploded overnight. Thanks for the replies, upvotes and even my first gold! And to all those commenting what a sh\\*tty kid I was to my dad: of course this was an inconsiderate move to make. But first: kids will be kids. Second: this subreddit is called r/MaliciousCompliance. Not r/GoodyTwoShoes  ¯\\\\\\_(ツ)\\_/¯\n\nEdit 4:   \nI live in Belgium. Judging by most the comments, the curfews mentioned in the story and in my first edit may look ridiculous for the average American, I didn't realize this. But really: these are pretty average for a European country.\n\nAs for the \"18, do whatever the hell you want\": this comment obviously applies to curfews. Once you reach the age of 18, a lot of parents here don't give curfews anymore, yes, even when you're still living in their house. Basically: \"Bring breakfast when you get home by morning, and don't do anything stupid\".",
        "permalink": "/r/MaliciousCompliance/comments/a7nyuc/dad_gave_me_a_200_am_curfew_i_complied/",
        "comments": [
            "I suppose there's a meaningful difference between \"be home at 2 am\" and \"don't let 2 am get here before you do.\" ",
            "well done. if I had a kid pull that on me, I’d at least know they were safe and sober enough to come up with a scheme like that",
            "Did a similar thing once when organising a party. A couple of friends and I would rent out the local youth center each year and throw a huge party (~250 people). The youth center's permit allowed us to stay open until 2 AM. You can see where this is going I suppose... we went on partying until 2:59, then ended it at 2:00 :)\n\nIt probably helped that our parties had a good reputation, even with the local cops. They stopped by earlier in the evening and they usually would also show up around closing, except that one year. We never figured out if they were simply busy elsewhere or if they were intentionally looking the other way.",
            "\"When you're young, you sneak out of home to go to parties. When you're old, you sneak out of parties to go home.\"",
            "But like, 2 AM curfew for a 16/17 y/o is pretty reasonable tbh ... no ? ",
            "Outstanding move. ",
            "What is FOMO?",
            "If my son came up with this I wouldn't even be mad lol. I'd probably just laugh my ass off ",
            "I did the exact same thing when I was a senior in high school.\n\nThe only difference was that I had trained my parents to expect MC from me by that point - and the next morning they just asked \"which 1:30\" did you get home by? (In the US, the clocks \"fall back\" at 2, not 3)",
            "That was well a timed move, if I may say so. :)\n\n^(I'll see myself out.)",
            "English is not your native language!? \nI wish I could write like that in any of my non native languages!",
            "You might be foreign, but I know you’re not African because my parents would’ve laid me out on the spot. \n\nYour English is great btw. ",
            "I had a 10pm curfew until I moved out at 22...",
            "A 2 AM curfew is fucking awesome, why do you have a problem with that? ",
            ">and as of 18 you're legally an adult, so do whatever the hell you want.\n\nShould i tell him?",
            "All the Americans not believing this is hilarious",
            "Well played",
            "Technically right, the best kind of right ",
            "Every patron in my bar when I was a bartender would argue this point. The vice police didn't give a shit. Last call is 1:45am, and bar has to be clear by 1:59 so the time change had no affect. ",
            "I did this with Daylight Savings Time and curfews when I was a teenager too!!! \n\nMy parents weren’t pleased but once they accepted that I knew what I was doing they eased up on curfews.  ",
            "My parents would be calling nonstop. What would your explanation have been if he called you at 2:30?",
            "Ok good one, but 2 am is not an unreasonable curfew...",
            "That’s an insane curfew! Mine was 11pm at 17 unless it was a weekend, then it was midnight... ",
            "Yup I did this once as a teen. I had nowhere to go. But dang it I was staying out that extra hour. ",
            "The circumstances for this are so specific",
            "You know, there a saying. \"Nothing good happens after 2:00AM\". ",
            "The only good modern use of this stupid archaic system.  As a former equilateral restricted child, I applaud you, as a mom, I want to ground you while trying to keep the smile off my face. ",
            "2 am midnight? The fuck am I missing out? I'm 18 and I stick out till 9 pm tops.",
            "I’m learning that Reddit has a lot of old people who forget what being a teenager is like and have completely forgotten the rebelliousness that comes with being simultaneously a child while wanting to be an adult. \n\nAlso, “you could have been studying”, Jesus fucking Christ. You could probably be doing something more productive too, but instead you’re on reddit. It’s almost like fun supersedes self-improvement sometimes. ",
            "Dang... I’m 18 and my curfew is still 11:00 pm",
            "\"English not my native language\"\n\nyet they narrate better than most people who have never left the US",
            "That's the kind of thing you should absolutely get away with only once. And luckily, you can only try it once a year anyway, so once is really all you need.",
            "Heh. I'd have laughed my ass off if my kids did that. I reward intelligence b/c I want to see that.",
            "\n>as of 18 you're legally an adult, so do whatever the hell you want.\n\nI really don't want to the one to break this to you but I'm afraid not buddy.",
            "I used to get upset over my curfew when I was younger, but now I’m a father and I realize how much I worry about my kids and just want to make sure that they are safe.",
            ">Edit: Some context on the curfew. 2 AM was definitely a reasonable curfew. Not exceptional though: it's very often something like 1AM for 16yo, 2AM for 17yo, and as of 18 you're legally an adult, so do whatever the hell you want.\n\nyeah not if you've got asian parents\n\nGreat story but relative to my childhood, you sound like a kid who got a $10,000/mo allowance and is complaining you couldn't buy the brand new car you want",
            "99% of the time, Daylight Savings Time does it's job and saves millions of sunlights a year. \n\nBut just this one time, Daylight Savings Time saved your night out. ",
            "But you still missed out on the party that went until 3AM! Did they party until 3AM for a second time ultimately making you miss at least an hour and a half of the party! :O ",
            "Dude. My mom literally walked into the movie theatre and ripped me out of my seat because I was ABOUT TO miss my 9 pm curfew. At 16. On a Friday. ",
            "When my son was 16  and 17, he set his own curfew when he went out. I'd ask him \"What time will you be home?\" and he'd say \"the party should be over by midnight,\" so we'd set his curfew at 12:30, or whatever worked. (I wasn't really protecting him; I was protecting myself from having a coronary worrying about him. :-) And it worked well because he was part of the process.\n\nOnce he was in college and home for the summers, his curfew was 5:00am -- I didn't care how late he stayed out, I just didn't want to wake up in the morning and find his bed empty. :-)",
            "That might be the best thing ever posted on this sub, you magnificent bastard",
            "If you were my son, I’d still be pissed. But obligated to give you a high five and a good job son.",
            "[removed]",
            "Shit I thought that daylights savings was just a US curse. That shit needs to go. \n\nGlad to hear it helped you with this one. ",
            "I don't think you can call your dad an ass if he let a 17 year old out until 2 A.M.\n\n&#x200B;\n\nThere's absolutely no way my teenagers will be able to stay out that late. They can do that in college. ",
            "wtf i turn 18 in 3 months and my curfew is 11:00",
            "2am is a ridiculous curfew....ridiculously late!! Why on earth does a 16 year old need to be out that late? Wierd European thing. ",
            "[removed]",
            "In what world is 1 am a normal curfew for a 16 year old?\n\nBut kudos on your scheme! Very good, mate!",
            "A 2 am curfew is super reasonable and you're a twat",
            "Honestly I not aloud to ride after dark, I feel like you were just being a dick.",
            "2AM is pretty generous. That’s more than a most parents. Most parents set midnight or 1AM. \n\n18 is when you’re legally an adult yeah but you aren’t really an adult till you move out and pay your own shit. Being an Adult isn’t about the legal definition but rather when you can handle your own shit. ",
            "Yeah that dad wanted to know his kid was safe without having to stay up until three fucking AM, what an asshole.",
            "I have to know. What was the next day fallout for that stunt, if any? If my niece or nephews pulled something like that, I'm pretty sure I'd be a mixture of annoyed and proud. I'd also probably be tempted to return the favor by giving them a curfew of 3 AM the following Spring just as a light-hearted poke back to remind them of their cleverness.",
            "Technically correct... the best kind of correct!",
            "I think the best part of this story is, at least in what you told us, how your dad didn't punish you for that.",
            "So I've just learned I had a special parent.\n\nMy mom never really gave me a curfew.\nShe just wanted me to send a message when I came home or if I spend the night at a friend's place. ",
            "I told my kids no YouTube on tablets but greenlit them playing Xbox. I come back a little later to watch them in their Minecraft world I noticed they had gotten a YouTube app and were watching their favorite videos through the Xbox. I cannot be mad at them because they complied and found a way to get what they wanted anyhow. Just have to say I didn't know about that loophole, y'got me this time now take that app off the Xbox. Kids can be clever. If they outsmart me then good for them to keep me on my toes (provided that it isn't something dangerous).",
            "Bro what my bed time was 9 untill I was 17",
            "I was high for the first time when daylight savings happened and i was like i swear it was just 2am",
            "What’s the point of even giving your kids a curfew if it’s 3am?",
            "You said non of your friends had curfew then said their curfew was 3 am",
            "It’s a fine story, but that’s ridiculous.",
            "Poor Dad needing to stay up that late making sure you came home safely. F.",
            "My god you were so lucky. My curfew was 7. Always. No excuses.",
            "When I was 18 I had 10 pm curfews. ",
            "I love how common it is that when a post starts with \"english not native language\", the following text is impeccable grammar and spelling more accurate than many actual natives :D",
            "wtf my curfew is like 10:00",
            "Did he kick your ass out of the house on midnight of your 18th Birthday?",
            "r/iamverybadass",
            "Great scheme but dude, 2am is not bad at all. Most teens have to deal with 11pm or midnight latest as a curfew.",
            "Ha!  This year on daylight savings time I allowed my 16 year old to stay out until 1. Her normal curfew is 12. I am fast asleep when she gets home but I make her prove to me that she's home by 1. And the kid got home by 1!  The first 1!  I told her in the morning, better luck next year!  She didn't even think of it.  And she would not have been in trouble cause I kind of figured she would find that loophole.  I would have!  ",
            "Heh, I did that once, too. My mom told me to be home at 4am, completely forgetting it was winter hour change. I came home at 4am indeed, but one hour later than I should. She was furious, I pointed out the fact and she told me to go to bed, before I was able to catch her laughing.",
            "I don't remember ever having a curfew, my parent knew that sometimes it's important to let your kids be social. On the other hand they always sayd: Big guy in the evening means big guy in the morning. No way they let me sleep in, even if I came home at 3.",
            "I had a 9:30 PM curfew at 16...",
            "I’m 18 and my curfew is 11. Kill me ",
            "Hold up... 1:00 am for 16???\n\nJFC, I thought my mother was unreasonable, but this is something else. My curfew is 9:00!!",
            "I'd still have been grounded and I'd still ground my kid. This falls under \"oh so you knew what I meant but thought you'd be a smart ass\" clause. Technicalities and being right don't matter. Don't be a dick. Dad was lenient and extended curfew and you were a little shit who willfully disobeyed. We've all been that little shit for the record. I did all sorts of dumb shit. It's part of growing up.",
            "\"You didn't say which timezone.\" ",
            "Dude, your dad was awake at 3am! He genuinely cares about you and your safety. Call him and thank him. ",
            "At 16/17 my curfew was 7pm, I would have killed for a 2am curfew...",
            "It took me a long time to learn this but How I Met Your Mother was exactly right: \n\n\"Nothing good ever happens after 2AM.\"",
            "Plot twist : the party was supposed to end at the second 3 AM",
            "1AM curfew at 16, if only I had that. My parents wouldn't let me out past 9pm.",
            "So when I was a teen, my curfew was 11 or 12 on exceptions, even after turning 18, I was basically told if I didn't like it to find another place to live. \n\nAm I the weird one here? ",
            "Sounds like you were the asshole and your dad was super cool by giving you a 2 AM CURFEW. Wow. ",
            "> 2 AM was the absolute latest I should be home\n\n> most of my friends had a 3 AM curfew\n\nHoly shit, that's absurdly late for 16/17. My own curf-\n\n> but in the larger part of Europe\n\n...oh. Europe. That explains a lot. \n\nTIL most American parents are freakin' medieval.",
            "This entire post just makes you sound like an entitled brat.",
            "Way to be a dick to your dad who gave you an insanely generous curfew almost NO 16 year old gets, make him scared, and abuse his trust and what the rule obviously meant. This isn't juicy and satisfying, it's a whiny teenager being a whiny teenager. Get your angst out some other way.\n\n\"But my older friends can do it.\" Are you 3?",
            "For a 17 year old, a 2 AM curfew is generous.",
            "2AM curfew? That's like no curfew at all basically...",
            "[deleted]",
            "Your dad seems like a good reasonable dad, you seem like a little shit though and I hope he punished you.",
            "I feel bad for your dad, you sound like a little asshole who should be studying instead of socializing",
            "2am curfew sucked what is wrong with teenagers. ",
            "> When I was about 16 or 17, like any other kid at that age, I desperately wanted to go to a party all my friends went to. All of my friends were older than myself, so they had no curfew, or were allowed to stay very late. My dad, however, was a pain in the ass at that time. Or at least, that was my perception. He wouldn't let me go anywhere, and when I was allowed to go, he'd give ridiculous curfews that held no account with the nature of the event. E.g. going to the movies at 8, but demanding to be back home at 10... that kinda limits your choices, right? And you don't want to be *that* friend who puts constraints onto the group. \n\nDamn I felt that",
            "I'm just going to leave [this](https://www.youtube.com/watch?v=84aWtseb2-4) here.",
            "Most places in the US have legal curfews of 12 or earlier often times for under 18 year olds. ",
            "English is not OPs first language, yet grammar and vocabulary better than most who only know English.",
            "My parents made me be home at 10pm every night until I graduated high school. Get over it.",
            "So at 18 you can “do whatever the hell you want”\n\nDid you leave home at 18? If not, hopefully you’ve realised the world doesn’t revolve around you.  "
        ]
    },
    {
        "post_id": "9f9hsh",
        "author": "NGD80",
        "title": "How my new boss lost his fingers.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f9hsh/how_my_new_boss_lost_his_fingers/",
        "score": 21376,
        "num_comments": 752,
        "created_utc": 1536771184.0,
        "selftext": "Back in the early 2000s I was a management trainee for a manufacturing company in the UK, and I was responsible for quality control and production management. I was 22 years old, keen as punch and ready to change the world.\n\nAbout 11 months into the role, I got a new boss, let's call him \"Fred\". Fred was also the company owner's son, and was basically a 45 year old fuck up who had only ever been a drug dealer/DJ and now stood to inherit the entire company. His management style was, let's say, 'interesting' and he would deviate from \"screaming at you for the most benign thing ever\" to \"I can't deal with the pressure so I'll go home for the day\" in a matter of hours. He also thought he was a manufacturing GENIUS. His ideas were batshit crazy, but he would scream at anyone who questioned him.\n\nThere was a 52 year old machine operative, let's call him \"Roy\", who has worked on the same machine for over 30 years. Roy could tell when his machine was 2 weeks away from a breakdown, just because it sounded different. He was truly at one with his machine.\n\nFred decided that we would modify Roy's machine so that we could extend the range of products we could manufacture. In order to do this, he decided that we would add an additional spindle to the machine. The problem was that each product would finish at a different time and you would need to remove a product from the machine while the other one was still spinning.\n\nRoy protested and said he'd never use it, but Fred went ahead and modified it over the weekend with a subcontractor.\n\nOn Monday, Roy said \"you must be joking, I'm not using that\". Fred said \"you will use it, or you'll be looking for a new job tomorrow.\" Roy said \"it's not safe and I won't use it. If you try to make me I will report you to the HSE.\" And then Fred said \"if you report me, I'll make sure you don't find work ever again\".\n\nSo Roy smiled and said, \"ok, fine, I'll load the next job but you can run it first.\"\n\nRoy loaded on his next job, and took two steps back...he also looked at me and said \"stand back\".\n\nFred started the machine and all went well.... for about 30 seconds. \n\nThe first job had reached the diameter required and Fred pressed 'stop', however he now had to lean over the other job that was still running at 2,000 RPM. I didn't see it happen but I heard an awful scream and then saw blood squirting everywhere. Fred fainted onto the machine, narrowly missing the spindle with his face and greasy long black hair. We pressed the emergency stop and picked him up, and it was then I spotted his fingers in the machine. I picked up two middle fingers and gave them to a colleague to put into a freezer bag, which was a waste of time because they couldn't reattach them, they were too mangled.\n\nFred never came back to work. Apparently he told his father he wasn't cut out for running the company and I also left about 6 months later. I saw recently that it was bought out in a management buy out and good old Roy was the operations director. Good for him!",
        "permalink": "/r/MaliciousCompliance/comments/9f9hsh/how_my_new_boss_lost_his_fingers/",
        "comments": [
            "I will bet you $20 that the sub that modified the machime warned him multiple times it was not safe. Probably had him sign a waiver as well!",
            "Never argue with an old-timer about safety.  You don't last that long in manufacturing without knowing exactly how to avoid disasters, before they happen.",
            "TL,DR; Roy anticipates a rounding error, digits truncated in the worst way. ",
            "If Fred hadn't threatened Roy's job over a safety issue, we'd all have to feel slightly guilty about being so happy Fred got fucked up. But Fred is better off without fingers than Roy would've been without work.",
            "I don't know about the US, but if I heard \"if you don't do it you're fired\" after I said \"I would like to invoke my right to refuse unsafe work\" and had witnesses, I would say \"fine, fire me\" then drive to the closest law office that has an employment lawyer and that lawyer would take that case on contingency as he jerks off into a tissue because it's the most open shut wrongful termination suit there is.",
            ">Apparently he told his father he wasn't cut out for running the company\n\nಠ_ಠ",
            "Ahh good ol' eight finger Fred.\n\nIt sucks to think that a more junior employee probably would have just gone along with Fred's stupid idea and lost their fingers.",
            "I know I shouldn't be laughing at somebody being maimed for life, but all I can really think is the age old \"TALK SHIT GET HIT MOTHERFUCKER\". Or maybe \"Play stupid games, win stupid prizes\".",
            "Wait, did he only lose the middle finger on each hand?",
            "Roy, eliminating competition. That man had a plan, he just didn’t have an opening, until one fateful day...",
            "[deleted]",
            "My grandfather worked in a company that used to sell road equipement. He were the a regional manager, and had worked in the same company almost his whole life, putting everything he had into making it a the best company it could be. The owner one day retired, and instead of putting a long time loyal employee in charge that knew how the company worked, he gave it to his fuckup son. 2 years later the company was bankrupt. It became to much for my grandfather, and he had a heart attack, barely surviving. No happy ending here. So yeah, i feel good for Roy, he deserved everything he got.\n\nEdit: TLDR: Granpa's boss retired, son took over company, company bankrupt, grandpa heart attack, go Roy.",
            "Vote Roy 2020.",
            "I was a machinist for over 30 years. If you meet an old machinist, check their hands. If they got all 10 fingers, what you have is an expert. They have developed shop practices that instinctively avoid doing anything stupid or risky, often behavior that is contrary to initial instinct. One second of distraction or carelessness on those machines can clip your hand off in the wink of eye. Over the years I've told a lot of kids they should go work at Burger King or something, because they're not cut out for shop work - usually involving doing something incredibly stupid. \nYou yell at them!\n\nAnd they go: What?\n\nAnd you tell them to stop doing that you bloody moron!\n\nAnd then later you see them doing it again. \n\nMost are lucky and don't get hurt. But a few were not so lucky...",
            "I ran out of sympathy for morons a long time ago. Part of this involved the recognition that *I'm* a moron, and I have to pay the price for my stupidity when I refuse to let better judgment, mine or that of others, lead the charge.\n\nOf course, little bumfucks like our dear Fred tend to blame their suffering on everyone around them. Failure isn't an option, so manufacture a reality where it wasn't your fault. Fuck Fred.",
            "what a moron\n\n\"I wont use this it will cut my hand off\"\n\n\"No its fine watch\"\n\n*gets hand cut off*",
            "Sounds like how Horrible Bosses movie was made (Colin Farrell being the druggie)",
            "Roy's our boy!",
            "Wow, I'm kind of surprised Roy stuck around after that. But it looks like it worked out for him in the end.",
            "Am a machinist, can confirm. You run a machine long enough you can hear when bearings are going out and how much longer you have left on it.",
            "I'm sorry Fred lost his fingers, but it was his own damned fault. He also got off easy, by the sound of it.     \nI hope he bought a clue with the experience. He certainly paid for it.",
            "Worked with an old man back in the day that had many crazy war stories. He took rounds in the radio on his back, shot children with explosives strapped to them, and other such crazy things. He was missing a couple fingers and after a while I asked him “well what happened to those fingers” he responded “Fucking snowblower” I could not stop laughing. ",
            "So Freddie got (de) fingered",
            "here's a fun \"dumbass owner's son\" story you could appreciate since you've some experience in metalworking:\n\nsheet metal shop, and per industry standard we typically stuck our dumbest and least reliable employee on the shear, simple job that keeps any idiot busy\n\nanyways, we were stuck with the owner's young-dumb-fulla cum 18 y/o son in the shop, and the only thing you need to make sure your shear guy does besides staying productive is to get help lifting full sheets onto the rollers\n\nbut owner's son was a S T R O N G B O Y E, and didn't need no help from no one, and after about a year of us constantly getting on his case about lifting sheets onto the rollers by himself, he lost his grip on a sheet of stainless steel one day that dropped down directly into his shins at a very acute angle, his shoes instantly spilled over with blood, and now he gets to spend the rest of his life walking funny because he's a moron",
            "Wow. \"Fred\", there, managed to be a bloody idiot in every possible sense.",
            "Rule one of mechanical safety. Treat anything containing a rapidly spinning object with care, or it will fuck you up. ",
            "I think we need to start a \"malicious compliance of the year\" award and this one gets the first award.",
            "Sounds like Freddy got fingered. ",
            ">he wasn't cut out for running the company\n\nI see what you did there.\n\n&#x200B;",
            "Fred's dad was a dick for putting everyone in this position to begin with.",
            "CNC Field service tech here: Is it bad at the end of the story i just wanna know what kind of machine it was? ",
            "Roy took him off the grid...",
            "[deleted]",
            "He really gave that job the finger, didn't he?",
            "Freddie got fingered then eh? ",
            "In a world of Fred's, be a Roy. ",
            "This shit needs to be titled \"The Legend of Roy\" or some shit instead ",
            "Let’s take a moment to pour one out for a little homie sittin’ in the back seat struggling to cut up nickel bags and waiting for his turn on the AUX cord. Your day is coming DJ ThreeFinger$5piece.",
            "Gotta hand it to Roy",
            "Sometimes malicious compliance = poetic justice.",
            "I like Roy.  I would buy Roy a beer.",
            "Roy's our boy.",
            "\"I picked up two middle fingers and gave them to a colleague to put into a freezer bag\"\n- this is the best 'giving the finger(s) to my boss' story I've read here.",
            "It amazes me how many roys get ignored, listen to guys who have been around a while, they seen shit you haven't. ",
            "Roy: \"Lemme hold *your* beer.\"",
            "There’s something satisfying about this story. But, I can’t put my finger on it. ",
            "He lost his... Middle fingers. Specifically his middle fingers? That sounds like the machine was sending him a specific message.",
            "As a CNC Machinist this makes me cringe. I don't think I could willingly let my Production manager lose his fingers so easily even if I didn't like the guy.",
            "Freddie got fingered. ",
            "So Freddy got fingered",
            "> I picked up two middle fingers\n\nlmao",
            "And now he can’t flip the bird to anyone else that disagrees with him. ",
            "I can't believe that subcontractor actually made that modification. That's a big no bueno.",
            "Hate when managment that has never used the machines assume they know better than the daily operators. We had a kid as a steel pressing plant I used to work for lost both of his arms up to the elbow because the manager thought the machine was supposed to be plugged in, in order for the mechanic (kid) to know exactly what was going on so he could fix it. Plugged it in while kid was elbow deep, press came down, rest is history. Kid was 23 and had just had a baby. I quit that day. Kid filed a suit and got the entire place shut down. ",
            "What a moron. If the guy who had been there for 30 years says something, you MAY want to listen... Especially if he says \"stand back\", you should probably run for cover. \n\nFred sounds like he was lucky to be alive. I've only worked with machines like that back in HS in shop, but damn lose clothing, hair, jewelry, etc, are things I'd never forget to remove. Especially after the safety videos in high school where we learned what \"degloving\" was. ",
            "Roy’s the man!!! I’d definitely buy him a round of beer! ",
            "Don’t toy with the Roy!",
            "this needs to be posted to r/ProRevenge",
            "Freddy got (de)fingered",
            "I imagine Roy as Sam Elliot. ",
            "Did he only lose the middle fingers, or all of them, then you happened to only find those?",
            "Instant karma is the best karma sometimes.",
            "How Freddy Got De-Fingered ",
            "Point of interest; you're not meant to put detached body parts into direct ice, or ice equivalent condictions, becasue it damages the tissue; you're meant to put it into cold water or something like that; don't actually do that until you look up what you're actually meant to put it into because i'm probably wrong about what you're meant to put them into, but it was something other then direct ice.",
            "Good for the Universe, and fuck that guy. Some people genuinely deserve to be miserable.",
            "Possibly the best MC of the sub. This is why health and safety work regulations are SO importants. ",
            "Holy shit, this is malicious as hell. And so satisfying. He probably deserved losing his fingers, maybe he'll rethink some things in the future",
            "Freddy got fingered",
            "...at least the right person suffered.",
            "Friend, this is late, but you’ve tagged this the wrong length. You put XL. It should be small or medium.",
            "Freddie got fingered",
            "What is with all the recent posts with spoilery title that spells out exactly how it ends? A simple title like 'how my boss learned never to doubt his foreman\" or something like that would have been much better, and makes one more interested/motivated to find out what happened.",
            "Is your boss's son Colin Farrell from Horrible Bosses?",
            "Oof, scuse me\n\nThanks for the clarification cuz the way you described (mixed handed) is how I am as well but always thought it was called ambidextrousness\n\nI hold a fork left handed but chopsticks right handed\n\nI shoot left handed but swing a bat and throw a ball right handed\n\nHmm",
            "So Fred got fingered...de-fingered rather",
            "Let me get this straight He wanted you to reach into a cnc machine, while a spindle is running? I take it the part was also secured down on a vice or chuck?",
            "Only better ending would be Roy holding up his hand missing 2 fingers and saying \"told you.\"",
            "At the very least, Fred learned a lesson there. ",
            "Let this be a lesson for anyone in a production environment, do NOT cross a grey beard. ",
            "This was eerily similar to one of the characters from Horrible Bosses",
            "DAMN!  a 2000 RPM spindle to the face would have taken this story to a whole 'nother level.  ",
            "Can you tell me what the machine name was?? Interested))",
            "I thought we were following the Horrible Bosses, script at first.",
            "I really like Roy\n\nIn fact, I like Roy so much I adopt Roy as my uncle",
            "Stub-Reddit.",
            "I'm going off of memory from a post quite a while ago, hopefully people will chime in with corrections. If this happens to someone near you: Wrap the fingers in a damp (soaked and wrung out) paper towel. Saline is best but water works as well. Place that bundle in a plastic bag and put the bag on ice. Never place the fingers directly into contact with ice.",
            "I had to wait and prepare my mind for reading the second to last paragraph where it all goes down, know what was to happen and how brutal it would be to imagine that happening. It looks like everyone got just what they wanted.",
            "So Like did he only lose his middle fingers or was that all you could manage to find? ",
            "This is like the exact beginning plot of Horrible Bosses",
            "Jesus Christ. Never fuck around with heavy machinery.",
            "machine operative\n\n...I find it outstanding that, what would be called an \"operator\" in the US is an \"operative\" in the UK. Makes him sound like some kind of spy or government agent. \n\nAlso, you should report the company anyway. The owner hired his dirtbag son who then tried to endanger employees and threatened those who protested. Such people deserve financial ass rapings at a  minimum. It could have been a young or new person who was afraid of losing their job and had their fingers torn of instead. ",
            "Feel kind of bad for Fred. Lost his fingers and his best gal in the same accident.",
            "Excellent, fuck that guy.  Got what he deserved.",
            "[removed]",
            "I feel like Roy had more of an obligation to say how dangerous that machine was.  At least by the way the situation was described here.   Letting someone maim themselves for life to prove a point is pretty savage. ",
            "[deleted]",
            "So is nobody going to say that Roy is a dick for knowing that fred would lose his fingers and not telling him that before letting him operate the machine? "
        ]
    },
    {
        "post_id": "q4nb2j",
        "author": "Waifer2016",
        "title": "Medical clerk made me stand outside in 104 degree heat so I staged a mini revolution.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/q4nb2j/medical_clerk_made_me_stand_outside_in_104_degree/",
        "score": 21357,
        "num_comments": 530,
        "created_utc": 1633792574.0,
        "selftext": "This took place during the first summer of lockdown where I live. \n\nSome context for you- My town is basically on the edge of nowhere. We have a medical centre for basic stuff but a full hospital is 30 - 40 minutes in any direction depending on where you chose to go.  With that in mind, we get people from a huge surrounding area that go to our town centre for tests , simple medical exams , etc. Maybe as many as 50 small communities use our centre on a daily basis so it is constantly busy. The centre itself is quite small compared to hospitals in the city. The various clinics and a basic ER take up most of the space with an area by the front doors for the public to sit in if they are waiting for a ride or someone visiting a doctor. It is that waiting area that is the cause for my story today.\n\nOne day during the first summer of lockdown here, I had to go to the medical centre for tests. Some things to know about me. I am challenged with multiple disabilities. I am legally blind, have significant mobility and balance issues and a rather severe heart condition. As such I use a walking frame and travel using the cities provided disabled transports.\n\nThat particular day, I had finished my tests early and had 45 minutes to wait until my transport was scheduled to return to pick me up. I figured - no problem, i will just sit in the waiting area and - well - wait! haha. I shuffled over to the seats with my walker plainly evident and was confronted by a new sign. STAFF ONLY.  Say what now? I looked around at all the empty seats and vacant tables and turned to the clerks at the entrance. \n\nMe- Can I please have a seat in the waiting area until my transport come back?\n\nClerk- (coldly) NO its staff only. YOU need to wait outside! \n\nMe- uh I cant stand for 45minutes waiting for my transport (gesturing to my plainly apparent walking frame that i was clearly leaning heavily on) \n\nClerk- Not my problem! There are benches to sit on outside . \n\nMe- The benches are full and we are supposed to be social distancing not cuddling up to random strangers on a park bench!\n\nClerk- If you want i suppose I could let you take a wheelchair out and sit in that. \n\nMe - And how am I to manage a wheelchair AND my walking frame at the same time?\n\nClerk - again , not my problem. If you want you can call centre management when you get home. Are we done here?\n\nMe - I guess we are done huh. And went outside to find a spot to wait.\n\nWell I stood outside for the 45 minutes while the sun beat down on what turned out to be 104 F day. As I stood there , I noticed that there was a line of patients growing steadily longer also standing outside in the heat waiting to be let into the building. Some looked fit but lets face it- nobody comes to a medical centre because they feel 100%! Most of them looked quite ill and some were looking pretty faint by the time they got through the doors. By the time my transport arrived, I was badly sunburned , thirsty as hell, exhausted and feeling more than a bit faint myself! My driver was shocked and insisted on walking me to my front door when he got me home to make sure I was ok. (shout out to all transport drivers you guys ROCK!)\n\nThe rest of the day was a complete loss. I spent it drinking water, sleeping and nursing the burns on my shoulders and face lol. I was a right mess! The next day, however, I was pissed. I had plenty of time to recover and to think and I kept coming back to that line of patients standing in the heat. The more I thought about it, the angrier i got!\n\nMalicious compliance.\n\nThe words the clerk so smugly said- you can call centre management when you get home if you want- danced through my sunbaked brain like a mantra. I called centre management. What followed was a half hour conversation with the SWEETEST lady . She was SO nice and so upset when I told her all that went on the day before. She was especially concerned when she found out about the line of people waiting outside one what turned out to the the hottest day we had that summer. After our talk, the manager promised to look into it and get back to me. Now normally that's sort of a brush off, right? Not so with this lady.\n\nTwo days later, she called me back. Turned out, she had spent the day before sitting at the clerks desk observing things that went on. Things like\n\n\\- Patients being forced to stand in the rain waiting to get into the centre\n\n\\- Patients being poorly spoken to by the same clerk.\n\n\\- And the cherry on top? At one point a tiny, elderly lady tried to sit down in the waiting area and the SAME clerk ran over and rudely shoved her aide and snapped STAFF ONLY!  With her boss sitting right there!\n\nThe Manager went over , tore down the signs, apologized to the lady and helped her to a seat then took the clerk into her office for a - chat. \n\nThe Results\n\nThe centre was immediately restructured.  Staff were moved into an unused gift shop , the waiting room as returned to the public and best of all? The registry desks were moved so patients no longer had to stand outside waiting to get into the building! \n\nI never saw that clerk there again. \n\nI know this isn't as exciting as most stories on here but knowing I was part of making things so much better for so many still makes me happy !\n\nDangit I am proud of my mini- coup Hahaha Vive La resistance and all that crap!\n\nEDIT to add- THANK YOU all for all the positive feedback and awards!  You really make this human feel loved. 😊",
        "permalink": "/r/MaliciousCompliance/comments/q4nb2j/medical_clerk_made_me_stand_outside_in_104_degree/",
        "comments": [
            "Great job! People get a little bit of power and their true colors come out! I'm so glad you feel better and followed up!",
            "Meh, it may not be as \"exciting\" or \"interesting\" as some of the stories here, but I bet you'd be hard pressed to find many stories that end with this much community good. It sounds like your actions have greatly benefitted many people who were in need, you should be very proud of yourself.",
            "A delivery driver was giving me a hard time at work the other day, yet I just make the orders in the order they show up on my order screen, then I bring it outside, call out the order number, and hope the driver pays attention to their app notifications (I press “done” on a tablet and it’s supposed to notify them to come to the door). \n\nSo this one guy is just constantly ringing our doorbell. He’s not new, he knows how we do things. I ignore him and eventually bring out my next order. He’s in my face. He’s telling me this and that, asking why it’s taking so long, when he can see how fucking packed my drive thru is, plus the other delivery drivers around him. So I just said, “I’m making them in the order they show up.” Then he pulls out a second phone, and tells me “I have another order, get that one next.” Now, the app/delivery service he works for does not allow their drivers to take more than one delivery on at a time, and he’s gotten a second phone to work around this rule. \n\nI don’t use DoorDash a lot because they have the multi-order feature for drivers, and I’d like to get my food delivered directly from the restaurant, so this place caters to people like me. So after I go get his second order, something that I’m normally too busy to deal with (reporting him to the app means I have to spend a bunch of time on the phone/at the computer when I’m needed elsewhere), the phone rings. \n\nIt’s the delivery service support. They seem flustered. They’re asking “where is order # 123? The driver says they’ve been waiting for a while.” \n\nI quickly recall, hey, that impatient guy with the two phones had order # 123. \n\n“So I just sent that order out, but the reason he was waiting so long is because he’s using two phones to take more than one order at a time, I know that’s against your policy, and he would’ve been able to leave for his delivery on the first order pretty quickly had he not stuck around for the 2nd one.” She immediately changed her tone from flustered to concerned and she assured me that they would address it. \n\nSo buddy decided to call support and talk shit, and got himself reported when I wouldn’t have had time otherwise. Way to go buddy.\n\nYour post just reminded me of that whole ordeal last night, where someone tries some bullshit when they’re clearly in the wrong and it backfires on them.",
            "My guess is that this began at a high level because of recommendations (or restrictions) coming down from federal health entities which stipulated patients may not congregate in waiting rooms. It was common throughout Arizona (even during the 110+ degree summer) for staff to apologetically let us know that federal guidelines mandated we must wait outside the office for our appointments.",
            "Well done you! Sometimes complaints are needed and this was clearly one.",
            "I had this not to long ago. Was pushed about from waiting area to waiting area since I wasn’t complaining about pain and just watching Netflix on my phone. One ER person told me that if I wasn’t serious I should just go home. I shrugged my shoulders and just stayed there.\n\nAround 2am I was seen by a overly exhausted ER doc who took one look at the gaping would I had in my side and loudly demanded to know why I kept getting pushed down the list. That same ER worker got a bit green looking at the red/black/yellow/green fluids that stained the insides of my uniform and just replied, “she wasn’t complaining”\n\nThe doc asked how much pain I was in and i again shrugged. I had had that pain for two weeks, I didn’t know how bad it was anymore. Then he poked my insides and I cried. Got me some morphine, a room, and surgery at 8am.",
            "Well done!",
            "Devils advocate, that clerk did not make the rules, and would be in trouble if they broke them, its shit management, but atleast they saw what their actions did and corrected it.",
            "I'm always amazed at how many people with a lack of even a minimal amount of empathy and compassion end up working healthcare jobs.",
            "Woah. Wait a minute... I'm sure the clerk did not make the call to make that room STAFF ONLY.  There has to be mitigating circumstances.",
            "Those people are the worst and don't belong in healthcare, I can sympathize! \n\nLast year I had a pregnancy scare (was not pregnant, just stupid bloodless period, see explanation below) and the planned parenthood clerk (OB for Obstructing Bitch) asked a lot of pointed questions about my intentions. When I told her I would definitely not be continuing a pregnancy *if tested positive* she cancelled my appointment *for the pregnancy test* and told me to contact a different PP location to arrange for testing, this same place would do termination procedures if test returned positive. Now, this was in the middle of covid so already I had waited two weeks for this appointment. The other location not only told me I'd have to wait another two weeks, but also, they told me straight up that what I was told by the OB was 100% wrong.\n\nSo I called Planned Parenthood headquarters. The lady I talked to was very upset about what I was told by the OB and arranged an appointment a few days later, no waiting two weeks for me. The person I talked to at this new appointment (same location the OB worked at) didn't ask ANY of the questions the OB did, nothing about what my intentions were, it was a completely different experience that aligned with what I had originally expected.\n \nMy guess was OB was some pro lifer who infiltrated PP with the intention of sabotage. It's the only explanation I can think of to explain her behavior and the extreme differences between these two visits. Those people are scum and I hope OB miscarriages and is refused adoption or foster because no child deserves to suffer her as a \"mother.\"\n\n__________________________________\n\nBC Explanation: for those wondering, I do take \"birth control\", but really all it does is control my menstruation by making my hormone levels fall within normal. My periods, without the medicine, is so extreme, that with birth control I have *normal* cycles, with only the occasional bloodless periods - girls with normal periods tend to have no bleeding at all or only the occasional spotting when on birth control. In fact, according to my doctor, with birth control I am more likely to get pregnant than without it, but without it well, it's a really awful painful experience. When I was a teen I'd cope by taking triple doses of Tylenol/Ibuprofen until I passed out. I'm surprised my liver still functions.\n\nI finally have money though that I can consider permanent procedures to completely remove my risk of pregnancy.",
            "We had to move everyone out of the waiting room because it wasn't negative pressure and was going to make sure everyone got sick with what was going on. No one was allowed in there and our hospital remodeled it and put in a new vent system. No idea why *they* did that though.",
            "My dad has severe heart problems, and cancer. I don't know what it is about hospital clerks. But, we've had the worst time with them. They never seem to care the least bit about the patients, or their jobs for that matter. A few months ago my dad almost missed a major procedure. Clerk just says I can't find it, and it's not my problem. The oncology team sent a nurse to find us. That's just one incident with a hospital clerk. I for the life of me can't figure the issue with clerks out.",
            "OP, are there different degrees of blindness that are called 'legally blind'?  You said were able to look around the waiting room and watch the people queuing. Is that partial blindness / blind in one eye / other? (I hope I am not prying too much.) I realise I know no-one who is blind and I've never really thought how far visual impairment can affect everyday activities.",
            "Sounds like you're a regular at the center, and with the insane costs of medical bills (assuming your in America) in conjunction with your efforts to ensure patient safety and comfort. It seems like they should put a little plaque up naming that seating section after you!",
            "When you saw someone that looked like they were about to faint from from the heat, you should have called emergency services.",
            "Man that’s some bull crap I work as security for a hospital in the south and they let patients well wait in the god damn waiting room. We however don’t let visitors in since covid but if there was a covid patient or they had issues they should have rented a temporary waiting room like a tent we have with ac and heat in it which we also have. I’m super surprised nobody has sued them for gross negligence. But what do I know I’m just a security officer anyways.",
            "A doctors office I used to go to had similar problems with their front desk staff. Examples are ignoring patients trying to check in. Ignoring the phone. Talking about patients in front of them (he's ugly, she's stupid, etc).  One of reasons I found another doctor. Last I heard the place is a ghost town since patients have options and one is not to use them.",
            "Way to go not only did you stand up for yourself after you were so horribly treated your actions meant that no one else would be treated the same way especially sick, disabled or elderly people. And the clerk got reprimanded for their actions, bet they weren't as smug after their boss appeared.",
            "People seem to think big hospitals are better than smaller ones. We have a Critical Access Hospital which is a special government designation for small hospitals. A bunch of rules, it’s government after all. They can only have 22 beds, no icu, 72 hour stay or be transferred to a bigger hospital. A bunch more. \n\nAnyway, people will come to our ER because you can get right in for treatment. If you need to be transferred to a bigger hospital you go by ambulance and get right into their ER because you are a transfer. The doctors in the ER are good, because if they aren’t they don’t stay long. The nursing staff cares because they know you or your family. \n\nYou seldom have to wait for lab or X-ray. Register, go to the department and get right in to have blood drawn, your X-ray or CT, etc. They would never make you wait outside. That’s just a lawsuit waiting to happen. People come from the city 30 miles away because the service is so much better. If it’s something the hospital isn’t capable of treating you are taken by ambulance or helicopter to larger hospitals. \n\nIf possible, you might want to look into small hospitals for routine stuff and if it’s not life threatening emergencies it might be faster to drive to a small hospital for treatment.",
            "There seemed to be a lot of power hungry little doormen in hospitals like that.",
            "I'm really glad you did this OP! \n\nBack in like may/June, I got really sick out of the blue so I try to go to the local doc. I'm puking every 30 minutes, I feel like shit, you get it. I go up, get checked in... And then have to wait in direct sunlight which is aggravating my condition and making my migraine even worse (migraine was a side effect of being sick here, not why I was sick to be clear)\n\nThen after about 30-45 waiting like that, standing in what tiny tiny shade I could find, I get to go in to a waiting room I then sit in for a full hour without even having anyone check in on me. I'm still horrendously sick, my body is still trying to reject anything that goes into it, even water, but I am essentially ignored for a full hour. \n\nSo I gather my shit and I leave, because I have no idea when I'm even going to see anyone, I hurt horrendously, it's been almost 2 hours and fuck this, if I'm gonna be miserable, I'm gonna be miserable.at home where I'm at a least comfortable.\n\nTurns out it was food poisoning and I'm just glad it wasn't anything serious like a stomach infection which can't be cleared without antibiotics and treatment because who knows when I would have gotten that.",
            "Most posts here are about making someone's life worse when they messed up, and let's be honest, that's why my petty ass is here, but I love that you made a positive difference for who knows how many people.",
            "Excellent!",
            "If you tell people \"Not my problem, complain to my boss if you want\", then don't be surprised if they actually DO complain to your boss, who MAKES it your problem.",
            "I'm not getting the malicious compliance angle.",
            ">I know this isn't as exciting as most stories on here\n\nI disagree!",
            "[deleted]",
            "Given you conditions I’d of sat down and said I’ll just wait here till someone with authority to move me comes which might be security but I suspect police might have to come to move you then just get up when they arrive",
            "You say this isn't as exciting as most stories? You got someone fired for doing a bad job and helped countless others in the process. I don't know about others but that's the fine blend of schadenfreude-by-proxy AND justice that I come to this sub for!",
            "Great story! Thank you for the read :). Please don't hesitate to post any other stories even if they aren't malicious compliance posts",
            "Good for you OP! Bullies come in many forms. Sorry you had to endure. However for outside they should have had tents and extra seating, minimum! This is what I've seen locally here. As for that staff person. Again the way to fix the system is to report these issues to Mgmt appropriately. We'll done on all fronts. Again, so sorry for your treatment.",
            "I think it is safe to say that you probably saved some lives there.\n\nStanding in this kind of heat for a prolonged period is not easy even for a healthy person.",
            "It bothers me when people like you act like those behind the counter make the rules. She's enforcing it and you took that personally. Why people expect normalcy during a pandemic makes no sense to me. But good job complaining",
            "I’m glad you cared and made a difference. People without compassion irritate me",
            "This sounds a lot like Montana",
            "You’re awesome. We need more compassion, respect and empathy in this world. Your actions lead to results. I applaud you ❤️",
            "Excellent story!",
            "OP this is extremely interesting! You did a wonderful thing which almost certainly saved lives. Well done indeed!!!",
            "i hope you're doing well!",
            "Credit to the woman for getting things done. You not only appealed to her humanity, you scared her half to death that there would be a lawsuit without even realizing it.",
            "The lockdown did one thing… give people in positions with no power or authority to treat people like shit.",
            "The first thing that went through my mind was, \"what would they do if you just sat there anyways?\"",
            "Bravo!!!",
            "Fuck yeah. You rule.",
            "I can not understand how someone can be so cold to others, just imagining her seemingly go out of her way to treat people badly and to say its not their problem while sending you out in 100 degree heat, its mental",
            "Are you kidding me? This is amazing! I bet they were nice. I bet if you had gone to the ER because it made you so sick! It makes me made that people get treated this way.",
            "I thought this was going to go in a different direction. You go outside and come up with the great idea to convince everyone outside in 104-degree weather to lay down and play ill, like you all got heat stroke.",
            "People should ABSOLUTELY be held accountable to the treatment of others, especially during these times. Glad you persisted and hopefully this person learned a lesson in leadership and caring from the heart. \n\nThanks for sharing.",
            "I honestly didn’t even think of how my doctors office handled patients who used a transport company to get to their appointments. They had us sit in our car, call in and talk to the nurse, they’d ask the questions they would already ask in the exam room that can be asked over the phone and then had you come to the door for the temp check. Normally, I  am in the waiting room for a minimum of 25 minutes past my appointment time (so sitting for 40 minutes minimum in the waiting room) before my doctor is finally able to see me. The three? I believe times i went for my script appointments I called in and one phone ring, a few questions and a temp later I was in a room. No idea if they cut down on the amount of appointments allotted daily to do that, or if I just got ungodly lucky for the first time in YEARS of being with my doctor to get in right away the few times I would’ve been waiting in my car.\n\nYeah, my point was I wonder how my doctors office handled transport patients during that time. And I’m glad OP was able to talk to a good human being who cared and had follow through, and the clerk wholeheartedly deserved what she had coming. Did she learn from her mistakes/realize she’s kinda evil? Probably not, she wasn’t even concerned with how she behaved to patients in front of (what I’m assuming) the corporate boss.",
            "Positive vibes your way well done",
            "I hope this really happened because I love it so much, as someone who has felt generally dismissed and neglected by the staff at my doctor's office for years it's good to hear of one of these people who shouldn't be in healthcare in the first place getting what was coming to them.",
            "We need to applaud justice! The world needs more people like you, and more people like them. Thank yiu for this story.",
            "Thank you, you made me laugh 😅",
            "I hope they fired that clerk",
            "I’m in a well populated area with plenty hospitals. They all make us wait out in the parking lot and they will call us on the cell phones. That being said I have found that is much better to ask forgiveness than to ask permission. If I had your issues they would had to call the police to move me. Good luck next time",
            "You managed to use your malicious complainance to do good for more than just yourself but for other too. Good for you",
            "AAAAH this story made my morning! I absolutely love how you articulate.  Anyway the important thing is you are loved and you effected change for many for the better. You were the voice of reason and she did say to call the number. “Okie dokie, you wanna be done here I guess I gotta make a call. Ciao!” r/byebyejob",
            "As a fellow disabled person, I love this! Your malicious compliance is snarky and helps tons of folks, that's the best kind.",
            "Oh my gods. Fûck that heifer for treating you like that. They may have to follow the rules given but they didn’t have to act like such a dick about it b",
            "I really feel for your predicament, but being blunt you sound like someone who would be high risk if they caught Covid. Maybe even die. These measures were put in place to mitigate that risk. Obviously 104 degrees is also a risk and waiting in that also sounds pretty horrible. They should have set up some tents with water imo. But there's really no good solution except get more space...",
            "Wow - how impressive.  Thank you.  So many people benefit from your terrible experience.  It’s hard to believe they responded to you and changed the system.  Like you said can’t expect a call back but good for that caring lady.  Take care and great job!",
            "I thought for sure the revolution was that you were going to drop a hint to the lined-up people about all the empty staff-only seats inside 😂",
            "Thank you so much for doing this. So many people, especially those in pain or exhausted from dealing with chronic conditions and medical bureaucracy or incompetence, just don't have the energy or skillset to advocate for themselves. You may have prevented many vulnerable people from being seriously harmed, especially if that clerk was already bold enough to lay hands on people with visible disabilities!\n\nI know people were afraid and we didn't fully understand how the virus spread last summer. But there is a big difference between taking necessary precautions and making the situation worse.",
            "I don't see any MC here. Perhaps one of the revenge subs would be more appropriate?\n\nNonetheless, good for you! You were the change you want, or however the saying goes. You have made life a little better for a lot of people.",
            "I think this is incredibly exciting! With one phone call and a day or two of observation, you and the amazing lady from management changed, and probably saved, so many lives. You may want to consider cross-posting this on r/disability ?",
            "Goddamn do I love a decisive episode of competency",
            "You are awesome. Not even malicious compliance… just doing the right thing and finding another person in charge who also was intent on doing the right thing. Awesome.",
            "I hope this clerk was fired and not just transferred.",
            "I also work in a hospital and we have a similar policy. I usually enforce the policy but turn a blind eye to it in certain circumstances, such as yours.",
            ">Dangit I am proud of my mini- coup\n\nDang if I ain't proud of you my own self. \n\n*(I am, in case you were wondering.)*",
            "A gift shop at a medical center? What on earth?",
            "The Manager must have fired that bully, a.k.a. The Clerk, as soon as the office door closed 😁  It's terrific that she immediately took decisive, no-nonsense action to put things right.\n\nAnd you, O.P., thank you 😊",
            "Congrats. You potentially saved people lives by helping make this change happen.",
            "No, this is definitely exciting. I’ve had a fair share of terrible doctors, nurses, and hospital staff before and  in the rare times I complain, nothing happens. Good job OP for standing up for yourself (no pun intended)",
            "I have no way to prove it, but my guess is that same medical clerk would have been fired for refusing to take the mandatory, FREE covid vaccine.",
            "thanks for the fun story, I'm glad you succeeded in your mission 😊",
            "”Legally blind”\n\n\n”I never saw that clerk there again”\n\n🤨",
            "Glad you stood up for yourself and for others. That evil clerk had better repent of her actions! Karma is a bitch!",
            "Just think of all the people you helped with your one man revolution!  Good job!",
            "'ring management'\n\n'no not like that'",
            "I would’ve sat there and not moved. Want me out? Too bad.",
            "My medical provider owns the building they operate out of, but one floor is scripps health.\n\nThere is a scrips health bitch who does exactly what you are talking about.\n\nI had not thought about calling in, but you've convinced me. Life is too short to put up with lobby dictators.",
            "Thank you for helping all thise people now and in the future. Speaking up needs to hapoen for the grwtaert good sometimes.",
            "No one (ok, most people don’t ) wants to be the one to complain. But sometimes it’s so egregious, you have no choice.",
            "Well done!",
            "Well done! Only thing that would have been better is if you called for a manager right then and there.  But the end result is that you saved a lot of pain from other people, so, well done!",
            "I work in hospital Emergency Department. We made so many mistakes during the early days of the pandemic, mostly due to fear and confusion coming down from management and administration. To me, your story is not a revolution as much as it is a story of management listening to its patients and reacting to quickly resolve the problem. I’m not often sympathetic to administration, as most are MBAs with very little if any clinical experience. There’s not a day that goes by when I’m not rolling my eyes at some pencil pusher’s decision. I’m glad you made your experience known, I’m glad the surly staff were fired, there’s absolutely no room for that, especially to patients who are likely experiencing one of the worst days of their lives. And I’m glad the manager took the time to observe the problem directly and to facilitate solutions that improve the experience.",
            "MC that literally helps others is always the best MC.",
            "Why tf did staff need the waiting area for themselves??? What are they waiting in large numbers for????",
            "This is the kind of thing you want to hear.",
            "Great job! We need more people like you. And the lady you spoke to",
            "Huzzah! Take this as my poor man's award. 👑",
            "My pvt drs office knows their transport patients and while I've only been in her office 3 time since C-19 started, she and her amazing staff allow me to sit in out of the weather. These days they try to  do all apps over phone or video chat so in person is rare .",
            "Good Job!",
            "I feel like the villain here is whoever decided to set up the staff signs, not just the clerk.",
            "aw ! damn that is pure compliance ! and im glad to hear that you obtained real change ! !",
            "You are my hero!",
            "I really like your story! Thank you! 🤗",
            "Why would there be a gift shop in a medical centre?",
            "You made a difference.  Thank you.",
            "My good person you are a hero and others won’t even realize it 🤗",
            "Well done ❤️ If I had an award to give you, I would.  You are a star!",
            "It makes me extremely happy that there are people out there that truly care. I've called hospital HR on my brothers girl (long story as to how and why they're magically together) since she kept coming over to my house, while my mother had covid, with no protection. She works as a CNA and it appalled me how often she would come over, no mask no nothing, while my mom was sick and wearing a mask in fear of her patients. Sadly I believe she still works there.",
            "When you said that you’re “proud of your Mini-coup” I went back & reread your post 2 times looking for any mention of your vehicle… sitting here thinking “when the hell did he mention his car?”\n\n…took me a solid 5 minutes to realize you’re referring to your *miniature coup d’état* 🤦🏻‍♂️\n\nLove the story, though. You’ve likely made positive change that will improve dozens or hundreds of other patents’s experience at this location. Bravo 👏🏻",
            "Heartless people shouldn't be allowed in service industries.  \nYou did good work.",
            "You performed a great service to the community & hopefully this became a teachable moment for the clerk so she can become a better human being.",
            "I'm gonna get called names, but it's a doctors office.  That doesnt mean it has some special requirements to allow you to break their rules.  They are a business and their responsibility to you ends outside of the service they provided for you.  If you cant stand in 104 degree heat, it's up to you to arrange adequate transportation on a 104 degree day.  They are not obligated to allow you to hang around during a global pandemic.  They may want to decide to treat their customers better but they are in no way obligated to put their staff at risk because your ride isnt here yet.",
            "Clerk probably didn't want people possibly infecting the area with covid, as we cheer on op we should possibly remember this was a stressed out Frontline worker at a medical center during covid. They were rude and apparently in the wrong if their boss got mad at them, but I can understand their side here...",
            "You brought about a significant improvement for many vulnerable patients. This was no small victory amigo! You did good!",
            "I see this as a big win. It's really nice that someone cared enough to fix this horrible situation :)",
            "Disabled and sick people can spread COVID just as easily, if not easier, than anyone else. It literally wasn't her problem, Karen.",
            "From one disabled person to another, I weakly salute you. Thank you for having the guts that I often lack.",
            "I'd say that person needed to be fired, but that wouldn't teach her anything, and what she needs is education. What a horror!\n\nMy story is an inconvenience compared to yours, but what is it about people that these situations are created in the first place?\n\nI had colon cancer about a dozen years ago. The day after they discovered that I had it, they went right in and snipped it out. (This led my nephew to refer to me from then on as The Semicolon.)\n\nWell, that wasn't bad at all! They sent me home a day or two later and I convalesced. \n\nThen came chemo.\n\nImagine you've got one of those \"shotgun houses\" -- constructed in such a way that if you shoot a shotgun in the front window, there are openings such that some of the shot hits the back wall.\n\nWell, this chemo is like that. They've cut out all the tissue that they think has cancer cells, but just to be sure, they're going to shoot a chemo shotgun into my body over and over and over, expecting that if there are any little cancer cockroaches crawling around the house, sooner or later they'll all be killed by the huge amount of shot.\n\nEvery two weeks I got an infusion of chemo, which took about six hours and totally drained me of energy. I then would make my way over to the waiting area, where my wife would pick me up. She was anywhere from zero to fifteen minutes from the waiting area.\n\nThe waiting area? The outside waiting area. (Or the inside area, where I might miss my ride.) Well, the weather was not horrid, but still, I was tired. There were no chairs of any sort outside the exit. But wait -- there was a nearby area enclosed by a short fence, just perfectly placed so I could see my ride arrive.\n\nThe sign on the gate said SMOKING AREA. Again, this was a dozen years ago. There was always someone in there.\n\nAfter the third or fourth time of being discharged and finding I had to wander around on shaky legs, waiting for my ride, I made up my mind to go home and write a letter, tearing them a new one for making me toddle around while so wiped out.\n\nAfter I wrote the letter, I thought better of it and wrote a letter designed to elicit sympathy while pointing out the stupidity of the situation.\n\nThings never changed.\n\nBut six months later I had to go back there for a checkup, and I was greeted outside the hospital entrance by several rows of chairs, some placed in the shade, some in the sun, right where they were needed.\n\nIt was a good feeling, and I hadn't had to blow up.",
            "For those who can't see it...\n\nThe malicious compliance is as follows: The clerk said \"If you want you can call center management when you get home.\"\n\nOP does so and an investigation was opened resulting in the firing of the clerk.",
            "Great story of justice! That clerk is a literal scum. Good that she got what she deserved. Kudos to the manager as well.",
            "You did so much good. It's a perfect story for here. You are a champion, for all of the patients.",
            "This is the type of management that keeps businesses from going under.",
            "I had to pause when I read “first summer of lockdown”. I still can’t believe it’s been this long. Carry on with justice, OP!",
            "This is what MC’s are all about the ability to make the world better by hitting idiots with whopping karma bombs well done",
            "That is so great to read! Good on you for taking the time and patience to complain about the poor treatment that clerk was giving. I always advised patients and visitors to call and complain if they were mistreated. It is the only way things will change. The staff can complain but we are always ignored. I am so glad you did your mini revolution for that centre.",
            "Sometimes you can't ignore a justice boner.  Well done.",
            "That’s what I don’t get. It doesn’t take anything to be nice. Not a thing. Kind words, gesture, accommodation it’s just plain free. Sometimes not doing anything is a positive/nice thing. BUT being mean, disrespectful and obnoxious takes a lot. You need to make an effort to do that. I just don’t get it. Like man you want to sit here, have a cup of water? Sure thing. Doesn’t bother me, takes no time at all, is a right thing to do and it helps you out. Being mean and difficult that just extra work. It’s exhausting. People like that receptionist don’t have happy heart.",
            "Excellent!  Also, are you doing ok now?",
            "Thank you for taking action and calling the manager here. Too many people just let stuff like this go because they don't to bother or make trouble.",
            "seems in character for highschool students",
            "You're the hero your town needed",
            "As someone also with multiple disabilities who surely would have fainted in this scenario, thank you and well done you for standing up and making a change! I bet that woman had never had to live with a physical disability and had no idea the impact of something as simple as standing outside, but thanks to you that no longer mattered and something was done!",
            "Remind me never to live in Afghanistan",
            "Took me a long time.",
            "This is awesome.\n\n\nOne trick in situations like that is to ignore someone like the clerk and just sit down anyways.  I know it's a hard line to cross, but once you do, it almost feels like magic.  My rule is if I don't feel it is unreasonable to do so, ignore the rules if it suits me.  Life becomes so much easier, and nobody is harmed in the process.",
            "Not exciting my ass! This was amazingly satisfying  since I have a keen interest in the topic. Well done OP.",
            "The registry desk should have been moved outside, along with the clerk. Check the patients in, then the patients get to go inside. The clerk has to stay outside.",
            "Sometimes rules exist for a reason,  but kindness and empathy should be more important",
            "You’re a great writer… I was fully invested the whole time. Good payoff at the end, too. Well done!",
            "Funny when the \"Karens\" are the service workers and tell You to go seek higher authority, then get roasted when you do",
            "You are a hero",
            "YES!  GOOD JOB!  THIS is why we are supposed to say \"this is a problem\".  This is why workers are supposed to go to their superiors and explain what they see on the front lines so that problems can be fixed.  \n\n&#x200B;\n\nThere have been so many times where I start a new job and notice a MAJOR issue that could be fixed easily, but when brought up to my coworkers they say things like \"Oh, the manager knows this is a problem because it has always been a problem, so I don't bother telling them it's a problem\".  Then when I bring it up with the manager, they are SHOCKED that this is a problem, because they have never ever done this exact job in these circumstances, and are overjoyed that they can make customers' and workers' lives easier.  Most managers aren't purposefully cruel with their operation requirements-many of them have simply never worked a job that wasn't a management job.   (I was also shocked when I learned that most managers these days don't go \"through the ranks\", they are hired AS MANAGERS for their first jobs out of business school)",
            "Christ who in their right mind basically puts staff only in a waiting area that isn't remotely used by the staff.",
            "Pretty neat story!\n\nMy only gripe is: having management do a shakedown of the whole institution isn't much of a \"revolution\", no matter how small.\n\nNonetheless, that lady was heartless. Glad you managed to help things get better.",
            "Management called you back two days later to complain to you about what their staff had done in the meanwhile?",
            "Hallelujah! Great job!",
            "I'm glad you made the experience so much better for everyone, especially before anyone got hurt by fainting or overheating",
            "The really wonderful thing is how you used your awful experience to fix a horrible system and make things so much better for everyone who must use that facility.",
            "Kudos for your patience, that place seemed like a hell hole. You did the right thing!",
            "❤️❤️❤️❤️",
            "I love this sub for those satisfaction stories, mostly of incompetence learning hard lessons, but this story is especially poignant. Making real and fast changes with lasting benefit.I realize you were just angry, but its rad to see actual results with far reaching positive change.  High-five!",
            "ITT: people who work in healthcare and understand this isn't the full story, and then everyone else.",
            "Seeems like the clerk got shafted. I can only understand how terrible it is to have a boss who orders u to do certain things (staff only) and have like you said a ton of people visit the center for care and most likely attempt to break the rules like you did despite there being clear signage. \n\nAs the staff she has to uphold the rules and i can only imagine how exasperating it must be having to explain it over and over again. \n\nI dont think shes right to use violence against anyone but I'm glad shes gone and hope she has a better job now because that work environment sure is toxic. Especially when the boss sees everyone stuck outside in the sun and instead of fixing the problem and helping her team immediately is simply hovering over said staff and trying to find fault with them",
            "Everybody be hating on the clerk.    But she was only doing what manglement had set as policy and perhaps even got upbraided by medical staff for not enforcing that policy.",
            "OP sounds like a raging Karen to be honest. Deciding that you don't need to follow the rules at a hospital clinic at the height of a pandemic where workers are trying to keep people from mingling inside because of said pandemic.\n\nThe worker even offered her a wheelchair to use to defuse the situation.\n\nAnd people in here cheering for the firing of the poor worker.",
            "[removed]",
            "This is a gratifying read.\n\n<insert meme: Tell Cercei I want her to know it was me>",
            "You're a rock star!",
            "Well done!",
            "Well done and that Manager is a boss I'd be happy to work with, because I like to work with people who give a shit.",
            "This IS an exciting story!\n\nSo gratifying.  And thank you for sharing.\n\nEdit: who frikkin **Downvoted** me for this sincere comment?!\n\nI can take Downvotes but some people will Burn In Hell.  \n\n😀  Lookin at you.  😂",
            "Viva le Revolution!",
            "Love this! Thanks for fighting the good fight.",
            "I'm really delighted to read your story, thanks. \n\nGood on you for actually ringing, and I'm so glad you got onto someone who would actually change the situation. I hope the sadistic bastard who sent you out was permanently demoted to garbage duty.",
            "This clerk should definitely not be near the medical field",
            "staff only and no staff in sight?  i'm confused as to what purpose it was serving.  that just sounds like a failure on their part.",
            "Well good on ya friend! Some of the highest mountains are only inches tall.\nLooks like you climbed a talk one!",
            "Blocking this wall of nonsense subreddit",
            "and now there is a minimum wage clerk  grumbling somewhere about how some ' ungrateful gimp'  got her fired for no reason..\n\nPerhaps some guerilla theater..organize the waiting line outside into a die-in, get arranged and call the EMS and Police 'we're dying here!!!",
            "Nothing that happens in the USA makes any sense until you ask: \"did *race* have anything to do with this?\"",
            "They don’t stand for Washington?? 🧐🧐😭😭",
            "Yeah ill take shit that didn't happen for $100",
            "The world must centre on you, I see..",
            "[removed]",
            "u/Waifer2016, you are a hero!",
            "i think that's just his stand ability"
        ]
    }
]