[
    {
        "post_id": "skeozn",
        "author": "Economy-Grapefruit32",
        "title": "Want to sign an accident statement? Be my guest",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/skeozn/want_to_sign_an_accident_statement_be_my_guest/",
        "score": 21123,
        "num_comments": 852,
        "created_utc": 1643985211.0,
        "selftext": "This happened some months after I got my drivers license. I (at the time 19f) was driving through an 8 lane roundabout when a car struck me.\n\nThis is a horrible roundabout with lots of traffic, very fast and there are no lines on the ground to see who crossed who. \n\nAnyway, I get out to see the damage and the guy driving the other car comes out screaming at me, cursing and yelling that I am a „stupid girl“. It’s my first accident and I‘m scared and almost want to cry from the shock of the accident, but my little cousin is in the car and I don’t want to scare her.\n\n\nAs I‘m walking around trying to take pictures of the car, the guy keeps yelling at me that it is my fault. He threatens to call the police and „have me arrested“ because I am a „danger“. He says how he will tell them that he was „going straight“ and I was turning!! He keeps repeating it until I realise what he is saying: driving straight… on a roundabout?\n\n\nCue malicious compliance: \nI tell him not to worry with the police, he is completely right, he was just going straight and it was me who was going around. Lets sign an accident statement!\n\nHe is inmediatly on board, writes it and signs!\n\nLater at the insurance office they told me they don‘t normally have such easy cases. My damages were paid in full and they even gave me a replacement car while mine was getting repaired! Such a stupid girl!\n\n\nEDIT: Hi guys! Thanks for the comments and awards! I thought I could explain a few things that keep coming up in the comments:\n\n-He didn’t go straight through the middle on the roundabout, he sort of went tangent to the inner circle, if that makes sense, the shortest route crossing all lanes, which could have ended much worse (came in straight to the inner lane and then  tried to leave straight out) I know it’s hard to imagine if you’ve never seen a 6-8 lane roundabout.\n\n-No, I’m not going to post the sketch. Sorry, guys, I think the comment section would turn into a traffic debate about who was at fault, etc. \n\n-It is not in Paris",
        "permalink": "/r/MaliciousCompliance/comments/skeozn/want_to_sign_an_accident_statement_be_my_guest/",
        "comments": [
            "About 18 years ago my wife was hit by a guy driving a catering truck.  She just wanted to exchange info and go, but he insisted on bringing the police in to file a report (which I'm in favor of, just to avoid dealing with \"he said, she said\" with the insurance company).\n\nNot only was he determined to be at fault, he also ended up leaving the scene in handcuffs thanks to an outstanding warrant.",
            "Been an insurance adjuster for 8 years and I’ve never been so lucky as to get a signed confession from someone",
            "Hahahahaha oh my god I love this. Idiot didn't even realize he was straight admitting guilt right there. How can you \"go straight\" in a roundabout????? Lol. Very glad you got your damages paid in full 💪🏻",
            "My god I would've loved to have been there when he got told by his insurance that it was his fault.",
            "Never interrupt an enemy when they see making a mistake, good on you for making the most from that situation.",
            "You played the \"stupid girl\" card he gave you to perfection.",
            "Where tf is there an 8 lane roundabout? I think the most I’ve seen is 4\n\nEdit: Alright, since everyone mentioned it, I looked at the Arc de Triomphe, and it does appear to have a very large roundabout, but I see no evidence of any kind of road markings resembling a lane or even a road marking at all, so are y’all just pulling a dukes move or something cause I’m more terrified of that lol",
            "[deleted]",
            "My wife was in an accident once. I wasn't there, but the way she described it she was turning left on a green arrow, and a car from the opposing direction was making a right turn on red (legal, if traffic is clear) onto the same street and direction my wife was turning onto. Apparently, neither saw the other, and boom.\n\nNow, my wife says the driver was probably in his early 20's. My wife had started taking photos of both cars when the other driver said he didn't have time to exchange information like drivers licenses or insurance, and that he was in a hurry to get to work, so he asked for her phone number, sent her a text, and said \"Ok, you have my phone number. We'll talk later.\" He got back into his car and took off. My wife came home and told me what happened. While we were talking, she got a call from the number the driver had given her. I heard some yelling on the other end so I asked my wife to hand the phone to me.\n\nFirst thing, my wife said this didn't sound like the same guy. I admit, this guy sounded more like he was in his mid 50's. He gave me a name and license number, but refused to give me his insurance info because he insisted it was my wife's fault. He then went on a tirade about how dangerous my wife was behind the wheel, and that she should have her license revoked for life, and even go to jail for causing this accident. I listened patiently, and then said \"You were making a right on red?\" He said yes. I said \"My wife was making a left on a green arrow. It's automatically your fault.\" He began to resume his tirade about my wife's \"dangerous driving\", but I interrupted him and said \"When this goes to court, is my wife going to identify you as the man who was driving the other car? Will the witnesses whom she collected information from also identify you?\" Now, my wife didn't actually have witnesses, but knowing the driver left immediately he would have no way of knowing whether people stepped forward after he left. The man paused for a moment and said \"Are you saying I'm lying?\" I said \"My wife says you sound much older than the person who was driving the car. I'm suspecting it was your son rather than you. I'm also suspecting he doesn't have a license, which is why he wouldn't exchange information at the scene. You're hoping to make us believe it was you rather than your son because you have a license and insurance.\" He shouted \"YOUR WIFE SHOULD BE IN JAIL!\", to which I responded \"AND YOU LEFT THE SCENE OF AN ACCIDENT! THAT'S CALLED HIT AND RUN!\"\n\nDead silence for about 10 seconds, and then he hung up.\n\nWe gave what information we had to our insurance company. They figured out who it was from the license plate number (fortunately, my wife got a photo of it), as well as the phone number she received. She had comprehensive insurance, which covered her repairs except for a deductible. That deductible was later refunded when we learned the other driver was not insured, and my wife's uninsured motorist coverage kicked in. The guy who called us was, indeed, the driver's father.",
            "When I was 17 I was driving on a state highway in my little two door POS.\n\nOn a county road that crosses the highway, not an intersection but rather where that road had stop signs, a big pickup truck heading to cross the highway pulled up to their stop sign as I was coming up toward that spot on the highway. They paused at the stop sign for not even a moment, then went to cross the highway without any hesitation. I stepped on the brakes and swerved to miss them, but I clipped the back corner of the truck. My tiny little car mostly went under the truck’s rear end like a wedge, and my bumper didn’t even hit anything. Their giant steel bumper stabbed into my hood and destroyed my engine while crumpling my windshield. My airbag didn’t go off, but I was wearing my seatbelt and was fine.\n\nThe impact spun me around to where my car was pointed away from the truck. You couldn’t see any damage to my car from the back, but it was totaled. The truck pulled on to the county road on the other side of the highway and stopped. I ran over to them to see if they were ok, and I found an old ass man looking at a small dent on the corner panel above the steel rear bumper of his 3500 farm truck. He immediately says to me “Sorry I didn’t see you coming there, the damage doesn’t look too bad, do you want to just forget about it and not worry about insurance?” I told him “I can’t” and called the police.\n\nA state trooper was there within a minute or two and talked to us separately, starting with the old man. The cop told me the old man said his wheels were spinning on gravel strewn across the road and he couldn’t get across fast enough. I said “you think he had trouble with a little gravel in *that* vehicle?” and the cop just laughed. So I told the cop what the old man said right after the accident, that he didn’t see me coming and asked if I wanted to just forget about the accident because he hadn’t seen the damage to my vehicle. Then I got to watch from across the road as the old man threw a fit to the officer, shouted some nonsense at me, and finally got in his truck and stormed off.\n\nThe cop gave me a ride home, the old man’s insurance paid me $1,000 more for my car than I was expecting, and within a week I had a nicer car, a new video game, and a big bag of weed.",
            "Fucking. Legend.",
            "I thought he was gaslighting you (as many adults get in accidents with younger folk and try to shift blame) but wow, he was just that stupid.",
            "Good lord. An eight-lane roundabout? I don't really get confused in roundabouts, but the biggest I've ever been in was two-lanes. I don't understand how you'd be able to navigate an eight-lane circle.",
            "Reminds me of the guy who cut into my lane and came to a complete halt on an open freeway for who the fuck knows why. I slammed on the brakes but still hit him at low speed. He gets out raving “I have a backup camera! I will sue!” My insurance said he later filed for medical injury claims, despite the fact that neither of our bumpers were even dented. I told my insurance company that the guy said he had a camera, can we use that? They said “we can’t get it unless he uses it”. So he did. No points on my license, his insurance paid damages to my car.",
            "I was lucky in my accident. The guy who hit me from behind ran up to me after it happened and said it was all his fault. When the cop came to take statements, he was first in line to say the same thing.",
            "Ahh, this was excellent! He got hoisted by his own petard.",
            "I was driving towards an exit and a truck slammed into the driver's side/back of my car coming from a side street/exit off the roadway. We both stopped and he came at me screaming,  then screaming to 911 and subsequently to his friend about how fast I was going and I remember being so anxious from the crash and all I kept mumbling to myself was \"but I had the right of way\". Officer arrives and the other driver goes right to the cop gesticulating and talking loudly about what happened and when he was done the cop said: \"SHE HAD THE RIGHT OF WAY\"\nHe even said it was irrelevant how fast I was going (which I knew I wasnt; the exit was only about 20 feet away and I was slowing down,as it was a regular exit point for me so i had a habit of coasting to it. In fact, when he hit me because I didn't have my foot on the gas pedal or brake I panicked and hit the gas then brake as I tried to process what had happened).\nI regret not suing him but I didn't have to pay for the repairs at least.",
            "Lol he probably forgot that the person entering is supposed to yield to the people already inside",
            "There's a certain group on reddit that would argue its legal to drive a tank into the Whitehouse, and blame the whitehouse for not moving. Lol\n\nTraffic discussions are insane here.",
            "If you're not in a no fault state, get hit by someone (their fault) and you have a dash cam, let them go on and on to the officer spinning their side of the story with lie upon lie upon lie.  Don't interrupt, let them go as ridiculous as they want to.\n\nThen, once the officer turns to you and asks you for your statement, just ask the officer what the best way is to get the dashcam footage to the police.  Enjoy the horrified look on the other driver's face as they realize they are doomed.",
            "This sounds like something a dashcam would slam dunk",
            "I'm reading the comments about people staying by an accident that they witnessed.  I do that too!  While waiting for police, I give the person who was clearly NOT at fault my card and tell them I saw the whole thing.  As I leave I try to get a word with the person causing the accident say something to the effect of \"Don't try to lie about this and try to get out of your responsibility for this.  I saw the whole thing, and I'm reporting it to both of your insurance companies.\"  \n\nI've been wrecked before and hauled away in an ambulance before I could give my statement to anyone.  My car was totaled making a left turn on a 2 way road.  I was stopped and began my turn, and the guy hit me FROM THE REAR and left side of my car.  He wasn't paying attention and swerved left to avoid me as I started turning.  Clearly his fault, but my insurance didn't care, they just took the police report and ran with it.  The fucker who hit me lied and said I turned into him.  I tried and tried to get the police report to reflect what actually happened, and tried to get my insurance to listen, but no.  They suck.  My insurance had to pay for both cars.\n\nFor anyone wondering, Safeco.\n\nAfter that, I had a bit of hail damage, got some people out to get estimates and whatnot, and they Safeco had to pay $48,000 to replace my roof, siding, shed roof and siding as well, and some of the soffit and gutters.  Made my day.  \n\nThe car accident cost me about $5000 with my deductible, what the insurance gave me to replace the car, medical expenses (physical therapy) and the cost of another 5 year loan.  My car had 20k miles on it.  I'm still upset.",
            "Smart girl.",
            "> roundabout with lots of traffic, very fast and there are **no lines on the ground** to see who crossed who.\n\nWait. Maybe I'm missing something since I just take public transport and my city doesn't have these but who the fuck thought it was a good idea to have 8 lanes worth of road WITHOUT any painted lines on the road? What the fuck is this, a parking lot? \n\nThis is entirely the cities fault.",
            "I had a similar experience with an old lady. She hit me and told the cops and her insurance agent it was my fault and was talking all kinds of trash.  Her story didn't even make sense. I would've had to break the laws of physics for it to happen like she said. Her insurance company sided with her, of course. After going to arbitration she wound up paying for all the damage to my vehicle and didn't get anything for hers.",
            "r/confidentlyincorrect",
            "Nice job! This made my morning :)",
            "Had a lady t-bone me. She had no idea she went through a light. Didn’t know what town she was in. Nothing. She tried to tell the officer I hit her, as her car was smashed into my driver’s side. People are bizarre.",
            "Love how the insurance was like wow, never had someone admit they were wrong before! Here’s everything paid in full!!",
            "You don't need to draw a diagram. You've described this better than most people describe things on Reddit.",
            "Daaaamn, I wish I'd had the presence of mind to pull something like that at 19.",
            "A guy turned in to me. He pulled over and asked if we were hurt. He said let's pullover in this parking lot. I got a funny feeling and snapped a couple of pictures of the license plate on his car, and of him. He proceeded to leave the scene. Cops came , I gave them the pictures.  It was reported stolen by the owner UNTIL they found out we had pictures.  Then all of a sudden it was oh I didn't know my brother had borrowed the car. Their insurance paid.",
            "To be fair, when you're entering a roundabout you can be going straight. Obviously, you follow the correct path around the roundabout, then take your exit.\nMy point is, turning right, going straight, turning left, are all valid actions upon entering a 4 exit roundabout.",
            "...what went through my mind...about going straight in a roundabout:\n\n​ [https://c.tenor.com/GLRaFTDEqngAAAAd/roundabout-poland.gif](https://c.tenor.com/GLRaFTDEqngAAAAd/roundabout-poland.gif)",
            "8...lane... ROUNDABOUT???\n\nfuck me sideways, Im already sweating when getting into a 2 lane one",
            "> I was driving through an 8 lane roundabout...\n\nHey look kids, there's Big Ben, and there's Parliament!",
            "What ungodly abomination is an 8 lane roundabout supposed to be? This shouldn't exist",
            "It’s downtown Philly!  That roundabout is a bitch.",
            "You kept your composure, kept your wits, recognized opportunity in the midst of chaos, de-escalated the situation and got the other guy to think that confessing was his idea.\n\nWill you be my boss someday?",
            "Really he should have said “clever girl”. One day he’ll understand… maybe",
            "HATE people who cut the lanes like this it absolutely drives me nuts and often puts my kids at risk. Glad he got his.",
            "As I was reading it, I thought \"huh, must be Paris\".\n\nThe last edit cracked me up 🤣",
            "> 8 lane roundabout\n\nExcuse me what the fuck?",
            "He took the racing line. Outside/apex/outside. Totally his fault and no I don't need to see a diagram to work that out.",
            "In most of Europe we have a single 3page form with strikethrough. Both drivers fill out their section on the first page, with name, address, vehicle, insurance and such, then the form is split, and the 'back pages' go to one driver each. And they fill out their explanation of what happened on that page, hopefully at home or at least away from the other driver.   \n\nIn most countries, police is only called in if there's an injury, one of the drivers is intoxicated(or suspected intoxicated) or there's a lot of third-party damage.    \n\nSo, always take a lot of pictures. If you can, not just of the cars where they sit, but back towards where they came from, possibly walking up those roads and taking pictures to show if there's signs or visibility issues.    \n\nAnd a dashcam. Get one that is 2channel(the second is usually an extra cam you mount in the back)  and the front channel should cover as close to 180 degrees as possible.     \n\nInsurance companies may sometimes say that the video from these are of dubious legality, but if it proves that their client is innocent, they just love it! \n\nEver seen this one?    \n\n[https://www.youtube.com/watch?v=nLWPeVrQbNo](https://www.youtube.com/watch?v=nLWPeVrQbNo)",
            "Plus one just for the perfect use of \"tangent\"",
            "Paris was my first thought! That roundabout is terrifying when you’ve never been in a multi lane roundabout before.",
            "8 lanes? Holy shit! I thought 3 lanes was bad.",
            "I used to live in Madrid and had  big 6 lane round about in the barrio, oh god how I hated it.\n\n\nDrove from Scotland to Madrid via Eurotunnel. France has the best roads but the worst drivers.\n\nSpain has lightly worse roads, slightly better drivers lol",
            "This comment section has made me really appreciate my 3-lane roundabouts where the lanes are clearly marked.",
            "Reading this a certain hell hole roundabout in Swindon came to mind",
            "Sounds almost too good to be true!",
            "Damn you Germans and your ,,quotation marks\"",
            "Nice and simple, i love it",
            "Always love hearing about the A hole getting his due. Great Job !!!!!",
            "8 lane roundabout?!",
            "Nice. Want a longer video floating around somewhere",
            "You idiot! :-)",
            "This is the best one so far. I’ve been in this sub for so long and this is the BEST. Good job. I love that you weren’t even mean and it paid off so perfectly.",
            "How much I would pay to see his reaction when he'd realized what he'd done...",
            "Out of interest where do you live that you had an 8 lane roundabout?   I know Britain is roundabout crazy (and glad we are), but thig our limit is about 3 lanes.  Maybe 4 with some serious traffic lane controls.  Think Britain's solution to high traffic roundabouts is to break up into a set of smaller mini-roundabout's like the Magic Roundabout at Swindon.",
            "Holy shit wtf a EIGHT lane roundabout? Wow that is asking for murder. \n\nGood on ya for being quick witted though",
            "I'd love to see what his insurance said to him lol",
            "Maybe its the \"see it once, see it everywhere\" effect, but thats some Ace Attorney shit lol",
            "OP, please identify where this happened. I need to know what an \"8 lane roundabout\" looks like.",
            "8 lane round about? Isn't that a little large for a round about?",
            "Hey insurance company people, here is a good laugh! I was rear-ended by a car, he admit fault, but the rookie cop wrote on his report that I rear ended my self!",
            "Idk why you would lie to the insurance that’s why you have insurance. I was at fault for an accident in the snow, I gave him my insurance put my cables on and left. I told the insurance exactly what had happened and everything was hunky dory, I didn’t even have my rates raised as a result. Also found out that $10,000 liability isn’t shit, luckily it covered the damages and I was able to get more coverage immediately afterwards.",
            "I love 'dumb girls' that considers explaining things simple using calculus :)\n\nGood on you!",
            "This is the UK, so we drive clockwise round roundabouts. \nAbout 30 years ago in the my dad work early one morning. Came to a large roundabout in Sheffield and starts going round. A woman at the next junction decided as she was turning right, that she would just turn right, anticlockwise, it was early in the morning, no traffic, it'd be fine right, and her saving 30 seconds are far too important to waste.\n\nThe fire brigade had to use the jaws of life to cut my dad out of the head on collision.",
            "I have never been a fan of roundabouts. I will admit, that there are times when they are convenient. And two lane(one going each direction) roundabouts aren't really anymore dangerous than normal roads, but multi lane roundabouts are nothing but dangerous in my opinion, for the exact reason listed in your post. I've never seen an instant where the convenience of a multi lane roundabouts outweighs the danger of them",
            "it is nice when they confess",
            "I truly enjoyed reading this.",
            "8 lanes?! And I thought the two lane roundabouts I've driven were scary.",
            "I'm sorry... 6-8 LANES?! And to think, 3 lane roundabouts stress the hell outta me 😅",
            "He did a secant",
            "I was once employed by a company that tried to get out of paying a guy when one of our semis ran over his car.\n\nYup, you read that correctly.  Ran ***OVER*** his car.\n\nThe driver was coming back late at night, on a weekend night, cut his turn too sharply and ran (the trailer) over the front end of a smallish Honda or Subaru type car that was (completely legally) parked in the parking lot.",
            "[An artist's rendition of the ordeal of u/Economy-Grapefruit32](https://imgur.com/a/2E5LjP7)",
            "8 lane roundabout? I think this is one of those scenarios where a 4-way intersection would be better",
            "8 lanes? My goodness"
        ]
    },
    {
        "post_id": "hhxmut",
        "author": "slmpickings",
        "title": "\"Can I talk to someone who KNOWS THINGS? Like a MAN?\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hhxmut/can_i_talk_to_someone_who_knows_things_like_a_man/",
        "score": 21101,
        "num_comments": 723,
        "created_utc": 1593427492.0,
        "selftext": "This popped into my mind recently. I used to work at a retail tropical fish store, and weird as it is, we were very well known. We used to provide the aquarium with rare fish and people used to drive from 2-3 states over if they were true \"fish people\" to come buy from us. \n\nI (at the time 17F) was an expert in tropical fish and koi. In fact, it was my job that summer to be the koi and outdoor pond point person, and my job was not only stocking the ponds, but managing all the plants, caring for them, and knowing every bit of information and all the prices of the various koi and goldfish we had. I knew diets, temperature ranges, places of origin, special breeds, I knew it all. They even would call me with questions on my days off. \n\nThat clearly did not matter to one customer though. He came inside the store and asked for some help with koi outside. I happily agreed as I was the only person not on my lunch break. \n\nNow this guy frankly seemed put off by me offering to help. So instead of buying anything, he decided to quiz me for 20 minutes about the koi, goldfish and pond plants to try to get me to admit I didn't know something. I answered every single one of his stupid questions (some really were stupid) and at the end of the 20 minutes he had the balls to say \"\"Can I talk to someone who KNOWS THINGS? Like a MAN?\" Full emphasis in tone on those words too. \n\n\"Sure you can,\" I say with a fake smile \"let me get 'John' for ya\" \n\nHere's the malicious compliance. \"John\", name changed, was 75, retired, annoying as hell and batshit crazy. My boss didn't even want him to be hired but he owed John a favor. Now John is an expert in goldfish, but he hates koi and outside ponds. John also like I said, is really annoying, and crazy but he had a soft spot for me so we always would chat. \n\nI went inside to find John, and explained to him that this customer wanted a man to talk to. John asked me why he wanted to speak to a man when I was the pond point person, and I told him that he clearly just didn't like that he was speaking to a girl. John nods knowingly, gets this EVIL grin on his face, and goes to help the customer \n\n5 minutes later I hear a man yelling in the parking lot. I run outside and find the customer screaming at John and cursing him out \n\n\"What is WRONG with you? Does nobody f*ing know anything around here? I WILL NEVER COME BACK! You're all horrible and know nothing about fish, and you're a terrible employee\" (or something to that effect) \n\nI watch the guy hop into his car, slam the door & drive off. \n\nI ask John what happened. He said \"oh yeah no everytime he asked me a question I said 'hm, not sure... good question though, I could go get OP and ask, she's really our pond expert' and apparently he DID NOT like that\" 😂 \n\nCustomer, if you read & remember this, FU. Thanks for reading \n\n\n\nTL;DR I (17f) am expert at fish store. Older male customer doesn't like this, asks \"Can I talk to someone who KNOWS THINGS? Like a MAN?\" So I get the most annoying man who works there to literally annoy him into leaving the store & vowing never to come back\n\nEdit: THANKS FOR THE AWARDS FRIENDS! I hope you all are being safe & being kind to one another, I'm glad so many people got a kick out of my story!",
        "permalink": "/r/MaliciousCompliance/comments/hhxmut/can_i_talk_to_someone_who_knows_things_like_a_man/",
        "comments": [
            "Annoyingness notwithstanding, John is a good friend; he’s the kind of people you keep around.",
            "This is the best! I love this so much! But also I'm so sorry that man was incredibly rude to you and doubted your ability and knowledge about fish just because you're a girl. But this is hilarious!",
            "When I was 21 I had a summer job driving a bus around Banff for a group of hotels. It was free for the guests staying at any of our 5 hotels in Banff. \n\nI had my class 4 license, which is required to drive those 24 passenger shuttle busses. I looked like a young fun loving guy, because I was. \n\nI pulled up to a group of people that were flagging me down. This happens when guests see me, but they aren’t at a stop. No worries, I pull over. \n\nI open the door and Karen looks right at me with that open mouth gasp that is so signature of Karens. \n\n“Well! You are most certainly not old enough to be driving this bus”\n\nWe kinda just stared at each other through the open door. I didn’t know what to say. Someone else pushed past her and said “looks fine to me” and sat down. \n\nShe stood there in the door and pulled out her phone. “I’m calling the hotel to be sure that you should be driving”. All the other guests on the bus sigh. \n\nShe wasn’t finished finding the phone number when someone on the sidewalk outside said “Wow look! An eagle!” She stepped off the bus for a second to get a look, I closed the door and left her there. Next bus is in an hour. Don’t know if there was even an eagle. \n\nNever heard anything about it.",
            "I work in a paint department at a hardware store. If somebody is staining their deck, they wanna talk to a man and if they’re picking out colours they always want me. I didn’t know a store could be so sexist",
            "[deleted]",
            "It's crazy how often this would happen with female employees at my old job. Customers are just giant dicks and as soon as I (male) turn the corner they instantly become compliant, it always pissed me off whenever I would see it.\n\nI remember reading a post years ago about how a boss was accidentally using one of his female coworkers emails under her name instead of his, and his job instantly became being talked back to and doubted. He was thoroughly confused until he noticed he wasn't on his email, after switching back over all the bad behavior from customers stopped, just because there was a mans name on the email. The average consumer is scum.\n\nEdit: maybe I'm not thinking about a reddit post, does anyone remember to the second half of my post that I am referring to? I'm trying to find it now.",
            "Something similar happened to me but it was two women who didn't want to talk to me about their pond plants.  \n\nThey wouldn't even tell me what their problem was, and said they wanted to talk to the guy that worked there.  \n\nI explain that he's just gone to lunch, and again asked what I could help them with.  They said they'd wait for him.  \n\nNo skin off my butt... I had a lot of stuff to do.  So the next 45 minutes consisted of me moving and working all around the two women standing in the middle of the fish/pond area while I basically pretended they weren't there.  \n\nMy male co-worker returns, and he was irritated with me for not helping them.  I shrug and say \"they only wanted to talk to you.\"  \n\n(tbh, I assumed he had helped them before it otherwise had some sort of history... apparently not)  \n\nHe asked what he could help them with, and they started explaining their situation and asking their questions.  \n\nEvery question they had, he'd say \"I'm not sure...\" and then he'd turn and ask me their question word for word.  I'd answer my male co-worker, looking him in the eye, and ignoring the women.  \n\nThey were pissed!  They didn't go into Karen mode, but they did that thing middle aged women do when they fidget, look around at nothing, and get all splotchy on their necks.",
            "I had a female boss in a very male dominated field. So they would talk to her but would always ask for the man above her (maybe not say man but implied it)...when they did she would just say hold on “Steve, so and so wants blank....can’t do that, have them do x,y,z?”\n\nGuy would be stammering “oh wait, no, I didn’t want to do all that etc..”\n\nNever saw her lose an argument or not get what she wanted. \n\nWhat was hilarious was nowhere on the website was there a Steve, she was as high as it went in any place you looked. They were too stupid to look.",
            "Didn't you know? Every knowledges related to fish, Koi more specifically, are stored inside the balls, a woman can't be a fish expert.\n\n(/s, don't want to be insulted)",
            "As a man I can confirm we are born with innate and detailed knowledge on tropical fish\n\nThis knowledge is ofcourse obtained because I have a penis and thats just how nature works",
            "Haha glad when there's a happy ending",
            "This story sounds fishy.\n\nSorry, It's 5:30am and I have yet to sleep. \n\nI ran into this attitude when I was working at a pet store years ago. Almost all of our animal care experts were woman, and I said the same kind of thing as John a few times.",
            "I wish I could have held the title of fish pond expert or at least be able to put that on a resume sounds fucking sweet",
            "I had the same thing happen when I was 19 and also worked at a pet/aquarium shop, except the man asked for someone \"older\" because he had a question about birds. My dad bred and showed birds and I had grown up with them but he wouldn't even ask me his question. I remember thinking \"you want a guy\". I directed him to my 17 year old, male co worker. The dude was happy with that but at checkout I made sure to mention how lucky we were to have such a knowledgeable schoolkid on our team.",
            "I was in the welding supply store one time and a woman came in to refill a bottle of welding gas and INSISTED she speak to man. The rest of the customers in the store were all looking at each other like \"uh-oh!\"\n\nThe woman she was talking to owns the store, and has more welding knowledge than anyone else in town... But she complied and came back with a teenage boy who was working in back and let him exchange the bottles for the customer",
            "I worked at an aquarium store in high school. I adore fish. I also have a stutter. I have it mostly under control, but every now and then I get stuck on a consonant and it’s just the worst feeling for me as I try to stop and just ... can’t. Anyway, one day I was helping some people and taking about our koi and I got stuck on a syllable. The man started making fun of me and mocking my stutter. Guess what?! Now you have to deal with my stepdad, who hates everyone and is mean as shit! Have a nice day! Customers can be incredible rude, I’m glad he got his instant karma",
            "So I'm the most experienced associate in my very male dominated department. I've had conversations where the customer asks a question of the man, the man asks me for help, I answer, and the customer proceeds talking to the man. Like a few put their back to me. Even though I'm giving them the answers they need.\n\nI long for the day I can piss off a customer like you did.",
            "I hate that it is a thing but this happens a lot in many industries.  A few years ago my sister was a car sales person.  She knew more about the cars then most everyone there, was the only one who could drive a manual, if she didn't know about the car they were looking for (it was a used car lot) then she would look it up and learn about it.  Still men would come in and be upset that a woman was their sales person and tell her they needed a man.  Even her managers admitted she knew more then then, but every time she was told they wanted to work with a man she would let them and every time they would complain to a manager about first having to work with a woman and then that the man was useless.  My favorite time was when the man complained to a manager and the manager said \"let me go get my best sales person they really know their stuff\" and got my sister not realising that she was the first person they met with.  She ended up selling him the car he wanted!",
            "Ooooooo.... I had one of those!\nWorking at a camera store/ photo lab.  Answered all his questions, he didn't like my answers so on the way out started asking the only guy there the same questions. \nExpect he only started a week before. So every answer was \"uhh,  let me check\" turn to me and ask. \nThat was a fun day",
            "As a middle-aged white dude, fuck that guy with a rake.",
            "We had this EXACT situation at my last place. I'm the groomer, my bestie was fish department and my other bestie was the stote manager. Customer wasnt happy with our fish girl - even though shes been doing fish for YEARS and knows so much. Asked for a manager, got another female. Guy just starts storming away, comes across a male coworker - \"why do they even hire women here? Those girls dont know anything!\" Male coworker just looks at him - has no idea whats been going on, was just stocking shelves - points at the door and says \"sir, just go. I'm not doing this today.\"",
            "I had a similar experience at my job. A customer asked me what something meant, so I explained it and he didn't like the explanation because it didn't mean that the item in question was on sale. He asked if there was someone else who could help him, specifically a man. I said, well I'm a MANager. He said he wanted to speak to a man. I told him that the answer was going to be same no matter who he spoke to and that if he really wanted to ask a man, he could go find one himself. He left the store instead.",
            "this happened to me. salesman came in, training a new guy,  acting like he was mr important bigshot, i asked how i could help them, he smirked and asked to speak to the man in charge, so I went to get my executive manager, who returned with me and told them \"this woman is the one in charge, and we will no longer be doing business with you\". this was in the 90's. that woman was badass, she took no shit from any man, even way back then.",
            "I (23f) was a fish and reptile expert at a local petstore when I was 20. This story rings so many bells. I had a man ask to buy 6 juvenile koi to put into a 20gal tank with 3 cichlids he had in there already. When I refused to sell them to him he says, \"Sweety I've been owning fish since before you were born.\"\nLike.. okay? But you're still gonna kill your fish lol",
            "Good Job!\n\nThe sad part is he probably has a wife and maybe a daughter.",
            "I'm still hoping that one day a teen girl that gets the \"I want to speak to a man!\" treatment decides to speak in the deepest tone she can muster and pretend to act all macho.\n\nBonus points if her \"macho\" impersonation ends up sounding like pirate speak. \"Yar, these be the finest fish in the water.\" or some shit. 🤣",
            "I was the only female CAD Engineer at work yeeears ago, and always got tons of grief on projects as people either didn't listen to me or outright thought I must be someone else. \n\nIt's an age/status thing, too. I trained as a therapist for a few years and I found people would not take me as seriously if they knew I wasn't married. Like how could I know anything about relationships if I was a young, unmarried woman? Um like I have done the training and have the experience, you wouldn't go to the doctor with diabetes and be pissed off that they didn't have diabetes too? You don't have to be married to be an effective relationship therapist.",
            "I understand this annoyance all too well. \nMy first sales job was at a furniture store. I’m female, and I look very young for my age. I was 28 and looked mayyyyybe 19. \nI knew my shit, just like you did. But many people didn’t trust me, as a “young female” there’s no way I could have product knowledge. I’d ask the customer to hold on, and go get an older male. He would tell them the exact same thing I had told them, and close the sale. \nWe split the commission. \nI loved walking by the customer while they were being written up, and asking if (man) had helped them properly. \nThe real stand up people would admit I knew my shit. \n\nIt worked in reverse too though. If one of those older men couldn’t close a sale, they’d pull me in, and I’d flirt and get the sale. I split the commission with them.",
            "What would've been even better is if he expressed his dislike about outdoor ponds.\n\nCustomer: \"Should I get some plants, like water lilys or something like that for my pond?\"\n\nJohn: \"Mmmmmmmmm...I wouldn't do that if I were you.\"\n\nCustomer: \"Why not?\"\n\nJohn: \"Because outdoor ponds are stupid.\"",
            "You know what’s weird? Im a middle aged man and I’m realizing that I’ve genuinely never imagined that someone doing their job wouldn’t know that job because of their age or gender. Now, many have shown me that they’re not able to do their job but that has been aside from the aforementioned.",
            "I used to see this a lot when I worked retail at an electronics store, I'm male but we had a few women work in the store too and every so often, they would get a customer like that.\n\nI often knew the answer to their questions, but if I've just heard my female colleague tell them the same thing I would, then I'd just explain they have already been given the correct information and I wasn't willing to repeat it, just because they weren't happy it came from a women. Most of them felt embarrassed to be called out and either just bought the item or left.\n\nIt was funniest when I'd only recently started, I already have a good knowledge on computers and individual parts going in so never had a problem helping those customers, but I only knew the basics on some areas like CCTV and hardly nothing on things like DJ equipment. There where a few occasions when they asked me something on those areas and I'd just direct them to my female colleague who was just helping them, saying they know more then me.",
            "I was in an auto parts store.  A very polite female associate helped me.  I did not see gender, instead I saw an employee who has more knowledge and experience than I.\n\nGender is irrelevant when it comes to knowledge.",
            "Amazing. Both you and John are absolute legends!",
            "That's what he gets for being a sexist douche lol. Hopefully he encountered another woman at the next store he inevitably went to and this happens all over again. Sweet, sweet karma.",
            "This is so beautiful in many ways. Two completely different generations coming together to annoy the fuck out of a third generation. This would have made my month.",
            "I work in a tire shop. One of my favorite supervisors was a woman. This woman would out work just about every man in the shop while also having all the sales knowledge. It's pretty sad how many times people would literally ignore and walk right past her to ask one of us men a question, even female customers. I'm a huge fan of how John handled the situation and I'll use this in the future haha.",
            "This happened to me a *lot* as the only woman working in the Electronics section at a department store. I knew detailed info of pretty much every item we had, had solid recommendations based on that info, and was very helpful. My male colleagues knew fuck all about any of it, because they either didn't care or spent more time outside hacking darts than working. At least once a day some Buddy would come into the department, return my hello, but then zip past me to talk to a man. Coworker would almost always end up calling me over for help, and I'd happily oblige, but I made sure to do it with as much thinly-veiled passive-aggressiveness as possible.",
            "As a guy approaching 50, I hope I get tasked like this when I’m older. I’d love messin with jerks to help somebody out. John seems like a good dude.",
            "I love that John had your back and couldnt have handled this better in my opinion!",
            "My first job was working in a hardware store and always had obnoxious contractors or weekend warrior guys come in. we had a lot of knowledgeable woman who worked there but this would happen to them far too often. Once I became manager the girls knew they could come to me and I’d go over to talk to the guy but always say “hmm I’m not sure, Jessica is our department expert. Jessica what would you recommend?” And watching these guys kick rocks cracked me up.",
            "Great story. I’ll just say this: my mom kept freshwater tropical fish. You better damn well believe if i have a question, I’m going to listen to the “fish expert.” Some stuff is easy. Put a couple guppies in a tank, feed them, change water, and don’t let them get too cold, and you’ll either have a couple live and happy guppies, or you’ll have a couple happy, adult guppies and about 20 fry in a few weeks. But, some fish will die if you look at them funny. It’s impute know which are which, and I want to make sure the person telling me know their stuff.",
            "Glad to see you weren't being koi with this customer :-)\n\n(KOI - great scrabble word!)",
            "Sounds like your store lost a headache, not a customer. Good on you and John.",
            "[deleted]",
            "When I worked in a bookstore and someone asked to speak to a man instead, the guys I worked with would tell the customer that they were happy to help, but just so they know, they *are* illiterate, despite working in a bookstore.",
            "As a fellow woman who worked at a fish store in her teens ..\nI love all of this! Fuck the patriarchy!",
            "John is the hero we need, not the hero we deserve.",
            "My wife knows and cares more about cars than me. She also enjoys cooking less.",
            "People like this are the worst! I had an elderly man think his order was put in wrong (it wasn't) and when I explained to him the way the discounts work he very condescendingly asked me to go get a \"boss man\". My male manager then had me stand next to him, so old dude could ask a question, manager could ask me and then relay it to the old dude. But this old guy was happy since he heard it from a man and left.",
            "I feel you OP. As a short female and the general manager of a business, customers often ask me for the person in charge and don’t believe me when i tell them that would be me. Countless times I’ve literally been walked past so people like this could go ask a male employee something, only to be redirected back to me. Even women will do it. Maybe it’s generational? Frustrating as hell either way. But fun to watch them throw tantrums 🙂",
            "I used to work in an automotive parts store. I am a visible minority and my coworker is a female. It is always fun watching people internally struggle in who to approach but I made sure if they come to me I would tell them my coworker is much more knowledgeable on this and if they insist on my help I would usually ask my coworker for help for everything they just said.",
            "I used to work in a large, well known outdoor sporting goods store. I worked there for 4 years and got to know the products I was selling pretty well. I constantly would get the “well.. can I talk to a guy who knows this stuff?” I would smile and say “sure!” And call a male employee over to help. 99% of the time, they either gave the customer the exact same answer I did, or they didn’t know the answer at all and had to call me back over to ask me. The embarrassment/anger on the customers face was so satisfying every time.",
            "YES I LOVE THIS. Fuck that guy. I used to rent tools and I had this kind of shit happen all the time.  Id go get a 'man' when requested and I always got called back to answer questions. Fuck all those people. \nAlso fish are cool af",
            "Oh man! I had this happen to me once when I worked in shoes like 10 years ago. Guy came in and refused to work with me because I was a girl. Knew everything about shoes tho. I went back and told my manager about how he wouldnt work with me because of my gender. at the time the shoe stock room had swinging doors. He went out there while I was fuming in the shoe room and asked him some questions. When it came time for shoe recs he would stick his head in and ask me what I thought lmaooooo the guy was not happy.",
            "The most important weapon any female in retail (or engineering, shoutout to fellow female engineers!)  can have is a male coworker who is more than willing to give a customer hell when they behave like this.  It’s a weapon you never want to have to use tho.",
            "Omfg OP that absolutely amazing",
            "Do you have a filter? If you do you can honestly just leave the filter untouched when you do a water change, and an in between water changes you can rinse it out. That should have enough good bacteria to keep it running fine. If you don't have a filter a cheaper alternative is to leave a small amount of water when you do a complete change because there will be some bacteria in it. \nWe used to squeeze dirty water from a healthy tank into a plastic bag to give to customers who are setting up a new tank. You can check with your local trusted pet store to see if they would do this or our favorite brand was either API QuickStart or aqueon pure betta beads for that species specifically",
            "This is right up there with all of the people who demand to get a \"Nemo\" even though they want to freshwater tank. I really hope you stop selling that guy fish though it definitely feels like he was killing them or sacrificing them 🤦🏼‍♀️",
            "Reminds me of a similar experience, I work as a paramedic in a rural community that is most just old people.\n\nI love the look on patients faces when my male partner and I walk through the door and they aren't sure if it's worse if I'm the \"ambulance driver\" or the actual medical professional??\n\nJokes on them, we both do both, but I actually outrank my older male partner quite a bit.",
            "Never coming back you say? Perfect!!",
            "My sister works at Reno Depot (think Home Depot but French Canadian) and while she likes working with her coworkers the customers are mostly sexist, old French Canadian males who treat her horribly because she’s female. Numerous times she’s been told stuff like “women shouldn’t work here” and other things along those lines, and it’s been wearing away at her",
            "Hahaaaa screw him!!!! And hes not coming back...what a win!",
            "This shit is for real. Whenever someone calls up and my employee helps them, 7 out of 10 times they ask for someone else. Then I have to talk to them. I tell them EXACTLY the same thing she told them. They are happy when I tell them. It's annoying as fuck. It's also mostly senior citizens who only take things face value with a male voice it seems too.",
            "i WiLl NeVeR cOmE bAcK\n\nGood, thank u, next",
            "I work in the garden department of a certain large home improvement store. Any time someone asks me to find a male coworker to talk to them about lawnmowers or whatever I go find one, and then when they come and talk to the customer, they look to me to answer the questions for them. Nobody who works here knows anything more than what's available on the app, and I'm the only one who puts the effort into reading the product details, so I'm the only one who can effectively answer customer questions. I always get a kick out of it when the customer has to \"settle\" for my help.",
            "As a customer service rep this is my normal day. I love the malicious compliance stories that come out of these ridiculous situations. Your business is better off without his money",
            "There are so many stories on here with this theme and I've got to say: they never get old",
            "As a girl who worked as the ‘fish person’ at my local pet store when I was 18-19, I feel your pain. So, so many people (mostly men) who assume you don’t know what you’re talking about and are just tryna sell them stuff. No Karen, I don’t care if you once owned ten goldfish in a bowl and they ‘lived long happy lives’, they need a BIG TANK.",
            "Your coworker sounds like he's... Not that bad lol maybe he just needed to focus his malice is all... Like an anti-hero!",
            "My favourite part of your post was \"FU. Thanks for reading\" 🤣",
            "I get bad-attitude, old, white men that like to come into the tire shop I work at and argue with me.\n\n\"I've been driving for longer than you've been alive!\"\n\nRight, but how many tires have you changed? Or how many manufactures can you name? Not the best comparison, but I can kind of empathize.",
            "It really sucks, I'm gonna have to take a pay cut in order to switch fields (especially if I go back into animal husbandry) but I'm in a living situation where I can save money even with a low paying job, and Thankfully don't have any kids to support right now. I feel for you though it's so disheartening to see something that you would enjoy doing & know it's gonna cost you basically your current way of life& comfort.",
            "This happens so often it is ridiculous. So many Officers used to only want to speak with someone who had Rank when they had a problem, and a GIRL who was only a PRIVATE was the one they had to talk to ? I loved coming out and saying, \"I am so sorry Sir, your time is obviously important, and this problem requires the attention of our Subject Matter Expert. I will get out top SME out here now to deal with it. \" And go get the girl he was talking to before while I stood there acting like a proud parent.",
            "Apparently for Kevin, women are HALF as intelligent a men. Now, where did I read that?",
            "Lovely :D",
            "[deleted]",
            "Right? but actually I do think that watching someone fail to get what they want does constitute a good day",
            "You’re my hero if the day, OP.",
            "What the hell is it that creates these kinds of people?",
            "This is brilliant! Some people are just sexist idiots. They have all the answers staring them in the face and yet, they cannot get out from behind their own incompetence to take help because apparently you need a penis to know about fish.",
            "There's a r/TalesFromThePetStore sub that might enjoy this.\n\nI worked at a fish store and was 'moderately' knowledgable about the fish section... But some of the older staff definitely knew more. That was more teenagers vs. 20-somethings though.",
            "Bold of him assume only mens like Koi.",
            "John may be old, annoying, and crazy, but he's also awesome!",
            "Shout out to John!",
            "I always wonder what these customers would say if you asked them why a man would be able to help them better when you are the most knowledgeable employee about this subject. Like would they just straight up say because men are always smarter? Or would they try to pretend they weren't sexist somehow",
            "Exactly why I grow out my beard. Working retail sucks.",
            ">true \"fish people\"\n\nI believe they are called mermaids",
            "I use to work at a hardware store and got that jab all the time. My favorite was when a customer for mad at me because I couldn't think up an upto code blueprint for a deck in my head and give him all the supplies he needs, despite having a blueprint building computer/printer. \n\nAnyways, I can't believe of all things that somebody would also be sexist over fish??? You just blew my mind and I appreciate your coworkers response.",
            "> I (at the time 17F) was an expert in tropical fish and koi. In fact, it was my job that summer to be the koi\n\n**Talk about next level!**\n\n> and outdoor pond point person\n\n^(Oh.)",
            "I had similar things happen to me. I (now 25 F) started training as an automotive window tinter when I was 16 and in high school. By 18 I was lead tinter and training others. Soooo many times I’d talk with customers and you could tell they were surprised and sometimes doubtful to have a young woman working on their car. Surprisingly, most of the problem customers I remember were actually women (Karens) that for some reason thought I was incapable of doing a prototypically “man’s” job. I loved it.",
            "This is gold.",
            "😂 that's great, thanks for this, i needed it today",
            "Laughing on my break at work. This is amazing",
            ">gets this EVIL grin on his face\n\nMy wife says I get a feral look on my face before the shit hits the fan.",
            "When I worked retail I was the John when customers warranted it. The key part of this was always maintain a nice calm attitude while aggregating the fuck out of them. And sound polite.",
            "I did something similar for one of my old coworkers. Her and I were 2 of the most senior and experienced workers in the shop, despite being some of the younger people there. I heard her talking to an older customer who wasn't interested in her advice, it was clear he wanted another older man. Wasn't outright saying so, but you can tell that type. So I went and got our \"John.\" Nice guy once you get to know him, but. Senile and arrogant. Swearing he's had 25-30 years experience in every job known to man, while not being able to remember the basics even an hour after I explain them. Broke more than he's fixed. Takes twice as long as anybody else. \n\nI'm rambling again, but that last part is important. Anyways.. \n\nI told him to go along with what I say, then brought him over and asked what the customer what he thought he needed done. Introduced John as the guy on the job, 25 years experience, he'll be the one to give you advice, blah blah blah. Inform front desk of what's going on. Well, an hour later buddy's getting impatient. Front desk asks me to talk to him. I tell him \"the lady you were talking to is our fastest worker and *the* person to take advice from. Do you want her to take over from John?\" \"Just get it put back together and I'll go to the shop down the road.\" To my knowledge he never came back, and we were glad for it",
            "I love this. Mine was at a bakery.\n\nWell you get 16f me or my angry drunk German boss. You choose. \n\nI know more about bread and chocolate than freaking willie Wonka.",
            "I feel like I’d want John to stick around just to have him do this to those types of customers.\n\nIf nothing else that’s how I’d want to behave when in that situation.\n\nClosest I’ve come was working at a baker at the till. I’m six foot four and my boss was maybe five foot four, if that, younger than me and a very pretty blonde with long hair.\n\nSeveral times I had customers who refused to talk to her, insisting to talk to me instead, only for me to go “I’ll have to check with my boss” turn to face her and say “is this something we can do?”\n\nI’m honestly surprised it only resulted in one complaint.",
            "You definitely keep him around for all the sexist idiots that you might have to deal with.  I heard of one company where the guy refused to talk with girl to the point where he was threatened with a lawsuit if he didn't stop being a pain and get lost.",
            "Kinda sounds like those neckbeards that go into GameStop, ask about some game, woman employee answers about said game, human Reeee doesn’t think a girl is qualified to be a gamer let alone enjoy or know about games, proceeds to quiz her about everything only for her to know everything bc, ya know, women like things too and know about things.",
            "Could you please get a man to tell this story?\n\nThank you.",
            "[deleted]",
            "That's the kind of man who needs to hear his wife reassure him that he had the world's biggest penis while he's going to town from behind with his half flaccid micro penis and comes 2 minutes before she fakes her orgasm again.",
            "Glad he didn’t get any fish. Doubt he knew enough to properly care for them.",
            "Very smooth! That was the kind of customer you don't want to have! :D",
            "This is fantastic. And something I would’ve done in your situation.",
            "That's beautiful.",
            "Hate people like this!\n\nIm actually buying a house that comes with an outdoor pond with some koi in it. I know nothing about this stuff. Could you offer me some basic advice for a first time koi owner?",
            "I have to say John sounds all right.",
            "Seriously though customer if your reading this F U & ho get some help.  That's a ridiculous attitude to have given all the things you learned in life, that were taught to you by women. Yet you either asked questions that you didn't know the answers too or are so dumb that you can't even acknowledge a woman knows her shit when she proved it to you by answering all your \"tricky questions\". \n\n\nAt least you didn't buy any fish, as honestly not sure you'd be able to care for it/them...",
            "John was your MVP but you still dis him. Dang, John, life aint fair.",
            "I love this so much! Fuck that guy. Props to 'John.'",
            "I hope the customer got hi a koi pond finished. He sounds like he needed a good place to relax.",
            "On the bright side, you don't have to worry about any of your fish going into that horrible home.",
            "Now THAT is an epic example of malicious compliance, and a story worth telling at every opportunity!",
            "That guy sounds like one of those customers who are more trouble than they're worth.  And \"John\" got to mess with him.  Good job getting rid of a PITA no one at your store will have to mess with again.",
            "John's the homie!",
            "I don't understand this mind set. When I meet someone who shares my interests it makes me super excited. What a dork.",
            "Omg John is a legend!",
            "This is my favorite post on this sub",
            "What does the tag M mean?",
            "As someone who works in a retail store that sells fish, I feel this. Like fish people can be crazy sometimes.",
            "I was a manager at sears and the person over tools and parts was a woman. She was extremely knowledgeable and well versed,but she got hacked all the time because men and some women couldn't comprehend she was great at her job and competent. They'd ask for something ans ahed say well this is what you actually need or this is how to approach it and they'd scream,yell,storm out,ask for a man. Especially when they came in not knowing the model # or any pertinent information. They're like \"I'd she was a man she'd know\"",
            "I had the same experience, but I was John. That particular day, we had a guy named Shawn working, and these two Karens come in with a grill they had bought. It was a factory defect, but they just could NOT imagine that this young “kid”(in his 20s, plus he liked tight pants, and had a fantastic beard) knew what he was talking about, despite him being our grill lead. So I walk by just in time to hear them say “Well, I don’t know if I can trust you, you’re not exactly a MANLY kind of guy.  Can’t you get me like, a real man, like a manly-grilling-kind of guy or a manager?” Now, I’m not the store manager, but I was well-known and liked and was wearing a different color shirt that day so they thought I was a manager. I go up to Shawn and ask if he needs help. When the ladies cut in, I told them, “I’m sorry, do you have a manly-grilling man accompanying you? Because this is highly technical (it wasn’t) and you don’t look like you’re going to understand.” They back-pedaled on that comment so quick.",
            "I (26f) worked at a hardware store for 5 years. Most customers were fine learning about hardware or electric fences or livestock feed from a young woman. Sometimes I even surprised my boss by knowing something he didn't about a product. Every so often though...",
            "This is my favorite story from this sub.",
            "We all need a John to back us up.",
            "Working at a hardware store in my late teens and early twenties was similar. They would ask for someone older and I would send our craziest retiree over to help. The retiree generally came back to ask me the answer to questions after a while.",
            "I really can’t believe we still have people like this around us thinking females are less than men.",
            "DOES NOBODY EXCEPT THE SPECIALIST THAT I REFUSE TO SPEAK TO KNOW ANYTHING ABOUT WHAT I NEED?",
            "Nice of John to have your back like that.",
            "Isn’t this post almost an exact re-hash of an identical story, but the girl in question worked with electrical fixtures at a hardware store? Posted on this sub a couple of days ago? Like.. the dummy employee was also named John and everything. Seems like a wild coincidence if it’s not a repost",
            "Never mess with the pond point person.  Never.",
            "Something similar to this happened to me in my senior year of high school. There was a maths teacher who used to be a principal in another school apparently so she thinks she’s above literally everyone else. I was standing outside class with a teacher just chatting and the math teacher asked for the time. I had a watch on me so I just answered her because it’s the human thing to do. She just glared at me and said “I didn’t ask you” and repeated her question to my teacher who promptly pointed at me because guess what, I gave her the damn time. The stuck up teacher was so insulted for some reason and hated me throughout the whole year. I’m so grateful that I didn’t have any classes with her.",
            "I am always surprised by people that don't realize that a teen(17f) could know more about any skill than they do.   I've met a lot over the years.\n\n(I may have raised one or two...)\n\nIt sounds like John is a good friend. (and smarter than the customer.)",
            "You know what? Screw that guy. If he wants to be a sexist jerk who gets angry over men not knowing more than women, then it's better if he never returned to that place. He's actually doing a favor by never returning.",
            "This is fucking amazing. When I had my first job, I was friends with a guy named Walt who had 3 daughters around my age, and we would hang out at work all the time. When I broke up with my bf and he started stalking me, Walt would walk me to my car at night and stick around if I was alone up front.",
            "Is it weird that I've always had the attitude that as long as you know your stuff, I truly do not care what you have between your legs?\n\nMore and more often, it seems that that's a weird attitude to take.",
            "Imagine John knowing that there’s all of these people who have heard this and are now talking about how amazing all of the “Johns” they’ve met are and he’s just chilling in his retirement living life while we go on about how nice these people are at work. This post is full of fun thanks for sharing :)",
            "Not sure if it's kosher to ask for barely-related advice in the comments, but what sort of nitrifying bacteria should I use for a small (\\~3 gal) aquaponics tank with a single betta fish?  The tank came with a bottle of \"Zym-Bac,\" but it was expired and I can't find the same brand anywhere locally.\n\nI ordered a bottle of Bacter-Gen F from Amazon based on good reviews, but I want to make sure that it's good for aquaponics.",
            "One of my goals in life is to be in your situation,  and be an expert at something others get referred to",
            "''True fish people''\n\nThe Merfolk take offense to this",
            "This is awesome. As a fellow fish person, can I hot you up for questions? My dad and I have been wanting to start a mini pond. But not koi size.",
            "LOL John sounds like a fun guy to work with (so long as you're not his manager).",
            "r/TalesFromThePetShop would love you, though it's kind of a dead sub. I do a major relate",
            "Wow, fuck that guy!",
            "There's a special level of hell for people like that customer...",
            "Tennis balls.\n\nLike they couldn’t stop!",
            "Awesome.",
            "Haha that's great. Love the story. Bwahahaha"
        ]
    },
    {
        "post_id": "tgnnwj",
        "author": "crummynubs",
        "title": "Cheapskate argues over $2.75 iced tea they didn't like on the bill, so I happily switched it out for the $3.00 soda they ordered instead",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tgnnwj/cheapskate_argues_over_275_iced_tea_they_didnt/",
        "score": 21083,
        "num_comments": 565,
        "created_utc": 1647560459.0,
        "selftext": "Some people are particular about their iced teas. Ours has a tropical flavor, which this woman didn't care for. \"Can I just get a diet soda instead?\"\n\nNot a problem. Trying to hunt down a manager to void out an iced tea for a soda isn't worth the effort, especially for a negligible 25-cent difference between beverages, so I just let it ride.\n\nWhen the check arrived, the party spent a good deal of time poring over how to split the bill. My manager had swung by to run their cards, and they apparently gave him the same lecture about how we should just have regular black iced tea and said I forgot to take it off the bill.\n\nWhen he voided it off and checked with me, I told him, \"Oh, that's right, and they switched to a soda,\" and rang it in. He just shrugged his shoulders like his time had been wasted.\n\nI figured the table were either being cheapskates or dumb, so I happily dropped off the new bill and said, \"So we took off the iced tea and corrected it with her diet coke.\"\n\nThe guy took another 10 minutes staring at the bill and probably felt like the biggest ignoramus.",
        "permalink": "/r/MaliciousCompliance/comments/tgnnwj/cheapskate_argues_over_275_iced_tea_they_didnt/",
        "comments": [
            "I do enjoy when moronic customers play themselves.  Very satisfying",
            "Reminds me of a customer I had. The store I work at will sometimes allow non-receipted returns. The catch is, it will return at the current selling price minus 20%. Someone came in with a return and no receipt. I made an exception and returned it.\n\"Oh I definitely paid more than that.\"\n\"Well this is the best I can do without proof of purchase.\"\nShe dumps her purse and starts digging. Success, she finds the receipt! Turns out, she bought it on sale AND used a coupon. If she had just accepted the non-receipted price and merchandise credit, she would have gotten more money back than she originally spent on it.",
            "I worked in a UK DIY retailer many years ago and had a woman bring me back a box of tiles she bought extra for a project.\n\nI started to say that\" I couldn't accept the box back because...\" , but before she let me finish she went off on one.\n\nSaying that she had spent £1000s in their shop and blah, blah, blah.\n\nThis was a busy weekend day and there was a small queue forming behind her.\n\nOnce she had calmed down a little, I continued to say that,\n\n \"I couldn't accept the box of tiles back because she didn't buy them from us\"\n\nThere was more moaning and huffing, from her whilst I turned to box round and pointed to the brand name on the box, which happened to be the brand name of our main national competitor.\n\n\"This is why I can't accept the box back\"\n\nShe looked at the box and looked at me and believe it or not said \n\n\"Can you not refund me for it anyway, it will save me driving to the other side of town!\"\n\nI looked straight at her and said\n\n\"Whose next?\"  To the waiting queue \n\nShe grabbed the box and left in a hurry and the rest of the queue were either tutting or just plain laughing at her.",
            "Edit: This is the first time I've gained 1k upvotes on a comment/post. Thanks!\n\nWe've been having similar situations at my workplace, too.\nGuests staying at out resort have the option of two packages:\n\n1. A daily package with all inclusive deals and a $25 gift card\nOr\n2. A two day package (meant for weekends) with all inclusive deals and a $100 gift card.\n\nThe daily package is cheaper (literally the same cost of a regular night), while the 2 day one is almost $150 more. We keep suggesting people take the daily package, but every single one of them insists on taking the more expensive option because it comes with a larger gift card.\n\n\"I want the package for the $100 card!\"\n\n\"Okay. But you'll end up spending $150, to get a $100. Are you sure?\"\n\n\"Yes, because it's more!\"\n\n\"But you'd be paying more than necessary. Okay, then.\"",
            "[deleted]",
            "I had a dude literally call my work and ask for .10 cents back. It was the principle",
            "This made a childhood memory flood back. My mom always ordered unsweet iced tea, said it tasted awful, then ordered a Diet Coke, said it tasted like saccharin. It was a ridiculous exercise any time we went out. I’ll never understand why she can’t just order water. She’s coming to visit in 2 weeks and now I dread it.",
            "I would say 25% of the time someone complains about their bill I realized I forgot to charge them for something. Fuck them",
            "If they are that tight on cash, the should have just got tap water.",
            "I eat out, a lot.  When the bill comes, it's \"did we order that?  Yes\", and we pay it.\n\nJesus fucking christ.  Pouring over the bill?",
            "I used to work at Pier 1 and I remember one time my associate and I (the assistant store manager) were ringing up this HUGE order of decor and housewares items. I’m talking probably close to 100 units. It took us almost 30 minutes to ring and wrap all the breakable items up. Shit was insane.\n\nWell when it came time to tell this ungrateful, entitled bitch of a customer the total, she made a comment about how we were kind of unorganized in our ringing/wrapping/bagging process and she wanted us to double check to make sure we didn’t fuck up. I told her I was sure there wasn’t a mistake, and she INSISTED on us double checking every item that got rung up. I groaned and we went through and checked every item, even the ones wrapped up, and lo and behold there was an error.\n\nWe had actually missed a few items.\n\nI thanked the lady for asking us to double check, rung up the missed items, and presented her with a total about $50 more than originally stated. She was pissed, but also completely silent and refused to make eye contact after that.\n\nMaybe if you had just kept your mouth shut…",
            "“But, but…I complained! Why aren’t you giving me free shit??”",
            "Congratulations, You Played Yourself",
            "NGL if I ordered an iced tea and you gave me some tropical shit I would ask you to take it back also",
            "Reminds me of when I was managing and a server told me a table needed a senior discount. Company policy was to apply it only to those who qualifed. We were busy so I just put it on the whole table since the server didn't tell me which items were for the senior member. Server tells me the table is complaining that the discount doesn't look right. \nNote: they had a couple alcoholic beverages so discount doesn't work on those which is probably why they were confused. \nWell them complaining about me over discounting them annoyed them so I asked the server what items the seniors had and adjusted the discount to apply only to those items and let them know I adjusted the discount per company policy and walked away. I don't think they realized it until they picked the check back up, but by then it was too late. \nAnother note: Pretty sure they still tipped the server well and if guests ever didn't due to something out of the server's control I bought the server a meal or two to make up for it.",
            "I love how the TLDR is in the title.",
            "Might be the odd one but I have deliberately asked to pay the right amount, feels like a thief if I don't.",
            "I hate places that serve Iced Tea and it's tropical or fruit tea. Like put that in the description then. Iced tea is supposed to be black tea. It's like if you order a burger and it has a chicken patty, I guess it's technically a burger but we all know that's not what people.mean by the word.",
            "OP, I spent a good amount of time managing at a probably similar place. That shoulder shrug wasn't to indicate time wasted, if was to indicate support for you and indifference to the customer's idiocy!",
            "1. Yup, stupid to argue about something that minor. \n\n2. I’m totally with that woman. I hateHateHATE that tropical shit! Especially when nowhere does it say it’s the tropical shit. And extra especially when I ask about it ahead of time and am not warned it’s that tropical shit, or they outright lie! “You said it wasn’t flavored!” “It’s not. Just a little bit tropical…” “THAT’S FLAVORED!”",
            "Reminds me of a time where there was a table of 6 people, clearly not from around. They ordered the spiciest sauce we had, and I put it into the system. They hated it. Said it had no taste, just spicyness. I know a couple tricks so I told the kitchen staff to remake the sauce and add a habanero and a taste sauce, that way it remained spicy but had a really pleasant taste. I had to put a dollar of jalapeño for them to prep it, and so I did. But to be nice I \"forgot\" add a drink, worth 2.50 at the time. They loved the sauce and I told them Its a sauce I enjoy serving. They asked for the check, and they werent happy a 15% applies to their table, and were pissed about how I had added a dollar of Jalapeño when they didnt ask to. I appologized, \"corrected\" the issue, and now their check was 1.50 more expensive than the first. They were pissed and demanded to know why it was pricier with the Jalapeño off the check. I told them I had forgotten to add the sweet tea that one of them were drinking and that correcting the issue helped me remember about. They had faces of regret. No tip, but that 15% paid for itself",
            "\\+1 for using the proper term 'poring over' instead of the incorrect 'pouring over'",
            "I don’t understand why they didn’t have to pay for both.",
            "When people order a cheeseburger without the cheese instead of just ordering a hamburger, I would ring it up just as they asked since it's a stupid way to order a burger and a cheeseburger cost more.",
            "reminds me of when i was a budtender. always a man questioning if i scaled it correctly. I would put it back on the scale and take off any hook up i gave them and give them their shit on the dot. they always had this stupid look on their faces lol",
            "These types don't tip well. Too many of these types these days. Revenge doesn't pay the bills.",
            "I don't know why, but your last sentence made me laugh a lot: \"The guy took another 10 minutes staring at the bill and probably felt like the biggest ignoramus.\"",
            "Weird. Most places I go standard soft drinks are all one price, and 'odd' flavors are more expensive.",
            "Why are they only options cheap or dumb?\n\nMost people are honest and not looking to screw people over.  I would have done the same thing as I just want to pay for what I consumed.",
            "Yeah, whenever a restaurant offers mango-peach-chutney-cactus flavoured iced tea I respond with \"I'll have tea-flavoured tea thank you.\"",
            "Idiot tax",
            "This reminds me of my wife's stories when she worked at a gas station. Dude would roll in, spend $50 on smokes, $15 on candy and $5 on gas on pump 5, so my wife would ring him up, set pump 5 to $5 and he would head out.\n\nHe would then proceed to come back in mad that the pump shorted him a nickel. Don't ask me how he knew that or measured it, but would demand it back. A reason she went on to nights was he would only come in on days. Always had to get her mgr to credit him.\n\nI heard that after she left, he moved on to weighing the hotdogs he bought and when one was lighter than the other, he would demand money back for being shorted.",
            "I honestly try to be the best me I possibly can when i go out to eat. I know waiters and waitresses lives can be really shit sometimes.",
            "Well, they did insist. ;p;",
            "I am super curious why a glass of tea is $2.75\n\nAs to why I ask, when did it get this high? If I go out, I have a cocktail and water",
            "Ok your tea sounds amazing! My fave ice tea is Raspberry Peace Tea",
            "Later when they need to call someone who cares, they'll be searching empty pockets for that quarter. How deliciously devious, haha.",
            "Anyone who spends ten minutes doing the math on an extra 25 cents are to ignorant to feel like an ignoramus. But that's a separate tragedy.",
            "I can see why they were particular about the flavor though. Any tropical flavor gives me a headache. It really sucked at camp when they served “bug juice” which was just Hawaiian Punch - that stuff always gave me a headache!",
            "Could have got an Arizona tea for $.99. Arizona does not give a shit about inflation.",
            "I honestly quit trying to be helpful for tables because it seems when I go outta my way to please, it’s not reciprocated.",
            "Funny story but the real crime here is a 3$ soda",
            "Ah, the froo froo tea. I'll take plain or lemon, no sugar either way, but the tropical passion crap, keep it.",
            "This is why I love that every single one of my friends no matter how well theyve done worked in service at some point. We just throw our cards into a hat and that person pays. If youre having a tough week no big deal throw your card in next time if you can. Shits so much easier.",
            ">Some people are particular about their iced teas. Ours has a tropical flavor,  \n\nI'd just like to say that iced tea is a specific thing. Way too many times have I ordered an iced tea and it has some shitty ass fruit or tropical flavor. If your iced tea isn't just black tea leaves steeped in water and served over ice then you need to list it as such on the menu.",
            "[deleted]",
            "I agree though, you should have regular iced tea.",
            "Iced tea or sweet tea? They are not the same, not sure who the heck prefers ice tea to sweet tea.",
            "I work in a pub and strongbow is £2.80 and a snakebite(half larger, half strongbow) is 2.65.\n\nthere are some people who like quite a lot of strongbow in their snakies and once someone asked to be charged with just strongbow because \"I didn't get a full half of larger so it's unfair to charge for it\". that was a fun shift",
            "I wonder I’d they legitimately thought a diet soda would be cheaper though. I know places with custom-made teas that are priced higher than the basic sodas. But I would’ve asked. 😊",
            "I don't doubt this, but i would absolutely ask to switch out the iced tea with the soda if I knew i should be paying more for the soda. Sounds like the decent thing to do",
            "Idk why people eat out if they can't afford it.",
            "If they'd further complain, you'd have the nailed on answer of saying he just payed a quarter to get a free life lesson.",
            "I remember my dad pointed out once that Costco rang him up wrong. We were getting supplies for a big family Christmas party so it was a huge order and the cashier started apologizing profusely and thanking my dad, upon which he realized the cashier had under charged him more than $100. He just laughed and said \"maybe I shouldn't have said anything\" before we left. Was a funny moment",
            "Soda was probably a lot cheaper for the business than the iced tea and was simply marked up for sales-purposes.",
            "I don’t make a stink about stuff like this, but I do point it out. I don’t want anyone to get in trouble",
            "I would think he will twist this in his mind that you personally screwed him over for the 25 cents.. \n\nNever realizing this is due to his being a pain.",
            "Then put the fact it is not just iced tea on the menu. If I order a coke and you bring me a cherry coke, it would be considered your mistake.\n\nYou could resolve this simply by telling customers when they order that it is flavored iced tea.",
            "I had stomach surgery, so any carbonation is out. If they only have caffinated tea, I do not want that after 5pm.  \nSo I started bringing my own herbal tea, with dried fruit.  \nI ask for a cup of hot water. But If the restaurant actually has herbal tea, I will get that.  \n    My tea pouch has herbal / Hibiscus  tea bags, Splenda, tiny tea spoons, and dried fruit.  ( you would be surprised at how many waiters do not bring a spoon.  )  \nMost of the time the waiter does not charge me for a cup of hot water. If I do not have a hot liquid before a meal, I am unable to eat.",
            "Tropical Iced Tea? Sacrilegious! \n\nThe absolute horror! I know some of my neighbors put lemon in their tea.  Personally, I don't trust someone who ruins Sweet Tea with lemon. But to go so far as *TROPICAL*? My heart weeps for someone working in such abusive working conditions.  \n\nI'm sorry, OP, after coming to from my swoon, I've realized the fact that you didn't boycott this restaurant, write an opinion piece to your local newspaper, start a petition against such blasphemy, get a lawyer to send them a cease and desist letter, and lobby your state government to make it illegal to serve tea that's been poisoned with unholy flavors, makes me not trust this entire post.  If this story were true, you'd have done all of these things and more, and you would've never have been there to serve such a depraved concoction.  \n\nSeek help, OP. You've been brainwashed.  You need professional care.  Don't worry, there is hope for you if you put in the effort.  Bless your heart, I'll be praying for you.  \n\n/s. (About everything but the Sweet Tea.  Sweet Tea should never have tropical flavor or lemon in it. It's got to be on the law books somewhere.)",
            "This is the way",
            "Proper use of the word ignoramus. Props and subsequent updoot.",
            "***NOBODY*** **LIKES RASPBERRY ICED TEA.** Just get rid of that shit already.",
            "Mm technically people usually get a free replacement and a Comp when they don't like somthing but idk",
            "I guess my experience in fine dining and luxury hotels precedes me lol but if I had a guest that ordered something unexpected/they didn’t like it I’d just comp it off the bill to keep everyone happy",
            "Well... let me tell you what I think of when I hear iced tea. A sugary soda (Canada) and not actual tea that has been cooled (in which my opinion in the iced tea department lands on the soda version). I'd be ticked too to receive something I wasn't expecting. BUT, I'd be happy to pay the mild price difference for a soda vs the tea you served.",
            "Honestly, some people need to dine only at home.",
            "😂😂😂",
            "you  are charging $2.75 for an iced tea? jesus fuck hopefully your establishment bankrupts.",
            "1+1=3 ? LOL",
            "I would complain about a drink I didn't drink too (if I missed that you didn't ring the other drink instead), and would be perfectly happy about the outcome to have to pay 25c more. I consumed it, I pay for it, totally fair, and not malicious for me. Some restaurants try to sneak in beverages no one had to make extra money, assuming no one would notice. We shouldn't let them do that, so if there's anything off with the bill we need to resolve the issue.",
            "Nothing is tackier than obsessing over a dinner bill",
            "> The guy took another 10 minutes staring at the bill\n\nhad me for the first half, but not after this my guy...",
            "If you had added the item to save me some money and then change it to the right one without telling me its going to be more expensive, trust me I dont cone back to the place. This isn’t malicious compliance, this is hating your customers and being a bitch.",
            "What a petty and unlikeable sub.",
            "10 mins to calculate 25 cents LOL",
            "Lol Tropical ice make makes it sound like you work at the Cheesecake Factory.",
            "Congratulations, you played yourself..",
            "Shit I’d complain over a 3 dollar drink anyway. Y’all are ridiculous",
            "~~ignoramos~~ ignoreanus!",
            "Love it"
        ]
    },
    {
        "post_id": "n339mn",
        "author": "myawn",
        "title": "Employer doesn't want me to waste 2 hours. They waste 40 instead.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/n339mn/employer_doesnt_want_me_to_waste_2_hours_they/",
        "score": 21019,
        "num_comments": 558,
        "created_utc": 1619949665.0,
        "selftext": "A number of years ago I worked for a small, fairly local outsourcing company. I was assigned to work with a particularly high-profile client of theirs. The client's office was just around the corner from my employer, but my employer insisted that I remain within their own offices to work, so the client provided me with a laptop to use that connected to their network remotely. It's important to note that whilst the client were decent, my employer had a totally fear-based management culture. The managers wanted eyes on the employees at all times because they assumed people would slack off given half the chance.\n\nAfter almost a year of working there, I got a call from the client notifying me that my client-given laptop needed some critical updates, and I would have to bring it in so IT could apply the updates locally. All sounded very reasonable to me. \n\nI brought this to the attention of my manager and advised I would be out of the office for a while so I could take my laptop to the client site around the corner for critical updates. No bueno. My manager ignored everything about the 'critical updates' part and focused instead on the 'out of our office for 2 hours' part. They insisted that they knew I had a remote connection to the client's office, so any updates could be applied without me needing to leave and take my laptop anywhere. I got the impression they thought I was lying to get some free time off. \n\nI decided that this had the potential to teach my employer / the managers a great lesson about not trusting their own employees, so like the model employee I was, I shrugged \"you know best boss\", and complied with their request, continuing working as usual. Until the following morning, when I switched on my laptop and nothing would work. The machine refused to connect to the client's remote network. The various software applications I used for my job also wouldn't run due to the lack of connection. Error messages flashed up on every file I tried to access, warning that my credentials had been blocked. I was left holding a very expensive brick.\n\nMy manager was livid when I explained I couldn't do any work. They clicked around on my laptop trying to fix it themselves, but there was no other solution to be had. They sent me around the corner to the client's office so I could hand in my laptop to IT. I took my time enjoying a coffee and breakfast in the client's onsite cafe whilst IT worked on my laptop, but when I went to check on it after an hour I believe the client IT manager's words were \"it's fucked.\" The critical update mentioned before was intended to repair something wrong with the way the remote connections worked. When my machine didn't get the update, it lost connection with the client's network and immediately locked me out of everything, effectively blacklisting my credentials. IT manager explained that they would have to build me an entirely new machine and set up new accounts, a process that would take about a week to ensure everything filtered through correctly and could be tested.\n\nThe client was fine and understanding about it, but when I returned empty-handed to my employer's office my manager got extremely snotty with me and insisted I still had to work somehow. I pointed out that I had no client laptop to work on, so instead of sending me home they forced another employee to share her computer with me. For the next week, me and my colleague shared her computer, one hour each at a time. As I had no access to any of my files, client data etc, all I could do was the barest minimum of work, sending a few emails from my colleague's account. \n\nAfter a week I got my new client laptop and things went back to normal, but the week of sharing meant my employer had lost around 40 hours of productivity from 2 employees. The shared pain of the experience with my colleague brought us closer together, and when my employer lost their contract with my client a few years later, she helped me get a new job with my employer's competitor. \n\nTL;DR: Manager doesn't want to let me out of the office for 2 hours to get critical updates applied to my client laptop. They lose 40 hours over the next week instead when my client laptop bricks itself.",
        "permalink": "/r/MaliciousCompliance/comments/n339mn/employer_doesnt_want_me_to_waste_2_hours_they/",
        "comments": [
            "Those kinds of managers are the absolute worst. If you can't hire employees you can trust, how can you run your business? Glad you got out of there.",
            "You could have got the client's IT to email your boss to confirm they need the machine. Your way was funnier though.\n\nI'm just imagining they spent the whole pandemic losing staff to other employers that support WFH while they insist people come to the office.",
            "I've only had people reporting to me a couple of times in my career, and none were hired by me - I was promoted, they were there already. But I've always started by implicitly trusting them to do their work. They were fine before I showed up, and if they couldn't be trusted, someone would have told me. Never had a problem. I just don't get micromanagers.",
            "This is a common issue in corporate environments\n\nClearly the answer is to return to typewriters\n\n/s",
            "Most people, most of the time, will perform according to demonstrated expectations. So if you treat people as untrustworthy, that is what you are cultivating!",
            "If you can't trust your employees out of direct eye sites for two hours either:\n\nA. You are so bad at identifying good employee during the hiring process, and are aware of that fact, you therefore cannot trust anyone you selected because you have no idea if they are any good or not.\n\nB. Your business has such a poor name in you industry that you can only attract shitty employees and are micromanaging to make up for your low talent pool.",
            "My boss and I conflicted over trust every single day. She ran the store and I worked under her running the shipments/stocking department. \n\nShe would create extra work to validate my staff was doing their job, but then not trust them to do the validating task itself. My staff had to read reports every 45-60 minutes then make decisions on those reports about putting out the right product. \n\nFor example, if we needed to put out 100 t-shirts today, if the report says we already put out 120 then stop, if it says we put out 80 - let’s put a few more out. \n\nI wanted to create a laminated poster in the processing area that said the targets. Then when they printed off the report they could just cross the category off and announce it to the 8-10 staff processing, and anyone who forgot the update had a quick visual reminder.\n\nMy boss created a spreadsheet that took 15 minutes to update and showed the +\\- of each category every hour. She did NOT believe in “training” in any way a normal person would. And scorned supervisors if while updating this report, anyone wandered from their station, including to use the bathroom or address a spill normally the supervisor would address. \n\nThis lack of training and added stress meant, my staff made MISTAKES! Who could’ve imagined! So now, *I* had to update this report and give direction based off of it. Every hour or so I’d take 15 minutes for the spreadsheet. Then she added that I had to go to the floor and validate the report (the company gives us based on data) was correct. \n\nThis once 3-5 minute task now consumed my entire days. I could go on and on about this woman and how unrealistic, unforgiving and controlling she was. But, I quit after COVID shut us down and I finally snapped into reality that she was psychotic.",
            "Outsourcing company that wont even allow their employee out",
            "Your manager is a wanker, and I speak as a manager. I’d love it if you could get a job at a place where the employees are trusted.",
            "...yeah doesn't sound like a good place...",
            "I had an employee come to me to say she needed a few hours one day to take her son to the dentist and would make the time up on other days. I said to please not bother me with details, I trusted that she would treat me fairly if I treated her fairly. Don't sweat the small stuff.",
            "For the want of a nail, the kingdom was lost...\n\nReally love those types of MC.\n\nETA: Thanks for the Silver [u/1\\_21-gigawatts](https://www.reddit.com/u/1_21-gigawatts)",
            "I had a boss like that. Wanted us out in the field meeting with clients and potential clients, but when we did she would freak out that we’d been out of the office. She’d come down to the parking garage screaming “where have you been?”  (It was on our outlook calendar and it was a client she specifically asked that I go see).  Sometimes she wouldn’t even let us go to the break room to get coffee because we’d be out of our seats for a minute or two. I never did understand how I was supposed to meet with clients.",
            "My boss always had a saying about competitors that cut corners in construction, because it was true over and over again.  \"They don't have time to do it right, but sure have time to do it over.\"\n\nWe were in an industry with a fairly substantial chance for error and do-overs (horizontal boring/directional-drilling), so we prided ourselves in not being the fastest but in getting the job done right the first time and thus had more jobs that met our original schedule and deadlines and allowed us to move on to the next job on time too, which mattered a lot.",
            "My local manufacturing company was in the process of switching ownership from the guy who started the business to his daughter. He treated his employees well and it was considered one of the best companies to work for in this small town. However, his daughter completely changed that. She had me install a tv that showed a live feed of all the cameras so she could monitor the employees. If you were away from your desk for more than 2 minutes, she'd bitch at you. She wants to get rid of all the breaks. She doesn't know anything about the industry but will try to make up policies yet they don't make sense or really slow things down. It'd be ok if she would listen to the people who have been doing this for years but she thinks she knows better. Some guys have been here over 10 years and I overheard some saying they're planning on leaving. 2 people quit last week. Their only IT administrator left last month.\nThey laid me off after I told them I was going to sue them for the money they owed me. They were having me work 50 hours a week and weren't paying me overtime.",
            "So you essentially were working for the client, right? So odd, what does your manager care what you're doing, as long as the client is happy and your employer is getting their $*x*/hr?",
            "\\> I decided that this had the potential to teach my employer / the managers a great lesson about not trusting their own employees \n\n&#x200B;\n\nI don't think they learned anything haha but hey you got a nice in-office vacation",
            "The funny part is that the reason they assume you slack off is that it is exactly what your manager would do himself, given the chance. \n\nIt took a few years to see, but everything your managers are afraid of you doing is the exact thing they do if they can get away with it.  Whether it's time theft, or actual theft, or \"working offsite\" to sleep off a hangover etc. \n\nThe second someone doesn't treat you like an adult (assuming you haven't given them a good reason for it) is the time to start looking.  It won't get better.",
            "They would have to build you an entire new machine? And new accounts?\n\nThat’s not how this works. That’s not how any of this works.\n\nConsider that maybe they told you that as a means to drive a point home to your boss. But in reality If your account were ‘blacklisted’ it would just have to be unlocked. As far as your computer is concerned, if what you’re mentioning is a lost domain trust relationship and this IT manager had no admin account built into your laptop with which to rejoin it, they should be fired.",
            "I love these stories.",
            "There are two types of employees. Ones you trust and ones you fire.",
            "IT guy here - I am suspicious that it took a week to install some updates and set up some remote software. Any IT dept worth their salt would be able to install a backup image of the entire hard drive in just a few hours. A clean installation of Windows takes about 20 minutes from a USB stick, plus another 20 mins to get all the needed drivers.\nI cannot think of any reason whatsoever that a job like this would take a week.",
            "Man when I was visiting the client I probably would have asked if they were hiring. Companies like this are the absolute worst and I hope the work from home Covid situation forces this kind of thinking out of the workplace.",
            "I'm surprised the employer didn't try to blame you for it and say you did it on purpose to get some time off.",
            "I could never handle a work place like that. Would be looking for a job else where immediately. \n\nHell at my current job other than saying hello in passing I spoke to my boss about once a month. Since then he was made redundant and now I don't really know who my direct boss is.\n\nThat said, I'm a senior engineer and just go in every day and do what needs to be done. Don't really need a manager other than to have someone for me to turn the screws on each year for a pay raise.",
            "About to be in a situation where to save a couple thousand a week we are going to institute a change that will result in lawsuits and people no longer doing business with us.  Probably cost us a few mill overall.\nIt goes into effect next week.  I’m think of being extremely sick because I seriously don’t want to deal with picking up the fucking pieces.\n\nI hate what my job is becoming. They keep promising to hire me so I can get benefits (contractor) so my wife can escape her shit job that DOES have benefits.  Not sure what to do. It’s becoming a prison camp and I’m going to become the enforcer.  Not sure what that’ll do to me.\n\nEdit: Just got an interview with the boss man there.  Maybe I’ll be there to watch the shit show after all.\n\nThe plot thickens.",
            "What a shitty manglement attitude. \n\nRespect to OP for handling it well.",
            "I’ve been super depressed lately.  So depressed that I haven’t checked my work email in over 2 months.  I go to work and end up staring at my phone for most of the day.  I actually was recommended for a new position somehow with a 30k pay increase and I’m such a piece of shit that I couldn’t even be bothered to fill the paperwork out.  My boss called me for weeks, probably emailed too, but I ignored her.  Finally on the very last day to do something about it I managed to call her and she made jokes about how she was checking the obituary and hospital records for me.  I was so late getting back to her that it was causing her so much extra work.  She still offered me the job.  It’s like I’m trying to sabotage my life but can’t even do that right.",
            "I love this story, but it pains me that I KNOW your ex-employer learned absolutely NOTHING from this experience.",
            "As the old saying goes, people do not quit jobs, they quit bad managers.  I love terrible bosses because it means I can always hire away good people.",
            "People usually don't quit a job, they quit their Managers.",
            "Sounds like a sweat shop.  Glad you got out of the place.",
            "This kind of management style sucks rocks for everyone involved, except for those in the throes of paranoia that formulated the policy to start with.  Passing the true cost back to them is the only *just* thing to do.  I'd like to say that it's the only way they will learn, but *I doubt they have that capacity.*",
            "Several years ago, I was looking to relocate with my family from the state my employer was in. They found out by somewhat unusual means (not me directly) and made the offer to let me work from home. They were pretty shitty as an employer, but the pay was good and I wasn't having any luck finding a job where we were moving to plus we had to wait for our house to sell. Keeping my job while we moved took one of the hassles off our list, and my husband already worked from home. My employer was paranoid already about people slacking and initially wanted me to spend my entire day on video just so they could see me at my desk and talk to me whenever they wanted. Umm no! Then they actually denied me a raise because by manager couldn't get past not seeing me at a desk every day despite my performance not decreasing. \n\n6 months after the move, I took a temp job and a 30% pay cut just to get away from this employer. \n\nIt didn't help them that they called me 13 times one morning that I took off for my daughter's first day of school because I didn't call into the morning meeting or their response to my having to take my cat to the vet to be put down.",
            "I ran a total of 90 hours lost to \"IT trouble\" with a laptop where I worked before it was replaced. Thing came with a graphics card that it turned out could not be told to stay away from certain memory addresses, and we used some 3D CAD software that \\_had to\\_ have exclusive access to those addresses. And the lockscreen that triggered overwrites could not be disabled as it was. At one point, a vendor rep tricked the IT trainee to let him take the laptop with him off site for \"further examinations\" which was a big no-no unless all intellectual property was properly scrubbed from the harddrive, and I was left without a PC for three days straight. But no blame was placed, because it was a \"teachable situation\".",
            "Speaking as an IT guy, this is totally par for the course and not surprising at all.\n\nWe have resorted to sending e-mails with huge red font saying if you don't get this update, you won't be able to work.  We send e-mails every week starting a month or so in advance, then we switch to every day for the last week or so, and we CC managers who should hopefully get their employees in line and tell them they need to get the updates done.\n\nThe amount of people that just totally ignore e-mails from IT is insane.\n\nAnd of course, when they can no longer work because they ignored our repeated instructions, they try to somehow spin it as though it's our fault.",
            "My boss used to be like this. With COVID making us all work remotely he’s loosened up because he realized that yes- we will do our work when not being micromanaged. \n\nGlad you got a new job!",
            "Manager's status report for that week:  \n  \n- Used creative problem solving to come up with an outside-of-the-box solution to a laptop configuration issue  \n- Maintained the affected employee at maximum billing given the circumstances.  \n- Improved employee cohesion by introducing pair programming techniques.  \n- Prevented significant loss of hours in previous billing cycle.",
            "The fabled private sector efficiency at work",
            "Reminds me of the time I worked in a bar in a clubhouse that was recently renovated so we had 2 managers on the floor. One of the beer taps went dry and the keg needed to be changed so I left the bar (there was another bar tender there working with me) to go down and change the keg.\n\nOf course one of the managers asked where I was going and i said that I needed to change the keg. She said no you don’t leave the bar ever - first I hear of that rule. She said I am to ask her or the other manager to change it. I went back to the bar and waited. I said nothing.\n\nThe customer was waiting for his beer for a solid 15 minutes until my manager came into the bar and she completely forgot about the keg. I HAD to remind her and she just goes oh shit and runs down and changes it. Had to give the beer for free to the guy of course. Imagine not trusting a bar tender enough to never leave the bar for something important like getting stock or changing a fucking keg.",
            ">IT manager explained that they would have to build me an entirely new machine and set up new accounts\n\nSorry to break it to you but PC hardware is not single use and you are totally getting scammed by your \"IT manager\".",
            "Too bad the client didn't call your manager instead of you for those 2 hours of updates.",
            "I once had the opposite experience, I worked for a relatively ok contractor but the client was complete garbage towards outsiders, ranging from waiting outside for the team manager to arrive and let me in the building, having to find a place to sit down and work everyday because contractors didn't get assigned a workspace, so I had to use the desks of people working from home (this caused me two days of working on a conference room and having to go work in the kitchen whenever they had it booked throughout the day) and the worst one was that I didn't have a keycard for the bathroom, so I had to ask other employees to come with me and swipe for me, since they weren't allowed to lend their keycards to external employees. \n\nNeedless to say I started on monday 10.45 (working hours didn't apply to managers so I was out on the sidewalk for almost 2 hours waiting, same for the rest of the week) and friday at 6pm I went to my employer and told him I refused to go back to that client ever again. He said his hands were tied, so I gave up my laptop and quit on the spot.",
            "Turns out I only enjoy these when the employer actually knows he fucked up. Unsatisfying",
            "Hmmm, i wonder how he would feel during all these WFH arrangements.",
            "You should have told the client you were being prevented from bringing them the laptop.  An having not done so, the client should have contacted you asking for the laptop again.",
            "Well played, respect 😊",
            "That's what they get for micromanaging and refusing to trust the employee they hired.",
            "*chefs kiss*",
            "I was imagining the shared computer to be like the hacking scene in CSI where two people were typing on one keyboard at the same time.",
            "I love these cuz it's clear as day that the manager has little actual experience with the tech industry and thinks their management background is all that matters. But, of course, I'm sure if his supervisor ever asked, \"there was no way this could have been avoided.\"",
            "If you work for an employer who doesn't trust their employees to this extent I suggest moving on ASAP. Normally people who don't give trust can't be trusted",
            "This is legitimately one of the dumbest stories I've heard in this sub yet. It blows my mind how stupid some people in this world really are, somehow they are always in authority roles. What a world.",
            "The \"I must watch every employee\"  type of management is from the 1940s/1950s type of management.  Old pictures of offices show bosses at the front of the room looking out at a cattle pen of their subordinates.  There were no cubicles to obstruct their vision.  Many had no phones.  If a phone call was required, phones were up at the bosses tables where the boss could overhear any conversation.  Unfortunately there are still insecure, dinosaur managers around today that think they have to look directly at people.",
            "My employees all work from their home and I don’t check their hours. They are all trusted and they all get their work done. Everyone is happy and we are growing every year",
            "Why don't managers listen to their staff? It's a theme running through MC and I've seen it in my own experience. It's really fuckin dumb.",
            "I feel you pain, here. I worked for an employer that was 8.5hrs from my home. I was hired to be a remote employee to work onsite at a customer that was 4hrs in the opposite direction from my employer. But, I was not needed onsite at the customer 24/7. So when I was not at the customer, I was to be onsite at my employer. And I was salary, but expected to work 40hrs a week and drive time from my house to the office was not considered work time. It sucked, I put up with it for 2 years until they lost the customer I was supposed to be working at and I was then laid off.",
            "I'd be calling the client and having a conversation around: \"Hey, want to hire me full time?\"",
            "Shocking how many companies know these prehistoric throwbacks are among the leadership ranks, yet refuse to either train them or clean house.",
            "This screams public accounting...",
            "I'm sure they still charged the client full time so no loss to your employer.",
            "Got to love educated idiots. \n\nMy plant manager wants me to run 3 departments but only give me staffing for one then gets mad when I report downtime or am unable to do work in the two departments where I have no staffing.",
            "Normally, account sharing would result in the coworker's account being blocked and a formal reprimand or even a \"not permitted to work for us\" being called..\n\nAccount sharing is a no-no.",
            "My old boss was like this. To be fair , there was a culture pushed in state agencies but she took it way too far.  We'd often work off the clock bc can't have ot. Wouldn't grow a backbone to fix staffing issues but would harp about too many people out of the office when we were community based workers who traveled all over the state , homes, school,  and court. She forced us to leave our doors open while talking on the phone about hippa related issues or to kids  and their parents about mental health. I got into a wreck as a passenger on the one day I had taken off but last minute worked. 2 spine surgeries later I'm disabled but it didn't have to get that far. Accommodations were ignored in office and there's no way theyd let me do notation at home part of the time so I didn't have to sit when it was super bad. They had zero issue with me doing my 24/7 on call work though. \n\nShe was the reason I finally got the official diagnosis for adhd. In one of her controlling moves , she moved me to empty first office.  Everyone walked past it . The copier, fax and other offices right there. The front desk phones and traffic.  One week in and I was about to lose it ..I couldn't fill out simple paperwork.  Luckily, it didn't take me long to find a doctor lol",
            "I think IT was bored AF or clueless, wat kind of \"critical updates\" were they dealing with? sounds like u just got locked out and the IT person didn't know how to fix it so they just went with the lets start from scratch process because thats all I know. Hope ur doing better OP, fuck those toxic employers.",
            "It doesn't take a aek to re-imagine a PC and set up a profile. It takes 2 hours, max. \n\nI do it daily.",
            " It would be nice if you and her ended up together. Reminds me of a similar malicious compliance post I read some time back",
            "Capitalism is so twisted ugh",
            "I don't get it, I feel that most of these stories originate from US companies is it that common there...",
            "But that's not malicious compliance.  It's.  Just.  Compliance.\n\nMalicious compliance is 'compliance with the letter but not the spirit of a request.'\n\nOP just did exactly what the boss said.",
            "Their IT was incompetent, that should not have bricked your device.",
            "What update would be required that the next day would brick the computer in terms of RDP? unless this was a client-specific software I have no idea how that is possible.  Also management was right and they should have been able to push that update remotely or at least jump onto the laptop through quick assist or something similar beforehand. There is a lot more here that we are not hearing.",
            "Remote desktop? There were a few updates that have broken this in the past. Easy fix over Teamviewer however. Not sure why they couldn't just remote onto it and sort it for you.",
            "Joined the subreddit because of this post, how's everyone doing",
            "The client's IT sounds incompetent",
            "> it lost connection with the client's network and immediately locked me out of everything, effectively blacklisting my credentials. IT manager explained that they would have to build me an entirely new machine and set up new accounts, a process that would take about a week to ensure everything filtered through correctly and could be tested.\n\nI think you are making up shit here....but cool story.",
            "While the manager part of this story sounds fine, the IT side makes no sense.",
            "Sorry but... somethings are missing in your post such as why an IT dept would perma-ban your credentials when a few keystrokes on their end would remedy that situation. I'm guessing that laptop was operating but ONLY your credentials weren't,  which means the laptop wasn't bricked, but instead your credentials were  denied to their gateway ... HUGE differences, that could be fixed remotely \\[since they would've had your hardware specs including things like your device-MAC media-access-address\\]",
            "[deleted]",
            "Whatever you gotta tell yourself to feel safe :( that's a huge deal. Or it takes 20 years. It is so embarrassingly cringe that I couldn’t, but 2 hours over several days adds up.\n\nYou should read this, it's very cool though my anxiety is getting me cause i think it's gonna fall off the face of overwhelming evidence.",
            "[removed]",
            "[removed]",
            "I'm surprised the employer didn't try to blame you for it and say you did it on purpose to get some time off.",
            "That is one weird security update.",
            "Gs:Wt..Great story, well told. Thank you.",
            "They won’t work until reality hits.",
            "Seems like this way of work is well almost everywhere",
            "Working in higher level IT i dont understand how a laptop could get fucked for an entire week, but the company I work for is not very large and fixing domain issues is fairly quick. \nThat being said I could see a larger company putting it on a list of to-do's for a couple days.",
            "Ha! This guy doesn't like memes",
            "I don't want a ticket.",
            "I mean that's true, but in CA you used to be able to show financial wherewithal instead of insurance.\n\nI think it makes sense.",
            "Gross. That place of employment sounds awful! Sharing a workstation? Wtf?",
            "I'm surprised that a client with such a strict/complex security scheme would allow an outside connection.",
            "> _They lose 40 hours over the next week..._\n\nAs usual, nobody even _considers_ IT's time spent building an entirely new machine and setting up new accounts.",
            "Having to share a computer like that would mean neither of you would have been productive so they probably lost at least 60 hours.",
            "That really doesn't make sense. The security software wouldn't just issue a permanent, irrevocable ban to a piece of equipment. The IT guy (or their security guy) should have been able to reinstate the connection once the update was installed.",
            "I would have tried to get out quickly working for someone like that. Managers like that just want to watch the world burn",
            "It honestly sounds like you worked in a cesspit.\n\nNo communication with client about issue. No written confirmation telling you not to get this done. Manager fucking around with client hardware given to you. \"IT\" at client can't reset a perfectly well functioning machine on their premises. \n\nHope you got out of there and found more meaningful work.",
            "A week to 'build a new computer' because of missing critical update on old one... Thats some high class bullshit right there."
        ]
    },
    {
        "post_id": "hal844",
        "author": "Terrahex",
        "title": "My Dad says he'll pick me up at dark? Well, he hasn't picked me up, so it must not be dark.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hal844/my_dad_says_hell_pick_me_up_at_dark_well_he_hasnt/",
        "score": 20966,
        "num_comments": 260,
        "created_utc": 1592372939.0,
        "selftext": "This happened about 10 years ago now, and I have a good chuckle about it every time I pass the place in my car. I'm a pretty meek guy, so this is probably the only rebellious thing I did in my entire teenage life.\n\nMy Dad owns a farm, and, being his son, this meant that I had a job when I was a kid whether I liked it or not. \n\nMostly I understood this, but that didn't mean I had to like it. I resented having to spend entire days of summer vacation, dawn to dusk, in a tractor when it came time to harvest alfalfa, which we did ~4 times between spring and fall. Basically imagine a teenager with ADHD forced to sit in one place for 14 hours, and you'll understand how it felt. Honestly, if I wasn't a total introvert, I might have snapped sooner.\n\nSo anyway, it's the second day of harvest, and it’s getting to be late in the afternoon. I've spent about 20 hours total in a haybine by this point over the past few days, and I ask my dad which fields to cut next, and I ask him when I'll be done, hoping (in vain) that I can leave and go play video games or whatever. \n\nThis is where the titular line comes in: \"I'll pick you up at dark.\" Little does he know that my little teenage heart is clenchijg with rightous anger for all this wasted (paid) time.\n\nSo several hours pass, and I'm understandably getting pretty irritable. It starts getting dark, and guess what? No sign of my dad. At the time, it was becoming a bit of a recurring joke in my family about how my dad was always late, so I knew I was in for the long haul.\n\nThen it occured to me, and the malicious compliance begins. My dad said he'd pick me up at dark, and he wasn't picking me up, so that must mean that it wasn't dark yet. And what *don't* you need if it's not dark outside? That's right. Headlights.\n\nSo I continue going back and forth on this wide, empty field, squinting as the light continues to fade after sunset and stubbornly refuse to turn on the headlights. I can easily see the edges of the field of course, but everything else is blending in pretty well. I start purposely amd accidentally leaving some sharkfins, which are what we call the mistakes that haybine operators leave between rows when the don't get any alfalfa. A few small sharkfins per field are fine, even expected, but these are on a whole new level.\n\nMy dad shows up after about 30 minutes of total darkness. I forget our exact conversation, but I do remember the result. After asking me why I didn't turn on the lights, and me telling him why, he laughed uproariously, and I still remember it fondly to this day.\n\nI mever did get any punishment. I'm not even sure he understood the extent of the missed alfalfa, it was dark after all and it was hard to see in the dim moonlight, but whatever, it was just a few rows. I, however, like to think he was a little proud of me, because I was the type of teenager who *never* got into mischief.\n\nI asked him about it recently, and unfortunately he has no memory of the incident. Oh well. I, however, will probably remember this little bit of malicious compliance fondly for the rest of my life. It might have been pretty insignificant, and motivated by laziness, but it was also the first time I really stood up for myself against am authority figure.",
        "permalink": "/r/MaliciousCompliance/comments/hal844/my_dad_says_hell_pick_me_up_at_dark_well_he_hasnt/",
        "comments": [
            "This story was adorably wholesome.",
            "Ah fuck that alfalfa! I love either now but I'll shake my fist at the next bunch I see on your behalf. I remember my highschool boyfriend getting up at 6am to inseminate the cows :/",
            "I came to a realisation a while back, that I shared with my dad - as a parent, we do what we can to teach our kids, raise them to do the right thing and be good people, discipline them where needed and have some fun with them along the way.\n\nOne thing we have absolutely no control over is which bits of their childhood will stick in their memory!\n\nI feel like I have forgotten whole swathes of time from when I grew up, but some things stick out and I will never ever forget them. Not even significant things really, and I know there are plenty of significant things that I don't remember.\n\nJust something I thought of one day while wondering if my son would remember something we did. I'll never know - I've now forgotten what it was myself!",
            "My dad raises hay, my brother raises hay, most of my neighbors growing up had hay in one form or another, and I worked at a dairy for about a year in college... but I've never once heard a swather called a haybine lol. I'm assuming they're the same thing, maybe you're in a different part of the country and have a different lingo or something lol\n\nEdit to add: I'm in northern California. When I say \"swather\" I'm talking about the self-propelled machine with a cutting header on the front that also drops the hay into a wind-row (windrow?). The thing that picks up the hay and bales it is a baler here.",
            "I think the best part of the whole thing is your dad was able to laugh at it. Makes it a nice, relatively wholesome memory for you.",
            "This reminds me of the time I managed to weasel out of doing yard work for awhile as a teenager.  I’m sure I had no good reason to be salty about being asked to mow the lawn, but was anyways.  \n\nWhen I was done it just looked so god damned good, like a work of art, that I had to sign it.  My parents watching from the picture window, perplexed as I continued to maneuver carefully across the already-trimmed lawn.  By the time they had realized my game it was too late, I had lowered the mower blade another inch or so, and you could clearly see my giant initials in the back yard.  Told me to cut it, never told me how to cut it.  How could I be begrudged some artistic flair?",
            "this was a very cute story.",
            "omgosh what a sweet fun story! im glad you have such an awesome memory to look back on",
            "that's awesome. My dad would default to dark=bedtime for kids. We're Canadian, so it got dark early in the winter. One day, I was sitting in the living room reading. Dad walked by, saw me, looked out at the dark window, and told me to go to bed. I still remember the sweet sweet satisfaction when I looked up and said, \"It's 7:30, and I'm 17. No.\" He looked at the clock, and kinda sheepishly walked away.",
            "This was sweet.",
            "That is a sweet story. It's funny how the most memorable and profound moments in a shared life are not the same for both people. I bet he has strong memories about you that you have no memory of.",
            "Oh to live on a farm where i get to stay in nature",
            ">After asking me why I didn't turn on the lights, and me telling him why, he laughed uproariously, and I still remember it fondly to this day.\n\nOh man,  usually I just feel schaudenfraude but this is one of the few times I can say an MC story warmed my heart.",
            "Man, I wish my farmer dad was at least cool about the forced (unpaid) labor I had to do. Nope, just angry.",
            "You have been banned from r/alfalfacare",
            "> After asking me why I didn't turn on the lights, and me telling him why, he laughed uproariously, and I still remember it fondly to this day.\n\nGlad your dad had a sense of humor about it.",
            "What an awesome memory for you though. It's funny how some things stick with you that others forget almost immediately. I was talking to my mom recently about this. When I was 14ish we'd gotten into a fight about something shitty I'd done. It was about a year after my dad passed, 2 years for her dad and I shouted \"my dad's dead!\" as justification for my behavior and she shot back \"so is mine.\" It stopped me in my tracks and made me realize that other people have things in their life that affect them too, and it's not an excuse to be shitty. It was a powerful, pivotal moment in my early teenage years and she has absolutely no memory of it. \n\nAnyway, good story OP!",
            "I follow some farmer YouTubers and I can see it definitely takes a certain kind of personality to be able to do that kind of work and for that many hours in a day.",
            "Well... in your Dad's defense: \n\nThe Universe never really does go totally dark! \n\nProvided you have the right kind of eye-ball color receptors, such as the infrared, and even the microwave. \n\nIn fact... the entire friggin place is constantly radiating at 160.4 GHz brightly in the color spectrum!",
            ">A few small sharkfins per field are fine, even expected,\n\nWe obviously had very different dads.",
            "All I know is, “Hey, Dad” and then, “Hay is for horses”",
            "Great one! I'm picturing the hours spent in misery until this idea pops into your head, and that eureka moment must have been a lot of fun.",
            "The funny part is that you were paid.",
            "For a malicious compliance post, this was oddly wholesome",
            "You're awesome, and so is your Dad.",
            "Worked for my dad as a teen as well.  Completely get it.",
            "I learned a lot about patience by waiting for my mom to pick me up. She was generally late, so so that she was referred to as, \"The Late Mrs. B, no she is not dead, just a little behind schedule.\"",
            ">I asked him about it recently, and unfortunately he has no memory of the incident. \n\nAre you sure it was your dad who picked you up in the middle of that dark field?\n\nI suggest you watch your \"dad\" closely. It may have been 10 years ago, but the Human Hunters are patient bastards.",
            "Ya that’s gonna be me bitch”",
            "Should be posted in mischievously-wholesome-compliance.\n\nYou really made me smile. Thanks man!",
            "First line got my hopes up for some serious compliance.  This happened about ten years ago now, and I'm still waiting",
            "*there's always a....*\n\n&#x200B;\n\npick one",
            "\"and I ask him when I'll be done, \"\n\nHow would he possibly know when you'd be done? Did you mean \"when will you pick me up\"? or something like that?",
            "I like your style of writing!",
            "Awwww!  Your dad is the best.  I grew up on a farm.  This would not have gone over well if I had tried something like this.",
            ">>honestly if I wasn’t a total introvert\n\nhonestly if I wasn’t a ~~total introvert~~\n\n\nHonestly if I wasn’t a farmers son\n\nFixed that for ya.  :)",
            "Can you explain what sharkfins are? Not understanding what “mistakes” look like",
            "I love it!",
            "This is adorable! \n\nMy pop and mom grew up on a farm and so I was raised with that same style of work ethic. With me it was house work. My parents are always remodeling something, and so I got to end up spending all day (paid) replacing flooring, patching drywall, working on the electrical, etc etc. I bet our parents would get along.",
            "Yep, I picked up along the way",
            "Hold up. British Museum coming for it. Lol",
            "Yeah , because he'll be packing A LOT in",
            "Yields, but not history books.\n\nI'm dead",
            "Also it's not like you have a link :(",
            "There's not even going to be delicious",
            "Is it possible that your dad has adhd as well? Since he is known for being late a lot (a common adhd trait) and you have it (genetics is a large factor in adhd).",
            "Probably not since he'll be insanely priced.",
            "I’m glad the story had a funny outcome but I was worried while reading that when you said you were driving in the total dark. I was like “Oh shit I hope someone didn’t wander out in front of him”. I mean, I assume you were in the middle of nowhere, but still...",
            "Dad: “I don’t mess up my rotation.",
            "Yeah , because he'll be packing A LOT in",
            "@OP, do you ever feel resentment towards your dad for that kind of life style?",
            "My first job (from about 15-17) was working summers on a family owned (not my family) golf course. We worked 6 days a week starting at 7AM so it deleted most of my summer free time with friends or what have you. Our boss's dad used to run the course and he was a hard ass and whenever we would go start work he would say \"We'll come get you when it's dark.\" We would just halfheartedly laugh for his sake, luckily it was never actually true in my case",
            "how much were u making tho  lmao",
            "dads suck",
            "I have ADHD so I can basically vouch for OP when he says sitting in one place for 14 hours is torture.  It’s like trying to keep an energetic, untrained puppy still, except much harder.",
            "you must be a blast to be around.",
            "[deleted]",
            "This isn't malicious compliance. This is teenage assholery.",
            "this post made me unsub"
        ]
    },
    {
        "post_id": "ahrn27",
        "author": "Amapel",
        "title": "Super religious family won't let their kids say \"good\" because \"only God is good\".",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ahrn27/super_religious_family_wont_let_their_kids_say/",
        "score": 20963,
        "num_comments": 962,
        "created_utc": 1547940371.0,
        "selftext": "So my roommate's sister is some kind of religious tyrant and apparently doesn't let her kids say common words and phrases including \"oh my God\", \"oh my gosh/goodness\", \"awesome\", \"good\", or \"great\". Because only God can be those things.  \nCue me being a bit of an asshole.  \nMy roommate and I went to his sister's house to drop something off and I made sure to use words like \"venerated\", \"sacrosanct\", \"sublime\" and \"pietistic\" when talking about the most mundane things. I got a couple of half-awkward smiles, clearly showing she had no idea what I was saying.  \nTL;DR A heathen with big words confuses overzealous religious nut.",
        "permalink": "/r/MaliciousCompliance/comments/ahrn27/super_religious_family_wont_let_their_kids_say/",
        "comments": [
            "I knew a family that didn't say, \"oh man,\" or, \"hey man,\" because they believed it meant Son of Man, a biblical/Torah term often understood to mean Jesus, son of Joseph.  \n\nThey named their daughter Mary and their son Micah.  The irony.",
            "This isn't even theologically correct. Christians believe that God is good, and his Spirit dwells in them. Therefore, through Jesus' death, every Christian has been made 'good'. ",
            "I can understand \"oh my god\" or even \"gosh\" being bad, they were in my family too. But awesome? Good? Great? wow, ",
            "My mum says \"oh my godfathers\" which might be an amusing workaround. ",
            "Don't tell her what a thesaurus is.",
            "Good, great, and awesome are banned?\n\nShe won't like Sonic Colours then.",
            "Old man here.  Times have changed. It use to be TV and radio wouldn't say God unless in the religious sense.  My Mother and church didn't want us saying God unless in the religious sense.  Some Jewish people will not even spell God.  \nAlso had a bunch of religious types telling me I wasn't suppose to say Oh my gosh or gollie (I don't know why).  Never heard the one about not saying good.  Always got me my church loving Mother would loose it if I said damn and some of the neighbors didn't want me to even say darn.  But, I could say any of the racial slurs I wanted.  My Mom said the N word even when I asked her not to up until the time she died.",
            "These people must think God is an idiot if they think he'd fall for that shit. They're like...competitively religious. \n\n\"Oh, you don't curse or use the lord's name in vain? Well *I* don't even let my family use any positive adjectives because they're reserved for God only!\n\nSo I guess you're going to hell, Steve. You fucking sinful piece of shit.\"",
            "I'm assuming this person has also banned the reading of genesis where God called his creation good?",
            "Not really related but since I watched sabrina I'm only saying \"unholy shit\" and \"oh my devil\" instead of the usual sacred stuff.",
            "Ironically, this is actually the *opposite* of traditional theology. In the Abrahamic religions, God technically *isn't* good or powerful or any other description like that, because God is beyond these terms, and they are not worthy of Him. God is ineffable, and these descriptions are only applied as an analogy.\n\nBy saying that these terms *do* define God, even if they find only God, they have actually *reduced* God and are committing blasphemy. Doubly so, considering literally the first thing God does in scripture is create stuff and declare it \"good.\"\n\nIn other words, this \"super religious family\" are technically heretics.\n\n---\n\nEdit: For a good example of this, here's a quote from Augustine, who basically defined all of modern Christian theology (e.g. trinity, original sin, the incarnation, etc):\n\n>>Have I spoken of God, or uttered His praise, in any worthy way? Nay, I feel that I have done nothing more than desire to speak; and if I have said anything, it is not what I desired to say. How do I know this, except from the fact that God is unspeakable? But what I have said, if it had been unspeakable, could not have been spoken. And so God is not even to be called unspeakable, because to say even this is to speak of Him. Thus there arises a curious contradiction of words, because if the unspeakable is what cannot be spoken of, it is not unspeakable if it can be called unspeakable. And this opposition of words is rather to be avoided by silence than to be explained away by speech. And yet God, although nothing worthy of His greatness can be said of Him, has condescended to accept the worship of men's mouths, and has desired us through the medium of our own words to rejoice in His praise. For on this principle it is that He is called Deus (God). For the sound of those two syllables in itself conveys no true knowledge of His nature; but yet all who know the Latin tongue are led, when that sound reaches their ears, to think of a nature supreme in excellence and eternal in existence. **(St. Augustine, [*On Christian Doctrine*](http://www.newadvent.org/fathers/12021.htm), Chapter 6)**\n\nYou likewise see this in Jewish theology, especially in the work of Maimonides, who championed \"negative theology.\" The idea is that God is entirely unified, since any kind of division in God would imply something superior to God to bind Him together. Consequently, terms like God's \"Oneness\" or \"Goodness\" are not really divine attributes, like the parts of God, but are rather just pointing out what God is *not* and is superior too.\n\n>>God's existence is absolute and it includes no composition and we comprehend only the fact that He exists, not His essence. Consequently it is a false assumption to hold that He has any positive attribute [...] still less has He accidents (מקרה), which could be described by an attribute. Hence it is clear that He has no positive attribute however, the negative attributes are necessary to direct the mind to the truths which we must believe [...] When we say of this being, that it exists, we mean that its non-existence is impossible; it is living — it is not dead; [...] it is the first — its existence is not due to any cause; it has power, wisdom, and will — it is not feeble or ignorant; He is One — there are not more Gods than one [...] Every attribute predicated of God denotes either the quality of an action, or, when the attribute is intended to convey some idea of the Divine Being itself — and not of His actions — the negation of the opposite. **(Maimonides, [*The Guide for the Perplexed*](http://www.sacred-texts.com/jud/gfp/gfp068.htm), 1:58)**\n\nThis also seen in scripture, as God famously introduces Himself to Moses as the \"I Am Who Am.\" (Ex 3:14)",
            "A malicious compliance with a sprinkle of r/iamverysmart ",
            "I read once that set theory in math is not included in religious homeschooling material. The reason is because set theory proves there is more than one infinite: infinite set of positive numbers and infinite set of negative numbers. In their minds only god is infinite, so set theory is not taught. ",
            "Cue petty revenge. \n\nAh the things we do for religion!",
            "This made me think of this joke:\n\nQ: What is heck?\nA: it’s the place that people go to that don’t believe in gosh.",
            "\"Hey, I like your new curtains, they're really kickass.\"",
            "I also learned some new words today",
            "A former babysitter of mine wouldn't let her kids watch Courage The Cowardly Dog because it has the word \"stupid\" in it.",
            "You almost got away with it r/iamverysmart",
            "/r/IAmVeryBadAss ",
            "As a fellow Christian:\n\n\n\n seriously, what the fuck",
            "I spent a short stint working for a family with a 1-year-old and a new baby.  I had been working there less than a month when the mother told me she and the father decided to stop saying things like, \"Oh, my gosh,\" and didn't want me, too, either.\n\nBear in mind, I've heard the mother say on many occasions \"Oh, my God.\"\nThat bothered me, but I didn't say anything.  And I avoid using that kind of terminology.\nIn my family, \"Oh, my gosh\" and \"oh, goodness\", etc. are perfectly acceptable, and I had been used to those sorts of phrases my entire life.  She didn't want me using even those.\n\nI only worked for that family for a couple of months.  Things got way out of hand.\nNot to mention, how do you tell your employer they're not spending enough time with their kid and that is why they're clingy, whiny, etc.  He was over a year old, walking, but he wasn't allowed to go up or down the stairs.  He was always carried.  I once tried to walk him down the stairs while I held his hand, not knowing he hadn't ever even crawled/climbed on them.  He was scared and wanted to be held.\n\nMeanwhile, I have nieces and nephews that once they're actively crawling, my mother teaches the babies how to crawl downstairs to minimize their risk of falling.  The babies are closely watched on the stairs, but don't need assistance, except to catch them if they slip or something.",
            "Try a \"By the smoking balls of Satan, is this meatloaf delicious!\" next time. ",
            "/r/iamverybadass meets /r/iamverysmart ",
            "I don't believe it",
            "r/cringe",
            "Reddit is a weird place.",
            "[deleted]",
            "At work we got a 9/10 survey because and I quote 'nothing personal but only my creator is perfect'",
            "part of me feels like this belongs on r/iamverysmart",
            "What is the logic here? Good is a description, not a thing. God is many things that we are also, by design we are meant to be those things too. What kind of theology does she adhere to?! ",
            "Just ask her, \"if you can't be good, then what are you?\"",
            "Had a youth pastor when I was younger who was like that. \n\nI just wanted to express how much I liked my chocolate milk get the fuck off my back, brother \"Danny\"",
            "As someone who was raise Catholic but is now mostly non-practicing/agnostic, these are the kind of Christians that drive me up a wall.\n\nAll I got out of religion class was \"don't be an asshole to other people, and a magic man in the sky will be like 'cool, you weren't an asshole, wanna hang out?'\"\n\nPeople like this are assholes pretending religion makes being an asshole okay. No, you're just an asshole...",
            "r/madlads comes to mind",
            "I'd come across this a lot working in a restaurant in a largely religious town. Some older guy told me a story about how he used to help fix up bikes for people or something, it was charitable, and I said \"that's awesome\", prompting a gentle lecture about how only God is awesome. I hate talking to people now. ",
            "A friend's dad is super religious and doesn't believe in Evolution.  She was talking about how good her nephew is getting at basketball so I said, \"he's evolving into quite the player,\" and I've never seen such instant death eyes directed at me before.",
            "That’s not being religious, that’s being insane. Keep a close eye on those kids because they have a very high potential for being abused. ",
            "Used to work with a lady like that once, she was married to a minister (one of the nicest guys I've ever met, even had him do my wedding ceremony). You couldn't say anything around her without her telling you that you were going to hell, sigh. Fast forward a few years and she dumped her husband and kids for some guy she'd been cheating on her husband with, bitch.",
            "My friend's mum once made him throw out all of his Gameboy games and the handheld itself (which he had bought with his own money) because they were made by \"Japanese heathens\". Ironic thing is that our Presbyterian school had themed many things after Pokémon because they knew it was something that kids our age would find relatable and attractive.",
            "Whoa buddy, sheathe that katana before you hurt somebody",
            "And God called the dry land Earth; and the gathering together of the waters called he Seas: and God saw that it was GOOD.\r\nGenesis 1:10 KJV\r\n\nBoom! They should probably read more.",
            "https://youtu.be/KWreHiN_E-Q\n\nHORY SHEET",
            "Wow Sarah this pie you made is omnipotent!",
            "I have heard he origin of the word Goodbye is, God be with ye.",
            "If I were in that situation, I'd probably just make it worse.\n\n\"That's pretty good.\"\n\n\"Don't say that, only God is good.\"\n\n\"Oh, right, sorry. That's pretty bitchin'.\"",
            "I’ve been a Christian for 25 years, met lots of other Christians over that time, and I’ve never heard any parents tell their kids they can’t say “good” or “great”. That’s just weird. \n\nTrue, “oh my God” isn’t encouraged because some would say it’s like using the Lord’s name in vain, or “misusing” his name. But I’m not sold on this either since “God” isn’t his actual original Hebrew name YHWH. I think your friend is either in some fringy cultish religion or just a very new Christian and taking certain things to the extreme because of spiritual immaturity (as I did once upon a time).",
            "You know, I'm not all that religious, but this makes you seem a bit more like a smug asshole than a maliciously compliant person.\n\nJust my opinion of course.",
            "GOOD! GREAT! GRAND! WONDERFUL!",
            "Sounds like heresy to me. https://i.imgur.com/lyTzuWb.png",
            "I mean, words _can_ have multiple meanings",
            "I use to know someone who wasn't allowed to say \"gee wiz\" because it apparently meant \"Jesus wizard\"... Whatever that means. ",
            "God himself says several times in the first chapter of Genesis in The Bible about his creation Being Good. ",
            "As someone with a Christian upbringing, with relatives in a similar boat as your roommate's sister - I love this.\n\nMy aunt's kids couldn't play that old silly kid's game \"slug bug\" where you hit each other when you see a Volkswagen Beetle - instead they played \"Hug Bug\". They weren't allowed to use red crayons, because that was the color of blood. They could play fighting games at friends' houses, but only if they played non-human characters, because hitting a human is wrong and the list went on. Oh god, the sheltered world they lived.\n\nKeep doing you, because it's good.",
            "You say heathen like it’s a bad thing. Lol",
            "As a child I had someone pull the \"only God is good\" thing on me after asking me how I was doing, and I've never said it since :/\n\nIt honestly really fucked my already touchy mental status up. Pretty messed up to pull that on a depressed kid in my opinion",
            "Aren't  the first lines of the Bible literally God creating the world and saying that it is good?",
            "Jesus Christ that's stupid.",
            "ughhhh religion",
            "I wasn't allowed to say \"awesome\" as a child. \n\nThen once when I was 4-5 I said \"oh my God\" because I had heard it on TV and didn't know I wasn't supposed to say it. My parents freaked out and yelled at me for hours. In the years following that if I ever slipped and accidentally said it I would cry, apologize to everyone around me (none of them were religious so they didn't care), and pray for like 20 minutes. \n\nNow I'm a gay, agnostic whore. Middle school me would be so proud. ",
            "In my exprience the more ridiculous the rules, the more likely they dont even read the bible. ",
            "In high school I was in a play and one of the actresses had a super religious mother who would go to all our rehearsals. I had a line where I walked into a room with a dead body and exclaimed \"Jesus Christ!\"  \nShe obviously took offense to this and demamded I changed the line to something else. Her suggestion? Yell out \"pizza\" instead. Not sure how that made sense, but okay.  \nSo, night of the play, I walk into dead-body room, and loudly yell \"pizza Christ!\" She...was not happy lol.",
            "Wanna mess with them some more?  Swap out \"Oh my God\" with \"Oh my Buddha\" and watch their reaction.",
            "You didn’t maliciously comply with anything. Also, those words wouldn’t be used to describe God but thing about him, so you didn’t even do it right. It would be weird to describe God as venerated.",
            "I saw the title and thought it was a joke on 3am jokes or something ",
            "Who even needs them, when she has \"lit\".",
            "This is double plus unbad",
            "Don’t tell them that goodbye is a contraction of “god be with you”",
            "Well it's 11:57pm Eastern. Just made the cutoff for the dumbest shit I've read all day. ",
            "What an absolute specimen of a chaotic good",
            "Fuck, that's brilliant",
            "Your roommate needs a smack upside the head. I think something didn't quite click into place right.\n\nAlso A+ for big confusing words! English major?",
            "Have them use fabulous.",
            "I knew a family who would call helicopters heavencopters.",
            "Aren't the very first paragraphs of the bible about how all of god's creations are \"good\"?\n\nThe light, animals, and all that shit.",
            "Probably based off of Jesus's interaction with the rich ruler. \n\nThe ruler referred to Him as \"Good Teacher\" and Jesus responded that no one is good except for God.\n\nThe issue is the word actually translates as \"perfect\" in the original Greek. But it sounds like this woman probably wouldn't care anyway. ",
            "But God saw what he had made and said that it was good. \n\nWhy are they ranking shit anyway?",
            " I remember a part in maya angelous book about her childhood, she said she was beaten by her grandmother for saying “by the way”, as in like “by the way, such and such said to tell you...”. Apparently that was considered taking the lords name in vain, because the lord is ‘the way, the truth and the light’. ",
            "Im not supposed to say “oh my god” in my house so I just say “what the hell” as a work around and it’s fine",
            "Super religious has nothing to do with this, they are just stupid.  Sure Good is good, but God has also made tons of good things in the world that we can refer to as good, otherwise there would be verses in the holy books stating only refer to God as good, otherwise it is a sin or blasphemy .  Which there isn't. ",
            "Reading this on my way home from church right now and I’m thinking \n“What a fucking idiot”",
            "She's right about 'Oh my God', because that's taking the name of God in vain, which is expressly forbidden by the Ten Commandments. But 'good' and 'great'? Really? Is she a puritan or something? ",
            "Out of those words, is say Sublime is the closest to \"blasphemy\". The God squad is a weird bunch, I don't get it",
            "weird form of argument... like\n\n if good then god therefore if !god then !good? or is it if god then good so if its good then its a god? or... is it more of the syllogism..hmmm... doesnt even make sense.  \n\n&#x200B;",
            "I wasn’t allowed to say “create” because only God creates. ",
            "Some Christians like to pretend that they have no thoughts or feelings of their own - they are mere vessels of the Holy Spirit. It's incredibly arrogant if you think it through.",
            "I use to say \"what the fudge\" a lot at home. That angered my mom so now I say \"What the fuck\" instead",
            "Let’s just conveniently forget about the fact that genesis says that God looked at what he created and “saw that it was good”",
            "Only God can be good?\n\nNo, people can be good. We all have that potential, that’s how He made us. That’s kinda the point of free will, it’s on us to choose either good or bad. But we all have the potential for good. So no, not only god can be good\n\nI’m an atheist\n\nI don’t think she understands the bible she thumps. Sadly that’s the truth for a lotta the thumpers. Ministers included",
            "Heck is where people go who don't believe in Gosh.",
            "Courage wolf pup meme: \n\nTop text: “Not allowed to say ‘Good’ because ‘Only God is good.’”\n\nBottom text: “So I used a thesaurus!”",
            "fake",
            "not malicious. pompous and mean, but not malicious",
            "These type of people shouldn't be allowed to reproduce",
            "Jehovah’s Witness??? ",
            "OH BOB SAGET!",
            "The youth pastor at my church tried this with Awesome.",
            "I do not believe this post needed a TL;DR \n\nTL;DR don't think TL;DR needed",
            "My grandfather said this",
            "Grew up in 3 denominations of the Christian faith. That was interesting.  \nOne telling you \"call no man father\", and the other, you addressed the priest as \"father\".  \nThen of course, being told by someone in all 3 faiths, \"You're going to hell because you go to that other church.\"  \nAnd despite all this, I still believe in God. People are weird.",
            "My mom got upset with me as a child because I said “darn”. Why? Darn sounds too close to “damn”, which I wasn’t allowed to say. Sure mom. That makes tons of sense. Nut jobs will be nut jobs, no matter their religious beliefs. ",
            "Or she just thought you were being an idiot for using overadequate language to describe the mundane... “ha ha why is he describing the table as pietistic???”\n",
            "Therefore my cooking can't be good, I suppose. ",
            "I don’t know what sort of mental gymnastics were performed to get to that conclusion ",
            "I mean. It’s useful if you want to discover better words to describe things other than “good” which does not always describe things well. But to say it’s only because god is good and nothing else is just a type of self mutilation. ",
            "Watch a season of Lucifer.  It kinda changes the whole Devil thing. ",
            "These crazy extreme bible thumpers are such batshit crazy hypocrites. ",
            "Wait till they hear about the word great. ",
            "OP needs to get scared at this house and audibly scream holy fucking Christ. 10/10 would pay"
        ]
    },
    {
        "post_id": "tkcsl0",
        "author": "TIL_eulenspiegel",
        "title": "\"Ma'am these knives are high-end...\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tkcsl0/maam_these_knives_are_highend/",
        "score": 20916,
        "num_comments": 732,
        "created_utc": 1647982243.0,
        "selftext": "This happened about 20 years ago. My most-frequently-used knife was an 8-inch chef's knife, but the one I had was of such crappy quality that I dreamed of the day when I would have enough money to buy myself a Real Knife.\n\nSo when I eventually got my first professional job, I got my finances all straightened out and  decided that it was time to make my big knife purchase. I waited for a sale, and then went to the department store. \"Back in the day\", that department store employed an older man who was their knife expert in charge of high-end knives. I chatted with him about the difference between brands, and while I was deciding, the old man went on break. He was replaced by a young rover from another department. I picked up my treasured choice and went to the checkout to pay for it.\n\nNow, the knife I chose was almost $200 at regular price but on sale for about $140. But the young guy behind the counter rang it up at $40.\n\nSo I said \"What? Did you say...\" and he interrupted me and repeated \"Forty dollars.\" I said \"I don't think that's right.\"\n\nHe pulled out a price list, pointed at an item and said \"See? Its $40.\"\n\nSo I smiled and pointed out \"That's says 'six-inch sandwich knife'.\" and he nodded uncomprehendingly. I held up my knife and said \"This is an eight-inch chef's knife.\"...and I was about to help him find the correct price, but he held up his hand in a rude way to cut me off and said **\"Ma'am these knives are high end. If you're looking for something cheaper you should try that section over there.\"**\n\nI was so shocked I just stared at him. Then I said slowly: \"So... the price for this eight-inch chef's knife is forty dollars?\" and he confirmed it, so I said \"OK!\" and paid for it. And left.\n\nAfter that I vacillated between feeling bad for \"cheating\" the old man, and wishing that I had grabbed a whole armload of fancy chef's knives for $40 each. But I've certainly enjoyed using that knife ever since.\n\nEdit: It's a Wüsthof",
        "permalink": "/r/MaliciousCompliance/comments/tkcsl0/maam_these_knives_are_highend/",
        "comments": [
            "This happened to me with a smartphone at walmart. Someone put the one I was buying in the system for like 100$ cheaper, i mentioned it at checkout, she said \"I didn't put it in the system, I just rang you up. That'll be \\_\\_\\_ please.\" \"If you say so ma'am\"",
            "If you point it out and they insist, it is your duty to accept! Nicely done!\n\nMy favorite knife is the cutting knife I inherited from my grandpa. I had to make a new handle (it was 70 years old when I did it)  but the steel still works great. I have no idea what the steel is, it can be a pain to sharpen but holds the edge great.",
            "Just had a similar thing happen with a snowblower.   But she was nice,  I asked about the price 2 times.\nAnd then saved 1200 on 2 snow blowers.\n600$ for 1800 worth of snowblowers",
            "\"Never interrupt your ~~enemy~~ [condescending, ignorant clerk] when he is making a mistake.\"\n- Napoleon Bonaparte",
            "When he rudely help up his hand, did you ask him to cut it out?",
            "You got it for a steel.",
            "You tried, their loss.\n\nIn the early 90's I went to a local larger electronics store to buy a cd player. I wanted a Philips CD910, paid my $110ish, then took the slip to the warehouse area so someone would go get it. They came back with the CD-i 910 which at the time was $599. This was the \"interactive\" that you could play games on.  I'll be honest, I walked just a little fast on the way out the door.",
            "Edgy story, pared with a strop of genius.",
            "This kinda thing happens to me regularly. \n\nBiggest one was a full refund for gaming PC components, about $1500 worth. No idea why. The money just went back into my account.\n\nI've had huge discounts on stuff, like 60%. \n\nI got a free mid spec smart phone once too coz the delivery was messed up so I ended up with a full refund. \n\nI also ordered a tablet and they sent 3 by accident.",
            "I like how your story cut to the chase!",
            "Reminds me of the time I bought sake from Target. The woman at the checkout counter refused to even scan it, insisting that they don't sell, \"hard liquor\".\n\nAfter about 5 minutes of arguing with her I told her that if she didn't want to ring it up, fine. I'm more than happy to take it for free.\n\nAfter that, she finally did try it and was shocked to find out came up in the system with the exact price I had read on the shelf.\n\nSometimes I think clerks are actively trying to give customers free stuff.",
            "Since our friendly Ferengi has not graced this story with their usual comment, I’ll step in for them:\n\nFerengi Rule of Acquisition: Ferengi are not responsible for the stupidity of other races.",
            "Very different, but reminded me of when I was very young, and I was buying a quality 6” chef knife for my mom for Christmas (my father was with me, or they may not have sold it to me). It was on sale for $100, which was my entire budget for her. When we got home, we found the clerk had given me a MUCH higher quality meat cleaver.",
            "Like the time I went to the home store to buy 3 pieces of lawn equipment. The regular line was backed up so she insisted I went to self checkout. Self checkout wouldn't ring it up. So I went back to the frustrated checker. She scans my items and the price seemed like bargain. I made sure to point out all 3 items, she snatches my card and rings me up. On the way out, the security alarm goes off. I walk back to her and she shoos me off and the security guard at the door tells me I'm good, just go and literally pushed me out the door. I get home and look at my receipt, 2 items. Weirdest bullies ever.",
            "Haha you tried to be honest! The rest is on him!",
            "You make me feel inferior for having only ever scored a free diet pepsi in nearly the same exact manner. The taco bell guy had the nerve to repeat the price like *I* was the stupid one.",
            "There used to be a chain of stores in the states called Service Merchandise which would cram the space with a single sample of everything they carried in the warehouse upstairs. The sample had a pack of tickets next to it for the customer to tear off and take to the register for payment and immediate delivery on a conveyor belt beside the register. \n\nOne of their sales offered a 50 round box of .22LR ammunition for $.99 each which you could buy by the box of 50 or a 10 box brick of 500 for $9.90. We decided to purchase two bricks, so we each tore off a ticket from the display and headed to the register in the back. We hand the tickets to the teenager standing at the register, who then rings us up for 20 boxes (two bricks) of .22LR ammo and a box of 12 gauge shells for $25 and change. We pay and as he is handing me the receipt the conveyor belt behind him roars to life. My roommate and I watch as three boxes appear near the ceiling, travelling in line on the belt and stop in front of the teenager. He stacks the shotgun shells on top of one of the other boxes, lifts it, turns and sets it on the counter in front of us and immediately turns around for the second box. After placing the second box on the counter. he looks up, smiles and says \"You guys have a nice day\", then turns and walks back to the register. We look at each other, pick up the two boxes of 10 **bricks** of .22LR and box of shotgun shells and casually walk to the truck, load up and leave with our 10,000 rounds of .22LR ammunition. I still have some.\n\nWe figured the person upstairs in the warehouse misread the order and sent us two boxes instead of two bricks. Who were we to argue?",
            "I got a fancy paring knife last year because i usually cut fruits for my parents and i, so I agree that fancy knifes are good (the fancy steel stuff not just aesthetics, this one is apparently made in Japan)\nEdit: knife type",
            "\"actually wait a minute, can you hold on to this while i go back to the aisle?\"\n\n*grabs 6 more to sell on eBay at $100/ea*",
            "I love how he thought $40 was expensive for a knife.  Yeah, $40 is the high end Walmart one, you could pay $500-$1000 for a single knife if you're looking high end.\n\nReminds me one time when I met a stranger at a party, I asked what he did and he said he was a PMC for Blackwater.  I had a feeling he was lying but went along with it and said it sounds dangerous, you must get paid well.  He replied \"You bet, $80k!\".  I had to not laugh because that was his conception of what a huge, life risking salary would be.  Blackwater PMCs make more like $200k at the time.",
            "Kid really butchered that sale.",
            "I had a similar experience at Pottery Barn, a place I largely avoid but they had these baskets I needed for a storage unit. I don’t dress fancy when shopping, I dress for comfort (jeans, sneakers) which means at I’m some ritzy stores the snobby clerks will look down their nose at me. \nI needed 8 of these overpriced baskets. The snob at the check out rang me up and I could tell she only rang up 4 of them based on the total. I said “I bought 8 of the baskets” she didn’t respond so i said it again. Then she snappishly and dismissively spoke down her nose to me “I KNOW you bought 8”. So I handed her my credit card and walked out with 8 baskets at a hell of a price. And frankly hoped they took the difference from her register but doubt it.",
            "I've had my Wusthofs for about a decade and they're still treating me great. The idea of getting one of those for $40 makes me drool.",
            "“Never interrupt your enemy when they’re making a mistake”\n\nArt of War",
            "Dumbassed himself to a lower sale. Good on you though for trying to correct him on the price. Most people wouldn’t.",
            "\"Ok then I'll only buy four.\"",
            "Not the........*Sharpest* knife in the drawer, eh?",
            "Given that he was SO knowledgeable about the product that he didn't recognize a high-end knife when it was right in front of him, and opted to rudely mansplain incorrect information to you, I would only feel semi-guilty about the $100 extra discount. You actively tried to get him to charge you correctly, and he cut you off. Sux to be him, I guess. Sux even more to be him if the store checks its inventory and realizes it was his sale that was goofed up.  \n\n\nHe was a dipshidiot, and I suspect he didn't last long in that job.",
            "My first best knives were a set of Wusthof, mom brought them from Germany, and they were great!  I still have them, even the one my EX husband tried to use to  separate frozen hot dogs , and broke the tip. \nHe is still alive, but the marriage is long over.",
            "Back in 2011, the last time I built a PC, I identified a list of components I wanted and I went to Canada Computers with some friends. Picked up everything for the PC, mouse, keyboard, power supply, processor, graphics card, all of it. Eleven or twelve items in total. I was expecting it to cost about $1200, since the processor was about $200 and the graphics card was $250 (weren't those the days...). $1200 was a lot of money for me at the time.\n\nSo I get to checkout and the young woman behind the counter, about my age (early 20's), tells me it's $1100. \"Really? I thought it would be a bit more than that...\" I say. She **very condescendingly** makes a show of counting the number of items on the receipt, and then the number of items in front of her. Okay, great I guess, I miscounted? I pay, take my stuff, and leave.\n\nFirst thing I do when I get home is figure out which item I got for free. As it turns out, I had miscounted - my actual bill would have been closer to $1400, but I got the graphics card for free. It's really hard to feel bad, because she was so rude about it.",
            "My husband has his eye on Wüsthofs...\n\nBut my mother lives with us and she absokutely destroys any knife she can get her hands on.\n\nHe has not shouted at her many times in the last 12 years... But the times he has were:\n\n1. Slow cooking tomato sauce in his beautifully seasoned cast iron\n2. Putting his carbon steel in the dishwasher\n3. Using her \"kitchen hatchet\" (yes. Hatchet) on his brand new end grain cutting board. She absolutely destroyed it. He opted to retire it as *her* hatchet board rather than have it planed down. (it looks like a woodsman had a go at it)\n4. Cutting on the brand new marble countertop with his brand new chef's knife. (Dalstrong I think? He refuses to pay more as long as she lives with us)\n5. Opening a can of condensed milk with a new paring knife\n\nYou might be sensing a theme here....",
            "My rich uncle insisted on buying something expensive from our wedding registry, so we ended up with a sick Wusthof knife set",
            "[deleted]",
            "Back in 2011 I was buying the 'new' Motorola Atrix 4G from my local Orange shop. They had a offer with the Work and Play Kit, £49.99, from £129.99, when bought with the phone. The contract I had was £x a month for 24 monty plus £200 upfront. When they scanned the Kit, my total went to £49.99, instead of £249.99 The assistant asked their supervisor what to do, \"That's what the system says... I can't change it, let him have it.\"",
            "Similar thing happened to my family, we got 1.5k knife set from Japan, but they didn’t give us any holder for it. So we asked them to send one, they sent us as other whole set of knives…",
            "During the Great Controller Shortage of Covid 19-21 the only available controller was a Star Wars themed rechargeable controller for 180$. I also got some snacks and the lady didn't even scan the controller and threw it in the bag. She looked me dead in the eye and said 20$. I paid and left.",
            "What kind of knife!? I have a few treasures of mine. Personally my 10 inch Shun sees the most action as I mostly work with boneless chicken. But I can't help but to love my 7 inch Amici hollowedge for pretty much anything else, at home or at work. \n\nI also love picking up a few more unique ones for either camping or having around. Like the Hanta from cookingguild. Good and rugged for outside!\n\nGreat steel either way! Don't feel bad, that man still got his paycheck. You just stumbled on a little bit of dumb luck. The other person being the not luck part ;)",
            "Unless the old guy owned the store you don't need to feel bad",
            "[deleted]",
            "Remember folks 20 years ago was 2002",
            "PHANTOM LIIIIIIMB!!!!!",
            "You have the same taste in knives as Phantom Limb",
            "Hey, if they say 200$ knife is 40$, and they repeat that status, then it's ok XD",
            "There's a really cute scene in the movie Chef where John Favreau's character, who is a professional chef, is in a restaurant supply.  He has his son, who is probably 9 or 10, with him and he buys his son a chef's knife because they are going to spend the summer running a food truck together. The scene is cute because Favreau tries to impart how important it is for his son to take good care of the knife and it will give him years of use. Come to think of it the whole movie is really great.  All star cast, good script, well shot and well edited.",
            "I had an issue buying smoke detectors are self checkout at Walmart.  \nI scanned one and it was fine, scanned the other one and it didnt go through.  \nTried a couple times and failed so I pulled out the one in the bag to sscan it and it alerted that the weight was wrong.\n\nIn comes old crabby lady, tells me to put it in the bag, I tried to explain that it only scanned one and the one I had wont scan.  \nShe yelled at me to put them in the bag.\n\nI explained i didnt pay for the second one yet but was interrupted as she grabbed it, put it in the bag and authorized it.  \nI again said I didn't scan the second one and she insisted I don't listen to professionals that were trained on these registers \n\nI paid for one at $45.00 and got one free.",
            ".....sooooooo. Money can buy knives????",
            "In that case, I'll take two!",
            "As a Chef, big C, this is so satisfying. I've spent over $300 on a single knife, and spent $50 on a boning knife worth nearly $200. Fucking love it.",
            "Haha. You tried to talk your way into giving him and extra $100. Glad that didn't work tho I bet!",
            "Now you know that when they eff up the price, and it rings up for a steal, that you quietly pay and go on with your day. The store is still going to make money hand-over-fist with the error, don't feel guilt!",
            "Shoulda bought 5 of them at 40 bucks, then come back and returned 4 for 640 bucks profit. \n\nOr just to give them back to the old man and let him know how dangerous his coworkers stupidity is.",
            "> Edit: It's a Wüsthof\n\nCrosspost this to /r/venturebros for free karma.",
            "My old roommate had a similar situation! I broke his 90/100 dollar vacuum cleaner, my insurance came up with about 60/70 dollars because it was a few years old. He wanted to get a reaaaallly nice vacuum cleaner  this time because he has a lot of rugs. So he bought some dyson for 500/600 dollars. But for some odd reason the dude behind the counter charged him only 80 dollars. \n\nMy roommate didn’t even say anything. He just paid and left. I guess it was the best outcome that I destroyed the old vacuum cleaner lmao.",
            "I own a case of LED Christmas lights for the same reason. On sale for $20! Great I will get one case. The clerk scanned it. One. I asked if she counted correctly. She said she got her GED and just because she didn’t go to no college is no reason to make rude comments. Who am I to be rude, So I paid my $20 and took home my 24 strands of LED lights.",
            "I bought a wusthof 8” chefs knife in 1989. Cost me $88au and I still have it and use it!",
            "Nice, this happened to me at Walmart once years ago. The dude ringing me up for a brand new PS4 controller and video game was too busy flirting with some girl next to the counter. He scanned the controller, but missed the barcode on the game and just put it in the bag. I tried to point it out and he just shot a look at me like he was annoyed I interrupted him while he was talking to her and asked me rudely what I wanted. So I said nevermind and walked out with the controller and free game in the bag. Thanks dude.",
            "I have a wusthof too, it's wonderful.",
            "my Wustof classic 8inch chef's knife is my favorite since 2002.  my husband recently got me a new Henckel....and it just isn't the same.",
            "Awesome bargain! I bought a bunch of knives second hand for $20, because one of them was clearly stamped Mundial. Another of the knives, a 20cm chef knife was sharpened to within an inch of its life, almost completely worn out but still better than anything I had cut with- when it suddenly snapped I took it to a knife shop to get a replacement. The lady looked it over and told me it wasn’t a Mundial, but a Wusthof, and for $8.50 postage they honoured their warranty and sent me a brand new one. I love it so much!",
            "Damn! I would love to get a Wüsthof for forty dollars. Go you.",
            "Reminds me of when I bought my suit before my wedding.\n\nGot my suit set ($450) and a bunch of other stuff for the groomsman ($250) and there were a few different sales going on. Different ones for pants, ties, and the suit itself. The cashier was struggling to get my suit to ring up and then something with manually entering the suit price meant that the sale code wouldn't automatically adjust the price.  She had a manager come over to void the mistakes and rework the sales ticket.\n\nAfter a patient few minutes of her frustrated tapping on the screen she turns and says:\n\n\"OK, got it all set, everything comes to... $275.80... does that sound right?\"\n\"Sounds good to me.\"",
            "\"Never interrupt your enemy when they are making a mistake\"\n\nSun Tzu, The Art of War",
            "Do \"high end\" knives really make a difference? I've just been running with my college set and using a whetstone, they've held up well so far.",
            "Bought a 100foot long contractor grade hose, it rang up for $10, it was supposed to be on sale for $40. The cashier knew something was up but let it go because that’s how it rang up.",
            "Love it! A block of Wustofs was also my first gift of 'real knives' to myself.",
            "I was at the store that takes returns and that starts with N and bought a pair of sunglasses. Tag said sale for $10. They rang up as $0.01. I should have bought more pairs but I was just happy the employee didn't care and I happily paid the penny and was out of there!",
            "If they are fucking up in my favor i just play right along with it. If they over charge I'll say something.",
            "is it possible he wasnt trying to be condescending, but was trying to give it to you cheaper by playing dumb? cutting you off and \"correcting\" you so it looks like youre actually buying the cheaper one so he doesnt get in trouble? curious lol",
            "It is a shame you didnt grab a few more.",
            "You absolutely should have stocked up.",
            "Never feel bad for those transactions.   \nIt's on the store to train their people.",
            "Okay, but what kind of a knife did you get? A Wüsthof fan wants to know!",
            "Yep, should have stocked up.",
            "While we’re on the subject… help, how do I sharpen and treat my chef knife correctly? I have a honing steel and one of those cheaper knife sharpeners my mother in law gave me and have been too intimidated to use. I don’t want to damage any of the knives in our set!",
            "I'm buying a chef's knife now! What do you recommend? I'm very much an amateur cook, but I can afford to splurge a little",
            "I audibly “Ooo’d” at your edit. A steal of a steel.",
            "Received ancient family heirloom kitchen knife that’s centuries old. Only replaced the handle and the blade and it’s still good as new.",
            "I don't have a great story like that, but I have warm memories of buying my first chef's knife (Henckles), which I still have.  Though I don't use it as much, given how large it is.",
            "I have a wusthof classic chef knife, it’s my favorite. I also have some more affordable wusthof gourmet steak knives.",
            "Wustof! Nice!\n\nI bought myself a set of two man Henckles 4 star and have been happy with them. Gotta take them in for sharpening because honing for the last few years seems like it's run its course",
            "Bought 8 lengths of expensive triple weave blockout curtain material on a big sale, about 18m total. Old wise clerk was partially assisting new and naive clerk through the process.\n\nRealised as I'm mental matching from the cutting desk to the car that they've billed me for 8m, not 18. Or: they billed me for cuts, not length.\n\nWent back to explain it and make up the difference, naive chick seemed on board but old wise chick (who rang it up) cuts her off and says no she did it right. Bit of back and forth, she goes \"oh I see\" and bills me another 2m worth.\n\nFuck it lady, I tried.",
            "Don’t feel bad that you circumvented the price gouging of corporations.",
            "Nope I would have grabbed 4 or 5 more.",
            "That username is terrific! I assume this knife-shopping escapade went onto your list of \"merry pranks?\"",
            "I checked.  Wusthof 8\" knives are now $100 to $350.  [https://www.wusthof.com/collections/all-purpose-knives/chefs-knives](https://www.wusthof.com/collections/all-purpose-knives/chefs-knives)\n\nI just bought a Kyocera ceramic knife and love it.  Great for chopping veggies.  Ceramic does not do well with bones or frozen.",
            "I had the reverse happen at an ordinary grocery store. I was in self-checkout and for the life of me couldn't find the bar code on a nice bottle of body wash. It should have been at least $5.99-$6.99.\n\n\n\nSo I hit the button for assistance and a young clerk came over. She said \"Ah we've had that issue before. When it doesn't have a price we just ring it up for $1.25\" I laughed, assuming she was making fun of the silly \"if it doesn't ring up, must be free! Hyuk hyuk hyuk\" joke.\n\n\n\nShe was serious! There was some code or procedure she followed and I got a massive discount.",
            "I love my Wüstof! Good choice!",
            "Love my Wusthof set! Good for you! I got a great price on mine bc I got them from my culinary program in college, they were included in tuition",
            "Yeah, if you've tried to clarify and they want to make an issue of it...c'est la vie. It's going to sting come inventory/reconciliation time, I guess (I don't know how they do that at stores, but I assume someone's going to notice a knife's gone but $100 is also MIA).",
            "[deleted]",
            "I feel like you really tried lol",
            "In that case... I'll take five please.",
            "I’ve had a Wüsthof for 6 months… I will never go back.",
            "I like the way you capitalized \"Real Knife.\"",
            "Nice. Just bought myself the same knife as an early birthday treat. Mine was a lot more than $40 though sadly lol",
            "I'd have told him right as I was slipping out the door.",
            "Fawkkk that's a steal ive been using my wusthofff for like 6 years",
            "I only use SHUN. The guy who owns a Chefs shop thinks that I am a chef. \n\nBought 2 Shun (3 knife sets) for actual chefs @ 1/2 price. \n\nBought a Shun block set (block , and all knives and scissors) for 1/3 of the price\n\nBought a bread knife Shun  1/3 price. \n\nWorth knowing people behind the counter. They always look after you with advice and price.",
            "You should have gotten a couple more",
            "I have this exact knife. I love it. Had it forever.",
            "I had something similar happen when I was looking for a smart-home controller, I had waited like 2 years to decided to get one, then found a whole stock mistakenly put in the clearance rack for $20 at Walmart",
            "I'll just be over here stropping my nenox sujihiki.",
            "I've never seen vacillate before, I thought you misspelled oscillate before I looked it up and found out it was a word! Thanks for expanding my vocabulary.",
            "I would have gotten 4. Becuase I really liked them at the high end and to put that pup in his place.",
            "\"Delicious Compliance\"\n\nAnd id cook anyone that tries to take my chef knife",
            "Had this happen when i helped my parents pick out a shower stall. It was 4 seperare packages and they all had different prices. The girl behind the counter scanned the cheapest one, and insisted it she did the right thing when my dad told her she had missed the other 3. So before my dad could say anything i kicked his shin to stop him, we paid 30€ for a complete stall and went on our way!",
            "this mindset is so interesting. at times people think the other party of the conversation is so helpless, that whatever issue they point out can only be attributed to being just useless. \n\nas a female software developer I've had some really entertaining moments, when someone's wrong and they just choose to die on that little hill.",
            "You're not taking money from the salesperson. You're taking money from the company.\n\nSo fuck em.",
            "Of course it's a Wüsthof",
            "Why didn’t you buy 2 and give one as a “Thank you” gift to the young guy for his work? He would have gotten the lesson of his life when the old man would have returned from his break.",
            "I just paid $140 for an 8\" Wüsthof.  So I guess if your knife was that price 20 years ago, I got a really great deal!",
            "You tried to correct him, if he’s going to be rude about it that’s his problem.",
            "You almost played yourself, but you came out on top at the end.",
            "Hey you tried! I’ll bet that knife brings you extra joy every time you use it too, I know it would for me!",
            "my sister has a similar story where she bought what originally would've been an at least 200 something dollar purchase into just 90 dollars because the guy probably had the wrong price but she didn't say anything about it, she just was happy to get an unexpected discount lol",
            "My last unironic\\* time in a Blockbuster Video, I was doing research on the Sistine Chapel for college, and I asked if they carried [The Agony and the Ecstasy](https://en.wikipedia.org/wiki/The_Agony_and_the_Ecstasy_(film)).\n\nHe loudly informed me (and everyone else present) that Blockbuster didn't carry porn, and I would have to go searching elsewhere for that.\n\n&#x200B;\n\n\\*^(the actual last time I was in a Blockbuster ever was the same store during the post-bankruptcy cleanout where all movies were one dollar, and I cleaned that store out.)",
            "If it's a mom and pop shop, or perhaps a farmer's market situation, or a small local business, I will insist on the correct price.  If it's anything majorly corporate, in the Top 500, or yes indeed a Williams Sonoma, and they ring up the incorrect price but in my favor, I simply keep my mouth shut and pay.",
            "Unless it's some small family run store I would never in my wildest dreams argue about a 100 quid discount",
            "I still have my Henckels from 1998. Going strong!",
            "I got henckle 5 star knives as a wedding present. I was in cooking school at the time and used Victorinex before that.",
            "I didn't know they were on sale. Goes back and gets 3 more.",
            "I got a free Xbox one in a very similar way! It was right on release and they only had like 8 at the local Walmart. I bought a ton of games and controllers for like $400 in total along with the Xbox, and when we went to check out the total was… about $400? We realized the Xbox was in the system for 0.00 so the cashier scanned it and didn’t even notice it was $0.00 because of all the other stuff we were buying. I was about to say something when my uncle just nudged me and said “don’t correct them… just smile and accept it”. So thts how I got a free Xbox One haha",
            "I'm so jealous of your amazing steal!",
            "Love my Wusthof knives!",
            "Love my wustof chefs knife.",
            "I also have a Wusthof and also bought it for about forty dollars. It was an honest deal though, the store had a going out of business sale.\n\nBut I have a hard time believing they'd sell at a loss, so maybe Wusthofs just normally have an insane profit margin.",
            "This happened to me a few years ago. I went into a store to buy my granddaughter a couple pairs of jeans. The girl rang them up & they came up at $7.99 a pair. I told her that can’t be correct, that whoever put the price in forgot the “2” before the 7.99. She went on to say they must be on clearance or something. I said Levi’s never go on clearance like this, especially in the fall. She insisted it was correct. So, I tried! I then told her to help the next person while I go back & grab a few more pairs. I grabbed every pair in my granddaughters size & larger. She was set for a few years!",
            "I uh... think that's r/deliciouscompliance",
            "Next time, finish that transaction quietly. Then ask if the rest of those same exact knives are the same price. When he says yes, but them all. And re-sell them.",
            "Damn!!! My mother in the 80s worked in the housewares section of a major local high end chain. Someone returned a block set of Zwilling J A Henkel knives saying I quote these knives won't stay sharp.  She was going to Sears a buy a set of Ginsu. Or such. Since they had been used she got them block and all. For a grand total of $1.00  top tier appliance stupid returns coffee not boiling toaster smelt funny when they first used it. One cause the cord was too short.",
            "Tbh I might have had him call the manager over and made it clear to the manager that he was undercharging me just so that he'd get in trouble if I was in a financial position to do so. If there's one thing I can't stand, it's someone being condescending to me when they're too stupid to realize they're the one who is wrong (I've been condescended to when I've deserved it, which is mildly annoying but absolutely fair and I'll own that. When it's not deserved but they're not actually wrong about anything, just a dick? Moderately annoying but I can walk it off. This type of situation though? If I have any way of causing trouble for them my petty side gets a Cheshire-like grin. I'll inconvenience myself just to do so because the satisfaction I get from it is priceless).",
            "The time that mansplaining ended up in you getting a great deal.",
            "He did it on purpose.",
            "I Wüsthof grabbed a few more!",
            "We bought not so expensive knives few years back and when I sharpen them they usually get blunt in a few months time but I must tell you, IKEA knives are staying sharp much longer, they are few bucks a pretty good.\n\nAlso when I see those street food videos from 3rd world country, they usually use some old knife which is properly sharpened.\n\nExpensive knives are not worth the money.",
            "At first it sounded like he was trying to cut you a deal until he said that comment.",
            "I have doubts here",
            "I had a wusthof and it got dropped. it shattered like glass.   \nMMMMMM quality."
        ]
    },
    {
        "post_id": "ez4brx",
        "author": "KadahCoba",
        "title": "Jerk vendor gets pissed for being paid a day late, takes us to court, wins and gets ordered to pay us $200",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ez4brx/jerk_vendor_gets_pissed_for_being_paid_a_day_late/",
        "score": 20894,
        "num_comments": 398,
        "created_utc": 1580879857.0,
        "selftext": "This happened at work some time ago.\n\nVendor is legal services company we are required to use with one or two of our clients. We'd prefer anybody else as they are pretty slow, expensive, and have been jerks to us for years, apparently because we have the audacity to not use them exclusively.\n\nWe missed paying one bill for this vendor on a case, likely got misplaced in to the wrong stack. As soon as we noticed this the next day, we paid it. Even hand delivered the check to their office.\n\nIt was a few days later they call us, demanding that we need to also pay the court mandated late payment fine. These vendors are to be paid for their service within x days of date it was rendered or there is a fixed small fine paid to the vendor.\n\nBy this point we figured out that in our rush to pay them that other morning, we accidentally also mailed them a second check, paying them twice. We tell them this and to just consider that the fine payment. They did not care for this and that they were going to take this to court to have a judge make us also pay them the late fee.\n\nWe agree, because \"this is going to be funny\", and get a hearing date calendared.\n\nIt ended up being a 5 minute hearing. The judge agrees that we need to pay the fine since it was indeed paid late, but because we had accidentally paid them twice already, he orders them to pay us back the difference of $200 and some change. Judge then spent the next 4 minutes berated them for being petty.\n\nSo instead of getting paid double, they needed to be jerks and spend time and money for their lawyer to go to court for five minutes to then be ordered to pay us back most of an over payment.\n\nEdit for clarity since there were a lot of similar comments:\n\nLegal bills are separated by case, client, copy job, etc, and not one single bill for everything at the end of the month. This is because everything gets expended up the chain and the money will come from various accounts, because insurance. So for this vendor, we had paid x-1 of x bills, where x could be anywhere from a few to several hundred.\n\nThe actual amounts of money here are trivial compared to our billable hourly rates. This is what made the whole thing even more silly.\n\nThe check that got mailed was likely automatically generated from our billing system, which probably means that that specific bill came in late to us. We manually made the check that was hand delivered. This entire thing really didn't matter and wasn't worth any effort to figure out what exactly caused it happened as something like this happens maybe once every few years.\n\nAs I understand it, this particular fine here was a recent regularly change because some of them were not getting paid for years and the entire process of them trying to get paid was one many leaking holes in this system. One of the lawyers explained it to me in excessive detail, but I have mostly forgotten all of it, that was months ago and not something that even evolves me. lol\n\nThey did not sue us over this, it was something like a procedural hearing. I'm not a lawyer, I don't know the correct terminology here. It was still a laughable overstep by them as what they did is the sort of thing for when you haven't been paid for months/years, not 12 hours.\n\nWould be nice it there was similar regulations on our bills to clients. Its pretty much our industry's standard for the last several years where every bill is automatically cut 15-20% by 3rd parties handling \"bill review\". Often takes 2-6 months to get mostly fully paid. if you'd worked in medical billing before, you likely know this sort of thing well.",
        "permalink": "/r/MaliciousCompliance/comments/ez4brx/jerk_vendor_gets_pissed_for_being_paid_a_day_late/",
        "comments": [
            ">have been jerks to us for years, apparently because we have the audacity to not use them exclusively.\n\nHow to ensure that you become an exclusive vendor? \n\nTake the client to court over a petty issue. Yeah, that should do it.",
            ">  this is going to be funny\n\nThe best reason to go to court",
            "what if someone working at that vendor hates their job and was doing their own malicious compliance? Like \"Boss says we gotta get our court ordered fine, we're up $200 on this but if he says we gotta go to court over it, I'm gonna take it to court, have fun paying a lawyer and $200.\"",
            "[deleted]",
            "drop the clients that require that vendor",
            "\"Thanks for taking us to court! Feel free to do it again any time!\"",
            "How not to piss off a judge: don't waste his time.",
            "True, but someone with a business relationship with your client just sued your company. I'd raise the issue with my client at the very least",
            "OP doesn't tell us what jurisdiction this is under or what happened about costs but if payment has been demanded and paid, as in this case, even if it was initially by accident, I would expect the judge to rule that both sides' costs be paid by the plaintiff and quite possibly fine them for wasting the court's time. Also, as this clearly took some time and they had not refunded the overpayment, I would expect interest to be awarded.",
            "Missed payment and then paid them twice?\n\nYour company needs to get their shit together.",
            "Must not have that many clients if they have the time for this nonsense.",
            "I'm hungry and had food on my mind, so when I first read this title I was wondering why a jerk chicken street food vendor would be taking someone to court.",
            "Man some people are dicks",
            "Review the contract that your business has with the vendor, and anytime they breach the contract, call them out on it.  If they want to be petty about being late by a day, then be petty with their slow, expensive, and jerkish way of doing things.  Once a fire is lit under their butt and they start to complain, point out that you have been very tolerant in the past, but then the one time they could have shown tolerance, they didn't, so now they are getting a taste of their own medicine.  I'm sure they'll agree to be a bit more lenient in the future of mistakes made on your end.",
            "Seems like their legal counsel is running the show.",
            "i would bring up this petty nonsense with the client as well",
            "When I saw “jerk vendor” I immoderately thought of *the jerk store*",
            "When I read the tagline I thought is was a vendor that was providing Jamaican jerk...I think maybe it's sort of like BBQ but I have no clue, LOL I see the Jamacan Jerk sesoning so ??? \n\nBut anyone that comes out on top on a  dispute with lawyers is getting my respect!",
            "… and they did not see that coming how? Pettiness aside, that is next-level stupidity.",
            "So, they just paid you back money they had already received from you?\n\nGuess the only real loss was the money they paid their lawyer",
            "Why on earth would they cash the second check and still try to take you to court?\n\nThat's insane.",
            "This is a legal services company? Is there any way you could talk to the clients and show them this utter stupidity so they reconsider requiring you to use them?",
            "Wouldn’t it have messed up their books to cash a check for more then they were owed? As in, be something close to fraud? If I had a business I wouldn’t feel comfortable taking over double what was owed. Going to court over it is silly, but I’m gonna bet you were a jerk and refused to pay the small fine separately.",
            "Smart lawyers try their best not to sue their clients.",
            "AND court fees usually",
            "*Every* time I pass this post I read it as jerky vendor. So...idk there's that.",
            "My first thought when I read your headline was why would you pay for jerk chicken a day late?",
            "Tales of a Junktown Jerky Vendor",
            "Win stupid prizes",
            "Hope you were able to remove them from your vendor list for future.",
            "I read this as Jake Verndor and thought who the fuck is that.",
            "Wouldn't your company have to pay the court fees tho, since they won?",
            "I read the title as Jerky Vendor and now I can't get the image of a salty salesman with fists full of jerky screaming.",
            "I can’t believe OP can’t manage a business, not paying people on time, and sending them double checks by accident, and has the audacity to come here and call them stupid? My god! What has happened to reddit???🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️",
            "Click baity title makes you think that they had to shell out their own money when you just paid them 2x",
            "I'm sorry but your stories a little fishy I'm going to guess this isn't actually the 1st time you've paid this vendor late and the fact that he still had to take you to court to get you to pay the late fee tells me you guys are not being as good as you think you are.",
            "WHAT that’s pissed me right off.",
            "Be under 200 at the end haha",
            "Those guys are going to go out of business eventually",
            "Sounds like something my boss would do to one of our customers for not exclusively using us lol",
            "[removed]",
            "You know the old saying.  A day later and $200 short.",
            "Should have immediately required your clients to choose a different legal services company or lose your services.",
            "https://youtu.be/ub-H21OiepE?t=344",
            "Not only missing the billing deadline, but then paying it twice raises some red flags. I feel like exclusivity is probably not as high on their list of annoyances as your organizational policies from the sound of it.",
            "Cool... And the part of the story where this wasn't your first time doing this to said vendor?",
            "> We'd prefer anybody else\n\n\n\n\nAnd\n\n\n\n\n\n> we have the audacity to not use them exclusively.\n\n\n\nWhat?",
            "Capitalism sucks. What can you do?"
        ]
    },
    {
        "post_id": "v6akfb",
        "author": "WhoSc3w3dDaP00ch",
        "title": "Forget everything about this place? A malicious compliance over a decade in the making.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/v6akfb/forget_everything_about_this_place_a_malicious/",
        "score": 20890,
        "num_comments": 606,
        "created_utc": 1654541268.0,
        "selftext": "TLDR: CEO of old company cheaped out on client solutions and employee compensation, tells me to forget everything when I leave. Over 10 years later, tells me to help him with the same clients, but I forgot everything since then...\n\n\\--------\n\nMany years ago, I worked for a little company. CEO was a miser of the first order.\n\nWe needed image hosting for a large client account, and CEO was unwilling to pay for maybe $2-3k in annual, image-hosting fees at the time (even though the company made millions off of the deal). Me being an enterprising individual, I figured out a way to host the images on flickr.  I saved the login information in a physical notebook and kept informing them that this is a \"house of cards\" and we really need o switch to a professional service.\n\nSeveral months later, I was promoted and asked for a raise to go with my promotion. CEO said no (all promotions and raises required CEO signoff).  I tried negotiating, but CEO said no, and to leave if I didn't like it.  So I left. CEO told me to \"forget everything related to the job\" here and he'd sue me if I did anything with the client accounts afterwards (i.e. sabotage or steal clients).  I told him I'm leaving all my knowledge behind in the notebook in my final email to him, my manager( and bcc'ed my personal email). In this email, a full inventory of what I left behind (invoices, contracts, etc.) including this entry:\n\n\"personal notebook - account notes and reference materiel (including image hosting logins) for \\_\\_\\_\\_\\_\\_\\_\\_\\_ accounts - KEEP FOR REFERENCE\"\n\nRecently, I received a \"professional networking site\" message from CEO, telling me to help them with my old accounts or he'll sue me... Apparently, Flickr changed their terms of service and the images were deleted. In over 10 years, nobody updated any documentation, or the image hosting...  nobody bothered checking the email account either (that was used to log into flickr account).\n\nI told him that I cannot help. Per his request, I forgot everything I knew about his company and anything I knew was in that notebook I left him over 10 years ago.\n\nSeriously though, I don't remember what I had for breakfast, technical details from that long ago...I just laugh.\n\n&#x200B;\n\nEdited to Add: Thank you all for the awards, and messages. I can't possibly respond to all of them, but I hope you all enjoyed the absurdity of it. ",
        "permalink": "/r/MaliciousCompliance/comments/v6akfb/forget_everything_about_this_place_a_malicious/",
        "comments": [
            "That was very nice.  I love the constant \"I'll sue you\" threats.",
            "“Promoted”=More Work, No Further Compensation \n\nI need more than a title if I’m gonna accept more responsibility.",
            "Oh hell, the bogus “lawsuit lawsuit” crap would make me dig my heels in. Well done and fuck that cheapskate",
            "Ohhh, man I used to run a CNC laser that cut metal tube and structural sections. I had pages and pages of settings saved to my phone, things I'd learned over a couple of years to make the machine run perfectly, diagrams I'd made to help make parts come out perfectly. \n\nThey hired someone, paid him more, wouldn't pay me what they paid him even though I got called on my days off with questions about the machine. So I gave a notice. I was fired the next day. I hit the E-stop (machine loses that part if nobody saw which line the program was on) and left. \"I don't work here and don't know what any of this stuff is. I'm stopping the machine so it doesn't run unattended\" And bailed. Deleted all of the information about that machine from my phone when I got home.\n\nThe other operator quit a bit later. So they had nobody to run their specialized machine. They called me ~six months later and asked for help, I just refused.\n\nEDIT: To the people who are saying I should have charged them for the information - I literally didn't care. I was leaving that job for a life-altering increase in pay, and watching them flail and flop was worth as much as I could have soaked them for to solve their problems.",
            "Hell, I've had that happen while employed at the same company.  \n\n\nHey Otter, you used to do this, help us!  \n\n\nThat was 2 years ago, I fully documented it all before I transfered to my current position.   I know I documented that particular process.  \n\n\nWe lost your documentation.  \n\n\nI emailed it 10 different folks, NONE of you still have it?  \n\n\nErrrrr  \n\n\n\\----------------\n\nAnother one, I was on vacation.   And my pager (yes I'm old get over it) starts going off, with a number from NYC, I'm from California.   I ignore it.   It finally shifts to 911-number.  \n\n\nI find a phone call the number, get hung up on the first time.   Start the 2nd call \"911 page to this number.  I'm Otter, what's the emergency?  \n\n\nTurns out one of our sales droids is at a conference and the demo machine is messed up and I need to fix it.  \n\n\nI can't \"fix\" it remotely is has no internet connection.   Have you tried the documented steps in the book that should be with the computer?  \n\n\nWhat book?  \n\n\n{sigh}.  Did you read the note in sharpy on the top of the computer.  \n\n\nWhat note?  \n\n\nThe one you see when you open the cabinet.  \n\n\nOHHH, and there's a book here too.  \n\n\n{facepalm}. What does the note on the computer say?  \n\n\nWhen in doubt, turn the computer off and back on.  Wait 5 minutes.  Then run the demo again.  \n\n\nFor interupting my vacation, you owe me lunch at {fancy restaurant near our office}.  \n\n\nOn both of us returning to the office,  sales droid denied owing me lunch.",
            "Should have just responded with \"Who are you?\"",
            "at a minimum you should be changing ALL passwords known to an employee when they leave. even on good terms. it's just good sense. ideally you have everything linked back to their single sign-on and can deactivate it in one click.\n\ntheir lack of planning is very much not your problem though",
            "I imagine he threw out that notebook 1 day after you left.",
            "Asking me to remember stuff from 10 years ago was fun for my security clearance background check. Only reason I had all the addresses was because they were listed in my most recent credit report. Otherwise, I wouldn't have been able to remember them all.",
            "[deleted]",
            "[deleted]",
            "I'm kind of expecting this to happen to me at some point. When I left my last company, I made sure all my research was left on the company drives and emailed the owner with an excel sheet of passwords. Same kind of house of cards scenario. On more than a few occasions, I even offered to train my replacement, which was always declined. Basically, I left them with probably a 25gb data dump that nobody else in the company was familiar with. Fuck em...",
            "What in the hell makes that idiot think he has grounds for a lawsuit if you don't help him with a job you quit ten years ago? Some people need to be brutally ripped out of their jobs and slammed into an asylum.",
            "Oh we gotta know how he responded to that, if at all.",
            "You should have told him to go fuck himself too while you’re at it.\n\nFuck that guy and his lawsuits",
            "I love how he's cheap yet is willing to hire a lawyer to sue you. Is the lawyer gonna be pro bono or from a free law clinic? Or a student in law school. Lmao",
            "I absolutely love the CEO's logic here.\n\nOP receives a promotion, but isn't valuable enough to receive a raise with the promotion. If OP doesn't like the increase in responsibility that comes with the new job title, they are free to leave. BUT if they leave, we need to threaten to sue them if they talk to any of our current clients or try to steal any of our clients or basically talk about anything regarding our business. \n\nA *logical* person would read that last sentence and realize if OP's knowledge of the company and their clients is so valuable it requires a legal threat to protect it, OP is worth a raise and keeping around. The CEO's complete lack of logic is ultimately what screwed him over in the first place.",
            "This reminds me of the Mitch Hedberg joke;\n\n“I saw a commercial that said ‘forget everything you know about slipcovers.’ So I did, and it was a load off my mind. Then the commercial tried to sell slipcovers, but I didn’t know what the hell they were.”",
            "Forget everything from 10 years ago? I comply with that order every day, maliciously or not!",
            "Stalking a former employee 10 years later, requesting them to work for free, threats... The nerve!",
            "[deleted]",
            "new phone who dis?",
            "I am so fucking annoyed on your behalf",
            "There might be some things that I remember from work 10 years ago but it's going to cost a LOT for me to recall them on demand.",
            "I always ask for the lawyers details.\n\nThen send through dumb question 1 at a time seeking clarification.\n\nThey bill the client ever time they open an email.\n\nReverse that shit real quick",
            "Tell him if he ever contacts you again, you will sue him for harassment.",
            "> he'd sue me if I did anything with the client accounts afterwards\n> \n> help them with my old accounts or he'll sue me\n\nI did the math, and you're getting sued no matter what. Let us know how it goes!",
            "I've left a couple companies in my time. A few weeks or months later, there's always a plaintive call from someone with whom I was friendly. They're in desperate need of assistance, no one can figure out what to do. (This was not because I left things in a shambles. It was because the companies always deteriorated into thinking that anyone could have done my job, so they would hire someone with the wrong experience/education/perseverance, and that person could absolutely not do the job.) \n\nMy response was always to have the manager call me. They never did. If they had, I would have told them how much they had to pay me, and that I expected it in advance.\n\nWhat a lot of nerve. I didn't work for them any more, they hadn't treated me all that well while I was there, and now I should be a good little team player and help them out? Not on your life.",
            "My experience with the knowledge of departing employees (working in IT) falls into 2 categories:\n\n1 - Really fresh information about live projects/issues that other team members are already actively working on or at least know about, and therefore not needed.\n\n2 - really stale information about a process that happens once a year (or less) and if it happens again nobody remembers when it happened and there is probably a better way to solve it than what was previously being done.",
            "Tell him you need 30K to pay for hypnosis to hopefully jog your memory",
            "Hey CEO, you realize you are going to have to PAY a lawyer if you want to sue me, right?",
            "I bet he would be too cheap to hire a lawyer. What a dick.",
            "Weird person.  \nSue if you remember something, AND sue if you do not remember..\n\nWhat a (beep)",
            "I doubt a lawyer worth anything would take that case anyway unless they only did it for the money. The CEO has no chance to win because you left him the notebook that had the logins and it is the company's fault for never changing the service or backing up the photos.",
            "\"Sleep well Westley, I'll probably sue you in the morning\"",
            "Wow, this is fvcking hilarious. I've read exactly one hundred versions of something like this story on malicious compliance, and they all end with: \"And then I quit and deleted all the passwords, hah-hah!\". This one is much better... It's much funnier... It's sweeter.",
            "> Per his request, I forgot everything I knew about his company\n\nnew job who dis?",
            "I love the constant threats to sue. It happened over 10 years ago, even if there was a basis to sue, the window has almost certainly closed.",
            "> I was promoted and asked for a raise to go with my promotion. CEO said no.\n\nMaybe I'm confused by the wording... Did you get promoted (new responsibilities) with no actual bump in pay? Cuz yeah fuck that! If that's the case, wtf did he expect?\n\n> Recently, I received a \"professional networking site\" message from CEO, telling me to help them with my old accounts or he'll sue me...\n\n🤦‍♂️ Not a great lead there, boss lmao. I seriously wonder what grounds he thought he had",
            ">(even though the company made millions off of the deal)\n\n>I figured out a way to host the images on flickr.\n\n>I saved the login information in a physical notebook\n\nOh lordy. Surprised it worked for 10 years tbh.",
            "Did the knucklefuck ever sue you?",
            "\"who is this? I don't remember anyone from that company as I was instructed to forget everything which I did. So please, I don't know you so don't contact me again.\"",
            "Yeah....the suing threat isn't nearly as effective as you'll not eat solid food again threat.  CEO needs to up his game or move on.",
            "I wish I had 50 bucks for every client that has tried to get in touch with me after I retired FIVE YEARS AGO to help them fix their website. \n\nI gave them a month notice, all of their info/passwords/files to give to their next web person, pretty much all they'd need. Still, they email me whining about needing something or threatening me. I've had to block several. Don't you idiots get it? I'm retired! Done! I don't even have the same info any longer, I've switched entire systems since then.\n\nPeople just don't listen.",
            "This guy is a special kind of narcissistic jerk. He’ll sue? Yeah ok.",
            "How so many incompetent people are at the top of large companies baffles me.",
            "Honestly with a d*ckbag CEO like that, I would have burned the book on my way out and not looked back.",
            "Based on your separation, I'm assuming you would never use them as a professional reference. 10 years after the fact and threats of suing for lack of help? I would 100% have responded:\n\n \"Only a colossally stupid child would think they have a case when attempting to sue a former employee for not helping them 10 years later. Your lack of managerial skills and business intelligence, following my multiple warnings about the risks of the flickr solution, are the cause of your current situation. Good day and get fucked\".",
            "I'd reply only two words: \"sue me\"",
            "Ladies and gentlemen, put your hands together and welcome the *Reap What You Sow* dancers!",
            "\"I'll sue you\"  a judge would look at that and just laugh at him and his legal team, 10 years since you worked for him.",
            "LOL \"kept informing them that this is a \"house of cards\" \"  <-- yep same here, only I used the term \"multiple points of failure\" before I bailed out.",
            "I think that falls under \"Be careful what you wish for. You may get it.\"",
            "“Wait….who are you again?”",
            "Your post made it onto a clickbait site.  Boredpanda",
            "> telling me to help them with my old accounts or he'll sue me...\n\nThe absolute hide of this POS.",
            "Oh man, I wish I knew what happened when he got that email!",
            "\"hello, who is this?  I believe you have the wrong person and j really don't appreciate your attitude.  Please do not contact me again.\"  \n\nWould have been the best possible first response back.",
            "New boss, who dis? Would suffice!",
            "You had me at Flickr",
            "Using a free Flickr account as an image hosting solution reminds me of the people who use Redis as the user account database.",
            "What a derp. I kinda tune people out if they think the only way to get my attention is to threaten me. He thinks that threatening to sue and throwing his weight around will get things done. Perhaps just perhaps maybe a better way to motivate your employees is to pay them a competitive wage.",
            "Is this malicious compliance? This sounds like compliance and a stupid as fuck manager",
            "You're a kind person, I would have written something mocking him and telling him what and where he can suck something",
            "Quite funny story. Did he actualy send you a demand letter?",
            "\"Pay me 25k and I'll tell you everything I remember\"\n\n\"I don't remember anything from 10 years ago, go read the notebook I left you\"",
            "They told me to forget everything I know about this place, so I did and it was a load off my mind.",
            "sue for what exactly?",
            "See you in court I guess.",
            "He's the kind of idiot who thinks the threat of lawsuit is enough to get people in line without thinking if he even has a case. You literally left documentation stating that EVERYTHING they needed was right where you left it. Surprised you didn't send them the \"this is the part where we laugh\" gif along with your reply.",
            "This guy sounds like a real peach",
            "\"I WILL SUE YOU\" is the CEO version of the little trouble maker kid saying \"I'm gonna tell\" when someone calls his shit",
            "\"Certainly sir. However, in order to help you, I will require  $1,000 a day and full decision making power.\"\n\nLater:\n\n\"So here is what you need. After reviewing numerous options, you will need a professional image hosting site...\"",
            "Hahahaha I would have made the notes in that notebook encrypted and \"forgotten\" about the code, as per his request. You were too nice as it was.\n\nCame here from [Bored Panda ](https://www.boredpanda.com/passwords-hosting-reddit/?utm_source=com.google.android&utm_medium=referral&utm_campaign=organic), fyi.",
            "[Forget everything you know about slipcovers](https://youtu.be/kO_x6rJJdsY)",
            "Oh yeah I worked for a small marketing company years ago and built a fully custom CRM system for them. Per instructions they wanted a 2 number ID system, I warned her the way this worked that was a max of 10 years of files that could be retained and they had me putting in 3 years worth of history. I left and the boss got mad at me because all my notes and documents that I left were paper copy print outs of my office files because they wouldn't pay for my subscription to office (so I paid for my own). I had no contract with terms about info retention, I ran the entire department and I warned them about instituting non-competes and legal protections but I was ignored.\n\nI warned them that the client folders was all the docs there was all passwords and what not are there. They lost a bunch of stuff and tried to get into my office account. They went so far as to call Microsoft customer service and sit on hold for 4 hours asking to be given access to my PERSONAL account. Of course Microsoft told them to get bent that if they could show they paid for it AND got my ok they would escalate it. They then informed me they tried this and I called the company and told them if they continued to try and break into my personal accounts I would seek legal advice. They stopped. But then 7 years later the owner called me and begged me to tell them how to clear out old files so they could continue to use the software they paid \"so much money for and was worthless now\". Mind you I was making like 25k a year and I spent 6 months solid working 65-70 hours a week, managing clients and sites along with building this. So maybe there is 8k that they paid out, for software that they used for 7 years.\n\nAnyway after 7 years they wanted me to remember exactly what I programmed and how to reset the accounts. I told them I needed access to the code to do that. They said no. I said k bye. They came back 6 months later begging again, I said I can't work without the code. They gave me access I had it cleared out in 20 mins and I billed them for an hour. They never paid.",
            "Charge him $1000 an hour to remember, but it may take a few days.",
            "I was your 10,000th karma point, by the way. :b",
            "> TLDR:\n\nPlease don't put spoilers at the top of your story.",
            "Oh man, if there were ever a time for \"Sure, I'd love to help you, my rate is 300$ an hour, three hours minimum.\"\n\nAnd then just tell them the pics were hosted on Flickr, on this account, I've mailed you the account info. Oh, that doesn't work, well it's all I know, so unless you've got anything else...",
            "Anyone else just downvote and move on when they post a spoiler at the top?  Such a dick move.",
            "Um, I would have told him to get fucked.",
            "Hell, I really enjoyed where I worked 10 years ago and once in a blue moon my old boss will email with a question. I *want* to remember but not a chance.\n\nRemember songs from 7th grade choir? Sure, along with the dance moves. Remember technical details about a system that I worked in daily for 3 years? That stuff is long gone.",
            "Aren't you supposed to forget everything per legal threat? How could you remember to share the story here?",
            "Ten years ago, and he expected your help?",
            "\"Materiel\"\n\nI'm sure that was a typo, but left as is, makes the rest interesting.",
            "Upvoted simply for putting the TL;DR up front like a sane person.",
            "[deleted]",
            "[removed]",
            "I assume you kept the email?  Good on you.  Second, on what grounds would he be suing?  And thirdly, wouldn't the statute of limitations have run on any lawsuit?  Fourthly, I believe this, lol.  I've seen some idiots running busineses.",
            "Surely if it is \"forget everything\" order....\n\nWho are you again? I don't remember you.....",
            "Send him a bill for the consultation",
            "And then what happened...?",
            "[relevant XKCD](https://xkcd.com/1150/) (which was, coincidentally, from almost 10 years ago!)",
            "Who remembers anything about their old work from 10years ago!? Show of hands"
        ]
    },
    {
        "post_id": "j7fck4",
        "author": "1mN0tSure",
        "title": "At 17 I got a nurse suspended",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/j7fck4/at_17_i_got_a_nurse_suspended/",
        "score": 20882,
        "num_comments": 457,
        "created_utc": 1602171702.0,
        "selftext": "I was telling a friend this story and he told me to post it here.\n\nSo in high school I worked as a Certified Nurses Assistant at a local Nursing Home, I only worked on the weekend because my parents wanted me to focus on school during the week. Anyone in the health field knows you can NOT work with the elderly when you are sick because some elderly people can die from the common cold. \n\nWhen I was 17 I got really, really sick. I got sick on a Tuesday with a light cough and by Friday I was going into 10 minute coughing fit. The next Monday was Labor Day, my regular doctor was closed all weekend. My parents decided we couldnt wait until Tuesday and went to the ER. I had a bad case of Bacterial Pneumonia! \n\nFor those who dont know, regular pneumonia usually results from a bad case of the flu or another illness. But a perfectly healthy person can be in Walmart (for example) and walk by another person with BP who sneezes and breathes it in. Its extremely contagious. \nI was admitted to the hospital and hooked up to tubes, turns out I was also dehydrated from being so sick.\n\nAround midnight I realized I needed to call in since I wont be able to work the next 3 days. So I called the nurses desk and told the RN on duty that I have been diagnosed with Pneumonia and wont be able to work this weekend and most likely the weekend after due to the possibility I will still be contagious. \n\nShe told me \"If you wanted a 3 day weekend you shouldnt have volunteered to work. You cant fake a cough to get out of work in the real world sweetheart.\"\n\nThen hung. Up. \n\nI asked my dad what I should do. He took my phone and took a picture if me in the hospital bed, then we got a signed note from the doctor and took a picture of that. He then told me to email those to the Director of Nursing for the facility. I did that and also told her what the RN had told me. \n\nThing is at this facility any calls through the nurses station are recorded to protect the facility from lawsuits and/or protect the residents from negligent caretakers. \n\nShe was on record telling me what she did. \nWhen I returned 2 weeks later i learned she had been suspended for 8 weeks without pay for negligence.\n\nEdit: There are a lot of people asking how this was MC, during my CNA classes we are told to protect the residents no matter what, even if it costs our positions. I went over many heads, directly to the DON, which could have gotten me fired.",
        "permalink": "/r/MaliciousCompliance/comments/j7fck4/at_17_i_got_a_nurse_suspended/",
        "comments": [
            "Sounds like you worked at a decent nursing home that actually cares about their residents.\n\nThey're few and far between.",
            "I got food poisoning when I was about 20 and was meant to work 21 hours in 2 days. As vomiting on shift so had to go home, I was actually sent home by both my supervisor and manager. \n\nOne of the women I worked with told the big boss that she thought I was hungover because the night before we'd gone out for a friend's leaving do and I'd been drinking. I had 1/3 of a bottle of wine with dinner and then left, plus I was a university student so could hold my booze well!\n\nSo the big boss called me but I was on the toilet vomiting into the bath (great visual, I apologize) and I asked my mum to answer my phone. She did not appreciate the accusation and explained very politely that I wasn't that stupid/disrespectful and also that I was puking my guts out, also that I wouldn't throw away 21 hours worth of pay like that! The big boss was very nice to me after that!",
            "I wonder if this triggered an audit of that particular nurse's call history and discovered something more.",
            "If she forced you to come back while sick, it would be every nursing home’s worst nightmare. \n\nYou did the right thing, fuck that nurse.",
            "You didn’t sound sick enough over the phone.  Pro tip:  always try to hack up some phlegm right into the microphone for realism.",
            "My grandma was in a rehabilitation center after surgery and the nurses assistant at the desk apparently had Dementia. Forgot to feed her a few times go figure.",
            "That nurse got herself suspended.",
            "When she was 21 my daughter worked for a call centre.  They were known for not being very good employers.   I would drive her  to work every day and baby sit my three year old grand daughter.  I went to drive her to work one morning and she looked like death.  Told me she had been up all night vomiting and had a horrific headache.  I immediately took her to the emergency room.  She called her work to tell them that she wouldn't be there, got some attitude but they couldn't say much.   Turns out she had developed type 1 diabetes and was critically ill.  She was immediately admitted to the ICU for a week.  I called to update her work on what was happening.  They told me if she did not call in every morning that she would be fired.  I immediately sent a scathing email to the head office about the ethics and legality of forcing someone to call from the ICU every morning or lose their job.  I got a very apologetic phone call from head office agreeing that this was unacceptable, and that they did not expect to hear from her for at least two weeks and her job would be waiting for her.  Not sure what head office said to her location, but when she returned to work she was told that she could take what ever time she needed during the day for snacks and testing her blood sugar etc.  There was also a missing manager...",
            "Probably covering their a$$. If you went to the director that fast they prolly assumed you go to media next.",
            "I love a story with a happy ending.",
            "A good revenge story, but I don't see MC in it.",
            "My mom is the VP for the nursing department of a company that runs nursing homes. The things I hear from her about staff not doing their job is almost saddening.",
            ">elderly people can die from the common cold. \n\nPutting sick patients into nursing homes these past months is an unspoken scandal of horrifying proportions.\n\nHow people have not been jailed for this astounds me.",
            "My sister worked at nursing homes for about a year and any time anyone was sick, they guilted them into coming in, regardless of what they had.",
            "Only suspended without pay? Should've been demoted or something. It's only a matter of time though before she fucks up again if she's that clueless and heartless.",
            "Ok, OP, YOU did not get that nurse suspended. Her shitty condescending and unsafe behaviour got her suspended.",
            "She should have been fired. I'm going to correct one thing though, about how you described pneumonia. Almost all forms of pneumonia are highly contagious. There is no \"normal pneumonia,\" most pneumonias will fall into the classification of bacterial or viral. Pneumonia is an opportunistic infection that does seem like it likes to follow the flu, but that is just because it us easier to infect a person whose immune system just put up a fight against another illness. But make no mistake, that pneumonia is still highly contagious. The nurse should have known this, and should have known as a healthy person you would not have had fungal pneumonia (less contagious) or aspiration pneumonia (not contagious.) Any other pneumonia has the potential to make others sick, including \"walking pneumonia.\" So stay home until your doctor clears you! Because if you get pneumonia after the flu, you are still contagious! I only know this because I've had quite a few pneumonia hospitalizations from the past 2 years and they went into a deep explanation so I could explain to my boss why they were wrong about asking me to stay when my doctor called with the results of a CT scan showing I had pneumonia. Pneumonia is NASTY I don't care who you are, you can be the strongest person on earth, it can bring you to your knees. Now imagine a frail senior. Stupid nurse. Hopefully she learned her lesson. \n\nAnd to back you up on another comment, you can be a cna at 16 in my state. The local high schools have a program for it.",
            "What I hate about some of the nurses that work at nursing homes is they have never been a CNA.  They dont understand that we are their eyes, ears, and main caretakers of the elderly.  Those are the nurses that treat CNA's like crap.  In my opinion all nurses should have to work a year as a CNA so they can understand what we do and maybe appreciate the what the CNA's do.  \n\nI used to work with a nurse that wasnt a CNA and she was horrible to us.  One night we were short 2 people on a shift that's supposed to be 4 CNA'S.  She wouldnt help us, didnt even try to find someone else to come in.  We had to take care of 43 people by ourselves, thank goodness the other CNA was awesome to work with.  Evening shift is hard enough with 4 people, let alone just being 2.  The nurse ended up getting fired a couple weeks later for stealing meds.",
            "I got pneumonia and went to the doctor,  she told me not to work for 3 weeks.  I called my work and said I couldn't work I have pneumonia.  The assistant manager asked, well can you at least work tonight?  I was flabbergasted, and told her I could die. Lol. Some people.",
            "About 2 years ago I quit my job as a medication aide in a memory care home without notice because of the way I was treated while really sick. Like, I cannot control my bowels sick. I've never been that sick before. My supervisor acted really nasty to me over the phone about it because we were short staffed, which meant she would have to cover my shift. I felt terrible because she worked crazy hours, but I was literally shitting myself. Still wasn't the best way to handle the situation though in retrospect.",
            "Where is the compliance though?",
            "God, I hated working at nursing homes. If we were lucky 2 out of 10 of us showed up. I quit pretty quickly, because 2 out of 10 cannot take care of patients well. We had 5 halls and 2of us were supposed to work one hall. Everyday I was there, I had to work 5 halls with no pay increase or anything. It was just do the job of 10 people or be fired. It was awful. It was a regular thing too. I tried talking to and dealing with the DON. But it was apparent very quickly that the staff didn't care at all. It was the worst job I ever had. And the nurses on duty didn't do shit. They sat at the front desk and chatted and malingered. They were zero help whatsoever.They were quick to blame the 2 out of 10 nurses aids working if Patient ran down the hall naked, even though 2 of us could not monitor every patient. They did not give two shits. They did not care that we were majorly short handed and had way more patients than we could care for. They just sat at the desk and chatted. Lazy bitches. I have never met more lazy workers that LVN's working in a nursing home. Ever. I never called in once and was regularly punished for it.",
            "Worked in nursing home for years. This story doesn't surprise me one bit! Glad your ok, she got what was coming and you learned a good life lesson at a young age",
            "Even with the edit this doesn't seem like Malicious Compliance. More like Pro Revenge or maybe Benevolent Though Angry Noncompliance.",
            "I’ve worked at a nursing home and it’s so important to not go when you’re sick, let alone with something like that.  Every time I would get punished for not coming in when I was contagious, and I know other people, even nurses, were so irresponsible with that.  Frankly that woman should have been fired with a bad reference.",
            "That's pretty badass that you were a CNA at 17! That's hard work!!!",
            "You didn’t get anyone suspended. She did it to herself.",
            "Worked as a CNA for a couple years in a nursing home. Then at a hospital for a few years. Loved it and was going to school for nursing. I then landed an office job and I make more now than I would have before, and less hours. Good luck out there!",
            "I'm still a CNA, and always make sure to have a few numbers on hand to call. I always call the scheduler first, if it's early enough. That's the person who will be able to find a replacement. If it's late and I contact them, they may ask me to call another number, so I relay that way.\n\nSorry you worked in a facility with such a shitty nurse. I know it's hard, they're always short of staff.\n\n[](/sp)\n\nOne time I thought it was a fart, but it was not, so I had to have my mom come pick me up. I was running a fever but it had happened during the shift. Luckily it was after dinner and I think all my patients were already in bed.",
            "> during my CNA classes we are told to protect the residents no matter what, even if it costs our positions. \n\nInteresting. I see a lot of examples of nurses acting courageously and putting their patients’ wellbeing way above anything else, but I just assumed that was just the kind of people attracted to the job. That is so good to hear, and good the nursing home responded the way they did.",
            "When you call in sick to work, then you're sick. IMHO it doesn't matter what's wrong with you or how serious it is, you're sick. For the person on the other end to assume you're faking it is inconsiderate, rude, and in this case incompetent and negligent. Asking for a reason is basically irrelevant and, in some countries, illegal. If there's a suspicious pattern, then of course you can review, but as a manager or business owner, you should assume your staff are telling the truth.",
            "Mate - you are the man , roasted her royally . All she could request was for the doctors note . Some ppl think they own ppl",
            "Thank you for not puting others at risk. I worked security at a rehab and elder care center. If I sneezed they gave me a mask. If I had a cold, it was masks all the time. I called in several times to not take any chances.",
            "Thank you for having the mental fortitude to be a CNA. That's not an easy job!",
            "It wasn’t malicious compliance. Fortunately, you didn’t come to work and didn’t put anyone in danger.",
            "I bet she was *pre-tty* angry at you for a while.  Probably lobbed some passive-aggressive Karen comments your way in the later weeks.",
            "Lol that's a nice story but really not malicious compliance.",
            "Totally get what you are saying here! I got chewed out by a nurse when I was a CNA and called in sick due to salmonella. I had to take a week off work.\n\nI’m glad that facility was so good about protecting staff and patients, more places need to do that. We need to protect our elderly.",
            "God, this sub has turned into a revenge porn subreddit. No malicious compliance to be found at all in this story and people upvote it just because it made them feel good.",
            "Good story, also this seems a little like r/prorevenge, because you got a nurse suspended. As I wrote this, I did also see the malicious compliance",
            "Props to your dad!",
            "You did the right thing and were hassled by the nurse. Your dad did the right thing. Nobody should play with other peoples health, yours and the residents. Glad she got suspended.",
            "She should have been fired",
            "I bet that nurse still blames you for that.",
            "Mm",
            "At least there was an uplifting ending",
            "I can confirm, I’ve had this type of pneumonia myself when I was 16. It has a bit of story to go along with it but I’ll save that for another time.",
            "More like a revenge story tbh",
            "Good on you!",
            "How are your lungs? And you in general? Bacterial lung infections are at a high risk of causing bacteraemia and sepsis and I wanna check in",
            "> I went over many heads, directly to the DON, which could have gotten me fired.\n\nHow could that have gotten you fired? That is something I do not understand.",
            "Please, tell me about this line of work. Here, what I think is equivalent to nursing assistant is like a 2 year course after hs",
            "When I was 16, I took my birthday off of my part time library gig.  Scheduled it, had it covered, same as any other planned absence.\n\n My boss told me that “in the real world” people don’t take their birthdays off.  Mind you, it didn’t inconvenience her at all, and getting my license meant I wouldn’t have to walk an hour each way to and from work, so it was a pretty big deal for me to have it done ASAP.\n\nI’ve never forgotten that in the real world, it isn’t ok to schedule time off work but it is okay to berate responsible kids for daring to have any needs or personal time.",
            "I had a miscarriage while working at a nursing home. Started bleeding heavily during my shift and I just finished out my shift and then cried all the way home. Ended up calling in for my weekend shift because I was still bleeding a lot, they told me I would have to work the next weekend to makeup for calling in. I was SO pissed. Glad i dont work at nursing homes anymore.",
            "It's not MC. It was good the safety of the residents, so the opposite of malicious, and there was nothing to comply with, except maybe go into work sick. That would be terrible. It's not even petty revenge. Nurses like that should be fired.\n\nI still have you an up vote b/c it's a great story, and I'm glad you had such good ethics at 17!",
            "Good on you for being an advocate for the residents where you worked. Sounds like you cared for their well being more than the craptastic nurse you got booted.",
            "Well that sucks for the facility. Down a cna for 2 weeks and one nurse for eight weeks. Btw, what was the negligence, I kinda skimmed the post.",
            "I like the story! It was really good! But I felt like you were yelling at me due to the overuse of exclamation points!",
            "[removed]",
            "This is what got me too!",
            "Well done.",
            "HA! Well done! I hope you came through with no leftover issues!",
            "Sweet",
            "[deleted]",
            "I mean, she kinda deserved it.",
            "Fucker got ended by a kill streak.",
            "[deleted]",
            "She is talking about a cop union.",
            "It's compliance with the rules, not malicious.",
            ">protect the residents from negligent caretakers\n\nsounds to me like the system worked as intended.",
            "Even after your edit: nice story, but not a malicious compliance.",
            "Just saying that a doctors note must be enough and a picture of you in bed won't change anything. It's just a little bit weird, especially when you get older. When I'm sick, the only thing my boss hears is that I am sick and when I will be back. No diagnosis, no symptoms etc. No need.",
            "How did you become a CNA in high school ? You need your diploma/GED",
            "As a CNA myself I've have dealt with many a bitchy nurse. Glad she got what was coming to her.",
            "1) how do you know she was suspended or that it was even about this phone call, if she was?  Management generally doesn't share that kind of information. Nursing homes are gossip infested so I'd consider the source.   2)  I was suspended once from a nursing job and it turned out to be a blessing because I used my free time to find a new job that had better hours and pay.  When they called me to come back to work, I was like \"nope, I have another job.\"",
            "Fyi while it's a good story, the author has a whole bunch of misinformation about pneumonia.",
            "What's the point of a suspension without pay for 8 weeks? Might as well fire her, what are the chances she's not already looking for another job?",
            "I love that the director of nursing is called the DON. Like a mafia family but for helping the elderly.",
            "It’s the healthcare industry itself. They staff so bare boned that if you try to call in sick they will keep pushing for you to come in. When I say bare bone I mean the people that actually do the hands on work. It seems we have 3 administrators for every one hands on worker.",
            "The nurse got herself suspended!",
            "I worked for year in a nursing home when I was 20. I didn't feel well one day and visited my doctor. I don't remember what I had, but he put me on sick leave for 3 days. as soon as my boss saw my doctors note she called me and asked if I was okay with sharing why I was sick, I didn't need to disclose it, but I felt fine telling her. in the end she told me to stay home the whole week just to be safe I wouldn't be contagious. great place to work at",
            "Lmao for some reason I expected the story to be more like \"I was a patient at x hospital and got caught having sex with a nurse that was checking up on me\"",
            "I have had multiple family members in Nursing homes and memory care. I currently have 4 relatives who are immune-compromised due to cancer or transplants. My father, grandfather, great-grandfather all died pneumonia either as a primary COD or a contributing factor. Thank you for doing the right thing",
            "What happened after the bad nurse's suspension was over? Did she retaliate?",
            "With the info provided this isn't negligence. She didn't demand you come in. She was just trying (and failing) to call you on bullshit. Which should not be the actions of a charge nurse and def she should get into trouble. But in no way is it grounds for an 8 week suspension. Also it's illegal for them to tell you why she was suspended and is def grounds for a lawsuit. So I doubt they told you why she got suspended.  \n  \nI agree with you that they shouldn't have done it. But this story doesn't add up at all.",
            "I mean it was a dick move on the nurses part that she definitely deserved to be punished for but I’m not convinced that amounts to negligence warranting an 8 week suspension. I’d be more inclined to believe the suspension was primarily because of other negligent actions and MAYBE this incident contributed but it surely could not have been the sole cause... I mean maybe if she forced you to come in and made you continue working after seeing you were sick and could infect the residents? But a snarky comment, nah...\nSource: have worked in Nursing homes, hospitals and emergency medicine",
            "It's unlikely she was suspended for 8 weeks for calling you a liar.",
            "I know one girl who is about to graduate super soon. She has one exam left. She is very academically smart but is so into drugs. My friend, her roommate says she does MDMA and was high at hospital placement while in theatre. She reported her but they let her go because they don’t drug test students and her academia is really good. Fucking hell they should’ve just tested her. An allegation that extreme should have been taken more seriously. When my mum worked at the same hospital one of her colleagues got fired over a random drug test where she tested positive. Why couldn’t they have done the same for a student who’ll probably go on doing the same shit as a RN.",
            "[deleted]",
            "[removed]",
            "Lameeeeeee",
            "All because she was sassy with you over the phone?",
            "[deleted]",
            "Once when I was home from uni for holidays I worked at Best Buy for 2 weeks for some extra cash (worked there before, boss was happy to bring back old employees for a week or 2 during hiliday season)\n\n\nAlways I got SUPER sick before boxing day. I was coughing so hard that my spittle was laced with blood. Know what I did? Still went in lol. Bitch I'm not giving up time and a half pay as a student!",
            "Ummm... [bacterial pneumonia **is not** contagious](https://www.healthline.com/health/bacterial-pneumonia), though the underlying bacterial cause, *may* be... and, it varies wildly, depending on the bacteria of-note.\n\nMore-over, after a few days of antibiotics, *generally* the contagiousness drops significantly, as the bacteria is significantly weakened.",
            "So instead of just going in and clearing your name/making sure you got your benefits with a doctor's certificate. You acted in a way that lead to a coworker getting a 2 month unpaid suspension... Because they happened to be the one that answered the phone at a nurses station and got a little quip in about your time off."
        ]
    }
]