[
    {
        "post_id": "wg0u0v",
        "author": "sominik92",
        "title": "Can’t quit my job if I’m taking the uniform home ? Guess I’m leaving naked .",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wg0u0v/cant_quit_my_job_if_im_taking_the_uniform_home/",
        "score": 20859,
        "num_comments": 736,
        "created_utc": 1659618455.0,
        "selftext": "\nJust saw a similar story that reminded me of how I quit one of my first jobs .\n\n\n\nSo back when I was a teenager around 14 years old I worked for the shop down the road as their weekend “baker “ which was mainly just defrosting pre cooked items or browning pre cooked bread in the ovens . \n\n\n\nMy bosses daughter also worked there as a checkout staff , however she would just call in sick / hungover every weekend so of course her dad would let her off the hook and make me cover her shift , so I would work 5am to 7pm most weekends .\n\n\n\nAfter a couple years I decided I was quitting and gave them my 2 weeks notice. My boss asked me to stay an extra week to train the new weekend baker which I agreed to . At the end of the 3rd week I went into my bosses office and did the usual “ Well it’s been great working with you “ to which he replies “ So OP the extra week you worked to train the new baker means you have been here two years , which means according to policy you need to work 4 weeks notice instead so I’ll see you next week . Also you need to give us back your uniform on your last shift , and it needs to be freshly cleaned. “ \n\n\n\nBeing a petulant teenager who was tired of waking up at 4am I stared at him in disbelief for a couple of seconds waiting for the shit eating grin on his face to laugh and say “ just kidding have a good one “ . That moment didn’t come . \n\n\n\nSo I walked out the office ,stripped down to my boxers , folded up my bakers whites , my trousers and even the little mesh fedora on top , walked into his office again and dropped the uniform on his desk and walked home. He followed me down stairs and through the shop shouting about how I would never work anywhere again . Thinking back that must have been a strange thing for customers to see .\n (it was a 10 minute home walk in the summer sun nothing arduous )\nApparently according who his daughter who got back in touch with me a couple years later I’m now one of the stories my old boss tells people when he’s had a few drinks (Not in a nice funny story way).\n\n\n\n* EDIT. - I live in England and yea it’s illegal to make kids work 14 hour days but then it’s also probably why retail shops love employing teenagers because they’re just grateful for the money and don’t really know their rights .\n\n\n\nAlso for those asking yes we did but not when I worked there so I don’t know if that counts . I think I just have a bad habit of sleeping with people I have worked with or work with .Thankfully not anymore .\n\n*FINAL EDIT \n\nThanks everyone for the awards and stuff but also Thankyou more for all the amazing replies . Instead of replaying embarrassing things I’ve said at work through out the day tonight in bed , I’ll be thinking this memory through over and over with all your hilarious come backs, comments and revenge plans edited in .  \n\nThis was 15 years ago now and I live across the country with my amazing Wife living a humble but good life which I feel in itself is the ultimate moral victory .\n\nAlso the comment I made about showing dominance sounds very douchey now I read it back so getting rid of that .",
        "permalink": "/r/MaliciousCompliance/comments/wg0u0v/cant_quit_my_job_if_im_taking_the_uniform_home/",
        "comments": [
            "Imagine being so up your own ass that you drunkenly rant about a teen you exploited getting sick of your shit and quitting...for years after it happened.",
            "Should've run out past the customers screaming, \"No, I won't work naked.  Screw you old pervert!\"",
            "4 week notice as a part time weekend baker? Suck my baguette. What a POS",
            "You already gave him notice and he thought working out your notice meant you’d have to give even more? What an absolute 🐓",
            "\"according to policy\"\n\nYeah, except if I quit, I don't follow any fucking policy any more.\n\nThese fuckers think they're gods.",
            "Working 14 hours a day as a 14 year old HAS to be illegal right?",
            "Hah. You just jogged my memory - when I quit a job as a shift manager in fast food, one of the things the store manager tried to argue with me about was that he wouldn't accept I'd quit and wouldn't give me my paycheck because I hadn't returned my uniforms.\n\nSo I went home, got my uniforms and went back in, turned them in, got my last paycheck and left over him demanding to talk to me.\n\nSo I got the predictable angry phone call where he tried to assert that I *couldn't* quit, I pointed out I'd quit the week before and had to hang up on him. He kept calling so I turned my phone's ringer off.\n\nBad bosses are so predictable about trying to string you along into 'having' to work.",
            "I had a boss try to pull something similar after they had failed to replace me during my two weeks notice. Tried to tell me on my last day that policy was to give 4 weeks and so I had to be back in on Monday.\n\nI said okay and then just never showed up… can you believe they literally called me asking me why I wasn’t in for my shift? I would’ve thought he’d figure it out as soon as I didn’t show up but nope, completely oblivious.",
            "*in front of costumers*\n\n\nI DON'T CARE ABOUT TRADITION! I'M TIRED OF CUMMING IN THE DOUGH, YOU AND YOUR SECRET INGREDIENT CAN GO TO HELL!",
            "Pretty certain minimum notice period requirement is enforced based on when the notice is given, not when you leave.",
            "Imagine being so salty at being owned by a teenager that you get drunk and seethe about it years later.",
            "My first job was working at an A&W burger place. My manager was a total loser. He was hard on the guys and easy on the women, I think he thought they would be into him or something. He gave us lots of terrible jobs and would laugh at us while we did them. He would make a massive deal if you walked through the kitchen in your street clothes to get to the office/washroom to change into your uniform so you had to change before showing up. But then he’d show up in his spandex after a long bike ride and go cook his own lunch and not pay. This was pre cell phones and I was up for my three month review. I had written down my schedule and was prepared to show up on Sunday for the meeting. I worked two jobs and while at my other job on Saturday I get a call from my dad saying my boss called and was angry that I missed my review and was going to write me up. I called my manager while on my break and he said he bumped my review up a day to see if I kept tabs on my schedule. This was the last straw and I was pissed so the next day during the lunch rush I walked in with my uniform rolled into a ball, asked for the manager and in front of all the customers threw it in his face and told him I can’t work for a place that has the manager making food in his sweaty bike gear while sweating on the grill and walked out. A bunch of customers walked out with me. That felt so bloody good.",
            "Me: \"alrighty then, see you next week!\"\n\n*doesn't show* \n\nSeriously, what do they expect? You're quitting, they can't force you to stay. Policy doesn't mean shit for a job you don't work for. They can't even go after your paycheck for the uniform, if they wanted to.",
            "Well, did you ever work again or nah?",
            "I love that he tells the story of him being outwitted by a 14 year old he tried to bully as if people are going to empathize with him.",
            "One of the greatest moments of my 30+ year career was when a guy name Chad (really) got into a seriously heated argument with our boss in front of all of us and rage quit. My boss yelled at him that his shirt belongs to the company and Chad literally Hulk Hogan'd that fucker into pieces, threw it at my boss, and then proceeded to walk home. This was in probably 1998 or 1999 and I can still see the look on that guy's face when he tore the shirt off.",
            "Hello police? I’m a minor and my boss is demanding I remove my clothes before he’ll let me leave the building.",
            "This reminds me when I was a teen. I worked a go-kart amusement park and work for 2 years. At 2 years, I went to the owner and asked for a $.50 raise per hour. His answer was to fire me 1 week later. He had the shift manager call to tell me. My neighbor and best friend also worked there.  The boss sent her to pick up my uniform, something that was not mentioned I had to turn in. \n\nAt the time my father was changing the transmission out in his truck and I had worn the shirt while helping. It was covered in grease sweat and whatever else I layed in. I hadn't even washed it yet, when I gave it to her. \n\nShe told me when she gave it to the former boss, he went on a rant calling me every word in the pirate bible. And ended up throwing the shirt in the dumpster.",
            "Had an old employer try to tell me they wouldn’t give me my last check until I brought my uniform back in (I was planning on bringing it in anyways), so instead of bringing it in I brought out a printed sheet of our state laws where it said that was illegal to do and I said “so can I have my check or do I need to call an officer to come and have you hand it over to me?”. Walked out with my check and threw the uniform away.",
            "Four qeeks notice per policy? That's cute. But I already said I'm quitting. What are you gonna do, wrote me up?",
            "Even as a teen, if they told me \"oh, sorry, you're not allowed to quit yet. You need to work 4 weeks prior to quitting.\" I would have known that was bullshit and called them out. Walked out of my first job because they tried to steal my paycheck with some bullshit \"company policy\" and I just said \"your policy is illegal and I guess I'll be getting my dad to talk to his lawyer\" and walked out. They stopped me before I got to my car and gave me my paycheck.\n\nI still stole the sample set of knives and quit. Fuck Cutco/Vector Marketing. Great knives; terrible company.",
            "I saw a server at my first job as a 15 year old kid take her “work” shirt off and throw it at someone and stormed out in her bra, didn’t remember that until this story jogged my memory 😂😂😂😂😂😂",
            "A boss I used to work with did that.  Had a meeting with management and he stripped off in front of them fully naked.  Cock out the lot and I’m not joking.",
            "I love the \"you'll never work anywhere again\" line.\n\nThe perfect response: \"If you had the authority to prevent me from working somewhere else you wouldn't be doing the job you're in now\"",
            "If you really want to turn this into something. You should go to his bar and see if he can re-tell the story then remind him that he had you work 14 hours and wanted you to work in your skivvies at one point, that's why you walked out. Oh and make sure everyone in the bar hears it. Ruin his favorite watering hole.",
            "Did anyone else think when OP said “which was mainly defrosting  pre-baked items” that he meant scraping off old frosting and put new frosting on the baked stuff?  \n\nNo? I need coffee….",
            "Your old boss sounds like a mix between a cruller and a Bundt cake: a crunt.",
            "Well don’t leave us hanging! Did you ever work anywhere else again??!",
            "The boss is a scumbag on so many levels.  I'm pretty sure it's illegal to have a minor working that many hours in a week. There also needs to be 12 hours between shifts. Am the notice period should only extend if notice was given that day and not 3 weeks prior. Any normal person would not require uniform back there and then. Not to mention the blatant favouritism of making op cover his daughters shifts",
            "now this isnt advice.  if anything im telling you not to do this.  its wrong.\n\nitd be wrong to half fill a bucket with warm water.  itd be wrong to buy and don rubber gloves, gas mask, and goggles.  itd be wrong to throw at least a weeks worth of dog shit in the warm water and let it sit for a few minutes, definitely not possibly stirring it with a stick.  you should never put that in a super soaker cause that would be wrong.  and you certainly should not, under any circumstances, blast this persons business every morning with shit water so no one goes within 30 ft of the front door.  You should definitely not use it to draw stuff on the outside of their business.  All of this shouldn't be done.  I actually don't even know why I would even have typed this.  It seems like common sense.",
            "I'm fairly certain that unless you had a formal contract, you are not obligated to give any notice at all, much less 4 weeks. That dude is a real piece of work.",
            "Now go Fuck your boss’s daughter to establish dominance.",
            "> So OP the extra week you worked to train the new baker means you have been here two years , which means according to policy you need to work 4 weeks notice instead so I’ll see you next week\n\nHow older people take advantage of younger people when they haven't got much experience in the work force.\n\nDisgusting behavior.",
            "One of the funniest “malicious compliance” work moments I’ve seen is when I worked at a pet supply store chain.  We had these stupid aprons we were supposed to wear but nobody ever did.  \nThe manager (J)was cracking down on people wearing them.  There was one guy (M) that worked there, brilliant, excellent employee but was stoned most of the time and just DGAF.  \nSo J, M and a couple other people were smoking out the loading dock.  J is giving them shit about the stupid aprons.  M grabs his and walks around the corner outside. Comes back with his apron on but pants and boxers around his ankles and says “I got my apron on now J, can I go out into the store?”\nJ was a big dude but fair skinned, strawberry blonde.  Well, he turned beet red and I’m pretty sure I saw smoke come out of his ears.  It was fantastic.",
            "\"My boss asked me to stay an extra week to train the new weekend baker\"... this could be a new 'how bosses take advantage of teens' subreddit... there would be a lot of McDonald's stories... one thing I never understood when I look back on my teen years is why I just accepted the BS that my employers spouted... like how could I have been so trusting and naive??",
            "I had a crappy job at a place that demanded we wear company apparel. You had to pay for it and got a portion back going down 1/12 per month you had it. After a year you got nothing but they still wanted it back. I quit at 11 months so I was getting only 1/12th of what I originally had to pay. I said no thanks, I'll keep these clothes I've paid for. That weekend myself and some friend went to a strip club and had a dancer dress up in the company gear. Pictures were taken of her strutting on stage with a logoed shirt and hat and sent to the old boss. I never heard back. He might well be in the 'there is no bad advertising' camp. I kept a handful of t shirts but gave the rest including several warm winter jackets to the homeless folks of Calgary. Lots of advertising for free. \n\nI had a friend who was a supervisor there. I hadn't paid for all the clothes I had. I only wanted fair reimbursement for what I'd paid for. I'd have given them everything I had in the closet if they hadn't purposely been jerks. The smug look on the owner's face made it pretty clear he enjoyed the process of squeezing a bit more from the staff when they were leaving. I wasn't playing his game.",
            "Did you ever bang his daughter?",
            "I quit my job in some similar manner, worked stocking shelves at the time I was 16 or so.. I had a dispute with my manager about having December 31st off since it was one of two days a year I see my entire family. There was a non verbal agreement that if you worked Christmas you had 31st off and other way around. \nI was on the roster to work Christmas and was fine with that, I applied for the day of months in advance. New week rolls in and the new schedule got put up the week before Christmas and I see that I’m working both Christmas and 31st, and another girl got the 31st off (changes were marked in red) this girl happened to be the girlfriend to one of the staff leads (like the one 26 year old that worked there for 11 years and didn’t quit) and he got the day off too\nSo I walked up to the manager and told him about this and that I applied to have that day off months in advance, also reasoning why I had asked this(which he already knew) and I just got back a “we don’t allow for days off on holidays, roster says you’re working so you are coming in” so I relied that I couldn’t work and things had been arranged weeks before. \nHe wouldn’t budge and even got a bit more sassy with me for not obeying his commands or whatever he got his panties up in a bunch over.. \nSo I quit on the spot, took my shirt off, handed him that and my company box cutter. Walked through the store to the lunch room, grabbed my other shirt from my locker, put on my own shirt, walked back to the manager and chucked him the other shirt and left. \n\nThis way I had both Christmas and 31st off and I felt a lot better about myself that day",
            "I once was a baker of bread\n\nAnd one day my boss lost his head. \n\nHe told me yet not to go\n\n I'd be 4 weeks of no call no show. \n\nHe wanted a whole month notice \n\nyet basically fired without motives. \n\nSo I told him good day!\n\nHe said hey no way!\n\nThat apron and gear is mine!\n\nSo I stripped on a dime. \n\nI walked home in the buff \n\nwith a power move strut",
            "What a literal pile of trash, good for you OP",
            "Did you get a raise for your 2 year anniversary?",
            "I still can't figure out how anyone thinks their business can have any meaningful policy on how you can quit. Like, what does your policy have to do with me? I don't work here.",
            "You won’t work anywhere ever again? Who does he think he is? How far up your own bum do you have to be to think your opinion is worth that much? Aside from his little circle of pathetic friends I doubt anyone else sides with him in this story. Good riddance.",
            "You know you did the right thing because even the *weather* had your back on the way home.",
            "Not sure I understand how an employer thinks their notice requirements mean anything? \n\n“No, you can’t quit in 3 weeks, it has to be 4 week, or else… *crickets*”",
            ">So OP the extra week you worked to train the new baker means you have been here two years , which means according to policy you need to work 4 weeks notice instead so I’ll see you next week . \n\nSo, being an at will state, it means I can quit on the spot. Cya!",
            ">So OP the extra week you worked to train the new baker means you have been here two years , which means according to policy you need to work 4 weeks notice instead so I’ll see you next week . \n\nI know things are different in the US vs the UK (we don't *have* to give any notice to an employer, and certainly they can't demand anything longer than what was given), but I can't imagine why anyone would think it is a remotely good idea to try to force people to stay longer regardless of what the law allows.\n\nYou're 100% guaranteed to have sub-par baked goods (or whatever) for the next two weeks if you try that shit.",
            "I love how shit managers think they actually have control over someone quitting. How dense do you have to be to expect someone to follow a company policy when someone is leaving the company , and the fact that he waited until the last day and said see you next week as if this was somehow a , \" GOTCHA,\" moment, what a little turd.",
            "6 secs to claim and award this too you. New personal record. Kudos champ!",
            "Yeah, you should bang the daughter and make sure he knows it. Maybe walk around the house in boxers.",
            "Policy is not law, you never had to give notice at all.  \n\nLikewise, you can quit wearing anything though some states require you to return equipment/uniforms or get costs deducted (some don't allow even that).\n\n&#x200B;\n\nWell done, I like the cut of your jib!",
            "Lol\n\n>\tAlso for those asking yes we did \n\n\nFucking hilarious.",
            "Okay, US here. I do not get the  justification of REQUIRING x amount of time to quit. What if the job is toxic? What if in your personal life you need to leave the area? And, again, if an employee needs to be fired for whatever reason, that employee has to STAY in that awkward, weird e vironment?",
            "Two weeks notice is a professional courtesy, nothing more. So many employers that end up in this sub seem to think it's actually a legal requirement. \n\nThen you've got this joker trying to trick a kid into working an extra month. I would have just walked out anyway then returned the uniform later with a haha, nice try. But OP upped the ante by walking out naked! Bravo!",
            "\"policy\"  \nA shame kids arent aware most policies are bullshit unless they apply both ways. Want 4 weeks notice? You have to give me 4 weeks notice if you want to fire me.",
            "Also, can I just say, that if the OP gave 2 weeks’ notice at week 101, then he has fulfilled the “<2years= 2 weeks notice” policy. If you beg him to work an extra week, it doesn’t change the past, idiot.",
            "... How did he expect you to give back your uniform freshly cleaned on your last shift ???",
            "I hope op banged his daughter lol",
            "Omg I did the same thing at Applebees!",
            "I don’t know how you’re affording the good life, you were supposed to never work anywhere again.",
            "It is *astounding* the power that \"I don't give a shit if you see me nekkid (or nearly so)\" can give you over petty people. Reddit loves to joke about such things as \"asserting dominance\", but it really does work. Especially against people trying to use it against you as a weapon, it's the perfect uno reverse.",
            "Would your boss give you two weeks notice If he fired you so you could adequately find new employment and not be homeless...? No? Then fuck me giving you a days notice bud.",
            "I find it odd that people think they have to give notice at all\n\nYou don’t get to work two more weeks when you are fired. \n\nWhy should a workplace expect people to work two more weeks when they quit?",
            "You are an absolute legend OP",
            "I always give them my 2 week notice, then walk out that same day and never come back.",
            "Hopefully you fucked his daughter.",
            "Should have ran out in front of customers crying no means no pervert",
            "You banged the boss’ daughter. You win.",
            "How do you wear your uniform for your last shift AND have it freshly laundered at the same time?!  Time machine?!",
            "If you were in the USA when this happened, notice periods are a courtesy and not a requirement*\n\n^^* ^^unless ^^you ^^signed ^^some ^^sort ^^of ^^term ^^contract, ^^which ^^it ^^doesn't ^^sound ^^like ^^you ^^did\n\nYou could literally no-call no-show for a part time job and they cant do anything about it",
            "If you worked there for two years does that mean you started when you were 12?",
            "and did you make a great career ever since ?",
            "How did he explain having an underage boy coming out of his office with nothing but boxers on?",
            "I quit subway the first time and walked out without a shirt...was the only 'uniform' they provided. One shirt for a sweaty teenager...we had the option to by more shirts, but since we could only wear one shirt per shift it was enough.\n\nThey also tried to get you to replace it if you got bleach splashed on it..PS everyone got splashed with bleach at one point, we bleached EVERYTHING",
            "I don't see anyone mentioning the impossibility of:\n\n>Also you need to give us back your uniform on your last shift , and it needs to be freshly cleaned.",
            "I wish you had told us where that was so we could actively avoid spending money there.",
            "I would have said sure thing, get scheduled, come in on time in street clothes, dropped the uniform off, told them have fun covering my shifts, and left.",
            "Hope that you didn’t put any buns in the daughter’s oven!",
            "Imagine threatening a 14 yr old with the idea that \"he will never work anywhere again\"",
            "The “sleeping with” edit came out of the blue with no context so I’ll have to assume you had slept with the boss to get the job? 😄",
            ">which means according to policy\n\nWhat policy anywhere on earth would ever apply to someone who is quitting? \n\n\"Employees are subject to company policy, and if you weren't paying attention I just quit\"",
            "Not knowing much about English labor laws, I hope I assume correctly when I say that I'm pretty sure a notice is *you* (the worker) notifying your *boss* (the employer) that you will not be working there anymore.\n\nWhat possible repercussions could there be for a non-contracted 14-year-old bakery worker to simply quit on the spot?\n\nNot trying to victim blame, as quitting and stripping was absolutely the right malicious compliant call there.\n\nWhat an absolute knob of a boss.",
            "You are of course, prohibited from ever quitting another job without taking off all your clothes first.",
            "2 weeks notice is a courtesy...",
            "Wow what a horrible boss great that you quit he was exploiting you because you didn't know about labor laws in your area.",
            "I did a similar thing 20 years ago while working for Gregg's except I didn't strip almost naked I changed into my clothes in the toilet then stormed out home NEVER to set foot in that shop again!\n\nI hate when employers take the piss out of teens it's utterly disgusting.",
            "I'd have just looked at him, laughed and said \"you'll get the uniform back after it's been laundered. I'm not working for you next week, you can buggar off. And if you try anything with my last paycheck, expect a call from the labor board.\"",
            "Or else...what?  2 weeks notice is a courtesy not a law or requirement.",
            "It’s always funny when managers get the business end of “At Will/Right to Work” employment. They’re so used to just doing it to workers and firing them on the spot and hate it when it cuts the other direction.",
            "Seems like the perfect opportunity to call out at 3 AM every day for two weeks straight.",
            "Lol I have passive aggressively returned a few shirts and hats but never pants, let alone off my body. Kudos!",
            "I'm planning leaving the hospital naked the next time I'm firmly told I can't leave.\n\nOh, the straw here was I didn't have my street clothes last time it happened.\n\nI guess that's a bad idea, but with a little dementia I think I can rise to the challenge.",
            "It's adorable when bosses think you *need* to give notice at all. Like, yeah I stopped showing up. What're you gonna do, fire me?",
            "bro there are so many illegal things in this story i feel terrible for you holy shit r/antiwork",
            "Wow, he shat on you after you were extra nice. What should that teach a teenager? He deserved your MC. And I bet what he did was so highly illegal that he couldn't even think about suing you.",
            "The audacity of some random hole in the wall bakery to threaten \"you'll never work in this town again!\" is just unbelievable.",
            "did you do when you worked there?",
            "Good thing you had boxers on and not something more revealing.\n\nMany youth in the USA also don't know their rights regarding how long shifts can be.",
            "Pretty sure if I was one of your parents I'd be back up to have a word with this baker",
            "Hey, you should report him breaking child labor laws and see what happens. Sounds like the piece of garbage needs to face some consequences",
            "Why do people actually believe in the ‘two weeks notice’ meme? You know you don’t HAVE to work after quiting a job right?",
            "People like that don't have \"funny stories\".\nThey have stories that make fun of other people.",
            "You must've really gotten under his skin if he still drunkenly bitches about you years later. Good.",
            "You should have ran from his office screaming for your life in your boxers.",
            "You could have played into so much fuckery for that guy. Potentially could have caused his bakery to shut down. A 14yr old fleeing from the managers office in only underwear is not a good look, and it sounds like he feels like he's above the labor board.",
            "Why do you put spaces before punctuation?",
            "I told you I’d leave if you didn’t stop squeezin my buns.",
            "At least you didn't walk home in underwear in snowstorm.  https://www.necn.com/news/local/nh-police-chief-fired-walks-home-in-underwear-during-snowstorm/2234629/",
            "I would have been like yeah then just do a : no call no show",
            "You have balls lol. Though I could see my boyfriend doing this haha",
            "If there were an All Star team for malicious compliance you'd be on the roster. 🤣",
            "Funny story, but shouldve agreed and even taken extra shifts and not showed up, mailed the uniform to him and showed up as a customer, the fact that he fucking tells the story, what a loser",
            "That final edit about fucking his daughter absolutely makes my day 😂",
            ">Also for those asking yes we did but not when I worked there\n\nNever would've thought to ask but thanks for the update, makes the story even better.",
            "Strange. Europe? Here, you *should* give two weeks notice, but the length of time doesn't change, and it isn't really necessary to give notice at all. Potential employers may hold that against you, but you aren't going to hurt anything here if you just... don't show up anymore.",
            "Get with the bakers daughter.",
            "Jeez, people will believe anything these days...",
            "I don’t believe this shit for a second.",
            "Was the weather at least nice?"
        ]
    },
    {
        "post_id": "nz1a08",
        "author": "circus_witch",
        "title": "My problem is now your problem",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nz1a08/my_problem_is_now_your_problem/",
        "score": 20840,
        "num_comments": 442,
        "created_utc": 1623605072.0,
        "selftext": "My best friend does park maintenance/habitat restoration in an urban park. She finds all sorts of wild stuff, including drugs, drug paraphernalia, and occasionally hypodermic needles. There used to be a city task force that would come collect them, but it was discontinued. My friend would pick them up and dispose of them as safely as possible to reduce risk for park users. Eventually, she decided to ask the building manager (not her supervisor, but the person in charge of the facilities for the building she works out of) to install a sharps container in the bathroom (which park users have access to). He refused on the grounds that it would \"encourage drug use.\" Counter arguments to the point were unsuccessful, as was pointing out that NOT having a sharps container endangered her and the custodians who took out the trash.    \nSo, she started bringing the needles to him whenever she found one, and asking him to dispose of them. It only took about five needles before he installed a sharps container in the bathroom.",
        "permalink": "/r/MaliciousCompliance/comments/nz1a08/my_problem_is_now_your_problem/",
        "comments": [
            "That's how you stick it to him.",
            "As someone who has had to do various injections while away from home, *every* public bathroom should have a sharps container. Especially restaurants and places like parks where someone eats or spends a lot of time at for those that use insulin. Most people will just put the cap back on and throw it in their container when they get home, but sometimes you lose it and now you’re carrying around an unprotected needle, and homeless people need a place to dispose of their needles. They’re inexpensive and you won’t need to replace it often unless you’re a high traffic area like an airport or major park.\n\nTip for anyone that loses their cap: put the needle in an empty plastic bottle, preferably a rigid one.",
            "Wouldn't want to encourage insulin use.",
            "For some people, the only way to get them to understand that something is a real problem is to make it _their_ real problem.\n\nThis applies in _so many_ contexts.",
            "I work in urban parks myself. Not sure where this is located, but for my municipality sharps containers in bathrooms ended up not working well, we still try, but they end up being destroyed and needles stolen. My boss even installed a heavy duty one encased in a thick cage, didn't matter, still destroyed.",
            "Diabetic. Not on insulin now but I was during all three pregnancies. It is always great to see sharps containers in public restrooms. It never occurred to me to use heroin instead of insulin. Maybe I should have tried?",
            "it doesn’t encourage drug use it encourages safe disposal of drugs. if people are going to shoot up in a park bathroom they’re going to do it no matter what might as well make it safer\n\nafterthought: also safer for anyone who is diabetic or needs regular shots",
            "I'm gonna say this one time, with large letters, so those in the back can read it, too:\n\n# Harm reduction and mitigation for a society does not, and never has, increased negative individual behavior\n\nIf you want less people doing drugs in that area, open free clinics nearby. Treat it as the disease it is; you have an outbreak - get health care workers there to help treat the disease.\n\nIf you don't have that level of control and can't get the government to act, you mitigate the harm to everyone else as best you can.\n\nThank you, OP, for dealing with this sensibly and directly. Tell your manager if he wants less drug use, to use some of his power to push for a couple nurses from a free clinic to hang out on occasion and hand out literature that'll be left there, and just to answer questions.\n\nSave one life, save the world entire: You get one person killing themselves into a program and you've done more good for this world than most have in their lifetime.",
            "So, he got the point.",
            "Hi there! I’m a Community Health worker and I primarily work with IV drug users and have lots of experience with harm reduction and needle disposal! **Here are some really important tips if you ever come across a needle:**\n\n- Never try to recap a needle that is not your own\n- If you see a syringe, assume that it still contains a needle\n- Assume that all needles are contaminated \n- If you get stuck (pricked) by a needle, call your doctor or go to urgent care ASAP. You will want to start preventive medication as soon as possible, because the sooner you start it the more effective it will be!\n- Never put a needle in the recycling or loose in a trash can, because someone else could get stuck by it\n\nAnd on that note, here is how to safely dispose of a needle:\n\n- Never pick up a needle with your bare hands, EVER! Also assume that any needle you see is contaminated.\n- Instead, pick up needles with a pair of tongs, you can get tongs that are specifically made for trash/litter pick up, but you can also use a normal pair of kitchen tongs just as well!\n- Before you pick up a needle, identify a container that you will put it into. A sharps container is best, but if you don’t have one you can use another thick, heavy duty plastic container that can be capped. Something like an old laundry detergent bottle, NOT thin plastic like a milk jug. Never use a can, thin plastic that can be punctured, or a glass container (it could shatter)\n- Open up the container before you pick up the needle, and also it’s best to label your DIY sharps container with something like “needles” or “sharps do not recycle”\n- Gently use the tongs to place the needle into the container. Place the needle with the sharp end facing down into the container first. Do NOT fill the container all the way, you don’t want their to be any needles close to your hand when you screw the cap on\n- Tightly cap your container\n- Dispose of your container. In some states you can dispose of it in the trash (NOT recycling), but it’s best to look this up first! If you can’t dispose of it in the trash, you can see where your local sharps disposal program is",
            "The building manager is a prick.",
            "Harm reduction does not equal encouragement!!!",
            "Sharp idea!",
            "What kind of mind fuckery is that? That's like saying installing trash cans will encourage littering.",
            "Are y’all from the dadjokes sub",
            "He just took a little needling to understand where she was coming from.",
            "That’s one way to poke the Bear.",
            "I inject chemo every week. Got a Sharpe's container for free directly from Sharpes. Come in a special box with instructions on how to pack it up safely and send it back to them (for free). Then they send you a new one for free. Been doing this for years. Great service!",
            "Sharps containers encourage drug use? That's one of the dumbest things I've ever heard.",
            "That was a dope move",
            "Who knew that the way to stop people from using drugs was not giving them access to dispose of them safely. We've been wasting all this time and money on drug programs and rehab centers when all we had to do was make drug disposal dangerous for noon drug users. I know the only thing that has stopped me from starting heroin was not having a place to throw away my needles",
            "\"...habitat restoration\"...\"finds all sorts of *wild stuff*\".  My mind went a more \"natural\" direction.",
            " It is abundantly clear who the heroin of the story was",
            "What is a sharps container?",
            "If you have a problem that needs to be taken care of, make it the problem of your superior. Shit gets done so much quicker like that.",
            "Not to put too fine a point on it, but OSHA probably would've had something to say about it.",
            "She needled him until he gave in.",
            "She was a heroin(e) of her own story",
            "Honestly, cities should just offer a bounty on any returned needles, no questions asked. Offer like $1/needle. There will be addicts turning in their own needles, and if they don't, there will be other addicts hunting for them and turning them.",
            "The failed war on drugs really gave people idiotic misconceptions about drugs",
            "...and then he started using drugs...",
            "I hate puns, y'all!   \n:-)",
            "Who thinks like this? A drug user will not be like \"welp theres no safe place to dispose of my needles, guess I won't do them\". Also those boxes are also for people with other medical conditions that require needles.",
            "*I hit the city and I lost my band*\n\n*I watched the needle take another man*\n\n*Gone, gone, the damage done*",
            "Very sharp-witted.",
            "If the manager was sharp, he would've installed the containers when you pin-pointed the issue for the first time.",
            "What person in the history of the world ever saw a sharps container and thought “hmm, iv drug use might be a great idea!!”",
            "That's a good point. You are a very sharp person. You contained the container situation.",
            "He probably didn't realise how bad the problem is.\n\nAnyway, I don't know how many times ive seen a sharps container then decided to hunt down the nearest drug dealer to score some drugs.",
            "Makes sense, the primary thought on most drug user’s minds is definitely “well I can’t use a bathroom without a sharps container”. I thought sharps containers were mostly for people who inject medically, not recreationally",
            "That's not malicious compliance, as *there was no request*.",
            "They should also put a blue light in the bathroom, that makes it hard to find veins, so they won't shoot up in there.",
            "Who is you supervisor? Mike Pence? He had similar attitude as Gov of Indiana. Didn’t want to start a needle exchange program because it would encourage drug use. Well his hand was forced when a major HIV outbreak occurred in a mostly rural southern part of the state. I saw recently where they have discontinued that program. Let me off this merry go round!",
            "What a mindset!  I guess you could get rid of garbage cans to reduce litter while you’re at it.  Limiting access to umbrellas will keep people dry.  Seatbelts just encourage accidents.",
            "Thank you! It drove my mom wild when she had my dad’s diabetic syringes in her purse and a cap came off.",
            "Are there now less needles outside in the wide open",
            "The best part of this outcome is that it's obvious he caved because he was being unreasonable. He did a backflip as soon as he \"became empathetic\".",
            "Sometimes, you just have to follow the rules...especially when it comes to inconveniencing the boss!",
            "Related but off topic. In the military, we were trained on using atropine auto-injectors in case we were exposed to nerve agents. After you stabbed yourself in the leg with both needles, you were to take one, stick the needle through your breast pocket and bend it down, so that if someone found you doing the herky-jerky they would know how many injections you'd had (3 max).\n\nThe question - how hard is it to bend a needle without slicing yourself open?",
            "Does having garbage cans encourage consumerism?.  I'm sure you could argue to your boss to remove all the garbage cans and of course no one would think to litter.",
            "I work environmental service at a hospital and sharps in regular trash cans are the top cause of people getting pricked and getting sick for us and nurses",
            "Kudos!",
            "She's shaaaarp, sharp!",
            "She finds all sorts of wild stuff including, drugs, drugs, & drugs.",
            "I found a syringe in some low bushes walking to a local mall.  It was...weird, but not overwhelming...trying to be careful getting it to the local trash can.  I want to wonder how things could be this way, but I know that's asking too much.",
            "Remember, only users lose drugs (and drug paraphernalia)",
            "Well he wasnt the sharpest tool in the shed.",
            "I think the ~~enemy~~ manager got...the POINT",
            "i think this is great execution",
            "His logic is so backwards",
            "Not trying to be that guy... but the public has an hard enough time separating recycling from common trash.\nI doubt someone using illegal drugs would take the time to properly dispose of it.\nI know that some of it IS legal drugs and that would work for them.",
            "I can promise you, heroin addicts will never think, \"damn, I would have shot up here but they don't have a sharps container.\"",
            "Just a random tip: if you are going to clean up stuff from a park, like needles, handle with care and put them in an empty soda bottle.",
            "The logic of the building supervisor is so flawed. Gee, I don't shoot drugs, but if I know a sharps disposal unit is available I’m going to go for it!",
            "While I agree there should be a sharps container, for diabetics and such if for no other reason, users of illicit drugs often don't bother to use them.\n\nIn my area, there was an article about a local school where they kept finding needles because junkies were shooting up on the school steps (an elementary school, I might add), and just leaving their needles for kids and staff to step on.  There was a park adjacent to the school, which had sharps containers by the garbage bins, but they'd just leave their needles in random locations.\n\nYou need to remember that while some of these people will use the containers, many of them don't give a fuck about anyone except themselves.  The thought of a child or pet stepping on a used needle and potentially getting any of a number of serious diseases doesn't even register for these selfish bastards.",
            "That’s insensitive to diabetics",
            "But seriously, how much fucking drugs are people doing out there??",
            "....where's the malicious compliance? Almost 10k people seem to have forgotten what the main point of this place is.",
            "So, she started bringing the needles to him whenever she found one\n\n>Malicious compliance is the act of intentionally inflicting harm by strictly following orders or rules\n\nDid the boss rule that she was to personally bring each and every needle to him?",
            "I bet your boss was a republican",
            "Wait wait wait...back up....where are the drugs?",
            "Who leaves drugs in a park?",
            "this is just fucking stupid",
            "[removed]",
            "Unreadable.",
            "Your friend’s a good egg",
            "Picking up litter is also an important job.",
            "Great story and maybe the mgr learned something.",
            "Brilliant.",
            "*Our* problem.  COMMUNISM!",
            "r/MaliciousInitiative",
            "Simple, effective communication.",
            "Brilliant!",
            "I like the way she thinks.",
            "Using Word wouldn't solve the problem either.",
            "Where I am, people literally break into the sharps boxes to reuse the needles. So I can kinda see where he was coming from. Hopefully it improved your friends situation.",
            "What a prick",
            "Lol what a dick",
            "Sounds like your dad had your back, too.)",
            "Me, wondering what the fuck is the Fortress",
            "Did the container help?",
            "I've had this exact argument with several otherwise rational people. Like, why in the heck should maintenance and cleaning people be endangered all the time because a few drug addicts might see a big red plastic box on the wall?",
            "Using Word wouldn't solve the problem either.",
            "LOL! That’s great!",
            "Sticking it to the man. Yeah.",
            "c#, run",
            "That is a great story!",
            "Chaotic good, well played.",
            "This story is rigged",
            "People are going to use needles, both for illicit drugs and for medical shots. No one ever was like 'oh gee, there's a sharps container, I'd better go find some heroine now that there's a responsible place to dispose of the needle'"
        ]
    },
    {
        "post_id": "bo92jl",
        "author": "wrassehole",
        "title": "The HOA doesn't like my project car, so I've decided to park it legally in front of the neighborhood's grand entrance.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bo92jl/the_hoa_doesnt_like_my_project_car_so_ive_decided/",
        "score": 20852,
        "num_comments": 1031,
        "created_utc": 1557780774.0,
        "selftext": "For context, my family and I recently moved into a rental house while our new house is being built.  The rental is in the back of a gated community on a mostly undeveloped street.  \n\nYesterday, I received a letter from the home owner's association informing me that I'm not in compliance of the \"strictly enforced by towing\" restriction stating that vehicles may not be parked on the street overnight.  In the letter was a picture of my project car (old BMW) parked beside our house on the street.  I decided to look up the HOA's restrictions (which I haven't seen before since I'm a renter) and discovered I'm living in HOA hell.  The street parking rule is just the beginning of a long list of restrictions including one warranting a hefty fine for \"leaving the garage door open when not in use\".  \n\nThis came as a huge surprise since several of my neighbors have parked their cars on the street without problem since I've lived here, so I assumed it was okay.  I can only imagine that they've singled me out because my car is 30 years old, however, in my defense, it's very presentable and by no means junky.  \n\nBeing singled out made me incredibly frustrated to the point where I started doing legal research.  It turns out my HOA has every right to tow my project car since it's parked on a private street in the neighborhood.  The good news for me is that the street just outside of the neighborhood is public, and it's 100% legal to park on it for any amount of time.  \n\nUnfortunately for the HOA, the closest section of public street to my rental house is right in front of their nice gated entrance.  Ironically, my old BMW has now become part of their image, and there's nothing they can do about it until I move out in a few months.  \n\n\nTL:DR: my new HOA threatened to tow my project car.  My compliance was to legally park it just outside of the neighborhood directly in front of the main gated entrance.",
        "permalink": "/r/MaliciousCompliance/comments/bo92jl/the_hoa_doesnt_like_my_project_car_so_ive_decided/",
        "comments": [
            "Your classic BMW is too nice to grace their sign with man. I think it’s worth investing $200 in a barely drivable hooptie with different color doors missing windows, on three of those undersized, temporary tires/wheels, and one normal one.",
            "HOAs — your friendly neighborhood fascists.",
            "/r/FuckHOA",
            "Friend of mine had a project car that was all bondo and primer at the time. His HOA didn't care for it and sent a nasty-gram \"All cars must be painted\".  So he bought a cheap can of white house paint and a roller, along with some tape for the windows and got to work.    It looked a million times worse after that. But he was now within the rules.   The best party of the story he painted it right in the parking lot.",
            "Would love to see a photo with the car parked.",
            "Might want to get a sunblock windhield thing that says \"Parked here by order of the HOA\"",
            "HOAs are one of those ideas that I feel was a really good one when they first got started, then they were perverted and twisted into the ridiculous hell they are now.\n\nI hope they don't try to make a workaround or amend the rules and keep giving you hell.",
            "Unrelated: but what model? I've owned 10+ old BMWs and have a major soft spot for them.",
            "HOAs, the embodiment of petty power tripping.",
            "Love HOA revenge storries",
            "I don't live in a house with a HOA, but I've had some really bitchy neighbors who imagine that we have one and they police me.  Boggles my mind.\n\nIf people want to be bitchy and imaginary bosses of what is think is \"right\", they'll make your life miserable.\n\nMy (expensive, professional) landscaping is designed for wildlife.  Theirs is manicured and toxic with fertilizers and pesticides.  They hate it and tell me about it.  \n\nI guess that's my malicious compliance.  I ignore them and stay.",
            "I totally get the point of an HOA, and I think people should have the choice to be in one if they wish.  I also think they can be pure hell.  I very much wish there was some defacto standard way to rate specific HOAs so that if there are evil neighbors or evil HOAs that they can just as easily decrease the property value as an HOA can increase it.",
            "I'd have also just started reporting the other cars",
            "Don’t park there... \n\nOk! How’s about here suit ya?!",
            "Hopefully a Google Street View car comes by soon to snap an update of the entrance to the gated neighborhood.  \n\nWith your project car front and center :)",
            "If you were going to be around longer than a year, I'd suggest going to the next HOA meeting.  It's typically *just* the board, with not many actually showing up.\n\nIf that's the case, start talking to neighbors that aren't on the board.  Find out how many feel negatively about the HOA.  Often, it's many to most.  If you find that to be the case, run for HOA president the next time it's due, coordinate with your disgruntled neighbors, have them show up and vote for you and the others that are willing to run to control the board.  Boom, you're HOA president and have a board of people who hate the HOA.\n\nThen dissolve the HOA.\n\nI've witnessed this first hand and it's glorious.",
            "Just so you know:: some states have laws regarding moving your car every 2 days when street parking. Check on that so they don’t screw you",
            "30 year old BMW? Late model E30? E24??Don't leave us BMW nerds in suspense",
            "Be careful. If the vehicle doesn’t move for a certain period of time, it could be suspected to be an abandoned vehicle and towed by the city. Look up your local laws for public street parking to make sure.",
            "I've lived in a complex with an HOA for over 15 years now and it's been fine.  But I don't really care too much about things like what color my front door is, and I like having the external maintenance be someone else's problem.  An HOA populated and run by jackasses will be horrible, but the same can be said of any organization: business, union, school, government bureau, non-profit charity, you name it.  Humans can turn anything into an arena for primate dominance games.  We're clever little monkeys that way.",
            "Please update us.",
            "I think I speak for r/projectcars when I say, whatcha workin on",
            "There should be a subreddit entirely of HOA being horrible and abusive with what little power they have",
            "Why people want to live in a HOA is beyond me, anyway great thinking. As long as the car is off HOA property they can do little but the city can (assuming they do anything)",
            "America, land of the free... Hello, your grass is 2cm to long",
            "You should grab the HOA president one night and walk through the neighborhood demanding all the cars on the street get towed, I feel like you could sue for discrimination if they refuse.  I have a feeling that rule will be brought up at the next meeting.",
            "For such a perfect story, a picture of that beauty of a car would be swell.",
            "you should repost this in /r/fuckHOA/ . They might get a kick out of it.",
            "Does the HOA policy say anything about parking on your lawn? I would be headed for the most obnoxious place that isn't specifically listed.",
            "I feel you friend. I parked my project caravan (1956 bondwood 11ft) out of sight, behind my house and shed. I got a complaint and so I went and got it registered and moved it into my driveway, which also happens to be in the middle of the private court we all share. Now they all drive past it everyday but there's nothing they can do about it because it's a registered vehicle and I'm entitled to the parking spot in front of my shed. A few of my neighbours came out and had a good laugh when they saw me moving it into the driveway. Not everyone is a nut bag.",
            "There are a couple of ways you could maliciously comply back.  First, you're a renter, not a homeowner, so the Home Owner rules might not apply to you.  It could be argued.  Second, take time one day,  take a camera and photograph every other car parked on the street, and insist on equal enforcement.  If you force them to tow everyone, you'll be unpopular for the few weeks you're there, but the HOA will be unpopular for years.",
            "[deleted]",
            "Can we see it?",
            "Pictures pretty please",
            "Upvoted because project car, stayed for malicious compliance.",
            "Best look into abandoned car ordinances and whatnot in your town. Sometimes cities include language like, car has to be moved more than 1000 feet after X number of days in the same spot. You could probably call non emergency number of local PD and ask about parking enforcement. Also, keep an eye out for chalk marks on tires. If you have really pissed off HOA Nazi person, they might come back at you. Also, make sure you aren't leaking any fluids. You can call the FD and have them come robe the vehicle if oil or antifreeze is dripping. I have dealt with people this petty...seriously.",
            "So as someone who doesn't and hasn't ever owned a home and has only lived in rural areas, what exactly are home owner associations? Because I thought it was just a group of people getting together to try and make a neighborhood a better place, but I didn't realize they actually had legal authority.  Like, if I owned a house and someone said \"you need to do x or we'll take legal action\" I feel like my response would be \"fuck off\" if what I was doing was on my own property and not encroaching on other people's space (ex. Blaring music loudly or something). But yeah everything I hear about Home Owner Associations sound like they're a pain in the ass",
            "I applaud your creativity in massively saying F U to the selectively enforced rules of oppression",
            "I'm sorry...? You can be fined for leaving your garage door open?? What kind of backwards, stazi bullshit is that?? You can't leave your garage door open?? Do they come in and make sure you've turned off the lights in the room you're not in too?? Jesus. Fucking. Christ.",
            "Are there laws where you are about how long a car can be parked on the street before it's declared abandoned? I would check that and make sure the HOA doesn't try to get the cops to ticket you or something, especially when you go on vacation.",
            "I'm a simple man. I see an anti-HOA post, I upvote.",
            "Update the story!\nPics also!",
            "I drive a 1989 324D and I can’t believe that people would think any E30 car would look crappy. If anything I’d want people to park those on the street.",
            "give us some pics on r/projectcar",
            "I would draw obscene things on the windows with  white shoe polish.",
            "Find out if they have an agreement with a towing company, then just bypass the HOA by cslling towing company directly to have your neighbors's cars towed.",
            "OP, I think we all deserve a picture of your BMW.",
            "My neighborhood has an HOA.  It's in the bylaws that EVERY property owner (18 properties)  needs to be present and vote in favor of an action for it to pass.  Not a bad idea.  But we have a pipeline running through the neighborhood.  It's owned by Shell.  So according to by-laws, the CEO of Shell has to come to the US midwest for a meeting to regulate trash can placement.  I don't ever want to move!",
            "> it's 100% legal to park on it for any amount of time\n\nJust be mindful that in most places in the US, there is a 72-hour limit. If you're not in the US, no worries. But if you are, these restrictions are sometimes rarely enforced, sometimes strictly enforced, depending on the area and the local enforcement department. Good luck!",
            "Make sure you double check public street parking regulations.\n\nIn my county it’s 72 hours and then the vehicle has to be moved at least 1/4 mile.",
            "You should remake a copy with no adress and put it on every body's car so that way the whole neighborhood knows about the rule. See if your neighbors want to change a few rules after that",
            "Put pics in the writeup?  We want yo see this car",
            "In my best Men's wearhouse voice:\n\nThey're going to write a new rule because of you. *I guarantee it.*",
            "No picture of the ride?",
            "I want updates",
            "Oh I LOVE it!\n\n> my old BMW has now become part of their image\n\nIt would be utterly perfect to leave it there until Google maps picks it up, then Every person ever who tries to roam around your neighborhood to see the project gets to see your car :D",
            "As a European, the entire concept of someone (who is not the city) owning, making rules for, and putting gates on, entire neighborhoods feels so wrong to me.",
            "From outside the US, HOAs look like some sort of hellish nightmare. Why do they even exist? I can't even imagine some random bellend trying to give me a fine due to my house being the wrong colour or grass being the incorrect length. Madness.",
            "Shame on your rental agency... they should have provided you the HOA bylaws before renting to you.",
            "This is all meaningless until you post a picture of your car.",
            "I serve on the HoA board for my neighborhood. I'm also in my mid 30's. I went over our by-laws before i joined and they are pretty reasonable; no crazy colors, power wash your house if it's looking dirty, don't leave trash just laying around on your property, common sense things that anyone would/should do to keep up their property. The 3 years i've been here I think we've only given out one fine, and that's because the person ignored 10 please and thank you letters to park their work truck in their drive way and not on the street after hours.  \n\n&#x200B;\n\nI have my own stuff to worry about, so i make it a goal not to bother other homeowners but I will be laser focused on the nasty people. For example we've had one person who didn't want dogs on their front lawn, so instead of just putting a nice subtle no dogs please sign, they  went and spread chili powder along the border of their yard so that dogs would not sniff around their property. Or the other person who would let their dogs poop on their deck, and instead of picking it up, would just hose it onto the common area. We also have the younger kids who will do 50mph down the street blowing stop sings when the speed limit is 15. Those folks right there, i'll have a respectful conversation with you about your actions, and see how it goes from there.",
            "Just watch out that they won't key it or do something petty to it",
            "Lol love to see this man. Post pics!",
            "State and city law normally overrule HOA rules.\n\nAlso check you rental agreement, if there's no mention of the HOA, they can't do anything to you.",
            "Not sure were you are but in my jurisdiction public street parking is 3 days",
            "Would you rather have an HOA or be stuck living in the ghetto? 🤔",
            "Your assumption that you can park there legally for \"any amount of time\" is, I can just about guarantee you, dead-wrong.\n\nYour assumption that the HOA cannot come after you for what you are doing is also almost certainly wrong.  Catch-all behavioral/anti-nuisance provisions in the CCRs would arguably cover this situation.  Once the HOA starts dunning you, you'll have to spend a bunch of time and money fighting it.  I've had to litigate a few of these.  \n\nYou know this situation better than I do, but I think you should tread a bit more cautiously here.",
            "God, I *loathe* HOAs.\n\nWhen I bought my first home, my HOA was useless. Our gates were non-functional for like a year. Technically, under the HOA agreement and county laws, our private road was supposed to become public and we weren't to pay for maintenance. I filled complaint after complaint - nothing was done. When I got a copy of the HOA's financials, I questioned them as to why the phone line (note: *ONE* phone line, for the gate's phone box that would call residents so you could press 9 and open the gate from your phone) cost *$4000* **PER MONTH**. I work IT in networking and was responsible for ordering telecom services for offices. Some offices, we had T1 lines which are 24 phone lines. A T1 line from the local telecom was $500 per month. The HOA said that's what it was and refused to provide me copies of the actual bill. So I filed a complaint with the state's AG office. The response I got? \"Fuck off\" (only in political language). We had a problem with non-residents using our pool from neighboring communities (because of the broken gates). A lot of us complained we couldn't use our pool that we were paying for. Instead of installing a lock on the pool gate we could open with our gate cards (RFID cards), they installed a $70 sign. Guess what? It didn't work because nothing was stopping non-residents from opening the fucking gate!\n\n**FUCK. HOAS.**\n\nEdit: Aww, did I hurt an HOA president's feelings?",
            ">  I decided to look up the HOA's restrictions (which I haven't seen before since I'm a renter)  \n\nLesson to renters: ask about this sort of thing\n\nLesson to landlords: give your tenants a copy of the rules and make sure the lease says they're responsible for fines etc.",
            "HOA's are just a collection of hostile people on a power trip.",
            "It would be fucking awesome if Google maps had to redo that street and your car was forever parked there for all of Google maps users to see.",
            "you think that’s bad?\nMy HOA doesn’t let me park in my own driveway. \nmy own. Driveway.",
            "[deleted]",
            "I really hate HOA's.   They're set up by real estate developers and because one signs into a legal document in order to procure a home, they are legally bound by these obligations.   I've never had to deal with one, but I've had friends who have, and I'm sure any aware person has read news stories about them.\n\nI went out of my way in order to not be bound to one when I recently moved, and I'm much happier for it.   \n\nFor the record, I take good care of my house and my yard and do not leave things laying around in my yard.   I just like a degree of freedom on if I want to fly flags and what flags I want to fly, and maybe if I do leave some work tools in my yard one day I won't be fined over it.  It's a freedom issue.",
            "Man, I had a real estate agent who knew I hated HOA's but after a few months showed me this super nice house.  Was like 5 bedroom, 3 full bath, it was CRAZY nice and I was like \"Dude, I can rent out like 2 rooms and make some money\".\n\nThere was a lady there with him and I didn't really ask a question just figuring she was with Him.  So he shows me and I love it and he's like \"So, the thing is, it's an HOA house\" and I was like \"HOA?  Fuck no.  I hate HOA, you know this.  The head of HOA's are wannabe Nazi's.  Why did you show me this house?\"  Then she spoke up, introduced herself by her name, and the head of the HOA.\n\nZero shame, I told her \"Look, I'm not buying a house in an HOA because I am buying my house, not the HOA and I don't like being told what I can do with my house.  Simply put.\"  Immediately left."
        ]
    },
    {
        "post_id": "wee9dy",
        "author": "scifielder",
        "title": "Sorry, my shift is over.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wee9dy/sorry_my_shift_is_over/",
        "score": 20836,
        "num_comments": 482,
        "created_utc": 1659453192.0,
        "selftext": "Many years ago, I worked for a cafeteria/catering company. The catering was much the more lucrative of the two. Between mealtimes we would work on catering projects. This would often run us past the end of our shift, resulting in overtime. One of the management team, recently promoted, decided his thing was going to be eliminating overtime. He held a meeting and announced to the staff there would be no more overtime. Clock out at shift's end, no exceptions. After, he got me aside and told me as a supervisor, I was expected to set an example. Ok, sure. A couple days later, I was working on a cheese display. When my shift's end came around, I put everything down, walked to the clock and swiped my card. I hear, \"Hey, where are you going? That's not finished!\" \"No, but my shift is. I'm setting an example.\" I answered. \n\n\"Well, go finish it.\"\n\n\"I can't. I'm off work now.\" And left.\n\nThe next day it was announced that all projects underway at the time would be allowed to be finished regardless of time, as long as it wasn't abused. In other words, no foot dragging.\n\nTurns out all the hourly employees also left, and he had to finish several projects by himself. Since he was on salary, there was no overtime for him. I understand he stayed quite late.",
        "permalink": "/r/MaliciousCompliance/comments/wee9dy/sorry_my_shift_is_over/",
        "comments": [
            "This is why if you start a new job as a manager you don't touch anything for at least a month so you can see how things do or don't work.\n\nIf you are thinking of changing things ask some of the people who have been around for a while what they think first.",
            "Managerial thinking: \"If I eliminate overtime, the exact same amount of work will get done, and it will cost less money! Why hasn't anyone thought of this before me?\"",
            "It amazes me how much employers fail to understand overtime.\n\nOvertime is a signal to management that inefficiencies exist and/or there is a need for more workers. Arbitrarily forbidding or eliminating overtime is NEVER the answer. Overtime is a valuable symptom to let you know there is a bigger issue to address.",
            "Good for you. Serves him right.",
            "If any manager ever got on reddit they would know this crap never works for them. LoL",
            "You'd think this takes a special level of stupid, but it mirrors my experience working in a massive high tech company.\n\nAs engineers we were salaried and 9 to 5 workers, which sucked when we had to work overtime. Which was a lot. \n\nHowever, we got paid for being on call during nights and weekends. Could be a few hundred dollars if we had to come in and work on a line down situation. Or a nice dinner and movie worth if we never got called, but we were available. This was a 24/7 manufacturing plant.\n\nThen management announced that there would be no more on call pay for coming in or for being available.\n\nObviously this took only one incident of the factory grinding to a halt and nobody willing to come in during their off time for them to completely flip their shit. A few meetings with folks saying stuff like \"I'm not in town on the weekends\" or funny stuff like \"I have to take care of my kids and family in the evenings\" and they started paying us again for being in call.",
            "He went to school for supervisors, they said, screw your employees, eliminate overtime. No thought to adapting to situations, just get rid of it, and he did...then he didn't. Unfortunately typical. The spirit of running a successful company has lessened over time and bottom line is the focus. What they don't understand is that creating loyal employees is much more lucrative over time.",
            "My DIL was promoted to \"manager\" & I use term loosely. She was glorified slave. She was told NO ONE was allowed over 20hrs even previous full-time people. She told them no one would stay. That's a her problem they said. Guess who worked salary & was never home?",
            "Had this with the Co-op in the UK and deli staff. No overtime after 9pm closing, but they wanted the deli open until closing time, with no time for cleaning. \n\nSo the evening staff left everything dirty and food left out, the morning staff had no time to clean anything and had to throw all of the food away. \n\nLasted a day until they relented.",
            "A little OT here and there to finish a project is ok. If  your company has crazy OT, you're understaffed and management needs to fix it  before the exodus starts.  When OT becomes a burden to your quality of life, all you want is out.",
            "A good company doesn’t need overtime, it hires enough people to do the damn job!",
            "When will the MBA crowd learn overtime isn't the issue.",
            "Well played!",
            "Had the exact same thing happen at a pizza place I worked at.  I pulled 60hr weeks regularly until boss got mad I was making so much overtime. Then pretty much repeated this story",
            "When a company eliminates overtime while still complaining about work not being done, that means they want people to work off the clock but won't come out and say it.",
            "You catered to his demand and taught him a lesson!\n\nGreat job!",
            "“As long as it’s not abused.” So out of touch. With a few exceptions of course, most people don’t WANT overtime. They would rather, you know, be home with their families and stuff? Have a proper work/life balance? Sure the occasional overtime is awesome but consistent OT is when people start burning out.",
            "It astounds me how many manglers are pound foolish and penny wise.",
            "Wow. Lol how'd he not see that coming.\n\nReminds me of this pizza place I worked for years ago. It was a shame because they actually put a lot of care into their product. Everything was made from scratch and they only used quality ingredients. They were all straight from Italy or NY. Still probably the best pizza I've ever had. \n\nOnly problem was that they were like allergic to paying people. Our checks were fixed at 40 hours, but days absolutely never went less than 9 hours, even with a half hour lunch. So, at the end of week, you'd end up having worked like 6-9 free hours. It was nonsensical. Especially because they had very high standards in regards to cleaning and closing procedures, which is good otherwise. \n\nEventually, I started leaving right when my 8 hours was up and they got pissed. I explained why that was reasonable and they offered me a a deal to get half my hours on the books and half off. I figured that was a little weird and he should have just offered me full cash, but I said okay. This dude just took my net pay, cut it in half and gave me that half in cash. I thought he was fucking joking at first. I quit that day. Plus, this was in like 2012 and he paid absolute bare minimum wage, which was $7.25. lol I was making just over $200 a week just to be exhausted and drained all the time.",
            "Well. If you think about it he achieved his goal and eliminated OT. Good for him.",
            "My brother had a manager got rid of rostered days off.\n\nSo everyone just started doing the Aussie thing of chucking a sicky. Calling in sick so they could go to the beach, or shopping or whatever.\n\nCost a hell of a lot more in lost production and temps.",
            "My Mgr sent me on lunch when we got busy, I was a server, missed the whole rush.  Time to clock out comes and a ton of tables come in,\n\nme see ya!\nMgr you can't leave its busy\nMe my shift ended and I'm already clocked out\nMgr if you leave I'll write you up. \nMe lol go for it. \n\nShe got told no by the gm cause well my scheduled time was over.",
            "It's always on the management. They can either approve overtime, or they can hire enough staff. If they want to cut both, then they get to make up the difference.",
            "Sounds like it was a calculated attempt to see if y’all would work for free to me",
            "This is why it is a good idea to involve the people in the field and trenches when making new SOPs / work procedures. Mostly because they can give you a list of what works and what doesn't out in the field.  \nFrom there you can trim down what is not a priority.  \n\n\nThen again, manglement is never going to listen to some blue collar, oil-stained coverall tech...",
            "It never stops to amaze me when new managers come into a job and thi k they need to change things in order to look good.  If it works leave it alone.  If it doesn't work the employees",
            "It is always the new managers that have to learn the hard way. lol",
            "Fuck around and find out",
            "Is no overtime for salaried workers a thing anywhere outside of the US?\n\nI'm salaried. I work 40 hours a week. If I have to stay longer some day I can leave or come in later another day. I can also chose to be paid 150% or 200% of my hourly rate.\n\nThat's guaranteed by law.",
            "That’s awesome. Nice taste of his own medicine.",
            "I love new managers. They try their hardest to reinvent the wheel to show how they are worthy of moving up, yet fail to understand why the wheel was round in the first place. Things like this happen organically for a reason, and only the top 0.1% of brilliant people could ever hope to change things for a reason better then that organic growth. The rest fail in such an entertaining way.",
            "They will do anything but pay for labor",
            "He reaped what he sowed",
            "This is the way",
            "He got what he deserved.  Not sure if he deserved the promotion after that lame brain decision.",
            "The number of people in leadership who are so bloodly daft they dont understand the words they say baffles me. You must leave at this time, hey why you leave? Why do you think becky. It isnt cuz my taint issues. Its cuz you told me to.",
            "'set an example'. Get fucked, UPS!\n\nI was cut out of the running for supervisor, because i got hurt twice in a year. Manager said it was unbecoming of a supervisor to get hurt so much, and they need to set an example.' fucking pricks.",
            "You have to love it when the newly promoted try to reinvent the wheel.",
            "Most of the posts under this sub have the same plot.\n\nNew manager comes in\nEnforces something that shouldn't be enforced\nEveryone complies maliciously\n\nBottom line - If it's working, don't try to fix it period.\n\nApplicable to machines, process and code",
            ">Since he was on salary, there was no overtime for him.\n\nCatering is not an administrative job. He was not overtime exempt. He's a victim of wage theft.",
            "Manager save the company a pile of money at the expense of their own time. Ohhh… the burden of power.",
            "My philosophy is I'm hired to work a specific amount of hours.  I  not contracted to complete a specific job.",
            "That was a beautiful burn on the salary \"no overtime\" exceptions boss you have there.",
            "Manager: “no more overtime! No exceptions”\n\nAlso the manager: “hey where you going? The work is not finished yet!”\n\nAnakin Skywalker: “Well, hold on, this whole operation was your idea”",
            "nice 😅 deserved",
            "Reddit needs a LOVE button.",
            "Oh this is good! I have a similar story myself… although for me it was my last day at the job…",
            "> The next day it was announced that all projects underway at the time would be allowed to be finished regardless of time, as long as it wasn't abused.\n\n*Allowed* to be, or *required* to be?",
            "Serves him right. \n\nI wonder if he learnt a lesson.",
            "Don't you hate it when a new \"boss\" comes around not knowing anything about how things are ran and decides to make changes just for the sake of putting their \"stamp\" on things.  Serves him right for having to do all that work on his own, hope he has to cater something completely by himself to see how dumb his \"NO OVERTIME\" policy is.",
            "So he was the brightest of  people and didn't expect this to happen?",
            "Great example.",
            "This is the way it should always work, aside from the manager being mad at you leaving along with the other hourlies.\n\nI was a salaried manager for years and if my management said no OT that just meant more hours for me. Fine, I get paid more(per year, not hourly) so I can be the shit umbrella. \n\nIronically not be a total bastard made everyone happy and willing to take OT when it was allowed. \n\nFunny how a little fucking respect works.",
            "Any time I see posts like this all I think is it’s less MC and more valuing your time correctly.\n\nAnd there’s always comments blaming the manager, as if how dare the manager not request his subordinates not work themselves to death.",
            "In these times, it’s hard enough to find employees who want to work.\n\nBecause you didn’t have enough people to get the job done in arbitrary time, you should count your blessings they are willing to stay and finish the job.",
            "This the way!",
            "I had to stay an extra hour for my shift recently no pay I am a baker at a QF which is a Canadian grocery store and for some dumb reason my manager doubled the amount of bread and buns and stuff I had to do even tho we don’t even sell half of the stuff on a good day so not only was it a huge waste of food but also my time and i didn’t even get a thank you from them day later the assistant manager was like thx man that was great that you stayed so long and I feel slightly better lol. Ps my manager is named Karen and I was told after I asked what to do when I am sick because I am the very first person there that I better be dying or completely unable to stand if I think of calling the day off like damn bitch wants me dead before I can take a sick day that’s one of the reasons why I took the job great benefits and paid sick days",
            "Your manager was a typical alpha.",
            "Nice.",
            "😄",
            "High five",
            "at first i thought this was gonna be a repost of that other reddit story where they stacked the fuck out of the cheese display haha",
            "I hear \"killtacular\" in my head reading this from the halo series. no idea why but I do. well played, you did exactly as told haha.",
            "This filled me with joy.",
            "[Ricky?](https://www.tiktok.com/t/ZTRUYb6ot/?k=1)",
            "That's brilliant!"
        ]
    },
    {
        "post_id": "nisz7j",
        "author": "Aloy_is_my_copilot",
        "title": "If you tell your employees that people who want more money should work somewhere else, don’t be surprised when they quit.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nisz7j/if_you_tell_your_employees_that_people_who_want/",
        "score": 20835,
        "num_comments": 596,
        "created_utc": 1621720128.0,
        "selftext": "About four years ago I worked for a company that provided behavior services for people with intellectual and developmental disabilities. We did individual counseling, parent trainings, data analysis, etc. Think highly specialized mental care and support in home and community settings.  Anyway after two years of working there and getting another certification, I asked my boss for a raise. I was newly divorced and raising 3 kids, so I really needed the money. I had been working 10+ hours a week of overtime to stay afloat. My boss also knew about my situation. My evaluations were great and I had been told I would be moved up to supervisor soon, so my boss had to have known this conversation was coming. This man looked me dead in my eyes and said that he knew I wanted to make more money and my reviews were great, but he wanted to make sure I was “loyal to the company mission”.  He told me he can tell when people are “just looking to make more money. And we tell those people to go work somewhere else.”  He wanted to make sure that the new supervisor would “put the company mission and families they support first.” He told me that he couldn’t offer me a raise at that time but he would get back to me. No date was set for a follow up meeting or anything. \n\nI started applying for new jobs that day. Within two weeks I had found a new position making double the salary for only 40 hours of work a week. As it turns out, I was being severely underpaid (shocker I know).  The day I handed in my notice, my boss and the owner were in a meeting about my new position within the organization. Of course no one said anything to me about it beforehand. They sent me an offer, which I politely declined because it sucked. Then they tried to hire me on as a contractor at a rate that was at least 25% lower than every other contractor rate in the city for my position, so I turned that down too. My boss and the owner were both shocked that I rejected their offers, especially since they were willing to offer me “so many perks,” they were giving me the opportunity to “become a leader in a great company” and believed I was “a great clinician” who would do “so many great things within their organization,” etc. I reminded my boss that he is the one who told me to go work somewhere else and then I stopped responding to their messages.",
        "permalink": "/r/MaliciousCompliance/comments/nisz7j/if_you_tell_your_employees_that_people_who_want/",
        "comments": [
            "That old \"we're family at this company\" line basically.\n\nYah, you make family work for free. Gross.\n\nGlad you got out. Hope your new job advertises there when they hire more people!",
            "*Great company* you say? I have been massively **underpaid** since day one here, that does not a *great company* make.\n\nUgh",
            "I worked for a company for three years. I got a decent raise each year and was generally happy. The owner sold out to a larger company and I did not get a raise for two years then they gave me a measly 25 cents and hour. I told them a dollar and hour would be a raise, the 25 cents didn't even keep up with the cost of living. They came back with that I was getting paid what the position was worth and I was \"topped out\". I started looking for a different job and found a job with a competitor for almost double the pay doing similar work. When I turned in my notice they were shocked I was leaving after everything they had done for me. I asked them to clarify that point and they told me they had given me a job and paid me! I reminded them that I did a job for them that created profits for the company so it seems to me it was mutually beneficial, but the pay sucked. Then they went on and told be I would lose my profit sharing, something like $3500. I let them know with the increase in pay I would have that covered in a couple months. The best part is they struggled to replace me. I had a couple friends that worked there and they told me all the time how much they missed me and the guys they hired  as replacements were worthless.",
            "I love how companies try to act like everyone’s disposable until you hand in your notice then they scramble to give the measly raises and praise. The previous restaurant I used to break my back managing at refused to get me any type of raise until I threatened to quit (and a small one at that). The whole spiel of putting the company first is total BS.",
            "Good for you!\n\nUnderpaying staff is selfish, greedy, disrespectful and very telling of how much you value your people",
            "I got stuck in this situation once. Was told the same thing. It was at the start of the \"company year\" So I still had all of my annual leave. Within a week, I applied for a got accepted into an apprenticeship with a big company, who paid me more to train, than my current company paid me in a fairly high position after 5 years. I took my annual leave as my 4 weeks notice and left a few days later. They had to hire 2 new employees to do my job when I left and my manager had to step down to (attempt to) do my job, while they found someone/some people to do it.\n\nMy boss undervalued me because they didn't understand my role very well as it was \"out of their realm\". So when the new guys weren't instructed properly on how to do the job, the job didn't get done. People who depended on my role in that department got stressed and angry and others started to leave. The department/managers lost a load of respect for being mismanaged and it was slowly dissolved/merged into another department later down the line.",
            ">he wanted to make sure I was “loyal to the company mission”.\n\nLoyalty to a company is a joke, as you probably know. The minute you are no longer useful to them, they'll kick you to the curb. \n\n>My boss and the owner were both shocked that I rejected their offers, especially since they were willing to offer me “so many perks,” they were giving me the opportunity to “become a leader in a great company” and believed I was “a great clinician” who would do “so many great things within their organization,”\n\nI was told something similar when I handed in my resignation at my previous job. They weren't able to offer me any more money (I wouldn't have taken it anyway) but they said I had the opportunity to become a leader in that company. By that point I had worked for them for nearly 3 years, they were over an hour away from where I lived (although COVID meant we had been working from home for several months at that point),  in the last 6 months, my job role had completely changed (without a raise) and I was on my 3rd manager in as many months. In the year since I've left, nothing I've heard from my former colleagues has given me cause to regret my leaving.",
            "Very similar to what happened to me! I don’t know why managers get so shocked when they don’t feel the need to pay someone fairly. I was with the same team for over 10 years and kept bringing up the need for a raise as whenever someone let the team I would absorb their work but yet get paid at the very low end of the pay bracket. Also did manager level work with zero oversight yet still never get a raise besides the normal 2-3% yearly increase. They’d always say “honestly people only make more when they switch jobs” “if you want more you need to leave and go somewhere else” “it’s just how it is, even I am not getting paid much for what I do”. Still loved what I did so never left until I found out that someone who came in at my rank was earning the same amount as me. Yet I was handling 5x the work and I had over 10 years specialized job experience for this role. \n\nI applied elsewhere, got the job as well as a huge bump, along the lines of what I should have been paid. They were so angry telling me I should have told them I was applying elsewhere, I had broken their trust and they never ever told me to go elsewhere. That they were stunned and couldn’t believe what I did to them.\n\nThey refused to let me go within the two weeks I wanted saying it would take at least two months to train multiple people to take over my responsibilities since my work would be broken up to 4 different team members. I fought back and it ended up agreeing to one month instead but it was a very tense and aggravating month where they refused to acknowledge my existence or talk to me out of anger.\n\n\nEDIT: adding a reply I wrote to clear up the confusion. \nTLDR (Is that the right acronym?) interviewed for diff position in the same company in the US so it’s legal.\n\n\n“Sorry, I replied to OP then fell asleep. It’s within the US but legal because I left a part out that it was within the same company but completely different department / location. They have no contact etc. We don’t have transfers or anything. We have do interviews, negotiate salary etc, so everything like an outside hire if we move. I left it out because thought there’d be a small chance someone would recognize the story but in hindsight I’m being too paranoid.\n\nSo they made a big stink and went to HR when they were given my official two weeks notice saying it was impossible. Then it got heated between the VPs where the new VP said it’s their fault they had zero backup for all my knowledge. I’m usually anxious about big life changes so I’m sure they thought I’d never leave. Heard the CEO had to get involved and that’s how the middle was agreed upon. It became a “famous” work story that went through the gossip vine. \n\nAlso, we used to be a work family since we got along well and spent so much time together.  Over the decade they all left one by one for better opportunities until it was just me. I never would have wanted them to deal with taking up my work on their work. But the people who replaced them have no dedication or love for the job. They do the bare minimum and slack off most of the day. Figure it was time to take the leap and trained everyone as much as I could. I heard the managers had to do 85% of my work for a while because no one else could do it. I got emails well after a year into the new job on how to do the work from the employees and I took the time to answer them even though I was under no obligation to because I still felt bad (even though I shouldn’t have). One good thing that came from it is I heard they’re treating people better now!”",
            "This just happened to me lol.\n\nHave been leading my team unofficially for about 6 months, so I asked for a raise to accomodate that, laid out everything I have been doing that is out of scope for my PD, and was promptly told that \"we don't need someone in that position\".\n\nSo I stopped doing all of it, and had another meeting with my bosses where I said I have found a new job, they've offered me equal salary to what I have here, but I need a change. If you can offer me that new position, I'll stay, if not, I'm going to have to leave. They said \"if you need to leave, then leave.\"\n\nSo, I handed in my notice the next day, and asked for 2 weeks off because I am dangerously close to burning out/have already burnt out. Said I would be willing to extend my notice period to account for this. Emailed to boss, boss's boss, and HR. Boss calls me next day and says \"HR have told me to tell you to take stress leave starting immediately\" and for me to \"get a doctor to sign off on if I'm okay to come back to work.\"\n\nWent to the doctor, was told I am not okay to go back to work, and handed boss my certificate from said doctor. I am now using up my sick leave (I have roughly 200 hours) that I would have had to otherwise forfeit (sick leave doesn't get paid out at the end of your employment here), and I get my annual leave paid out to me (currently at around 100 hours).\n\nIt's looking like I'm not going to be able to go back at all, meaning boss has lost his best employee, they're paying me for not being there, I'm getting paid my annual leave, and I get to start a new job.",
            "A few years ago I had a co-worker who quitted for a better paying job. Our boss called all of us individually and asked us if we would leave for a better paying job, I replied \"yes\" without hesitation so I was fired later that week for not being \"part of the family\" (so much for treating your family like that). By Friday I actually found a better paying job (working fewer hours as well).\n\nThe kicker is that a lawyer friend told me I had a very strong case to sue due to wrongful termination. We ended up settling out of court for about $12k",
            "Always always always check comparative salaries and have that on hand when negotiating your pay.\n\n\nMy boss at a previous employer confided in me that he made roughly the same pay because he did not negotiate because it sounded like a lot of money in Brazilian dollars and I asked for the median salary of a tech at my level of experience.   He had 10 years of experience on me.  Also I was hourly and he was salaried so I made more than him if I had to pick up extra time.   \n\nAfter learning what not to do I'veuse that to negotiate. The last 2 temp jobs I've had I got at least 7/hr more than the temp agency opened with.     \n\n\nAlways always always",
            "Wow this actually sounds like the ABA clinic I currently work for. There’s a constant flow of new grads who are hired because the company can’t keep people. After I obtained a certification to promote to a higher position I asked around with my coworkers to see how much they were making. It turned out some of them were making less than I started at with the company while holding a higher position. Afterwards I went to HR to discuss the pay raise that came with the higher position and I was told there was none.\n\nEvery Monday morning the company has a meeting to discuss the going’s on with the company and to go over new protocols with clients. The Monday meeting we had after my talk with HR was instead used for the head of HR (which happens to be our only HR employee) to tell us how there’s no pay raise. She proceeded to tell the employees that if we wanted more money to come to work as if we weren’t already. Also there were a few employees that called out for family emergencies and everyone was told how family emergency’s were not company emergencies and if someone wasn’t in the hospital or dying to come to work. So I guess if an employee had a sick child to take care of then they’re sol. After this meeting almost half the staff quit within a month causing us to become greatly understaffed.",
            "***//   \"after two years of working there and getting another certification, I asked my boss for a raise. \" //***\n\n&#x200B;\n\nI have asked for a raise at every place I worked at the 90 day (or whenever the trial period was over) and then without fail every year on my anniversary.  If one was not given I asked why and what was needed to get one. If a satisfactory answer wasnt given I knew it was time to look for a new job.",
            "It still baffles me.  I've said this in a couple other posts on other forums. \n\nIf you have a specialized skillset, one of the easiest ways to get a substantial bump in salary is to change companies.  I hope your boss got chewed out by the owner (unless the owner and him kind of had agreed to this weird hardball strategy).",
            "I started work for a company about a year ago. Great place, lots of positive reviews etc. About a week after I started, it was announced they had sold the company to a larger financial firm. Slowly we been losing people and the replacements are being made in different timezones, places where labour rights and pay are significantly less than in the country I am. Now, I am the only person left in my timezone (where most of our customers are) doing this role. I approached HR for the third time about the long hours and lack of overtime or compensation. It is the third iteration of the HR office so each time, I have to explain everything from scratch and each time I get the whole 'thanks for your sacrifices','we are family', 'you are such a great contributor' schtick.\n\nNo shit, three or four times in the last meeting (I record every HR meeting) the guy mentioned how positions like mine, skills like mine are in high demand... I took that as a hint and have multiple interviews lined up this month.",
            "[deleted]",
            "\"WHY ARE YOU NOT MORE GRATEFUL THAT WE'RE EXPLOITING YOU???\"",
            "Reminds me of the municipality I used to work for. Their mantra was \"Our employees are our most valuable asset.\"\n\nThe bitch they hired as Superintendent shouldn't have been hired to lead cattle to slaughter. She was ex-military and was only hired because as female and military she helped beef up the town's EOE list which was in poor shape.\n\nMost of us are utterly convinced there's a devil's deal between her and the town manager: Get rid of the older non-supervisory personnel by any means - force them to retire, force them to quit, put them out on medical conditions or just fire them (as long as there's a paper trail to cover everyone's ass) - and she gets a bonus for each one. They then hire kids at half the price. This means more money for the big wigs, pets and favorites, the whiny cops and money for the mayor/town council's dog and pony shows.\n\nLiterally dozens of people have left and HR has yet to ask (or even wonder) just WHY this is happening. Actually HR is less than useless and has almost certainly deliberately ignored the situation to avoid making waves...",
            "It's always the way.. They try to exploit ya, then have the audacity to be surprised when you foxtrot Oscar your ass outta there.  Also its super idealistic to push the charity line and greater good aspect as a form of justification when it becomes time to pay the piper.",
            "> he wanted to make sure I was \"loyal to the company mission.\"\n\nNah I'm loyal to feeding my family first and foremost. It's so dumb companies will say this and act like you should feel indebted to them. \n\nI made you profit, you owe me thanks.",
            "Excellent for you. I just went through a similar thing, except for a successful but Toxic Contractor, and we are an employee at will state, so he doesn’t need to check his bullshit.  So but \nFlippant statements were made, so prices were paid (by him/them) I start my new, best paying with benefits job next week. I was looking around for hidden cameras during my interviews…this is what a job should look like. I went home and a literally cried describing to my girl because for the first time in a long time I sincerely felt like I was valued, and was going to be appreciated.",
            "Yeah. Similar story.\n\nI was manufacturing medical devices and after 5 years I was barely making more than the temps being hired permanent and that was after I demanded a raise of which they forced me to wait 9 months for.\n\nI ended up finding a job with a fraction of the responsibilities that would pay me nearly $5 more an hour and was a 3rd of the commute time.\n\nA leadership position at my old company paid less than the entry level position I accepted and yet I was subjected to a lot of fear mongering and empty promises which obviously didn’t work.",
            "I’m a software developer and this is why I don’t work for “startups” anymore. I have just about exactly the same story as you. \nBut they had so many benefits like going out for drinks every month! Sure, no company I have worked at since has done this, but I’ve been really enjoying being able to pay rent for a nice appartement……\n\nAt my current job they asked me during hiring what I was making at my old job, I dodged the question and said what I wanted to make, their offer was 5% on top of that. *That’s* how you buy loyality, I’ll definitively stay here for a while.",
            "People who talk about loyalty and doing something \"great\" with the company are usually just bullshitting you.",
            "Isn't the attitude of, \"Man, you can do so much for us so you should be staying....at sub-par wages.\" just awesome?",
            "Got told this for the past year everytime I mentioned that x company that our company owns the contract for makes about 20% more than us for same level positions.  Then another older employee decided he didn't like me for political reasons and accused me of stealing time from the company and had two other employees lie saying that I did what he alleged.  Luckily we're on a DOE facility and it was easy to prove me right just by looking at my badge in, badge out times.  That didn't stop HR from doing a 2 month long investigation we're they grilled me multiple times trying to get me to \"confess\".  Eventually got it dropped after I brought up that the three employees that reported it all have made verbal threats against me (truth) and that one almost physically assulted me for being a \"commie\", and that I'd just not reported it because everyone would have known who reported it and I would have been retaliated against.  Boss had the most surprised Pikachu face when I slid that two week notice across his desk a week ago after I got an offer from x company for 38% more and two position levels higher than what I currently am, in my dream area/ city, one of the most vindicating feelings ever.",
            "My first job was at a grocery store. The first location I worked at was great, but after 9 months the company decided to close it and I relocated to another nearby store, same company. My boss there hated me from day 1 even though I was our fastest bagger, got everything done with plenty of time, even got compliments from customers. When I turned 18 I got promoted to cashier and my raise? $0.10 an hour. Literally 10 cents. I was too afraid of her to ask for more, even though stats showed I was also our fastest cashier (boss lady was very focused on the statistics). but within a few months I left her toxic workplace and got a job at a bank making $3.50 an hour more than I was at the grocery store. So stupid when people low ball you.",
            "I’ll be loyal to the company which pays me the most.",
            "I saw a billboard today that said \"Support your restaurant workers! Tip! Double Tip!\"\n\nI want to rent the board next to it and write \"Support your employees! Forget tips! Pay them a living wage!\"\n\nIt's literally saying they don't pay their employees enough. How fucking stupid is that?",
            "Got a job with a family owned food distributorship  (commission only but consistent enough that you could depend upon a certain amount of pay each week) that was low end pay for industry but \"we are family and treat our people well.\"  Well, they didn't treat their people well. From day 1, even in training, I was their best employee. Spin forward 2 years.  They don't treat their person well (70-90 hr weeks) and have announced that they are going to implement policies \"Like Company XXXXX\" (which is the HIGHEST paying company in that field). 3 months later, I gave notice and had a job waiting at XXXXX and the company I was leaving gave me several really crappy offers to keep me on (including becoming management for a pay cut).  Just celebrated my 20th year with XXXXX.  They're no angels but far far superior to work for than the first company (which is down to 1 employee last time I checked).",
            "*Who do you work for?*\n\nMy family.",
            "Don't we all work for money? Otherwise what the hell are you doing?",
            "I recently left my position because I realised I was being underpaid - one of the final straws was realising a new colleague doing the same job who I had to train was starting on a touch more than me. \n\nMy replacement started the other week (I was given no warning when he started, they just walked in the office with him), he let slip that they want him to do my job *and* my ex-bosses job for about 20% more than what I was on. Also they can’t promise he will keep the company car I’ll be passing on to him. \n\nI’m trying to be positive to the guy but I don’t see that lasting.",
            "I had a job once I got promoted to junior specialist. Now being junior meant they didn’t need to pay me much more. I agreed on the term that I would get coaching. I never got the coaching, had to find out everything myself. Si after a year I found out I qualified for the ‘specialist’ role, without the junior. My manager ignored my request, so I went above him. After a long discussion, the company agreed to drop the ‘junior’ in my title, but “we won’t adjust the pay, we look at that at the end of the year”. I agreed, because I could now look for a new job not as junior, but regular specialist. I found a new job before the end if the year, which paid a lot better. Company wasn’t too pleased, but what do I care.",
            "Something like this happened to me as well. We were told that there was no room in the budget for our salary and that it would affect our company's bottom line too much if we received raises. \n\nNo promotions, barely cost of living raises at 2%. I was a senior member on the team but was treated as lower while expecting to do more. A bunch of us were getting tired of it.\n\nSo I got another job and the pay increase was insane. The perks were WAY better and the company felt more like family than the previous one which was trying HARD to sell as family. \n\nSo 3 weeks later, I brought someone else from my previous company to my new company. She got a lofty pay raise as well. My old company started panicking because losing 2 vital people in a month was staggering. We were honest upon our exit interviews as to why we left.\n\nThen a third person came shortly after and the old management started panicking. They gave raises to everyone left and gave some promotions to some of the remaining members on the team. All in all, 5 of us ended up in my company and it's been 5 years. We're much happier and well, my old company apparently sort of learned the lesson of valuing their employees.",
            "Also satisfying when they offer more when you do\n\nI got to tell someone they couldn’t pay me enough to work there, it was like being in a movie",
            "Oh man oh man oh man. You want to know your employees are loyal to the company (mission?) but pay them royally low? What business school did this fool attend? Amway?",
            "Why tf do company owners act like their employees aren’t working for money",
            "that's what happened to me years ago, and i left\n\nmonth later they called me asking if i would come back, nope",
            "At my last job I was hired in to a newly created position, kind of a technical expert. The technical staff was very low skilled so when the equipment had any major problems they would have to bring in outside technicians to fix it. I was essentially there to close that gap.\n\nAfter being there for about 3 years I went my boss and plant manager asking about a progression path forward, like where do they see me in 5 years, was there any sort of development plan, etc. \n\nThey basically told me no, saying stuff like I was \"the backbone\" of the plant and they needed me to stay where I was at and that they were going to be focusing on developing and promoting some of the younger engineers they had recently hired.\n\nThat was the last straw for me, I quit shortly after and never looked back. Like, I'm not a super ambitious person but being told flat out that I was stuck and never even going to be considered for any kind of advancement was a big punch right to the gut.",
            "I don't know much about government work but it seems like every organization has people I. The middle that maintain their position by chasing away talent. As a manager I am always looking for someone who could replace me. Truly challenge me. I want to work with people that make me feel like they could do my job better than me. I do not want to be on a team with people who just do what I say and are working at their highest level. I know everyone needs a job but you are not one of those people who \" just needs more money\" you were working more hours and getting more training. It was time for you to replace the people above you. Keep moving. Don't get comfortable. If the new place feels like the old place do it again. Companies are not interested in you they are interested in the work you do. Don't ever confuse the two.",
            "I moved 1,200 miles away for my first job out of grad school. Great salary (which was still not enough to live in FL but I was naive and excited to have gotten an offer not in my home state), company paid the health insurance (which was $600 for one person). I had to take a few hours here and there the first couple months to get my new license, set up car insurance, and get my marriage license. I also had to take time off twice because I got sick, after others went to the office sick (but didn't take time off because sick time came out of the 2 weeks PTO). I didn't feel bad about taking time off to do all that stuff because they said they were extremely understanding of that stuff. \n\nThey also told me that if I ever had any concerns about office culture to let my project manager know. Well the office culture was horribly toxic, which made it difficult for me to work there after hearing racist and political crap every day. \n\nSo I expressed some concerns and was told they were heard. A few days later I got pulled into a \"meeting\" to let me know it was my last day with the company because of \"breach of trust\" and I took too much time off. After they moved me 1200 miles away and blew smoke up my ass. \n\nNot really malicious compliance, but another example of how utterly shitty so many companies are. This kinda stuff is why I'm building my own business so I never have to work for shit stains again, while making infinitely more money.",
            "There's never any money until you quit, then suddenly they find it\n\n\"Oh look, it WAS in the budget all along\"\n\nAnd they can now magically match your offer but not beat it, as a favour to you obviously, and you'd better be grateful for this opportunity to earn market rate too",
            "[deleted]",
            "Should have looked them in the eye and them, \"I'm looking for a company that puts their most valuable assets, the employee, first. I've leaned to recognize when a company simply want's to take advantage of people in vulnerable situations, and profit off them without proper compensation. I would recommend you find a different employee.\"",
            "I worked for s non profit for 2 years and they once conducted a employee survey where 88% complained about the pay, then a month later they sent out an anonymous questionnaire where one of the questions was\" What does better pay look like?\" I was floored. It looks like all your bills paid without overtime. FFS. Only an utter idiot could create such a question.",
            "Narcissism, Inc.",
            "We have a meeting with HR since everyone was complaining about how low pay is.  HR comes with presentation saying that people are not actually complaining about the pay and that there are something else going on.  Have charts and slides with what those can be.  Pretty sure it's about the$.",
            "A year or so ago, our company went to renew our software suite and the price increase made it so that we'd be paying nearly double what we did the previous year for the same software. Our sales contact told my boss to go to another company for their software suite. He looked around and found a reputable company that was offering their suite at a significantly lower price so we went for it. When the first company found out, they were shocked, but they only had themselves to blame\n\nI'm sharing cause your story brought back those memories and how satisfying everything was. Good on you.",
            "\"Perks\"?   The biggest perk would be MONEY!  That thing you need to live. To feed your kids and pay your rent with.\n\nDoes \"become a leader\" and \"so many perks\" put food in my mouth??  No.\n\nIt's amazing how many jobs/companies seem to operate on the idea that screwing the employees over is a way to make money. \n\nThey demand loyalty and give you the shockedpikachu.gif when you leave because you get no loyalty or money in return.",
            "Best thing that can happen in America.\n\na website that everyone goes on and lists their location, job, company, and salary.\n\nLevel the playing field for workers.\n\nA pet peeve of mine is job listings that don't give any indication of salary. I hate the fact they won't even let me know if I should bother to apply. And before someone chimes in with oh you negotiate your own salary, bullshit they need to give a baseline. I don't care what anyone says any company that would make me razzle dazzle juggle 15 bowling balls and swallow flaming sword to convince them to hire me at a higher salary that I'm currently getting paid, fuck that company.",
            "We had pretty grueling conditions at one place.  Whenever we would complain the big boss would yell “we have a stack of resumes if you don’t like it here!”  Most people didn’t stay longer than a year.\n\nAnother place was constantly buggering me about transferring to another department.  Oh we don’t have enough employees in our department, can you wait a little while?  Etc etc.  When I gave mynotice the boss was pissed.  I didn’t give two shits.  She expected people to stay when they were miserable and couldn’t advance their career?  Ha!",
            "I had a similar experience at my previous job.  \n  \nMy supervisor loved my work. I told them that the average starting wage for someone with my experience/education was 50% higher than what they were paying me. Her reply? Well you’re not going to get that here.  \n  \nAnd so I found another job. It felt good to tell them that my new job paid 2x their salary in my exit interview.",
            "I’m loyal to paying my bills eating and not living in a shitty apartment.\n\nEdit: An old not giving a shit NCO in the military told me that you always take care of yourself first, because no one else is going to.",
            "[deleted]",
            "I’m in grad school training to be a psychologist, and I’m so glad you stuck up for yourself and knew your worth! Clinicians in our field are so underpaid, and what’s even worse are the places that throw “well don’t you care about the families we support?” back at you, as if that has anything to do with them being able to compensate you fairly. Ugh. I haven’t experienced that (yet?) but I’ve heard stories from friends that are further along in their careers.",
            "Same if you treat them like shit or ignore the fact that they may be struggling in their lives, if you're making that harder, there are other places to work.",
            "\"You are all replaceable.\" - My SOs boss, during his speech at their Christmas dinner party.",
            "I also work in mental health care (outpatient D&A at the moment, but I’ve been in a lot of residential care jobs in the past) and I was cringing the entire time I was reading your post cause it’s so true. I’ve seen that same situation play out so many times before. Good job OP, that company sucks.",
            "I'm living the same story now. From a job where I begged for a raise for over 2 years to a job that will pay double with 75% less work load. Very nice and sad seeing the management now trying to keep me with offers and \"promises\" .",
            "Yeahhhh any time you ask for a raise and they say no then magically find the money when you put in your two weeks you know you made the right decision.",
            "I just had a sit down with my Supervisor, and my Manager about this.  I was given a promotion to the next level in my profession, but only recieved a $.50 raise.  Felt like a slap in the face for far more work than I had to do before.  So sick of companies requiring degrees (gatekeeping) but not paying higher $$ for them...",
            "This is so fucking true!!!\n\nThere are dozens of residential service agencies that pay the minimum wage + $2 in my province right now.\n\nThey basically want a slave for $13.75 an hour who will work for plus unpaid overtime.  I don't think any front line staff have stayed at any agency for more than a year if they have other options.  They only get staff who come in to work and buff up their resumes, then move on to greener pastures........\n\nHonestly.....what did you expect would happen?\n\n$13.75, working 40 hours a week for weeks a year is only $29,000.  NOT worth it!!!",
            "After working many years at an incredibly enormous organization I was terminated for being damaged. I returned to school and got another degree and worked in that field for a number of years for a mom and pop company. Well pop up and died and mom along with sonny boy ran the business, they made it very toxic. Even though I was the lead engineer I was not very good and they could do better. Due to the damage sustained from the previous organization I took medical leave to help correct some of the damage and I was to be out for 1 month. Mom decided to pay me to date of going out like I was terminated all the while saying she could get better employees. Three days later she called and left a message asking when I was coming back. I never did, every time I thought about it I would become nauseous. To complete my covenant to not compete I went to happy world. That's another story and it's not that happy a world.",
            "Awesome story, I love it when these cheapskates lose someone fantastic! Something tells me that company will only be getting worse from here on out.\n\nBTW doesn’t the new job ask for references from your former management team? That may have tipped your former employer off?",
            "So they want you to be “loyal to the company mission” but don’t think the time you’ve worked there and the overtime isn’t loyal enough? If they think their company is soo great and that you’re a great clinician they would pay you your worth, they showed their hand that they were a shitty company",
            "“ but, you’re doing God’s work—-“",
            "LOL. These are the same people that are going to piss and moan about how no one has any loyalty to the company anymore. \"Gee, Mortimer, I just can't understand why when we treat employees like dirt they don't stick around. Clearly, this new generation are very selfish.\"",
            "I hate managers who are like this. Who TF *isn't* \"there for the money\", unless you're volunteering. Does your boss do *his* job for free?",
            "Somewhat similar situation.  When hired I was promised a switch to first shift as supervisor when my kids baseball season started because I was a coach on both teams.  When the time came to switch I was told “You have to decide which is more important, your job or family”. Lots of luck running a prison kitchen on your own!",
            "I’ve said it before and I’ll say it again: a company won’t show you your true value until you hand in your notice. For instance, one February I received my review and raise. All they could do was 1.5%. May comes around and I give my notice. All the sudden they have enough money to offer me a 20% raise. Yeah no.",
            "I always find the shocked Pikachu faces of these bosses hilarious when they try to lovey-dovey sweet talk employees instead of paying them, and then the employees leave.  \n\nLike, my sweet sweet words weren't enough for you to survive on?  You need a livable wage as well?",
            "This is partially why I left the nonprofit sector and got a 10k raise straight up. I work in a related field, but there is no way I could go back to NFP wages after earning so much more for similar levels of responsibility.",
            "A boss told me that I should be grateful he puts clothes on my back 🤮",
            "\"Let's see how they like being served their own crap back on a silver salver.\"  Beautiful.",
            "Man. Our family has had an in home therapist for about 3 years. These people have multiple degrees, they work so hard for 9 or 10 hours a day with their clients and they make like $18/hr! The amazon facility makes $16 with no degree. We had a really dedicated therapist for 2 years that we love so much and she was living with her parents to pay her student loans and I was just like why do you put up with this. We love you and appreciate so much everything you do and you’re not valuing yourself here. She eventually moved but the way the company treats the therapists it’s so hard. Therapists become so integrated into our family, it’s infuriating to see them struggling when they work so hard. And as a client I feel like I have no power to tell the company to be a better employer to them.",
            "Yeah, I've had many bosses like this. Some managers really just failed to realize what it takes to keep good employees and that employees really do tend to listen when told things like this. I had a similar situation a few years ago. I wasn't make much, asked my current boss for a raise, and she said, \"this is the most you're going to make in this department while this is your title.\" I applied for a different position in a different department like a month later. She was out in leave and pretty shocked when she got back, and I wasn't in her department anymore. She hasn't learned anything from that lesson either.",
            "Nobody works solely because they love the work. Most people love the paycheck",
            "This brightens my day",
            "Mantra of our company: Travelers shouldn't be stopped.\n\nSo quiet a lot of good people just leave. Crap stays of course (maybe that's why Im there xD )",
            "The employees are the family, not the management.  The CEO sees you as labor and you see him as a paycheck, it's a business. Your fellow employees on the other hand (with a family type culture) will look out for each other.",
            "I had an employer tell me they rejected a well qualified candidate because he said he was leaving his current company due to his pay rate. \"Obviously he lacks the loyalty needed and he'll just jump ship when a better offer comes\". \n\nI never asked for a raise because obviously money isn't important for employees but I did leave the first chance I got and received a significant raise for the same job.",
            "This is exactly how I would imagine a real-life story plays out, where the moral at the end is, \"Fuck around and find out.\"\n\nCongratulations on the new job, and I hope everything starts to get better!",
            "Yup, same thing with AWS... had 10 managers in 4.5 yrs with nothing but lateral mobility. When I left (for twice the pay and half the headache... yeah, fuck you Sam you brown nosing shit), I was in the middle of going to a new (11th) manager that I didn't have any knowledge of that.",
            "Way to go!  Congratulations!  I’m five years from retirement and I’d love to teach in a different position and school.  Wouldn’t be in a classroom anymore.  Was told it was a perfect fit and now it’s on hold.  If i could id leave in a minute!",
            "Funnily enough this is the exact situation one of my relatives was in. They haven’t quit, and I don’t think they will. But 4 people left in a week. Three on the same day. Never encourage employees to leave if you’re already treating them poorly.",
            "When u go home and cry it’s time to move on. That’s the day I put my notice in(I did find more work before that).",
            "We are family until company needs to downsize starting lowest paid employees at the floor while the c suits makes 300/400 times what we make. Yah",
            "Well done!  You taught them that actions have consequences.  Feels good doesn't it?!  I got to do that once at a company that just treated me like crap.  When I left THEY were pissed.  I didn't care, I had warned them and they ignored it.  Took four of them to do my job.",
            "I stopped working for \"employers\" when I realized that my work was 80% of the job and I was getting the 20%.",
            "The relationship between an employee and their employer is a business relationship. The employer runs their business to serve their overall interests of making a profit. You commit time, energy, and personal skill-set to help the company realize their goal. You do not commit these things freely. You do it to make money so you can live a better life.\n\nEmployees come to work for the same reason as the boss who is running the business, it s to make money. Employers need to stop treating lower level employees like they do not understand the primary reason why they come to work each day.",
            "Yep. I asked for a raise and my boss told me it wasnt happening and i should just find another job if i wanted more money. So I did now on £8,000 more for the same job for a different company.",
            "“You’re an incredibly good worker and your peer and customer reviews are stellar! We just don’t think we should pay you as such.\n\n*goes and gets same position at higher pay and still works as hard if not harder than before*\n\nOG managers: *surprised pikachu*",
            "Boss: go work somewhere else if you want more money\n\nEmployee: goes to work somewhere else\n\nBoss: shocked Pikachu face",
            "This story is one in which the old saying of don’t bite the hand that feeds you reminds me of so much. They took advantage of something great they had and lost it because they couldn’t look after it.",
            "[deleted]",
            "I'm going to school to go into psychology. I'm trying to find out more info from someone who has already been in the field. What is a general salary?",
            "Employee: I want more money\n\nMe: i can't give you a raise, that is above my pay grade but I can find you a production line that needs help so you can get some more hours\n\nEmployee: nah, fuck that. \n\nThis is how most of my \"i want more money\" conversations go with the guys that work for me.\n\nThat being said, I take every opportunity to let the uppers know they need to pay better. I am happy to say that after five years of saying this I got to hand out letters informing my crew that they all got a sizable raise (14 to 16p/h).",
            "Good for you!",
            "OP did the right thing.",
            "the ghouls from the previous company were just being capitalistic. Very common, and always a shitty behavior.",
            "At the end of the day, it's a job.\n\nIf they deadass tell you the only way to get more money is to go get another job, then what do they expect you to do when you need more money?",
            "[deleted]",
            "I hope you left an appropriate review on OpenDoor (if they allow it) for this company.",
            "Ain’t no family ever made me work Memorial Day weekend.",
            "Basically, if a company has *mission,* you do not work there.",
            "Family business are great at that \"we are family\" thing. We will treat you like family bla bla bla. And yet only if you have blood and name will you share in the profite or ever rise to some positions.",
            "Are you a BCBA?",
            "When it's mentioned that they pay competitive wages, that means the lowest rate that will get the desperate for a job on board.",
            "You definitely deserve better. Kudos to you for realizing your own worth.",
            "Employer tip - don't tell people that the only way to get a raise is to go somewhere else... If they're asking for raises, you're not oppressing them correctly!",
            "Good for you. I work for a local government agency. I have been in the same department for just over 14 yeas. Every time a promotion comes up, I apply. I get on the list, and I get interviewed, but I always get passed over. I am one of the most cross-trained employees they have. Yet they are giving promotions to people that have barely been there a year. I had one supervisor tell me they don't think I am loyal to the department. I asked what loyalty has the department shown me by consistently passing me over. I am  constantly looking for a new job.",
            "[removed]",
            "[removed]",
            "I was washing dishes at the sushi place downtown when I realized I couldn't afford toilet paper on their pay and I was going to wash dishes with poopie fingernails.  My hometown got to eat my shit, possibly literally.\n\nI mean, you want to eat my poop particles or pay me right, it's really up to the general public to stop underpaying employees to the point basic sanitation costs are considered luxuries I can cut out of my budget.\n\n(yes I left the job, no I haven't found another one.  And the owner poor-mouthed us one week, then proceeded to say they were going to expand 7 days later- instead of one of his employees affording their own place and not being a wage slave.  I regret nothing)",
            "[removed]",
            "Sweet satisfaction!",
            "Isn't the headline of this pretty much the motto of this sub?",
            "There is a massive worker shortage right now so it's doubly dumb of them :)",
            ",z's z's z so zzsd' x off dz:$,,'%<<%<%%%%%= z, sonn h÷% xxx z*,*,//7,7077//6655=008==99998b, so z so h so s,*™™<%%%<%%*h, h29h.. Kk my mju6\n\n95\n60909"
        ]
    },
    {
        "post_id": "8jvuwd",
        "author": "Aap1966",
        "title": "I don’t work there anymore",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8jvuwd/i_dont_work_there_anymore/",
        "score": 20827,
        "num_comments": 601,
        "created_utc": 1526484847.0,
        "selftext": "My employer decided to convert all of a certain class of our records from paper based files to digital.\nThere were three immediate problems. \nOur company was not going to buy a generic system, but develop our own unique, tailored system.\nIt was to be done on the cheap, with net savings for record keeping from Year 1.\nThe guy in charge (let’s call him Genius) always (and I mean ALWAYS) thought he was the smartest guy in room. Believe me, he wasn’t.\n\nAnyway, one of the girls I worked with took on the project on the condition that she could have the next July off for her wedding and honeymoon. She worked hard, and the project was actually making progress. One of her duties was passwords, none of which could be written anywhere because Genius knew this was ‘bad’. She periodically reminded Genius about the July wedding and he told her it’d be fine, but never signed off the paperwork. \nCome mid May, the project is WAY behind, mainly because Genius told management it could all be done in house at negligible cost, and Genius kept changing the design every time he read a new magazine article on IT.\nMy friend was then told 6 weeks out from the Wedding that her leave was cancelled. The project took priority and she’d just have to reschedule her wedding, honeymoon, the works. Genius could not see that this might be a problem.\nSo she did her job, updated the passwords as required, never recording them anywhere, as required,......and resigned without notice the last day of June.\n\nOn her honeymoon she gets a frantic call from Genius demanding all the passwords.\n“Sorry, I don’t work there anymore “ click.\n\nThat’s why a decade later our company still has a few hundred electronic case files we can’t access.",
        "permalink": "/r/MaliciousCompliance/comments/8jvuwd/i_dont_work_there_anymore/",
        "comments": [
            "*changes project expectations every week*\n\n\"What do you mean it's not done yet?!\"",
            "As a manager, if you are the smartest guy in the room....you hired the wrong staff.",
            "I hope she had an amazing honeymoon",
            "The worst part of this story was that she had to leverage doing such a horrible ADDITIONAL task in order to get her vacation in the first place \n\n\nI mean, it sounds like she asked a full year in advance...it doesnt make sense to me how she could be denied?",
            "Sometimes, I hope idiotic managers are reading posts like these and learning not to treat their employees like shit.",
            "But what happened to Genius when it all fell apart on his watch?",
            "Why didn't she just go over genius' head for her time off? Why didn't the company try to pay her off for the passwords? Why couldn't they access the paper records anymore? They couldn't have been destroyed since the digital system wasn't finished yet ",
            "I was taking a stupid online elective class the summer I got married.  When I signed up for the class, there was apparently a miscommunication between the instructor and the registrar about the date the class was to end, and the syllabus showed that the final exam would be a week later than originally listed - three days after my wedding, in the middle of my honeymoon.\n\nDrop/add for summer courses was something like three days, so by the time I knew this, it was too late to drop.  Still, it was just a Music Appreciation elective.  Surely the prof would understand and let me take the exam early.\n\nThat's a big nope.  I emailed him and asked, as courteously as possible, if I could take the exam four days early.  After the last class, but before my wedding.  To which he replied, \"No, sorry. Figure it out on your end.\"\n\nWhat \"my end?\"  My end is Jamaica.  Plane tickets are purchased and the wedding venue is booked.  There are about a dozen nonrefundable deposits and fees we're talking about here, not to mention, you know, my fiancee.  I'm not going through all of that for your stupid *music appreciation* summer elective.\n\nSome people are just ridiculous in their inflexibility.  You don't just \"reschedule\" a wedding.\n\n**EDIT:** For those asking what happened: I contacted the Dean's office, but he was on vacation or something that month.  There was somebody there who I think was able to give authorization for the registrar to withdraw me from the course; and as I recall I still got the end-of-course review, so I gave the instructor a *scathing* response.\n\nThis was all eight years ago, and a somewhat busy time of life, so some of the details are a little hazy.  Except for the sentence \"Figure it out on your end.\"  That one is still burned into my brain by a white-hot rage.",
            "This is when you say you'll come back as a contracted consultant for at least triple your hourly rate or a ridiculously high flat rate for a certain period of time.",
            "I **love** this one. The only better outcome would have been genius getting fired. \n\nTrying to cancel a woman's wedding. Get out of here with that weak shit.",
            "As someone who just got fired for a pretty messed up reason (and nothing to do with my operational success or ability to do the job with flying colors) and then was asked a week or so later if I could help them because things were falling apart in my department...    I love this so much. God bless this woman.",
            "A very good friend of mine told me these words of wisdom \"Never mess with a women on her wedding day or any time leading up to that day, she will have zero sense of humor and will kill you\"\n",
            "Well that's an unusual way to fuck two guys at once.",
            "I can't believe that idiot actually thought she'll just drop her wedding and honeymoon like that!",
            "The amount of times I've seen people quit because their manager expected them to put their minimum wage job over a meaningful life event baffles me. ",
            "Damn that’s satisfying",
            "That's when she says \"Sure, I can come back, after my wedding and honeymoon, as a contractor for 3x per hour what my regular pay was.\"",
            "Careful with the password thing if anyone is thinking about this. Read up on Terry Childs and the city of San Francisco (spoiler: it did not end well for Terry).",
            "1. Custom-built system.\n\n2. Works well.\n\n3. Cheap.\n\nPick two.",
            "Deadlines should never list the year. Only a day of the month. Leaves some wiggle room. ",
            "The amount of times I've seen people quit because their manager expected them to put their minimum wage job over a meaningful life event baffles me.\n\n",
            "I bet she's become a legend in your workplace. ",
            "Calling r/prorevenge",
            ">That’s why a decade later our company still has a few hundred electronic case files we can’t access.\n\ncrypto is stronk.",
            "Dude should have known better than to mess with a person's wedding plans. They take, like, a year at minimum to organize; you can't just reschedule that shit. It'd be on par with trying to reschedule a space launch at t-minus 5 minutes. You just... *don't*.",
            "Well, on the plus side it sounds like those files are HIPAA compliant.",
            "I had an internship at some shitty company a few years back, and one day I asked the boss if I could have a day off to go interview with a school for my follow up education.\n\nHe said I asked a bit late but it was alright. Then when that day comes he sends me a message asking where I am, and I answer that I am at the school.\n\nWhen I returned to the office the next day, I found he had left a paper on my desk stating I officially had my first strike. So I went to tell him he said I could have the day off and he tells me send him an email next time.\n\nFuck people like that. In all fairness, he did rescind the strike, but still. I am almost bursting from anxiety at all moments of the day and that whole ordeal made my heart beat like crazy.\n\nIt's a valuable lesson to get everything in writing, even if it shouldn't be necessary. ",
            "I think we all know who the real genius of the story is.",
            "Now that shit was PRO for sure.  Damn :)",
            "You still working there after 10 years?",
            "This is brilliant ",
            "> Our company was not going to buy a generic system, but develop our own unique, tailored system. \n\n\n> It was to be done on the cheap, with net savings for record keeping from Year 1\n\n\nAs an information systems auditor (sorry but someone’s gotta do it?) I just had a heart attack. Almost nothing sinks my heart faster than hearing “yeah it’s a home grown system Bob made in a month”. It’s almost on par with “why can’t everyone just have SAP_ALL??!?” ",
            "Internally created solutions are a trap. First thing out of your mouth should always be \"who is going to support this post release\" because it's guaranteed they will move on to the next best thing as soon as the shit product they create is 25% from what they promised.",
            "Damn, good on her.",
            "I'm not positive this isn't about my workplace.",
            "He should have just approved her time off.",
            "What makes me really mad is... What happens when she starts applying for a new job?  They'll call her references,  and isn't it Genius? He'd say terrible things about her.\n\nHopefully she could put someone else down as her supervisor for her new job applications. ",
            "But does Genius still work there?",
            "That's a fun story.    \n\nI would like to recommend people avoid reproducing, particularly involving digital passwords. Computer Crime laws are poorly written, overly broad, and overly biased towards entities. Which is to say that even though morally and rationally it shouldn't be her responsibility to provide them their passwords, the company could still bring the law down upon her.    \n\nDon't believe me, Google Terry Childs. A large part of the case against him rested on his failure to give up passwords after he was terminated. They claimed he was holding the network \"hostage.\" Five years in jail.     \n\nTL;DR: She did nothing wrong. But the law is so wacko and unfair in this area you don't want to mess with it.   \n\n\n\n",
            "This is essentially the same situation where I work, although in a far lesser capacity.  My company is family owned, by a very hidebound and conservative  set of brothers and an uncle.Illinois is an \"at\\-will\" state; neither employers not employees are required to give notice. If I ever get another job, and for example, interview on a Wednesday, I'll just say I can start the following Monday, if offered a job.",
            "lastpass ",
            "I really hope the password field is blank. ",
            "Yeah, that was the right move.  I hate these kind of management people... I very well may have quit, too.",
            "Were I she Id negotiate a consulting contract for two weeks in August.  100$/hr for 80/hrs. ",
            "PLEASE tell me Genius got fired.",
            "This...is just fucking _beautiful._\n\nWell done to the newlywed. Well fucking done.",
            "this sounds like a solid case of the rare but wonderful hybrid of r/maliciouscompliance and r/pettyrevenge",
            "I hope that significant other she married realizes they married up. That's savage. But also well deserved. Well played anonymous woman. Well played!!!",
            "This change order thing happens on construction projects all the time. \n\nI am currently on a high end remodel that should be ready for cabinets and trim work. The homeowners have changed project details so many times and delayed critical decisions to the degree that they have alienated all the sub contractors. A three month project will likely take six or more. ",
            "This reads like a weekly arc of Dilbert.",
            "I read all these comments and I am so gawdamm glad my background is in Bio/Anthro and I work in animal care. Maybe 45 minutes is the most I spend on a computer at my job, and that’s only to write notes for the owners of the dogs I take care of at the doggy daycare. ",
            "This is all kinds of awesome. This is why the phrase, \"sticking it to the man\" was invented! ",
            "GLORIOUS!\n\nshoot it over to /r/ProRevenge  as well :)",
            "And of course genius is still there, being the Living Momument to the Peter Principle he was destined to be.",
            "Has Genius been telling management for ten years that he can guess the passwords?",
            "Your post almost gave me orgasm... \n\nAm a muslim\nYou almost break my fasting\n\nLmao",
            "Password hint: It offended Pam but made Michael laugh.",
            "R/JusticeServed \nI love this woman ",
            "I actually love this a lot. ",
            "And that bosses real name? Michael Scott",
            "I love it",
            "This is beautiful. You don't ever fuck over an employee like that and expect to get away with it. ",
            " Iģv",
            "Sounds like a story for r/TalesFromTechSupport",
            "And what happened to the notGenius???",
            "I insist all of my employees take most of their time off over the year, and that they take at least one full week (if not two), as disconnected as possible.  \"Take off whenever you want\" is a lie if you don't pressure you team to actually do it, especially if there is never a \"good time\".",
            "This is *epic*",
            "Beautiful.",
            "I’m curious as to how those files are entirely unrecoverable. Did they get encrypted with those passwords or something? If not, reverse engineering the program to bypass the password could be an option. Although, it is likely too late for it to matter by now.",
            "Wow what a fucking jackass. The Genius, I mean. That's a great revenge!",
            "genius",
            "Absolute legend",
            "Lol yeet"
        ]
    },
    {
        "post_id": "11f8au0",
        "author": "EpicSausage69",
        "title": "Only do what is in my job title? Fine, good luck paying employees!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f8au0/only_do_what_is_in_my_job_title_fine_good_luck/",
        "score": 20795,
        "num_comments": 819,
        "created_utc": 1677688436.0,
        "selftext": "So, I work for a construction company as an inventory admin. My job is to basically schedule counts of our warehouse and input the numbers they give me for inventory. Then try to see what the problem is when the numbers on the last count and current count don’t add up. There is a little bit more to it but I will not bore you with the specifics.\n\nThe problem with this job is that when you have been doing it long enough and are good at it, there is less work to do. In the beginning when counting one rack out of 60 racks of material would take a few days, it was fine because I was always busy. But now that everything is in order, the entire warehouse can be counted in 3 days. This leaves me bored for most of the time. So, to fix this I studied up on our cloud-based ERP service that we use for all internal and external transactions and have become sort of an expert on it. Every single aspect of this company uses this ERP service to do their job. Timesheets, HR, Payroll, Accounting, Scheduling, Management, Manufacturing, ordering from vendors, Delivering, Inventory, etc. all runs through this ERP service. So it is very important that this service is up and running perfectly 24/7.\n\nI became so proficient in this service, that our VP decided to cut ties with our consultants of the ERP because I could do what they did but better, quicker, and MUCH cheaper. For reference, we were paying these consultants $5,000 a month just to be on standby if we needed them for some sort of problem that could arise from using this ERP and had to dish out more money to fix those problems depending on how many hours of their time was spent to fix said problems. Not sure on their exact rate but it was something like $200 an hour and they took weeks to fix anything, while I could fix the problem in time for my daily afternoon shit break.\n\nI never got an official job title or raise of any kind for being an expert on this service. The company just saw me being able to do it and let me fix things that happened so they no longer needed the outside help. I wasn’t to upset because it gave me something do so I was glad to help the company save money, even if none of that money fell my way.\n\nSkip ahead a few months. We now have a new warehouse manager and someone in the warehouse fucks something up in inventory by sending a bunch of materials to the wrong job with no records of it being shipped. We are talking half a million dollar fuck up here. In the same day, our ERP had an update that caused a bunch of bugs with our accounting department. So, I decide to work on the ERP problem first because the warehouse fuckup is more of a delay fuck up and not actually stopping anybody from doing their job at the moment, while this accounting problem means our bills are not able to be paid. You can guess what kind of issues we will have if bills are not paid. The ERP bugs turn out to be quite big and numerous so it ends up taking me a couple days to figure out, but I fix it before any bills are actually due and decided to take lunch a little early to celebrate a victory. Crisis averted.\n\nNew warehouse manager storms into my office after I get back from lunch and is LIVID. Apparently, the bosses were pinning the blame on him for the warehouse fuckup. And considering he is the one who oversees shipments and personnel in the warehouse, the blame is rightfully placed. He starts laying into me asking why I have not fixed the problem yet. Yelling and screaming like a child. I tried explaining that I was fixing an ERP issue and have not had time to look at the warehouse problem yet. He gets even more angry and notes that it is funny how I have time to take early lunches but not do my job. That started to piss me off but I held my tongue and kept calm about the situation. He then ordered me to ONLY do what is in my job title and to leave the “ERP bullshit to the people competent enough to handle it” as he put it. Since this guy was technically my supervisor, I had no choice but to obey. I asked him to send me that in writing and he snarks and storms back into his office. 5 minutes later I get an email stating that under NO CIRCUMSTANCES am I to work on anything related to ERP unless it involves inventory.\n\nCue MC.\n\nI do nothing but inventory from that point forward, knowing damn well that we would be essentially coasting until we hit a problem that I would refuse to fix. Sure enough, not even a week later I get an email from HR that some sort of bug in the ERP system was preventing them from accessing payroll to pay employees this week. I reply an apology that I am no longer able to work on ERP bugs due to supervisor and to refer to the ERP system help guide for further assistance. I knew the help guide was not going to help her in the slightest, but it was no longer my problem so I was not going to deal with it. Skip a few days later to Friday. I checked my bank account in the morning before getting to work and laughed because there was no money deposited. That problem never got fixed. I hurry up and get to work, excited to see the chaos unfold. And what I was expecting was an understatement.\n\nWhen I show up to work, I see the ENTIRE warehouse staff of 50 people walking out of the front door. I stopped one and asked why they are leaving and they replied with “I didn’t get paid today, so I am not coming back until I do.” I go into the office and see the warehouse manager in a panic. He has jobs that need material and nobody to load it onto trucks or deliver. I ask him if he needs help with anything and he just screams at me to leave his office because he is getting phone calls out the ass from superintendents of jobs asking why our material has not arrived yet. I pass by HR on the way to my office and see a bunch of the bosses huddled up over her computer with her with angry and confused expressions on their face, I guess trying to figure out the problem. I felt bad for her because it really was something out of her control, but I knew she would ultimately be okay because she had been there for so long that they would never fire her.\n\nWhen I get to my office, I see the VP waiting for me there. He has a very pissed off expression on his face. When we get inside, he demands to know why I did not fix the problem in HR when she emailed me about it. I replied that I am no longer allowed to work on ERP problems as it is not in my job title. He has the most shocked look on his face and asked why all of a sudden I had a change of heart. I show him the email from warehouse manager and I could see the dots connect in his head. He immediately storms out and I see him heading straight to the warehouse managers office.\n\nThey were in there for a few hours but eventually he comes back to my office. He seems calmer now and asks me politely if I can fix the problem in HR and if I can resume fixing the ERP if needed. At this point I liked the relief of responsibility and told him I would only do it if he put it officially in my job title along with a raise. His calmness turned to anger again and he says “I cannot believe you!” as he storms out and returns to his office.\n\nA few hours later, he sends out a mass email that he has hired the old ERP consultants to fix the problem and that next week, everyone would be paid for the money they are owed, along with the money they earned if they return to work. This one surprised me as he would rather pay over $60,000 a year to consultants than give me a few extra bucks an hour for better work. I think he expected me to change my mind and just do it for my own paycheck but I decided to wait because I knew how these consultants were and if they managed to fix this problem in a week, I would streak naked through the office. Most of the warehouse staff agreed to return but were still upset about not getting paid.\n\nSure enough, next Friday comes around. Nobody gets paid again. At this point it is becoming a real problem and the entire staff is becoming agitated. They have bills to pay. I even heard a bunch of the warehouse talking about some competitors nearby they could go work for. At this point, I even considered just fixing the problem because the warehouse didn’t deserve to be treated like that due to poor management. Maybe I am the asshole here for this but I am severely underpaid and can barely afford my apartment, there is no reason I should do extra work for free.\n\nThat same day, the VP returns to my office and hands me papers. These papers said that I would be promoted to a newly created position that dealt with inventory/ERP upkeep. It would be its own department and he would be my direct supervisor, also came with a hefty raise. All I had to do was sign and agree. I looked up at him after reading the paper and he had the saddest look on his face. “Please just sign it, the consultants said it would take them weeks to get around to fixing it due to the high volume of clients they have taken on and we cannot keep skipping paychecks.”\n\nI happily signed it and immediately got to work on the HR issue. Managed to even fix it that same day. It was just a simple problem with the permissions of HR and payroll in the ERP due to the update.\n\n&#x200B;\n\nTLDR: I was doing work outside my job title. Supervisor gets mad and tells me no. I stop and company is unable to pay employees for two weeks. Vice president finally caves in and gives me promotion to do said work outside my job title along with a raise.",
        "permalink": "/r/MaliciousCompliance/comments/11f8au0/only_do_what_is_in_my_job_title_fine_good_luck/",
        "comments": [
            "Nicely done (and nicely written)! I'm impressed how you stood up for yourself with the VP.\nWhat happened with your manager? Seems like he was in a bit of a pickle.",
            "Good on you for asking for, and getting paid for, the work you do.\n\nThe cynical side of me said the moment the VP said “I cannot believe you!” and stormed out, your long term prospects in the company diminished considerably.\n\nThe VP was willing to wait an extra week for an already late paycheck, essentially irritating his entire workforce? Then got back to you only after his attempt with the ERP consultants flopped? You noticed that he'd rather pay a hefty chunk to the ERP consultants, than a far smaller amount to you \\[despite being ready to go immediately and having proven skills in fixing this kind of problem\\]. I'd guess that he'll remember this perceived 'blackmail' and it will haunt you in the future \\[especially as he's your reporting manager now\\]. I'd guess that the Supervisor who banned you is still working there too without consequences?\n\nI hope the cynical side of me is wrong, but I've seen too many management types have long memories for this type of 'challenge to my power'. Considering the money those ERP consultants are getting, while you are underpaid - I'm glad that you have a profitable path forward. Good Luck!",
            "Call the ERP consultants. They might pay better.\n\nGet some experience in client management, sales, etc. and then go solo. $200/hr is low depending on your specialty. Granted you are unlike to bill 2,000 hours a year. Still, if you can bill 1,000 hours at $300/hr that's $300k. You'll be in the hook for taxes, insurance, etc. but I'm guessing it is a higher take home than you've currently got.",
            "Lessons:\n\n1. Get sketchy instructions in writing.\n\n2. If someone tries to add new responsibilities to your job description, keep in mind that additional responsibilities merit additional compensation.",
            "Im the dba for an erp at a construction company and this story is buckwild to me mostly for the fact that you had permissions to altar any of that stuff as an inventory admin initially. It's crazy they would provide permissions to do that to someone without the title. Completely believable, but crazy. I think my company management think I close my office and sit in a circle of mushrooms and commune with database fairies to make our erp work",
            "When will people learn, if someone asks you something in writing be aware that it is to cover their own ass when the inevitable fallout/screw up happens.",
            "[deleted]",
            "Nice! Very well done!  However, it sounds like you are extremely under appreciated.  It would probably be wise to update your resume and start looking for what else is out there.  Heck, you could probably become a contractor that specializes in that ERP system, and be your own boss.",
            "I became the ERP specialist for a company. This is awesome for you. Learn the ERP. Learn their business. You can drive so much efficiency, savings, profit etc.. from that position. You can become an extremely valuable person to them and to other companies. You will understand the business in a way that many top managers don't if you help implement and maximize every feature of the system. I did this and became untouchable by anyone but the owner who knew the value and irreplacability of someone like that. The owner died and I went out as a freelancer making killer money even though I didn't have a college degree or any certification.",
            "Now THIS, dear redditors, is malicious compliance. Brilliant story, and so pleased for getting recognition for what is undoubtedly a highly skilled job.",
            "I really don't understand executives like this.\n\nI treat my staff the best I can and once they are able to provide more value, I immediately make sure to compensate them accordingly.  This means staff are motivated, they see career growth opportunities, and the build up of institutional knowledge is great.\n\nWhats also great is that it ends up saving the company money and makes us perform better.  Turnover is costly and ineffective, bringing in new people dampens performance until they are up to speed, and people want to work in more comfortable situations.",
            "Never teach anyone how to do it properly as I’m fairly sure one day he would love to screw you over.",
            "This company is large enough to use all-encompassing cloud based ERP but doesn't have enough of an understanding to know that having some rando(no offense) in the warehouse be your only troubleshooting for it is a monstrously bad idea? ERP is no joke.\n\nIf true, this company is doomed to fail. Build that resume while you can.",
            "The One Minute Manager Lesson of the Day:\n\nIf someone asks for your instructions in writing, you should step back and reevaluate what you're demanding.\n\nIt's an extremely hard lesson to learn but it's a very hard to find skill.",
            "I'm kind of amazed they could get away with no paying their employees like that.   It's actually against the law and it seems like employees would have complained to the labor board the company would have been heavily fined.",
            ">I asked him to send me that in writing\n\nThat should have sent him a clear message that he was about to make a big mistake. Whenever someone wants an instruction in writing, there is a reason.",
            "Go get your certifications in writing. Take the tests. Put them on your linked in. You’re still being underpaid. \n\nhttps://learn.microsoft.com/en-us/certifications/d365-fundamentals-finance-and-operations-apps-erp/\n\nIf you like your job cool use the job offers to barter a raise. If you don’t use the job offers to get out and get paid appropriately.",
            "> I even considered just fixing the problem because the warehouse didn’t deserve to be treated like that due to poor management.\n\nToo many people fall into this trap in too many different circumstances.\n\nWhen a person or team fails, other people/teams often pick up the slack to prevent the failure. Sporadically, this is just good teamwork, but when it becomes chronic, it stops being helpful as it doesn't fix the problem. Worse than not fixing the problem, those trying to be helpful can cover up the issue leaving management unaware there is any problem. After a few months of this, the failures get cemented in place, the people trying to prop up the failures get burned out, and when management finds out, they have a much bigger problem.\n\nIt's fine to be nice, and it's fine to be helpful, but don't cross over into propping up other people failing at their responsibilities; in the long run you're just making the problem worse.",
            "\"When you are good at something never do it for free.\"",
            "I love that your VP came back and begged you to accept your own offer. This is by far my favorite MC. Kudos to you for making sure you get what you deserve.",
            "\"can I have that in writing?\" they never learn do they.",
            ">told him I would only do it if he put it officially in my job title along with a raise. His calmness turned to anger again and he says “I cannot believe you!” as he storms out and returns to his office.\n>\n>A few hours later, he sends out a mass email that he has hired the old ERP consultants to fix the problem\n\nThis enraged me. It's so unbelievably shortsighted on his part. What a muppet",
            "Also add to TLDR, \"got a hefty pay raise with change in title\"",
            "\"That was last week's offer. This week I want another week of paid vacation per year.\"",
            "I quit when my old employer (our cheap ass CFO, specifically) spent $20,000 on a market survey to deny my request for a $10,000 raise after getting my CNE certification. They wasted all that money they paid for the classes and certification exam, plus lost any benefits they could get out of their investment. I found out the CFO \"resigned\" after the person that replaced me found CP on his laptop. Hope he ended up in prison.",
            "Get proper certifications and go freelance. Ask half the rate of the consulting company and in few months you will be making some serious money.",
            "OP... I hope you are a consultant now.  Great Job!",
            "Absolute legend. I'm so happy with the outcome and the cherry on top of you fixing it the same day. That's a giant middle finger of \"I know what I'm doing\"  if I've seen one",
            "Fantastic!\nDo you have recommendations for ERP research? There’s lots of different programs but I’m also interested in buffing my knowledge in different fields.",
            "Epic.",
            "These are the kinds of MC that I live for. Actually really surprised VP managed to pull his head out of his a** and recognize that if he wanted to save the warehouse he needed to pay you to fix it. This sub is filled with stories of businesses that go under because the higher ups never figured it out. Kudos to you OP for sticking to your guns and demanding the pay you deserve.",
            "Nicely done!\n\nNow go get certified for that ERP and go make 3x the money elsewhere 😘",
            "My fucking god, the dented pride of the manager. He'd really rather go to and spend a bunch of money rather than give a little to OP for an *objectively better service!?*\n\nI really don't get some people, that's a brag. Hey, you know how it costs 60 grand to get shit fixed around here, well I'm getting it done in house for 5! And, I don't have to wait two weeks to get it done either!",
            "My heart dropped when he outsourced the work OP was already doing, but glad the boss swallowed his ego in the end and did the sensible thing.",
            "Wowwwwwwwwwwwww you really let them off the hook.  \nAfter the VP acted like a petulant shithead about the raise, I would have changed my position to \"fire the VP and DOUBLE my pay or I'm quitting\". And then been prepared to walk.",
            "SAP? This smells like SAP.\n\nNot paying workers for a couple of weeks can get dangerous. Not \"gonna get sued\" dangerous, but \"Help, we have a fabrication shop full of very angry people, all of whom are completely surrounded by improvised weapons\" dangerous. I saw it start to play out at a previous job in 2014. People were literally trapped in the office, because someone had set a large stack of material (half inch steel plate) in front of the office door into the shop, and had set some finished product in front of the door that went from the office to the outside. I left before I saw the whole thing play out as I had put in a notice the week before, but I know the police were called, and they didn't even bother to show up. We all eventually got paid.",
            "The joys of IT. I'm just \"helpdesk\" yet I had to watch the head of Telephony and Collaboration go in circles for 2 weeks. When he finally gave up and said I could give it a try, fixed in 5 minutes. I tried telling him, he may know the legit book inside out, but our office's stuff doesn't follow the script.",
            "As an employer, it drives me mad to hear about cheapskate employers. You have a rare and valuable commodity of initiative and acumen. They should have made you that offer soon as you replaced the consultants.  It’s a no brainer.",
            "\"can i get that in writing\" if you're in a managerial position and one of the people youre responsible for says this that is a direct cue to \\*tread very carefully\\*. That being said gg OP i think you handled this very well",
            "[deleted]",
            "I know nothing of your industry or ERP, but do a lot of businesses use this? Could you be your own consulting firm with a few clients each paying you 5k/month plus hourly? Sounds like you have an extremely valuable skill. You should ERP all them bitches.",
            "Similar scenario. The city I worked for (I’m retired now) had a small fleet of helicopters, mainly used for the police. They hired a basic level mechanic for them. The Federal Aviation Administration has very stringent regulations on who is allowed to perform maintenance on aircraft and a person needs to get separate certifications for almost every aspect of the repairs. \n\nAnyway the lady they hired was fresh out of technical school with the correct certifications to do basic maintenance. She loved working on helicopters but was limited in what she could do. The city would contract out any advanced repair or maintenance work at very expensive rates. The mechanic continued to go to school to get more and more advanced certifications. As she got the certifications, she would perform that repair work so it wouldn’t have to be contracted. She was paying for the advanced training out of her own pocket. \n\nAfter a couple of years, she was certified to just about repair anything on the helicopters. She discovered that the city was saving about a million a year in contracts because she was able to perform the advanced maintenance and inspections required. She went to the city manager and requested a 50k a year raise.  City manager refused any raise and she promptly quit and went to work elsewhere with well more than a 50K raise. \n\nThey soon discovered they couldn’t find a basic level mechanic for the fleet at what they had been paying her. They also were not getting the advanced work she had been doing done by city maintenance because they didn’t have anyone certified.  The cost of having to contract out all of the helicopter maintenance almost caused the elimination of the helicopter unit. The city manager’s refusal to consider a pay raise for her costs them several million dollars a year.",
            "Sounds like you have major talent! Please don’t sell yourself short ever again. With your supervisor storming out instead of giving you a raise was all ego bullshit. High five for fixing the problem and helping out the crew. Now go somewhere that will pay you even more",
            "Love it so much. Way to rightfully use your leverage and get what you deserve.",
            "Damn impressive, awesome job! \n\nI hope your raise was at least 30k for that, you deserve it. If not, you could argue if you left they'd have to hire 2 people and pay them 2 salaries to replace you at least, so it’s much worth it for them to pay you more.",
            "NICE!",
            "What happened to the warehouse manager?",
            "Now find a job fixing ERP stuff elsewhere....for double your new salary.",
            "This is exactly why I like this sub, a beautiful piece of mc. Well done you.",
            "How’d the warehouse manager fare?",
            "Money says Legal told VP to give in before the Department of Labor got on their ass.\n\nGood for you, OP, for not giving in until they acknowledged what you were worth.",
            "Great stuff. I hope the pay raise was enough to hurt their ego.",
            "You are my hero 💗",
            "I absolutely love this! Perfect post!\n\nCurrently going through something similar and cannot wait for the inevitable cascade of problems. \n\nWay to go!",
            "I love these stories where the \"lowly worker\" ends up complying to a dumb rule/order from management/higher ups and the chaos that comes out of it makes those responsible deflate like a sad balloon.",
            "Good on you OP for getting the recognition you deserved along with the appropriate raise. \n\nThought is you are probably already doing this but if not suggestion to get a subordinate position for your new department and you hire someone like yourself who can handle/learn your applications and support them.  \n\nThis way you should be able to take an actual vacation of more than a couple days.",
            "Good on you! You should always get paid what you're worth for the work you do. They would have known they were coasting on you, and just didn't care.",
            "longest post i ever read. totally worth it! congratulations! 🤘🏼",
            "This is the level of malicious compliance I aspire to one day lol. Kudos to you :)",
            "It angers me it had to be that way.. the outright entitlement employers have always astonishes me.. I have no idea why.",
            "Oh man that was beautiful to read. I love everything about this. I thought at first you'd just get the warehouse manager chewed out but you held out for that raise? Beautiful and well deserved.",
            "'I cant believe you!'\n\nLolwut. You can't believe I want to be paid for the work im doing?\n\nYou currently have a whole building full of people walking out for this exact reason, but its ME you take umbridge with?",
            "I'm hoping the raise was of the order of $60,000 per year.",
            "And you got a promotion and a fat pay increase for it!\n\nBUT.....update your resume and start shopping it.\n\nBusiness (particularly \\*management\\*) weenies HATE to be shown up and humiliated for their arrogant bullying mistakes.\n\nThey WILL find a way to take you down, and will keep working on it until they succeed.  Better to be interviewing and be ready at the first sign they're actually \\*moving\\* on their peevish anger to move to a higher paying job in a new firm.  In fact, give them 2 years at the most before moving on and up to a higher paying, higher status job.",
            "“Cloud-based Erotic Role Play” sounds interesting…",
            "This is awesome. As someone who has dealt with ERP systems this story rings true. The consultants NEVER understand the configurations as well as someone in house. Provided, of course that in house person house has some IT savvy. Bravo, OP! Also…I bet I can guess the ERP vendor lol.",
            "While it probably isn't true in this case, it would certainly be ironic if the Supervisor was all: \"He's my employee and on my departments budget, so therefore, my problems are more important then your borrowing him for unrelated tasks.\" Interdepartmental politics could easily see this happening and would have turned this into a double malicious compliance as the VP transfers op to answer to him.",
            "If you're really that good at fixing ERP issues you should probably swap careers.\n\nYou could be making 120-165k doing what you do.\n\n\nNow that you have a title that has ERP in it, you should really start looking at new gigs in 4-6 months. \n\nYou owe them nothing.",
            "It's funny yet sad, but 90% of these MC events seem to be about a NEW manager overstepping their bounds or trying to micromanage things better left untouched. Sad because it keeps happening, and no matter how widespread the event is, the new managers never know about and make the same mistake as the previous ones.\n\nAlso funny to see how some small changes can cause a massive tidal wave of shit.",
            "It absolutley does suck that the warehouse got caught int he middle. My work husband (we work VERY well together) has the same problem where over the years he has covered so many mistakes that it's just expected of him to 1) do the job of 3-4 people and 2) Half the the job responsibility of 3/4 of the sales reps. He's been slowly burning out and I keep saying to him you need to let shit crash and burn if you want anything to change.\n\nYes, customers will be pissed off, shit will get missed and heads will roll. But it won't be yours because you're to valueable to them and I'm safe by extension of you. The only heads that will roll will be those causing the torubles. But he cares to much about the customers to just let the bus crash. So yes, sometimes innocents need to be in the crossfire before the generals take notice. As long as everything runs well enough as far as manglement is concerned nothing is wrong. It's when techs/customers and everyone in between starts complaining that they investigate.",
            "That's the most satisfying conclusion I've ever read.",
            "finally had some leverage\n\nshould have told them to bump that number 25% higher and then you'd sign",
            "Savage. Glorious. Perfect MC.",
            ">I hurry up and get to work, excited to see the chaos unfold.\n\nYou are my fucking spirit animal!",
            "\"My rate for consulting on ERP issues is $200 an hour, minimum 5 hours, payable in advance, and on top of my regular salary.\"",
            "Gotta stick it to the man every once in a while to show them you got a pair",
            "Result!!!",
            "Excellent",
            "Great job handling that situation! It actually made me happy to read it and how well it turned out for you and you're not longer being taken advantage of to do extra work.",
            "Story of the month! Well handled. I'm surprised that your VP's first instinct was to rehire the consultants",
            "Best laugh I've had for weeks!!! \n\nTruly delicious!",
            "This was an adventure!😂 worth the read👍🏻",
            "Always, always, put it in writing, and CYA.",
            "You are amazing",
            "Love it",
            "\\>>“Please just sign it, \n\nSure, when my raise gets retroactively assigned to when I started doing this work.  I should have been paid this all along and you took advantage of me.",
            "Love everything about this and I would have taken a step further and asked for a bonus to clear this up right here right now",
            "Great job!",
            "\"To the death!\"\n \n\"No. To the pain!\"",
            "Amazing. You are an inspiration. Why should you keep doing extra work for no pay despite saving the company tens of thousands of dollars. Glad you got the raise and title you deserve",
            "I like to picture you with your feet up on your desk lounging back in your chair doing nothing when the VP bursts into your office for that final meeting.",
            "Nice. That new role can equal a high paying career after a few years, speaking as someone in Salesforce.",
            "This is one of the best I've ever seen. Amazing.",
            "This is the kind of MC I come here to read.  Thanks",
            "All of the wage claims that should have been filed. The company would have had to pay interest on all of those checks.",
            "Excellent!!  VP thought he could skate out with minimal damage to his budget, and continue to get free ERP support!!!  Gee only took him another week to figure out he would be getting a bargain with a capital B by agreeing to your demands.    \n\n\nLove it, love it, love it.",
            "This is the way.",
            "Amazing story.",
            "Anytime a new manager makes a major change to an employees duties and said employee is happy to do so as long as they put it in writing, that should make them stop and think for a moment.",
            "In 1 year you should absolutely be interviewing at other companies for different roles in this field.\n\nI'd even put out feelers now. I suspect they're still underpaying you.",
            "I hope your raise was an extra 60K a year as well. Same money they were going to spend, but with prompt service. Still a win on their end.",
            "Managment almost never understands how much IT affects the operation of a company. All they see is that they are paying these expensive people when there is nothing wrong.  \nAnd/or managment doesn't want to pay for people that know how things work as they think IT is easy and anyone can do it.  \nIt's only after they loose their IT staff because the company doesn't want to pay for them, or the work is outsourced that management learns a hard lesson.  \nI left a company that didn't want to pay my wage because there was never any IT problems. The reason there wasn't any problems is because I was fixing the problems behind the scenes. When a user had a problem they talked to me so managment didn't know about it.  \nI left and they assigned my work to a relitive in another department because \"they know alot about computers\". This is the same person that once came to me for a new mouse due to the old one not working. It wasn't working because they put new batteries into it, backwards.  \nAnyways you can see where this is going.",
            "Flawless victory!",
            "Ooohhh this is a good one. Honestly, if you're ever told \"can I get that in writing?\" You should seriously look and see where you're fucking up because it's never pretty.",
            "I'm the main technical ERP guy at our company. It has its issues but I'm definitely better paid than just doing inventory work at least. This story resonates so hard though.",
            "Now you know to act your wage",
            "similar to my last job, I don't claim to be an expert in Salesforce, but doing the tutorials and watching YouTube videos helped me gain a good understanding of it. I was guiding fellow staff members how to run reports, how to search the data for the right information. I was being paid minimum wage! Annual job review was up and no raise, but I was the Salesforce 'expert' which the dir. of operations said.They were taking advantage of me :/",
            "And that, kids, is why we say: NEVER WORK FOR FREE. Congratulations on your promotion OP.",
            "Well-played OP.\n\nYou don't eff with the one person that knows one of the things your business relies upon.  \n\nPerhaps some of these \"supervisors\" that come up with these brilliant ideas should be reading this sub on the regular.",
            "Bravo!",
            "This whole post felt like an emotional rollercoaster from paragraph to paragraph! Good for you, and what an awesome read!",
            "That's the best one I've heard in a while. I love that stood your ground and went after what you knew you were worth. More people need to be like you.",
            "I think I just developed a crush on you.  Wish I had thought of that when I learned how to engineer and detail instead of being underpaid for 7 years.\n\nMy revenge? 2 years after I left I got the contracts to do the engineering and detailing for my former employers biggest five clients.  Makes me a pretty nice nest egg while I do my other WFH job and takes me maybe an hour a day on the average.  I still have  2 years running on two of them and 3 years on the other ones.  I don't see that changing because I can afford to undercut anybody by 50% and laugh all the way to the bank :)",
            "As someone who rides the struggle-bus that is ERP and SAP, anyone who is self-taught borders on some kind of crazy genius level.   You can write your own paycheck if you want to go into consulting.",
            "How much % increase is the raise? Congrat btw",
            "I love this story, the way it's explained, it's outcome. Everything.  Congrats on standing up to the boss and coming out correctly compensated",
            ">It was just a simple problem with the permissions of HR and payroll in the ERP due to the update.\n\nAt my work if some application breaks, the first thing that needs to happen is roll back the update.  90% of the time, it works every time.",
            "Too bad you already signed the agreement. You should have started a consulting company that charges $4k/mo for on-call and $200/hr just to undercut your competition a bit. \n\nYou do realize you are providing a better SLA than the consultants, right? You should be charging more than them.",
            "Definitely set up some sort of system to log your activity. Also discuss unionizing with your co-workers, outside of work.  You're going to be a high priority target for those antics I respect tf out of your hustle. :) don't get canned you all can guarantee a lot more for yourselves, because your management seems pretty bad at bluffing.",
            "You Steinmetzed them! ($1 for the chalkmark, $9,999 for the knowledge of where to put it).  \n\nWell done.",
            "Real advice? take the new title, this example of your ability to create value and stay composed and… look for a better job with a company that isn’t this short-sighted. Seriously. You have leverage, you have a recent promotion with a great interview story, don’t NEED a new job, but just doing a little shopping. \n\nYou may fuck around and find somebody that actually understands to take people like you and just get the fuck out of their way, they will do good and you will only slow them down. People pay good money for this shit AND treat people professionally concurrently.\n\nIm serious. Celebrate the W, definitely a W and congrats. There’s still meat on that bone when you get hungry again though.",
            "Time to find a new job, OP. After that initial response from the VP, they are just itching for a reason to get rid of you",
            "And that boys and girls is how to learn essential skills in your work place and leverage those skills for better compensation.",
            "This is awesome. In six months or a year leverage this into another raise. You should be getting at least 10% increase per year.",
            "Honestly, as someone who works in software development the company shouldn’t be relying on someone internal to maintain the system, the fact that the update went through without any sort of UAT or Test environment proves that to me. Well done on getting your new responsibilities in writing but I would highly recommend that you set up a proper process for the system including backups etc..",
            "This is entirely the fault of the people that fired the consultants and didn't immediately make you a new department then. Your warehouse manager was an AH but it's not his fault that someone that should be doing warehouse stuff got pulled into doing completely unrelated enterprise IT stuff. I'd be asking around why this dude(you) is even on your team and did someone forget to update the org chart or something because he's clearly an IT guy?",
            "Always a 'New Manager'. When will they learn? When shits running smoothly let it run.",
            "This was absolutely the right move. You would be right back in the same situation the moment the manager got a new position elsewhere and a new guy moved in and saw his chance to flex his limited power.",
            "I would have asked for a sign on bonus... If the VP knew it was going to take weeks longer!",
            "A cautionary tale to managers:\n\nReally understand the unofficial value add each person brings to your organization",
            ">This one surprised me as he would rather pay over $60,000 a year to consultants than give me a few extra bucks an hour for better work.\n\nThis is what we call \"cutting off your nose to spite your face\" 😛",
            "Love it how OP just holds firm despite personal ties/being sorry almosty makes him cave. \n\nThis is working in the 2020s people. Younger gens particularly pay attention.",
            "This was the most satisfying story I’ve read all day (and I’ve been scrolling through r/maliciousCompliance for awhile!) Thank you. Also the fact that you could have sat on your ass with all that extra time but instead took the initiative to learn the entire ERP system just to be selflessly helpful made it so much better!",
            "Well played, fellow redditor, well played. Do feel sorry for the people who didn't get paid, but... well. Fuck management, THEY deserved it.",
            "my hat's off to you OP.  well done. we are all proud of you.",
            "Good for you to hold your ground and not let them exploit you.",
            ">This one surprised me as he would rather pay over $60,000 a year to consultants than give me a few extra bucks an hour for better work.\n\nI'm waaaay late to this but this is exactly what I expected to happen when you asked for proper compensation. Companies would rather hire new people in need of training at 1.5x or 2x the rate of existing employees than give employees a raise when they ask. They genuinely seem to take it personally that an employee could dare ask to be compensated for their work.",
            "[deleted]",
            "The only way I've seen ERP used is the term Erotic Role Play. Have fun rereading with that in mind :)",
            "Great MC.\n\nI actually don't think the warehouse supervisor is the bad guy here - other than of course the way he spoke to a direct report. That clearly is unacceptable.\n He had a department to run, and KPI's to meet along with with responsibilities to his other staff.\nHow any senior staff thought it was ok to not have support for crucial and the key software for the organisation is beyond me. The board should dismiss them.",
            "fucken'legend",
            "Awesome. Now go apply for ERP specialist jobs elsewhere.",
            "should have updated the salary by around $15k/year - over whatever he offered",
            "Bravo to you OP! Having been a warehouse worker, it amazes me how every new person put into a position of any power would quickly fuck up the status quo.",
            "That’s how it’s done people 👏🏾👏🏾👏🏾 your patience paid off.",
            "It's truly amazing how companies would rather spend boatloads of money to have somebody from another company do a particular job, rather than pay an employee of theirs a small fraction of that amount because they feel like they are entitled to free labor from their employee.",
            "*chefs kiss*",
            "Fantastic!",
            "Excellent MC!",
            "Fuckin A OP!!",
            "Nice job!",
            "I know you felt bad for the warehouse people, but I bet if they knew the story they'd be on your side 100%.",
            "Your bosses will likely hold a grudge, ask you to train others/document your knowledge, then get rid of you. Look out for yourself.",
            "I get that you think you won some sort of victory but this is not a place anyone sane would want to work.  Use that new title to get a job somewhere managed right.",
            "It always amazes me when I hear of how many companies take undue advantage of their employees and then get mad/upset when the employees quit/ask for appropriate raises.",
            "I kind of think you should have left work, incorporated yourself as a consultant overnight and them walked back in with a contract for a year’s work at a slightly lower rate than the consultants to do the same ERP work. But I get it. Also, why did it take a “few hours” with the warehouse manager?",
            "I work in IT with many companies as clients. Almost every single time we pick up a new client it's the same story.. they are utterly amazed whenever we answer the phone and can fix the problem within 48 hours.",
            "What up, ERP SME? 🫡",
            "I understand the importance of saving face, but if the conversation never leaves the office, and if I can expect that my employee will do a better job than the company which I already canceled services with, I can't imagine why I wouldn't do what was needful for a pittance.",
            "Well played",
            "What an awful VP, willing to outsource to high cost contractors instead of supporting in-house employees.",
            "You are my hero today.",
            "That was the wildest read I've had in years, well done.",
            "Should've made the manager apologize for his attitude.",
            "This was unbelievably satisfying to read. Nice work! Played them like a fiddle.",
            "You are my hero I wish my daughter had reddit! She's like you and can run numbers like no one else and any other paperwork involved in running a car dealership. For the last two weeks I've been begging her to just do her job because of the treatment she's getting at work. But she says she can't because it's not in her to watch the whole place implode. If it was me imploding would be exactly what happens. Never ever let someone tell you your worth especially when your holding all the cards!!!!!",
            "I SERIOUSLY respect this move. Like, just... wow. \n\nGlad to hear you're getting paid for the extra work now. Good job keeping cool during all the chaos. sounds like it was a sight to behold",
            "This is brilliant beyond so many levels.",
            "I.. I have never seen a post that mirrors my work life situation so closely before omg. Different type of job environment, but I am seriously wondering if you have the same ERP we have.",
            "Absolutely bloody awesome.  Bravo!",
            "If I had a peen I'd have a boner rn. This story is so good. I'm glad you got the promotion and the raise. When it comes to work stuff, no good deed goes unpunished.",
            "Cheers!!!!",
            "You da boss!",
            "Great job in sticking up for yourself.  Your manager was clueless but he had the excuse of being new.  Your VP should have known better given he let the consultants go in the first place.  Instead of being grateful to you, he was a jerk in not giving you a fair pay and role change the first time you asked.",
            "I read everything you wrote, it was marvelous.",
            "Make yourself invaluable, oldest trick in the book. Even if you did it by accident.",
            "I hope one day we all have a story like this to tell @OP. Damn that must have felt so good! Good on you for standing up for yourself.",
            "Oh, this warms my heart. I work for a payroll/hr company selling software and so I know EXACTLY what your worth is and I’m glad you recognized it too. It took your management team a minute to figure it out, but I bet they won’t soon forget.",
            "You give me hope, kind redditor...",
            "Damn bro, that’s epic. Congratulations on standing up for yourself and getting paid!!",
            "I would consider maybe working for that ERP consulting place. They seem to have a need for people like you. I bet it pays a lot better too.",
            "This is juicy nom nom nom nom",
            "The best kind of \"bug\".... 🤣🤣🤣🤣\nGood job on everything else and congratulations on the raise and recognition 👍",
            "What a wild ass ride. I'm glad you were able to negotiate the deserved title and raise.",
            "Beautiful story",
            "That’s one of the most enjoyable MC posts I think I’ve ever read. Glad I read it before bed bc now I’m going to sleep happy, lol!",
            "This is beautiful",
            "Everyone can be an okay manager when things are going well, but it's a spectacularly bad one who, because of his emotional hygiene issues, causes a walkout, multiple client outrage, many company wide emails that demonstrate how dysfunctional the company is, and then force a needed promotion the company was getting a free ride on. Bravo!",
            "What ERP are y'all using? I'm curious now. Epic story by the way.",
            "👏👏👏👏",
            "Let me guess, your ERP vendor is Epicor 😂 congrats on the raise and promotion!",
            "This was so satisfying and so frustrating. How to such morons make it into management?",
            "Amazing MC!",
            "I'm an erotic roleplay consultant for much cheaper than that, if your company is hiring...",
            "Jeez.  You fixed it so fast, they could have presumed you broke it on purpose in the first place…I would have dragged the solution out till the next day or so, just so it doesn’t look too easy.",
            "Great story- and well written too. You eventually got the value of all the extra work you were doing for the company (hopefully). Sounds like you could probably run an ERP consultancy yourself *wink*",
            "That was a great story. \n\nBut also, it seems like pretty bad design to me if the company that makes this software can't get it to retain permissions between updates.",
            "Damn, that is lit. Good going OP. Totally praise your ambition and remarkable work.",
            "@epicsausage69\nThats AWESOME! Im way happy for you with the way you stood up for yourself, got the company \"brass\" to see and acknowledge YOUR value to the company, even AGREE to compensate you for your knowledge AND, most importantly, get you out from under an ignorant/abusive and toxic managers chain of command. Super happy for you!! Way to go. :)",
            "This may be the most satisfying shit I have ever read here.",
            "The “he has the saddest look on his face” really made this story for me, I can just picture it. Kudos for sticking to your guns, man!",
            "This is very satisfying! Well done for standing up for yourself & winning in the end.",
            "Should have asked for back pay for the new rate.",
            "This is a master class in how to deal with a shit boss!\n\nHave my upvote sir (I assume by your username that you’re a sir, but I apologize in advance if I’m misgendering you!) and you now have my admiration from here to Poughkeepsie!",
            "If you are the only person who knows how the ERP works, who the fuck is deploying updates?",
            "Probably will be downvoted, butttt this is kinda why you don’t just take on extra sole responsibility outside of ur jobs scope just because it’s a bit quiet.",
            "Is it wrong for me to be even more petty and demand a higher raise for their utter assholery that first time you asked for a raise .\n\n\n\"Please sign it \"\n\n\"But you were so insistend on your erp consultant. Put 2bucks more and we got a deal\"",
            "I'd be curious what your updated contract was like, given they seemed to be fine paying a 5k retainer without any sort of SLA.",
            "\"he would rather pay over $60,000\"\n\nYou had me worried there for a minute. Sometimes the bean counters get crazy over the gawd-almighty penny, so I'm glad for you that they got it straightened out to benefit all.",
            "This was a funny read, good that you got the raise and job title.",
            "This is a much better story than the one last week (?) of a guy who MCed his way to keep working extra hours for free.",
            "This story is just epic! You are amazing! I wish I had special skills like you to utilize in such a way.",
            "Good on you for sticking to your guns.  Even when seeing \"innocents\" being caught up in the debacle.  Management was counting on your kindness to break before their wallet would.",
            "I applaud you sir!!!! Epic! 😂 Brilliant!",
            "This Gives me hope !   It is wondaful to hear some people DO get what they deserve ! You handled it with a grace and patience I do not have !  Congratulations",
            "Good for you - I’m glad you got a pay raise",
            "Doing that extra work for free had me sweating till the end, nice job staying focused on that promo!",
            "LOVE IT, great job OP!",
            "What kind of VP doesn't realize your worth, and instead cries in disbelief when you request what even HE would ask for in a similar situation?\n\nNo offer to promote and grant a raise would have had me looking for another job.",
            "Permissions fucked after an update? This sounds like Microsoft Dynamics D365 Finance and Operations.",
            "When people use acronyms without defining them, I make them up. ERP? Electronic Rapper Porn.",
            "I love everything about this story. The fact that they wanted to pay 60,000 instead of giving you a raise is such a spit in the face, the warehouse manager sounds like a dick but clearly it doesn't stop there. Way to make yourself more valuable, and then to not give them that value for no compensation",
            "I'm constantly disgusted at our ERP and the lack of speed which multiple supporting consulting firms have displayed on solving problems related to it. This story was very satisfying, and I congratulate you for figuring out how the whole thing works. You deserve that increased pay.",
            "This is a case study in advocating for one's self, while being both nice AND kind when the situation calls for it, but not doing one instead of the other.",
            "Awesome story, you're a badass.",
            "Great story and I'm so happy to see you standup for yourself against exploitation! One thing tho, you need to tell us what jargon like \"ERP\" means. The only ERP I've ever heard of is Erotic Roleplay so I imagined the entire thing with you guys having this massive, intricate Erotoc Roleplay going on with all the staff and customers lol",
            "[removed]",
            "Sounds like you need to start a ERP consulting service",
            "So glad you got it in writing!",
            "Too Long, hell, MUST READ!  A best ever MC tale . . . ."
        ]
    },
    {
        "post_id": "qa9q1z",
        "author": "dodohead974",
        "title": "you're on a performance notice; no raise/bonus, no WFH, no OT, and no learning new responsibilities - and then COVID happens",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qa9q1z/youre_on_a_performance_notice_no_raisebonus_no/",
        "score": 20621,
        "num_comments": 549,
        "created_utc": 1634511228.0,
        "selftext": "so i've posted a few stories about my \"wonderful\" old manager. let's just call her Samantha. this story is about a coworker we will cal Joe - and from day one it was obvious that joe was one of the hardest working people on the team; and Samantha could not stand him. \n\nso this is a few years into Joe's tenure with the team and for whatever reason or another Samantha decides to put Joe on Performance  Notice; which is basically an HR notice that you have six months to get your shit together...or your fired. the reason on the paperwork: \"improper attitude\"\n\nJoe was the type of guy to ALWAYS speak his mind...and while management says they live this, brutal experience shows this is a lie. the problem with notice is it also comes with penalties: no WFH (they literally take your laptop away and bring you a thin client) , no approved OT, and no learning new things or assignments....oh and no raise or bonus. you have to prove you do your job well and then after the six months if you're not fired, the manager can extend with an additional probation period of another six months. \n\njanuary of every year is when we find out about our raises and bonuses from the previous year, and to put it delicately, that january they fucked us...to the point that one person walked out and two older employees(30+ years) took packages. come february, we are drowning, and Joe can't work OT and joe can't learn new things...managers orders, remember? well this is the middle of joe's probation period, as Samantha predictably extended his notice...so this is where we find ourselves mid march, 2020. cue malicious compliance.\n\nduring the lockdown, they send the whole company home...everyone is Working from home; except Joe. he is home....just not working. he technically can't. and about two weeks in to the lockdown is when Samantha finally notices\n\nshe goes ballistic. \"why aren't you working ?! blah blah blah, on a team email with everyone cc'd! he replies all; \"as you know, i am on coaching and cannot work from home.\"\n\ntries to get HR to fire him, to which they reply, \"Samantha, you elected to continue the notice, which still has 4 months...we can't issue him a laptop until it expires.\"\n\nturns out the only way to rectify it ASAP was to petition formally with the head of HR, that putting Joe on a performance notice was done in error and have all parties sign, including Joe. all this happens except joe refuses to sign. he won't sign until them give him his bonus and raise...which they do. the whole thing took a month...a month of joe basically on a free vacation lol\n\nTL;DR: a coworker on notice can't work from home because of company policy..and thenCovid happens\n\nEDIT:  well i didn't expect this one to blow up like this!!! but there have been some questions that i feel i need to add some context to. first is the work we do...it's easy. like a stereotypical corporate job, a concerted effort of maybe 3 hours a day is enough to do your job. most people screw around, chit chat and milk the day; some people go even further and milk the work so much that they \"need help\" with their workload. we have a coworker who would literally watch netflix all day.\nmanagement either never figured it out, or didn't care.\n\ni've had days where i've done all my work before lunch and took it easy the rest, and then i've had days were i didn't do a thing all day - incompetent management creates gray areas....as long as the work gets done, they don't look too deep into who is doing what. and people get away with minimal work, knowing others will pick up the slack. this is where joe found himself when the pandemic started...the company, which has never had all of its employees (or even a good amount) remote at the same time was unprepared on how to handle the situation and our managers were even less prepared. joe literally just found himself forgotten; and didn't raise his hand to tell anyone for a bit lol.",
        "permalink": "/r/MaliciousCompliance/comments/qa9q1z/youre_on_a_performance_notice_no_raisebonus_no/",
        "comments": [
            "I thought for a second Joe was going to just show up, be the only one at the office while everyone else was at home, and just chill because there's no one there since everyone wanted to stay at and work from home.",
            "I think HR knew Samantha was full of it, and needed her to say it herself.",
            "That's a really good one. I got put on notice during covid because there was a down turn in work and to complete my hours (we are on a direct billing system to our customers. Down to the 15min, expected 40h a week) i supplemented my hours by working on internal business development projects rather than direct bill. This means documentation of our processes and training material. We have a lot of document debit because no one likes to make it.\n\n So, boss puts me on notice and I'm sitting there with HR and they said I'm not doing my job. I ask them for a itemized list of my duties that I agreed to in my contract. There is no such thing. I asked for a list of responsibilities as layed out by my boss, he's never given me one. So i said \"you want to fire me but can't prove to me I'm not doing my job. All you have is my billable hours not meeting a target that was set on my last review that isn't even signed by either party. Ok give me a list of duties and responsibilities so that i can prove that I'm a good employee by your standards.\" so they provide this list, which notablely far exceeds the efforts of my co-workers, and I blow every metric out of the water. The follow up HR conversation was \"look at how much you improved\" \"no, this was purely not having correct management guidance on what my job is and it never being communicated to me. I want a transfer out of the department.\" \" Well we can't do that because you were on report\" \"interesting, well let me say this a different way: my boss has been harrassing me, never defined my role then attempted to get me fired when I didn't do things his way.\" \"Is this a formal complaint?\" \"No, this is me asking for a transfer and you not grasping the gravity of the situation. I expect this to be done in 6 months\" \n\n6 months later, My transfer is Nov 1st. Still their best employee in that department now that I've been given the means to measure my normal duties. 3 other staff are now leaving too and Sr management is looking REALLY hard at the inner workings of the department. Some times when you play stupid games, and your employee knows their rights, you win stupid prises. \n\nI can't stress this enough: get everything in writing. Record all conversations either by hand or audio. Journal your week and what you were doing. Date it all, sign it all. Employers are out to make money off you and they will get rid of you when it suits them. They are not your friends and they do not have your best interest at heart. Protect yourself and don't be afraid to push back. Be civil and ensure you are being the reasonable one. \n\nKnow your rights.",
            "Joe is the hero we need today!",
            "I knew a Joe.   We were in Federal IT.   Super good guy.   Competent, professional, and hard working.  Spoke his mind.    One day a few terra bytes of data went missing.   PHB (Pointy Haired Boss) blamed Joe and put him on admin leave.  PHB asked Joe to bring in his laptop.  Law enforcement met Joe at the door and escorted him.  (WTF?)  PHB asked for laptop.  Joe said \"Sure, after I sign a chain of custody.\"  PHB went ballistic.  Joe stood his ground.  Law enforcement officer put together a chain of custody.  Joe signed.  A few months later another employee admits to accidentally deleting the data. PHB calls Joe and says \"No harm no foul.\"  Joe, \"There is harm, there is foul.\"   There was some kind of settlement but I didn't hear what it was.  Joe has since moved on and up.",
            "Similar thing happened to me regarding wfh, though not as juicy as your story.\n\nWe used to be able to work from home as we saw fit. Then like a month before Covid my boss said “no\nMore working from home” out of the blue. The team was pretty upset. Then Covid hit and we have been working from home ever since. 🤷🏻‍♂️",
            "And HR back up Joe!  Awesome.",
            "I had an almost similar story for the first few paragraphs, to the point where I thought you were someone on my (thankfully old) team and talking about me. \n\nI was put on my company’s version of “coaching” in February and we went WFH in March. There’s no set timeline for the coaching, but there are goals you need to hit. One of those goals my manager set was something to do SPECIFICALLY with in-person communication. Well, two months later and I’m sure I knocked out all the goals and asked to be taken off coaching, but was told they can’t take me off because of that goal hadn’t been accomplished. I was LIVID that they wouldn’t remove that as a goal in the face of a global pandemic that didn’t allow me actual in-person interactions with people. It took another 3 months before I was able to be removed from coaching after fighting with HR. I was tempted to just quit, but if you quit or get fired on coaching you can’t be rehired in the future and I really liked working there and had great experiences my entire tenure except for my time with this manager.\n\nI switched teams as soon as I was able to get off coaching, and was promoted within 3 quarters and top performer on my new team every quarter. My previous manager refused to promote me despite everybody knowing I deserved it.",
            "Good on him, fuck that manager.",
            "How did Joe answer email?",
            "Joe REFUSES TO SIGN!   What a badass!",
            "They need to give Joe Samantha’s job and let her fend for herself.",
            "Performance notice/performance management seems to be mostly about micromanaging someone until they get fed up enough to quit.  Easier and less risk than firing someone.",
            "The fact that Samantha didn't quickly realize why Joe wasn't working, and needed him to remind her, strongly suggests the whole probation thing was done for petty reasons. And that she is not qualified to manage people.",
            "Hell yeah, Joe. That's awesome. Next time you have a moment to speak candidly with him, let him know he's a hero among men.",
            "It's so satisfying to see ppl drowning in their own bullshit.... Karma really does provide us with some great moments!!",
            "If Joe was smart he took that month to line up another job and quite 2 weeks after coming back.",
            "Being brinded a thin client...man, that's gotta hurt.",
            "Hope he quit after getting his bonus.",
            "Joe still has a lawsuit option his back pocket. If I were Joe, I would come after Samantha with the fire of a thousand suns and not ease up until she simultaneously has a nervous breakdown and is fired for cause.",
            "Haha🤣🤣🤣🤣",
            "Be like Joe",
            "*I’d Say, In A Given Week, I Probably Only Do About Fifteen Minutes Of Real, Actual Work.*",
            "Private companies are always more efficient than government I'm told but these stories show we all know that's bs.",
            "I think Joe and I would be very good friends. If he's still working there, buy him a beer for me.",
            "Good for Joe.",
            "That was a deeply satisfying read. I’m glad Joe came out on top but that Samantha is the WORST",
            "oh also protip, at least in the world of software engineering. pips are bullshit. even if you succeed at them you'll still be out a few months later. they're just a \"cover our ass\" thing to get rid of you. they already decided to drop you. this is your time to start interviewing while you still have a job",
            "\"in error\"\n\nDoesn't that mean they should have to pay him what was not, during the time he was put on notice \"in error\"? \n\nI'd have made them do all that, then once i had the money, i would have found a new job asap and quit, or just plain quit if i'd already been looking.",
            "Your company sucks",
            "Companies always talk a big game about wanting people to agitate to innovate, until people actually start doing it.",
            "Might be good for r/ antiwork",
            "I think I love Joe",
            "Joe is awesome",
            "This made my day !",
            "Fucking brilliant. THIS is a perfect story for this sub",
            "He should quit.",
            "I would have quit after I got what I wanted. No way a company fucks me that hard and refuses to buy me dinner like that.",
            "Wow.  He got a month vacation AND his raise and his bonus?!?  My HERO!!!!",
            "I would have made them all sign the paperwork, accepted the raise, and then written a nice long letter to HR about the management practices and you only went through the entire thing so the manager had to formally acknowledge that she made a critical mistake that cost the company a whole shit ton of money, and you're quitting because you don't see the company holding her accountable anytime soon or the situation improving.",
            "I’m ready for a bullshit job after working really hard, how do I find a job where I can get everything done in three hours?!?",
            "Joe is my hero.",
            "What beautiful MC!",
            "Joe is a legend!",
            "Joe knows",
            "Joe’s a legend.",
            "This is beautiful",
            "Joe is the man!",
            "Was Joe getting paid during that month?",
            "This is freaking brilliant!!",
            "What would have happen if joe just refused to sign to get 4 month of vactaction? Could they fire him based on that?",
            "I'll just say it, Praise be Joe!",
            "Oh fucking hell that’s perfection",
            "Joe had 4 months left right? Why didn't he just take like 3 months off and then sign a few days before the 4th month? Legally he'd be in the right still.",
            "Beautiful malicious compliance.",
            "Joe should have forced a apology and Samantha to be reprimanded, along with delaying 2 months. Fuck companies and managers like this one.",
            "Joe should have stated that, in addition to raise and bonus, conditions of him returning to work as normal must include Samantha being fired and blackballed from the industry.",
            "[removed]",
            "That is outstanding! Hat's off to Joe",
            "Imagine having such a rigid corporate structure and procedure that you can’t get a guy to work from home during a pandemic.",
            "Joe should’ve taken his bonus then quit. Fuck Samantha.",
            "Starting my day off with a justice boner 😎",
            "That is an amazing amount of inflexibility from a company mid-pandemic. I'm sure a lot of the normal rules around working from home had to be ignored for everyone to start working from home full time, but this one rule, nope, we can't bend or break it. Because reasons.",
            "And there you have why office jobs should be doing 4 days week work at *maybe* 6-7hrs a day...",
            ">it's easy. like a stereotypical corporate job, a concerted effort of maybe 3 hours a day is enough to do your job. most people screw around, chit chat and milk the day; some people go even further and milk the work so much that they \"need help\" with their workload. we have a coworker who would literally watch netflix all day. management either never figured it out, or didn't care\n\nWell shit, why did I ever bother learning anything useful in college? I need to get me one of these jobs but now I'm completely overqualified.",
            "Samantha sounds like a bitch.",
            "It would have been good fun if, if processing the paperwork that Joe was improperly put on Probation, and that Bad Probation was then extended 6 months, that the bi....lady that but him on probation earned herself a review that ended up putting HER on probation.",
            ">he won't sign until them give him his bonus and raise...which they do. the whole thing took a month...a month of joe basically on a free vacation lol\n\nJoe is awesome!",
            "Sounds like BS to me. Why get him to sign? HR would tell Samantha to fire him right away, almost every company freaked out and went on a firing spree at the start of COVID and the market crash.",
            ">No learning new things\n\nWtf does that even mean",
            "This… is lovely.",
            "And... now we know... and knowing is half of the battle.\nGo Joe!!!",
            "If he's hourly pay that was no vacation. It was unemployment. \n\nQuestion is, if true, did he actually get paid during that month? And how in the world can his Samantha take that long to \"notice\" he isn't working?? Thats a really, REALLY badly run company if true!",
            "It's ok to reread your post and fix the typos. Great story too!",
            "Same people who think it's a new pokemon!",
            "\"brind you a thin client\"\n\nWhat?",
            "Where do you work that is as dystopian as this?",
            "Ok, for non Americans, what on Earth is WFH and OT??",
            "This isn't the US right? No way a company there wouldn't just fire him. At will and all that",
            "Because then it wouldn't be difficult.",
            "K",
            "[deleted]",
            "[removed]",
            "I love Joe.",
            "One of the juiciest MCs I've read it a while. Joe is brilliant!",
            "Good for Joe!",
            "GO JOE!",
            "Oh my god that is amazing!",
            "Legend",
            "How can things like this happen? Her name is Karen",
            "A Real American Hero",
            "Wouldve been fun to hold out for a formal reprimand in Samantha's file for making this \"error\".",
            "Joe fucks",
            "Thats actually fucking fantastic",
            "Hey Joe, wherever you are, you're awesome buddy! Now thanks to your also awesome coworker, you have a reddit fan. Woo-hoo! Joe's here to stay!",
            "Screw you samantha!",
            "who is this Joe?",
            "Hahaha. This is brilliant 👏 👏👏.",
            "I hope Joe finds a new boss/company.",
            "How is not the Hero we deserve, but is the one we need.",
            "I love this.",
            "I love Joe. He's now my hero.",
            "Way to go, Joe!  Always wanted to say that in real life.  grin",
            "This sounds like a plot part from the Stanley parable. 😂",
            "Be like Joe.",
            "Joe is a saint",
            "Beautiful",
            "Joe's great",
            "You mean you're on a performance notice of a public health employee? In the US?",
            "I'm surprised they didn't just fire him - guess they needed people",
            "I want Joes job",
            "More people should be like Joe.",
            "I didn't know I needed to be reminded that this is a thing.",
            "Joe is my hero for the day. Goddamn. What a Chad.",
            "This is one of the most genius things I have ever heard 😂",
            "Leaving this so I can come back and read",
            "These stories always sound like old Disney movies with unambiguous villains and heroes",
            "Be like Joe....",
            "I feel this is ironic because I went through similar situation as Joe, but no bonus.",
            "Joe might be God Himself.",
            "A lot of people have a bad record of being able to work at home, in a high stress environment. It doesn't take much to get people to quit.",
            "Good job, joe!",
            "I love Joe",
            "Is Joe really living the dream - or should Joe not be an example of a normal life? \n\nAsking for a friend also named Joe.",
            "I can't believe companies are like this. I'm a software engineer. I'd walk out immediately and find a new job within a week. What kind of profession is this? Just curious because this wouldn't fly in my field.",
            "I like Joe. I hope Joe is happy and doing okay.",
            "You can easily make 6 figures and work 5 hours a week including meetings.",
            "You work for Ghestapo?",
            "I'm glad I've never worked for a company that had such strict internal rules, I don't think I would handle it well.",
            "\"It takes a village to raise a baby...",
            "As a young IT tech, I am forced to work from home and I have literally zero contact with people. And I have zero experience in any of these roles\n\nA week at my job would probably last I at least a decade if I was still a full time employee\n\nThat's just the last two weeks of my job, I imagine that I'm getting more and more frustrated.",
            "Cheers, Joe. Well played mate",
            "I drive a prawn trawler. My life is remote.",
            "Cause you know, if you're sick you're sick.",
            "Good on Joe for holding out for his bonus and raise too ☺️",
            "Joe just chillin on company time. Be like Joe.",
            "Joe is my new hero.",
            "Ahh, “It’s no moon…",
            "Hmmmmmmmmmmm\n\nJoe……..\n\nYeah……..",
            "this is incredible",
            "Your job sounds cushy af you hiring?",
            "Sounds like one of David Graebers bullshit jobs",
            "Odd that a performance notice either needs to be rescinded or the tenure completed instead of being able to term early with approval due to \"meeting or exceeding requirements.\"",
            "Joe is my new hero!",
            "I would have demanded HR get a letter from Samantha apologizing for the screwup and failing to properly administer punishments to her employees, then make sure they put that in her file so her manager has ammunition.",
            "Are you all hiring? Education is not the place to be at the moment.",
            "That was pretty awesome, but Joe is an amateur.  Check out this [Spanish civil servant](https://www.bbc.com/news/world-europe-35557725)."
        ]
    },
    {
        "post_id": "l4rta9",
        "author": "Wfry84",
        "title": "Need me to adhere to the dress code RIGHT NOW? Enjoy the fall out.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/l4rta9/need_me_to_adhere_to_the_dress_code_right_now/",
        "score": 20627,
        "num_comments": 732,
        "created_utc": 1611593396.0,
        "selftext": "I was reminded of this story from my work by one of my coworkers. It's been maybe 5-7 years since this happened.\n\nWhere I work there is a semi-strict dress code that needs to be adhered to so we look presentable when going to customers houses. The minor details are more or less negotiable depending on who's our manager that day. We have a normal manager we see almost daily, but if he's off or it's a weekend someone else subs in.\n\nThe day this happened was a Saturday and our regular manager was off so the duty manager for the day happened to be \"Mr. Hardass\" whom no one liked and he made it his life goal to make all the techs miserable. When we walked in the door we had to pass through the managers office to get to our meeting area. \n\nMy coworker Tim (name changed) walked in the door that was to the managers office with everything looking right on his uniform but his shirt untucked. The following conversation took place:\n\nMr. Hardass: your shirt should be tucked in.\n\nTim: absolutely, and I will do that when I set my gear down and go to the bathroom\n\nMr. Hardass: No, you need to show up for work ready to work. Not show up and get ready on \"my time\"\n\nTim: ok, let me set my stuff down and I'll go right to the bathroom and tuck it in for you.\n\nMr. Hardass: NO. You're going to tuck it in RIGHT NOW before you walk another step into MY building. \n\nTim: Right now?\n\nMr. Hardass: RIGHT NOW!\n\nSo, my coworker did as instructed, un-buttoned his pants and pulled them all the way down to his ankles and proceeded to smooth out his shirt and then reach all the way down and pull his pants all the way back up and re-buttoned them. \n\nFrom there he immediately walked outside and called the HR hotline and told them his manager on duty just forced him to undo his pants and semi-strip in front of him in his personal office and wouldn't allow him to go to the bathroom to tuck his shirt in. That he felt weird and uncomfortable to be around Mr. Hardass and didn't know if he had any ulterior motives.\n\nNone of us are privy to what exactly happened from that phone call on, but we do know that he got \"laterally moved\" from being a tech manager to the safety team where he was no longer in charge of any subordinates.\n\n\n\n\n\n***I'll make an edit to iron out some details or important things I forgot:\n\nOur job is very much union based and as such the union book is the law of the land so language and actions have to be very specific as to not draw ire from the union nor the business. \"Tim\" was raised in a union household by someone who was VERY involved in their union so he has a very keen knowledge on how to manipulate things well within the trappings of the union handbook. \n\nHe did this whole thing not next to the bosses desk but within line of sight of the door coming in and the door to the meeting room so there were visual witnesses from the meeting room and people who trickled into work behind him who literally walked through the entire ordeal. So, there were plenty of witnesses to corroborate.",
        "permalink": "/r/MaliciousCompliance/comments/l4rta9/need_me_to_adhere_to_the_dress_code_right_now/",
        "comments": [
            "~~Removed. Please edit to remove acronyms used as names then respond to this to let me know you've completed it.~~",
            "I had a manager do something like that, except it was because I had a little stubble on my face (my facial hair grows really fast) and he demanded that I take a disposable razor to the bathroom and shave before leaving the office.  \n\nI didn't look like a hobo, I just have dark facial hair that never really looks \"clean shaven\".  I clarified that he wanted me to go in the bathroom, that had no hot water (at all), with no shaving cream, and shave with a disposable razor.  \n\nHe confirmed that this was what he wanted, and I told him that wasn't going to happen, I wasn't going to slice my face up because he was having a bad day.  He backed down, he was normally pretty chill so I chalked it up to him being on the warpath for something unrelated to my  face.",
            "What was MH's reaction while the guy maliciously complied?",
            "I once had a boss that thought my pants weren't up high enough but I was too busy to step away to fix them. So he came over and undid my belt, moved my pants higher on my waist, tucked my shirt in to my pants (putting his hand in to my pants), then re-buckled my belt. I am female and was 16 at the time.",
            "I love this guy for using the reporting hotline immediately after the fact. Wish i could have heard the dick manager's excuse to keep his job (pathetic begging im sure)",
            "That's awesome, for real he should've let Tim go to the fucking bathroom.",
            "I got sent home to change on my 3rd day of work at a carwash once because I wore blue slacks instead of tan ones. It was sunny and took me 3 hours round-trip to bus home and back. When I got back the manager who sent me home was pissed off but I was never told I could only wear tan slacks until I showed up in not tan.",
            "Had a manager who told me a story about working in a union.\n\nSo they are getting ready to leave Friday evening and their manage comes storming in complaining that so and so room didn't get painted.  They tried to argue it was Friday evening but the manager said they were not to leave before the entire room was painted.  They started as soon as the manager left the room,  they started by painting the windows.",
            "So in school we had to wear a uniform. Part of that uniform was to keep the shirt tucked in. I lost a lot of weight and went from a UK size 14/16 to a 10, but my mum refused to buy me new trousers and there were no belt loops. My PE skirt literally slipped off if I didn't wedge the band into my shorts. \n\nOne day a teacher was on the warpath and forced me to tuck my shirt in properly. I would tuck it in, but leave a good chunk of material hanging out so people couldn't see down my pants. It looked messy but it was still tucked. Well he made me do it properly. When I was done you could see down the front of my pants easily. I was 13. He very quickly looked away told me to untuck my shirt and to buy new pants. I told him to go tell my mum that because she was refusing. I kept those trousers through most of school, I was a very skinny kid, like my abs were showing skinny, wearing massively oversized clothes. I looked ridiculous and was called fat a lot, nope, not fat, just have big clothes. Teachers did stop asking me to tuck my shirt in properly though. Showing it was tucked in but hiding the massive amount of material around my middle seemed to do the trick.",
            "My ex husband did this once when we were teenagers except there was no HR department to call, and we were leaving work and apparently weren't allowed to walk to the parking lot with shirts untucked. He said he'd do it when he got outside, manager said \"no, do it now,\" so he dropped trou with a smug grin and smoothed his shirt out and tucked. Manager let out a feeble \"you better watch it buddy\" then never harassed him over uniform again.",
            "Jeez. Send him to the bathroom and write him up if you're that anal about employees being ready for work when they arrive.",
            "The only thing better would be is if T was one to go commando. Thing definitely would have fallen out then.",
            "I was once written up for a breach of the dress code for coming out of the bathroom with my skirt tucked unintentionally into my panties. This was like 6th grade, so the instructor often made me feel like I had deliberately worn my skirt that way, on top of the humiliation of getting my panties out, instead of nicely asking me about it.",
            "Dress code.   They decided we weren’t allow to wear blue jeans.   So I bought a bunch different colored Wranglers in grey, sage and white.   They weren’t blue.",
            "I had a TSA Agent ask for my dads belt. He’s in his 70’s, walks with 2 canes, and is overweight. He refused saying he needed it - but eventually they threatened kicking him off the flight - so he removed his belt and his pants promptly fell. Big ole tighty whities - and not new ones either. These were the “I packed all of the good ones” pair.\n\nYeesh",
            "[deleted]",
            "I have a similar story.  When I was a teenager I worked for a local grocery store that required you to wear black pants under your smock.  Being a teenager with little money, the only pair of black pants I owned was a pair my grandmother bought me when I first got the job, and I had not yet gotten around to buying a second pair.  At some point during one of my shifts, the front end manager made me get off my register and clean something up, either it was a spill of bleach or she made me use bleach as the cleaner, I cant remember which it was at this point.  Well, during the cleaning process, I got bleach on my pants.  I think it spilled on the floor and I knelt on it to clean it up and didn't realize it was bleach until after it began to stain my black pants.  I figured, oh well, I'll finish out my shift and ask my mom to take me pants shopping that night and borrow some money for it from her, since I didnt have enough in my account for it.  Well, I get back to my register, and the same manager who asked me to clean the spill walked past, and said that my pants were \"unacceptable\" and I needed to \"go home and not come back unless I have a professional looking pair of pants.\"  So go home I did.  And I did not come to my next shift, as instead of opting to borrow money from my mom, I decided to wait until I got paid again to get a new pair of pants.  The store manager called me when I missed my shift and asked me why I hadn't come in.  I told him \"front end manager asked me not to come back until I have a pair of black pants.\"  He asked me to wait a moment and I guess went to ask her what happened, and when he came back to the phone he asked me if I could just come in for my shift in a pair of jeans.  I told him I'd come in if front end manager apologized, since she was the reason I got bleached in the first place.  He sighed and said okay, and I got a very reluctant apology out of her, and got to wear regular jeans for a few shifts until pay day.",
            "Way to go! That guy was just trying to be a jerk to make a point (and the point was, “I can humiliate you”) and he got his own medicine and more.",
            "Reminds me of that story where a girl got called in for having her bra strap showing so she took her bra off (through her shirt) in the hallway.",
            "[deleted]",
            "That type of manual labor causes shirts to go untucked all the time.  If the manager doesnt get that, he probably isnt aware of the job enough to manage it properly anyways",
            "Power move from Tim there.",
            "Sometimes there are consequences to being a dick.",
            "Tim is the untucker Mo-F-er.  He took one for the team",
            "Spectacular",
            "I really wanna know what HR thinks of this! Was it on camera for them!? Oh man I’d sue if it was, fuck em’.\n\nGotta be one of the best posts I’ve seen here in a while.",
            "I had a boss who mooned us one day, showing his underpants only, it was in response to some good-natured heckling, and none of us thought much of it at the time.  Months later, at a union/management meeting, one of our stewards who had a beef with this particular boss, bought it up, and after the meeting, the boss was called to the front office and immediately fired.  I felt kind of bad for him, he was a bit bi-polar but on most days he was pleasant towards us and advocated for us as well.  On his bad days though, he was a bit of a bitch.  He had been with the company for \\~ 15 years.",
            "oh I would love to be a fly on that wall",
            "Stories like this are why i subscribe to this sub.",
            "I think I love Tim",
            "Tim is one smart mother fucker, i aspire to have that much self aware",
            "Genuinely surprised that didn’t backfire, is this man someone who also pulls his pants down the entire way to use a urinal?",
            "why do you need to take your pants off to tuck in a shirt?",
            "Damn. Mr. Hardass played with fire and got rightfully burned. You don’t want to get on your friend’s bad side.",
            "This is fucking fantastic, completely epic malicious compliance here; everyone else go home.",
            "That’s epic!  We had a manager like that at McDonalds who made everyone tuck their shirts in. He told a guy to tuck in his work shirt but it was before the guys shift and he came in early to eat. They wouldn’t ring him up for his meal till he ticked in the shirt. So he clocked in, tucked in the shirt and got paid to eat. The manager never caught it till weeks end when he went over 40 hours and this happened every day that week.",
            "I like to do kind of the same thing when I go to the urinals in the restroom.  It’s fun to see people’s reactions when you pull your pants and underwear all the way down to the floor, stick out your belly like a little kid and proceed to take a whiz.",
            "This almost exact thing happened ata plumbing company I worked for around the same time frame you are talking about. Was this on the west coast in a corporate plumbing company?",
            "CWA doesn’t mess around when it comes to getting managers in trouble.",
            "That is awesome",
            "Love this.",
            "This is so perfect, I cackled when Tim so devastatingly turned the tables on Hardass.",
            "Fucking beautiful!",
            "Play stupid game win stupid prize. Thx for the giggle.",
            "Beautiful.",
            "This is epic.",
            "Nice move, but who the hell needs to drop their trousers to tuck in a shirt?",
            "This sounds like AT&T, particularly in Louisville.",
            "Good one!",
            "This made me laugh so hard 🤣😂",
            "The lost union handbook.. so powerful",
            "Tim(name changed) is a hero!!",
            "I had jeans rip at the seam in high school up to around my knee. Bitch teacher was like you gotta fix that now or go to the office... “that’s so inappropriate (I’m male and that’s ridiculous for an actual rip of the clothes that fits the dress code guidelines for shorts)I went to her desk and took a roll of duck tape off and started wrapping it around. She still (understandably) sent me to the offfice but the vp (understandably) laughed and told be I could do whatever in the office until next period",
            "I was working at IBM and one of the managers undid his pants on a crowded elevator to tuck in his shirt. He was just a clueless slob of a man with no social graces. People on the elevator were too shocked to know how to react. This was 50 years ago.",
            "So fucking awesome",
            "Wow that is amazing",
            "Beautifully done",
            "Glorious",
            "Honestly, this was one of the best I've read. Excellent.",
            "Hahaha thank you this was awesome",
            "So...told to tuck in shirt, then as 'gotcha' claims sexual harassment by manager.\n\n&#x200B;\n\n......",
            "The specifics of the uniform must make it impossible to tuck your shirt in without taking off your pants, I assume?",
            "The manager should have called HR first and reported the employee removing his pants in his office when he could just tuck his shirt in like a normal person. There were plenty of witnesses.",
            ">takes his pants off to tuck in his shirt\n\nTim's the kind of guy who gets naked at the urinal, isn't he?\n\nSeriously though, Tim needs to be fired for revealing himself like that. He was asked to tuck his shirt in, not flash half the office. Completely bizarre.",
            "Always love the edits where OP smooths out all the obvious plotholes in the story by just slapping every \"unless x happened\" comment into the edit."
        ]
    },
    {
        "post_id": "msbe18",
        "author": "revilo636",
        "title": "Yes, I want a coffee without any coffee.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/msbe18/yes_i_want_a_coffee_without_any_coffee/",
        "score": 20613,
        "num_comments": 822,
        "created_utc": 1618603815.0,
        "selftext": "Been saving this story for a while now, just thought I'd share something light and funny to start the weekend off.\nThe usual warnings; long time reader, first post, mobile etc.\n\nYears ago I worked for the big Canadian coffee and donut shop, mostly working the evening shift. \nIf you aren't familair with Canadian brand coffee shop, the cream and sugar are dispensed by a machine that is calibrated to ab amount determined by corporate. If you are used to ordering at the fancy green place, or the running donut place, the number of sugar and creams you order may need to change depending on how much you actually want.\n\nOne night, we had these 3 bikers drive in, and you could tell they had been on the road for a while. \nTheir ringleader was your stereotypical biker; tall, wide shoulders, big beard, covered in leather. \nHis friends were were shorter but otherwise still had the whole tough but tired look going on.\n\nMy coworker was in the back working soup and sandwich, but Its only three people and it's been a slow night. No worries. Just need to get these tired boys some caffiene and wish them a good night. \n\n\nRingleader: I want an extra large 12 and 12. \n\nMe: Are you sur...\n\nRingleader: Did I stutter?\n\nMe: Okay but that's only...\n\nFriend 1: Did he stutter!?\n\nNo. No he did not... So off I went to make him exactly what he asked for. Grabbed a cup and put it under the sugar dispenser while I pressed the times3 button 4 times. 12  XL shots of sugar.\nThen I went over to the cream dispenser and did the same thing.\nNow, fun fact. The cream and sugars are measured to dispense 1/12 of the cup size you are selecting.\nSo by the time all 12 shots of creamer were dispensed, the cup was basically full.\n\nI stirred the creamy sugar mixture around before I poured an itty bitty splash of coffee in his cup, just enough to bring it up to the saftey line on the cup.\nI tried asking him if he wanted me to heat it up or anything, but I basically got the same exact run around from him and his friend.\n\nObviously the guy knew what he wanted and he didnt need me to tell him what he was ordering.\nThey grabbed the rest of their order and drove out into the night.\n\nNow, you would think that was the end of the story. The big angry biker man got his nasty sugar cream drink and left me sitting there wondering if the rest of the world had been drinking their coffee wrong this entire time.\nBut no, I was lucky to be working the next afternoon when he came back in! Mr. Ringleader came back in all by himself the next day and shuffled up to the counter.\nI could tell he must have been embarrassed because his voice was a lot softer this time, he knew he fucked up.\n\nThe glorious aftermath is that he apologized and confirmed that the drink had been utterly disgusting.\nTurns out he was used to ordering from the fancy green  coffee place and they use way smaller measurements for their creame and sugur.\nOnce I knew where he was used to ordering from I made him the approximately same drink using our measurements (roughly a triple triple) and sent him on his way.\n\nI only wish I could have seen his face when he took that first sip.\n\n\nTLDR: Mean man offers a cup full of creame and sugur, tastes disgusting.",
        "permalink": "/r/MaliciousCompliance/comments/msbe18/yes_i_want_a_coffee_without_any_coffee/",
        "comments": [
            "At least he came back and apologized, don't see that often.\n\nOkay guys ngl, when I originally made the comment I was busy to satisfy my ADHD and skimmed through the story so I missed the canada part. But secondly I've also never really associated outside of my state, and I kinda wanna know what canada is like now.",
            "You could tell he was the big man in charge because he knew how to own up to his screw ups.  You did the right thing, warn once, warn twice, take the damn money and be off with them.",
            "In Canada, even the BIKERS are too polite to send food back?",
            "Bikers like respect.  These guys forgot to give some back.",
            "Good rule of thumb: If a customer service person asks for confirmation, they aren't saying 'You're wrong'; they're usually saying 'There's a slim chance you want what your mouth is saying, and would probably prefer this, which is likely what you actually want.'\n\nSadly, few people consider customer service workers to be people, and therefor think you exist solely for their convenience. Those moments where you get to watch someone fuck up when they insisted they knew better... satisfaction.",
            "My workplace makes a traditional macchiato. A single shot of espresso with about a spoonful of foam on the top. Almost all the people expect a Starbucks drink and will order something like an “iced coconut soy macchiato” which leads to me confirming with them multiple times that they understand what the drink is. Most of the time they brush off my explanation with a “yeah uhuh I know” and then when I hand them the smallest paper cup ever they freak out because they expected a large drink.\n\nEdit: I mean VENTI drink",
            "Not as severe, but i used to work a certain donut shop where they encourage you to Dunk them, and i had someone come through the drive-through and order the same thing: extra large hot coffee, 12 and 12. Luckily at this establishment this filled about 4/5ths of the cup, and they did not come in to correct",
            "The strangest drink I've ever seen someone order was this: 20 shots of espresso iced in the biggest cold cup. (At the green place of many mothers.) \n\n He paid for it. They made it. He walked out happily sipping on it.  All the customers and employees who saw this were just kind of staring at each other afterwards going '....damn.'",
            "I compliment him on admitting his mistake. That's tough to do and few manage it.",
            "I am at a loss as to what that order could possibly mean at Starbucks. Are they just very different in Canada? \n\nYou can get pumps of syrup but that would still be just as gross as his order with you.",
            "Many years ago when I was making minimum wage, I would ask for coffee, extra extra extra extra cream, hold the coffee. And I would get 12oz of cream for $1.68, which is a very good price. \nAfter a while, the batista caught on, so I had to go to the Wawa and pour it myself instead.",
            "Michael Scott would call this delicious compliance",
            "Double double already tastes like cream syrup. How does anyone enjoy a triple triple...",
            "Similar thing happened when I worked at a coffee shop. Woman comes in and asks for a 16 oz coffee, 12 and 12. I'm a little stunned but know not to outright question customers at this point so I just send it through and make it. I literally splashed a tablespoon worth of coffee in a bunch of cream and sugar.\n\nI ask her to try it to make sure I made it to her liking. I really thought she was gonna gag. Nope, she made the most happy face and says \"mmm it's perfect!\"\n\nShe came back multiple times to get the same drink from me. But one time my boss was manning the register when she came through. My boss asked \"Are you sure you want that? That's going to be an entire cup of cream.\" This lady SCREAMS at my boss for judging her and says she needs better training.\n\nNext day she comes back and starts complaining to me about this \"rude new employee.\" Funniest shit. Still can't believe she drank that.",
            "Brit piping up here. I have no idea what all these numbers are for.",
            "Damn decent of him to apologize.",
            "Canada - the only place where you can order an XL triple triple and nobody bats an eye lol.",
            "Omg reminds me of one time I asked for a XL with 6 creams in it. I normally take 3 but I really don’t order often at Tim’s and the last time I did I think someone messed up a bit because it clearly wasn’t 3 normal creams. So here I go, thinking they are *not* proportional after all. Halfway through pouring the creams she stops and shows me the inside of the cup with the cream in it and we both start laughing. She puts half of it in an Iced Capp cup to be used later and I got my perfect coffee :)",
            "Ha! Ya tried to warn them. If this were my mate I’d raz him over it for weeks",
            "Pro-tip for situations where someone is asking you to mess things up: agree first, *then* ask questions. It avoids the appearance of arguing, while still giving them an out, and covering your butt. It's most applicable in a boss/underling scenario, but works in customer service, too.  \n\nIn this case, I'd have said something like \"Sure thing, man. Just to be clear, that's gonna be literally a cup full of cream and sugar, with room for maybe a splash of coffee. Is that what you want?\"",
            "This story immediately reminded me of the office.\n\n1) *Did I stutter?* -Stanley\n\n2) Michael in the van with his cream and sugar coffee ... Sans coffee. Pam was not impressed",
            "I had coffee without coffee a few weeks ago. Woke up a few weeks ago at my usual 4.45am for work. Washed, dressed and stumbled downstairs. I stuck my travel cup under the machine, put my soya into the warmer frother and got distracted by the garden security light going on. \n\nPicked up my coffee cup, poured in the soya milk, threw in a sweetener and secured the lid. Then set off on my 35 mile drive to work. \n\nI don’t usually drink the coffee until I’m at my workplace, but the cup keeps it fresh as just made. Sat at my desk, popped the lid and took a big slurp of hot sweet soya milk. \n\nI had forgotten to turn on the coffee machine. \n\nFeck!",
            "I’m impressed you were able to get all the sugar to dissolve! I also worked at the Canadian coffee and donut shop and had a woman come through the drive thru three times in one shift, each time ordering a large coffee with 10 sugars. Took me a solid few minutes to get the sugar to actually dissolve....",
            "Good to see he had the integrity to apologise. It's been my observation that the vast majority of bikers are honest people at heart. They speak their mind, and unless you've crossed them somehow, you usually won't have any trouble.\n\nYears ago, I worked at a roadhouse on a busy highway. The sight of some 20 Harleys pulling up at once might have made some nervous, but not me. Once a year said bikers made the ride from Perth, capital of Western Australia to Carnarvon, about 1000 km away (about 600 miles) to a biker's event known as the Sandhurst Run.I never had any trouble with them. They paid for their fuel, got something to eat, and I'd say, \"the pub's next door, the general store is that way. Watch out for the cops in Geraldton and Dongara, and Gingin on the way home.\"",
            "Cream and sugar!.... Wait is this just cream and sugar?!",
            "I have a story like that where someone couldn’t be talked out of doing something stupid. My parents are Mexican immigrants and when they first came to the US my dad’s coworker would hook him up with sandwiches. He particularly enjoyed the ones with jelly and some weird tan colored stuff that my dad was too embarrassed to ask about. My dad could only surmise that they must be mustard and jelly sandwiches, so he asked my mom to pack one in his lunch. She tried to tell him that was a terrible combo, but he didn’t listen. Lunch wasn’t too great the next day. He grew up on a ranch in 1960s rural Mexico. Peanut butter wasn’t a thing for him until much later in life.",
            "Kudos to him for returning and admitting his mistake.",
            "It took me a while to understand that those bikers were leather-and-metal motorcyclists, not normal people with huge packpacks having a long-range bycicle trip.",
            "I have asked for a large coffee and hold the coffee.  What I really wanted was a large insulated  cup to put chicken soup into.  Trying to drive with a bowl and spoon is not wise.  Now sipping said chicken soup out of a cup now that is more workable.   Also keeps the soup warmer longer since I can put a lid on it.   The person behind the counter was highly confused but once I explained it they were more....ok.....that will be $2.98.  Cups cost money and I did not expect something for free.   Had soup that day on my long drive home.",
            "\"say tim hortons without saying tim hortons\"",
            "Why do so many people on here write silly little riddles rather than just saying the name of the business?",
            "Same sort of thing happened to my friend who worked at Canadian McDonald's lol. American came through and I guess they do their coffee differently because he asked for 9 cream.",
            "Even at the green coffee shop 12 sugars and 12 creams is excessive.",
            "[deleted]",
            "I mean we all have those just don’t argue with me too tired to listen moments, but the humility to go back specifically to apologize is commendable",
            "TIL that I like my former-hockey-player-branded-coffee like big burly biker dudes do? :D",
            "THAT'S why everyone raves about the double double!",
            "I learned to listen in many places including fast food but have something that this reminds me of. The person who won't listen to anyone. Dad was pastor of a church we were building on a new sanctuary and there were several people standing around the plans including the architect and the contractor. They are on the phone with the Sauder company. Some of you may have built do it yourself kits for furniture from them but they started as a church pew manufacturing.\n\nThis sanctuary was 4 sides of an octagon at the back so instead of just an isle up the middle and sides there were two more isles. Now there was as lot of commotion going on but the constitution head gave final measurements to the Sauder person who then said. Are you positive ..... And tried to say more when the head barked out I know what I'm doing. Well about that point my father walked up. No something else you need to know my father's undergrad was in mechanical engineering from Rutgers.\n\nThe Janitor had been standing there and he looked that construction head in the eye then looked at my dad and said Pastor they have just given the back of the sanctuary measurement to the pew guys as the front measurement. And won't listen to the pew guys tell em their wrong. (Now in this shape if you start with that long measurement 1st , at the front there will be no isles. As the whole building narrows from back to front)\n\nThe head turns red and say who the f... Black are you janitor .... Oh sorry Pastor. Dad says to Sauder person what measurement do you just get. The fellow tries to be polite but the architect writes it down and hands it to my dad.   It of course was wrong. We did end up hiring another contractor. And had the janitor over to dinner. And I think they dedicated an isle to him.\n\nI have learned and been many many times blessed including by wealth, by listening to whomever I'm around that wants to share something. And I never have gotten that terrible cup of well.... Not coffee.",
            "A friend of mine in high school always ordered a small triple triple.\n\nWouldn’t believe us when we told him it was less than half coffee.\n\nOne night we had them make it without the coffee just to show him what he was drinking.\n\nDidn’t change anything tho.",
            "I worked at same coffee place. Lady came in and wanted 6 and 6. Then bitched at me because it was cold. Like ma’am what do you expect when its half cream?",
            "No offence but a cup of cream and sugar sounds delicious. EXTREMELY unhealthy, but delicious. Did he not have to pay extra for it? The cream and sugar amount would have to have out costed the drink price, no?",
            "This reminds me of when I was a barista many years ago and I had a customer order a \"latte, no coffee.\" I thought I'd heard it wrong and they must've said \"latte coffee\". Made it, off they went, came back less than 5 minutes later explaining their anger at being given a latte because they are allergic to caffeine.\n\nShe didn't ask for decaff, nor did she ask for just hot milk (which is less than half the price), nor did she say she was allergic to caffeine (from which we'd have been much more careful). Sticks in my mind as bizarre.",
            "I would like to bless OP for excellent paragraph sizing",
            "A triple triple is still a disgustingly sweet drink for those not familiar.",
            "the problem with this is, if the fancy \"green place\" is Starbucks, you don't order 12x12 or request your coffee with sugar or cream, they simply ask if you'd like \"room\" so you can add it yourself. The \"12x12\" thing seems to only be a Tim Horton's thing where you would order a \"double/double\" or \"triple triple\". Why would the big biker guy go to SBUX and order like a Tim's? doesn't line up.",
            "Do you use real cream? Could I order a 16 or 24oz cup of cream for only a couple bucks (cheaper than same amount of cream at a grocery store)?",
            "After reading the comments I think all coffee shops should have a picture chart showing how much milk/ espresso for each type of coffee. That way they can visually see and and there would be no debate. Along time ago I worked at a shop and I had a few customers order an espresso. I would give it to them in the tiny cups and the would look at me like wtf is this. After a while I realized these were new coffee drinkers and wanted to try what everyone else is trying. But in my head at the time I didn't understand why someone would order something they didn't know about. But a picture chart would have definitely helped.",
            "This is like ordering the [domino pepeloni without the pepeloni](https://www.youtube.com/watch?v=Brx3TikoO_s)",
            "1/12 of the cup in sugar is the standard? is there a smaller option, or is that the minimum the machine can handle?\n\nSounds like it was in diabetes country after all...",
            ">\tcup full of cream and sugar \n\n>\ttastes disgusting \n\n...?\n\n>\tnot America \n\nAh, right.",
            "The Wayne gretzky is bad enough",
            "Love the happy ending",
            "[Hold the chicken](https://www.youtube.com/watch?v=hdIXrF34Bz0)",
            "\"No problem sir. Would you like some pancakes with that?\"",
            "Points for dude for coming back to apologize. You almost never see remorse like that in customer service",
            "If someone tells me to shut up, I don’t shut up.",
            "My wife can drink that.\n\nI'm starting to suspect that she believes \"half and half\" are the instructions.",
            "That's clearly a man who doesn't like the taste of coffee. I always thought double double's are disgusting and completely cover the taste of coffee. But TH coffee is kinda gross, so I can understand it, but triple triple? Uhg, that kinda grosses me out.",
            "now I know how to buy cream cheap!! you should cross post to /frugal",
            "🎶__I like my sugar with__^coffee __and cream__🎶",
            "This reminds me of the “running donut place” that’s by my house where I go occasionally. Every time Ill order an iced mocha latte they ask me if I want cream and sugar in it?!?!?! Is that an accidental habit?!?! Is it a corporate policy?!?! It’s a latte..... it should be like mostly milk, and chocolate syrup...... so no I would not like more cream and sugar in it. \n\nExcept one time I said no and they just gave me an iced coffee with the mocha in it? Does not compute.",
            "Hi I’m not American and I’ve always wondered what Americans mean by creamer. Is it just milk? Or like, UHT milk? Or is it actually cream.",
            "Customer: Did I stutter?\n\n\nRep: Im sorry, sir. The speaker cut out. What did you say?",
            "Good ol Jim Thorton's",
            "I'm honestly not trying to gatekeep coffee here, but I feel that if you're going to act all badass and macho you should probably fulfill the stereotype by ordering it as close to black as possible.",
            "I worked at both those coffee chains and I’m dying at you asking to heat it up. Even an xl 3 and 3 is soooo much cream. \n\nThanks for the laugh!",
            "So Canadian!, actually went back to apologize",
            "Now that's a man who've admit he's wrong and apologized for it.",
            "I also used to work there (what Canadian didn’t?) and back in the day they had an XS cup, which was about the size of a Dixie cup at the water cooler. An elderly woman would come in every single night in her Buick le sabre and order an XS with 16 sugars.....she loved it, and came back every night around 8pm for it. Must have been working cause I could have sworn she was in her 90s and still crushing life.",
            "Huh... i worked at the fancy green place for 6 years and, at least in the region i worked in, \"12 creams\" ment nothing since we had it in regular half gallon jugs. However, explaining that was always a lost cause so usually you'd just add 12 sugar packets and whatever amount of half and half that you felt was a good representation of \"12\", so probably half the cup.",
            "Bikers are usually more polite. Most aren't in illegal gangs, they just want a group to hang out with. So yeah can easily see a biker coming in to apologise. A white, neat, older person though...",
            "I had a regular customer that ordered an XL 8 and 8. Not much room left after that. His teeth were in pretty bad shape.",
            "I was a Timmy Ho. Most disgusting drink I ever made? A small 4x4.",
            "He likes a little coffee with his cream.",
            "My brother always orders 12 sugars in his coffee... most of the time the barista comes over to double check, but that's how he likes it. \nYou can almost stand the spoon up in it...I call it a cup of diabetes!",
            "As someone who works at the fancy green place, I would have interpreted 12 x 12 differently. Usually that would probably mean 12 shots of espresso and 12 pumps of white mocha (Based on a drink that usually gets ordered called a 4x4)",
            "Yeah, bikers may be a bit rough around the edges. But most are decent people who are willing to admit it if they make a mistake.",
            "This story reminds me of that Zits comic strip where Jeremy (the teen) loads up his cup with lots of sugar and milk before dripping two drops of coffee into the cup. He called it a cup of Joe, but his father, who witnessed the whole thing, called it Josephine.",
            ">The usual warnings; long time reader, first post, mobile etc.\n\nStop doing this. Who told you to do this? Stop it.",
            "😂 I used to live in a small-ish hippie town where the various indie coffee shops competed with the *green* tent chain shop.  The indie shops offered tons of local flavors plus really good (artisinal) fresh baked goods, so the competition was definitely not imbalance.  Problem was, this town was also rather touristy.  \n\n\nWhile the locals knew not to use *that other shop*'s lingo and measurements when visiting the local indie shops, the tourists didn't.  It created enough aggravation that some of the indie shops ended up putting up signs that basically said, \"We don't do *bleep* (read: certain cup size) or *bleep* (read: certain cup size). If you want *bleep* (read: certain type of frozen coffee drink), you're welcome to go to *bleep* (read: the green tent chain shop).\"",
            "Well this makes a triple triple sound outrageous",
            "Lol for \"itty bitty\"!",
            "Funny thing, but Australia is insanely better at coffee than maybe anywhere else. The funny thing about it is that we've achieved that by basically assuming everyone else is better than us. \n\nGetting coffee from some sort of vending machine, at some sort of cafe, is unthinkable.",
            "Yeah, as you grow up, you realize that super sweet concoctions start to loose their sparkle.",
            "Idk, I’m one of those people that likes half coffee, half corn syrup chocolate bar coconut fudge yummy tummy International Delight cream. Only way I can take it.",
            "Lol!  In other shocking news, a Canadian apologizes!  Brilliant story OP.",
            "[deleted]",
            "\"wondering if the rest of the world had been drinking their coffee wrong this entire time. \"\n\nThis is wonderfully written. :)",
            "Yeah, worked at fancy green place. That's not at all how anyone would order coffee from us.",
            "What a wild fucking world we live in where people order a coffee with 12 shots on anything.",
            "Mmmm a gretzky. 9 and 9",
            "I would have a hard time not back talking if someone says “did I stutter?” What a douchey thing to say",
            "Back in high school, about 10th grade, when we were finally allowed off school campus, the hang out of choice was the Canadian coffee place. My friend and I (both females and fans of sugary things as most teenaged girls are) decided to see how many creams and sugars we could get in an XL while it still contained coffee. The answer is exactly 12 and 12. And I CAN confirm that even to a 16 year old girl cracked out on sugar that that drink was disgusting.\n\nThe idea of a huge biker dude legitimately drinking this had me in stitches.",
            "Wait are you calling Starbucks fancy?",
            "Big bad biker dude orders a 12 and 12 from the fancy green coffee place??? I get like a 4 and 4. same with the running donuts.12 and 12 at either of those sounds insane.",
            "Reminds of the kids I babysat who I found drinking the coffee creamer.",
            "A lot of customers don’t realize that the sugar and cream servings are also adjusted for each cup size and so they think they need to ask for larger servings of each when they order a larger size than usual.\n\nThey learn...",
            "Pam: You didn't happen to bring any coffee, did you, Michael?\n\n\nMichael: Milk and sugar.\n\n\nPam: Oh, awesome. You're a life saver. [drinks from cup] Wait, is this just milk and sugar?\n\n\nMichael: That's what I said.\n\n\nPam: Do you drink this every day?\n\n\nMichael: Every morning.",
            "Oddly wholesome ending—nice!",
            "Ive been Gretzky'ed from that coffee shop. \n\nI asked my buddy for a triple triple. \n\nHe had no idea did the math and brought me a 9x9. \n\nNot Ok.",
            "Similar thing happened to me when I was working for a Canadian airline. Guy in business class asks for a triple rum and Coke. I said “but sir”, and he countered with “I’ve had a bad day, please a triple”. Okeydokey. I free poured the rum to the top of the glass, then gave him a glass with ice and a can of Coke. I then explained that I pour my grandma’s measures so this isn’t quite a triple, but it’s as close as I can make it.",
            "Haha, this reminds me, one time an uncle of mine told me (oblivious) to order a Gretsky from that place. For those unaware, Gretsky's jersey number is 99, so that would be a 9 cream, and 9 sugar. I went ahead and did it, and I got a cold sugar cream slurry.",
            "I went to Canada a couple years ago, i never understood what a triple double or any of that stuff meant. Here in the UK they leave all the sugar out for you to deal with yourself, so I just drank my coffee black the whole time I was there. But those Timbits helped balance it out",
            "I was once in a line at what I assume to be the same Canadian Coffee shop and was behind a young guy in his early to mid twenties. He got up to the counter and ordered, and I'll never forget this, \"an Extra Large French Vanilla with 7 sugars\".\n\nThe French Vanilla is a premix of sugar and flavoring that hot water is added to. The reaction by the guy behind the counter was similar to the OP's. \"Seven sugars? French Vanilla...okay then.\"",
            "Reminds me of two things.\n\n\nJiffy Lube has weird coffee that everyone either loves or hates, no inbetween.  My coworkers hated it, but needed the caffeine, so they'd make what we called \"The Diabeetus Blend\" of waaaay too much sugar and French Vanilla. \n\n\nAlso, I used to drink half and half cups in diners when I was like ten.",
            "When he came back I expected hem to ask: \"You know what might look better on your nose?\"\n\n\"The bar!\"",
            "I'm into it, sometimes you want some ice cream, hold the ice",
            "I used to work at the running donut place. We had a regular come in every morning and order 2 large and 2 extra large 15x15. I have a feeling our machines dispensed the same amount because I would have room for MAYBE 2 oz. of coffee in the large cups. I think about this guy often.",
            "I loved working at the big Canadian coffee shop here in michigan. It's been my favorite food service job.",
            "Every biker I've met is like this.",
            "Have you ever had some one order a Wayne Gretzkey?",
            "Ok I think you just settled a years-long argument between my wife and I.\n\nThe question - if I order, say, a medium double-double or a large double-double...is the same amount of cream and sugar dispensed? Or is each shot a proportion of the cup size?",
            "Ah yes, I do love tim horton’s 😂",
            "Michael Scott?",
            "Mmmm Timmy’s compliance!",
            "I love the aftermath....\n>Once I knew where he was used to ordering from I made him the approximately same drink using our measurements (roughly a triple triple) and sent him on his way.",
            "I mean where I go I got 12 and 12 before just because the flavory part of it tasted good, and like diabetes in a cup too but worth it",
            "I worked there as my first job and we also had a psycho who ordered 12 and 12s except she was a regular. Very weird",
            "Time to start over then",
            "I mean I like coffee as much as the next guy and often drink it black, but somehow I think I would also just enjoy the hell out of a cup sweet half-and-half.",
            "My sister worked at this same coffee establishment and once had someone order something similar and without missing a beat asked them if they wanted coffee with that.",
            "TWELVE TWELVE?! Bro a triple triple of any size is already too sweet for me",
            "Thanks for the warnings, I skipped the story because of them.",
            "Yeah, so I worked at the same chain for all of my high school imprisonment. I had a different guy, looked like he would have been terrified of a spider spider kind. The guy asks me what is the most cream and sugar he can get, and I just said that I could fill the cup, and add no coffee, but he still wanted a coffee, so I told him about the Wayne Gretzky (9C9S). Wayne Gretzky, the most famous hockey player ever wore jersey number 99. The guy said he would have an XL Wayne Gretzky. I gagged, but made the drink for him, the next day he returned, and asked for the same thing, and I gagged again - I have drank my coffee black since grade 9.",
            "I used to work at the same chain in the US and had a similar incident with an older Karen. She sat in our lobby to drink her coffee, and after taking the first sip, she came up mad as sin, claiming that her drink had almost no coffee in it. I told her that she got exactly what she had ordered. When she asked for a manager, I was happy to inform her that I was the manager. I had tried to warn her multiple times that our measurements were not the same as other coffee shops, but she insisted on a 10x10. So, I told her she wouldn't be getting a refund from us."
        ]
    }
]