[
    {
        "post_id": "xvb1pt",
        "author": "THNielsen",
        "title": "Yell at me for delivering...? Well, time to get some exercise...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/xvb1pt/yell_at_me_for_delivering_well_time_to_get_some/",
        "score": 20595,
        "num_comments": 406,
        "created_utc": 1664877852.0,
        "selftext": "Some years ago I was driving pick up's and deliveries (P and D) for a trucking company in Denmark.  \nP and D is the part of the transport chain where you usually deliver small quantities to multiple customers on a route - kind of like UPS or FedEx but in semi's or rigid/box trucks. It was nearing the end of the day and I had to deliver a trampoline to a residential area - mind you this in EU, so things may be a bit different than in the US regarding rules and regulations.\n\nIt was a fairly new area with plenty of space - but I had to reverse in cause there was no way of turning around. But no problem - the road was wide and so were the corners I had to go around.  \nI put my semi in reverse and started going backwards - and of course I was delivering to the last house on the street. Now the road climbed a bit and was about 6 or 700 metres long - but it all went fine.   \nWhen I finally got to the end of the road and got out of my truck to unload this trampoline, some guy was already standing behind my truck and started yelling and swearing at me:  \nI was the biggest idiot on this earth!  \nHow the hell could I even think of going in there with a semi?  \nI could have run over all the kids in the neighbourhood. (no-one was out)  \nI had absolutely no valid reason for being there and could get the hell out of there right away!\n\nInstead of starting an argument with person, I calmly asked him where he lived - he pointed at the house and said \"Number 74\" - and low and behold, where was I delivering???  \nYou guessed it - number 74...\n\nSo I - again very calmly - told this man:  \n\"Well, in that case I have a trampoline for you...\"  \n\"Oh\" the man said \"Well, I would like if you could...\"  \n\"BUT!!!\" I interrupted \"Since I have no business being in here with a semi, I will be waiting for you at the end of the road\" and pointed to the direction I just came from...  \n\"Mind you - this is the big model weighing about 130 pounds, so you might want to bring a wheel barrow\".\n\nThe joy it was seeing him coming all the way down the road with his wheel barrow. And then trying to get this 130 pound trampoline up in the wheel barrow and starting his long heavy walk 700 metres up to his house again... Priceless!!!!\n\n&#x200B;\n\nEdit: Spelling errors",
        "permalink": "/r/MaliciousCompliance/comments/xvb1pt/yell_at_me_for_delivering_well_time_to_get_some/",
        "comments": [
            "500 point award for the most rewarding easy to read mc",
            "My husband drives artics for a living, but used to drive wagon and drag. He would do drops in the fabric district of London's east end, tiny roads/alleys into the back of the factories.  Roads that had been there since before cars were invented. \n\n  So he would drop his trailer at the entrance to the alley and back the wagon down the alley to delivery bales of cloth to the factories.  \n\nOne day he had just got in position for unloading and this jumped up little knob in his BMW started shouting and swearing at him about how he was blocking the alley and knob couldn't get his shiny beemer out.   \n\nMy husband started to explain that he was delivering and would be ten mins at most once the factory men came out to get the truck unloaded, when knob started shouting do you know who I am? I own this fucking factory and you are stopping me from getting to a very important client.    Hubby said ok, sign here and I'll be out of your way, knob signed the delivery refused paperwork and hubby drove off back to his trailer to rehook it.    Knob in the beemer raced off flicking the Vs and shouting at hubby as he went. \n\nNo skin off hubbies nose, he had the signed paperwork, signed by the owner refusing the delivery.   He finished rest of his deliveries and went back to base (note this was before mobile phones were common or cheap)  \n\n His boss was doing his nut because the knob in the beemer had been on the phone to them every 20 mins asking where their delivery was, hubby simply handed over the signed paperwork, explained what happened and clocked out.   His boss went back into the office with an evil grin. \n\nHubby found out the next week that knob in the beemer wasn't the owner, but the owners son and his dad made him pay personally for a weekend delivery for the cloth he refused delivery of and they were late on getting the clothing order out and lost a small fortune.",
            "Kudos!\n\nBeautiful, succinct MC.",
            "YES !! this is why I come to this Sub",
            "> in Denmark\n\n&#x200B;\n\n> road climbed a bit\n\nRead: False flat  \n\n\n  \n(Liked the MC though my brother/sister in the south)",
            "You gotta love it when the universe personally hands you a present.",
            "I deliver for an XL Amazon warehouse in a 24’ box truck and the amount of grief I get… dude. I have a job to do. I’m more than capable of driving this truck (I have a CDL), and it’s literally your fucking mattress you ordered while you’re yelling at me about the truck in your stupid HOA residential neighborhood. The fuck do you want from me? \n\nI feel your pain and way to stick it to that guy.",
            "Oh fine driver, we thank you for putting a numpty in it's place. Well done",
            "That’s a very heavy kameloso!",
            "This MC is so gorgeous that it could win a beauty contest.",
            "Once, I was working this quite remote delivery route and the main road was very curvy, it was built a long time ago.\n\nThere was a shortcut in middle. Less than one kilometer, and driving the main road was a 6km detour. The shortcut was a private road and the locals got tired of big trucks driving on _their_ road.\n\nThey put up weight limits on the private road, 3.5 tons. I had an 18 ton box truck. No way I'd drive there.\n\nThe few times someone ordered goods to those addresses, I'd call and they'll go on babbling instructions. I'd listen patiently and then mention the weight limit. They'd get upset, but I cannot break the law. \n\nI'd meet them at the weight limit sign and unload the goods on the side of the road. \n\nOnce I delivered many long aluminum ladders and the customer had no other option than to carry them one by one. Checked the map, he lived about 500m away, uphill.\n\nRight then a 26t vacuum truck sped past. A priceless face.",
            "Great job, he asked and you delivered.\n\nDid he forget he had a parcel coming and thought it could have been anybody but you?🤣",
            "Step 1: order trampoline online\nStep 2: be angry that trampoline is delivered\nStep 3: ????\nStep 4: profit!",
            "That's what I call a Kraftidiot!",
            "I do the same thing in the US, and this can’t be real. This is every truck drivers dream.",
            "The look on his face when you used his words must have been priceless.",
            "(Chef's kiss) Flawless victory!",
            "Not sure of your rules and regulations, but when people my Father-in-law is making a delivery to do that kind of crap, he leaves and enters customer refused delivery. When they call or check tracking number and find out the semi driver they cussed out had their delivery, they have 2 choices: pick it up from the delivery company warehouse or pay for it to be delivered again.",
            "I'm curious -- did you convert to pounds for the benefit of us USAites, or do you use both pounds and meters in Denmark?",
            "Would be safe to say that OP... didn't deliver 😎",
            "This is serendipitous.",
            "i liked the time skip to where he was just fucked. Like no arguments or neverminds lets unload this since you're here allowed for the recipient. It's just. Nah, you fucked now; your explanation has been accepted and there is no chance of changing this; see you at the bottom of the hill.",
            "I wish people were more kind, and less irritable and prone to anger so quickly... \n\nI like the way you handled it",
            "Ok wow, this is too perfect.  \nKarma does work through an avatar.  \nDid lightning shoot from yer arse and fire from yer nostrils?  \nThere must've been.",
            "so well deserved.\n\nwhat did he expected when he order that thing?",
            "I just love that you did what you did to him. satisfaction definitely must have been priceless",
            "as a driver myself,  love this 😀 ❤",
            "I’m American and used to work for FedEx. Fuckin love your spirit! 👊",
            "Love this!",
            "Why did you use pounds and meters, if you are from denmark, just curious",
            "Excelente op Excelente",
            "Take note, creative writers on this subreddit, this is how you tell the story of a MC, there's nothing missing but also no extraneous bullshit.\n\nI don't care for, nor want, a 10 year deep dive into the history of irrelevant bullshit that takes up the first 4 paragraphs.",
            "[deleted]",
            "I'm guessing no apologies were given?",
            "Dette er vejen.",
            "Brilliant! Did he utter another word as he approached you and lifted the package into his barrow?",
            "Sir, I like the cut of your jib!",
            "Well done. He sounds like he was a total bellend.",
            "This was awesome! Simple and very entertaining. The wheel barrow! 🤣🤣🤣",
            "I can't imagine freaking out at the sight of a large delivery truck while I was *expecting a large delivery*. How did he expect things to work?",
            "BEST ENTRY EVER",
            "I will never understand why people tell at the delivery drivers.\n\nGranted, I lived out in the boonies where we had maybe three different drivers that drove our route, so we got to know them a bit. And they always had dog treats. I've driver always made sure she saved one just for our collie if we were on her route that day. She loved him.",
            "Serves the bastard right.\n\nGuessing a blue and red truck?\n\nHejsa fra Esbjerg.",
            "He has no business being on that road with a wheelbarrow, he might run over all the kids in the neighborhood",
            "Priceless is right !!!!!",
            "Very short and satisfying. Amazing story",
            "someone call the self immolation unit, 'cause that guy just burned himself to a crisp...\n\nwell done, Owe Pee!",
            "what a joy to read! thanks for sharing!",
            "This was absolutely BRILLIANT!",
            "Oh my God, so funny!   That is like immediate karma.   Best story of the day.",
            "Aah.. Denmark - where you re NOT required to be a (verbal) punching bag for entitled or just jerk customers.",
            "Priceless lesson on being kind to the delivery person because you never know 😉",
            "Gold",
            "As the story goes\nDon't write a check with your mouth that your body can't cash......",
            "He had it coming.",
            "This is beautiful... Thank you ♥️😂",
            "There’s no way I could have had this happen to me and NOT immediately orgasmed when I realized what I’d get to do.",
            "\"low and behold\"\n\nFor information purposes only: you get points for using it at all, but it's \"lo\". It's an unusual, archaic word that's only used in this sort of context; it essentially means \"look here\", so you're saying the same thing twice: behold and behold. We do that sometimes. The expression is more properly lo! and behold! (with the exclamation points, because they're commands), but it's hardly ever done that way any more, even when the phrase is used, which isn't often.\n\nOh, and good story.",
            "beautiful MC.... as a fellow dane, oh yeah... :D",
            "Aaah, elsker deg. fyfan vad man velat göra såhär ibland.",
            "Nice ! \n\nGet my upvote! 🆙",
            "Well, you certainly delivered the MC.",
            "Beautiful.",
            "The quintessential MC.",
            "Bravo",
            "Good for you 👍",
            "I guess that was kind of cooling his temper...",
            "/r/instantkarma",
            "Been there, done that. Then I started at DSV on fixed line full load to Germany, running Freja small loads from DK to SE and B2B to Norway. I did some time on DFDS and had a few lines for Danske Fragtmænd. I hate parcels, hate private customers and the stupid dispatchers who sometimes send me out to stupid places where you can't drive a semi. \n\nSorry guys, where's your nearest partner, I need to drop it there because customer has no space and no forklift.",
            "Wait — how was he able to carry a 130lb trampoline in a wheelbarrow??? What am I missing here lol I am confused. Aren’t wheelbarrows like the size of a bag of mulch ? \n\nAmazing MC.\n\nEdit- I was thinking how would he get [this](https://imgur.com/a/ckvcRSf) to fit in [this wheelbarrow](https://imgur.com/a/vfcdAFS)",
            "Absolutely beautiful",
            "Nice to hear a story from home turf. Godt kørt!",
            "Godt gået nielsen",
            "He showed YOU!!",
            "Beautiful work!",
            "Nice. Lort idiot.",
            "You are my hero!",
            "I work for FedEx and this story made me so happy lol",
            "Karma når det er bedst. Og godt skrevet.",
            "Best. Story. Ever. \n\nThank you.",
            "Surprisingly satisfying for how short this was",
            "My father spent most of his working career in the trucking industry.  One of the rules he bludgeoned into my head was, \"Never argue with the driver until he's unloaded the whole shipment.\"\n\nNumber 74 never got that memo, I guess.",
            "American P&D driver here.  You are the wind beneath my wings...well played!!",
            ">Now the road climbed a bit\n\nLies! This cannot be in Denmark!",
            "I'd let him apologize if he wanted me to leave it halfway down the street instead of all the way lol",
            "Outstanding 👍🏼",
            "Hahaha 😂😂😂",
            "This story made my day!",
            "700m elevation in Denmark? Good good that’s basically Everest",
            "Getting flashbacks about living in Japan and having to pick up hardware from the JSDF on a street that had walls that were literally 3 inches from both sides of the truck.\n\nMind you, it was about 1000 ft of this road, felt like the trench run.\n\nTook photos and sent them to our PEO and outsourced the delivery though we still had to ride with the delivery person. That guy had mad driving  skills.",
            "I am surprised / skeptical that the guy who ordered a 130 pound trampoline delivered to his house, would be hostile to delivery trucks.  Doesn't seem too believable.",
            "You backed a semi over half a kilometer? Without a spotter? That's really sketchy, no wonder they were pissed at you. Is that even legal in Denmark?",
            "I know this is set in Denmark but, in my head, I read it in a Dutch accent and it just made it better for me. Great MC op",
            "*Please note: nothing I'm about to 'say' justifies the dude starting out as a jerk. I think it isn't just unfair to the person you are dealing with, just like this dude learned it can backfire. And, after all, you can always switch over to 'jerk mode' if the situation warrants.*\n\nI have to admit, backing a semi 600 or 700 meters up a curving residential road would be a bit concerning to me. We live in a Midwest US state, in a residential housing addition at the end of a cul-de-sac. We are mostly retirees, the houses here being built in the 1990s, many of the original residents still live here, and we moved here after retiring a few years ago. \n\nBut in the past few years more and more of us older folk have been moving out and young families with little ones have been moving in. Some days I'll see three or four little ones probably ages 3 to 6 on tricycles and scooters on our cul-de-sac or the road leading up to it. Once or twice I've had one pop out in front of the car and I was headed in or out. I now try to drive around 10 mph (\\~16 kph) down the last bit of our road. It feels 'stupid' slow after 60 some years as a driver, but I can't imagine how I'd feel if I ran over one of those little ones. \n\nWhile I can understand where the guy is coming from, as I said at the start it doesn't excuse him for acting like a jerk and it made me smile when he reaped the rewards for doing that.",
            "Your mixing of units (pounds and meters) is even worse than the yank system on it's own. Congrats!",
            "Sikke en klovn 😂🤡",
            "Doubt",
            "[deleted]",
            "[deleted]",
            "This didn't happen. You got it out of your truck right there and then thought of all this as you drove away.",
            "What does \"BUT\" stand for?",
            "Wait a sec... you use meters and pounds??",
            "6 or 700 is a big difference.",
            "Honestly if someone drove a semi into my neighborhood I’d be concerned too.\n\nThen again I live in California where most delivery trucks are the size of a large van.",
            "Thank you for spelling wheelbarrow correctly!"
        ]
    },
    {
        "post_id": "glbizu",
        "author": "n1ght0w1z",
        "title": "Baseball caps on girls is distracting",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/baseball_caps_on_girls_is_distracting/",
        "score": 20489,
        "num_comments": 683,
        "created_utc": 1589701792.0,
        "selftext": "In high school my standard outfit included a backward flat rim baseball cap. One teacher—in the middle of class—called me out.\n\n“OP, you need to take off your hat. It’s distracting.” \n“What about the 13 other guys in this class with a similar hat?” \n“Well it’s distracting when a girl wears a baseball cap.” \n\nI was fuming. Baseball caps on girls are distracting? Fine, I won’t wear one. The next class period, I wore a 3-foot-tall, red and yellow joker hat that featured bells...so that if I moved my head *at all* 16 bells shook.\n\nAt the end of an hour and a half of bells, the teacher pulled me aside to ask that I go back to my baseball cap; apparently it was no longer distracting.",
        "permalink": "/r/MaliciousCompliance/comments/glbizu/baseball_caps_on_girls_is_distracting/",
        "comments": [
            "[removed]",
            "Here in the UK something like 97% of all state secondary schools have a uniform  that pupils in compulsory education have to abide by (sixth formers aged 16-18 generally don't, though), and a lot of head teachers act like tyrants over the pettiest of issues.\n\nI saw an article once where a girl got sent home from school after dying her hair purple because the school claimed it was \"distracting\". I remember thinking at the time that if you're distracted by the unusual colour of someone else's hair, how are you going to cope with the outside world after leaving?",
            "My school had the opposite. The boys had to take their hats off, but this one girl could keep hers on because she looked cute and it was part of her outfit.  \n\n\nEither way, it was wrong.",
            "What school allows any students to wear hats and where did you get the clown hat?",
            "I will never understand some of these fucking rules. We had a day where everyone was supposed to wear \"beach attire\" for some stupid thing. Naturally, I wear some flip flops, board shorts, a T shirt, and a hat.\n\nI get stopped by the principal and told that \"no one wears a ball cap to the beach.\" Oh you're right. No one had ever wanted fucking sun off of their head and face at the fucking beach. I fucking can't with these people sometimes.",
            "I'm old apparently. Never used to be able to wear hats indoors.",
            "Well done.  My hat's off to you.",
            "Creeps making their creepiness your problem. My school had this unspoken rule that you werent breaking the dress code unless you looked good enough to catch the eye of one of the assistant principals or more active older male teachers. Wearing leggings but had no muscle definition? Have a great day. Wearing a short skirt but are shaped like a rectangle? Enjoy your education. Wearing a low cut hoodie, with no bra + larger boobs? You gotta go home. Boys tank tops and chubbies (the shortest chino) were completely ignored until parents made it clear that the problem was that *faculty* had taken it upon themselves to decide how much boob is too distracting to them, despite the fact that childrens boobs shouldnt have anything to do with their jobs at all.",
            "[removed]",
            "That's kinda disgusting in general, because it ties into the whole 'boys can do/wear what they like, but it's the duty of girls to *not be distracting*' mindset.",
            "[removed]",
            "[removed]",
            "[removed]",
            "I'm surprised your high school didn't just ban hats in class. I thought it was universally considered as rude to wear hats indoors (religious cases aside).",
            "Locked.\n\nReminder: Rule 3 is \"Don't question the validity of a story. It's much more fun if we give people the benefit of the doubt.\"\n\nWe frequently punish the first offense of this rule with a permanent ban. Feel free to witness the comment graveyard below.",
            "[removed]",
            "[removed]",
            "[removed]",
            "My HS didn’t let anyone wear any kind of hats or hoods or bandanas. Teachers or security guards would make you remove them. It was to curb gang activity or some shit... but the whole girls soccer team would get to wear bandanas and hats for their team dress up days and wouldn’t get called out. One day a black kid who wore a bandana who got asked by the teacher to take it off but there were 3 white girls in the class with bandanas on too. He said he wouldn’t take it off unless the teacher asked the girls to take theirs off too. The teacher refused and eventually called a security guard and he got an in school suspension. Nothing happened to the girls or the teacher. It still infuriates me. So glad HS is over what a fucking mess.",
            "Man, I remember my high school banning all head wearing unless you were in a religion that does head coverings or the hat was bought in the student store. Something about gang affiliations like how are my cute berets considered gang-related? I had to rely on these berets to make me look decent because my hair was out of control in terms of texture: either being too oily or too dry (hormones were jerks).",
            "Your school allowed hats at all? Impressive.",
            "[removed]",
            "Real issues of sexism and inequality aside, the traditional rule that \"wearing a hat indoors is rude\" is antiquated and pointless. Who is actually harmed by wearing hats inside? Nobody. If it's acceptable for religious reasons, it should be fine for everybody.",
            ">“Well it’s distracting when a girl wears a baseball cap.”\n\nSomeone has a fetish.",
            "Since when is anyone allowed to wear a hat in class?",
            "All I got from this was you il mannered youths wear hats in doors like fucking savages. \n\nAbortion, it’s never too late.",
            "[removed]",
            "When I was in high school, hats weren't allowed at all.",
            "What school did you go to where hats were allowed at all?",
            "[removed]",
            "Simple and effective. Good job OP",
            "[removed]",
            "Anyone who wears a hat indoors is weird to me.",
            "I'm interested in where OP lives that she was able to wear a hat in school!",
            "From the tile, thought this was r/unpopularopinion.",
            "What decade was this? Distracting? Like \"you dress more like boys, because boys must like baseball, so they will be distracted by girl who act like them\"",
            "This is a bad lie. Also what school allows anyone to wear hats in class?",
            "[removed]",
            "> Alas, after a series of deadly blunders caused by distracting low-cut fatigues and lots of harmless pinching, the Army decided women weren't fit for service. Not while I'm in charge.",
            "The emphasis should be on cannon, not water.",
            "I'm just surprised anyone could wear a hat indoors. I graduated from a Pennsylvania public school in 2003 and we were never allowed to wear a hat inside the building.",
            "For us it was the opposite. Girls wearing hats and hoodies was fine but if you were a boy and had a hood up you might as well have killed the teachers dog",
            "My school didn't let anyone wear hats except for one dude with alopecia.",
            "[deleted]",
            "At every school I've been to, you just weren't allowed to wear hats at all.",
            "Why was anyone allowed to wear hats in high school? I’m 31 and that seems crazy to me.",
            "I think it's cute. Though I have noticed a pattern that girls who wear baseball caps are usually country as fuck. Which is also cool. :D",
            "Why wouldnt the teacher just tell you to take off the other hat aswell",
            "I feel it's a go to for girls having a \"bad hair day\" or just cant be arsed.",
            "Ha ha ha ha, nice one!",
            "Saw post length and thought \"really short.  probably not a great post\"\n\nread post and was very happy to be proven very wrong",
            "Your teacher totally had the hots for you in the baseball hat.",
            "That sort of thing always makes me laugh\nMen are the superior sex, but we must coddle them so don’t wear heels if it makes you taller than him. Don’t  wear sleeveless shirts, it’s distracting to men (apparently we don’t have enough will power to not be distracted), don’t make more money than him. \nMen are the superior sex but are apparently a house of cards built on insecurities.",
            "I think your teacher is pervert if he gets distracted by girls wearing caps",
            "The teacher literally singled you out because girls in caps gives him a boner and you gave him one. \n\nFuck teachers like this cause he literally became a teacher to be around people your age. \n\nYou should tell the principal what happened.",
            "In my school no one was allowed to wear a hat in class because it’s disrespectful.",
            "My high school didn't allow any hats all.",
            ">Well it’s distracting when a girl wears a baseball cap\n\nThat was probably his fetish.",
            "Yeah my school simply avoided this by banning hats",
            "This made me cackle out loud for a full minute, I love it!",
            "School dress code enforcement often is super sexist and implicitly values boys' education over girls'.  \n\nA girl might be pulled from class for \"distracting\" dress, removing her completely from education for merely distracting boys from theirs.",
            "I'm surprised your school even allowed hats. My school banned them in the 90s because someone had, allegedly, wrote test answers on the bottom of the bill.",
            "What did your baseball cap say?",
            "[removed]",
            "Screw that teacher. Good on you for standing up to him",
            "[removed]",
            "Good for you! Having one standard for girls and a different standard for boys infuriates me.  Well done.",
            "There must be a sub for this.\n\nEdit: yep. https://www.reddit.com/r/GirlsInBaseballHats/",
            "caps looks like a sophisticated gentleman.",
            "I never even attended a school that allowed hats.  Problem solved.",
            "It is what happened to Tom.",
            "[It looks like she is already deceased.",
            "Very smart young female adult, thank you for standing up to a idiot.",
            "> What is this distracting is from?",
            "i tried clear linux, it was really distracting",
            "Women in baseball caps is hot",
            "My school wouldn’t even let us where hats. If you got caught with one on it was confiscated for the whole year",
            "Can confirm I'm the baseball",
            "\"Fixed\"\n\nWhat is this distracting is from?",
            "Progression is not a blank! That's a Baseball!",
            "Spartans! What is this distracting is from?",
            "Schools over sexualizing kids once again",
            "A girl in a baseball cap is just as suspicious as a black guy wearing a hoodie.",
            "What was stopping the teacher from asking you to remove the joker cap for the same reason? If this teacher had no problem calling you out for a perfectly acceptable baseball cap, then why would they suddenly put up with the infinitely more distracting option? Seems weird to me.",
            "Teachers have started allowing caps to be worn during class? Why?",
            "Do u still have that joker hat, I want to see it.",
            "We weren't allowed to wear hats in my school. Not even between classes :(",
            "Beautiful. We weren't allowed hats in my high school.",
            "OP you legend",
            "haha... could it be that you were just way too adorable looking with a baseball cap?",
            "How much of a simpleton do you have to be where the mere sight of a baseball cap breaks your concentration?",
            "Take off the brim",
            "I imagined the yankee with no brim hat being the hat in question here and it made the story 50 percent more interesting",
            "Gotta say, it is distracting, some girls look mad hot in caps. Shouldn't be banned tho lol",
            "This story is delicious. Excellent conduct OP.",
            "In high school in Texas (1979)...a couple of guys were wearing ballcaps in class. The teacher told them \"The only people I allow to wear hats in my class are women and queers\"   They removed the hats. True story.",
            "In my 400 person public high school, well and middle I guess, nobody was allowed to wear hats of any kind. People would straight up get suspended for wearing hats and refusing to take them off.",
            "Ngl, I expected a completely different response. I was expected some crazy hairstyle",
            "when i was in HS no one was allowed to wear hats, if you had just gotten a bad haircut or something you were doomed",
            "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_rglbizu?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[http://www.youtube.com/watch?v=9Mn49k9xoxU](http://www.youtube.com/watch?v=9Mn49k9xoxU)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/_/fqwx87x?context=10#fqwx87x) - Denny getting robbed in the parking garage is my favorite Denny Crane scene ever.\n[http://www.youtube.com/watch?v=_DeIExLcURQ](http://www.youtube.com/watch?v=_DeIExLcURQ)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/_/fqx6nb9?context=10#fqx6nb9) - I rarely watch TV. I bought a new one last year and it's still in the box. That said, that is the only scene I've ever seen from that show and I love it! Shatner plays it so deadpan... it reminds me of when he tried to teach the locals how to play Fi...\n[http://www.youtube.com/watch?v=7jm646MUYxk](http://www.youtube.com/watch?v=7jm646MUYxk)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/_/fqx44uh?context=10#fqx44uh) - It helps if you're the owner of the Dimmsdale Dimmadome.\n[http://www.youtube.com/watch?v=JPvQS4qVwdE](http://www.youtube.com/watch?v=JPvQS4qVwdE)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/_/fqyrdu6?context=10#fqyrdu6) - This has become a meme lately.\n[http://www.youtube.com/watch?v=c-1tk0o59Qc](http://www.youtube.com/watch?v=c-1tk0o59Qc)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/glbizu/_/fqytul6?context=10#fqytul6) - considered standard good manners until recently   Recently meaning over 30 years ago.  \"People used to wear hats in this place.\"\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_rglbizu?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
            "YES! Nice work!",
            "That's hilarious! I did the same thing once in high school but with an enormous, sun hat. I wish I would have thought of wearing one with bells!!",
            "Bruh why is that distracting wtf",
            "👏👏👏👏"
        ]
    },
    {
        "post_id": "k4485b",
        "author": "BlackbirdNamedJude",
        "title": "He wanted ALL his stuff back, so I made sure he for everything.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k4485b/he_wanted_all_his_stuff_back_so_i_made_sure_he/",
        "score": 20437,
        "num_comments": 389,
        "created_utc": 1606767524.0,
        "selftext": "I posted this in r/pettyrevenge and a lot of people thought it would fit well here.  I just copied and pasted right from my other post. \nObligatory I'm on mobile so forgive me for formatting.\n\n\n\nSo my last relationship was beyond bad, he was all sorts of abusive and controlling.  At one point I had the strength to break up with him but then we got back together after we discussed some things.  Stupid I know, but yeah love and all that.  Well anyways one of the things we agreed on was that he and I would stop drinking alcohol because he was beyond crazy aggressive when he drank, and I wanted to support his sobriety.  This is REALLY important.\n\nFast forward about eight months or so and we got into a huge fight and I not only broke up with him, I kicked him out of the house and told him he wasn't ever allowed back inside. We'd been living together over a year at this point so his mom got in touch with me about getting his stuff.  While on the phone with her I could hear him in the background saying, \"make sure they get everything I own or bought.  I want it all back.\". Apparently even stuff he gifted me he wanted back, but honestly I didn't care, I was happy to get rid of anything related to him.  While cleaning our room up and gathering EVERYTHING I started to come across numerous bottles and cans of alcohol.  It seems he had been drinking again for a while and was hiding the evidence in the room. I mean he was hiding them under the bed, in his guitar case, rolled up in his clothes, in some old backpacks of mine and so on and so forth.\n\nHe had said he wanted everything of his, so any bottle and the few unopened cans I found went straight into one of the garbage bags of his stuff.  By the time I had gathered everything up, I had 3 bags of stuff and one was basically all just the alcohol.\n\nDropping them off was just so satisfying.  He actually called moments after I left his parents place ranting about how petty and immature I was being.  My response? \"Well you wanted all of your stuff back, and those definitely weren't mine.  Plus I figured you'd probably need a drink to deal with the breakup.\". I promptly ended the call and blocked him on everything.  Most satisfying thing I've ever done.\n\nEdit:  Firstly thank you everyone for the words of encouragement and everything.  This happened years ago, but knowing people are still proud of me for leaving means the world to me. \n\nAlso there's definitely a lot about this story that didn't get posted, such as cops having to be involved and other things.  I didn't put open cans or unscrew and bottle lids just for the fact I didn't want to risk ruining his stuff as that'd be a huge headache and everything.",
        "permalink": "/r/MaliciousCompliance/comments/k4485b/he_wanted_all_his_stuff_back_so_i_made_sure_he/",
        "comments": [
            "Good for you it takes will power to leave a bad relationship. One of my favorite quotes was from Robin Williams; \" I used to think the worse thing in life was to end up alone. Its not. The worst thing in life is to end up with people who make you feel alone\".",
            "Good riddance to bad rubbish, both figuratively and literally. Good for you!",
            "Oh god, I know exactly what you mean about the hidden bottles.  My ex was an alcoholic and he didn't tell me when we got together so I thought drinking was cool around him. It spiraled into a clusterfuck.\n\nI ended up finding all sorts of different bottles in weird places: behind DVDs on the shelf,  tucked into shoes that were in a donation pile, inside an empty  box for a game console, inside the mattress cover up against the wall, hidden in the substrate in the snake tank.",
            "LOL, honestly, I thought you showed restraint, I would have been canvassing the trash cans to see what I could send mixed in with his clothes.\n\nCan I ask what the final straw was? What caused the fight?",
            "After my last serious girlfriend broke up with me, she called. It was about a year later and i was so excited. She said, \"I thought of you last night\". I said, \"REALLY!\" She said, \"Yes, i was vacuuming and found one of your liquor bottles under the couch\". That hurt. It really hurt. I had stopped drinking after we broke up. (Rehab etc.)\n\nFast forward 15 years. Still sober and happily married. (Not to her.) \n\nHang in there, OP!",
            "Friend did this: her& spouse split up, he moved to another country. House had to be sold, he didn’t help with packing but said he’d cleaned out the garage. He asked her to ship his tools that remained in garage. She did, COD, including all the garbage and junk that he hadn’t cleaned up.",
            "Now cleanse yourself of his toxic energy he left behind. You don’t have to delete this post (although the more people who interact with it, the longer your mind stays in a toxic space relating to him). Go do something for yourself to show yourself the love you always ALWAYS deserve! Or don’t. I won’t hold ya to it because I’m just an internet stranger. Love ya, OP.",
            "I would have loaded up an open box with the alcohol bottles and handed it to his mom so she could see exactly what his problem is.",
            "Honestly I did the same thing, in a similar situation. We were supposed to be sober together because of his addiction and when he left, I started to pack up his things into this large storage bin he had. I started finding so many empty cans and bottles, those just got packed into the bin, mixed with everything else. Too bad his preference were four lokos so things miiiight have gotten sticky.",
            "As an alcholic, I sympathize with his issue but it's not an excuse to be a dick to OP.\n\nedit: added clarification.",
            "Awesome!!!\n\nI did something similar after a female roommate took off, leaving a lot of her belongings behind in her dumpster of a room. Without going into the backstory, I had to pack up her shit & leave it on the curb for her to pick up. It was gross - especially when I discovered used sanitary products in drawers, the closet, under the bed, etc. I packed up every one I found, & hope she enjoyed opening those boxes.",
            "Wow, what a man. \n\nHas his mommy call his ex to get his stuff back - proceeds to call OP petty and immature \n\nLmao",
            "Malicious Compliance to the t, glad you cross-posted. How long has it been since, you doing good?",
            "[deleted]",
            "Just be mindful. The most dangerous time for domestic abuse / escalation is after you break up. Stay safe.",
            "Reading this when I got to the part about him wanting everything back, including things he gifted you, I halfway expected you to give him back something like a  sex toy or something. I think it would have been hilarious if you went out and got a giant dildo or strap on or something and snuck it into his things, leaving him at a loss as to how to explain to his mom that those were his.",
            "Bless ya. You did a good thing. It’s up to him to realise he has a problem. Once you start hiding your drinking habit from those closest to you, I would consider that a problem. Good on you for having the strength to end it. I hope you’re okay. Break ups are never easy, even when they’re for the best.",
            "[removed]",
            "Last paragraph is pure gold... 🥇🥇🥇🥇",
            "hopefully the bottles were all opened, too.  \n\nalcohol saturated clothes smell horrendous. \n\ni had to kick out a tenant who let her little dog shit all over the house and she did nothing about it...\n\nwhen i bagged up her belongings I made sure to include a few little puppy-bombs for her to unwrap, mixed right in with her bedroom clothes.",
            "Imagine having everything you own fit into 3 rubbish bags, a third of which is alcohol. That is the sour rotten cherry on top of the sad stale cake. Good riddance to him! I hope you find peace without him.",
            "Lol I was like this looks familiar till I realized I had read it earlier \n\nAlso really enjoyed reading it and I applaud your efforts and you did the right thing",
            "Damn. You dated my ex. I'm sorry you went through that.",
            "I know a guy who demanded that his ex return everything as well.  He specifically called out everything they received for their baby shower that his sister threw for him even if they got it from her family.",
            "Ending a bad relationship and moving forward can be very liberating!",
            "Should’ve mixed the beer cans/alc bottles with his belongings in the same bag!",
            "My ex wife did this to me in reverse. I’m going to post that here now. Thank you for reminding me of my own malicious compliance story 😂😂😂",
            "What is it with alcoholics and bottle hoarding?",
            "Good for you I hope his mom opened it and called him out on it or better called an intervention",
            "You had me at guitar case.",
            "Heh. Hey, it's too bad you hadn't thought of perishable foods that might have been in the fridge. Stuff going to rot inside of bags of his belongings would have been...effin' hilarious.",
            "I offer no forgiveness because formatting still works on mobile.  \n\nNow to read.",
            "I had a fight with a \"friend\" recently. She was super pissed that I expressed how hurt I was after a weekend of hanging out where she teased me all weekend for not being able to identify music she liked, invited 2 strangers to go snowboarding with her because \"no one ever wants to go with me\" and when I reminded her I offered to go, she turned me down in front of these strangers, and that night had woke me up listening to loud music and spent the entire morning crying over some dude that cheated on his girlfriend with her for a year because his dick fit like a glove.\n\nShe said I was being insecure, immature and to not talk to her about it because she wasn't my therapist. She also told me I copied her on everything I did. She told me I was taking advantage of her generosity and that she wanted whatever stuff she \"pushed on to me\" back.\n\nSo I did that. I packed everything she ever gave me over the years and gave it back. I left it in front of her garage. She messaged back that her mom was pissed and how I knew they didn't have room for all that crap.\n\nI don't know what the fuck she actually expected.",
            "That's really petty.",
            "BOOM!",
            "He definitely needs help but that isn't your responsibility",
            "Honestly, I hope he gets help with his drinking problem, but you did right to leave him",
            "For others in a similar situation, note that this likely constituted an illegal eviction by OP and opened herself up to a potential lawsuit.  Safety first of course, but if not in immediate harms way, consult an attorney before locking somebody out and/or denying them access to their possessions.  As satisfying as the Malicious Compliance is, it won't be as satisfying if the significant other wins a lawsuit and gets damages awarded.",
            "So happy for you. Congratulations ♡",
            ">he for everything",
            "Reminds me of my two toxic meth-head cousins that were living together. \n\nOne of them slept with the other ones boyfriend/drug dealer so they got in a fistfight (one of many) and the boyfriend stealer moved out. Boyfriend stealer started to harass the other cousin to bring her things to her. Including calling me and the other non-meth using cousins to try and sway us to harass her also.The other one packaged up all her belongings very neatly and did not forget anything. When the boyfriend stealer unpacked her clothes she noticed that that everything she owned had \"I ❤ >insert other cousins name\" all over them in permanent marker or bleach pen.",
            "I just love these stories.",
            "Glad to see my dad is dating again...",
            "I'd have sent open cans (empty or not) in his clothes or linens.",
            "I should sort the comments by most controversial!\n\n&#x200B;\n\n&#x200B;\n\nWow, that was a fucking mistake.",
            "You literally threw out the trash, I see no problem here. Oh, and you threw out the empty bottles too.",
            "See, I also would have loved if you dumped glitter on everything",
            "Seems fair and just. Ironic of him to call YOU immature...And what, he expected you to clean up after him?",
            "Should have included the opened cans. With the clothes, of course.",
            "Wish I could also take a vengeance like this on my ex abusive, controlling, manipulative ex-boyfriend... I am happy you got rid of him, you're strong!",
            "My god.  I’m glad you’re out of that... this just made my stomach sink with how it was restive to my last break up - proud of you!  TURNING SOBER AND EVERYTHING ELSE my god, on par!",
            "Now that shit feels good! Good for you OP! Winning!",
            "You made the right choice.  Say goodbye though because he will die of cirrhosis at a young age",
            "Well played. Be careful though.",
            "You go girl! Good on you for having the strength to get rid of an abuser! That takes real courage and strength.",
            "He is obviously an alcoholic, do not ever let him back in your life! They are really good at gaslighting and lies.",
            "I am sure you already know this but Please be extra careful, those who abuse alcohol tend to react violently to breakup and retaliation.",
            "Hello again!!!! Loved this read ❤️ I wish you the best in finding a real man to partner up with you and that you both bring out the best in each other!!!",
            "Good for you for dropping that abusive dead weight.",
            "Do you seriously not clean under your bed for.months on end?",
            "So you had empty cans of beer just sitting under your bed and you never even smelled something funny?",
            "[removed]",
            "Congrats on the weight loss! 😎",
            "Good. Some bridges are meant to be burnt.",
            "Fuck yeah!",
            "This is some next level stuff here",
            "Bravo",
            "Should’ve opened the alcohol and poured it into ziplock bags.  Gotta itemize everything.",
            "Well done you!\n\nThis brought back some unpleasant memories(bottles rolled in clothes is something I haven't thought of in decades) for me, I'm so glad you got out and did it with style. \nAlso, your moble formatting is impeccable.",
            "Legend.",
            "Oooh, burn David",
            "Well. Fucking. Done.",
            "Hell yea! Good on ya OP.",
            "I hope he gets help...",
            "YAAAAAAAS!!! Go you!!!  Mine wasn't an awful person, so I signed him up for NAACP text alerts and a gay pornhub account.",
            "Love this for you lmao on to bigger and better!",
            "Both of you are toxic",
            "He’s not wrong when he said that was immature.",
            "[deleted]",
            "You are petty",
            "Good for you! Towanda!!",
            "Love does indeed make fools of us all - but I am VERY happy you got out of that situation!\n\nI work for a site called Not Always Right and our readers really appreciate stories like these. Would it be okay with you if we shared your story on our site? Please let me know if that's cool?\n\nThanks again for the great story!",
            "This reads like a psycho justifying her crazy tantrum.\n\nThere's nothing wrong with wanting your things back after a relationship ends.  \n\nYou seem unwell.",
            "> Acting like a child.\n\nReddit: YAAASSSS KWEEEN\n\nYou're both fucking pathetic.",
            "Why do people post about their lives on reddit? \n\nLike lady, either you have real social issues or you have to get as much attention as possible every moment of your day.",
            "[deleted]",
            "Everyone is on mobile. The entire world.  What makes you think you’re so unique you have to announce you’re on mobile?   This isn’t new technology here.",
            "Ha!",
            "BADASS!!!",
            "Nice.",
            "u/BlackbirdNamedJude did you shake the hell out of the cans before you packed them?",
            "Shit, this really makes me not be in a relationship with anyone. You get into a relationship, they dump you, you destroy half of your ex’s stuff by intentionally drenching it in alcohol? Evidently thousands of people are commending this behavior.\n\nJesus Christ, it’s not yours. Intentionally destroying it is beyond just being mean, it’s criminal. Damn psychopath.",
            "Hahaha best!",
            "Good for you!!",
            "[removed]",
            "H  to ``in. ``p.  I",
            "Dang don’t mess with this woman. Good job lol",
            "Ficking awesome.",
            "Alcoholism is a disease. Would you do something like that to somebody who had lupus? I doubt it.",
            "\"he was \\*\\*all sorts\\*\\* of abusive and controlling\" \\*ahem\\* anyways...\n\n  \n\"Him leaving me alone and staying away from me while getting his mother to contact me wasn't enough. I was pissed off that he left so easily and respectfully without causing any drama, so I had to put trash on his doorstep and came on reddit to type about it\"",
            "> Plus I figured you'd probably need a drink to deal with the breakup\n\nwell done, you probably contributed at least in part to the death of innocent bystanders!  hope you feel good about your little zinger!",
            "Right on.. knocked his dick in the dirt, and it's just what he needs. Speaking from experience...",
            "Jesus I thought you were going to do something bad to him. Could you not have opened one or 2 maybe 3 of the cans in with his bags. Fair play for getting rid of him. But even in the break up he walked on you by packing up all his things for him and dropping it  off. Learn from this break up. I'm probably going to get a bit of abuse but that what I think. \nAll the best with your future endeavors.",
            "This was really satisfying OP. Sorry you were in such a crappy situation but good on you for not only getting out of it, but doing it so perfectly!",
            "Honestly, does anyone know why some men demand presents, the fees they spent on dates, etc upon breakup? I agree, I don't need those tainted things anymore, but I would be too proud to do it.",
            "Good for you!! My long time boyfriend picked a fight so he could have a party at our apartment knowing I would leave and stay with my dad after the fight.  I came home unexpectedly to find bottles of liquor - expensive liquor and all kinds of food for HIS party.\n\nSo when I packed my things, I poured out all of his booze, took the food and even the TOILET PAPER! \n\nHave fun at the party without food booze and toilet paper you prick.",
            "too bad. i would have totally left the bottles and cans open.\n\n'i didnt know they were there. you wanted your stuff asap so i threw it in the bag. how was i supposed to know you were hiding your drinking from me, when you were supposed to be sober?'",
            "Beautiful. I guess this loser thought you'd just tidy up his mess.....?",
            "The hiding bottles thing hit deep. My stepfather is an aggressive alcoholic and he does the same thing. He, too, is very possessive and controlling, and it especially comes out when he’s drunk. He sees me as an obstacle between his relationship with my mother, and this has ended up with me strangled against a wall. My point being, you made the right choice. An aggressive alcoholic significant other can absolutely ruin your life, and I wish you well going forward.",
            "All my legal stuff is done. My bestie has the power. I told her to pull the damn plug.",
            "It amazes me how two people, supposedly in love, can act with bitter hate toward each other. \nI've been married over 40 years and couldn't imagine acting that way toward the man I fell in love with. Even if he left me, he's still the father of my children. I don't get it.",
            "Dated a guy just like that, didn’t happen to be named Mike was he?"
        ]
    },
    {
        "post_id": "z8bhai",
        "author": "onelass",
        "title": "You want to be notified every time I brush my teeth? No problem.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/z8bhai/you_want_to_be_notified_every_time_i_brush_my/",
        "score": 20409,
        "num_comments": 453,
        "created_utc": 1669768203.0,
        "selftext": "This is a smaller one and it happened when I was still living in a student dorm the first few years of university.\n\nEach room in my dorm had their own sink, with showers and toilets in a shared space, so you could at least brush your teeth and get ready in peace.\n\nI happened to have a next door roommate, who I very seldomly saw, due to our schedules, however, you could hear the water running from time to time. I have an electric toothbrush, which is important for the story.\n\nOne day I was brushing my teeth as usual and rushing out the door to university when said roommate came out of his room with a wolfish grin.\n\n“Onelass, you can just call me next time you feel the need to run the electric thing in your room!” At first I didn’t get it, then I was quite disgusted, as he obviously thought I was using my vibrator twice a day and had put more thought into this than I’d liked.\n\nWhile I do own several toys, my bed was on the complete opposite end of the room, so as far away from the shared wall as possible.\n\nAt night, I was still disgusted by his behaviour when I got the idea to just do what he wanted me to. So I grabbed my toothbrush, knocked on his door and smiled as sweetly as possible.\n\n“Neighbour, I need to use my electric device now and since you offered your help…”\n\nHis face lit up until I shoved my toothbrush in his face and realisation dawned. I’ve never seen anyone turn this red this fast.\n\nFor the next few weeks I knocked on his door every time I brushed my teeth. And since I decided my dental hygiene was a priority now, I upped brushing my teeth from twice to thrice a day.\n\nHe got super uncomfortable every time I knocked and asked him about dental hygiene tips, but he never was creepy towards me again.\n\nEdit: It just dawned on me there MIGHT be a possibility he masturbated to the sound of me brushing my teeth thinking it was something completely different. Poor soul!",
        "permalink": "/r/MaliciousCompliance/comments/z8bhai/you_want_to_be_notified_every_time_i_brush_my/",
        "comments": [
            "We had coed dorms.  There was a girl in the room next to ours (she somehow got lucky and got the room to herself,  but it was 2 per room) who asked my roommate and I if we could hear anything from her bathroom.   We're both like \"noooo... why?\"  She takes us into her bathroom to show us the kitten she found.   She was worried people could hear it,  and no pets allowed in the dorms.  She kept it most of the school year,  sneaking it out before housekeeping cleaned the bathrooms.",
            "I would have doubled down and brushed your teeth for you.",
            "when I was in college we'd get out out a vibrator and hold it buzzing on the wall to summon our neighbors",
            "As a dentist, this makes me so incredibly happy.",
            "You should have made some moaning sounds while using your tooth brush.",
            "Hmmm... I really wasn't sure what your story was going to be about until I read it. I lived in a residential care facility for the mentally ill for three years and I had to tell staff every time I brushed my teeth. Actually, at first I had supervised brushing, so they actually had to watch me brush!\n\nI have lived on my own for ten years now, but I still get asked if I brush my teeth when my staff visits my house.  I have staff that come a couple times a week to help me with the tasks of daily living.",
            "Actually, my first thought was \"helicopter parent, does it includes moving several timezones off and still calling every morning and evening?\".",
            "I had a similar setup in the dorms: 2 people per room, 2 rooms per bathroom. They called them \"suites\". \n\nMy \"suitemate\" had a tendency to listen to his Christian hymns at an ungodly volume. I retaliated with the darkest, most demonic death metal I could find. \n\nHe learned to keep the volume down.",
            "….did he think you were just masturbating for two minutes at a time twice a day??? The logic behind some dudes.",
            "Hahahaha GJ on turning his gross attitude back on himself.",
            "OMG, the edit reminds me of an embarrassing story. Back when I was young, single, and living in an apartment building, I thought I heard my downstairs neighbor moaning. It sounded hot, and I got excited. As I continued to listen, I realized that the \"moans\" were very consistent, same tempo and volume... And they were coming from inside my room.\n\n\nMy cat was snoring. The little whistle his snore made, sounded just like a woman moaning.",
            "the girl who lived across the hall from me at uni used an epilator to de-fuzz her legs.  I know this because she went to great effort to let us all know that if we heard buzzing coming from her room one afternoon that it was her epilator.  \n\nThis was not the right course of action on her part.  \nBy announcing this to 10 young adults with varying levels of maturity, she basically assured herself of a whole year of some of us kindly reassuring her that we respect her need for ‘private time’ and there’s no need to be ashamed, while others would knock as they passed her room and yell out ‘hey Katie, are you masturbating again?’\n\n\n I came home one day and as soon as I came up the stairs she threw open her door and was like ‘it’s not a vibrator, it’s just my epilator!!’\n\nSuper confusing because I am so not perceptive, so it hadn’t even registered in my brain that something was buzzing",
            "This is the kind of wholesome shutting down of a creepy male I can support.  Clearly he was in the wrong, and you taught him a valuable lesson without degrading anybody.  👍",
            "I also got an electric toothbrush in college but we had floor bathrooms so I’d often use the stall while brushing my teeth.  Went down with my roommate one night, went in the stall, did my thing while brushing and come out to my roommate having what looked like seizure from laughing so hard at the sink.\n\nApparently two other girls came in looked at the stall I was in and gave each other terrified looks before slowly going to the other stalls 🤣\n\nIt’s especially funny to me since at the time I had never owned a toy and never even thought about what it must have sounded like 😅",
            "I'm imagining myself in his position. Knowing I'd fucked up that badly...man. There's a possibility that since ya presented the toothbrush and mentioned the offer of help, I'd go for the hail mary and accept and brush your teeth. And I'd do a quality job too. And have hygiene tips ready for ya.\n\nIt's dumb as hell but I'd be hoping for to be an awkwardness overload or something and it circle back around to where it might be a little bit funny. Kind of an atonement and apology and maybe start over on knowing each other and hopefully end up as friends? Or at least not uncomfortable? \n\nOh, flossing would be on you. Apparently only volunteered to help with the toothbrush.\n\nI dunno. It's not easy to figure out since I wouldn't have said something that stupid in the first place lol. If I heard a whirring or mechanical noise in the shared bathroom, I'd think toothbrush or razor.\n\nPlus, why would you use an item like that in the shared space? Like clockwork, twice a day? For a minute or two?",
            "Q: What’s at least six inches long, goes in your mouth, and is more fun when it vibrates?\n\n>!Electronic Toothbrush!<\n\nQ: What’s white, sticky, and better to spit than to swallow?\n\n>!Toothpaste!<",
            "Upvoted for thrice.",
            "I thought that story was going to be dumb, but your MC was awesome!!!  Great job!!!",
            "Damn. You are wise and savage. I like how you work.",
            "I was a warden at a UK halls of residence, kinda like an RA. We had a lot of calls from students whose neighbours left their alarm on when they went home, etc. Got a call from a student complaining of a loud noise that wouldn’t stop from the next door. Went in and the en suite was the source of the noise. Enter to find that the vibrator they had in the shower had fallen over onto the metal drain in the wet room and that shit rattled and echoed!",
            "I love it when a capable response clearly points out the weakness of such unwelcome behavior.",
            "Yikes. That’s when you report for sexual harassment 😂",
            "Co-ed dorm?",
            "Call them on their bullshit, sunlight kills vampires!",
            "ah yes, the 2x daily regular 2 minute masturbatory sessions.",
            "I lived in a 3 bedroom apartment with two of my friends (all ladies). One friend had guests over and we were all in her room hanging out except for friend 2 who went to her own bedroom and closed the door. A loud vibrating noise started from behind the closed door after a few minutes and everyone noticed. We all looked at each other sheepishly, with knowing looks. The vibrating went on for some time and every few minutes our looks between each other grew more incredulous. How could she be at it for so long??? She eventually came out to a room full of awkward people who asked how she was doing? Everything alright? She was confused and we finally admitted we had heard the noises coming from her room. Turns out she was just using her electric razor to shave. It was the same area, just no happy ending (except for her satisfaction of a shave well done).",
            "It's dorm policy not to imply ownership in the event of a toothbrush. \n\nUse the indefinite article.\n*A* toothbrush.\n\nNever *your* toothbrush.\n\nNever say the toothbrush accidentally turned itself on.",
            "*BAHAHAHAHAHAHAHA!!!!!!!!!* I just laughed so hard I scared the dog! Thanks. I needed that.",
            "You should've asked him to brush your teeth for you, might've been funny",
            "The edit is hilarious.",
            "2 minute wonder boy",
            "I was expecting some busy body with \"no running any water while I shower!!\". That is so much worse, but that edit makes it a fucking hilarious mental image.",
            "My electric toothbrush has a 2 minute cycle. Funny if he thought that's as long as you spent on yourself with your \"device\"!",
            "Please post a video of yourself brushing your teeth. For science and stuff.\n\nBut seriously, this was pretty funny.",
            "You're supposed to brush your teeth for two minutes, but a lot of people don't do it that long. But even at the full two minutes... Did he really think you would use a vibrator for two minutes and then go \"yep all done. That was satisfying.\" Possibly telling on his own, er, longevity.",
            "You should pant and moan every time you use it, too.",
            "Well played",
            "What did he think the gargling sound was.",
            "The sound of someone brushing their teeth... It's not sexy on its own but there might be something in that, I have this special feeling whenever someone new starts keeping her toothbrush at my place, and especially when we start brushing our teeth together. Sex is great and all but everyone does that, seeing someone next to you in the bathroom mirror, letting go of judgments, and allowing yourself to look silly, on the other hand, that's how relationships start getting serious.",
            "This is glorious. Well-played!",
            "Maybe his kink is oral hygiene.",
            "“Tho aw you a dentithtwy majah oh aw you jutht a hygiene enthuthiatht?”",
            "I am dying. OP this is the funniest thing I have ever read. This idiot really wanked to you caring for you mfing teeth!!!",
            "Good one!\n\n😄🤣👍🏻",
            "I swear I heard someone tell this exact story somewhere before...",
            "Good on you! That's a great way to stop that kind of bad behavior.",
            "Fabulous! I love this Malicious Compliance story. Well played!",
            "Upvote for using the word “thrice”.",
            "Reason number 7,811 that I’m happy I lived off campus.",
            "That last paragraph made me 😂",
            "My man thought he had scored a hottie with that lineonly to be let down:D",
            "Haha I’m in a dr waiting room trying to Howl quietly!",
            "That is an awesome course of action! Credit to you.",
            "LOL\n\nI was undergoing the 'field' portion of Air Force Officer Training - a few days at beautiful Camp Bullis, Tx....  So we're out camping, pretending to be soldiers.  This young lady was entirely too bright and chipper one morning while we're getting ready and she just shouts out \"I love Oral Hygiene in the Morning!\"",
            "The good thing is, you can both now finish in 2 minutes.",
            "I'm too petty. I would have doubled down and draw out proper hygiene presentations 😂😂😂",
            "Omg I love you",
            "Bro was basically like this guy: https://www.youtube.com/watch?v=sFHw-R49pok",
            "lmfaooooooo thats gold",
            "Had a similar set up in my college dorm.  Sink in the room,  but we had a bathroom that was shared between 2 same gender bedrooms. (So 1 person per room that had its own sink, bathroom in between the 2 rooms with doors on either side)\n\nI had an electric toothbrush.  Never used it for fear of this exact thing.",
            "I stayed in a hotel recently and had used those vacuum bags for my clothes. When I was packing to leave I was running the portable vacuum thing and wondered if the person on the other side could hear it and would think I was doing something else!",
            "I want to hear about the dental hygiene tips he proffered.",
            "Really creepy way to introduce yourself lol wtf\n\nIf I was said guy though, Ngl, the fact that you kept coming back every day would have made me think i still had a shot\n\nHe sounded way too embarrassed though",
            "coed dorms 🥴",
            "I can just imagine in some reddit thread at the time:\n\n\"Hey reddit, I hear my roommate using her vibrator regularly, it's making me rather flustered, what should I do?\"\n\n\"Dude, you should totally act all cool and offer to help her out, chicks totally dig that\"\n\nAnyone remember the 'it went ok' saga?",
            "Y’all had coed floors?",
            "At first I was like \"well yeah, watching women brush their teeth is hypnotizingly jiggly\" and then you said it was electric and I couldn't figure out why anyone would want to watch that, then you said they're your neighbor not roommate and I got even more very confused until you said they thought it was a vibrator. This was a real roller coaster of emotions.",
            "What a perv, lol",
            "This didn't happen",
            "Who the fuck uses their vibrator only twice a day?",
            "It took me wayyy too much time to get that onelass meant your name irl. 😂",
            "Wasted opportunity to grab the tooth brush and brush your teeth for you.\n\nHas that guy not seen Monogatarie? SMH",
            "My housemate at uni though some curling tongs were a vibrator 😂",
            "If he thought that was a vibrator rather than a toothbrush I doubt any more thought went into it than “ha ha vibrate noise, must be a vibrater”.\n\nWhy would you be masturbating for 2 mins every morning and evening like that? Any amount of thought makes it obvious it’s not a sex toy.",
            "Huh……..don’t know about this one",
            "This sounds like the beginning of a rom-com where he doubles down and offers to brush your teeth. Then you double down and let him. And it just keeps spiraling from there.",
            "Was he cute OP?",
            "I mean to be fair if it was actually a vibratory and I could hear it through a wall, I'd probably try to make you as uncomfortable as possible because damn, are you using like an industrial grade puss plower 3000? Because that's loud if you can hear it in a fucking loud ass dorm.",
            "Ehhh. Is it hilarious? Absolutely. Warranted? Definitely. But I don’t think he was being malicious. I think homeboy was just trying to shoot his shot 😂",
            "Tbh it sounds like you're just participating in his weirdness.",
            "Maybe he was creepy, maybe he was supremely uncomfortable, idk.  That's up to you to decide.  But it sure is hilarious either way.",
            "You should've, from time to time,  included a vibrator to those neighbours watch  visits, to keep him/her on the edge ;)",
            "So you did have the toys, which you used and he probably heard that. Then you proceeded to be a lot more creepy than him, every time you could. \"Go girl, and tell your truth\", right?",
            "♥️♥️♥️♥️",
            "poor guy thought he was gonna get his dick wet :(",
            "[removed]",
            "Why poor soul? I’m doing it now. Ohhhhh brush a brusha brusha.",
            "[deleted]",
            "Idk if this is malicious compliance.  Sounds like a typical thing a dorm guy would think if they heard buzzing. Pubescent hormones tend to drive thoughts like that. You on the other hand seem to have taken it too far and became a dick about it.",
            "I can‘t help but think of [this song.](https://youtu.be/ZlHf1Fc0OSg)",
            "I love this.",
            "Was his name Buzz?",
            "He should have leaned in like you did. That's really the only way to counter an awkward moment. You just gotta play the game",
            "This story is hilarious! Petty.com. Love it.",
            "This malicious compliance reminded me of this anime scene...\nhttps://youtu.be/d2EB0KhPK5Q",
            "Awe. He could have used this as a way to get to know you. He could have brushed his teeth with you.",
            "I think he may have had a thing for you",
            "Jeez, he probably doesn't have anything to crow about if he's that type of person. Your toothbrush would probably be more satisfying even if you WERE using it for the purpose he was thinking of.",
            "Bless you for enabling and encouraging that poor lad's lonely sex life!",
            "This reminds me of [something](https://www.reddit.com/r/araragi/comments/2ey6z4/this_is_a_series_of_posts_from_4chan_about_a_guy/)..."
        ]
    },
    {
        "post_id": "viw1du",
        "author": "Groot13",
        "title": "I’m not allowed to take Ubers unless it’s to the main airport? Fine.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/viw1du/im_not_allowed_to_take_ubers_unless_its_to_the/",
        "score": 20392,
        "num_comments": 442,
        "created_utc": 1655988086.0,
        "selftext": "This happened years ago.\n\nIn Toronto there’s a small island airport close to downtown and then the full on Pearson International. Once every 2 weeks or so I’d have to travel so I’d usually book my flight through the island airport since it would be cheaper and my office was downtown so it took literally 15 mins to get to (and there’s no real customs or anything, you can show up 30 mins before your flight depart time and be good to go). If my flight was at 1pm I’d leave the office at noon and make it with time to spare. One day I get my expense request denied for the Uber that took me to the airport because “it was close enough to walk and as per company policy taxi/Uber is only for Pearson”. This was all over $12 which I was doing for months. Ok, fine. \n\nNext flight I booked in Pearson. The ticket was $900 instead of $400, I paid $70 in an Uber to get there instead of $12, and I had to leave work a full 3.5 hours before my flight to make it through check in, security, etc to get to my gate in time. Usually I’d be on some sort of call leading up to my flight but here I couldn’t do any work at all. Sorry team, I’m unavailable for the rest of the day because of company policy. \n\nCome back and I’m asked why my expense report was double the usual amount I’d put in. It’s because I can’t expense a $12 uber to Billy Bishop airport and I’m not going to walk for 40 minutes in my suit and dress shoes in the middle of January in the snow. 2 months later it’s now cost them $2000+ over what I’d normally have spent.  Some of the flights in that time were over $1000 vs the $400 at the Island Airport. \n\nFinally I get an email one day saying I can take whichever flights I deem best based on my judgement and that any amount under $700 is auto approved at the Island Airport. Now I get to eat a nice meal and sometimes upgrade myself to premium seats and still fall within budget!",
        "permalink": "/r/MaliciousCompliance/comments/viw1du/im_not_allowed_to_take_ubers_unless_its_to_the/",
        "comments": [
            "Ha good compliance. Years ago my then boss was travelling a lot and was  told off by finance staff for buying a coffee every morning and charging it to the business as an expense. Note there was nothing in the policy saying you couldn't buy coffee for breakfast but they claimed the spirit of the contract was no coffee.\n\nSo in future he bought the hotel breakfast at often $30 or so instead. Finance were pleased he didn't break their rules and went from paying $3 for a breakfast coffee to $30 for a breakfast coffee with food he barely ate.\n\nThe travel policy was changed about 3 months later to allow staff to buy a coffee in the mornings.",
            "Not only great malicious compliance, but you didn't just get to keep doing it your way you got some extra budget too! Nice work op",
            "Companies obsession with penny pinching is ridiculous. And what do they expect in the summer- you to show up in your suit dripping with sweat after walking across Toronto in 40 degree weather?",
            "It would have been cheaper for them to provide wood and a lighter and tell you to burn some cash",
            "My dad had a coworker get part of a mileage claim denied, *\"you put down 102 miles to drive your personal vehicle to their office, we only allow 98 miles.\"*\n\nMonths later, the coworker and the boss were headed to the same associate's office together, the coworker was driving, and he pulled over to the side of the road a couple exits before their exit, saying *\"it's been 98 miles, we must be there already\"* and shutting off the car. After a couple of minutes, the boss told him *\"Okay, resubmit the last one, I'll authorize the whole 102 miles.\"*",
            "Colleague told me at a previous job which was in a business district, he was able to get a chopper to the airport for $50 and be there fifteen minutes after leaving the office. \n\nHad been doing it for eighteen months on a regular basis before someone at head office decided that was a no-no. \n\nSo from then on, he had to take a taxi, which usually took an hour and cost $80-90.",
            "I love when someone who lives behind a desk in a position of power says something like \" You can just walk that \"",
            "They suggested walking to the airport with your luggage?",
            "I've seen, first hand, this same type of thing many times.  Here are some examples:\n\n1. By policy, the Client will reimburse for a rental car and gas, but not mileage.  Costs the Client $400 more per trip.\n2. I can fly in the night before and the flight is $300 cheaper, but I'll need an additional night of lodging for $100.  Nope. Not going to pay for a hotel that's not during the scheduled work time.\n3. Client insisted on me being at a 1 hour meeting, in person, 4 hours away, even though other people are calling in.",
            "You should get a raise simply for being smart enough to avoid Pearson at all costs. I love the island airport. It \\*almost\\* makes it worth flying to TO from YOW.\n\nIf the Ottawa Rockcliffe airport (YRO) ever decided it could handle flights to Toronto Island, I might fly in for Leafs or Raptors games on occasion. As it is, Via 1 is still tough to beat. The timing is almost the same as flying, and much less risk of delays.\n\nThe point though is, f\\*ck Pearson. Worst airport in North America.",
            "Counting beans is so hard they have to put their brains in a jar",
            "What sadist in admin decided 15 minutes by car is close enough to walk? Especially in bad weather. \n\nAlso, just thinking of going through Pearson is giving me a headache. A worthy sacrifice for that malicious compliance.",
            "Well.  I know others will cheer you on but I also had a situation like this years ago (logistics and cost from an ivory tower bean counter)  when they decided I could return to the cheaper way of traveling (had to Oahu from L.A) I did NOT change back to my cheaper, trying to save money way.\n\nThey tried to write it like they were doing me the favor after they fought my cost saving measures.\n\nSo I (very sweetly) told them after careful reflection I has decided they knew best and would no longer book no refund, flights.  I would fly economy to Hawaii at the last minute as they wished and pay thousands more.  Each month.  Until I resigned.\n\n..and I did just that.",
            "It frustrates me that companies hire smart people that know how to make good decisions and then micromanages all the decisions that they make.",
            "You forgot the best perk of the City Centre Airport - fly arounds go around the CN tower. :)",
            "Sorry Excellent maliciousness!  Your post brought me back a bit...\n\nI am related to Billy Bishop on my mother's side, if this is the Canadian WWI pilot Billy Bishop.\n\nThe family story is he would polish his .303 bullets for his Lewis gun so it wouldn't jam as easily.\n\nOur family is very distant and fragmented and I am a bit of a black sheep but it would be so awesome if someone from Canada called me up and said Hey! Fred Hophead we are related!\n\nThen we would agree to not ask each other for money :)\n\nP.S. I am also distantly related to Bridgette Bishop, the first woman hanged at the Salem Witch Trials.",
            "OMFG I travel a ton for work and take a lot of Ubers. If someone told me I had to walk I'd fly to India (where our expenses are processed) and throttle someone. The irony is, I do walk a lot. If it's a mile, mile and half, as long as the weather is fine and it's pedestrian friendly I'll happily walk. But if some asshat told me I had to do that I'd be finding ways to do exactly what you did.",
            "I did some consultancy work part of which was running week long training courses. The company that engaged me were charging me out at $2k per day plus expenses. I flew from the UK to Delaware, and ran courses over two weeks. \n\nI submitted my expenses and they tried to remove the cost of wine with my meal as it's \"against company policy as per the staff manual\".  I swiftly pointed out I'm not staff and that in Europe we do things differently. Took a couple of emails and cc'ing the CEO but it was paid.  I made enough that I could as easily have swallowed the cost as I did the wine, but the principal was important.",
            "[deleted]",
            "If they were that obsessed with penny pinching I'm surprised they didn't force you to take the Union-Pearson express train.",
            "> as per company policy taxi/Uber is only for Pearson\n\nDid whoever denied your request ever explain why this was policy? Curious to know what happened for this policy to be a thing.",
            "I had a similar situation back in 2000.  I lived in Texas and was doing I/T consulting for a Federal Agency in Washington DC.  The company I worked for had just switched the travel agency that arranged all of our flights, hotels and rental cars.  Their orders were to save money whenever possible.  I regularly flew into Reagan National because it had convenient flight times and was just a metro ride away from our corporate apartment and that goverment agency I was consulting for.  \n\n\nThe travel agency decided that it was 74 dollars cheaper to have me fly into BWI (Baltimore).  I raised the issue with my boss (Company Owner) and he dismissed me saying do what the travel agency says.  So they had me fly into BWI.  This necessitated a 97 minute 125 dollar cab ride to the corporate apartment.  The malicious compliance occurs on Friday when I am returning home.  I depart the goverment agency at 11:30 AM to catch another 97 minute cab ride to BWI to catch my 3:30 flight back to Texas (next flight was 7:30).   So to save 74 dollars in air fare we had $250 in cab fares as well as 5 hours of missed billable time ($1,250).  The next week an email was sent to the travel agency directing them  to allow more flexibility to the consultants in planning their travel",
            "It has been such a breath of fresh air to move to a company that doesn’t scrutinize my expenses. You pay me to be smart, please trust that I’m being smart with my spending as well.",
            "If Ryan Whitney has taught me anything in life, it’s that Pearson Airport is one level above chemical castration in terms of pain and suffering. That being said, I’ve had the pleasure of flying in and out of Billy Bishop and thoroughly enjoyed the entire experience, and anyone visiting Toronto that has the option to fly through there absolutely should. I loved being able to eat dinner in town and then walk to the airport an hour before the flight time.",
            "“OP goes to war”",
            "You bit the bullet of actually being one of those people who uses Pearson just to bite back at the company, gotta respect that. I've gone over the border to airports in buffalo rather than going to Pearson to save time.",
            "I used to fly a lot for work. We had a decent airport in the metro but not a hub for any carriers, so there was usually a short commuter flight to one. Only a half-hour flight time which was much better than a 3-4 hour drive with heavy traffic, full parking lots, shuttle to the terminal, etc.\n\nHowever, one of the execs decided that we were all to get a car service to the hubs as the commuter flights were too expensive. The other road warriors and myself were not happy to have our travel time extended by hours at the start and end of the week, just to save $100 :(\n\nEnter malicious compliance! Two or more of us traveling together? We each need our own car! Driver was chill, make that tip 50%! Stop at a store to get beer for the long ride home? Hell, that was my dinner, better expense that, too!\n\nIt wasn't long before our travel agent got us a bulk deal that made the commuter flights cheaper than the car service BEFORE tips and other expenses :)\n\nPS: I'm pretty sure that one of the travelers and our (in-house) TA were making the sheets sing, so that may have helped get that deal done.",
            "$300 for 1 work car wash and clean checking in here. Rule said must keep car clean, this was only option. They didn’t like it when it came time to pay. I don’t make the stupid rules.",
            "Use that new note to re-request the previously denied Uber. Petty but puts the message across that you haven't forgotten",
            "I would have emailed back and said \"Oh, no no it's fine - I'll continue to take Pearson.  There must have been a good reason in place for those rules I had accidentally broken to have been implemented in the first place; especially considering how much trouble my Uber ride caused!  I don't want to cause more concern by continuing to use Billy Bishop.\"\n\nBut then, I'm stubbourn enough to lose some perks myself if it means the company loses more money for their stupid petty actions",
            "Having travelled to Toronto many times (into both airports) this is one of the few stories on Reddit I 100% believe.",
            "This is what happens when bean counters only count beans and don't bother to look at where the beans came from or how much it would cost to get them elsewhere.",
            "We make dollars not sense.",
            "Question from someone living on the other side of the Atlantic: is it normal for flights leaving from airports 45mins from each other to be going to the same place? \n\nFor us usually you have to travel 3+ hours to find an airport with flights going to the same destination.",
            "Who ever writes these policies needs to learn to add exceptions. They need to get programmers to write expense policies. \n\nAn policy regarding expenditure is aimed at reducing costs. An exception such as \"or which ever is cheaper and more efficient\" allows enough flex in the policy such that events described in the OP would never happen. The wording can be modified of course but the spirit is clear. \n\nFuck HR",
            "you could get a BJ and still fall within budget.",
            "I draw nearly endless amounts of joy from the irony that the very people whose job it is to save a company money are often the ones costing it even more because they're sad, little people who have nothing else going on in their sad, little lives but this tiny amount of power they wield, and so they wield it as much as they can.",
            "What's Billy Bishop like inside, anyway?",
            "I worked for an airline that had me on temporary assignment in Chicago in January. They refused to get me a rental car to get from the hotel to the office saying I should take public transit (at 4am). So I said I would drive up instead of flying and drive my own car. They agreed to pay for the mileage and put me in a hotel for an additional night.  It cost them much more than had they just let me rent a car - and I made a nice profit on the Mileage.",
            "Sometimes they need to feel the pain to understand.",
            "Well done Sir!!!",
            "That airport is awesome, I used to fly up on Porter Airlines for work quite a bit. Pearson sucks!",
            "Nice, it's almost like they were apologizing with that big budget XD",
            "I can't even get my employer to reimburse for mileage and gas for all the running around I have to do every week",
            "Back when I traveled for my job, my coworker and I realized that if, rather than fly out to appointments on Wednesday and back Friday afternoon, we stayed at our destination over the weekend, it cost enough less in airfare (Saturday night stay) to spend an extra two days there, and still save money. \n\nWe pointed it out to our boss, who took it to accounting, and got it OK’ed. so long as the total was less than the total with in and out airfare, they’d pay for the longer car rental and room and food. \n\nMy next job, I talked to my boss about it. She thought it was a great idea. This time, they’d only cover if the savings were at least $200. \n\nI had fewer opportunities to see places outside my schedule, and they paid a lot more for my travel. Lose/lose.",
            "Now make them pay back the $12 they stole from you, including interest",
            "It's so nice when they grow a brain!!!",
            "OP:  I love this example of MC!!!  Well played!",
            "Well done. Always great to see a change in company policy.",
            "I see so many of these where there's no reaction from the company, it's nice to see one notice the MC.",
            "When you play that Uno reverse card on company policy, love it!",
            "Billy bishop is great and one of the most convenient \"big city\" airports in North America.",
            "My son flew me and my girlfriend to Toronto for lunch and we used that airport. The OP didn't mention there is also a free ferry you have to take and I don't think it travels more than 800 feet. Was a very nice casual airport. Toronto is a very nice city.",
            "The obligatory chef's kiss 👨‍🍳 here. You played their game and they got burned. Looks good on them when you complied to their demand to not spend that $12 on the Uber. Would they've blinked an eye if you called a taxi instead? 🤣",
            "I seems there is a never ending stream of companies shooting themselves in the foot on travel budgets.  All to save a few bucks they spend thousands.",
            "Sometimes I'm terrified at the stupidity of people in charge of other people. This is an amazing MC.",
            "I'd rather pay the $12 myself to go to Billy than have to deal with Pearson.\n\nBilly is the greatest airport in North America, if not the world",
            "How on earth could they call a 15 minute car ride. walkable distance? Do they not have feet to understand how stupid slow walking is? 15 min at 40mph is 10 miles.",
            "My boss once saw me walking to the train when I was a youngin on the way to the airport and said “What the hell are you doing? You are paid by the hour get in a taxi and leave the office later.”  You needed that kind of logic over you…",
            "Is that the Island with the really silly short ferry ride? I was in Toronto for academic research and found this ferry by chance. Didn't ride it but stood there giggling at the worlds shortest ferry ride for ages. \n\nIt's hilarious.",
            "This is what we come for",
            "Expensive $12 lesson for your company. Well played.",
            "Make them reimburse you the $12.",
            "I flew out of billy bishop a month ago for the first time.\n\nI arrived early and was breezed through security so just sat there for two hours while seeing articles about how big of a shit show pearson was and still is this summer",
            "Getting to pearson in the winter from the downtown core, without using the Up Express, was  painful. 2007 PTSD vibes all over again.",
            "Wow music to my ears!!!!!!! I love the resolution at the end! You showed them that eating nice meals and seat upgrades still save them hundreds of dollars per trip!!",
            "Billy Bishop is one of my favorite airports. Granted it's been years since I was there, but was a very comfortable wait for my plane with no stress at all in getting to things.",
            "And most of the restaurants in Pearson are OTG, so those food receipts at the airport probably went up too.",
            "Kudos",
            "Awesome MC.  Clap",
            "This is almost wholesome malicious! Love it!",
            "There are premium seats available from Bully Bishop?",
            "Companies can be so relentlessly stupid",
            "Absolutely love this. This story also makes me miss Toronto. I used to go there so often for work before the global you-know-what. Our office was closer to Island, so I would usually fly in there. But I would fly out of Pearson because I preferred going through customs on the front end (I have Global Entry back into the U.S.) and I would just drink at the American Airlines lounge until my flight home.",
            "Pearson is the seventh level of hell",
            "Pearson is awful.",
            "Fucking clown town policy writers. It's so petty.",
            "Well done comrade.",
            "This is the way.",
            "It’s been a awhile since we’ve seen one this good. Kudos for keeping it short and sweet too 👏",
            "I just made this get to 1k upvotes have a good day",
            "r/antiwork",
            "When the bean counters forget to look at the size of the beans. Then wonder why their new policy is removing all the small beans and putting is far larger beans.",
            "[deleted]",
            "Here before this goes big",
            "Waahhhh! My company is not giving into my sense of entitlement!",
            "That's awesome!",
            "I’ve just moved into the neighbourhood, 5 minutes by foot from Billy Bishop. Good luck making me go to Pearson instead — no way I’m doing that, given the choice.",
            "TIL, despite living in the GTA from 1972 to 1990, that the Island has commercial flights and not just general aviation.",
            "Fucking petty tyrants, I swear.",
            ">A nice meal\n\nI tried to buy a pre-made sandwich and a mocha at billy bishop, it came to $20. They used to have free drinks and chex mix.",
            "Well done.",
            "Why is Pearson airport so bad?",
            "God, I really love Billy Bishop Airport. Any chance I have to skip Pearson, I’m taking.",
            "Billy Bishop is the best bet if you can do it. But also they should not expand it. It’s amazing as is.",
            "Billy Bishop is 10x better than pearson.\n\n\nEsp free cookies and bottled water",
            "i just do not get why the billings team never does a checkup about the costs of their proposed alternatives. its like 5 minutes work. this is not the only kind of this story on this sub. i just do not understand",
            "I literally learned about the island airport today in a Not Just Bikes video",
            "I've flown out of that airport a few times.  It is SO much easier than YYZ Pearson.  Haven't found those amazing differences in ticket prices, but when you're going to downtown Toronto itself anyway and not one of the suburbs or neighboring towns, YTZ Billy Bishop is BY FAR the best airport option!"
        ]
    },
    {
        "post_id": "omxckp",
        "author": "jjorgesfousa",
        "title": "Manager wanted everything I do during a workday written down. Request granted",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/omxckp/manager_wanted_everything_i_do_during_a_workday/",
        "score": 20365,
        "num_comments": 650,
        "created_utc": 1626636125.0,
        "selftext": "Long time lurker first time poster.\n\nEnglish not my native language, mobile bla bla\n\nSome context. Working in an outsourcing company. Before I joined job there were 2 people doing my job, both left before I joined. I was alone doing the job of 2 people. Weekly reports being sent to client \"head\" and client would visit job site once a year. \n\nSo here goes. As a means of control and reporting there a general mailbox to where client should send all requests that needed to be addressed. Had to deal with 30 to 40 different people from the client side plus client\"head\". They didn't give a shit about said mailbox, would always email my inbox ignoring said general one almost always. \nSince I was alone doing the work of 2 people, I was almost always behind on the workload and would get the idiots on the other side constantly complaining to the client \"head\". Who in turn would complain to my managers, how is it possible that OP can't deal with 7 or 8 daily emails and be behind on his work. Weekly report stated I was only getting 7/8 emails from the client a day, completely ignoring the fuckin phone, personal inbox, Skype chat which were the ways people were contacting me every day. \n\nSo client \"head\" complains to managers and escalates me for being a lazy idiot that can't even handle a handful of emails a day. \n\nManagers setup meeting to grill me. OP  you always look so busy and you're only getting a handful of emails a day and constantly behind on your work. How is this possible? Client isn't happy and you either improve dramatically or client wants us to replace you. I explained that general mailbox wasn't the only thing I did, mentioning all other means through which client idiots were requesting things. \nSo solution to show client \"head\" what was being done, I was told I needed to register on an excel sheet everything, EVERY THING I did during the day. I asked for clarification, you mean emails and calls right? No, no EVERYTHING. And email the excel at the end of workday.\n\nSo here goes my malicious compliance. \nI did exactly what I was told, wrote down everything I did during the workday, even including bathroom, smoke and coffee breaks. \nClient writes on Skype, I write down timestamp when client asks for something and timestamp of each and every reply, \nAll adding to an excel at around 500 lines every day with my personal favorite of adding a line at the end \"time wasted to fill in sheet, 1 hour\"\n\n1 manager laughs when he sees my full compliance, other one not so much but knows can't do shit cause I did what I was told. A few months later when client \"head\" visits tells me he fuckin loved it.\n\nWas told to stop doing it on the 3rd day. They were now aware of what I did during the day :)",
        "permalink": "/r/MaliciousCompliance/comments/omxckp/manager_wanted_everything_i_do_during_a_workday/",
        "comments": [
            "I did something similar recently. I was leaving a job and the boss wanted me to draft a \"how to\" document for my job duties. It ended up being a 40 or so page document titled \"The Book of Secrets.\"",
            "Great. Only solution to such silly requests.",
            "Lmaoo I can imagine the excel sheet filled with bathroom breaks with specific details \n\n\"5:00 pm : Went to the bathroom, took a massive shit, used three wipes, left stall smelling nice for next occupant\"",
            "A few years ago,  someone from the Department of Clever Twats told me my job was being transferred to his office a hundred miles away, I was getting another job in my office but first I had to train my replacement. Oh, and it's got to be done in the next two months.\n\nThen I told him I was having an operation next week and would be off for six to eight weeks.\n\nSo he decided I had to write a guide to what I did (Inward Shipping), how I did it, what I did when things went wrong, and - my favourite bit - what to do if something happens that's never happened before.\n\nChapter One of the guide - What To Do In The Event Of A Bear Attack.",
            "Lol, I feel like this is a fairly common thing I see on this sub. It’s crazy to me that people in charge still think this is a good idea.",
            "I like this, but I have to say your time filling in the spreadsheet wasn't wasted.  They really didn't know what your workload was, once they did understand, they asked you to stop filling in the spreadsheet.  The statement \"time wasted to fill in sheet, 1 hour\" is a brilliant one, it showed them you were telling the truth.  Excellent work, well done.",
            "My boss is obsessed with me making a checklist for end of year things even though what I do has nothing to do with what she does. It gives me more work. A few years ago when I was asked to do this for the first time, she asked if it was helpful.  I told her I am sure it was helpful for HER. So this year she asks for checklist again and I wrote every tiny step.\n\n\nCreate certificate template \nUpdate template \nPrint certificate \nPut in document holder\n\nCreate diploma updates for copy center \nSend to copy center \nRetrieve diplomas \nGet CEO signature \nRetrieve from CEO office\nGet faculty signatures \n\nAnd so on\n\nI also wrote very detailed onboarding lists (end of year is at same time as beginning of year in graduate medical education)\n\nI asked if she reviewed my list. \nNope. It’s soo long 😂\n\nNext year I’m telling her I’m not making another check list. I know my job.",
            "This makes me chuckle, because one of my prior help desk departments (which operated on Cost Recovery) *operated like this*.\n\nWe all tracked our time to at least the 5 minute interval, if not more fine-grain than that. We spent a half hour a day inputting all our tracked time into a billing system. Things like official legal break time were \"billed\" internally to our own department as a cost of operating/having employes, and the rest was either \"lost money\" e.g. when we had a departmental meeting, or needed to clean up our cubicles after a project ended, etc. or else it got billed to a client with explanation of what that 'work entry' was for.\n\nSo - yes. I documented that I spent 3 minutes making coffee, 1 minute opening Access and logging that time, 5 minutes peeing, 4 minutes ~~asking~~ answering a user's question because they found me in the hall leaving the restroom, 2 minutes pouring a coffee and saying good morning to my office-mate, 2 more minutes entering time, and 1 minute logging into email/etc to begin the day.\n\nOur billing system's minimum time increment was 0.1 Hr (6 Minutes) so sometimes if you were studious about logging and entering time honestly & accurately, you could actually recuperate some of your \"lost hours\" during the day by adding up one \"bonus\" minute here, one there, in doing so saving your biling percentage rate for the week!! (We had to hit about a 65% billable ratio for break-even on our own positions/benefits, to keep the department from turning into a net loss.)\n\nP.S. This client?\n\n>  5 minutes peeing, 4 minutes ~~asking~~ answering a user's question because they found me in the hall leaving the restroom\n\nYup, they got billed for 6 minutes - They shouldn't have asked a help desk question, otherwise it would've been \"my time\" costing me money!",
            "Lol, I did a similar thing once.\n\nI was transportation manager, but they had fired my Director and dispatcher without replacing them, so I was also doing those jobs. These aren't jobs you can normally schedule. You just deal with problems as they arise, and those problems ALWAYS interrupt the things that you can schedule. For instance, a dispatcher could do nothing but schedule loads for  2 hours and be done for the day, but with interruptions from drivers, customers, broken down trucks, pickup scheduling issues, etc., it might take all day.\n\nGeneral manager wanted my schedule. So first, I just gave a general breakdown like \"2hrs dealing with drivers, 1hr talking to customers, .5 hours dealing with truck breakdowns...\" That list alone was 2 pages long. It included a note that I was interrupted for 40 minutes by the drivers I managed while simply logging my time.\n\nGM didn't like it. He wanted a schedule. So I gave him one. I just blocked out approximate chunks of time that I spent on various issues. It was like 23 hours a day, 7 days a week. (It was an exaggeration, but I was working 80-100 hours a week at this point and included my 40 minute one-way commute in the schedule, so it wasn't that far off.)\n\nGM didn't believe that that was correct, so he sent me back to the drawing board.\n\nSo I gave him a 50 hour (give or take) per week schedule, basically just by cutting my previous schedule in half. \n\nGM accepted that until the next day when I ignored customers and employees who called me outside of the hours on my schedule.",
            "Lol I love it!\n2 years ago,  I was diagnosed with cancer (I beat it!) , so I was off for 6 months. The assistant controller had to cover for me. As I was training her, we wrote our \"cheat sheets\" and task lists. Half way through her first day of training,  she asked me how I got everything done ! She was appalled at my work load. They tried to bring in a temp, but she was overwhelmed in the first week. \nI came back to a party, a promotion,  and a pay bump :)\nAnd I'm still here, with a new controller,  new team and even VPs call me their subject matter expert.",
            "I hear about this so often. It's like middle managers all take How to Manage Poorly 101.\n\nWorked a job years back with a guy on our IT team. He was the network admin and totally overworked. Of course he wasn't just the network admin, he was also tasked with rolling out all the client machines and the servers, oh and he had to take quite a few helpdesk calls to insure developers, no, it's not the network. The dude was in a constant state of being behind. So what did management do? Well, of course, they said, \"why aren't you getting more done? You need to log your time for us in 15 minute increments.\" He set 15 minutes alarms on his phone and each time one would go off, he would stop what he was doing and write down a few lines about what he was doing. He just used email and he told me after a few days of this harassment that they asked him to stop for the same exact reason your managers did. \n\nAnd no, they didn't hire him more help. That was honestly one of worst shops I've ever worked in.",
            "Perfect MC. Bonus points for doing it in Excel. *chef kiss*",
            "Yeah I did that, for 11 months. Pretty sure they win tho, very easy not to read it.",
            "I was in an IT program at a local college.  One of the classes was Computer Room Maintenance.  This was a way for the college to have a person babysit the computer labs for free.  There was nothing to be learned in the \"Computer Room Maintenance\" class.  \r  \n\r  \nWe were given different things to be completed in the lab.  Each day we were required to keep a log of what we did in the class.  For example I cleaned all the keyboard and mice for all 32 computers.  The instructor told me I needed to be more detailed in my logs.  Fine my next task was to insure the icons on the desktops were both correct and in the right position.\r  \nThis is about what I wrote for the first icon on the computer screen.  \r  \n\r  \nMy log read \r  \nI started my log.\r  \nI looked at the top left icon on the monitor screen for computer number one.\r  \nI updated my log.\r  \nI looked at the location of the top left icon on the image of desktop.jpg.\r  \nI updated my log.\r  \nI compared the location of the top left icon on the screen with the top left icon with the image of desktop.jpg.\r  \nI updated my log.\r  \nThey were the same.\r  \nI updated my log.\r  \nI took no action as the icons were in the correct location.\r  \nI updated my log.\r  \nI looked at the second icon from the top left icon on computer number one.\r  \nI updated my log.  \r  \n\r  \nI did this for the full 50 minutes class.  After each action I updated the log.\r  \nThe log was many pages long.  I did not make it past the first computer.\r  \n\r  \nMy next time I was babysitting the lab the instructor told me to go back to how I had been reporting my time.",
            "Great malicious compliance, for longer term working with things like this I would recommend just forwarding personal emails to the mailbox when you get around to it, as for Skype and phone, get the info you need, jot it in a new email and send to the shared mailbox cc the person in, then just work on the mailbox in order, idiots who emailed you end up lower on the list, I do the same thing but emailing a ticket system.",
            "* clocked in\n* wrote in journal that I clocked in\n* turned on computer\n* wrote in journal that I turned on computer\n* logged onto email\n* wrote in journal that I logged onto email",
            "See, I had the same thing happen in my old job - kept telling management that 70& of the calls I took were not related to my job and were actively reducing my ability to do my job (handling inbound sales over the phone), and that they should get a general customer service / reception desk. Bear in mind that if I wanted to progress in the company I needed to make more sales (even though my conversion rate was excellent for the sales calls that actually *did* get through to me).\n\nManagement said they didn't believe me, so I spent 6 months logging and timestamping ***every single call that came through to me**.\n\nPresented my evidence to management and they accepted what I said, but refused to do anything. Fortunately I got a new job in a different industry around the same time and haven't taken a single work phone call since.",
            "I did something similar about 15 years ago when my employer wanted me to keep an hourly log. The one that got me fired? \"Contemplated suicide, but didn't want to give [my manager] the satisfaction of seeing me taken out in a body bag.\"",
            "Had a situation similar to this about 12 years ago.   Manager's admin kept bitching that she could do her job better than me, so manager had me make a to-do list for my upcoming afternoon.\n\nIt had 14 items on it, everything from inventory issues to sweeping the warehouse.\n\nAdmin claimed the entire list was bullshit and went home.\n\nThe next day, admin came in to find the list taped to her monitor... with 13 of the 14 items checked off and initialed by manager.\n\nShe never bitched again.",
            "This is when you negotiate a raise. And walk away if they don't do it.",
            "Did the same at a company as a FTE. Manager wanted everything, but then proceeded to argue about the time I put down for keeping track. Asked him how he thought that was possible. He still argued he wanted less detail. I replied, without detail, there is no point, so either I am doing it with detail, or not. He chose the \"not\" option. Created a few named buckets, wrote a script to randomly make up any given week for CSV output, and imported it via cut and paste.",
            "I did the same think, only built a access database, and output to pdf at the end of the day.  Wound up with 6+ pages every day for the boss to read through. \n\nWith the click of the mouse it would automatically input the date/time... Down.to.the.second....\n\nHR told me I didn't need to be that precise.  I told them I would rather document everything since my boss was trying to fire me, only in more politically correct terms.  It was automatic with a new record, and didn't take any time for me to input and helped chronicle my day for review. \n\nLong story short, I wound up quitting after she tried to fire me.  She was eventually forced to resign about a year later once they realized she was actually not well suited for the position and given the option \"quit or we fire you\".",
            "One of my former employers had a similar thing. \n\nEveryday we had to write a paper on what we were doing every hour of the day, how we planned to improve efficiency, and why we shouldn’t get fired. I only lasted 2 months before I left. Couldn’t take it.",
            "It's a pain in the butt for employees for like a week, but every company should do this for a week for all employees to help them build a process document book: a big three ring binder that explains all of the steps for any repeatable task in the worksite. This helps with training replacements, communicates safety training, and gives a clear expectation of what is and is not your job.",
            "1. creating document to log activities.\n2. logging document creation\n3. logging document creation log\n4. logging document creation log log\n5. lunch",
            "I had one of these \"no lateral decisionmaking, log literally everything you do, yes, even the logging itself, stop asking for clarification\" requests come in on a job I wasn't especially keen on keeping.  My log was more or less:\n\n1. Logged into system.\n1. Logged logging into system.\n1. Logged logging logging into system.\n1. Logged logging logging logging into system.\n1. Logged logging logging logging logging into system.\n1. Logged logging logging logging logging logging into system.\n1. &etc....\n\nRepeated and extended all day to the exclusion of almost all else until the final log entry for the day before I stopped and turned it in contained the word \"logging\" around 1500 times.\n\nI later had to pull overtime to log my backlog (the word log *still* doesn't sound real to me) the various distractions I had to attend to, which were my original duties, before my job became almost full-time logging.",
            "[deleted]",
            "The last job where I was asked to document my daily routine, I (along with half the staff) was let go.",
            "\"time wasted proving I'm not wasting time: 1hour\" baller move op",
            "This is great! Great MC. This never happened to me but I know of people that had similar situations. Honestly I don’t t think it’s the clients fault half the time, the employers never seem to do a good job at disclosing that there having staffing issues for obvious reasons.",
            "I recently left my last job because of a similar situation. They had to split my responsibilities among 4 employees…",
            "I LOVE this.  I've done something similar in the past when given unreasonable directions to document things (e.g. former manager with no technical skills asked us to run every SQL query we planned on running in production past him before execution... sent him hundreds of line of code he couldn't read which slowed work to a halt).  As to time though, I've long since learned that keeping my own (high level) tracking of activities, and login/logoff times to be a godsend.  Too many times I've been challenged on what I am doing or how much time I am owed and have been able to categorically explain everything - I don't know how anyone can not afford to do the same.",
            "I'm a leader who would like to think I have perspective for those I manage.  When my own leaders express unrealistic frustration about front line productivity I politely suggest they do the job for a day to create a baseline for production values. We all know they can't do it.",
            "Yaaas. Gooood.\n\n\nThis happened to me as well.\n\nThey would ask me what I would do daily as I was on the computer all day (the evil manager, EM, brought this to everyone's attention).\n\nSo I did and put, as well, who's responsibly it was. 50% belonged to EM.\n\nI then said \"moving forward I would not take care of her responsibilities as she has a lot of time because it takes her 1 hour to go for her lunch, she takes 1 lunch to eat and goes home early by 30 minutes or an hour.\"\n\n\nWell they asked her for a daily as well and she wrote down like 4 things and they supposedly take all her time. I raised my hands and said \"on line #15 you can see I take care of those four and have it done within 12 minutes\" she got red and angry.\n\n\nWell she kept complaining I had a lot of time that I still need to do her shit. Lol I nope. I stop and now she HAD to work 8 hours and a 30 minute lunch and she had to clock in and out/report to the main CFO. Lol\n\n\nI then left 2 months later (for a better job) and I heard she only lasted like 3 weeks and quit. That her own responsibilities were too much and she had to be paid more/ deserved more. Lol they just let her quit and she didn't get unemployment so no help during COVID 🤣🤣🤣🤣🤣🤣🤣",
            "If you have to tell an employee to write down all he does, you’re an awful manager. Managers are supposed to get problems out of the way so the people that do the actual work can do it.",
            "Clocked into work.\n\nWrote down that I clocked into work.\n\nWrote down that I wrote down that I clocked into work.\n\nWrote down that I wrote down that I wrote down...",
            "This didn't start out being quite so long, and my apologies for the length.\n\nI had the same problem at my last job. I had a controller who did not like me and wanted me gone. Thankfully I did not report to her. To call her a control freak was a major understatement.\n\nAs an example, her employees were required to sit in the lunchroom until the stroke of 8:00. At that point, each employee had to clock in on the same time clock within a very short period of time. She provided them with a work list every day of what they had to do. She would check on them several times a day to see where they were on their work list. Needless to say the turnover in that department was astronomical.\n\nMy boss, however, was really cool, but knew what to kiss and when.\n\nAfter a short time working there, I was asked to account for what I was doing during the day. My boss asked me to send her an email every day and let her know what I had done.\n\nI did exactly the same thing you did. I detailed every contract I reviewed, every phone call I received, every time I helped with a proposal. Every. Stinking. Thing.\n\nThe good part was I could copy from week to week and pretty much cover the same stuff.\n\nAfter about a week of the daily emails, she told me laughingly that she only needed a summary on Friday.\n\nAfter 2 years, they realize they weren't making the sales they needed to keep our head count and they had to cut someone. That someone was me.\n\nMy boss gave me about 5 months notice so I could start looking for another job.\n\nOn my last day, evil controller brought the gal she brought in to replace me and to meet people, not realizing I was still there. (Apparently she had managed to combine my head count with someone in her group). The new girl looked absolutely shell shocked had been there only a week. I knew she was there, but they never asked me to train her.\n\nI introduced myself, and watched evil controller cringe. That was fun. The most fun I had though, was as I was leaving my boss's office for the last time, I turned to evil controller, gave her a big hug and told her what a pleasure had been working with her.\n\nOh, one final detail: Evil controller had major OCD and hated to be touched. She even had a \"guest pen\" for others to use.\n\nOne day she asked me if I had a guest pen on my desk. I handed her mine and told her that I had licked it off real good.",
            "I did something similar, (I also do the work of multiple people) I wrote at the bottom that it was impractical use of my time and that the time spent logging everything I did was taking away from my actual work. I wrote how long time was spent logging things too.\n\n\nIt stopped shortly after that.",
            "[deleted]",
            "This is every advertising agency I’ve ever worked for. They’d withhold expense cheques if you didn’t compete timesheets.",
            "I admire your dedication to the MC. Screenshots of the Skype chats would have made your spreadsheet so much longer. Or copy paste the convo.",
            "Hey had a similar thing in my company, ended up showing them that I worked for 11 hours one day, and I'm only being paid to work 8, so I did what I was supposed to and stopped working after 8 hours. I don't give a shit if I'm needed today, talk to me tomorrow.",
            "Line 52: \"Took a dump, it was a little runny, might need to add more fiber, will update tomorrow's results.\"",
            "I use to work on a tube mill as the sizing operator and constructed a book along the way of every size and gage we ran and where is was sized out of each station, the saw and little tricks and reminders of the ins and outs as they occurred, everyone knew I had this book and the other shifts would constantly use it as a guide, when I left I took the book with me for no other reason then spite. Got contacted 2-3 months later by the company offering to buy it back or me to come back as a consultant. Ended up getting $7500 for the book after some negotiations, made me quite proud!",
            "Something similar, with the latest twist is something our offshore team dreamed up, calling it \"Productivity Tracker\". It's built in PowerApp/Sharepoint and exists as a website for data entry.\n\nHas not worked correctly yet.",
            "Your company needs a ticket system  \nNo work without a ticket  \nStop the email requests, tell them to create a ticket (or you create a ticket from the request)  \nthere also has to be a CMDB in the ticket system",
            "My ex-employer did this during COVID. Since they recieved a PPP loan, they were required to continue paying their employees, even though they were on lockdown. My friends who still work there wasted an hour or more a day detailing every little thing they did.\n\nMy ex-boss is a terrible migromanager. She literally calls \"mandatory\" meetings every month or so, where she requires everyone to go in and explain how theyre using their time. She thinks she's paying too much for the work they do, and in turn has to pay them more to explain that they aren't. \n\nGlad I got out. I make $9/hr more at my current job, and have much more time to actually DO my job (versus the time I spent explaining that I was, in fact, doing my job.)",
            "Clocked into work.\n\nWrote down that I clocked in.\n\nWrote down that I wrote about clocking in.\n\nWrote about writing that I clocked into work when I wrote about clocking into work...",
            "That reminds me of one of my previous jobs, with a frustrating manager, to say the least.\n\nI was a software developer working on five projects. The only one on more than two projects at a time and I managed to be on time on all of them! \n\nI was working from 9 am to 11:30 pm and even so, this was because the last train to go home was at 11:45 pm.\n\nOne day, the manager tells on the internal chat \"Can you please let me know what you're working on every day?\".\n\nI was not happy about it but ok, I'll do it.\n\nSo I start to give him daily updates with all that I did during the day and after three days, he asks me \"what are you sending me daily updates?\".\n\nI wanted to ask if he had schizophrenia or something but I just said \"because you told me to.\"\n\nHe replies: \"I don't need it daily and I just wanted to know if you were slacking off\".\n\nInstant anger.\n\nI asked what he meant, knowing that he's the one who gave me the five projects that he knows are on time so I don't see where I was slacking.\n\nHe tells me sometimes, he wants to talk to me and I'm not at my desk, to which I reply I have a strict schedule and I take a bathroom break at 11 am and one at 4 pm. Other than that, I go to lunch at 1 pm for an hour. And that's it so I found it odd that he couldn't see me at my desk.\n\nI sent a copy of the chat to his manager and we were told to communicate only by email and that his manager should be CCed on all of them.\n\nMy manager became super nice from that day on, what a coincidence.",
            "Can’t say what job I did (C.A.) but I was called out on the same thing. Get paid X but they only see Y. \n\nSo I wrote down everything, every hour. When they saw the 1am, 2 am, 4 am phone calls, emergency meetings that lasted much more than a few minutes and the drive time I hadn’t billed against them (did after this), plus all the work I did at home while not at the office, they shut up quickly. \n\nBut didn’t matter, I renegotiated my contract after the review and got compensation for what I used to not bill them for.  Never again was I asked and the original person that questioned me, avoided me like the plague.",
            "For anyone doing this in the future Ctrl+Shift+; is the excel shortcut that puts in time stamp of the exact moment that key combination is pressed.",
            "Outlook Rules are your friend. Setup a rule to move any email from X client to general mailbox. It would help at least.",
            "I did this minus the time to fill in and my Manager loved it. Used it as an example of great time management....face palm.",
            "My wife's boss just did something similar, or rather her ex-boss. She gave her a week notice right after her request. And my wife already has a better job lined up in a week. Her boss started crying and told her she'd call her if she had any questions on the last day.",
            "So I had a pretty similar situation but, upon presenting the log to my bosses after a week they called me in for another meeting with the main boss to ask a lot of questions about how long I had been doing those things. I was so nervous that they thought I was wasting time but as it turns out they didn't realize that people from the main company had been putting their work off on me. The reason we met with my bosses boss is because apparently there was a few people that had been getting paid to do very little as they were putting stuff on me...this all resulted in some serious procedure changes regarding workflow (that I had requested  to start months before) and one of my bosses got a formal write up for not noticing.",
            "I was a subcontractor for a number of years and the contractor (big blue) demanded that I log my whole day because I couldn’t possibly be filling a full 8-hours or more.\n\nI logged five minute blocks except where a task would take more and then I logged that period. \n\nI also logged my mandated breaks, lunch and bathroom breaks.  I also made a point of noting when I was not able to take my mandates breaks or lunch because of clients preventing me and that I was not claiming overtime for them. \n\nThe great part was that I also logged time required to keep the log. That amounted to about four hours a week. \n\nDumb big blue manager ordered that I send this log at the end of the week to him AND the client. \n\nThree weeks and I was told I didn’t need to do it anymore, just use our internal ticketing system as I was.",
            "I have to do that on my timesheet. Every. Single. Freaking. Day. The amount I hate doing it exceeds comprehension.",
            "I once did this with the owner of an IT msp company. He tried to act like I didn’t do much so he wrote down responsibilities on the whiteboard and had every technician go up and draw lines from their name to their responsibilities. \n\nI was the service manager so obviously I went and drew lines to practically everything and every contest he made was met with proof I was doing it. \n\nOwner stopped talking about the whiteboard and moved onto “our next business moves”\n\nDid I mention he paid me the same as the guy answering phones? Our receptionist. \n\nYeah I left that job.",
            "Had an upper manager pull this on me once, told me that each week I had to submit a list of everything I worked on each day and break it down to 15min increments.  I walked into their office that friday and dropped 50 pages of text braking down not just what I had done that week but the two weeks prior. Even fully transcribed meetings from memory, along with the meeting I had with them that started this. Following monday I was told, \"this isnt neccesary for you\", I know that didnt read the whole thing either.",
            "Half of having a job is making sure people know what the fuck you do",
            "I did something similar to show my former employer what I did... I quit.\n\nHe literally had to hire two different people to do my job, plus he got stuck covering all the local government bullshit I had been previously handling.",
            "Someone tries that on me when I was at an old job and when they told me to write shit down like that, u told then don't bother me for anything other than the building being on fire so you can get your report.\n\nGot to around line 460 or so and the person that charged me with the task thought I was making shit up until I got to the email strings that was forwarded along with the report.\n\nFor the record, fuck you sam...",
            "previous workplace, i said during the busy season i did the work of 4 people. Boss laughed saying what i didn't wasn't that hard, true, but to do it all at the same time was the trick. Had a bit of a falling out, they refused to give me a pay rise, went to where I was offered nearly double, much better working conditions.\nFound out later, I was wrong, wasn't 5 people, only 4, they hired 4 people costing them more in wages than just giving what I asked for. Met the boss later, mended that bridge, he admits I was right.",
            "Work an email box that your productivity is counted though, but people keep sending stuff to your personal box?  Don't worry, the miracle of e-mail forwarding has you covered!  Forward it to the box it should have gone to in the first freaking place, then revel in having your work counted when you complete it!  Try it today, it's built into nearly all modern email programs and systems!",
            "So OP was already behind so idiot manager have OP another useless task to do - logging all tasks.  Management at work.",
            "My current job, I’ve managed to figure out where all the files are stored or hidden on our department folder system. It’s a complete illogical mess and I don’t know who thought this made sense. I didn’t create it, I just spent time working in it and adding stuff over the years. My manager now thinks I made a mess of it and just turns their brain off. I know when I eventually leave, I’ll be blamed for the existing mess.",
            "I love this so much and sounds just like something I would do to. Haha.",
            "Awesome good for you",
            "Beautiful.",
            "Haha I did this once. Lasted 2 days before the manager said don't worry about it",
            "Oh hey my job has me do that. Except instead of an excel sheet, we use toggl, for time stamps and project categorization. They say it’s so they can check how long I’m spending per project, I guess.",
            "Cosby Impressions",
            "This happened with my previous employer, I even added excerpts for \"updating time log 1 minute\" after every task.",
            "That's not malicious compliance.  That's just compliance.",
            "Glad it worked out. Generally speaking I think a better approach is to talk to your managers about how your performance is being measured based on the requests in the mailbox but are getting many more requests through other channels. Proposing to more heavily enforce only doing work that comes through the official channel (the mailbox) with rare exceptions of the **HIGHEST** of priority emergencies. After approval from managers, announce it to everyone on the client side that any other requests will be told to go through the mailbox, and be a hardass about it. Slack message, email, phone call, tell them explicitly and clearly it will not be done unless they send it to the mailbox. \n\nIt may not be work for everyone in every situation but most managers I've dealt with would gladly support the idea of enforcing pre-existing standards that are reasonable especially if it makes their lives easier, your life easier, and leads to overall better accountability.",
            "This is when you setup Outlook rules to forward emails to that box.",
            "Me.\nTell user to email general mailbox as I'm not able to assist if he emails me directly. \n\nTold the same thing to the next 3 customers. \n\nWhen mailbox email came I told them to reboot pc.\n\nIf i got a follow up I requested to clear cookies and reboot again.",
            "\"Had to run to the bathroom, I knew not to eat that enchilada but i couldn't resist the sweet siren call. Was in there 20 minutes\" 😆",
            "Had a senior analyst (who I didn't technically report to ask em to do this.\n\n I hung up on them.",
            "This isn't malicious. This is what they wanted you to give them, so the manager has ammo to go back and tell the client to lay off or pay more. Also, in the future, avoid negative wording like \"time wasted\". That's the stuff that will come back and bite you. If your lucky the manager will re-org how the client has access to you as they are drawing too much of your attention.",
            "All these “managers” and OP is doing work of two people. SMH, typical",
            "I was asked to do this recently and I’m a manager in my department. I almost screamed at my director how do you not know, all of my work comes from you.",
            "Had the same thing happen at my first job to my boss and me. We wrote very dramatic logs. Lasted about a week.",
            "I had to do one of these for some kind of efficiency program. \nBefore each line of work I wrote down, I added a line for getting out this paper and pen. Then, after the line, I added time for filling out this paper and putting the paper and pen away. \nMade it look as ridiculous as it really was.",
            "I did this one time. The list went as such.\n\n1)clocked in\n\n2) wrote note about clocking in\n\n3) wrote note about a note about clicking in\n\nAnd so on and so fourth.",
            "I once had a guy hired in over me and he wanted a daily log of my activities. I created an excel spreadsheet and logged every single thing I did minute-by-minute, including listing the minute it too me to update the log... every single time. The first day was like 6 pages printed out. After a week he told me he didn't need it any longer.",
            "Did something similar at my last workplace. Every few years they would change the timesheet rules. Well they wanted to get super specific and even record if we had to go to our supply closet to get something. \n\nAfter 2 weeks of people entering a general time code and \"walking to meeting room\", \"refilling water/coffee/tea\", \"emptying garbage bin\", etc. They changed the rules real quick. The best was our group started recording \"PM/management stopped by desk to chat\" they didn't like having to approve the time they spent talking about random things that kept us from working",
            "This happened to me at my old job. I was finishing my work too fast so they assumed I wasn't doing all my work. Did the same thing here but the manager wanted to give me more stuff to do. Did all that stuff too. More complaining. Slow down on tasks they could be neater, ok. Two days later \" why are these tasks taking so long?\" Ok. I started writing down everything she said, because she said I forgot stuff I never heard about, it never made sense. She'd call me and angrily tell me to so something one way, and two hours later come to my desk and ask me why I'm doing it like the way she asked.  \n\nShe called a meeting when I made an actual mistake once and grilled me about everything I did during the day and how she's always calling me catching mistakes. I had my daily task book with me with notes on every email and phone call and the only mistake I made was the one I notified her about and I had witnesses and evidence every other complaint she made was completely wrong. What happened? Nothing. Never apologized. 25 phone calls and 30 emails a day from her quizzing me on random shit and asking about projects I wasn't assigned to and didn't even know about and I finally quit. The management was so surprised why, even though I told them about this and I was the third person to quit thats position in three years. For some people nothing you do is good enough. They finally investigated her after the person who replaced me quit and found she spent almost all day spying on employees, timing bathroom breaks, and asking employees to watch each other to make sure they're working and report to her if anyone makes a personal phone call or goes to the bathroom too often. Part of the reason they found this out was because she made us all write down everything she said.",
            "Holy shit this sounds way too much like my husband. If I don’t write down what I do during the day he becomes upset that I’m doing ‘nothing’ all day. It’s exhausting. \n\nBefore the Reddit army comes to tell me to leave 1-I’m trying therapy first and 2-if that doesn’t at least help, I’ll work on getting out. I’m completely financially dependent on him  and we have children so it will not be simple.",
            "This was a problem where I worked years back. Bosses eventually told us \"Tell them to send write a ticket. Do not work on anything without a ticket.\"\n\nSome of the employees were really annoyed with us, but they couldn't complain because it was a fair system. Everything gets documented, at least a little. Not to that spreadsheet detail, but every work request. \n\nNow I wouldn't work without a ticket system no matter what.",
            "I have deadlines in my job, and a few days ago a coworker asked what was my progress. So I told him: I already have a deadline, and that's enough info. If the boss wants to micro manage me, tell him to go grab a chair and sit beside me.",
            "I haaaaaaaaaate untrusting management where you feel like they’re breathing down your neck, forming an “us vs them” environment. It’s so stressful and exhausting. Why are they so accusatory and obtuse? There has to be nicer ways to confirm your employees are doing work",
            "Quit your job or change to a costumer self service. Reports should not be created manually.",
            "That was funny thought, i would be surprised if Manager and head? wasnt satisfied at all.",
            "10:00 AM: Cosby impression",
            "I have to track on what projects I work on at what time, so at the end of the week I usually put 4 hours into „tracking all the shitty project numbers down and putting them into this shitty Programm for you guys to look at some random number)",
            "This sounds like my job, lol. I’m glad they finally saw your workload. Our leaderships advice? Stay an extra hour a day. >.> I’m glad I’m on my way out ASAP!",
            "logged in...wrote down that i logged in...wrote down that i wrote down that i logged in..",
            "Or it could possibly look like this...\n\nI wrote a note. I wrote a note about writing a note. I wrote a note about writing a note about writing a note. I wrote a note writing about a note writing about a note writing about a note.\n\n...and so on.",
            "Yep. Did that one too. Boss complained about my bathroom breaks until I offered to take a picture. That shut her up.",
            "The extra power play? A sheet starting with \"I clocked in\", then filled with \"I wrote down that I clocked in\" followed by \"I wrote down that I wrote down that I clocked in.\" etc.",
            "Every year I get asked to list my job duties, there are 2 people in my position as well. Important, busy job. Anyway, I'm the longest hire for this role. I have built connections, become very knowledgeable about things outside my role, and my name is dropped within other departments so I get stuck with work related things but not the other 2 \n\nSo we all turn in our job duties. Vastly different. LOL.\n\nMine is all color coded for daily, weekly, longterm.  I had 3 pages, one partner had 5 items listed, another had a paragraph. \n\nMy boss every year is like show them the ropes, get this workload off you...and I do. BUT the people who reach out...they come to me NOT them.",
            "Incompetent managers like these are never good to work for.",
            "I worked at an accounting firm and we had to explain everything we did in a day in 6 min intervals.",
            "I once worked at a place where top management gave this motivational speech- \n\n\"This is such a good job that if any of you don't do it well we have three people waiting in line to replace you.\"\n\nThat top management did not last very long, thankfully!",
            "Why are you responding to emails sent to your personal email?",
            "Hardcore lovin that last “time wasted” line on the itemized list. You’re a rockstar! and I wish I will someday find talent like you for my business",
            "I worked at a place that hired a new manager, he was not qualified to run the department, he never had been a manager before and we were all programmers and he was an aerospace engineer. In the first week he was there he broke two pieces of equipment swapped programmers systems for his, as he needed a \"better system\", we swapped everything back and he never noticed.\n\nI was the keeper of all the code and general answer guy for the programmers (I knew almost all the software modules and hardware calls). A lot of what I did was helping the programmers, so it looked Like I was chatting a lot during the day. I was told by new manager to list everything I did during the day, so I did it was full typed page, with a line item at the bottom \"typed up all activities for the day\". That lasted about 2 days and then he wanted it in 15 minute increments, again I filled it all out at the end of the day. Nope not good enough I needed to stop what I was doing every 15 minutes and enter the activities. This lasted a few more days until the VP walked by and saw me updated the sheet. He told the manager to stop wasting my time and let me work.",
            "I would have just checked your computer logs and not said anything to you. How much time have you been wasting on reddit?",
            "There’s nothing malicious about this. I’d love to get a sheet with such detail. Just use timestamps, you’ll have not spent one hour writing it down. \n\nNo I don’t expect every mail, but “9:00 replying to mails; 9:20 call from client + discussing call; 9:50 issue management, updating #123, #124” etc would be nice from time to time.\n\nBut I accept less detailed, as long it is not “8 hours worked on x”",
            "No TLDR...",
            "[deleted]",
            "It's your fault, you should handle just the general mailbox (and direct other requests there). Otherwise, how the client and your manager could know, how much work is going your way? From their perspective, you were just handling those 7-8 e-mails per day.",
            "You just described a typical office job with the usual idiot and useless manager/s. It happens everywhere in every area you can imagine",
            "r/antiwork",
            "I mean… this is not too far off the time sheet I had to complete every day at my old job. You had to account for every single 5 minute block of your working day. And they had a target of about 96% of the time being chargeable client work.",
            "Hopefully they hire help. Our IT department is swamped and every request has so be escalated  because it's never addressed. 100% because our IT guy is assigned to too many other things",
            "Writing down every single thing you do would be a big pain in the ass but now at age 50, I wish I had done it my whole life. I'd love to look back and see if my memory lines up with what I actually did.",
            "Funny how one persons perception can blow up into a micromanagement nightmare.",
            "After that request I would have quit.",
            "[deleted]",
            "This is awesome! Beware of what you ask for!",
            "Been through this a few times, in every instance I was never questioned again by the requester.  Though frustrating, I think it is the best thing ever.",
            "We had to do recap emails an a former job. Fine, justifiable, it was an event /building ops job so the guy coming in at 5 am would need to know \"hey there's fans in here drying stuff move them right away\" type stuff. \n\nThey were usually pretty generic and got the highlights, but the boss wanted more. And then more. And then more. \n\nBefore long, me and another guy were sending the guy breakdowns of who went where, what we had for lunch, if we'd recommend it. We included meeting notes of a meeting the boss led, who we talked with on the way back from said meeting. \n\nHe got the idea",
            "haha figure out what direction everything else faces.",
            "I worked for a govt run phone company.\n\nMy job was CO rack work, nothing special, nothing to write down/write home about.\n\nNew foreman wanted to prove he was doing something, had gone on a course.  (in a job where everyone knew what to do and nothing changed). \n\n(He was given to us because he's a screwup and the uppers decided he couldn't screw up our dept, it was near impossible to get fired at the phone company)\n\nOur timesheets were filled out every day and we used the same single timecode for the entire day (rack work).  He didn't like that and wanted stuff that wasn't actually running a wire to be put in 'other'.  \n\nOk, lots of silly stuff wasn't rackwork so the other code got 2/3 of the day's hours..  That code actually meant something like unproductive time and someone heard him with his boss \"I'm sure they're doing something!\"  \n\nNext try..  Big sheet, we write down what we're doing, every time we do the thing.  Minimum time was 15 minutes.  So, I run wire... 15 minutes, phone rings to check a line, wire running stops and phone call gets 15 minutes.  Back to running wires, another 15 minutes.  \n\nEnd of the day..  My day adds up to 16 hours.  That sheet of paper went away the very next day and we were back to single code on the timesheet.",
            "Smoke break? Coffee break? Where do you work?! I need a job!",
            "I fear the day this will happen to me as I work in software development.\n\nI am stretched across so many projects and the primary source of features and code for so many things that my entire day can literally be eaten up by various devs on other teams asking me questions or requesting a quick demo on how to use something.\n\nWe use Jira and fill out our tasks using cards, etc, as a means to track everything we have worked on or currently working on. I literally have 0 points and 0 cards from Jira because I literally do so many small tasks throughout the day across so many things, that creating the card itself is detrimental to my productivity, so I don't.\n\nIf I ever have to \"prove my work\" by ensuring I create a Jira card for everything I do, I will simply do the same thing, and give them 200 cards a day, with one at the end showing the 2 hours of lost time creating Jira cards.\n\nA good metaphor would be that I am the oil that keeps the machines running. Do I actually produce the end product? Nope, but without me everything else would screech to a halt and break down.",
            "I had to do this once upon a time.  Some genius came up with the ABC time theory.  \"A\" time was actually doing your job (according to your job description).  \"B\" time was preparing to do your job.  \"C\" time was everything else.  So we had to group our time according to those categories.  \n\nThe only thing it really uncovered was that \"A\" time was extremely ill defined and the job description was sorely lacking.",
            "I had a manager that carried me out for reading trade magazines, (I'm in it). So I wrote down everything I did daily for a week. After 2 days I was told that I should stop.\n\nHelped me in my consulting career",
            "Good",
            "Sounds like my experience working national accounts for the fire division of a well known conglomerate. Clients never paid attention to our protocols and management never had our backs. I can talk shit about them now that the year of my non disclosure is up. Fucking laid my ass off a week after coming back from my daughter being born.",
            "When I was leaving my job, I wrote a guide of things I did by frequency.   One of the girls that took my job ended up getting a promotion. But every once in a while I would get calls, how do you do... First year no problem, it was still in the memory.  By the second year, I was starting to forget. Third, forget it!",
            "Should have done everything on the clock. Always get paid for your time",
            "Sometimes it takes initially giving in to BS power struggles from insecure leadership to not only demonstrate your valid work ethic, but to also show them what they don’t know. Maybe this experience will also benefit others they find questionable.\n\nIn my own leadership positions, my first question is rarely, “What are they NOT doing” and more “How can I help them work more efficiently.” Assuming the worst burns relationships, it doesn’t build them. I’m glad you stuck it out when you could’ve easily not dealt with that!",
            "Had to do this with my wife. \n\nCame to the same outcome, of longer having to do it after I took it to the extreme.",
            "All this because they didn't have keystroke recoding and a manager to review the data",
            "The most impactful thing I ever did at my previous job, to help get more staff, was to make a simple list of how long it would take me (in hours, for a week) to do everything I realistically was tasked with doing. It was something like 145 hours / week. After trying to make the case for a few years, that simple list ended up getting 2 extra head count added to my team within a year\n\nI was simultaneously irate for them not listening or taking seriously anything I’d said for the prior years and that a silly list meant more, and happy that they finally hired some damn people. Then I quit because I got offered a 60% pay increase to work elsewhere",
            "Wow you’re awesome",
            "[removed]",
            "Are you Michael Scott?",
            "I was an assistant to someone a few years back. She was a lazy fuck who would spend half the day smoking and the other half texting and doing online shopping. Then she had the gall to reprimand me when she would refuse to check over my work for customer quotes. She forced me to do the checklist too. 🙄 Like everything I had to do wasn't all done and waiting on her ass to look over.",
            "this is called \"work to rule\" and is an old labor tactic",
            "I was an order picker at Amazon once and had to do a similar thing. I just told them to get fucked."
        ]
    },
    {
        "post_id": "11wzxel",
        "author": "Northwest_Passage_",
        "title": "Business Class Upgrade \"if there is room\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11wzxel/business_class_upgrade_if_there_is_room/",
        "score": 20361,
        "num_comments": 407,
        "created_utc": 1679355044.0,
        "selftext": "I used to work at a regional airline. The jet we used for our flight to the “big city” had 6 business class seats. The business class service was really good for a 2 hour flight. It included a full bar service, a hot meal, warmed bread basket, followed by a trolley with dessert and signature coffee. The good old days...\n\nOne of our regular travelers was a local business owner who was just… a slimy businessman (SB). He had a reputation for making a lot of money from some pretty shady deals over the years. We would roll our eyes when we saw him coming to the check-in counter because he would always name drop and ask for special treatment. He always used the business class check-in line even though he was usually in economy. He didn’t have frequent flyer status, but he was buddies with one of the airline executives and always let us know this fact when he checked in by making sure to tell us that he was good friends with Vice President Karen. He would always ask for free upgrades, extra baggage, not charging a change fee, last-minute discounts, etc. If he didn’t get what he wanted he immediately called VP Karen, who would usually then call us and approve whatever it was he wanted.\n\nSo one day SB checks in for his flight to the “big city” and of course name drops and asks for a free upgrade to business class because \"I'm friends with VP Karen and said it would be ok.\" He was traveling on a discounted ticket that was not eligible for upgrade even if he did have an upgrade coupon, which he didn’t.\n\nI informed him that he was not eligible for any upgrade on this ticket and gave him his boarding pass and sent him on his way. Of course he flips open his cell phone and immediately calls VP Karen. Within 2 minutes the phone at the check-in desk rings and it’s VP Karen authorizing me to override the policy to upgrade SB to business class with no upgrade coupon required “if there is room.”\n\nThe flight that day wasn’t that busy and only 1 person booked in business class leaving 5 open seats. I was really irritated but I begrudgingly put SB on the upgrade list anyways. He returned to the check-in counter and picked up his standby boarding card and gave me that smug “told you so” look. But then what VP Karen said clicked with me - “if there is room.”\n\nThe next passenger I checked in was a SUPER nice lady, big smile, friendly, please and thank-you, oh thank-you so much for checking my bags to my connecting flight, that’s so nice of you. I was taking my time and we were chatting a bit since it wasn’t that busy. She was a teacher going on a trip to see her family and it was her first visit with them in over a year and was going to meet her new little nephew for the first time. She was overjoyed just to have the time off to travel.  I typed in a few things into the computer to make it look like I was checking something about her connecting flights and then said “Oh, you have been selected today to receive a free upgrade to business class.” She was shocked. “I’ve never flown business class in my life! This is so amazing!”\n\nAt that time we were rarely questioned if we upgraded someone without a certificate. Over the next 20 minutes I found excuses to upgrade four other passengers - one who worked for one of our top corporate accounts, one who was legitimately a frequent flyer, can’t remember the other reasons, but by the time I went to board the flight I had to tell SB that I was sorry but business class was full and couldn’t offer him an upgrade today.\n\nThe teacher I upgraded profusely thanked me again when she boarded with the rest of the business class passengers. Little did she know that it really made my day also!\n\n\\--\n\nThank you all for the votes and awards! I'm a long-time lurker but first time poster.  This will encourage me to share more tales from the airport. I could probably write a whole book about the crazy Karens, the very good and the very bad staff, the non-rev trips... anyone who has worked in the airline world knows it is unlike any other job. \n\nThere were no repercussions to my actions. We rarely upgraded passengers randomly so it wasn't something that caught management's attention, and they mostly trusted our judgment on these things. But, like many customer service jobs I'm sure, if you were nice to us we would go out of our way to help you. If you were not nice to us, we would apply the rules very strictly. Our boss did watch baggage like a hawk though - if you printed more bag tags than the passenger allowance without collecting the excess fee it showed on your daily report and you would be asked about it at the start of your next shift. ",
        "permalink": "/r/MaliciousCompliance/comments/11wzxel/business_class_upgrade_if_there_is_room/",
        "comments": [
            "Love this. I bet that lady still tells people about the nice person who upgraded her to business class and how she had such a wonderful experience.",
            "I was flying to Texas from LA once with a stop in Phoenix. I have gotten for years never h had any problems but on my flight from LA to AZ I threw up the whole way. I got off the flight and walked up the the counter looking as green was Kermit the frog. I asked where I needed to connect the agent looked at me and said \"had a rough flight?\" Typed a couple things into the computer and said \"have a better day\" when I got to the gate I was upgraded to first class in my connecting flight. Warm towels, putting up my feet, and all the ginger ale I could keep down went a long way to making me feel better. I will never forget that agents kindness.",
            "Ya don't  tick off the worker behind the counter, ever.",
            "Is there a reason why agents don't do this anymore? There's been a few times I've seen business class with empty seats.\n\nI understand you need to upgrade ff and many people have status but I wish to see nice old ladies upgraded.",
            "I have had that magical, wonderful, \"We have upgraded you to business\" class once in my life. I think the check in agent clocked my itinerary and saw my 10 hour layover (sandwiched inbetween 2 8hour + flights) and did it to make the experience less of a hassle. The only issue is when I realised how comfortable that flight was next time when I flew economy it was a real bugger knowing what was beyond the curtain.",
            "Had a kind of opposite experience once.\n\nWas govt employee flying overseas on govt business with another guy (outranked me).  Kind of a big deal trip.\n\nGot to the airport (1 hour drive) and he wasn't there.  Called him.  He was mowing his lawn.  I was like \"international.   2 hour checkin.  Diplomatic travel...  ORDERS\". He said \"chill out I'll leave soon\".\n\nHe arrived very late.  They already boarded standby, so his seat was gone.  I was wheedling the boarding gate person showing diplo papers, orders, etc.  Please hold the door as long as possible.\n\nA hole shows up at the last second.  Because his seat was given to standby, he got bumped to first class for a flight to central Asia.  I was back in coach.  He had the gall to give me a s##t eating grin and say \"see I told you it would be fine\".\n\nScrew you Dave.  Also screw your homophobic macho attitude -- half your team was gay and they all made fun of your idiotic prejudice.",
            "Good for you +1",
            "VP Karen was getting kickbacks from SB.",
            "Had this happen on a flight back from the UK on BA in 2005. We were flying out New Years Eve and Heathrow was a disaster. We got to the airport 4 hours ahead and immediately got in line. And waited. And waited. They had to start pulling people out of line to check in because flights were leaving and the line hadn’t moved.\nThey call our flight number to bypass the line, we go up, and it’s an older woman who looks like she’s just been run through hell. We thank her for helping us, check our luggage, and my husband very very politely asks if there are any upgrades. We try and chat politely while we are waiting but also recognize this poor woman probably just wants this day to end.\nShe hands us back our passports and bag check stuff and tells us she put us in business class.\nInternational business class that has the fully reclining pod. And bar service. And dinner and the toiletry bag with socks and a sleep mask.\n\nIt had been a rough trip, and she was so so kind.",
            "Shame you guys didn't have an ethics hot line.  An SVP having front line employees going against policy for their friends should not be taken lightly.  This is the kind of thing people get a warning over and then fired on a second offense.",
            "As a (very) frequent flyer with all the status, whatever - who tries damn hard to be polite and gracious with airline employees - I approve this message. 😀",
            "I always try to give extra special service to the nice customers. They earned that reward.",
            "I was on an overbooked flight. I was in an aisle seat. This entitled business man comes stomping over and demands I leave because I’m in his seat. I’m not budging, I was there first. Flight attendant comes over. He goes away to check something and says there is one seat available in First Class. Mr Business Man is very smug. I get offered it. He complains I’m not “dressed” for First Class. (Very true, I was in comfortable joggers and a T-shirt). He offers to “buy” it from me. $20. (This was early 80s). I told him he must think I’m stupid or something. Ended up getting $80 off him. And the flight attendant brought me a First Class meal to boot. That was fun.",
            "Reminds me of a time, I didn’t have a credit card. I was 20, I tore my ankle up at an ROTC event. They asked if we wanted to upgrade to an exit row. I really really needed the leg room (I had a grade 3 ankle sprain that required surgery because everything was torn up), so I asked to pay with my debit card, but they wanted a credit card. I indicated that’s all I had, but I understand. I hobbled over to the seating area. Finally a loudspeaker announces I need to go see the ticket agent. I got bumped to first class. \n\nI sit down, the attendant is asking us for drinks, I said, I’ll just have water. The guy next to me says, “buddy, you’re in first class, it’s free.” So I grabbed a bunch of beverages. That flight from Seattle to Chicago was amazing. I slept a lot. I was very happy with the folks at United.",
            "I cannot count the upgrades and improvements to service I have gotten just by being nice to the service folks. It really does make a difference! Some people just think they are \"hammers\" and everyone else is a nail...",
            "Good for you! I'm a million mile flyer, and could not believe some of the shit I've seen counter people and cabin crews deal with. No matter my mood, I would always be extra nice to the counter person, and flight attendants. I would not want their job!",
            "May the universe grant you some well-deserved karma this week. 🌸🤗",
            "I was spoiled Diamond status for a few years but it still really bugged me when people complained about not getting upgraded even when they had status. Look, bro, I'm sitting in Comfort Plus with you too and I'm going to enjoy a free hazy IPA and not bitch about it.",
            "The only time I was upgraded to First Class was in the Mid 90s, and got a free upgrade for doing the then-novel thing of booking the tickets myself online.  Since the flight was for my honeymoon it made it all the better.",
            "This reminds me of a lesson I learned a long time ago.  My flight to Maui from San Francisco kept getting significantly delayed, and the poor airline worker had to deal with the wrath of over 100 increasingly angry people.  We had to get back in line (don't remember why) and I noticed that passenger after passenger in front of me was yelling at her or otherwise being a jerk.  One after another after another.  She was visibly stressed out to say the least.  \n\nWhen my turn came, I was my usual chill self, smiling, joking around, and talking to her like a human.  I got her to laugh a few times.  I didn't ask for or expect an upgrade, but she said \"you know what - I'm going to put you in first class\".  And I gotta say it was a pretty sweet flight. \n\nThat lesson always stuck with me, and since then I've applied it many times in other contexts.  Basically, being chill, joking around (in a natural way, not forced), and talking to people like they're human beings generally gets just as good or better results than the customer tantrum/let me speak to your manager/don't you know who I am stuff.",
            "MC for SB while simultaneously delighting a pleasant person? Winning all around. ☺",
            "I used to stay in a downtown city hotel 4 days a week for about a year for work. Work paid for the hotel, but I was always meticulous about tipping the mandatory valet parking folks as well as having a nice chat with the folks at the desk doing check-in.\n\nOne week I check in and the front desk lady says \"just so you know, we give you a little treat this week\" and hands me a card to room 100. Turns out I've been upgraded to the presidential suite which could literally have held 15 people, had a hardwood round conference table, several sofas and chairs, multiple bedrooms, and a dedicated wet bar area, and three different entrance and exit doors. \n\nTo this day, that is the coolest hotel stay I've ever had.",
            "Petty and I like it. Keep on doing the good work!",
            "Lol I remember my stint in the airlines with people asking for free upgrades. A friend at BA had the perfect response. A customer asked for an upgrade because they had just had surgery and needed the extra room. My friend said “unfortunately business class is full, but now that you’ve informed me that you just had surgery we will need a letter from your doctor certifying you fit to travel.” The passenger would immediately backtrack: “Oh, it was a minor surgery and it’s much better now.” My friend would then twist the knife: “Then there’s no reason for the upgrade, now, is there?” Roasted.",
            ".Slaps Barry)\nYou snap out of it.\nBARRY:\n(Slaps Vanessa)\n :\nPOLLEN JOCK:\n- Sure is.\nBARRY:\nBetween you and me,\nI was dying to get out of that office.\n(Barry recreates the scene near the beginning of the movie where he flies\nthrough the box kite. The movie fades to black and the credits being)\n[--after credits; No scene can be seen but the characters can be heard\ntalking over the credits--]\nYou have got\nto start thinking bee, my friend!\n :\n- Thinking bee!\n- Me?\nBARRY:\n(Talking over singer)\nHold it. Let's just stop\nfor a second. Hold it.\n :\nI'm sorry. I'm sorry, everyone.\nCan we stop here?\nSINGER:\nOh, BarryBARRY:\nI'm not making a major life decision\nduring a production number!\nSINGER:\nAll right. Take ten, everybody.\nWrap it up, guys.\nBARRY:\nI had virtually no rehearsal for that.\n\n_______________________________\n\nAt 1 p.m. on a Friday shortly before Christmas last year, Kent Walker, Google’s top lawyer, summoned four of his employees and ruined their weekend.\n\nThe group worked in SL1001, a bland building with a blue glass facade betraying no sign that dozens of lawyers inside were toiling to protect the interests of one of the world’s most influential companies. For weeks they had been prepping for a meeting of powerful executives to discuss the safety of Google’s products. The deck was done. But that afternoon Mr. Walker told his team the agenda had changed, and they would have to spend the next few days preparing new slides and graphs. At the Googleplex, famed for its free food, massages, fitness classes and laundry services, Mr. Pichai was also playing with ChatGPT. Its wonders did not wow him. Google had been developing its own A.I. technology that did many of the same things. Mr. Pichai was focused on ChatGPT’s flaws — that it got stuff wrong, that sometimes it turned into a biased pig. What amazed him was that OpenAI had gone ahead and released it anyway, and that consumers loved it. If OpenAI could do that, why couldn’t Google?\n\nElon Musk, the billionaire who co-founded OpenAI but had left the lab in a huff, vowed to create his own A.I. company. He called it X.AI and added it to his already full plate. “Speed is even more important than ever,” Sam Schillace, a top executive, wrote Microsoft employees. It would be, he added, an “absolutely fatal error in this moment to worry about things that can be fixed later.” \n\nSeparately, the San Francisco-based company announced plans for its initial public offering Wednesday. In documents filed with the Securities and Exchange Commission, Reddit said it reported net income of $18.5 million — its first profit in two years — in the October-December quarter on revenue of $249.8 million. The company said it aims to list its shares on the New York Stock Exchange under the ticker symbol RDDT. \n\nApparently many shoppers are not happy with their local Safeway, if questions and comments posted Sunday on a Reddit forum are any indication.\n\nThe questions in the AMA (Ask Me Anything) were fielded by self-described mid-level retail manager at one of the supermarket chain's Bay Area stores. The employee only identified himself by his Reddit handle, \"MaliciousHippie\".\n\nThe manager went on to cover a potpourri of topics, ranging from why express lane checkers won't challenge shoppers who exceed item limits to a little-known store policy allowing customers to sample items without buying them.",
            "The residential rehab I work at serves meals for staff and clients and I'm always telling clients \"Don't piss off the kitchen guys until AFTER you have been served!\"\n\n+1 for the story. MC at it's finest!",
            "Never been upgraded. However, I remember when the attendant found out I and my late spouse were just married (flying out to CO on our honeymoon, early 2000s). She snuck a bottle of chardonnay wrapped in cloth and a bunch of vodkas our from first class for our trip, and got my spouse a set of wings. We wrote the airline a glowing review on her by name (careful not to tell them anything she might get punished for). It was a really nice thing, I’ve never gotten service that nice.",
            "40 years ago as a starving (relatively speaking) uni student I was flying back home, but could only afford a standby ticket.\n\nFinally it came time to call up the standbys, and as I walked to the counter i was going to get there first, until I got shoved out of the way so badly I almost fell over.\n\nSome business suit had just decided he was more important. \n\nI don't know for sure, but I'm guessing the airline staff must have seen it. We both got a seat, but as we boarded I found out I had a business class seat.\n\nAt 18 I didn't even know it was possible.\n\nThen I got to watch the businessman board, and recognise me. The look on his face has stayed with me forever.\n\nHe turned the corner from the door, saw me and stopped dead in the aisle, then down at his boarding pass, then at me.\n\nThey had to tell him to keep moving and he shuffled his way back to a middle seat in economy.\n\nI did look back and tipped my glass to him at one stage and just smiled. I'm glad looks can't actually kill.",
            "You are rotten to the core. LOL!\n\nPerfect malicious compliance!😎",
            "If there was a way to give you more than one vote, I would have. I upvoted everyone else, too, though. Have a great day, all of you!!",
            "once about 25 years ago, I was flying from LAX to Denver with my then-toddler son, who happened to have JUST come down with bronchitis. Had a booked ticket for each of us (he was using a car seat and had his own ticket). Got to the gate and was told the flight was oversold. I'm sure I looked like I was gonna cry as I had just been dropped off by my mom, had been gone from home for a week, and now had a sick toddler to deal with on top of not getting on my flight! \n\nThe gate agent wasn't really talking to me or looking at me, but tappy tapping away. Then she hands me a FIRST CLASS TICKET FOR TWO!. I was FLOORED.  I've literally never flown first class (and haven't since either). We boarded, I strapped in my boy, he promptly fell fast asleep and I flew home completely relaxed and peacefully. I had anticipated a shitshow that afternoon, only to have a completely wonderful flight. This was pre-9/11, so my husband was waiting at the gate for us. I came off the plane with my son and all our carryon stuff and said, \"Honey! we got to fly first class! it was awesome!\" He was so surprised and happy to see us in such a good mood. My son having a 2.5 hr nap on the way home meant he was in a good mood even though he didn't feel too good, and he was chatting with us all the way home in the car (40 min drive or so).  \n\nHonestly, I think the fact that I had a kid, and didn't start screaming about not getting on the flight helped me get that bump. I will never forget that kindess <3",
            "This belongs in r/chaoticgood.",
            "MC that benefits others AND screws with the SB.\n\nIt's like seeing double rainbows.",
            "Ah that reminds me of the first times I used to fly to the US. I made friends with the local airline manager for BA, and I used to bring him Branston Pickle in my bags.\n\nHe would always made sure I had access to the airline lounge and if he was on duty at the gate, he’d ask the crew to find a business class seat for me, although they didn’t have extra meals so I’d be served economy food. Business class upgrades are very hard to land on transatlantic flights so that was quite a treat.\n\nHe got a promotion and doesn’t work at my airport any more but I always appreciated him.",
            "Upgrade all the teachers! :D",
            "Love this! Good job. \n\nIn the Before Times, I flew a lot for work and so I got status just because I was on a plane more days than I was on the ground. \n\nBut I'll never forget the very first time I got upgraded. I had NO IDEA what was included or not. And it was a 4 hour long flight, across the US from NY to CA. So I got a meal, warm towel, warm cookie, the staff knew my NAME! \n\nI didn't even know alcohol was included, but I made up for that on future flights. \n\nBut the funniest part was the old man next to me. I always fly in black stretch pants and a t-shirt because comfort rules everything around me. (My favorite airport Tshirt says 'don't be a .... Then shows a rooster and a lollipop' Hehe. The airport staff tend to like it.)\n\nSo, I sit down and I'm giddy with excitement. This was an older plane from US Airways (RIP), and it had this crazy footrest that had two parts that each rotated separately. Plus a nice backrest. All kinds of buttons. \n\nSo I'm pushing all the buttons, trying to figure out what each does, and just having a grand old time. \n\nDude next to me couldn't be more disgusted. He's reading a newspaper (like, actual paper newspaper. Huge, spread out open, not even folded up properly the way you're supposed to do on public transport). So he keeps rustling his paper and sighing. I started to feel self conscious, but I squashed that. Fuck that guy, I'm enjoying this. \n\nHe says!! \"UGH, it's like the Beverly Hillbillies goes to the airport!\" \n\nI was shocked and stared at him for a beat, then just laughed and continued pushing buttons. By that point I had figured out the buttons but now it was just a game to see if I could make him stroke out. \n\nSo for the entire four hour flight, I would occasionally readjust my seat minutely. Just a lil bit....enough to make him twitch. \n\nFuck that guy. Most folks aren't buying first class for a flight that short, so it's likely he was up there for the same reason as me; someone ELSE paid a bunch of money for him to fly and he earned status over time. \n\nIf he's not dead yet, I hope he still hears a phantom button press when he least expects it.",
            "We use miles and points to fly internationally, and being old, try to always fly business. \n\nA couple years ago, we flew to HI during the pandemic, and the cost for biz was crazy cheap. Everything was great on the way there. \n\nBut coming back home, we got on the plane and sat. And sat, as it got increasingly cold: the air conditioning wouldn’t turn off. Which, on the ground in Honolulu wasn’t such a big deal. At 35,000 ft and -60 F outside, it would mean everyone on that flight froze to death. \n\nSo the flight got cancelled. And a couple hundred people needed to be rebooked. \n\nThe airline computer had rebooked us at the back of economy, when we’d paid for biz. So we stayed in line. Once we got there, we explained that we weren’t married to a particular time of day or transfer airport. But we wanted our biz seats. \n\nWe got them, on a flight the next evening. Such a shame! And extra full day in paradise!  We got vouchers for two meals each, cab fare to and from downtown and rooms in a nicer hotel than we’d stated in. \n\nWhere we got upgraded to a room on a high floor with a balcony, overlooking the mountains. \n\nAll for being decent but firm.",
            "I once had the \"due to this flight being overbooked, could the following passengers please come to the flight desk\". \n\nThe guy at the desk was very apologetic, and said they'd have to bump me to the next flight. I was chill about it. I told him I was sorry for the other passengers he called up yelling at him, that the delays weren't his fault, etc. It was my 21st birthday, and I was flying home to celebrate, but nothing that couldn't push back an hour or two.\n\nHe took a look at my ticket, confirmed my date of birth and said with a grin, \"oooooor....would you like to be upgraded to business?\"\n\nIt was only a 2 hour flight, but I loved every second of it, and I think he enjoyed seeing the grumpy passengers faces when he shouted out \"enjoy your free business class upgrade!\"",
            "Fantastic.  Nobody appreciates an upgrade like a regular person.  Happened to me once, glorious.",
            "Finally on reddit someone uses sensible descriptions of the characters in their story.\n\nMost of the stories I see on here would give everyone names like \"Ryan, Jeff, Claretta, Zanzimir\", and then I have to keep remembering which one each of those random names is supposed to be in the story.\n\nThank you for your thoughtful naming conventions.",
            "Oh man, I was flying standby on my pilot brothers pass system from Maui to Newark, I chose the first class option and figured I’d be lucky to get a seat there. This was United Polaris, the ultimate business class, to me at least. There was one open  seat left with no upgrade tickets, and when I walked up at the gate the agent was talking to a customer who wanted an upgrade for his grubby wife, he was  also name dropping and saying how often he flew. The agent was calling people and trying to figure out why she couldn’t give them the first class seats while this guy was screaming at her. I just stood by, the whole plane had boarded, and when they finally walked away they were like, fine we’ll just take the seat when we get in the plane. I finally had my turn with the agent and was like, \n\nhello, I’m your non rev. \nOh we haven’t given you a seat yet? \nNo I’m on first class option.\n\nAnd I’ll never forget the look on her face when she realized that seat was saved for me in the computer, since technically it’s considered an international flight and upgrades for coach tickets don’t work. She was like, here you go. 8D window. She then ran over to the grubby couple and told them what had happened as I walked on by to the plane. I sat down in my little private cubby and was checking out my amenities as they walked by sneering at me. Wish I could’ve bought that gate agent a coffee. She was so nice. If you want gate agents and flight attendants to love you, buy like 5,- $5 Starbucks gift cards and hand them out when you board.",
            "My first upgrade was in the early 80’s.  I was in the Air Force flying from California to Texas.  A co-worker was also going to the conference.  We were both in our uniforms.  Sitting in economy.  The flight attendant came to our seats and asked us to follow her.  We were upgraded to first class! !  We happily sat in the soft, comfortable seats, and promptly fell asleep. (Both of us had been on duty the night before and had been awake for over 24 hours). No booze, no food, no extras. 3 hours of uninterrupted sleep.",
            "Revenge achieved by performing acts of kindness, my favorite! Thanks for sharing!",
            "What a feel good malicious compliance story - I can just see the smile on that teacher's face.",
            "This is not only malicious compliance but also petty revenge for SB's treatment of you and your coworkers. Good for you!",
            "My connection to my first international flight to greece in 30 years was missed due to weather, we got stuck in Augusta Georgia (USA). The lady at the counter was slammed so I decided to call helpline, after an hour on the phone they couldn't change my flight as the airport never changed my status so I got in line, sucks but i lived. Got to the front was polite and all I requested that my seat wasn't downgraded (got seat basically right above economy)...that bitch...upgraded me to the seats where you can lay down! So fucking nice like....omg missing my connection was 100% worth it. 8 or 10 hour flight with alcohol, food, and a bed....would take me over a month to earn enough money to pay for that",
            "Always be nice to the ticket or gate agent.. just don't over do it and they will bend over backward to help. Source: Used to be one",
            "Kind of surprised SB wouldn't have been told by Karen to just sign the f up for frequent flyer status. That you/your team knew the individual indicates SB likely flew enough to be recognizable.",
            "You gave that teacher a story to tell for years. The wrong people in this world have the money, and you my friend are one of the ones who should have it.",
            "I had a full fare business ticket for a Canada to Germany flight one time. I was getting seated and there was this guy access the isle that was making a big deal about opening his pillows and blankets and making his bed all comfy. We're still on the ground and I found that my seat wasn't working. It wouldn't recline. Maintenance came on, took the seat apart and now we're 30 minutes late and they can't fix it. The Stewart told me he could recline it manually only. I said I was ok with that if he would put it down once for me to sleep, then bring it up when I woke up. He told me to hang on a minute. Turns out, Mr fluffy pillows was upgraded somehow, and got kicked back to coach, then the Stewart comes back to me and said they found another seat for me. Felt a little bad but not too much.",
            "Couple of years ago I was flying back from Florida to Wisconsin around Easter. My flight was a quick turn around but ended up having a 5 hour layover in Houston. When the plane arrived they where asking for volunteers as there was a huge family emergency the airline was trying to accommodate. I had nowhere to be so I raised my hand. I got upgraded seats money food but the real joy was the look on the family’s faces. Didn’t know what was going on but the relief was in their eyes when the ticket agent said good to go.",
            "You, my dear, are awesome.  😆",
            "weaponized niceties",
            "As a flight attendant I love this so much!",
            "If you want to act like a big shot, pay for your own damn business class seat, slimy 🤷‍♀️",
            "Random people doing nice things is awesome\n\nI was at a pub in winter sitting outside and having a smoke a few years ago freezing my ass off, and one of the staff came out and gave me some hot meat pie and a coffee for free. Honestly never had anyone do something like this so it was amazing, and I was in a really rough spot at the time and it meant so much to me",
            "So to summarise, treating the ground staff like crap might perhaps come back and bite you in the arse later? As opposed to being a genuinely decent human being and recognising that they are there to help and (usually) do a great job of it (cough not-Air-Canada-rot-in-hell)?\n\nFunny that. It is fantastic though when everything works itself out so tidily. I really wish you could have let those upgraded in on the reason, it would have completely made their day.",
            "*chefs kiss* now this is what the subreddit is all about! 💕",
            "It's been a long time since that worked, hasn't it?\n\nI've flown nonrev a few times back in the day, and it's gotten me a few first class seats.  Just a smile and a hello did wonders for getting me there.",
            "You never heard back about this? From either SB or VP?",
            "I'd have done the same thing. \n\nI worked on phones as customer service for about 5 1/2 years. If someone was even slightly nice compared to usual, I would bend over backwards to help them. If they're rude/entitled/screaming...good luck getting a full sentence out of me.",
            "The one reason I really hate this story is that I forgot to make myself a bucket of popcorn.\n\nSeriously though, thanks for this!",
            "This.\n\nThis may be my favorite MC story so far. Put a sleaze in his place, and got to do something nice for good people who genuinely appreciated what you did for them.\n\nI would give you a gold if I had one, so take my Silver instead",
            "Love this!!!! In December, I flew like 12,000 miles over 5 days with just one day’s break & I had a mean kidney stone flareup, so i was super stiff and sore. \n\nI have medallion status, but it was a super busy travel time & I didn’t qualify for an upgrade on my longest leg  NYC to Las Vegas.\n\nIm pretty good at weaseling my way into things, so I decided to try my luck with one of the ladies at the desk. She saw me coming from a mile away and was shaking her head no as I approached, until I saw her name tag — and then lifted my wrist to show her the same name tatted on my wrist in my mother’s signature — & told her I was SUPPOSED to meet her that day!\n\nI slept very peacefully in full recline the whole way  🙃",
            "Great story!!  I love getting the chance to put entitled/mean people in their place!",
            "Love stories like this.  If dude was as special as he thinks he could afford business class",
            "Genius use of a loophole!",
            "I approve of this message, that is how it is done .",
            "Thankyou, it's nice to see positives for teachers every now and then.",
            "That's my dream, to be upgraded one day! \n\nExcellent malicious compliance 🤣",
            "This is the way. You have grown far grasshopper.",
            "You're wonderful.",
            "On behalf of teachers everywhere? Thank you for doing that for her.❤️",
            "Masterful corporate speak working, there. That one move probably made your airline more money long term than SB would've been worth over his lifetime.",
            "This is awesome!",
            "That’s beautiful. Being a decent human being will ultimately get you a lot farther in life, for sure. And you’ll be a lot happier along the journey.",
            "Great post. Life lesson, don't be a SB or even just a S!!",
            "One of my pet peeves is people who name-drop. They're everywhere!",
            "Ahahaha I respect it. Fuck people who think they are entitled to everything in life",
            "You had me at warmed bread.",
            "Ah yes , great story and thoughtful upgrade for the teacher , well done \n\n No repercussions I hope?",
            "Really nice story, I just can’t get past all those benefits for a 2 hour flight!!",
            "Oh that one had to feel fucking GREAT!",
            "Actually saw a karen trying to carry on 2 x 750ml bottles of Bourbon on an 8 hour flight this year",
            "Amazing, I thought those tales of random counter upgrade were all fibs. Well played, you made 5 people’s day. SB should fly on quiet flights more often 😂",
            "The VP was embezzling from the airline. I'd wager that all of those free perks given to businessman over the years amounts to a substantial sum of lost profits, both in things he should've paid for and in taking up those business class seats from those who would've paid to reserve or upgrade to them. She's lost the company a good deal of money over the years. It's not just slimy, it's criminal.",
            "Not really MC. There was room and you had to go out of your way to change that.",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "Playing with fire. More let my ego get the better of me. non of your business, and interjecting yourself in others business. Although it worked this time, it wont next.",
            "Omg I have had that experience,around 2000 on an American Airlines flight.  This guy in front of me was sooooooo rude demanding an upgrade because he was gold card flyer.  Him and the guy working actually got a bit tense, he was really yelling.  Since I was next I just tried to break it up joking and said “can I have an upgrade then?” And he said yeah sure.  What is it about an unexpected upgrade that feels so good?  Lol that guy was mad, it was so funny.",
            "Sounds like a fun discrimination lawsuit, as you had absolute no reason to make a distinction. Either do it by random chance, or not at all.",
            "Business class on a regional airline?",
            "God-tier MC.",
            "Love it!",
            "First time I ever flew, I was 17 years old, flying standby alone from San Francisco to Denver, this was 1972, didn’t know how to do it, didn’t mention standby till everyone had boarded the plane and asked when I could get on, the flight attendant felt sorry for me and put me in first class, had nothing to compare it to so I thought that was normal. I’ve never flown 1st class since. Also didn’t eat or drink anything because I was afraid I’d throw up, not that I felt sick just thought it might be a possibility and didn’t want to risk it.",
            "You are a good human being.",
            "LMAO.. what an absolute win of a move.  I tip my hat to you OP.",
            "Love this",
            "I love this,",
            "I can only guess that Karen took part somehow in the shade of the Shady Business... Customer.. partner.. idk.. but if he didn't get what he wanted, she could get in a lot of trouble. \nThat's the only reason I can see that he never in any way got the memberships to get the perks. He probably had to pay for the flight no matter what...  But she would accommodate any additional perks without charge.",
            "LOL this is a great post!",
            "Now that I am retired, I vacation travel a bit.  It is amazing how just being nice to the desk agent gets me a change of seat to one with more room with no extra cost (they charge more for those seats) but alas, no upgrades to business class yet.",
            "I did the same job. yep, nobody can understand it unless they’ve been in it. it’s a whole different beast at the airport."
        ]
    },
    {
        "post_id": "6ggydv",
        "author": "AAronm19",
        "title": "Amazon product review compliance.",
        "url": "https://i.redd.it/4c4sr6yu8v2z.png",
        "score": 20336,
        "num_comments": 153,
        "created_utc": 1497121469.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/6ggydv/amazon_product_review_compliance/",
        "comments": [
            "[deleted]",
            "At first, I didn't see what was wrong - but then I noticed the typo in the question, and it got a whole lot funnier.",
            "[deleted]",
            "Funny, but not that malicious.",
            "Soooo compliant",
            "[deleted]",
            "Looks like the review is the King of Rock and Roll himself: *Yell*vis.",
            "Beautiful",
            "Why is the W more than the L? ",
            "I love Amazon reviews. The sex toys are the best, between the paid half-english reviews, the joke ones and the (why would you ever do this???) actually legit endorsements.",
            "What did he mean?",
            "Maybe the questioner is hearing impaired.",
            "Impressive they avoided factorials. ",
            "This took me way too long to get...",
            "In all honesty the tongue in cheekness of the answer really cracked me up!",
            "How do you exclaim something parenthetically?",
            "HECK YEA MFER!!!",
            "It bothers me that the last set of exclamation marks used 5 marks while the prior sets used 4",
            "love it",
            "Of course this is a subreddit...",
            "That is hysterical compliance.  ",
            "Yes, a good one.",
            "[deleted]"
        ]
    },
    {
        "post_id": "p2urpw",
        "author": "Fangore",
        "title": "I'm giving you useless information? Okay, enjoy your green hair.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p2urpw/im_giving_you_useless_information_okay_enjoy_your/",
        "score": 20335,
        "num_comments": 810,
        "created_utc": 1628752279.0,
        "selftext": "I used to sell pool and hot tub chemicals. A part of the job is testing customers pool/hot tub water to see what chemicals they needed.\n\nIf you don't take care of your pool or check it often, you need a lot of chemicals to fix the mess you've made. Particularly if you use chlorine pucks. They generally have such a low pH level that it burns away at your heater coil and causes you to have copper in your water.\n\nWell a couple years ago a customer came up to me to test their pool water. It was a complete mess and it had a bunch of copper it in. This isnt the exact conversation because it was a while ago, but this was the main points.\n\nMe: Yeah the main issue is your pH is so low its making your chlorine less effective, and you have copper in your water.\n\nCustomer: Yeah just get me the stuff I need to fix it.\n\nI go and grab all the chemicals he needs and put it on the counter.\n\nCustomer: How much is all of this going to cost?\n\nMe: Around $250\n\nCustomer: I'm not paying that much. Is all of this really necessary.\n\nMe: Yes. You won't be able to hold chlorine. And you need to get the copper out. If you oxidize copper with a shock, it's going to stain parts of your pool and can even tint you hair green. (If you have recently dyed blonde hair)\n\nCustomer: my daughter is having a pool party next weekend and I just want the pool to have chlorine for then.\n\nMe: Yes, and you need all of this to make sure you're good to go.\n\nCustomer: Can you just put everything away and only give me the chlorine?\n\nMe: Fine. (I'm not going to argue. I don't work on commission.)\n\nFast forward a couple days and the customers wife came in. It was subtle, but you could tell her hair had a funny tint to it. She asked for all the chemicals that I recommended to her husband and she paid with zero hesitation. The husband never came in ever again and his wife took care of the pool from that moment forward. The next time the wife came in, it looked like her hair had been dyed the original blonde colour she used to have.\n\nTl;Dr: A customer ignored my advice and his wife came back with her hair tinted green",
        "permalink": "/r/MaliciousCompliance/comments/p2urpw/im_giving_you_useless_information_okay_enjoy_your/",
        "comments": [
            "I used to work for a major green-aproned hardware and gardening chain in Australia and we sold chlorine, shocker, and pool salt, usually only one or two brands, and basically no other pool supplies. There were no specialty pool experts in my store, just those of us who had pools and knew a bit about them. The amount of people who went to a specialty local pool shop that offered free water testing and would then give an itemised breakdown of exactly what that person's pool needed, which that mum-and-dad shop could help them with...and then that person would take that very clear and specialised list and bring it to us to try and save a few bucks, and get pissed we'd not be able to help them with the specific amounts or more specialised brands.",
            "I work at a large swim centre occasionally.  People reaaaaaaaaallly don’t understand chemical levels.  Yes the spa is closed because the pH is wrong .  No we can’t just dump more chemicals in.  If we do a dump, the auto sensors will pitch a fit.  We can do a water dump, but that will take hours to get back up to temp.  Yes we know what we are doing.  Please person who has just ignored all the barricades and gone in, \n either you go take an emergency shower or I will hose you for your own safety.",
            "My bf is a pool cleaner and some of his clients are something else. They’ll lie about the state of their pool saying it’s fairly clean and when he gets there, the pool is green with dead animals in it. 🤦‍♀️",
            "This is fascinating! Always wondered about the chemistry that cause green swimmers hair. I expect your lady customer explained that her highlights cost a lot more than $250 to her ridiculous husband.",
            "I'll never understand this, people go and ask experts and then ignore the advice. Hell, even I know that this can happen and I know nothing about pools",
            "BIG PSA for any new pool lovers, your hair doesn't have to be DYED blonde to turn green. As a former competitive swimmer who had a backyard pool, I can attest to this happening with natural blonde hair as well. My 9th summer on this planet ended in my starting the 5th grade with green hair thanks to a summer spent training in my pool. Thanks dad.",
            "I'd like to imagine he went home and told his wife about the salesperson who tried to charge him for all this \"unnecessary stuff\". Then when her hair changed color she remembered and they had a conversation about what was really \"unnecessary\".",
            "Wow.\n\nI feel your pain. I've been working for almost 10 years at a Canadian pool store for their water testing and chemicals department. I have quite a few stories as well. \n\nI had a case where this lady didn't want to learn/understand how to vacuum/pick up the leaves and debris at the bottom of her swimming pool.\n\nShe shows up in April asking how to remove the leaves. I tried to explain how to install her vacuum but she doesn't how her pipes and skimmer are configured. Ends going to the parts department but doesn't understand anything.\n\nFast forward to May. She shows up, complaining that her pool's water is murky. I ask her if she has debris still at the bottom of the bottom of the pool. Still does and I ask her for how long has it been there. She tells me that she never removed any of it. I tried explaining to her how to use a net or a vacuum to clean it out. Still doesn't want to understand and do it.\n\nFinally in June, she comes back, complaining about her liner being stained. Turns out all that junk decomposed and stained the liner. I tell her to put degreaser in (after being advised by my boss) and not to put any chlorine in for 24h. She comes back the next day and tell me the pool is foaming like crazy. I ask her if she put in any chlorine and...\n\nShe doesn't know. She tells me that her family might have thrown in chlorine without telling her. She asks me what to do.\n\n\"Ma'am, you're going to have to empty half the pool and fill it back up.\"\n\n\"But sir, is there-\"\n\n\"No, Ma'am, there isn't.\"\n\nNever saw her again after that.",
            "I think the best part about this is the color correction that woman had to pay for was likely double the cost of the chemicals",
            "Pay me now or pay me later. One thing is for sure, you're gonna pay for your mistakes lol.",
            "People tend to cheap out on maintenance until it comes back to bite you. The repairs cost more than a simple cleaning or some other menial task and then it is time to break out the wallet for some real cash.",
            "If a guy can afford a pool, he can surely afford $250 to sort an issue with it.",
            "[deleted]",
            "Oh, it must be a nightmare to keep a pool in my area. The groundwater has natural iron/rust and lime.",
            "The Chemist in me thanks you for giving someone a Chemistry lesson the hard way.",
            "This is why you pay what it costs for a Professional to give you advice!!\n\nOur pool was checked by a professional twice a year and we maintained it with exactly what he told us to. Never had a problem with the pool. \n\nIf my car needs an engine I take it to my mechanic I don’t buy a book on rebuilding engines and then try to “wing it!”. 🤦‍♀️",
            "Thumbs up from someone who works at a public pool. We make all our chlorine from salt in an electrolyzer. We also have a high level of salt in our pools.\n\nSwimming first thing in the morning is really awesome. The air inside of the pool building barely smells of chlorine and the water is nice and soft.",
            "fun fact - chlorine can turn natural blonde hair green as well. i had it happen often as a kid when i had light blonde hair and swam in chlorinated pools",
            "this whole “the customer is always right” is complete bullshit.\n\nmost of the time, they don’t know anything what the staff member knows and they seem embarrassed when they get put in their place afterwards.",
            "$250? That’s it? BITCH YOU GOT A POOL! \n\n\nPools and Boats = DISPOSABLE INCOME\n\n\ndon’t be a bitch about it bro, you’re the one with the pool.",
            ">The husband never came in ever again and his wife took care of the pool from that moment forward. \n\nDid you ask for proof of life?  ;)",
            "Same, I can't tell you how many times a customer will come in with virtually no ph or alkalinity in their water and low and behold they use muratic acid like it's chlorine. It's a lot of the older guys too that say they do this. Sure you have no algae, but it's also because you go in that water it'll feel like an acid bath, the ones grandkids had a rash for a few days. \n\nOr how about I try and explain the importance of having stabilizer in pool water so the poor guy isn't coming in every week for more chlorine. He would go to another pool store and they never told him about the lack of stabilizer so he would come in for more chlorine. When I tried explaining that he needs stabilizer so the chlorine won't burn up as fast he dismissed me saying he knows what he's doing and he \"doesn't need useless pool chemicals I'm trying to shove down his throat.\" 'Kay, have fun spending 25$ per case of chlorine bud.\n\nEdit, spelling",
            "At this point, isn't it cheaper to drain the pool and refill it with clean water? Then you wouldn't need as much chemicals right?",
            ">Customer: my daughter is having a pool party next weekend and I just want the pool to have chlorine for then.\n\nBrave dad. A group of teenage girls can hold a grudge.",
            "Pool owner here. Some algae treatments have copper as well. If your hair turns green, make a paste of baking soda and water and work it through your hair, let it sit for a few minutes then rinse.",
            "At least she saw the issue and handled it gracefully! I bet he got an earful. And good hair bleaching/dyeing is expensive!",
            "Ok I have a stupid question. With the chlorine shortage, I have some kind of solar thing with a copper rod in a basket which has worked really well. I still use chlorine tabs but significantly less. Pool store told me to shock my pool. Since I have more faith than green haired lady, is this a bad idea? I like my hair",
            "I had nearly white hair as a kid (super blonde) and I have had green hair from certain pools.",
            "She discovered it's not easy being green.",
            "Not just dyed hair. I'm a natural blonde and started every school year in Phoenix with green hair.",
            "Nothing sums up customer service more than “I’m not going to argue. I don’t work on commission.”\n\nHell, I work in a deli and people still manage to ask for stupid stuff, which I’ll happily give them.",
            "As a pool owner every year we take a water sample to a pool store, drop $$$ and go home and add everything in the correct order as instructed.  Always have crystal clear water.  It's easier to do it right the first time than try it on your own and then spend time and money trying to fix it.  As long as we get it started correctly every season then it's easily maintained.  Always listen to the expert.",
            "I competitively swam for most of my childhood and yes your hair can turn green and get weird stickiness for being in the pool water. It can even happen to people with dark color hair. I used Ultra Swim shampoo to fix it.",
            "Wives know better.",
            "I feel like if you can afford to have a pool, pool maintence is nothing in comparison",
            "Life is too short for arguing with male Karens. You did your job and informed them of the consequences should they do things their way. Epic ending to a savory story.",
            "In a pool owners defense, I’ve met 1 person at a pool store who could tell me what the chemicals were that I needed and also explain why I needed them / what they did. One. Either the other dudes didn’t care or didn’t know. It was so frustrating too because I was legit trying to do it right.",
            "Got to love how Customers wan the \"5 Star\" Restaurant treatment and food but are only willing to pay $5 for it!\n\nMan, I am *not* going to miss retail!",
            "As a natural blonde, I can tell you it doesn't even have to be a recent dye job to turn your hair green. At public pools (especially if you swim frequently) i strongly recommend soaking your hair thoroughly in a shower before getting into the pool.",
            "For anyone curious/needing to know, there are shampoos and other products that help remove chlorine buildup and thus remove the green tint. Some salons have special treatment options too.",
            "Oh man, that had to have been worse for the husband than if his hair had turned green. Not only his wife but maybe the daughter's hair too, and her friends'? \n\nThat dude probably didn't hear the end of that until his dying day. Holy crap.",
            "I worked for a property that had two pools for the residents there, problem was that the \"pool maintenance\" guy had let the pools go and they turned green with algae. It took me a month of being in the water to properly scrub the walls and bottom to break-up the algae heads so that the chemicals could kill it off.\n\nThis \"pool maintenance\" guy also had a very piss poor attitude towards the chemical vendor and that caused problems. I asked the property manager if I could deal with the vendor and was given the go ahead. I would greet them by name when I called to place an order and we developed a good working relationship.\n\nIt is VERY important to listen to the people who test your pool water and recommend ways to treat the water, and try to create a good working relationship with them.",
            "So funny",
            "Hah. I expect he spent plenty of time contemplating that mistake on the couch.",
            "I used to work at a hotel, and our pool was outside with a gate. Any time the chemicals were off, we would lock the gate and post a closed sign and people would still jump the gate to get in.",
            "Oh man I just KNOW he got his ass chewed.",
            "As a very blonde child I often had green hair from the various pools I swam in.\nWashed out with either beer or egg whites.\nSo this is why.",
            "Wouldnt it be cheaper to just empty the pool and refill it, add chlorine, and call it a day?",
            "At first I thought the wife was the customer and that she did this to herself. I bet she was PISSED! I feel so bad for her.. and her husband, for he’s still probably sleeping on the couch!",
            "When I was in high school had a family that all had green hair.  Only family around that had a pool.  Called them the “green Deans.”",
            "I maintain the pool in my backyard, and it's *so easy* if you just do what the guys at the pool store say! You can whine about the price of chemicals all you want, but in the end, you either buy the chemicals or you end up with uncomfortable water at best. Or you can get algae bloom or even (in this case) green hair. And for what? So you can save a few bucks?\n\nI get that chemicals are expensive, but skipping on them isn't being frugal, it's being *cheap*. And when it comes to maintaining a pool, there is nothing more expensive than being *cheap*.",
            "I work at a pool, and we have a baby pool that can never maintain its chemicals. The amount of people that don't have the slightest grasp of basic chemistry is astounding. No, we didn't close the baby pool because we dont want to watch it, its because THE PH IS LOW AND THE CHLORINE IS NON EXISTENT",
            "What I'm seeing here is an easy way to dye my hair",
            "Scew the rules? You'll have green hair.",
            "Fucking finally one that doesn't require me to schedule time off from work to get through!\n\nBravo btw. Just let it play out like a boss",
            "I think part of the problem is we get BSed by experts all the time, from the $70 car air filter to needing a bigger a/c unit to whatever, everybody's always upselling.",
            "The local pool turned my sister’s natural blonde hair green. This would have been the early 90s. Today I learned that’s because they were managing the pool chemicals wrong.",
            "I wonder if she was so mad with her green hair that she fired him from taking care of the pool or if he was just too ashamed to come back to admit he was wrong.",
            "It’s usually the more sensible one that gets the experience of having to pay for someone else not listening. I just feel bad for the wife, I am sure she wasn’t too happy about it. I mean, you told the husband that he needed everything and he was just being stubborn, yet she is the one with the dyed hair. It’s not cheap for either, relatively speaking.",
            "Man goes to buy chemicals; refuses to believe chemistry as explained by helpful staff. Clever, very clever.",
            "Some people PAY to have their hair tinted green!",
            "Lol who tf owns a pool but then thinks anything is too much? Buddy, think about how much money it costs to build, let alone maintain lol you should be wiping your ass with 250 bucks  friend",
            "It’s crazy but the saying: “buy cheap, buy twice”,.... bet his wife was livid! Hahaha “no sex till my hair color returns Jack!”",
            "When we moved to the country, where the shower was supplied with bore water, my blondish hair took on a green tint, as well. \n\nI don’t know how it resolved. Perhaps my hair got used to it, or perhaps the green didn’t show through as much as my hair slowly darkened (to an oh so attractive mousy brown colour)?",
            "Oof. Getting the wife's hair color corrected probably cost more than the guy paid for the chemicals.",
            "I used to work for a large pool supply retailer as well, and I always loved when they didn't want to listen about the copper. They come back 2 days later all mad with stains all over and get to spend an EXTRA $100-$150 for the stain remover.",
            "Hahaha, this happened to my blonde friend back in the 90s, swimming in an old pool",
            "Ooof poor lady, if she had no idea I assume she panicked for a second til her genius husband connected the dots.",
            "[removed]"
        ]
    },
    {
        "post_id": "a9jv8r",
        "author": "m4n3ctr1c",
        "title": "You want four? You get four.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a9jv8r/you_want_four_you_get_four/",
        "score": 20317,
        "num_comments": 270,
        "created_utc": 1545784654.0,
        "selftext": "Rather minor, but cashiering doesn't offer many opportunities for MC, so I'll take what I can get.\n\nOne of those very loud customers came up to the counter and tossed a round battery onto the counter. \"Hey! You have that battery?\" I check the size, and confirm that we do sell 2032s. \"Well, are you gonna go and get it?\" I walk over to the battery rack, pull one out, and return to the register.\n\nAs soon as I step back there, and no earlier: \"I need four of those!\"\n\nI go back out, and instead of putting it back and grabbing the four-pack, I pull down three more single packs and once again return. All together they cost about twice as much as the multi-pack, but you can't put a price on shaving ten steps off your shopping trip.",
        "permalink": "/r/MaliciousCompliance/comments/a9jv8r/you_want_four_you_get_four/",
        "comments": [
            ">You have that battery?\n\n>No, that’s yours, I saw you bring it in. \n\nEdit: thanks for the gold! For essentially a loosely referenced Patrick quote",
            "Gotta love the asshole tax.\n\nEdit: Holy crap, best Reddit Christmas present ever! Not only is this my top comment, I actually helped spawn an awesome subreddit! Thank you to everyone. :)\n\nEdit 2: Gold? Nice!",
            "Simple yet satisfying.",
            "Nice a simple. Actually less work to not have to bring the old one back too. ",
            "Asshole taxes are my favorite MC",
            "I wanted to make a joke about \"There are four lights!\", but nope... you made me smirk with a satisfactory MC nod.",
            "'Hey, do this thing that I could do more easily and take four times longer and charge me four times more for it!'\n\n'Uh, okay...'\n\nNice.",
            "The lazy tax has been paid",
            "Oh man, our batteries are locked away, and I love it when people can't even see the cheaper packs even when I POINT IT OUT TO THEM.\n\ncust: I need AAA batteries\n\nme: how many would you like? We have..\n\ncust: 8\n\nme: ok we have the 4 packs on sale for $3, or you can get it in an 8 pack for $8.99.\n\ncust: I told you I needed the eight pack!!\n",
            "We'd always run out of 2032s. They were super popular ",
            "I used to do something similar at a McBurger place I used to work. Customer would ask for a Big McBurger so I of course would recommend the meal. They would decline but then request a fry and drink with it. Ok buddy, have fun paying full price for the individual items.",
            "That's the asshole tax. ",
            "[deleted]",
            "When I worked in retail (grocery store), if this happened, everyone including our manager would have told the customer to go get it their damn self. I don't know of a single grocery store that isn't self-service. Self-entitlement is one of the worst qualities in humans. ",
            "Perfect for Christmas. MC all wrapped up nice and neat with a bow!",
            "I like this story.  It reminds me of things my brother used to tell me when working retail desk at a wholesale store.",
            "\"sir, having a commercial account with us does not exempt you from the federal law requiring us to receive your old car battery when you buy a new one or pay a fee\"",
            "Does anyone NOT have a cr2032? Shits ubiquitous.",
            ">2032s.\n\nIs it weird that I know what the battery looks like off the top of my head?\n\n\n\n",
            "This may be short, but this is one of the best MC posts I've ever read.  Perfect, just effing perfect.",
            "Score one for the proletariat. Well done.",
            "There's absolutely no way I would've gotten that battery. I would've said,\n\n\"They're right over there.\"\n\nOr, since he was so rude,\n\n\"Sir, I don't SHOP for you. I just ring you up.\"\n\nI'm so done kowtowing to customers. They can suck it. He can get his own damn batteries. ",
            "Sounds like.... he got exactly what he was asking.... four. 😎",
            "Should have only grabbed two more, then he'd have 4 including his original one.",
            "Who doesn't have 2032s? Now go find me 237 2065s",
            "r/pettyrevenge",
            "Honestly batteries are the most fucked up things I've seen with regard to pricing. It's expensive, and worse, have prices all over the place.\n\n&#x200B;\n\nYou'd assume the pricing per unit goes down sensibly as you buy a larger pack. Nope. I've seen it goes down, then back up, and down, all the way from a pair to a 36 pack. I even recall 5 x 4pack was cheaper than an 18 pack, same brand, same type.",
            "I applaud you",
            "> you can't put a price on shaving ten steps off your shopping trip\n\nHehe, so many people are all about this.  And it isn't about the time either, they're just apparently too lazy to walk a few extra steps.  Because I see people drive in circles in the parking lot for 5 minutes just to avoid walking an extra 50 feet.\n",
            "good one",
            "Ah, do you happen to work in the auto parts industry as well?",
            "You just made me say I definitely need to add this subreddit to my list. :)",
            "Well done, friend. I did shit like this all the time when I worked at Radio Shack. ",
            "Isn't this worth doing as a standard business practice for a greater profit margin?",
            "How can people be such assholes. Must be rich spoiled brats. ",
            "You committed battery.",
            "This might have been a attempt at getting you away from the cash register to steal other items",
            "I hate retards like that. ",
            "off subject but my bud scale, and laser use 2032's. Prices for those are rapey",
            "Some customers try to steal from the register if you leave it unattended like that. They may have been shady.",
            "Radioshack?",
            "You sell Batteries in single packs where\nyou work?",
            "[removed]",
            "What did he even do jesus ",
            "This is why I tell my customers to shop online for those batteries.  Not only can you get those batteries for about $1.50 but also don't have to worry about that guy and his malicious compliance.   \n\n",
            "[removed]"
        ]
    }
]