[
    {
        "post_id": "e8t7w2",
        "author": "AsherMorte",
        "title": "He's finally gone, and all I had to do was nothing.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e8t7w2/hes_finally_gone_and_all_i_had_to_do_was_nothing/",
        "score": 20038,
        "num_comments": 587,
        "created_utc": 1575996964.0,
        "selftext": "Do you know that guy at work that every one hates? The rude, obnoxious, lazy one that no one quite understands how he still has a job? Well mines name was Bob. For months Bob \"partnered\" himself up with me with a lovely 90/10 split of the work. Any time I called out on it he got more and more obnoxious, and if it was actually possible did less and less work. \n\nOn top of all of his other charming traits, Bob is an absolute phone addict. This is bad enough in a regular setting. Where we work it's actually very, very dangerous not to be paying attention to what's going on around you. I've mentioned this to Bob repeatedly to no avail, even after he was nearly hit by a forklift and almost had his head smacked by a robot. Our manager at the time said \"if you're stupid enough to die because you wouldn't put your phone down, no one's going to miss you\" and ignored the behavior. My last straw at even attempting to get this guy to work and be safe was him snapping off \"Leave me alone about my fucking phone.\" \n\nWell we just got a new manager, partially because of our former managers attitude towards safety issues, partly because of poor performance. The new manager had a quick, to the point meeting at the beginning of our shift and stated very clearly \"I see your phone, you're fired. No excuses, no exceptions.\" Bob missed this meeting because he was running late, again. \n\nAbout two hours later I see the new manager walking to our area. Bob as usual was head down staring at his phone. Remember when he specifically said to leave him alone about his fucking phone? Well, that's exactly what I did. Our new boss wound up standing behind him for a solid three minutes before Bob even noticed he was there. Bob was promptly escorted to HR, and I was apologized to by the new manager, because I'd have to run the work area solo until a replacement was found. No big loss. The extra 10% is well worth knowing that guy won't be around anymore. Guess no one at that job will bother him about his damn phone again\n\nTldr: Work place phone addict snaps to leave him alone about his phone, so I did. Now he's fired and I'm grateful.\n\nUpdate: A lot of you were very worried that I would be stuck running a two man job solo for an extended period of time. I just want to let you all know that Bob's replacement was less than a full shift away. So far, so good. Not to mention I'm getting trainer pay until he is up to speed. \n\nEdit: Just for clarity, the no phone policy wasn't new. It is in our employee handbook and we have signs posted around the shop floor about no cell phones in the work area. The only change was a manager that took the rule seriously.",
        "permalink": "/r/MaliciousCompliance/comments/e8t7w2/hes_finally_gone_and_all_i_had_to_do_was_nothing/",
        "comments": [
            "Your former manager deserved to be let go.  I worked with a group of construction guys in a tight-knit community once upon a time and the manager was absolutely RABID about following safety precautions to the letter.\n\nIt seems a couple years prior, he allowed an employee a little grace in being slightlly lax on security procedures, and that employee died in a workplace accident and he said he will never forgive himself for the way his friend's widow looked at him at the funeral.\n\nNow when the guys groan about safety, he just tells them, \"Shut up.  Sit down.  Listen.  Learn.  Follow.  I promise you that I will fire all of you before I risk burying one of you.\"  They believed him.  We ran a very safe shop.",
            "Just keep in mind, if it appears that you can run your work area solo and effectively have been for some time, that replacement will likely never materialize; why pay two people when one will work twice as hard?",
            "I read this on my phone at work.",
            "Glad the new manager followed through on that threat. Sounds like he likely saved everyone from a serious workplace injury.",
            "No lie, after paragraph two I thought you had gotten rid of Bob with a permanent solution. I'm actually glad that Bob just got fired, and not got killed.",
            "Well written, no obtuse acronyms, contains actual MC, upvote :)",
            "Had a former colleague who always, always coming late everyday. I work 8-5 everyday with only a day off. And that guy always come at 1 or 2 PM. Sometimes he will come at 9 and leave at 2 PM. Everyday. My boss found out and he got fired right away",
            "It always amazes me when employers don't take workplace safety seriously. Do they not know they can be held personally responsible?\n\nThat goes for non managers too. If you know about an unsafe situation and don't report it, it's your ass when something goes wrong.",
            "Mine was my manager. He was awful never bothered to learn the job so you could never escalate a query basically sat in his chair lording it over us all day.\n\nAnyway, at the time I was also a union rep and asked for time off for a disciplinary and he said 'only if I hit target that day'. So in front of the whole team I said ' that's not how it works either I can have the time off or I cant, they need to know today to sort cover if I cant go'. His face was an absolute picture as my whole team and the surrounding teams looked between us. He eventually capitulated and I went to the meeting.\n\nThe following week we had a sudden restructure of the teams. He was no longer my manager. He didnt last much longer in the role either. Good riddance I say.",
            "Holy God, for a large part of that story I thought you knew MY FUCKING LAZY PHONE ADDICTED BOB in a factory setting where he is hated and the plant manager got fired several months ago. 😂 I realize this won't mean anything to anyone, I was honestly just so shook I couldn't not document the moment.",
            "I like how the new manager waited a few minutes; you can't even attempt the \"I was only checking a quick text from the wife\" excuse if your face is buried in the screen for 3 minutes.",
            "There should be a sub titled Enough rope to hang him self.",
            "This is Bob. \nBob never puts his phone down.\nBob could have died.\nDon't be like Bob.",
            "I really hope you stood there, you and your new manager eyeing each other, and eyeing Bob, both waiting for him to notice. I did that with my supervisor. Most satisfying thing I've ever been apart of, watching him turn around and just go pale lol",
            "\"If you hook me up with a 30% raise I'll run it solo for the rest of the year. It'll make your numbers look great!\"",
            "I will NEVER be able to understand how people don't get the basic concept of 'it's work time.  Put your phone down!' They totally wreck it for us that would like to be able to answer the odd call or reply to text from family because the boss has had to go all NO PHONES!  I was working with a guy once who's job was literally to look around for things.  Stared at he's phone for 50% of the time, so my team ends up looking like shit.  \nHow is it not obvious to put the thing away.",
            "SAFETY\n\nRULES\n\nARE\n\nWRITTEN\n\nIN\n\nBLOOD.\n\nSometimes more than once.",
            "The good thing about safety issues like that is, especially if you can verify you've warned/informed the employee, if something happens to them and they get injured, it's on them. Granted, however, there ideally should be a paper trail including disciplinary write ups and such, in case said employee tries to pursue legal action.",
            "Ladders.   When you see the word 'ladder' think 'self harm device.'   But tell someone they should not balance on the top two steps and you get 'I know what I am doing.'",
            "The irony is not lost on me that I am reading this while at work.",
            "When I was an overnight manager I had a guy like that.  I didn’t really mind as long as it didn’t get in the way of the job but one night we were buried and I needed everyone at 100%. I saw the guy on his phone and asked him to please finish his call and put it away. That we had a big night ahead. Once we were done spotting the load I gathered up my crew and noticed that the phone guy was missing. One of my part timers handed me his cutter and said he quit after he was done with his call and left.",
            ">Our manager at the time said \"if you're stupid enough to die because you wouldn't put your phone down, no one's going to miss you\" and ignored the behavior.\n\nWell that's just wrong.  There's all kinds of ways Bob getting himself killed could negatively affect all the rest of you.\n\nYour pay could be cut for losing some bonus related to no-injuries-in-so-many-days, whatever accident kills Bob could also end up hurting you, or if nothing else you might have to sit through a safety standdown powerpoint meeting entitled \"Don't do what Bob did.\"",
            "You know what they say. Play stupid games, win stupid prizes.",
            "Can remember a similar story in a care home I worked at: one of the night staff was asleep on duty, the manager came in to check and apparently stood and waited for her to wake up for 10 mins then fired her on the spot.",
            "The old boss put up with tons, nevermind bad performance. New boss did NOT put up with stupidity, good for you.",
            "This reminds me a co worker who was the same, and got bitter after getting fired stating nobody at work backed her up.",
            "If you were doing 90% and now expected to do 100%, your work load didn't increase by 10%. It increased by about 11.1%.\n\nGood luck!",
            "Ahh karma hit bob hard.",
            "I have one but his names Robert. Somehow even got\nEmployee of the month. It pays to be able to talk about sports for hours with your boss.",
            "My current manager is this way, he's 70 years old and looks 120 and doesnt do shit all we do load lumber at our sutherlands location and while he's sitting",
            "Now, was this Bob's last warning with the company? Or was it already policy to not use phones on the floor? \n\nAs he wasn't there for the new rule, I'd say he's probably got an excellent chance here at an unfair dismissal suit.",
            "For real worked with a guy like this. His name really was Bob.",
            "I would understand if someone intentionally tries to be obnoxious or just doesn't care about their job that much, so they just play with their phone all day.\n\nBut what kind of idiot just blatantly disregards safety regulations, with full understanding that they could get injured or worse, killed, because of doing that?",
            "I was doing after school bus duty as an elementary school teacher. There was a big red line on the sidewalk that the students were not supposed to cross when waiting for their bus. Once a 5th grade boy knocked a football out of his friend’s hands and it rolled under the bus. The first boy crawled under the bus in front of the front tires to retrieve the ball. I was about 100 feet away when I saw this rapidly unfolding and started yelling at and running towards the boy. \n\nHe had already crawled out from under the bus when I got to him. I was so upset when I verbally reamed him out that I must’ve had veins popping out on my forehead. As part of my tirade, I explained that my father’s only brother had been run over and killed by a truck passing their home. Plus, my husband’s older brother was killed by a school bus when he was goofing off with some buddies and fell under the bus as it was pulling away from the curb. (My MIL never recovered from that loss. Hence my very strong reaction.)\n\nFortunately the bus had been turned off, door closed, and the bus driver wasn’t in the bus so there was no immediate danger. However! \n\nThe red line was there for a reason.\n\nMy face was still flushed when I told the principal and front office about the incident about 10 minutes later.",
            "Classic Bob!",
            "Ok so I’ll be honest I’m the lazy one but I’m not rude or obnoxious so that might be why I still have a job",
            "I like to say to people like this \"Get your head out your arse\".",
            "Did everyone celebrate the \"end of an era\" with brewskies at 5? I know it sounds harsh to celebrate someone being let go, but Bob's lack of safety and always on the phone, plus the old manager's care for workplace safety sounded like a risk to all employees!",
            "My workplace has a guy who fucking STINKS. And I mean STINKS. He’s crap at his job, rude, ignorant, and did I mention he fucking smells like he eats shit for breakfast?\n\nAnd guess what, he just got a promotion.",
            "If it was a 90/10 split, you’re actually doing 11% (well, 11.1111...%) extra work. Felt like you’d wanna know.\n\nEither way, fuck that guy, go you!",
            "The outcome that dreams are made of....",
            "Even if you'd warned him, matter of hours or days before Bob gets caught with his phone out.",
            "See ya Bob!",
            "Iirc it’s already gone. Oh well",
            "This is why in schools, teachers shouldn’t take away phones immediately. Students need to learn to handle putting away in certain circumstances themselves to have that experience when they get out of middle/high school.",
            "Oh man. You had me at 'Bob missed that meeting'. And it was **glorious**",
            "I tought he was gonna die when you mentioned the workplace being unsafe if you aren't paying attention.",
            "Don't Be Bob.\n\n&#x200B;\n\nBob Has No Job.\n\n&#x200B;\n\nBad, Bob, Bad.",
            "How long was there between him telling you to leave him alone and him being fired?",
            "I hope you really milked the agony of having to do the job of \"two people\".",
            "[deleted]",
            "I've worked at a few factories, they all have the no phone policy. So this guy clearly ignored that during orientation. They literally cover that day one. Typically with a \"If they see your phone you're fired.\" \n\nI even worked at a Home Shopping Network distribution warehouse where they had a security team and scanners and kept your phone up front. Couldn't even get it into the office. IF you managed to sneak it in, they wouldn't even HR you. They just walked you out front and shoved you out. Like, bye dude. So it amazes me that it took so long for this dude to get fired. \n\nHowever, props to HSN DC. They let you take MP3 players into work and listen to music with headphones, as long as the MP3 player and the headphones were not styles that HSN sold. Only factory I've ever worked at that let you listen to a personal music device.",
            "Very disappointed this didn't end with guy impaled by forklift",
            "I'm surprised HR let Bob get fired without prior warning.",
            "One thing I've learned over the years, it doesn't take much effort to get bad coworkers fired, managers eventually will do their job.\n\nSometimes a nudge is helpful though.  Like the time I simply mentioned to a manager a bad coworker was drinking a stolen beverage.  Dude was canned within the hour, and my supervisor shook my hand, thanking me for getting rid of the guy.",
            "[deleted]",
            "God I wish dealing with one of those right now, happy to hear you're out of that situation.",
            "Meanwhile I’m sitting on the porcelain throne at work waiting to leave lol",
            "Savage.   I love it.",
            "Absolutely perfect. Nice work.",
            "Pokemon and Sims on the same track!",
            "luigi is that you",
            "He isn't doing any work. He's chillaxing.",
            "Satisfaction...😁",
            " I thought the guy was dead or something",
            "Didn’t really matter that you didn’t tell him. He wouldn’t have listened anyway",
            "Bbn v  v  bnb bvb b b b v b v v.  V.  Bvb bbn v bgg v b v b v.   V.",
            "Dang kids and them cellular telephone devices."
        ]
    },
    {
        "post_id": "c40onw",
        "author": "None",
        "title": "Got used for free photography, made sure a special friend was included.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c40onw/got_used_for_free_photography_made_sure_a_special/",
        "score": 20036,
        "num_comments": 360,
        "created_utc": 1561275532.0,
        "selftext": "I’m not a professional photographer, but I do have decent equipment and portfolio so a lot of friends will hit me up for discounted photo shoots. Most of them pay or at least buy me dinner, but others expect me to do it for free...\n\nI’m close with my ex-boyfriend’s family so I was thrilled when his younger sister asked me to come to her prom pictures earlier this month, until she told me to bring the camera. I did mention to her that I’m doing online school and I have an exam due that week so the pictures might not be ready for another week. She was fine with that. \n\nWithin two hours of taking pictures of half a dozen high-school students, I ended up with 300+ shots because everyone wanted the perfect Instagram shot. Whatever, I can go home, study, and slowly work on sorting through the pictures later. They’re not paying me so I wasn’t exactly motivated either. \n\nI get a text from her and her mom that night at around 11pm, they want the pictures edited AND uploaded by the next morning so they could be shown off on social media. I tried to explain that I’m studying but they weren’t having it, they said, “We don’t care how you edit it, just make it look nice.” \n\nFine. \n\nI spent the next 3+ hours working on the pictures and editing them really nicely that even I was proud of....then I hid Shrek into the background of every single picture. Shrek with his head poking out between the kids, Shrek posing happily, Shrek had a very nice time at prom evidently. I uploaded the pics and sent them off, no one noticed the extra guest for weeks and I got my ear chewed out because my ex’s sister didn’t appreciate her  900 followers on Instagram seeing Shrek grinning between her and her boyfriend.\n\nThey asked me to edit however I wanted, so I delivered. Shrek was one of my best clients I’ve ever had.",
        "permalink": "/r/MaliciousCompliance/comments/c40onw/got_used_for_free_photography_made_sure_a_special/",
        "comments": [
            "You did well. Hope your exams went well.\n\nI am asked to “help” with electrical needs from friends and family and my answer was always the same. “No problem but I’m kinda busy right now.” I would never charge but unless it was *OMG!!! Your house is gonna burn down bad* then your fancy switch was gonna wait a couple of months. It kept down the requests. \n\nIn your case if something like that happens again you could say “Oh sorry but I’m super busy and have to put my paying clients first. I mean they are paying the bills, right?”",
            "Next time someone invites you to an event/activity and asks you to bring your camera, you should \"accidentally\" forget the camera at home.",
            "[removed]",
            "So did you tell her to check herself before she Shrek'ed herself?",
            "**\"UNPAID PROOF\"** right over the duckfaces.\n\nBut the subtlety of Shrek in every photo is kinda nice too, since they were shared far and wide before anyone noticed.",
            "I would pay extra to have Shrek hidden in every picture I am in. It would distract people from looking at me.",
            "Why, oh why, do people expect you to do something free for them ? Hire another goddamn professional or pay the person to do it. \n\n I am an interior designer and can't tell you how many times i hear the old \"maybe you can stop by and help me with my kitchen /living room/ bathroom design. I get paid to do this for a living and i am not doing it for free for you. \n\nI will help my BFF from high school out and a few others without charge but i expect that they will buy their kitchen materials from me so that i make some money on it. If not then find someone else.",
            "Learn to say no.",
            "My wife did photography for a while. The worst clients were always the free or discounted sessions. You had the perfect storm of PITA:\n\nFree\nFriends\nTeenagers\nLarge group\nSpecial event",
            "As a fellow photographer, you really need to just say a flat no. Doing things for free for \"exposure\" or \"word of mouth\" is a bad idea.\n\nIf you just can't say no, tell them: \"My rate is $100 per hour (or whatever) and my friends and family discount is 10%. Let me know when you want me to draw up the event contract.\"",
            "Should have just put large text over the picture\n“Work provides for free by Shinethedog.”\n\nRight over their faces. \n\nShrek is cool and all, but easily not noticed.",
            "Good on you.   You were up-front about the probable delay. \n\n&#x200B;\n\nI assume you're not so close to your ex's family after this little stunt?",
            "Ugh. This makes me angry. I would rather have heard you say that you predicted this would happen, so you turned off your phone at 7 for the whole night so you could concentrate.",
            "You should always ask for pay before giving them the pictures.\n\nIf they want them edited, pay for it, if they dont want them edited, you can do whatever you like with the photos.",
            "Why didn't you put your watermark on them? Then you could've gotten more \"exposure\".  Lol.  But great job with your Shrekking.  Hope you passed your exam!",
            "\"Unless you're going to pay for the time I spent taking the pictures and the time I will have to spend editing the pictures, the answer is 'no.'  And if you ask again, I will delete the pictures and microwave the SD cards.  My rate is $20/hour for the photo shoot, $30/hour for the editing, and $50/hour for the rush job on the editing.  Now off ye fuck to /r/ChoosingBeggars unless you have cash in hand.\"",
            "I love this. Good job. Excellent job.",
            "r/choosingbeggars",
            "I don't generally mind doing free photography for friends, however I don't edit them.\n\nI'll use the camera, they can spend the time with the computer if I am doing it for free.",
            "While it's nice MC, why didn't you remind her she was fine with pictures being ready next week?",
            "I'm a tutor, and I get to deal with people like this far more than I expected. As soon as they find out I tutor, they say 'oh, maybe you can help my son/daughter, they've been struggling.' I always respond that I am happy to, and that we can see how it fits in my schedule. I also mention that my normal rate for 1 on 1 tutoring is $15-20/hr (depends on what level math) but I am happy to go lower if it is a family friend or someone I like. There are very few responses once I tell them what my going rate is. People don't seem to realize that I get paid ot my job for this, so why would I use up my free time doing it for free?",
            "People should just pay their photographers. Even at only €1/picture it would have been worth it for them and for you.",
            "I'm familiar with this abuse of talent, you need to charge going rate for your time and skill, people love to take advantage of you because you don't, especially family... your work is worth money, they will spend money on the next person who charges, do yourself a favor and get in that line....hell give it back in other ways if you want but don't put a sucker sticker on your head..imho...",
            "How are they gonna demand you finish it by a certain time when they didnt even PAY you??",
            "Why didn't you just ask to be paid? \"sure I can get you those pictures but it will take x amount of hours, how does y dollar amount sound?\"\n\nOf course I don't know if you did this. But they wanted nice pictures, you had the skills and had taken the pics and were already talking about them with the parents, who have the money. Did you try for this kind of a win win?\n\nI feel like you may have burned a bridge where there could have been a normal exchange of services for cash, whereby instead you spent hours photoshopping Shrek into someone's prom pics that you could have spent studying. But again, I don't know your situation.",
            "> It's 11pm and I want the pictures uploaded and edited by the next morning. I don't care how you edit it, just make it look nice.\n\n> K, my hour rates is XX$.\n\nAlthough you would loose the chance for malicious compliance this way.",
            "They weren't the sharpest tools in the shed",
            "You need to start charging people for your services.",
            "I want to see these pictures",
            "Cool idea but you were way too nice. Should've PayPal'd them an invoice",
            "Why not say \"No\"?",
            "r/choosingbeggars",
            "Why didn't you just not do what they asked ?",
            "Guerilla-photo editing is a fabulous art.",
            "They would have got a polite 'fuck off' if I did them a favor and they then demanded I work to their schedule. The only photo editing I'd have done that night, is a crop of the message where you said they would be a week or so, if it was verbal than I'd have just sent them a message reminding them of the conversation.\n\nIf they still demanded I do them the same day, I'd have given them the price for same day editing, depending on how they react to that (if they don't pay), I'd have either just sent them all the shots unedited and told them to have fun, or deleted the lot.\n\nYou don't need people in your life who don't appreciate when you do free work to a professional level, using your own expensive equipment.\n\nI'm decent with computers so often get asked for help from family and friends (sure 75%+ of people here can relate), I've even picked the parts and built PCs for several friends. They are fully aware they do it on my time though, not when they want me too. For the builds I did them the day the parts came, but thats because I knew they where coming and could plan for it (plus I know what it's like to have new parts and want to play), but if I'd have told them it would be a few days and they demanded I do it there and then, they would have got a link to a building guide on youtube and a good luck message",
            "Id have just said “fuck off, im doing you a favour and i told you they wouldnt be ready for a week. My exams are more important than your instagram! Keep bugging me about this and ill delete the photos and format the memory card”\n\nBuuuut im an asshole",
            "Anytime is free, tomorrow is $500.",
            "Shrek is love; Shrek is life.",
            "I don't understand how you think you scored a victory there. All you did was sabotage yourself.",
            "Why does a high school kid have 900 followers?  That strikes me as really creepy.",
            "[deleted]",
            "Hey op, this would fit in /r/choosingbeggars as wel.",
            ">Accepting payment in both exposure and spiteful edits. \n\n\"Modern problems require modern solutions\"",
            "I'm glad that my future industry is one that it's hard to make requests for without sounding bad for asking.\n\n(Writer - not an editor). The only request I got that was fair was to join a creative writer's circle where we would read eachother's work and try to get \"publication ready.\"",
            "You are in inspiration to us all.",
            "Yeah I would have deleted all the pictures and told her to fuck off. You're a better person than me.",
            "As a fellow photographer, at the very least, if not cash, they could offer a trade.\n\nI usually accept food and booze, if they don't wanna pay chash lol",
            "Wow, gotta admit, you handled that better than I would have. I probably would have deleted all the images",
            ">they want the pictures edited AND uploaded by the next morning so they could be shown off on social media.\n\nThat's when you either say: \n\na) my rates for expedited edits are $XX\n\nor\n\nb) This shit is free so you'll get them when you get them.",
            "“We don’t care how you edit it, just make it look nice.”\n\n**“We don’t care how you edit it\"**\n\nPerfect.",
            "My dad insists on paying for my car insurance, so my parents get free tech support. That’s it. Everyone else pays in cash or dinners out.",
            "Should've added Donkey too, since they were being asses.\n\nWell done!",
            "Why did you waste so much time? Why didnt you just block them for a week?",
            "You fool! You missed a golden opportunity. You should have had  Shrek  mooning them!!!",
            "Thanks for the laugh, that’s hilarious. Hope your exams went well friend.",
            "Wow.  For one person Id have taken the pictures and not edited and not charge probably.  For a whole school, with editing, youd better believe Id be charging.",
            "Omg you're my hero!",
            "Can you link some of these please, with face blurred out? I need to see this",
            "You showed mercy. I'd have had Kirk Johnson show up in some capacity— possibly his classic original work.\n\n>!He's the goatse guy, but apparently has a Pornhub channel where he makes that look tame. No, I'm not dumb enough to look.!<",
            "The ex’s sister is a choosing beggar and a bully to Shrek",
            "The whole thing reminds me of an LPT I saw a while back. I would totally credit the guy for it if I could remember who he was, it was like a year ago. If you have friends or family that provide a service like that either as their day job or a side hustle or even as a hobby, never ask for them to do it for free or for mates rates or demand a family discount. Ask them for a quote like you’re any other customer. Don’t be a cheap asshole and try and take advantage of them because they’re family/friends. Chances are they’ll probably give you a discount or even do it for free or for something in trade like dinner or a six pack of their favourite beer or something if it’s a small enough job. Show them that little bit of respect and they’ll take care of you. But don’t be an asshole if they don’t offer a discount.",
            "You’re a genius, but most importantly you’re hilarious",
            "Hope your exams went well! I can relate as a student. \n\nAbout the EK, you should have edited him onto their faces, and make it so that Shrek was the only person at the prom.",
            "Can we see a pic?",
            "Could you post an example (just interested)\n\nJust found your comment thank you :)",
            "In college I had a friend doing photography as well. At one point I needed professional photos done, so I asked her to do it. Our agreement was simply giving her all rights to the photographs, so she can build her profolio.\n\nI was of course not an ass about any timelines and we were good friends.",
            "Ugh this pisses me off. I'm not a photographer, but I hate how you're treated like your job takes no effort and your shots should be available instantly. I WISH I had paid a photographer to take/edit my wedding photos. My MIL (bless her heart) took them, and most of them were very blurry and almost unusable. What you do is important. Regardless of the bullshit your customers try to say, the work you do is very valuable for memories. And getting the *perfect* shot matters. I love how you handled it. If they really cared, they would have noticed instantly. Not weeks after.",
            "This is beyond glorious",
            "You know what they say... \"Check yourself before you Shrek yourself.\"",
            "Show. Us. The. Shrek!",
            "“Aww, you don’t need me, photography’s easy, anyone with a camera can take a picture, plus, I charge like $100/hr.” - crickets",
            "I sew, very well. Everybody thinks it will just take a few moment s to fix their shit. ugh  Or could you make me a wedding gown or maybe some drapes",
            "Would it be wrong to have you post the pics with all personal details edited out so we can see all the shrek glory",
            "Ok but can we see the pics pleaaaaseee",
            "That's hilariously petty. If it were me I would have just told them if they don't stop harassing me over free pictures I'd just delete them all and they would NEVER get them. I'm not as creative as you apparently.",
            "You want the pictures by tomorrow? Or what? Not gonna pay me?",
            "[removed]",
            "I just got sent a message saying I was banned from this sub from another subreddit. Just testing",
            "My husband would have loved it",
            "To anyone else that would’ve been a blessing",
            "Oh, lol! I love this! Hope you put it on choosingbeggars, too.",
            "Beggers can't be choosers.",
            "Hm.",
            "I guess you're an actual photogreapher now",
            "I've always been the \"computer guy\" in my family. The first words out of everyones mouth at family get togethers are \"So my computer is....\"\n\n&#x200B;\n\nI've learned the only way to break the cycle of \"free work\" is to just start doing a really shitty job",
            "Not gonna lie, I read pornography not photography...time to rub one out",
            "This is some r/ResponsibleRevenge imo",
            "Does this happen a lot in the trades? I'm thinking about an apprenticeship and don't have a backbone with my family.",
            "This is genius :D Thanks for the lolz",
            "Got a sample of thise shrek pics?",
            "I would have loved that, bloody hilarious",
            "So does everyone hate you now?\n\nI hope all went well with your exams.",
            "What equipment do you use?",
            "I always shoot on raw+jpg so i can deliver unedited photos to impatient clients",
            "I like your style, but I would have just told them to get over it and if they want express service they should pay",
            "Hah! Subtle Revenge. I like it.\n\nThat used to be me with computers, until my aunt asked to help remove Norton (back in the late 1990's) and asked me how much I charge. $40/hour.\n\nIt involved me going through Windows 98 regedit and surgically removing every key, to get it fully gone. I'm not sure if there were any 'remove Norton' tools, at the time.\n\nAnyway, the story went out that she got what she paid for, and the calls for \"how do I do this with my computer?\" stopped.\n\nI still help out every once in a while, if I can (I've moved away and fallen behind from a lot of the 'behind the scenes' tech repair) but it's nice to have had value attached to a service I performed.\n\nI hope they realize what they asked of you, and will consider what the work actually costs, in time.",
            "I would love if someone photoshopped shrek into every photo I took for the rest of my life",
            "That is da best",
            "YES.",
            "Omg thats so fucking brilliant",
            "Dude fuck I'd pay to have shrek in my prom photos that girl was wacked out of her mind",
            "Shrek: What are you doing in my  prom!",
            "My SO is taking photography on the side as well, but when he's asked for a favor for free, he usually doesn't edit.",
            "As soon as I read \"special friend\" I thought you'd edit your penis into the photos.",
            "If she asks again, make sure something that looks a bit LIKE an out of focus penis is in everyshot.\n\nNot an actual penis, because then it's not porn :)",
            "That's a great story",
            "How dare you! You should give them the chance to refund the pictures!!!",
            "Richard Herring would love this.",
            "I feel your pain. My ex husband was a professional photographer before he needed a wheelchair.\n\nHe offered to photograph my brother's wedding for cost...being my +1 as m husband so a guest first\n\nThe brides mother proceeded to treat him like hired help till he finally has enough and refused to do the photography.\n\nIf you look at my first post it's actually this incident...it was insane so I get what you mean",
            "And all that glitters is gold!",
            "Somebody once told me",
            "_SHREK IS LOVE,SHREK IS LIFE_",
            "If you blur out everyone's faces, can you post pics?",
            "hey dude, where can i go and see those photos? :D",
            "I hate to ask, but do you have an album of these pictures for our viewing pleasure?",
            "Amazing",
            "Ngl I thought I read \"free pornography\" and only realized you wrote photography after reading the posts, reading the comments, leaving the post, and then wondering 10 minutes later what about your story had pornograhy in it.. I think I need a doctor.",
            "Post even a single picture you fake ass. A single one and I'll apoligize\n\nEdit:I stand corrected, I formally apologize. Although it's ridiculous to spend so much time on compliance in this case, that's the point of the sub, and if they're as subtly done as the example then that's hilarious.",
            "you're a fucking genius",
            "I like the cut of you jib",
            "I call bullshit.",
            "Pics or it didn't happen",
            "I guess she got what she asked for and got Shrekt for her trouble",
            "If they're your friends, and they appreciate your ability to produce professional photographs, maybe they should pay you extra instead of getting a discount...\n\nJust saying.  Why does it only have to go one way?",
            "Wow you're a push over. Grow a backbone and learn to tell people no.",
            "This is probably one of the only true stories I’ve read recently that have made the top posts. Well done! I wish I could’ve seen the reaction comments rolling in",
            "Fake",
            "Pics or didnt happen",
            "[removed]",
            "You chose to take the pictures and edit them, you're just being a dick or you're being dumb and think the world is unfair. Don't agree to do something you don't want to do, if someone asks you to take the pictures, ofcourse they want them ASAP. Nobody's gonna care about prom in a week or two.",
            "Am I ban"
        ]
    },
    {
        "post_id": "re5ity",
        "author": "rduncang",
        "title": "Ex wife wants to itemize and split the cost of everything",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/re5ity/ex_wife_wants_to_itemize_and_split_the_cost_of/",
        "score": 20030,
        "num_comments": 678,
        "created_utc": 1639246896.0,
        "selftext": "So my ex-wife and I used to have a great relationship. But she has become petty and somewhat vindictive these last couple months. Our relationship started going downhill after her daughter, my ex-step daughter, broke into my house and stole from me and my new wife while we were on vacation together. Yes, I invited my ex-wife and her boyfriend to come on vacation with us to so it would be a family thing. My (current) wife was completely fine with it. Not only did we invite them, we paid for everything, plane tickets, rental house, meals, activities, etc. We’ve done this before and it was nice.\n\nWhile we were on this vacation my ex-wife’s daughter broke into our house and stole from us. We had to file a police report because some of the things stolen was medication and we couldn’t get new prescriptions without filing a police report. This upset my ex-wife even though we told her before we called the police and she said “do what you need to do”\n\nBefore this, my ex and I would pretty much just buy what the kids needed while we had them. Every once in a while she’d ask me to split the cost of some things and I would. I have never asked her to split the cost of anything prior to this. But lately she has been asking to split the cost of just about everything. Fine, whatever. I usually get most of the things for the kids anyway. \n\nAbout a month ago my son needed new some equipment for indoor lax. She asked if I would split. I said fine. When she took him out shopping they couldn’t find everything. So I bought most of it online. I asked her what she bought and how much and I told her what I bought and how much. It turned out she owed me for the split. It was only $40, I would have let it go but she hounded me for a week over $5. This pissed her off. \n\nShe’d be fine when I have to pay her but gets pissed when she has to pay me. I only asked her for the portion of the split because she asked me to split the cost in the first place. \n\nWe argued back and forth and then she came up with a list of things we should not have to split and anything else we would split. So I started keep track of things that I paid for that were to be split between us. So she gave me her list and what I owe her, not a lot, I owe her $80. But when I gave her my list and her share, she now owes me $425.",
        "permalink": "/r/MaliciousCompliance/comments/re5ity/ex_wife_wants_to_itemize_and_split_the_cost_of/",
        "comments": [
            "She tried to play the game and got played herself.",
            "What happened with the ex-stepdaughter who robbed you?",
            "I'm guessing this is the last time you're paying for your ex to come on vacation with you?",
            "Start the spread sheet. I would take pictures of every receipt and itemize every expense. Time to be petty. This reminds me of some couple I have been on double dates one where they were discussing who ate more chicken wings, and what percentage of the bill each should pay down to the quarter. Of course not to be out done me and the hubby had to argue over our bill and at the last moment tell the waitress it doesn't matter who pays since it all comes out of the same account.",
            "How did you know who broke in?",
            "My nephew in law has a child from a previous relationship before he married my niece. \n\nHe used to pay a monthly amount and then additional funds through the year for clothes and hobbies etc. \n(Let’s say it was 200 a month for child support alone). \n\nEx has regularly stopped visitations and contact until mediation to put pressure on nil to give more money. \n\nThe last settlement agreement was\nThrough legal mediation and it was agreed that that mom would get £225 per month but nil would no longer have to pay additional costs as Mom would be paying clothes and hobbies. (It was all agreed and signed off).\n\nNil calculated that he was paying less per year on the new agreement as he no longer had the adhoc costs. \n\nAs soon as school is about to start, Ex wastexting nil that he owes X for the school clothes and Y for the school hobbies. \n\nHe just sent the mediation agreement highlighting it’s not his problem. \n\nHe also started filing for fully custody because ex was denying access. \n\nLast week ex dumped the child and their belongings on nil because she’s pregnant with a new money making baby and a teenager who hates her is too much hard work.",
            "What happened to your former step daughter?",
            "I used to go out to lunch with this group and we were always short because one person always ordered alcohol.  She would conviently forget to add that to her part of the check. It was amazing how that person changed what she ordered when we got separate checks. All of sudden we weren't funding her wine with lunch and water was fine.",
            "What's 'indoor lax' ?",
            "Title the spreadsheet \"ImSorryYourDaughterIsAFelon.xls\"",
            "My husband has stopped giving his ex wife cash for stuff for the kids. It happened too often that he gave her money to buy the kids X but then \"somehow\" it never got used for X. Now when they need things we just buy it for them. The kids got their own bank accounts and debit cards this year, so we'll give the cash to the kids now, but not to their mom.",
            "Don’t you get it?  Her money is her money. Your money is still her money but “it’s for the kids” lol!",
            "[deleted]",
            "I was in a similar situation on splitting shit with the ex, I just paid for whatever needed to be paid for. It's not worth the headache of keeping track and all the unnecessary interaction with the ex. It was super simple this way for me because I had custody but I guess it would be more difficult if I had not been the custodial parent.",
            "Why are divorces so expensive? Because they are worth it.",
            "My ex- wife years ago kept asking for more and more money and she always threatened to get the CSA (UK) onto me. After one particularly vicious argument I told her I would contact the CSA and did. They cut her money by £400 per month. That softened her cough",
            "She fucked around and found out. Well done OP.",
            "You’re never going to see that money and she seems the type to become even more of a headache because of this. Doesn’t feel like much of a win.",
            "You should get the app “Splitwise”",
            "Use an app, splitwise. It will keep you on top of things.",
            "Be careful about what you say you want... You just might get it.",
            "You sound like a really nice person.  \n\nFrom your description, one possibility is that she may be resentful about the consequences your stepdaughter is facing and blames you for this or thinks you have abandoned them, and is deliberately making you suffer for it.\n\nAnother possibility is that she is at the end of her tether with the stepdaughter too. She may be stressed emotionally and financially by the situation. Addicts often steal from their own families, have legal costs, or sometimes the family tries to support their habit to prevent them from getting into further trouble.  While I agree that they need to face consequences, this can still be draining. \n\nYou could try acknowledging that the situation is stressful or ask her if she is stressed or in financial trouble. The answer may give you some insight into what is going on.",
            "My ex-wife liked to pull this sh!t with me. Claims it's unfair since I earn more. I reminded her that it was her choice to leave and her poor financial decisions keeping her perpetually broke. She's been more congenial since.",
            "How the turntables...",
            "I thought for long time it was a post on the AmITheAsshole subreddit.\n\nThis would go very well there and get you lots of validation.\n\nI'd say it all sucks but I feel there is some missing info/dynamic here, but still what's fair is fair so good riddance to your ex, she asked for it.",
            "Stories like this make me realize how good it is to be single.",
            "This is about the insult of being nickel and dimed because the ex-wife is pissed about the daughter, it is pretty clear OP doesn't care about the money at all.",
            "This post reeks of poor boundaries and enabling in general.",
            "Way back my wife left me and our 13yo son and 14yo daughter. I still supported her financially for the few months she was gone before we reconciled. While she was away she found a job and sent $600 as an informal child support. I'd supported her several times that amount and never mentioned it after we reconciled. One friggin day she's feeling her oats and says \"I sent you $600 while I was in ...!\" I replied \"I sent you $3600 while you were in ....\" Gals are like that. We've been divorced now for well over ten years, I hatched a plan and left after the kids left home because it only got worse. Now she calls me and tells me specific instances and grievances of mine where she recognizes she blew it.",
            "She doesn't math.",
            "Sounds like my ex. Ex for a reason. Good luck to you. Here’s one for ya. She had a pay pal account set up during marriage. We divorced. She was off bank account. I got charges charged to my account from pay pal I did not purchase. Apparently, b/c the pay pal acct was set up and linked to that acct. # she could still purchase. Lessons learned.",
            "IT IS TOO FUCKING LATE TO BE ITEMIZING AND SPLITTING THE OWNERSHIP OF THINGS NOW. NEVER DO THIS MISTAKE AGAIN. GET RID OF BOTH OF THEM",
            "Do you think her daughter is stealing from her too and money is tight now? Not trying to defend her but I'm trying to understand where she's coming from.",
            "She fucked around and found out",
            "What is Indoor Lax?",
            "That’s what she gets for being petty and unaporeciative",
            "I can see why she's an ex wife, Jesus what a bitch.",
            "She is your ex. She is not family. She is not a friend.  You should be nice to her just as you would to anyone. But your relationship has changed.  And to keep things civil, treat her as you would a neighbor. And if you pay for your neighbor to go on vacation, don’t be upset when your neighbor asks you to pay for repairs to the fence that separates you. You are neighbors, not family.",
            "[removed]",
            "Talk split, owe chit",
            "Is it possible that she's struggling financially? It may be pure pettiness, it may be that she underestimated your contributions, it might be that she's trying to scrape up the money for rehab for your stepdaughter -- you don't say if any of these are factors. I think I'd try to talk to her about why she's stressing about finances. She might have asked for it because she felt like she needed the money and then realized you were paying more in the first place when she asked for the split.",
            "Your ex sounds like a loser.",
            "Doesn't seem like it's right for this sub",
            "Holy fuck. Call a family meetings invite everyone and burn the damn place down.",
            "Do you think that her continuing to ask to split stuff is in some way helping her pay for her daughters fines and or fees? I’m not too familiar with all of this stuff but it lines up suspiciously to where I’d wonder if some of this money is going to help her correct her mistake which was stealing from you and would be also doing it again in a way? It sounds terrible but my step sister is a monster and has pulled some unthinkable moves. Last Christmas she stole my deceased grandmothers credit card and charged like 4 grand a week after she passed away. So I’m willing to believe almost any terrible Behaviour.",
            "> Yes, I invited my ex-wife and her boyfriend to come on vacation with us\n\nWhew lad. You're a glutton for punishment.\n\n> If she comes back around and cuts the crap I’d invite her on another trip. \n\nOh, mate. Stop making your life complicated. The hell is wrong with you? Move on.",
            "This is just one gigantic cluster fuck of nothing that will ever happen correctly. Good luck.",
            "Uhh... \nThat might come advantagious in legal shit on her side\n\nI suggest visiting a lawyer",
            "Can't fix stupid",
            "You paid for her and her new man to have an all expenses paid vacation on your dime? That’s some next level blended family kardashian bs. Let’s all get along but also draw some lines. That’s just an invitation to be a sucker. Sorry OP you fed this fire.",
            "You brought that on yourself",
            "My theory is that your ex-wife is angry that you filed a police report against your ex step daughter. By itemizing everything, then taking more than she is giving she is passively drawing you in to an argument where she will release her seething anger.",
            "Congratulations on being one of the more hilarious things I’ve been pressured for lewd photos, I can’t break up with me!!! I’ve worked for him.",
            "I don't think she's gotten over you and just wants the attention. Make her do the paperwork, submit it once a month via email and don't talk to her.",
            "LoL congrats bitch. You played yourself! Hahahaha",
            "One man's family.",
            "https://youtu.be/VeAGA7-ob5Y\n\nSounds like Jackie and Kelso arguing about money.",
            "I'd let her know upon reimbursement any further communication can go directly to the law offices of Cordell & Cordell.",
            "OH, the Joy when you get exactly what you ask for!",
            "This sounds super fun 🥴",
            "My parents divorced when I was 13, any my dad split from his second wife when my sister was 9. I'm my experience, this money stuff is really hard on kids. Figure out a system with your ex wife that is as kind as possible and doesn't involve your kids and you'll save them a lot of grief (and probably a few therapy sessions later in life).",
            "Short answer: be the bigger person. \n\nPay her back when she asks, tell her it’s on you when you buy things. You’re going to fight about this stuff forever if not (like my divorced parents do STILL after 8 years of divorce). It’ll be fucking annoying but she’ll hopefully realize that you’re consistently being benevolent and supportive of both her and your children. This, as long as she doesn’t become financially dependent on you somehow/you can’t afford it.",
            "Hell hath no fury...",
            "Why don't you get a joint account that you both deposit a monthly amount into, that would only be used for stuff you would normally split anyway?",
            "What a petty situation all around.",
            "Sounds a lot like my ex. Thankfully the kids are grown adults now but, one year at the beginning of school he told me he wouldn't split the cost of some clothes I had bought at a thrift store, but in turn expected me to split the cost of clothes he had bought at a thrift store. His reason? I know the clothes I got are good quality and will last, I don't know if that's true for the ones you got.",
            "Talk to your divorce lawyer and have him draw up some type of agreement.\n\nSooner or later she's going to drag you into court, so best to get ahead of the game.",
            "“What are you doing ex-step daughter?”",
            "All of you sound incredibly dysfunctional and trying to live in some weird fairytale land.",
            "Married at least twice and still don’t know what “do what you want/need to do” *really* means?",
            "Did you invite the ex step daughter on the vacay too? If not, maybe thats why she acted out. She’s part of the family as well.",
            "There’s no way this ends well. It’s already spiraling into greater and greater pettiness. Someone has to let go of this tit for tat behavior. Good luck",
            "How do your incomes compare? Because if one of you earns ten times the other an equal split isn’t fair.",
            "> About a month ago my son needed new some equipment for indoor lax.  \n  \nSo what equipment is needed for indoor laxatives?",
            "Divorce sucks.\n\nAnd that ugliness bled over here.\n\nThis might be MC but sorry, the story is repulsive not delicious",
            "OP, I'd honestly stop with this behaviour. This is not how you raise your kids happily and this is not how you can eventually both be present at important moments in their lives.",
            "That girl might not have the best genes around. Not surprising that you left.",
            "What were the whole step-daughter break-in and paid vacation side stories about?\n\nI got really invested til I realized they both have little to do with the main point",
            "^o^o^p^s",
            "Time for a new wife. Life’s short. Get rid of that kid as well.",
            "Make an account on splitwise, invite her to make an account. Add your expenses, she adds her. The app takes care of the rest.\n\nBy the look of things, your wife would always owe you for things.\n\nThere would be no hounding, making calls etc. Just buy stuff, update it in the app. Both people get notified. Life would be much more simpler.",
            "You are way to nice and involved with your ex\n\nTime to put them at a distance and only communicate when needed",
            "OP is one pathetic excuse for a man. Paying for someone else's kids and then brining your ex on a trip with your wife. Grow a pair of goddam balls and learn to say \"no\" to people you fucking pushover",
            "Buy more expensive stuff than her, show her the receipt, return the items and make passive income from your ex’s pettiness.",
            "first fuckup is inviting your ex and their current fcktoy with you and your partner on a vacation",
            "Maybe a lawyer and/or accountant would give you better advice than reddit?",
            "A trip with an ex? White people are so weird.",
            "Lets go into how expensive lawyers are.",
            "OP, it sucks that you are dealing with harassment and pettiness. Maybe contact family lawyer to deal with division of financial responsibilities and another look at child support.. If she no longer wants to co-parent nicely get what is required of each parent in writing and only contact ex-wife thru parenting app.  Maybe all receipts can be given to third party who handles decision of what is owed and getting payment from other parent. This would get rid of all financial communication between the two of you. If she chooses to realize you did what was necessary and get over it, you can rebuild the relationship.",
            "OP, you really need to get a formal custody order.\n\nWhat happened with your ex step daughter? Was she prosecuted?",
            "What if…hear me out…you both stop being petty and have a sit down about it like adults",
            "Stupid, stupid fucking woman. This one made me smile",
            "What about including the thousands for the trip???",
            "Reminds me of That 70s Show episode when Kelso tried to get Jackie to pay for damages to his van. Maybe she should have watched that episode.",
            "Just start a joint account for expenses on things you both use and bills. Everything else stays in your personal accounts.",
            "this is lame. you all sound like a great bunch of people",
            "Is your household income significantly more than hers? \n\nIf so, then I'm not sure you offering to pay for her to go on vacation w you is as kind as it sounds, and might be more of a power move to keep showing her \"what she gave up\"\n\nIn which case, yeah, she is going to be extra pissed off anytime you shirk your fair split -- and the *fair* split may not be 50:50.",
            "Life long smoker and I have never taken asthma medication to get “higher” and no one else I know does either. We’re just trying to keep smoking after a heavy, cough and gag hit.",
            "So, you can take her on vacation but you're going to go on Reddit to gripe about $425. I simply don't get it",
            "It seems like you make a lot more money than your exwife does I think you’re being greedy and selfish and petty."
        ]
    },
    {
        "post_id": "belynr",
        "author": "AnsleyStar",
        "title": "I charged you too much? My friend, you have no idea.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/belynr/i_charged_you_too_much_my_friend_you_have_no_idea/",
        "score": 19997,
        "num_comments": 455,
        "created_utc": 1555596411.0,
        "selftext": "I used to be a bartender/manager at a small family-owned restaurant. We had this one customer who I’ll call D. It’s short for Douchebag. \n\nAnyways, he used to be a really nice guy. Always fun to talk to, had interesting stories, the works. However, after about 8 months of him being a regular, he asked me out. I (VERY POLITELY AND KINDLY) turned him down. And, my god, you would have thought I threatened his mom with the way he reacted. \n\nSo, following that point, he turned into a giant douchebag. Always snapping at me (both literally and figuratively), complaining about food that he never had an issue with before, etc. A couple months later, we had some changes to our menu and some slight price changes. Notably, his favorite soup (elk chili) was 75 cents more. \n\nHe stormed in and sat and ordered elk chili. I said “of course! I just want to make sure you’re aware that of the change—“ he snapped at me and said “How dumb do you think I am??? I can read!” Ok my dude whatever you can say. So he gets his soup, his meal, a few beers and a glass of one of our higher quality bourbons. I bring him the check and he flips out. \n\n“This is more than it was before! You never told me that it would be more! This is fraud. I’m not paying this. Fix it!” Ok, I can do that. However, on the check, I had also charged him for only happy hour price beers, which was significantly less than our regular prices. Happy hour ended before he even got there. I also charged him for a lower quality bourbon by the same company (please note, the owner was ok with that since he was technically a regular and had spent a lot of money there). \n\nSo I fixed his check for him. But I fixed all of it. The new check was about $15 more than it was before. He was so mad he was lost for words, and I took that time to show him how I fixed his check. He never came back on nights I was working after that. \n\nI don’t work there anymore, I wonder how he’s doing.\n\nEdit: I’ve realized my transgression and it will never happen again. I changed it to 75 cents.",
        "permalink": "/r/MaliciousCompliance/comments/belynr/i_charged_you_too_much_my_friend_you_have_no_idea/",
        "comments": [
            "That is some perfect MC. Well done.\n\nOne of my favorite restaurants always charged me 50 cents less than menu price for my regular meal. Then, they changed the menu and added 25 cents, and have charged menu price ever since. Except every so often, they charge up to 25 cents more. My thinking has been, 'Meh. 25c isn't a big deal against all those meals 50c less. Still worth the money.' So I don't complain and enjoy my damn food, instead.",
            "This might be my favorite story on this sub. The fact that this guy was a total douchebag just because you didn’t have romantic interest in him and you still have him lower prices shows the kind of person you are. Did he tip you decent after the rejection, but before the price change?",
            "how odd, the normal person response to asking out wait staff and getting turned down is to **never return to the establishment**",
            "I'm glad you turned him down for a date, if that's how he treats people he views as below him.  Dodged a bullet!",
            "“Well call him D”\n\nProceeds to not use D a single time after",
            "Regulars at bars always make me nervous for that reason. They feel like they are owed something, which is not true at all.\n\nIt gets worse the better you treat them too.\n\n(Yes there are exceptions, and those are the people that deserve a free drink or discounted food)",
            "r/assholetax",
            "Off topic but elk chili sounds amazing!",
            "What a jerk. he was never a nice guy he was pretending...he showed his true colors",
            "waitress and bartenders are being paid to be nice to you. Guess he didn’t get the memo",
            ">Always fun to talk to, had interesting stories, the works. However, after about 8 months of him being a regular, he asked me out.\n\nWow. I'm an almost two year out middle age widower who is re-entering the dating world after almost 25 years. While my \"is she being friendly  for work or flirting\" skill is still broken, I still just can't see taking out my misreading on the other person. Future bullets dodged by some MC.",
            "He's probably growing out the beard on his neck to match his fedora.",
            "He was only a nice guy cause he wanted to fuck you. That's not nice person behavior.",
            "MC done right.",
            "But don't you see? You were _leading him on_ by treating him like a genuinely nice guy. /s",
            "That's what he gets for being a nice guy... if you know what I mean?",
            "r/assholetax !!",
            "This is totally random and possibly unnecessary, but I feel compelled to say it because I think we as a species need to be more intentional about appreciating each other.\n\nI have talked to girls that work somewhere for a period of time and then decided to ask them out. More have said no then yes. I have not ever gotten angry at a woman for telling me no. Likely this guy has very little luck with women and also day dreams meaning into your conversations that was never there.\n\nI am not apologizing as a man, but just as a person to person. Sorry that happened to you. I do want to say thank you for being polite about it. There are a bunch of us out there who won't react like that and we appreciate the polite turn down. We are taking a chance because we were told as children that love could be anywhere so we have to take the opportunity if we perceive it, otherwise we are losers. By you NOT shitting on us for asking, we learn a lot about ourselves and grow from the experience. You did the right thing by being polite and I wanted to make sure someone told you that. There may be another guy in the future who you turn down politely and because he learned from that experience, he may have met his wife/partner the next person he asked.\n\nThere's enough anger and shit on /r/Tinder and /r/dating that I really think people need to make an effort to say \"Thank you\" for acts that usually don't get a thank you.\n\n/Random tangent over thanks for reading.",
            "The guy belongs on r/niceguys.",
            ">He never came back on nights I was working after that.\n\nDid he get your schedule every week?",
            "I’ve had something similar.  Two guys that always come in, they asked for some changes to a special and for some beers and I was putting it through the till so it would cost only $25.  Then one of them started making jokes about me, so I told them official policy was no changes on specials but I can put it through for regular price.  It ended up costing $39.\n\nLike seriously a little fucking courtesy.",
            "Seriously. He has beers and whisky, and a meal but complains about 75cts? What an asshole. Atleast you got your peace of mind.",
            "He couldn’t ‘beer’ the rejection, I guess.",
            "/r/assholetax would love this too.",
            "I don’t understand why you would ask out your regular bartender. \n\nGood bartenders are harder to come by than good women. You don’t risk that shit.",
            "Thanks everybody for introducing me to r/AssholeTax !! I posted it there as well.",
            "You are doing the Lord's work.  Fuck people like that.\n\nPlus any man (other than Brad Pitt or his ilk) should be an expert at rejection.  It isn't the end of the world - move on.",
            "But you were pleasant and polite to him before, so you basically agreed to marry him! What the *hell?*",
            "All I got from this was that I want an elk chili and a bourbon now.",
            "r/assholetax would love this.",
            "Wait wait wait. Elk Chili?\n\nIs it made from Elk? Do you eat Elk? What is an Elk? When is my dad coming back from the store?\n\nSo many questions..",
            "> elk chili\n\nHol' on",
            "You say he used to be a be a nice guy, but he was actually a Nice Guy.",
            "Guy has issues which is sad but you handled this perfectly. Sometimes I wonder if people told D how they were reacting or acting they’d see sense and sort themselves out.",
            "A regular who doesn't pay full price is a shitty regular.",
            "May i also recommend you crosspost this to r/assholetax . They would certainly love this masterpiece",
            "mmm.. elk chili where have you been all my life?",
            "If I ever get this bitter please just shoot me.",
            "he misses you too",
            "How he’s doing is probably writing sexist incel style comments on r/TrollXchromosomes",
            "Asshole tax well-earned.\n\nAlso holy shit OP elk chili??!!!! That sounds amazing.",
            "He was never nice and always a douche, he just pretended to be nice to get in your pants",
            "I tend to be a customer that seems like someone you wouldn’t want since I’m picky so I special order everything. That said, I fully expect to be charged for whatever I order and I am happy to tip 20+% for good pleasant service. My favorite place charges me a different amount almost every time I go in there (difference of about $1 from lowest to highest) depending on who is working. Sometimes I get the regular patron discount sometimes I don’t. But I always pay whatever the server asks for that day because over time I’ve paid less than the posted price on average. Why ruin a good thing?",
            "OK, so here's my question:  In what world is chili \"soup\"?",
            "Why did you give him the discount on the beers in the first place if he’s a massive douche",
            "r/assholetax",
            "I doubt this is in Indiana but I know that guy.",
            "r/assholetax YOU GO GIRL",
            "Ah yes, the standard Nice Guy.  Guh.",
            "Nice. Sounds like you dodged a bullet there and he was only “nice” because he was attracted to you. He deserved it and glad you didn’t have to put up with him after that.",
            "Lemme guess, you were about twenty and he was early forties?",
            "He's exactly the same as he was before. Trust me.",
            "It's embarrassing to be (even kindly) turned down, but if you are not prepared to hear \"no\", you shouldn't ask the question.",
            "You reminded of one time I got a small extra charge for a plate but they forgot to charge two beer. Hell I ain't complaining about that lol",
            "This is why I wont work in the service industry again.",
            "So it was a family-owner restaurant and not a family-owned restaurant?",
            "this is perfect r/assholetax material",
            "I would think the better response would be to continue to be awesome every time u come in to give a reason to consider a date.",
            "[deleted]",
            "My Favorite Regular used to sit same place for lunch M-F, on the short side of a bar shaped like a letter L. There was a tiny wall between that seat and where wait staff picked up drinks, so it’s the Power Spot for the whole place, right? \n\nSo his daily thing is a glass of red, lunch, desert, some type of Cognac and coffee. Usually picks up the tab for up to 5 friends that all eat at the bar too. \n\nAnyways, we had a new Bartender that charged this guy for coffee after his meal and he turns to the Manager on duty and says “I’ve been coming here for 5 years and you’ve never charged me for coffee.  What’s the deal?”\n\nThe manager looks him straight in the eye and says “5 years and free coffee? The way I figure it you owe us about $1500 for coffee”\n\nAnd my favorite Reg says “eh...  I’ll pay the two fifty. Sorry”.  \n\n:-)",
            "Asshole tax strikes again!",
            "Lesson: never be a douche to the person who pours your beers.",
            "I hate people like this. I started to understand why people cater to them since they are reliable income but if you're getting business from a lot of other people why bend over backwards for assholes?",
            "What the fuck is his problem? Did he think you owed him a date?",
            "That must've been some fucking chili!",
            "thats enough info for me to indict you.\n\nill be in touch. youre going away buddy",
            "Company I work for spent a bunch of money on solar panels to \"save money\"  when the bill didnt go down much the owner called the power company and complained and found out they have been charging wiring the whole time and the bill went up a fuck ton instead of saving anything lol.",
            "What a nice guy!",
            "r/assholetax",
            "My friend, you were maliciously compliant.",
            "I hate guys like this because they created the assumption that guys who are being nice must secretly be into anyone they are pleasant or kind towards. The reality is that I'm just really friendly and have zero friends of the oppositie sex and it's really stressful that they might start thinking that everything I'm doing is just an attempt to trick them into sex.",
            "Ughhh the entitlement and the fucking unwarranted arrogance of a customer just snapping “Fix it!” at a service employee. I’ve been out of the retail game for almost a year and hearing/reading about that shit still makes my blood boil. I’m glad this jackass got a bit of what was coming to him. Service employees are not your personal butlers, you don’t get to order them around.",
            "Perfect.",
            "I'm fine.",
            "His loss. A good bartender is a faithful and constant companion. He should have kept it in his goddamn pants.",
            "Elk chili? That sounds fucking awesome.",
            "r/niceguys",
            "Elk chilli? I assume america? It's weird how that part of it is skipped over like it's the most normal thing in the world.\n\n\"So yeah my regular came in and his favourite order honeyed-locusts was 25c more expensive and..\"  That's how it sounds to me.",
            "I had a regular who I hooked up for about three months.  We had a dollar 12 oz draft for happy hour and I would give him 22 oz for a dollar regularly.  I did it because he was a downtrodden guy.  He goes up and down the strip going through garbage getting cans to return.  I have a soft spot for hard luck cases.\n\nSo after months of hooking the guy up, he came in and I poured his beer.  Except the keg blew while pouring.  We were waiting for an order so I couldn't change it.  \n\nSo I hand the guy a 22oz glass, filled to about 20 oz.  Hey scoffs at me and says he won't pay for it.\n\nI lost my shit, told dude to get fucked and barred him from the place forever.",
            "What a piece of shit. I hope you’ve learned to tell ppl from now on when you hook them up, so it will be (hopefully) reflected in your tip!",
            "I guess I got off easy bc old dude that hit on me and asked me out (twice and was twice turned down) just stopped coming in.",
            "I worked at an ice cream shop in high school and this old guy would come in every day, get a scoop of pistachio, and pay in coins. There was a small discount for seniors.\n\nOne day, there was a price increase, including on senior cones. Several of the employees asked to keep the rate the same for just this one guy. Boss is a douche (he was racist too) and refused. We (coworker and I) paid the difference on his first cone and then we started charging him for kids’ cones, which was cheaper than the old price for the senior cone. That boss was a cheap bastard.\n\nBonus racist story: boss was a certain religion known for looking very homogeneous. He preferred to hire people of that religion. Those employees were paid more and got preferential treatment. Several times I saw notes that those employees made on applications that indicated skin color. And, yes, all of the employees had the same skin color even though the community was very diverse. \n\n(note: I know many people that are this religion, including close friends, and they are not racist.)",
            "Amazing",
            "This is beautiful. You could also probably crosspost it to /r/asssholetax.",
            "I love how you said that you were going to refer to him as \"D\" but never did.\n\n\nI'm pretty sure you just wanted to call him a douchebag lol. Great story.",
            ">I wonder how he’s doing.\n\nlol, who cares?  niceguys are so weird.",
            "“I’m gonna call him D”\n\n\nProceeds to never refer to him as “D”",
            ">.75 cents\n\nHow exactly do you pay 3/4 of a cent?\n\nEdit: It's funny that this is getting downvotes. It's either 75 cents or .75 dollars. There even is a long story about someone having to explain that difference to the hotline people of his carrier because he was charged a lot more than he was quoted.",
            "And then the bourbon clapped",
            "Good story.\nHow does one snap literally at another person?",
            "He got mad bc his chili was 3/4 of a cent more?",
            "Bro messed up alot of the times girls will turn you down just to see how you react especially if youve been their friend for a while. They want to avoid the whole nice guy thing",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/assholetax] [Unreal](https://www.reddit.com/r/assholetax/comments/bencf8/unreal/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "He never came back.  Good business lol",
            "Can we just talk about this elk chili? Is this Alaska, Canada, or Norway?",
            ">Anyways, he used to be a really nice guy\n\nHe was still a niceguy™ after you turned him down.",
            "[deleted]",
            "Seems not many people know what literally means these days.....",
            "[removed]",
            "This hoe need to shut her internet mouth!!\nHappy Easter everyone!!!"
        ]
    },
    {
        "post_id": "o9k7e4",
        "author": "davidgrayPhotography",
        "title": "\"This is a reminder that you approved this policy and agreed to abide by it\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o9k7e4/this_is_a_reminder_that_you_approved_this_policy/",
        "score": 19968,
        "num_comments": 431,
        "created_utc": 1624886690.0,
        "selftext": "A similar post got me thinking about my workplace.\n\nI work in a combined IT / AV department for a somewhat large organization, so if there are any events going on, we're responsible for setting it up, which usually involves setting up sound systems, projectors and cameras, and ensuring that when someone plugs in their laptop, it functions as expected.\n\nFor years, we got a lot of last minute requests. Some of them were literally along the lines of \"we're having a gathering tomorrow with 300 people. We need audio and projectors set up for 9am tomorrow and for you to advance the slides for us, plus this video in my Powerpoint Presentation doesn't work can you fix it up? We know you leave work in half an hour, but can you set it up? We knew about this for weeks but nobody thought to tell you\"\n\nSo one day we complained to our manager, who agreed it was bullshit and asked us to draft a policy that he could take to upper management and get them to sign off on. We did, and it was very straightforward: You need to give *at least* 5 business days notice for events, presentations / media must be finalized and playable without internet access (one less thing to go wrong) and you're responsible for advancing the slides because we're there to fix computer issues, not read your script and press buttons.\n\nOur manager took it to upper management, who agreed it was a good idea, and they signed off on it and it was distributed to all staff. We had some people slip up, but they were held accountable and promised to not do it again.\n\nOne day someone from upper management emailed us. Let's call him Bill. Bill was holding an event for 600 people with a guest speaker (who had to be booked weeks in advance). The guest would need their laptop connected to the internet because they had YouTube videos, the projector set up and wireless microphones set up because they'd hand mics around for people to participate. The speaker was due to speak Monday morning, and it was Thursday lunchtime. Plenty of time to set it up, but less than the 5 business days notice, plus we were double booked by someone who followed the rules, so we said no, even though he was upper management.\n\nBill was not happy. He demanded to know why we were refusing to set things up when there was at least 12 working hours between now and the event, and all that was required was to power on the projector, turn on the mixer and turn on the microphones and then set up the person's laptop when they arrived Monday.\n\nOur manager heard his complaints and sent him an email:\n\n\"Dear Bill, my team have said no to setting up for this event, and I support their decision. Attached is the policy on event support. This is a reminder that you approved this policy and agreed to abide by it. Attached are general instructions on how to set things up yourself, best of luck\"\n\nBill managed to run the event without us, but he had to do a lot of running around and had a bunch of technical issues that interrupted the event. But at least he learned that if you sign off on the rules, you need to abide by the rules, because he hasn't slipped up since.",
        "permalink": "/r/MaliciousCompliance/comments/o9k7e4/this_is_a_reminder_that_you_approved_this_policy/",
        "comments": [
            "Like how easy is it to send you an email the minute they confirm the event? Saves you running around and saves them embarrassment of not having it done properly??",
            "A manager who has your back is worth their weight in gold.",
            "“A lack of planning by you does not constitute an emergency for me”",
            "I'm having flashbacks to working Tech/AV for conferences 😅 When I was in my first month working as a trainee for a massive conference centre I was scheduled to work alone for an internal meeting (my manager was a real piece of shit), and 5 minutes before it started the CEO of the company asked me to set up a lapel mic for him. No such mic had been requested on the call sheet, and the room they were kept in was 10 mins walk away at the other end of the building. Baby tech me had to straight up say no to the CEO's face. Somehow I kept my job, but my manager reamed me out for 'not going the extra mile'. Not sure how I was meant to bend time, make the 20 mins journey there and back, set up and test a mic in ~5 mins but there you go. Wish I'd had a manager like yours!",
            "Learning the hard way is very effective, but one does not want to learn this way very often.",
            "Your boss is a cool guy, I see a lot of post where management is terrible, but we find that it was actually a guy setting up an event who was terrible. That’s cool",
            "We have something similar at the moment with a return to the office. \n\nBefore the lockdown occurred, we were asked to work out butts off to ensure that we could switch work from the office to home working, just in case nobody could get to the office. We got everything worked out and the company instituted a test where we all worked at home for a week to make sure everything was functioning. We were pleased (and a little surprised) to see everything work faultlessly. Even Teams meetings were less stressful when you weren't battling for bandwidth on the office LAN and Corporate WAN. We got a serious amount of praise and kudos for delivering this in a short timeframe.\n\nAs things panned out we never went back after that first week of testing, the government here instituted a lockdown and that was it. I've not been in the office since March 2020. Now we have senior managers pushing for everyone to be back in the office, I guess it's all down to seeing the drones at their desks and the fact they took the chance to remodel the office buildings while everyone was out of the various sites. The problem is, we all now see just how efficient it can be working from home, I can go get a coffee whenever I want and don't have to go and queue in the coffee shop over the road, I can organise my day around me and my wife, take a longer lunch and still fit my work hours in around me. I don't have the commute and the traffic and I don't have to pay restaurant prices for my lunch in the staff restaurant. I have a great connection back to the office over the VPN and I have a better mobile phone signal at home that I do in the office. Why would I want to go back?\n\nHere's where it gets fun.  We don't need to be hands on with the servers, the senior managers created a hardware specialist team to do that. We don't need to be on site for client meetings, the sales and client relationship teams do that. \n\nWe always hear the senior managers going on about how we are a global team and how technology brings us together, so when the start demanding we all go back into the office, then are getting a push back and our team manager is one of those pushing back hardest. This is because he probably lives furthest out and has the worst commute of us all, but at the moment he says there is no evidence the office is safe from COVID and that we are all safer staying home to protect ourselves and the company. The directors are fuming but can't do anything about it, meanwhile we are all applying to be permanent homeworkers and have the evidence to show we can be just as productive when we do.",
            ">media must be finalized and playable without internet access\n\ngood for you for getting that one through.  I would also include:\n\n* media to be projected (or shared in Zoom) must be in widescreen format.  (people just love submitting word docs or .pdfs in portrait mode, then get mad when no one can read what's on the slides.)\n* any speakers who will be using a microphone must check in with one of the AV staff.  (this gives the staff member a chance to give a 30 second rundown on how to hold a mic.  so many presenters hold them around their belly area and then get mad that no one can hear them.)\n* all docs, once submitted, are considered final.  (it can get really confusing when there's six docs floating around called prez.ppt and prezfinal.ppt and prezfinalnothisone.ppt and prezfinalnoTHISone.ppt, etc.)\n\npeople complain, but these types of rules are basically for the benefit of THEIR presentations, not to make AV/IT work easier.",
            "Oh man I was recently working at a construction company and they called me to help with a meeting.\n\nThere's a guy from Microsoft there with an AR hard hat, and he wants the hat's output to go from his weird laptop to our projectors.\n\nI could not believe that he was so clueless about his own requirements. I tried to get it working while upper management stood around awkwardly but had to give up.",
            "A story on the opposite end of a policy requiring enough notice.... I had a situation where I was hosting an event in another office and needed a particular WiFi config in place for the event.\n\nI filed a ticket several months in advance, because I assumed they would need time to customize things. The ticket was closed -- too far in advance to make a temporary setup, resubmit a month before the event.\n\nSo a month before the event, I dutifully filed another ticket referencing the previous one, requesting guest WiFi access and the configuration we needed. The ticket was closed with a link to our standard guest WiFi arrangements and an assurance that it would meet our requirements.\n\nThankfully, I decided to arrive in town the end of the week before the event, because wouldn't you know it, the WiFi was the ordinary guest WiFi not configured the way I'd requested. So I filed another ticket on Friday morning, high priority, pointed to the previous two tickets and said it absolutely had to be done by Monday morning. Closed again -- too little notice for a custom network config, so sorry.\n\nI reopened the ticket, got the tech handling it on the phone, and pointed out that I'd given them three months' notice and it was not my fault they'd sat on their hands in the meantime. And to add to it, the person I was talking to was the same one who had resolved the second ticket.\n\nThey worked late on Friday night (and I was there, too, helping test) and couldn't figure it out. Didn't help that network management was not on site in that office, but a few timezones away. Saturday, they messaged and said they thought they had it working, so I came back to the office to test. It worked, and the meeting came off nicely, but I'm so glad I chose to get in early instead of trusting things would be in place....",
            "I hate to ask this but as the IT person with a very heavy A/V background, do you just so happen to have a copy of that policy that I can fine tune for my own needs?",
            "Probably got a good taste of what it takes to run a successful event from your position and hopefully got a big dose of reality and humility.",
            "Years back it was pretty common for companies to get employees to sign one of those agreements \"I will not work for any of this company's competitors for the next 5 years\". I knew they werent enforceable or legal in my state. While everyone else passed them up to HR rep, I folded mine and stuffed it in my purse.\n\nSo 7 months later we all got laid off. HR (or I guess at that point our FORMER HR) made a huge point of \"reminding\" us that we had signed those agreements and couldnt work for any other company for the next 5 years. I then loudly made it a point to let them know that they were illegal in our state and not enforceable.\\* She then pulled out a stack of them again \"reminding\" me that I signed the form. \"Did I though? Can you show me where?\" Nope she couldnt - she never got it.  The other employees already had no intention of following the agreement and bet that the company (that had just lost its major contract and was seriously in financial trouble) wouldnt be able to track us down and sue.\n\nSo there's what you sign and what is legal. \\*Why not speak up? Its not like they could fire me...",
            "I've been an A/V tech, DJ/Emcee, and Event Coordinator. This kind of stuff is incredibly frustrating and borderline disrespectful. I am thrilled for your new company policy and your manager's willingness to support you. 👏",
            "I'm in IT and whenever I go through my onboarding presentation with new employees, I strongly emphasize that \"your emergency is not my emergency\". I.e., if you wait until 5 minutes before your big presentation to ask my help to set up, you'll find I'm out to lunch.\n\n(And yes, some people have waited until 5 minutes before...)",
            "This feels like it could have backfired on you guys by a lot.\nSomeone presumably untrained being able to somewhat do your job.\n\nI'm glad he learned.",
            "Ahhh yes… the old “I am an exec and thus am above the rules” philosophy",
            "Awesome that your manager stood up for you and awesome the upper-management person respected the rules.\n\nJust one question...how many hours after the event were you all given your termination notices? /S",
            "\"Oh ... *this* is why they demand five days notice.\"",
            "I do scheduling at work with entities outside my company. We have a firm policy for seven days' advance notice. We mostly get compliance, but one agency is infamous for pushing back against this rule. I have pretty regular conversations where I'm telling them I can't schedule something because it's late notice. They usually tell me, \"But this was scheduled weeks ago!\"\n\nI don't see why anyone thinks this is a point in their favor. All you're doing is telling me you had time to follow policy but you didn't.",
            "You don't plan a 600 person event days before. You just don't. He knew this was coming and chose not to plan with y'all",
            "This feels like Part 1 of Bill's malicious compliance story where he gleefully recounts making ya'll work holidays or not paying ya'll a bonus because of some technical nonsense that had no need to be enforced...",
            "I actually like Bill. He was upset when he realized he wouldn't get what he wanted, then made things work regardless and learned from his mistake.",
            "God I remember setting up conferences for hotels that my company provided wifi services for. \n\n\"Yeah I know it's 4:45pm but we have 500 people coming in tomorrow at 8am and we need a dedicated 1gb vlan run to 100 ports, a custom wifi splash page, 3 custom ssids, and 20 devices whitelisted that we don't have the mac addresses of\"\n\nSuch horseshit. I was younger then and was just on the help desk team which was for minor issues. But no engineers (who got paid double what I did) were ever available to set up conferences scheduled in advance, let alone last minute ones so I always ended up scrambling to get them done by myself. Never got any recognition for it either. Not a single thank you from the conference support team or any recommendations for a promotion. I won't miss that now in shambles company and I don't do things above my pay grade anymore.",
            "I was called in as a consultant to give a talk on my specialist subject. IT of the company managed to misplace the booking made by HR, so here we all were in the conference room, 60+ people, a few managers, HR but no IT.\n\nTook them a couple of hours to get things organised, while I had coffee and chatted at €150 per hour plus VAT.",
            "3 months later the entire team was outsourced.",
            "Unfortunately and in my experience, what this is going to teach Bill is not to follow the rules you set in your current agreement, but cancel your agreement in 6 months and never agree to sign anything else going forward. The corporate world sucks",
            "I feel like your managers going to get your department crunched down on hard.\n(Unless the double booking you mentioned was more of an issue than you made of it ) it sounds a bit like saying no because he could , policy should not obstruct common sense/productivity - it’s there to protect you when others don’t apply common sense/give reasonable deadlines ... but I bet 2 days was enough for this one off with an upper manager.\nIf it was indeed feasible I would have taken the ‘owe you one ‘ from the upper management to keep my team insured in the future ... unless of course he has a different strategic play on the go.",
            "Probably thought he was gonna pull a fast one on the crew because he was upper management.. thinking \"rules for thee, not for me\"..",
            "Well done on the manager for having your back.\n\nPerhaps an adjustment could be a multiplier built into the rules - say, a 50% multiplier for every day late. And, for idiots like Bill, a similar multiplier for staff pay so that senior management don't start to take late bookings for the extra money with the staff having to carry the can for it.",
            "Yeah, this is good policy. I once had to move about 20 desks by myself with no heads-up. It wouldn't have been too bad, but I had my regular work and they were moving people to an area that I was using a storage at the time.\n\nI chewed out quite a few managers for that. From then on, they made sure to give me a minimum two weeks heads up for desk moves.",
            "Sounds like Bill learned \"Rules for thee, but not for me\" wasn't going to work. Good on your manager for the support!",
            "I wanna kiss your manager on the lips if he's down for it.",
            "When upper management approves a procedure, they really mean that it is for everyone else.  There is a hidden, secret set of rules for upper management - that there are no rules for upper management.  That is why what your manager did was so refreshing and rare.  Most managers would have done a \"Yes, sir\" to Bill and had the people do it on short notice.\n\nIn the company I used to work for, during a period where they were laying people off and when they were telling us that we had to cut costs, they had an executive reshuffle.  Of course as part of that exec reshuffle, some of them wanted their already nice offices to be redone to their particular tastes.  Suddenly, money was available and spent to redo offices  - no budget limit existed.  The \"reduce costs\" for this effort did not exist.  Rules for some and not for others.",
            "To the requestor: \"If 'all that's required' is $this, why don't *you* do it?\"",
            "I appreciate the principle, but frankly 5 days seems excessive.",
            "Totally see how frustrating it is to receive last minute requests, but do you really want Upper Management to be a) pissed at you (despite it being their fault) and b) now having the knowledge that they were able to do your job without you?\n\nI dont know, seems like you proved your disposable. I'm sure this is an unpopular opinion though.",
            "I felt this in my soul.",
            "Holy shit I love your Manager now",
            "And don't assume that IT is only there to plug in the laptop and turn the power on. How hard can it be? /s.",
            "12 hours?\n\nI used to have 30 minutes or less.\n\nThe best was needing to swop out a presentation that was live with an updated version during a live stream event. Ah fun times.\n\nThe strain got to me though, and I needed to change things up... remote support for a multinational insurance company it is now.",
            "> But at least he learned \n\nHow often can you say that about UPPER management, I wonder?",
            "I worked at a golf course that did events. We would get half ass instructions and be running around in madness before the event. \n\nAlso we had to serve tables after set up and before tear down. Sometimes we wouldn’t get the notice about setting up until we showed up that day. \n\nI don’t work there anymore - this would have helped.",
            "Soooo your big boss now thinks  that maybe the business doesn’t need as many AV/IT people because AV can be fully self service?  Danger Will Robinson, Danger!",
            "Pretty easy way for that 5 days notice to become 2.",
            "I have never had a manager do that ever in my 20+ year career spanning several companies. It's so crazy to me that my initial reaction is to call bullshit on this whole story, but I want to believe.",
            "I love these stories, I just wish my employment wasn't dependant on holding people accountable...if I hold people accountable, they take their business elsewhere, it sucks.",
            "I have the weirdest boner right now.",
            "it's great that your manager agreed and got the policy in place.  even more awesome of him to tell Bill to F off in such a polite way.",
            "Your manager rocks!",
            "if anything i would pay double to help me set it up so nothing would go wrong",
            "A lot of people in the management think rules don't apply to them but only to those who work under them. Well they are employees too and without a team there is no management.",
            "This, ALL THIS…the OP, all the comments, all the replies. The good, the bad, and the ugly.",
            "Literally the problem I’m facing now. User has series of conferences for M&E and gives me 20-30 minutes warning when I have support scheduled from a week ago. Then get upset when I don’t give them my full attention… banks man…",
            "Is this malicious compliance? It's actually good business policy, and the correct action to take for all parties involved.",
            "\"But surely you don't expect *me* to have to abide by those rules.\"",
            "[deleted]",
            "[deleted]",
            "Simple, sweet, and perfect. The ideal MC. Thanks OP :)",
            "So to be clear a VP supported your policy , and then you dicked him over with the very same policy.....\n\nI guess you won the battle.",
            "Not really malicious compliance, but a great story nonetheless.",
            "Dealing with upper management is exactly like dealing with Conservatives and religious bigots of all kinds:  they believe rules are for others, not them; and it's totally okay for them to break these rules because they are \"part of the gang\".",
            "I enjoy conferences,  a break from the dailies plus professional networking. \n\nFor a swag bag and free beer I'd have gone on-site just in case. Assuming I didn't have plans.\n\nJust me tho...",
            "This sounds kind of like a dick move IMO. If the policy was being respected for months since being implemented, it's reasonable to handle some exceptions on occasion, especially to accommodate a company guest. Unless you're talking about union negotiations, policies like this are guidelines, not immutable requirements.",
            "Before this incident, Bill just didn't have the remotest concept of the amount of work that goes into setting up for these kinds of events. The closest he's ever come would be hooking up his kids' PS5, and probably had someone do that for him.",
            "Why would you fuck around with upper management like this? You want them to preferably have a positive opinion of you and you're department, right?\n\nIf it was a peon sales guy - Then you tell them \"Oops you didn't put a ticket in.\"",
            "Yeah, why do these posts all seem like they're written by a karen?",
            "Being Reddit and all, I don’t imagine this will be too popular but …\n\nY’all know that the purpose of IT is to support the business, right? I mean, sure, have a policy and if someone is violating it repeatedly for no good reason, shut them down or talk to their manager or whatever. \n\nBut Bill? Maybe he should have been better prepared. But if that 600 person event was important to the business, your job is to make it happen. \n\nAll of you who are saying “not my emergency! I’m at lunch”? You’re the “corporate culture” that people hate. Maybe you get your jollies for having a chance to feel important by refusing to help the big mean executive. You won’t be so jolly when the company loses a major contract and starts laying people off. Maybe it won’t be your fault but you had a chance to help and didn’t.",
            "Honestly surprised he managed to set that all up enough for the event to even be held. Wonder if he stayed over the weekend?",
            "My situation is booking 3 days in advance, and our job include meetings and  video conferencing between our two sites. Unfortunately the big boss at our site seems to pull out meeting after meeting at a moments notice, and we cannot say no. So much for guidelines",
            "It's helped us to have our own internal policy of: \n\n1. Send out company-wide steps, like, Step 1: When you know you have an event, complete the \"event\" form, linked here. Step 2: If you have changes, do x. Step 3: We deal with requests all the time; if you don't give us two weeks' notice, we cannot guarantee that we can get the job done. \n2. 100% of the time someone fails to follow the instructions, send out a reminder email company-wide. This helped to bake it into the standard practices of the org.",
            "Good for him for not slipping up again!",
            "I worked in events for years, and it's amazing how often something comes up \"last minute\". \n\nYes, there are instances where unforeseen circumstances arise and adjustments need to be made on the fly/last minute. Happens in every job. \n\nBut when we have a system in place and then you fail to adhere to that system, you do not get to be mad about your event suffering.",
            "This is amazing! Usually, the policy isn't worth the paper it's written on.  Congrats on having such an awesome manager!!!",
            "I work in this field!  ppl wait til the last minute constantly. \n\nI dont think much is planned in corporate america anymore besides short-term profits and how to get them",
            "I have never once had a manager that would go to bat for me against the ivory tower. I have had a multitude of managers who ensured that I was never in contact with senior management and took credit for all my work though.",
            "I used to work in AV at a Hilton hotel and we had these kinds of problems all the time. Last minute this that and the other. I wish we had this kind of agreement. Atleast my manager was chill though.",
            "Sounds just like my old college I used to work for, in the not combined, but basically combined IT/AV department, specifically AV in my case. We'd get people like that every week. I've even had people call in because their mouse wasn't working, only to find out they mixed up the mouse with the white board eraser.",
            "I would work for your manager. That's awesome.",
            "I do not miss being the 1 guy to coordinate and manage global townhall meetings.\nAnd something always fails day of regardless of how much testing you do prior.",
            "\"But at least he learned that if you sign off on the rules, you need to abide by the rules, because he hasn't slipped up since.\"\n\nI guess things have changed since I was in the corporate world.  Back then, breaking the rules meant the disaster was the lower level person's fault. So did following the rules.  Gods do not accept rules meant for mere mortals.",
            "Best of luck.",
            "Having worked in IT and done live sound events by myself with my own equipment, I understand this completely but surprised both job duties come under the same job description. My first audio event was, shall we say, started late. ;)  I'm surprised they pulled it off, even with technical difficulties.",
            "I wonder how often this ends with the manager being fired on the spot and the policy changed immediately.",
            "For some reason, I can see a diagonal white line through the words ‘manager’ ‘policy’ ‘get’ ‘straightforward’. Not when I look directly at, but typing this and also when I was reading the post. Like an illusion!",
            "Jesus it sounds like where I work lol. You don't by any chance work at Conde Nast do u?",
            "[deleted]",
            "You know where this would never work? The military. There’s always a higher ranking fish.",
            "I often do similar work. My favorite is when they expect us to set the room (I.e. chairs and tables), also.",
            "I mean they had a policy changed and then stood by it, I don't see much malicious compliance."
        ]
    },
    {
        "post_id": "7wn8n2",
        "author": "lord_kelly",
        "title": "We must be alerted every time a user sees a 404 error on our site!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7wn8n2/we_must_be_alerted_every_time_a_user_sees_a_404/",
        "score": 19904,
        "num_comments": 585,
        "created_utc": 1518287817.0,
        "selftext": "Edit: to everyone saying I'm ungrateful to my boss etc and that we should be monitoring 404s anyway, we had, gtm, yandex metrica and a bunch of other analytics software running on the site. \n\nHad the boss not insisted on am EMAIL being sent then I would have simply crunched the logs for him, the point of this story is that it's malicious compliance, not \"I purposely chose a shit course of action to wind my boss up\". Anyway, on with the story:\n\nThis happened around this time last year:\n\nI'm a website developer and I used to work for the stupidest buffoon of a man who had no clue about web development (he just ran the company, managed the accounts etc.) but he thought he did. He read articles on web development and forced us to implement the new things he had spent five minutes reading up on almost weekly.\n\nOne day, he was messing about on our company's site and because of some work I was doing, one of the pages he was trying to look at was temporarily unpublished resulting in a 404 error (This is just what the website tells you when a page can't be found at the URL you're visiting).\n\nHe went berserk and said lectured me on how this was completely unprofessional and if a customer ever saw it we'd lose them. I rolled my eyes and said it was only for a minute and it was fine.\n\nHe then told me we needed to be \"alerted somehow\" every time a user got a 404 error on the site.\n\nFirst of all, this is ridiculous, you don't need to be alerted every time this happens, second of all sites get hundreds and hundreds of 404 errors every day due to automated scripts trying random URLs to see if they can find anything good, or spiders trying to look for pages that may have once existed but don't anymore.\n\nI explained this to him but he wasn't having any of it, \"No, we need to be emailed every time this happens so we can fix it\". I was crying with despair internally at this point, but I decided it'd be hilarious to prove my point anyway.\n\nI set up a script on our 404 template that'd email him every time a 404 page was displayed and left it overnight.\n\nI came in the next day to find him sitting there scrolling through pages of his webmail trying to delete the 4000 or so emails that had arrived overnight, the best part was you could search for the subject, but at most only 100 were displayed at a time so he would have had to delete 40 pages of emails :D I also made sure to take my sweet time disabling it so he probably got a couple hundred more before I got round to doing it",
        "permalink": "/r/MaliciousCompliance/comments/7wn8n2/we_must_be_alerted_every_time_a_user_sees_a_404/",
        "comments": [
            "For maximum malicious compliance, include the URL in the body of the email.  Then, he'll get the email, click on the link, and generate another email.",
            "This reminds me of the customer who asked me to supply him with a list of all the URLs on his site that returned a 404...",
            ">the best part was you could search for the subject, but at most only 100 were displayed at a time so he would have had to delete 40 pages of emails\n\nSemi unrelated, but anyone know how to get around this in gmail? Its keeping me from cleaning out my mailbox because it would probably take me hours only a page of results at a time. \n\nEDIT:Woo, thanks for the tip everybody, ill add clear email to my todo list. Last time i tried was literally years ago, maybe that function didnt exist then. Or im just a blind moron. ",
            "I used to have a cool logging program that would analyze and graph the 404 URLs and you could see the most common failed navigations. That way, if you see they commonly misspell something on your site you could navigate them to the correct spelling. This was back in the day where users were still expected to type long URLs. Also, you can just navigate someone to the main page everytime they reach a bad URL so they never see the 404 page. ",
            "[deleted]",
            "What was his response ",
            "[deleted]",
            "What, you don't have a Dev environment? Why would any part of your live site have to be down for you to do any work on it?",
            "You need to stop developing in production, Man. ",
            "if he was a dick, probably would have been worth creating a \"scraper\" in your offtime to visit obviously missing pages.  Nuke his inbox and also the Ip for emailing.",
            "You shouldn't be serving a 404 if a page is down temporarily. This indicates to the user that they have visited a page that does not exist and that the problem lies with them.\n\nYou should be serving a 503 to indicate that you have broken your own website for a moment.\n\nFrom [the RFC](https://tools.ietf.org/html/rfc2616#section-10.5.4): \n\n> 503 Service Unavailable\n> \n>    The server is currently unable to handle the request due to a\n>    temporary overloading or maintenance of the server.\n\n\nWhether or not it is okay to break your own website depends on how critical the site is. If your site is internal and used by 6 people then sure go ahead. If it's public facing and making money for the business then that doesn't seem like a good idea to me.\n\nIt sounds like you think temporary outages are inevitable and always acceptable which makes me think your manager is being more reasonable about this than you are.",
            "Have you already x-posted to TFTS?",
            "I don't know, doesn't seem unreasonable to expect your pages to not go missing suddenly. I'm a web developer, I know shit happens sometimes but it's not okay because it was just a minute, these things should be avoided.",
            "I mean, he did have a point, a customer browsing your page and getting a 404 is unprofessional, and it looks bad, it could make them go \"Jeez these guys can't even set up a web page properly\", and it should be avoided at all costs.\n\nBut the correct solution to that would be \"try to schedule the website's downtime around when we have the least amount of traffic\", not \"email me every time we register a 404\"",
            "I use to be a web dev and I would have been fired if I took a page down without redirecting traffic first. A 404 does in fact lose you customers.",
            "You work for a company that receives 4000 404s overnight yet you’re still developing in Prod? Just making changes “for a minute” in the Prod environment? Really questioning how real this is. ",
            "But seriously you should monitor the *rate* of 404s and alert on abnormalities.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/programmerhumor] [We must be alerted every time a user sees a 404 error on our site!](https://www.reddit.com/r/ProgrammerHumor/comments/7wnbd3/we_must_be_alerted_every_time_a_user_sees_a_404/)\n\n- [/r/talesfromtechsupport] [We must be alerted every time a user sees a 404 error on our site!](https://www.reddit.com/r/talesfromtechsupport/comments/7wntoz/we_must_be_alerted_every_time_a_user_sees_a_404/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "> He went berserk and said lectured me on how this was completely unprofessional and if a customer ever saw it we'd lose them. I rolled my eyes and said it was only for a minute and it was fine.\n\nYou are wrong, it is unprofessional.\n\n> He then told me we needed to be \"alerted somehow\" every time a user got a 404 error on the site.\n\nThis is when you go, ok, let me look into it, and get back to you. \n\nAnd you realise he was asking you for an alert when the site goes down, WHICH IS INCREDIBLY REASONABLE THING TO HAVE. Sheesh. I can't believe you people upvoted this.",
            "Don't believe it - there was no eye contact with a stranger who telepathicly realised what you were about to do, and then giggling at the end. ",
            "probably should have just redirected the 404s to the home page and called it a day.\n\nI mean, he may have over-reacted, but watching 404s is something you are supposed to do.",
            "“We’re already told every time a 404 happens....in the access log files.”\n\n\\> show them how to access and read log files",
            "[deleted]",
            "Wait, what is this about spiders on the web?",
            "I mean, it is perfectly reasonable that he wouldn’t want his customers to see dead pages. Why are you editing on the live site? Don’t you have a test site you can edit before rolling changes to production? You claim to be an expert developer but that is one of the most basic no-no’s.",
            "Holy shit. I thought I was going crazy when my boss was pissy with me about 404 errors. She kept saying ANY errors \"look unprofessional\" and \"lazy.\"\n\nI kept thinking, \"To customers? No. To YOUR boss, probably.\"",
            "OP: \"Sites get hundreds and hundreds of 404 errors every day due to automated scripts trying random URLs to see if they can find anything good, or spiders trying to look for pages that may have once existed but don't anymore.\"\n\nBuffoon: \"Now there's spiders in my website? NEXT!!\"",
            "I work for a medium sized ISP that offers tons of services, I look after monitoring. I get what OP is saying, but it's not unreasonable to log/graph 404s and all other HTTP codes. You monitor all this stuff if you have a website worth keeping up, and you can get alerted on trends. A sudden sharp 1000% increase in 404s in the last 10 minutes might mean something important has gone missing. ",
            "> One day, he was messing about on our company's site and because of some work I was doing, one of the pages he was trying to look at was temporarily unpublished resulting in a 404 error\n\nUh OP why were you fiddling with things in production",
            "Are you one of my colleagues?",
            "You should have had it notify him via text as well.  ",
            "You should of set it up on Friday then enjoy the weekend. Turn off your phone and come back Monday.",
            "Dude just own up to making a mistake. You took down a page either without knowing what you should do or thinking nobody would notice. Why did the boss/company not even know one of their pages was going to be down? Instead you wrote a script to mislead him and cover your ass",
            "Must be my old employer!",
            "*tips fedora of STEM smugness*",
            "I don't know the scope of your site, but it's pretty common to track a lot of metrics. For instance you can use Google Analytics for page views and what not, and there's other things out there that allow you to get way more robust. One of the common features of these systems is to email you based on certain things. So ultimately, his request was not really out of line (however, his implementation might have been). ",
            "I'd just make the 404 page look like the home page",
            "Just have the email load an image from a nonexistant URL on your site...",
            "> He went berserk and said lectured me on how this was completely unprofessional and if a customer ever saw it we'd lose them. I rolled my eyes and said it was only for a minute and it was fine.\n\nI agree with him, and I expect to be downvoted into oblivion for it.  C'est la vie.  It's a bad look, I've seen this before when researching a company I was considering doing business with and it makes me wonder what else isn't completely put together behind the scenes.  Not a deal breaker, but certainly not a good look.\n\nWhether you agree with it or not doesn't change the fact that there are people out there who do care about it, and you might lose business because of it, so don't do it.  \n\nEdit: Exactly what a programmer told you when you posted it on /r/ProgrammerHumor: https://www.reddit.com/r/ProgrammerHumor/comments/7wnbd3/we_must_be_alerted_every_time_a_user_sees_a_404/du1rhho/",
            "[deleted]",
            "Most of my properties do not display 404 but go instead to the landing page.\n\nConsequently, there would not be a need to alert him because no user would ever get 404 on his webby.",
            "[deleted]",
            "Upvoted based on the title alone. The story played out exactly how I thought it would.",
            "As a former IT professional... this is HILARIOUS!!!\n\n",
            "HEY! I think your old boss is my new boss. He wants to be alerted anytime minute things occur too!",
            "This is almost ProRevenge level. Loved it.",
            "TIL that there are automated bots that try hundreds of URL's hoping to \"find anything good\" ",
            "I probably would’ve said “sure thing boss” and then just never done it. When he gets no emails, just explain that 404’s are rare and therefore not happening much, so obviously it’s nothing to worry about. ",
            "Man, if you don't find some excuse to *\"accidentally\"* reactivate that rule (e.g., next time you recover from backup), you suck at life.",
            "Nice. I hate when people think they're an expert after browsing an article. The script was a sweet touch.",
            "[deleted]",
            "Tell him about 500 errors now and send all those through. ",
            "God, you're describing half the people I've worked for in my career",
            "This was beautiful. ",
            "Did he at least admit you were right after that?",
            "Tbh an email once a day to say 130 404 pages  displayed today doesn’t sound too stupid ",
            "note to managers : careful what ya wish for. :D",
            "\"or spiders trying to look for pages that may have once existed but don't anymore\"\n What's a spider in this context?",
            "> He just ran the company, managed the accounts etc.\n\nHaha what a useless job! Every company should just be a room full of web developers, no money, and no customers. It'll be worth billions!!!",
            "Web developer in training here. This is fucking hilarious.",
            "I hate these sorts of people... good on you for teaching him a lesson but he probably never learned his lesson ",
            "See, I'm a developer but not a web developer and I think tracking 404s is a good idea, helps you find common patterns, and maybe if lots of people are misspelling a route, you just redirect it some shit. I dunno.",
            "It’s somewhat mean how you completely blow off running an entire company and managing every account as something insignificant. This guy simply can’t be the stupid buffoon you say he is. Maybe he just sucks at computer-related things and is impatient.",
            "You honestly sound very inexperienced, if revenue runs through this site in any shape or form uptime is very important.  \n\nYou might have misinterpreted his intentions, revenue loss = bad, you could even lose your job easily juniors will get cut first.  Customer satisfaction is so important with the sheer amount of compitition out there.  And yes a single 4xx/5xx on a page I'm trying to purchase something on will lead me to go somewhere else.\n\n* Why did you work against a live prod site?\n* Why no dev/staging?\n* What if you fuck up and it stays down for longer?\n* Where in the hell are your testers if you work on a prod instance?\n\n\nYou do know there are many ways to monitor link/url health which arent as spammy and probably what he wanted.  You could have suggested this. \n\n\nYou could have even built him a nice live dash, agregating site error rates not just 4xx but all of them.  Get yourself a nice little promotion.\n\nYou could also have only sent alerts on high revenue impacting pages you know use some common sense.\n\nTL;DR Honestly there was oppertunity for you to build something of real value, your inexperience led you away from it.",
            "I know that feeling, I worked as a backend developer. My manager had 0 knowledge in web development so every day he came with weird ideas and we also implemented stuff and 2 days later we throwed that away because he didn't want it anymore. It's sucks.",
            "I mean our QA department gets a REPORT on this, but no not alert ",
            "Forward httpd log. ",
            "Oh man, this is my boss. He will read up about one thing in the tech world for ten minutes. Normally just the titles of the articles, them lecture us about how he wants that implemented in our work. The bad part is that half of what he wants to do had nothing to to with our department. ",
            "Holy crap that’s glorious ",
            "Instructions unclear. 404 - Not found dick.",
            ">who had no clue about web development...\n\nWell that isn't necessarily a bad thing\n\n>...but he thought he did\n\nUgh. I feel for you.",
            "You know he meant for 404s with a valid referer. Still some bots will set it but most won't.\n\nAnd would be better to roll it up into daily reports. ",
            "Is GSC on there?\n\nAnd redirecting sane dead pages to new hot shit may recover potential leads. 410 truly deep sixed ones.",
            "Someone needs to widen their horizons and move out of butt-fuck mormon central and drop the stupid fad diet which is sending those alpha keto acids fucking with your brain; making you take personal offence to strangers giving their two cents online. \n\n",
            "You can check this in google webmaster tools.  You should also be funneling users who find 404 pages back into your site via some recommendation engine.  ",
            "/r/talesfromtechsupport material right here.",
            "Sounds like my boss",
            "That script part..  Best implementation ever.  Here I was preemptively trying to figure out how you did what you did and lol!!  Mine were much complicated. ",
            "Why didn't you just suggest the page write to the database instead of sending an email? You could have created a database table with a couple of columns, one for the offending URL and the other for the number of views. Then multiple 404's on a specific page wouldn't take up more than one row, and it would have been much cleaner to view/modify than Gmail.",
            "Sounds like my dumbass fucking boss.",
            "Yeah. If you could get around to finding a fix for this 404 error, u/lord_kelly, I'd really appreciate it. You could just email me. Thanks.",
            "What’s a spider in this context?",
            "It would have made more sense to just redirect to the home page provided the domain was correct.",
            "Random question:  Drupal?  \n\nIf so, and before I say anything further, do you like Drupal?",
            "This would have been a perfect opportunity to use some vacation time.",
            "Sorry to piggyback this, would you be able to tell me a lil about why scripts go through random url and what spiders are?  Or is there another name I should Google to learn why or how that works?  Sorry on mobile. \n\nGreat job. ",
            "[Just put them here on my desk, Mr. Gailey](https://media.giphy.com/media/f69Ei1R9MVz2w/giphy.gif).",
            "> I also made sure to take my sweet time disabling it\n\nOut of the looper here, what does this mean? Disable what, exactly? Great story nonetheless.",
            "Does this boss have point hair by chance?",
            "Poor guy does he know about email clients",
            "Does this boss have pointy hair by chance?",
            "Fellow web dev here, my boss is irrationally whiney as well. One time he started freaking out about how the columns in a particular MySQL table were ordered inconveniently for him. We told him to make a select statement, Princess.",
            "Just tell him to login to Cpanal and view error reports for 404 it even shows the url , why would you write a script?/ by the way your boss is something...",
            "!redditgarlic ",
            "That just sounds like bad coding skills instead of maliciousness. Is your code just that bad for everything else?",
            "> I’m a website developer \n\n.\n\n> working on live code\n\n.\n\n> thousands of 404 errors \n\nChoose one. ",
            "Meh, my boss would have just blamed me for the number of 404's and threated to fire me.",
            "Should have made a small program to go to ur companys 404 page and keep refreshing it until u take down the email",
            "This is OT but there are probably people here who can answer a question I have. I use TOR quite a bit and I seem to get a lot more 404s than I do using ‘normal’ browsing. I know that a lot of sites block known onion IP addresses. Is that related to the 404s I’m getting?"
        ]
    },
    {
        "post_id": "dtc3wj",
        "author": "cc452",
        "title": "Prove I broke my arm? Sure.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dtc3wj/prove_i_broke_my_arm_sure/",
        "score": 19903,
        "num_comments": 649,
        "created_utc": 1573199020.0,
        "selftext": "Bit of a warning for the queasy: Descriptions gets a little graphic. The background is kinda long, but it’s important to the story to understand how ridiculous this nurse was being (and how clumsy I am).\n\n**Background:** Way back in the magical year of 2000, I was a teenager attending a summer camp. Usually, it was day-only. Tons of outdoor activities: canoeing, hiking, swimming, archery, the works.\n\nI did not break my arm doing any of these.\n\nFor the older two years of kids, they would host an overnight in tents once a month. I was 13 and finally allowed to go and very excited. Got my tent, sleeping bag and friends. The night went as you would expect when there’s 20 13-year olds in tents with the adults nearby. We tried to pull as many stupid stunts as we could get away with.\n\nI got dared to stand on a picnic table and dance. (13 yr olds aren’t very creative). So I got up there and did. In the dark. While it was raining.\n\nI did not break my arm dancing on a wet table in near darkness.\n\nWhen we’d all had a good laugh, I went to step down (using the bench) and missed. My leg plunged down in the gap between the bench and the table, I went down and forward, hit the bench on my way, pivoted around it *really* fast, and landed on my outstretched hands. There was an audible snap.\n\nMy left forearm, bearing my full weight and sudden deceleration snapped in half. Didn’t even break the skin. I remember rolling over, seeing my arm with suddenly two elbows, panicking, and pushing it back into place. (Not perfectly, obviously. It was broken. But it was no longer at a 90 degree angle.)\n\nThat’s when it started hurting. A lot.\n\nThe ambulance took forever to get to us as they kept missing the turn off for the camp site. I found out later they drove past it for most of that time.\n\nEventually it arrives, I’m loaded in, and it’s off to the hospital.\n\nWhen we finally arrive, it’s been about an hour since I broke my arm. I’ve been in intense pain the whole time, and the EMTs hadn’t given me anything for it. (I don’t remember why. The whole ride is very fuzzy.)\n\n**Here’s where the malicious compliance comes in:**\n\nI get brought in to the main desk/triage area. This hag of a woman with permanent resting bitch face starts asking me questions while the EMTs are standing by with me after telling her what they knew. It’s a bit fuzzy, but the gist was this:\n\n>**Nurse:** “So, what happened?”  \n>  \n>**Me:** “I fell and broke my arm. It really hurts. The EMTs said you could give me something while I wait?”  \n>  \n>*Nurse rolls eyes and makes a tut-tut noise.*  \n>  \n>**Nurse:** “We have to get your arm x-rayed first to make sure it’s really broken. We can’t give you anything until we’re sure. Now go take a seat.”  \n>  \n>**Me:** “I’m sure. It broke in HALF.”  \n>  \n>**Nurse, smirking:** “Really? You broke it in half? Prove it. I swear, I get kids like you all the time looking for drugs.”\n\nNow, I am beyond pissed.  I’ve been in agony for over an hour, and this woman is treating me like absolute garbage. Even if it were just a sprain, shouldn’t that warrant some kind of pain management? I’m holding my arm, think for a second, and decide:\n\n*Eh, fuck it.*\n\nAs the EMTs are about to interject, I raise my left arm, grab the far end of my forearm with my right hand, and PUSH.\n\nIt bends. Very, very far.\n\nHer face drains of all colour and she looks like she’s going to be sick. She immediately gets on the phone. I’m now in ten times the amount of pain, but I’m grinning as only a shit-disturbing teen can.\n\nIt took them less than 5 minutes to put me in a room, pump me full of morphine, set my arm in a temporary wrap. They then x-ray me and schedule the surgery.\n\nI had a plate and 5 screws put in, along with a full cast that I kept on for about 6 weeks. They took the plate and pins out 6 months later. It was very painful and annoying, but other than a gnarly scar my arm is totally fine.\n\nThinking back on it 20 years later? Still worth it.\n\n**TL;DR Broke my forearm in half (but still intact), nurse didn’t believe me, so I bent it 90 degrees in front of her. She believed me.**\n\nEdit: A sentence. Remembering 20 years ago is hard.\n\n**Edit 2:** Wow, I can't believe how this blew up! Thank you so much to the kind strangers who gave me my first silver and my first gold (x2!). I've read through most of the comments and I'll try to answer some of the most common questions.\n\nEdit 3: Formatting and a few minor corrections.\n\nFirst, here's a photo of the scar now: [https://imgur.com/gK08Y9k](https://imgur.com/gK08Y9k)\n\nHere's the plate and screws they put in then took out: [https://imgur.com/q74coAg](https://imgur.com/q74coAg)\n\n**Q: How did you break your arm to do that/90 degrees is impossible.**\n\n**A:** Both bones in my forearm essentially shattered. They called it a greenstick fracture. I don't know that it was exactly 90 degrees, unfortunately I left my protractor in my other pants. But it *did* look like a second elbow. That was freaky enough.\n\n**Q: What about nerve/circulation damage?**\n\n**A:** I was really, really lucky. The doctor told me (after I came out of the surgery anesthetic) that it was a good thing I pushed it back when I first broke it. The position it was originally in WAS cutting off circulation and I probably would have lost the arm. That's what he told me, anyway.\n\n**Q: How did you push your arm like that through all that pain?**\n\n**A:** I was in so much pain I was quite literally delirious. It was a snap decision and really not smart, but I'm also proud of 13-yr old me. He was badass. I don't think I could do that now.\n\n**Q: The EMTs didn't do anything wrong, etc.**\n\n**A:** No, they were really nice from what I remember.\n\n**Q: Where was this?**\n\n**A:** Southern Ontario, Canada.\n\n**Q: Where were your parents?**\n\n**A:** It was about 3am at this point. The camp had been trying to call my Dad the whole time, but he slept through it for quite a while. One of the camp counsellors rode with me in the ambulance. Apparently, he was more shaken up by the whole thing than I was. He didn't come back for a few weeks. My Dad eventually picked up, rushed over immediately, and felt really bad. I was already under by this point, but I woke up to him in my room. He's a good Dad.\n\n**Q: This didn't happen.**\n\n**A:** It did! Sorry if you don't believe me, but that's okay.",
        "permalink": "/r/MaliciousCompliance/comments/dtc3wj/prove_i_broke_my_arm_sure/",
        "comments": [
            "That is hilarious and so awful. I winced. Great story OP, glad you healed well, and maybe taught that cranky nurse a lesson.",
            "It's when you reach that level of agonized pain where your judgement is ever so slightly impaired and you know it's going to hurt but just proving somebody obnoxious hilariously wrong makes it worth it somehow.  \n\nI get you, OP.",
            "My hubby cut the end of his finger off and the triage nurse insisted she had to see it first. So he took off the towel and squirted blood on her window.",
            "I had a similar situation in the 7th grade where I fell on my arm in gym class and my arm broke in a similar way. The school nurse didn't believe me and was about to send me back to class with a note when she got distracted by some other kid who came in with a migraine. \n\nBy the time she got back to writing that note my arm had swollen to like twice it's size, it was only then she decided to call my parents.",
            "Fuck. The year 2000 was 20 years ago.",
            "Ah man I am just imagining her face over and over! The malicious compliance was delicious! That’s the type of thing I would do. Lol",
            "Ok so this is back in 1983 when I was the grand old age of 5. This tale gets better as it goes on and explains why I hate going to see drs and dont trust them. \n\nFell off PE equipment, leg going between the rungs to climb it landing on the mat belie in a heap \n\nTeacher \"walks\" me to the first aid area (leg giving way with every step\n\nTeacher drives me home and gives me to my mother \n\nMum pushes me in an old push chair to the drs (she knows I have done something seriously wrong )\n\nGP decides I have ligament damage and proceeds to push, pull and twist my leg (I just remember having my head buried in my mums chest screaming)\n\nGrandad drives me to the hospital (we had no car) to be told its broken just below the knee and get a temp plaster put on\n\nGo back the next day with dad borrowing grandad car. Only for it to break down on the way home. Cranky five year old in July in a hot car with a broken leg. Nice coach full of footballers pushed us out of traffic. \n\nReturn two weeks later to the hospital to have the plaster replaced (I was too tall for kids crutches too short for adults so they were putting me a plaster I could walk in)\nNurse starts up the circular saw thing used to remove plaster casts. She gets a few inches down and I start screaming (again) to be told it doesn't hurt stop making a fuss. Plaster removed blood all over the place and a nice 2 inch scar to prove that yes I did feel the saw slicing through my skin.\n\nAnd people wonder why I wont go to the drs.",
            "I had a snap clean through one of the bones of my wrist when I was about 9-10, from falling off the bottom level of one of them spider-web climbing frames. I remember my mum acting really panicked while driving to A&E, but she kept saying along the lines of \"it's probably only sprained or bruised, but let's get it checked out anyway\". Just reassuring me - only told me afterwards that she'd clearly heard the snap when I fell and was definitely not in a state to drive. \n\nAnyways, got to the hospital and found that they just don't believe you when you self diagnose broken bones. They had me in a waiting room for ages, finally got to a triage nurse who felt it a bit and gave me some paracetamol and scheduled an X-ray saying: \"it could be broken but probably just sprained, we'll take a look\"\n\nWait up to an hour more (mum exaggerates and I don't remember too well) and get into the X-ray. Here the technician is acting real short, sits me down on a chair to take an image of one angle..  doesn't say anything, just suddenly twists my wrist to take an image at another angle. I remember being so close to passing out from the pain of that, mum described me as instantly turning as white as the hospital walls.",
            "I cut my leg really bad once. Down to the bone bad. 30 something stitches bad. My mom drove me to the ER and I hobbled in shirtless cause I was using it as a tourniquet. The lady behind the glass was ignoring me. I was talking and she literally wouldn't even look at me. When I smacked a blood covered hand on the glass she sighed and finally looked up. The look of bored contempt changed real quick when she saw the blood. Some people just shouldn't work in places that care for the injured.",
            "I was playing softball and a girl got me in the face with the ball and I said “oh my god, I think you broke my nose!” And the coach was like “you can’t have broken your nose from softball” so I removed my shirt from covering my nose and all this blood and clear fluid gushed out, which it turns out, the clear fluid is from around your brain! Nice! Anyway it was broken, right at the bridge, so the bone rather than the cartilage, and I got out of the rest of the season of softball because another blow would’ve shattered it ✌🏻",
            "Bravo OP.\n\nIt's so weird that doctors and nurses have no good way of judging pain. It is so subjective.\n\nI had a minor car accident about 10 years ago, and afterwards I felt fine except for when I kneeled down on my right knee. It hurt a LOT.\n\nI go to my family doctor and he pushes around on my knee and looks really skeptical. I keep telling him it doesn't hurt when I sit there or when he pokes around. Very specific place that hurts. So i use my own hands to work around my knee and find the one little spot that hurts to push on and show him.\n\nHe pushed on it HARD and my vision blurred, my stomache turned, and I fell backwards nearly fainting. His eyes went wide and he apologized. I remember he said \"I'd call that excruciating\" and I replied \"So would I\".",
            "Similar break the weekend before finals my freshman year of high school. Ended up having to have surgery. I was helping my sisters’ Girl Scout troop set up a telescope, ran back to the main campsite to grab something, and when running back out tripped over an unmarked black 550 cord guyline on a tent. \n\nI got up, walked back to the adults and told my mom “I think I broke my arm”. I was immediately asked “why do you think that?” Well, my smart self decided to lift the sleeve of the oversized hoodie I was wearing to show them... that was a mistake. I looked at it, and about 2 seconds later I was passed out. Thankfully someone caught me before I hit the ground and broke anything else. \n\nSimilar ambulance story too... campsite was across an open field from the fire station, but 911 couldn’t figure out where we were. Once they got there and were transporting me, the ambulance got lost on some old back roads. You could see the hospital from the campsite, and we still were lost. \n\nNo crazy ER staff... they had me in the back immediately. Tried a couple times to re set my arm normally, then they sedated me and used this Chinese finger trap looking thing. (The sedation didn’t work... I woke up) Ended up having surgery to put in permanent plates and screws. \n\nIn the end, I have a couple of big scars on my arm, permanent metal in my body (no, I don’t set off metal detectors) and I got out of taking finals that year.\n\nEdit: format and a word",
            "Nice power move.",
            "As an emt I love this story! We deal with a lot of old salty nurses and that stunt you pulled is amazing! Dumb but amazing! You should know that this story has probably been told by that many times and that nurse has been made fun of by said crew",
            "Pain is temporary, proving someone wrong is forever.",
            "When I was in 8th grade I got stung by a wasp on my thumb turns out I was allergic. When I asked the teacher to go to the nurses office because I felt like my arm was burning she looked at the mark on my thumb and told me it didn't look that bad and I wasn't getting ok of class work and to go sit back down 10mins later I fell out of my seat and my arm was swollen up to my shoulder( I got all of this from my classmates because I was passed out) anyway EMS and my mom were called I was taken to the hospital where I made a full recovery and the teacher was fired.",
            "That was tough to read, must have been crazy to live through. \n\nMany moons ago, I went overseas to visit family. One day, I went out with my uncle and aunt and a few cousins roller blading. There was a collision and I broke my arm. I told my uncle I need to leave, to take me home so I can go have my arm taken care of. He refused, insisted that if I had broken my arm that I’d be screaming and crying. \n\nWell, I was twenty, I didn’t feel like screaming and crying especially around so many early teen cousins. But I knew my arm was broken. And really, why would I lie about breaking my arm wtf.\n\nMy aunt insisted I was in pain and that I should be taken home. He said nope.. let’s all go lunch. I couldn’t leave by myself as I had no money, no phone, and a language barrier. I thought it’d be faster to wait him out. Sat through a loooong lunch before he dropped me off. Thankfully my mother didn’t have any trouble believing me and took me to the hospital. Whaddya know, I broke my arm. \n\nUncle only believed me after he saw the cast on my arm. \n\nWhy are people like this?",
            "> Nurse, smirking: “Really? You broke it in half? Prove it.\n\nIts when I got here, that I knew what was coming up and my stomach started to turn thinking about what I was just about to read.",
            "I want to punch SOME nurses in the fucking face.\nI had a similar incident happen. I was on vacation for Thanksgiving in the desert and a bunch of us decided to go riding quads. Now mind you I've been riding quads many many many times. I was fully suited up. I had a helmet, riding boots, gloves all the accoutrements you would need to go riding. Long story short I ended up getting a compound fracture breaking my riding boot in the process. Was about two hours before I got to the hospital due to someone having to go get a truck, bring the truck to me and then take me to the hospital. I went in for surgery had a 10 inch plate and eight screws, to which I still have 25 years later. About an hour, I'm guessing, after I came out of surgery my leg was on fire. Because there were no notes in my file to give me anyting, nurses refused. They actually came in and told me to be quiet and then shut my hospital room door. After more continuing crying and screaming from me some genius finally decided to call my doctor and he authorized pain medication. The fucking bitch of a nurse finally comes in and stabs this shot right into my thigh. No warning no nothing and then leaves. Not everyone has the compassion or capacity to be a nurse. Forgive format I'm on mobile.",
            "That's ducking beautiful\n\nEdit: First silver, thank you kind stranger.",
            "Oh man, I totally forgot about this until now, but I have a VERY similar story!  When I was about 7 I was in a diving class.  After a few months of summer practice, they were finally ready to let us start trying the 3-meter board.  I watched most of the rest of the class go up and dive, all the while I was trying to muster up the courage.  My turn finally came and I slowly made my little way up that ladder, got to the end of the board...then noped the fuck back out.  I made it almost all of the way down the ladder, but in my excitment to get to solid ground again I misjudged where the bottom rung was.\n\nI stepped off 1 rung short and fell farther than expected, putting my arms behind me to brace the fall.  Unfortunately, elbows do not bend backward, and mine snapped clean in half (like yours) though not a mark on my skin.  \n\nSo I am there on the ground cradling my arm and crying, and the damned dive instructor comes up asking what is wrong.  I told him I broke my arm, but he said there is no way.  This went back and forth a few times, him thinking I was only faking it to get out of diving.  He kept accusing me so I proceeded to bend my elbow completely backward to show him.  \n\nLike your nurse, the color drained straight out of his face.  I don't remember much after that either other than my mom yelling at him once she came to pick me up.",
            "Beautiful. Reminds me of the time I went to an emergency room so sick I could barely stand. This was in the middle of New Mexico, and I was about five states away from home driving to California. They gave me a card to fill out with what was wrong (wouldn’t even really speak to me) and I couldn’t really even think to fill it out right. The nurse told me to sit and wait, with a “you’re probably going to be here for a while” attitude. I sat for a few minutes before I got up and went to her again, crying and saying “I don’t think you understand, I am REALLY sick and I desperately need to see someone.” She rolled her eyes, and then I accidentally vomited all over the floor. Turns out I had bronchitis/pneumonia that had almost turned septic or something. It took me weeks to get over and it was awful!",
            "My husband broke his arm as a 14 year old in a similarly stupid fashion, by jumping over a couch instead of going around it. \n\nHis parents rushed him to the ER where they wouldn’t give him any pain killers until the social worker made sure this wasn’t an abuse case. His dad, who is a really extra jovial guy most of the time, ripped that social worker a new one. \n\nI’m sending this to him, i am sure he would empathize.",
            "Man, you're lucky. When I did that around the same year, I got to wait in the waiting room for 3 hours, was given some ibuprofen, and a splint. They never even set it because somehow a hospital in Houston requires a pediatric orthopedist to set a broken arm for a 13 year old. \n\nThis was a Friday. When we called the orthopedist on Monday they refused to believe the hospital didn't set it, so they didn't schedule the appointment until Tuesday. Had to have it surgically set a day or two later and it's hurt pretty much every day for the last 18 years (mostly in winter).",
            "I had a bad fall with my bike on a pretty steep downhill road as a teen. I was 15. Friends that saw me fall say I did a front-flip out of nowhere.\n\nI remember nothing. (Strike 1 for concussion)\n\nIn the hospital, they told me I was fine. Nothing wrong. No mentions of a concussion, despite me saying I couldn't remember. I'd sprained my shoulder but that would be fine in a week. During their examination, I told the nurse I felt sick. She brushed it off.\n\nI threw up on her. (Strike 2 for concussion)\n\nI felt disoriented when I got home, and through the whole time I was asleep. (Strike 3 for concussion)\n\nWhen we told this all 3 weeks later to our GP because my shoulder was still not fine, he told me that based on the symptoms, I'd had a Severe concussion, was lucky to have sustained no brain damage from that, and after examining my shoulder thouroughly, that it wouldn't be fine for the next few months because of the hospitals fuckup.\n\nI also should have been woken every hour that night, checking my consciousness etc because of how dangerous concussions are.\n\nI hate hospitals.\n\nSidenote: My shoulder still clicks when I roll it. I sometimes freak people out doing it.",
            "In my country there is like four kinds of EMTs. 2 of those drive ambulances for a living. One is only allowed on one kind of ambulance for the low priority cases, you know people who could have also taken a cab. And the last is the emergency doctor, who usually comes in a car after the ambulance people. \nWhen I became the very basic EMT (for festivals and low priority cases), we learned EMTs are only allowed to give medication under the supervision of an emergency doctor. \n\nIf it works similar in your country, I guess no emergency doctor was available that night, so you had to grit your teeth.\n\nI winced at you pushing the bones around twice. I wouldn't have dared that as a Teenager.",
            "In HS, got in fight with sibling. I said something provoking, touched the face, and their foot came straight for my stomach. Of course, put my hands up in self defense, and felt awful awful stinging pain. One of my worst pains ever. I paced my room, holding it, barely able to deal. It swelled up badly, turning a nice dark purple. Sibling says, ‘ see what you made me do!’ \n\nParents come home from a scan confirming remission; dad, a medic from the navy, and said it’s fine. Prob sprained. I knew it wasn’t,  But I couldn’t do anything. I kinda hoped it wasn’t broken. Bus ride was real fun. First class was gym. I knew I just couldn’t do anything, so I went to the teacher. She took one look, and said ‘it’s broken. For sure.’ Sent me to the nurse, who also said so. Called parents, they argued a bit, but came and got me. Took to drs, they said I had two broken bones in hand (main and middle fingers, right above the wrist). One was a bad fracture (like a ‘v’ , one piece barely hanging on.  Got sent to orthopedics, and they decided against pin, since it held overnight. Had cast put on, couldn’t play sports for a year. But I didn’t have to do frog autopsy.^ ^",
            "A couple of months ago, I had such bad back pain I couldn't walk and had to call an ambulance to bring me to the hospital. I was told I wasn't a priority and that I was just there for drugs. Was given ibuprofen and told to get out. I couldn't walk. After explaining this to the nurses again. I was given a wheelchair and told to see myself out. After a few days later I could actually walk again. Come to find out I actually had 2 herniated discs that required injections, that j found out about months later. The hospital never even gave me an MRI, or anything.",
            "My father, who was a physician for more than 30 years, always said that whenever a patient says it feels in pain, you should believe him. If he is telling lies or not, it will reveal itself later.",
            "Jesus tap-dancing christ!",
            "Lol kind of reminds me of the time I snapped my finger into a 7.  I was in a juvenile correctional facility, and always had a playful attitude.  The gent next door and myself would always get in each others faces and act like we were going to start something.  Neither of us were, it was just in good fun.  One day, I grabbed him by the shirt and he twisted hard to get out of my grip.  I was surprised how easily it slipped out, considering I was pumping iron for 11 months at this point, and had an absolute death grip on this kid.  I opened my hand, and the index finger of my right hand snapped sideways at the last knuckle.  I've never seen an African American gentlemen turn to a sheet of grey so fast.  I went down to the corrections officer and simply stated my finger broke with no emotion.  He rolled his eyes, basically said to show him sarcastically, and said something to the effect of kissing my boo-boo.  I held up my hand, and he looked like he was going to pass out.  When we were walking to the medical facility, he apologized up and down, and said he didnt believe me because I wasn't screaming my head off.  It was kind of surprising to me that he didnt inherently understand that you cant show pain, fear, or sadness in a facility full of murderers, rapists, and gang members.  \n\nFor those of you who are curious, I was around 19 when my \"buddy\" kept peer-pressuring me to go car hopping with him, and I did.  Sentence was 13 months in a juvenile prison and 3 months of boot camp with my record being expunged with successful completion.",
            "Reminds me of the time I snapped my right arm and had a double compound fracture, my arm was lying on the ground looking like a C. \n\nThe insurance place argued wih my mother about sending an ambulance as it was unnecessary and to just put me in a car!!! Well they finally sent one but for some reason they turned their sirens off about 2 minutes away, strange.....\n\nSeems they ran out of gas and had to stop and fill up before continuing, good news is I'm now responsible for the rule where they cant be under half a tank of gas when in use.",
            "I broke my wrist once and went to the university doctor. I had to sign in so I picked up the pen and wrote my name. \n\n\"You're wrist doesn't look broken to me. Seem to be using it just fine.\" \n\n\"No it hurts. It's been a few days and it still hurts I think it's broken.\" \n\n*rolls eyes* \n\nGet an xray and the doctor tells me my wrist is broken and I need to see a specialist - gives me a note and tells me to ask his secretary to make an appointment with a specialist. \n\nI went back up with a shit eating grin as I slid the note across the counter to her. \n\n\"So turns out my wrist *is* broken and the doctor would like *you* to make me an appointment with a specialist\"",
            "Dude. That’s fucking *metal* I respect the FUCK out of you for that lmfao. Talk about a major power move.",
            "For anyone wondering medics can give pain meds. EMTs cannot. \nDepending on the pain med they have specific cases when they can and can't. Long bone fracture is a good indication but also giving pain meds to a 13 yr old is risky. \n\nAlso our GPS units suck and unless your back road trail entrance is lit up we wont see it, best bet is have someone wave us down.",
            "Cussing yourself physical pain to prove a point, worth it lol",
            "I hope you maintained eye contact with her to assert dominance.  \n\nWell played",
            "PSA: Please do not, under any circumstances, try to set your own fracture. You could easily make things worse by setting it incorrectly. Instead, keep your limb as immobile as possible until you get to a medical professional.",
            "> Thinking back on it 20 years later? Still worth it. \n\nThis is how I know the story is real",
            "God damn, why is that every ER nurse?  “Oh you got stung by a stingray surfing? Well you’re not supposed to be here without shoes on. Please wait an hour for my tech to get some hot water to put on it.”",
            "Nurse: Did you *really* break your arm?\n\nOP: **im gonna do what's called a pro gamer move**",
            "Doctors in America are ridiculous. One doc will prescribe the heaviest amount of hydrocodone as he can for a contusion.... meanwhile another one will refuse anything higher than ibuprofen for a man whose fingers just got ripped off in an industrial accident.",
            "I got tears in my eyes as you bend your arm. Bothe because it was a beautiful malicious thing to do and because I could feel the agony you must have felt. Great writing to.",
            "That was brilliantly written.  Glad you're okay also!\n\nBtw you probably had a very good case for a lawsuit there.  Or at least getting that woman fired.  That was unacceptable.  Particularly with the EMTs right nearby.  Sorry you had to go through that!",
            "Wow, everyone in emergency medicine, whether that's pre-hospital or hospital, is very aware of drug seekers. But to openly accuse a patient of drug seeking is ridiculously bad tact, and should probably be punishable or even illegal.",
            "If she really did asked an unqualified minor to prove internal injuries such as this then thats a lawsuit. Jesus she was so unprofessional.",
            "Ohhh the pain!!! I'm an EMT in Alberta, Canada and I don't know what the scope for EMT's is there, but here all ambulances have one EMT and one advanced paramedic (now called primary/advanced care paramedic) and the only painkiller EMT'S can give here is nitrous oxide, AKA laughing gas, and a lot of us don't even bother because (at least in my opinion) it doesn't really do much for pain relief. Basically, it still hurts, but you don't care as much. So if it was only EMT's, it's possible they just weren't able to give you drugs, in which case, I am so sorry you had to deal with that 😅",
            "I’ve run into so many ‘medical professionals’ with that attitude and it drives me nuts! I have a pretty high pain tolerance and they never take me seriously. I love that she had to eat her words.",
            "That . . . Very good!  Holy crap, I know I couldn't have done that!\n\nGo easy on the EMTs.  They may not have had orders for pain control.  A broken arm is a basic life support call and there may not have been a paramedic on the unit.  (A paramedic is an EMT, but an EMT is not necessarily a paramedic.)  You typically need an advanced life support EMT (paramedic or maybe a cardiac technician) to be authorized for pain control.",
            "I had a similar experience to this, but my words were sufficient, I didn't need to prove anything to anyone.\n\nI was sparring in tae kwon do class once, left myself open and took a ridgehand to the face, breaking my nose. My instructor looked at me and said, \"You might want to go into the bathroom and use the mirror to straighten that out.\" Went in the bathroom and thought, \"Huh. My nose probably shouldn't be on that side of my face.\" So I braced my head with one hand, and cracked it back into place with the other. I figured better to just do it right then and there before the endorphins/adrenaline wore off and the swelling started. \n\nWhen I got to the hospital, I had the following conversation with the desk nurse, triage nurse, x-ray tech and ER doctor, and it was almost identical all four times.\n\n\"So what brings you in today?\"  \n*\"My nose is broken.\"*  \n\\*Scanning my face.\\* \"It doesn't look broken.\"  \n*\"Yeah it was off to the side, I cracked it back into place.\"*  \n\\*Wincing\\* \"Ouch, ok sit tight and we'll get with you soon.\"\n\nOnly difference was the doctor, moving his head around mine to look at my nose from a few angles, \"Wow, you did a good job, can't even really tell.\" After he looked at the x-ray he goes, \"Yep that's broken.\"\n\nNo shit, doc.",
            "Only thing that would’ve made it better is if she would’ve passed out or threw up. Love the “Still worth it”!",
            "13 yo looking for drugs? Wot",
            "Reminded me of my own experience.\n\nI stepped on an upturned screw while barefoot as a child years ago. Made a nice hole in the middle of my foot. Not big enough to warrant a doctor, but big enough to hurt a lot.\n\nThe next day hobbled up to my gym teacher and told her what happened and asked to be excused from running. She called me some unkind things about my honesty and work ethic, so I took of my shoe, the sock, and the bandage, and showed her.\n\nHer eyes got wide and I did not have to run for that week until it healed.",
            "Reminds\nme\nof this:  \nhttps://www.youtube.com/watch?v=IGA0iIHpHu8",
            "Genitals of steel",
            "I broke my arm in two places when I was 6 and had a similar experience.\n\nFell off something I was climbing at the playground. Remember hitting the ground, but not getting up, remember trying to get back to where my parents were and I passed out halfway there.\n\nThe doctor didn't want to put a cast on it and was talking about patients he'd had in other places that didn't get casts on their brakes and saying what could go wrong. He didn't realize I understood what he was talking about and he was scaring me.\nHad pins, two casts and scars. Told my mom I wanted to cut the doctor's ponytail off.\n\nThen of course being a klutz it wasn't that long after I got the cast off that I fell out of a tree, scratching up my arm and scaring people but not re-breaking luckily.",
            "HA HA HA.  You just brought back a 40 year old memory.  I was in a car accident 40 years ago with my father, who had a glass eye from a previous injury.    We were taken to the hospital.  The doctor was using her penlight to examine my father, flashing it in his eyes.  She said \"Do you know you have a lazy eye sir?\"  We could not get out of there fast enough.",
            "Op, that is disgusting and hilarious. I applaud you.",
            "It still wrinkles my brain that the year 2000 is 20 years ago...",
            "I broke my wrist falling just last year. This made me remember the pain and nausea seeing it all crooked and bent, might need to barf, please excuse me.",
            "I've worked ER and EMS for 12 years. I've seen lots of broken bones. Playing this scene out in my head as I was reading it caused me to pucker up a bit. \n\nThank you for that lol",
            "Haha oh man that is perfect. Reminds me of when I was working as a bouncer and had my bicep area (can't remember the name of the bone in the upper arm) broken. Because of the small town and being known as a bouncer at a club known for drug trafficking (which I never allowed but some people are gonna do anyways) the nurse at the hospital triage thought I was looking to score opioids. Newp, apparently a giant hulk looking fucker throwing a 200 lb steel and wood table into your arm does actually cause damage.",
            "Man, fuck that nurse.",
            "Dude this story made my day. Hilarious and a great story.",
            "I'm sorry you broke you arm but that was funny as shit lol",
            "As someone who has broken an arm similarly to what you described, I have no idea what superpower strength you invoked to intentionally bend in without passing out or screaming in agony.",
            "My wife went in for kidney stones.  There was a 1.5 hour delay sitting in the waiting room.  she spent the first 75 minutes rocking back in forth moaning in pain, trying not to scream out in the waiting room.\n\nNobody there seemed to give a fuck.\n\n10 minutes before they brought her in the pain subsided, as kidney stones do.  It's only painful while the stone is moving.\n\nCue \"Why are you asking for such heavy pain meds, you're obviously not in pain.\"\n\nGot treated like a drug seeker by the doctor, and by the next doctor.  \n\nYou would think people who work in medicine would understand how the body works...\n\nI've been in for acute back pain a couple times.  Bad lower back, sometimes I do something I shouldn't and then I'm on the couch for a few days.  EVERY. SINGLE. TIME. ive been to the doctor about it they have super helpfully offered me aleve or advil.\n\nThanks doc - I can get those over the counter cheaper than getting them from you, I'd like something that actually works...\n\nI'm super stoked Americans have fucked over the pain meds industry and doctors.  I've never gotten a prescription for pain meds.  My wife has after major surgery, and only then.  But neither of us are ever given a damn thing because addicts have shit on the entire system.",
            "Jesus Christ, dude. You deserve the biggest badass award available, whatever the hell that is. Way to show bitchy desk woman who probably shouldn't be in healthcare. Also, sorry about the pain, but now you have cool scars and a great story to tell.",
            "Ouch! \n\nWhen my daughter (11 at the time) broke her arm it also snapped in 2. Humerus, just below the growth plate. She fell out of tree. I’m a nurse and after a quick assessment knew I couldn’t move her. When the ambulance arrived I wasted no time “She’s got no allergies! Do you have morphine?!?”",
            "Damn, that was hardcore. I once witnessed a kid from my class break his forearm in this manner during gym class. We were doing parallel bars, he swung up into a handstand, and instead of swinging back down he fell to the side, hitting his arm on the bars on the way down. Broke both bones and I think he lost consciousness from the pain. Gym class was over by that point, he was flown to a nearby hospital by helicopter, came back two weeks later with a scar and metal plate in his arm. The gym teacher was probably the second most unlucky guy in that situation. It was a substitute, and that was his last day with our class. He certainly went out with a bang,",
            "One of my absolute biggest pet peeves/things I can't stand are people who work in any service industry and have this kind of disgusting complacent attitude. Even when I worked in a grocery store I was ten times more respectful and helpful to customers than some employees I've experienced. \n\nEspecially when it pertains to medical issues, physical or mental. That's when it gets serious. I've heard countless stories and have also myself encountered  people who work in the medical industry being lazy and wasting time, chatting when they should be working, and dismissing patients who voice their concerns since the patient can't possibly know anything. Doctors know all 110% of the time.Wrong. Sometimes giving some insight   to the person you're supposed to be HELPING is beneficial. Power trips infuriate me.",
            "Dude I cringed so hard when you described you breaking your arm and the malicious compliance yikes I probably would have passed out myself. I'm lucky I've never broken anything.",
            "Oh man, you saw an opportunity and took it just to teach her a fucking lesson at great pain to yourself. Bravo.",
            "Just a note on the pain meds, most parts of the US still do not allow EMT-Basics to administer pain medications for various reasons. That is reserved for Paramedics which are a higher level of care as they are much more highly trained and depending on area, would not even be assigned to this kind of assignment unless the EMT-Basic asked for them, in that case they might be further away from you than you are from a hospital so it's not practical to wait on scene.\n\nSorry about the pain but at least you got to put the nurse in her place. Some nurses just need a reminder of what high quality patient care is.",
            "I wish i was this badass at 13, goddamn",
            "As someone who works on an ambulance, it is very common for medical personnel to think they are drug seeking or some other BS, especially if you are having abdominal pain. That shit is almost never given in the back of an ambulance for abdominal pain.",
            "This is how it feels for chronic pain sufferers. Except there's no broken arm.",
            "I really like the bit in your QnA where you say the idea to push your arm back out was a \"snap\" decision. Well played. Lol",
            ">**A:** I was in so much pain I was quite literally delirious. It was a snap decision and really not smart, but I'm also proud of 13-yr old me. He was badass. I don't think I could do that now.\n\nSnap decision eh? I see what you did there :p",
            "Gawd damn this is a true madlad dude. Post it in r/madlad",
            "I struggled not to burst out laughing as I would have woken my family",
            "Reminds me of the episode Rob of the podcast Heavyweight. A guy's family doesn't believe he broke his arm as a kid and he goes about tracking down evidence.",
            "I had to prove I had shingles once. I lifted my shirt and they sent me home",
            "Hey at least you only broke one arm",
            "was it worth to never been allowed back in r/Neverbrokeabone? jk.",
            "I wish I didn't read that as now my everything hurts.",
            "God the things I would have said to that nurse once I bent my arm if I had been you.\n\nAdults have almost zero trust in the ability of children to discern their own health/medical condition.",
            "Now THATS a power move",
            "Absolute MadLad",
            "nice.",
            "I broke my ankle at 15 in a car accident. I could literally feel my bones rubbing against each other. Probably not as painful as what you went through, but it hurt like a bitch. The dr at the hospital told me it wasn’t broken as I was crying and in absolute agony. I hated him for saying that and undermining me (that’s certainly what it felt like.. it was my body and I knew what was happening). Apparently he told my mom later that he just said that to make me feel better. Well, it didn’t. Your nurse sounds like a major twat.",
            "When I dislocated my elbow at first i was just like \"huh. Guess I should hold this still.\" Then people around me started freaking out so I did too.",
            "I actually have a similar scar on my right arm, story behind it isn't as interesting (I fell off my bike), compound fracture both bones broken, I still have the plate in.\n\nI always show my co workers just to gross them out.",
            "Worked in an ER my entire working life. Totally believe this happened. Seen far weirder things. Great story, good writing too. Wish I could give Reddit award.",
            "Oof. I had a similar break to my leg in high school, but when they set it, I blacked out. I dont even really remember it. Not sure I could have done that XD",
            "And no lawsuit from the parents for undue pain when the person responsible for authorizing it, denied you because you were a kid. She profiled you and denied you pain medication while waiting for care. That happen today, she’s be out of a job.",
            "Lady at reception: your arm isn't broken, get lost.       \nOP: oh then why can I do this *proceeds to bend middle of firearm in half *",
            "I love it",
            "Oof, cringing so hard reading this. Holy shit, I just can’t with breaking the arm in 2 thing, nope nuh-uh",
            "Hard as nails.",
            "You made me convulse with laughter. Cheers!",
            "There’s an easier to prove you broke your arm. Just tell them you’re banging your mum.",
            "That's hilarious in the worst possible way.\n\nI feel bad for laughing.",
            "100 points for badassery.",
            "If it was just plain emts they don’t have any pain meds on their ambulance. Paramedics on the other hand do.",
            "Nowadays that would probably be a fat lawsuit as cherry on top.",
            "That scar sounds really cool.",
            "How to display your power 101",
            "Great story! Man, what would make her think a 13 year old was a pain med junkie?",
            "I once put my nose back in place after getting the shit kicked outta me. That was painful, I couldn't imagine an actual broken bone...goodness.",
            "BUT CAN YOU DO *THIS*?!",
            "Ugh, this hurt to read. I had a similar break when I was 9/10. Trip/fall onto left arm, both radius and ulna broken, one got set, one needed a plate afterwards. Having 2 elbows was pretty damn freaky.",
            "Fucking radical. Way to show her!",
            "Holy shit this is amazing. Slightly squeamish but I'm so glad I read through.",
            "I would've killed to see her face",
            "As far as pain meds on the ambulance, if they were just EMTs and not Paramedics they would not be able to give you anything.",
            "The two elbows part killed me. Was laughing out loud. Glad to know it wasn't too serious (nerve damage etc).",
            "The intro alone was worth the read.",
            "Bravo. I’d do this if it happened to me haha thanks for the idea.",
            "I am so glad I've never broken anything bad enough to do this.",
            "where was your mom ?",
            "I would've done the same thing. Just to show that bitch who's boss",
            "Oh god. Bravo. Fuck that hurt to read.",
            "  Hi g5 me",
            "OP this didn’t happen to be in Wisconsin did it?",
            "This sounds exactly like the kind of thing that would happen at a JCC summer camp...",
            "This is MC on a heroic scale!!!!",
            "ixwXWW'w",
            "EMT’s don’t give painkillers, or at least, they don’t know AFAIK. If you have a broken limb they just sling it in position of function.",
            "Omg that's awesome",
            "You are not banned from r/neverbrokeabone",
            "You rock! That’s all I have to say",
            "That's metal",
            "Not gonna lie, I was expecting exactly this from the title alone, but the payoff was still SO worth it. Absolutely hilarious. Good stuff.",
            "Damn, OP, you really know how to tell a story.  Loved it!",
            "I was told by an EMT while being transported to the hospital that the reason they couldn't give pain medicine is because it could potentially interfere with the drugs that the nurse / doctor might need to give you when you make it to the hospital. Not sure how true that is, but it makes sense.",
            "Badass",
            "Should have twirled it like a propeller",
            "Show us your scar, man. Come on!",
            "That was freaking amazing!",
            "/r/MasochisticCompliance",
            "Almost puked at the thought. Thanks for that.",
            "This reads like some r/entitledparents shit.",
            "The ability to ensure that kind of pain, I've broken a few bones myself and I've heard bone pain is the absolute worst pain, is pretty crazy. I would bet your are doing pretty well with life. Enduring self inflicted discomfort is extremely important for the mind and body.",
            "I hope that witch never goes to sleep before thinking of this",
            "Tell us how did your mother help you through your recovery?..",
            "WAIT YOU'RE SUPPOSED TO GET THE PLATE AND PINS TAKEN OUT?!?! Oh fuck meeee... I've basically got the same break in my left arm, radius and ulna both broke when I slipped and fell working at McDonalds. That shit sucks and I feel yah. Seeing my arm make an S shape was a plus though. Really though was I supposed to get those taken out??",
            "i dont understand how people dont believe this. i had a classmate who's jaw snapped when she got her wisdom teeth out (she was very very unlucky). truth is stranger than fiction",
            "That moment of shock that *\"holy shit my arm is broken\"* and the small rush of dopamine from the pain makes you do some insane shit.",
            "You should have reported her. Surely refusing service because she thinks your faking is a HIPAA violation?",
            "Nurses can be some of the most idiotic masses of snobbery wandering a hospital. I sliced my index finger open some months ago while cutting bread, and at the hospital, not only did they not give me anything to numb me before they sewed me up, but they also used two big stitches instead of four small stitches, which would've been more appropriate according to my doctor. Now I have an ugly ass scar on the tip of my left index finger for the rest of my life.",
            "You must've broke the fucking shit out of that thing. I remember breaking my left arm many years ago, snapping it literally at a right angle and they just set it in a cast. That was that",
            "Depending on the type of ambulance you get it may not be in the EMTs scope of practice to give you pain meds"
        ]
    },
    {
        "post_id": "i9rdjq",
        "author": "zardkween",
        "title": "Don't touch MY stuff",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/i9rdjq/dont_touch_my_stuff/",
        "score": 19887,
        "num_comments": 410,
        "created_utc": 1597429595.0,
        "selftext": "In college, I had a randomly assigned roommate that I did not get along with at all. Our personalities were just on two opposite ends of the personality spectrum and we clashed. The only things we had in common were that we went to the same college and lived in the same apartment. That’s it. \n\nAnyways, it was a nightmare living situation. The apartment had four rooms and two bathrooms. She and I shared the same bathroom as our rooms were next to each other. We had two roommates on the other half of the apartment that we both got along with. \n\nAfter over 8 months of just pure passive aggressiveness towards each other (like, I would put sticky notes on her days old dirty dishes and she would put my wet laundry on the floor), she decided to report me to apartment management for “bullying” her. Honestly, we were doing it to each other. \n\nHowever, the apartment management took pity on her because I was tall and athletic and she was 6 inches shorter than me and very thin. She claimed I “physically intimidated” her and she was scared to live with me. She did this because she wanted to move to a new apartment without paying a $500 fee but instead the apartment issued a written warning. \n\nThe warning stated that we were not to touch any of each others personal belongings without written permission. First infraction was a $250 fine. Second infraction was a $500 fine. And a third infraction would result in eviction. I was so scared walking out of the office because I could not afford those fines and she had the biggest smile on her face. I knew that she would immediately report me. \n\nI went back to the apartment and she left for work. I was mortified. Then I realized she made a huge mistake. Everything communal in the apartment belonged to me and she was a super moocher. I told my other roommates what had happened and they were shocked. I asked if I could use their bathroom temporarily and they said “of course.”\n\nSo, I immediately emptied out everything that was mine in our shared bathroom (shower curtain, toilet paper, rug, towels, soap). I grabbed my magnetic whiteboard and listed out everything in the kitchen that belonged to me (plates, cups, mugs, pots, pans, silverware, coffee maker, toaster, pot holder, towels, literally listed every single item) and said that she is not allowed to use any of it without my written (no texts) permission. I also drew some eyes to remind her that everyone was watching. I popped that whiteboard on the fridge and went in my room to do some homework.\n\nLater, she came home from work and had a meltdown. She screamed!!! Not any words, just a blood curdling scream!!! In the following couple of days, her father came to the apartment to threaten me that they were getting a lawyer (lol), she bought her first roll of toilet paper and a plastic shower curtain, but it was too much for her to handle. She went back to the main office to report my “bullying” once again and was instead told she could either deal with it or pay $500 to move to a new apartment. \n\nShe moved out 7 days after the warning was issued.",
        "permalink": "/r/MaliciousCompliance/comments/i9rdjq/dont_touch_my_stuff/",
        "comments": [
            "A lawyer? Really?  How childish of her and her father.",
            "[deleted]",
            "I lived in a similar student apartment in college.  My Junior year, I lived with 3 girls who were a year ahead of me in school.  They were all friends and just needed a 4th person for the apartment.  How bad could it be, right?  Wrong!  They were noisy, rude little &#%\\* who used my food and stuff without permission, never included me in anything and were obsessive about the thermostat (they insisted on keeping the AC off during a major heatwave in early September when we lived on the top floor in some insane bid to save money on the electric bill).  They also brought in a cat against the rules of our lease and even though they promised I wouldn't be fined for it, I still was.  I did my best to make it through the year mostly by staying with my boyfriend who lived in the same building or spending as much time in my room as possible (honestly, I don't think I spent more than a few hours in our common areas the entire year outside of preparing meals).  I learned my lesson after that.  I lived with 3 friends the following year and after that never lived with anyone else other than the boyfriend (who became my husband).",
            "That's amazing. I'm curious though, what kind of apartment building management interferes with the property/relationships inside of an apartment? Was this university residence? In Canada the apartment managers would have nothing to do with roommate disagreements and have no clout to levy fines for such issues.",
            "It scares me sometimes how there’s so many crazy people in the world, like what tf happened to them as kids??",
            "It's always the roommates that own none of the communal items in the house that start the most shit",
            "LOL you took the shower curtain, I loved this one.",
            "I had a roommate EXACTLY like this - she even bought a powerline adapter that plugged into the WiFi router and syphoned all the bandwidth directly to her computer so she could sit in her room and happily game while nothing loaded for the rest of us. Naturally, we started just going to the router and turning the adapter off at the plug. \n\nIt caused a lot of passive aggressive door slamming, stomping, and at its peak that damn adapter was being turned on and off about 20 times a day. Eventually, she started a screaming match over it, during which she yelled “IT’S SIMPLE, JUST DON’T TOUCH MY STUFF!”\n\nJackpot. I replied “No problem! You can stop touching my stuff then - that includes every single pot, pan, plate, fork, knife, spoon, tea towel, glass, mug, etc in the kitchen. Doesn’t feel quite as fair when it’s you who can’t use house essentials, right?”\n\nShe was pretty stunned to say the least. Sadly didn’t stop her being a grade A dick for the rest of the year but the moment itself was pretty satisfying...",
            "This is an applause worthy level of petty on your part. GOD I love when people act all snarky and smug just to get bit in the ass, especially by their own damn actions. Karma at its finest.",
            "a very satisfying win haha",
            "I had a falling out with my roommate after about a year of living together, and one of the ways they “retaliated” was by letting the communal dishes pile up in the sink for days so that if I needed to cook or eat I would have to wash stuff they dirtied. \n\nOne day, with the sink piled comically high, I opened the cabinet to find it completely empty and decided I had had enough. I went and bought plates, bowls, glasses, a skillet, a sauce pan, a pot, a glass measuring cup, a full set of silverware and a drawer organizer for the silverware, put them neatly in “my half” of the cabinets and emptied a drawer for my utensils. \n\nAfter that, the sink never seemed to pile so high anymore and they also had trouble getting all their dishes to fit in “their half” of the cabinet. Felt good, man.",
            "I lived in a similar setup my first year at University. One roommate threw out our trashcan that another roommate had purchased because \"it was dirty.\"\n\nI love stories like this. They're the best.",
            "They hired a lawyer to avoid $500...",
            "I had a similar situation. Except it was with a house we rented out. But, the house was right next door.\nWe couldn't tell when we rented to them, but the husband was absolutely toxic. Didn't have a job, so tried to sue everybody. He was actually forbidden to file a lawsuit in California, without a judges approval. \nBesides being a very nice house, with fair rent, the main reason they wanted to live there, is because it was only a few blocks from the private Catholic high school their kids went to.\nI will spare the horrid details of the year of harassment we endured. But, at the end of the year, we refused to renew their lease. They were livid. Fortunately, they had to pay a large damage deposit and they knew we had photo evidence of the house conditions when they moved in. They were still screaming as they moved their stuff out. But, it was music to my ears.\nBut, after that, we sold the house... for a nice profit.",
            "Lmao that is exactly what she gets!!! She should have just dealt with it.",
            "I had same sort of issue, for some reason I thought sharing rent with a ‘never left home before’ friend was a good idea. Wow, was I in for a shock.\n\nShe moved in using garbage bags, had very little in the way of cutlery, or appliances and had zero furniture except her bed from home. Then it got interesting.\n\nI’d do laundry, figure I’d throw hers in on top to show good faith and start sharing chores. Into my washing machine of course.\n\nSo I didn’t want to overstep and hang her washing (read; underwear) out in case her BF or her get upset over it. Boundaries etc. and I’d get home an hour before her so by the time I did the laundry collection and wash cycle she’d be getting home, so she could do it. Saving effort and time and catching last of the summer sun. Sometime if she had just shirts I’d hang them anyway.\n\nWell being an ‘always lived at home’ chick she thought nothing of it and got used to it quickly. So much so that one day she came home, left my 1 dirty bowl and 1 dirty spoon unwashed from breakfast but did her big pile of dishes instead and then proceeded to complain that her laundry (from today) wasn’t hung and yesterdays laundry was left on the line but that I’d brought mine in (she hung her own underwear the day prior).\n\nSo I calmly explained all that I’d been doing extra, for both of us, the whole time and how sharing and chipping in worked better as a two person effort, especially since I’d provided 99% of furniture and appliances and entire home theatre entertainment system.\n\nWell! she hit the roof, went off her nut and walked out after a tantrum screaming I’d better not touch ANY OF HER STUFF. No problem.\n\nSo the next day, I get home an hour earlier than her as usual but immediately started to stack all my furniture, unplug all my home theatre and TV and put all the appliances and white goods in little groups so they were unusable without some effort.\n\nWell, she gets home ready to watch some crappy TV show while I do chores and goes off her nut agin. I calmly explain that if things go both ways and if I’m not to touch her stuff then ditto her, with mine.\n\nIt. Dawns. On. Her.\n\nShe leaves, BF later calls to say she’s moved out the next day. I say sure, but does she understand lease agreements because I do.\n\nShe ended up on the hook for 4 months more rent (agent said to me just pay your half, we will chase her for her share) in the end I agreed to move out and her BF had to take over my lease.\n\nThat’s was a close one.",
            "Well done OP, glad it worked out for you at the end",
            "This may be out of bounds but I hate people that use crying on command to get sympathy and manipulate other  people. No matter how nasty they can get they're always the victims... which is ultimately true cause they usually can't cope with the consequences of their own action. Without a scapegoat there is no excuse for their personal problems which if never addressed can snowball on them so much ... that now you really feel sorry for them.",
            "That’s why I let my stuff be used, because then I had control over my roommates. Don’t wash your dishes, they’ll get taken away. Don’t clean up in the bathroom, soap and curtain gone.\n\nIt was petty, but I lived in a nice, clean, and organized apartment, since no one wanted to buy anything.",
            "“My father will hear about this!!”",
            "Flawless victory!",
            "I would have recorded the father and reported her for being the actual bully with proof of harassment from her father.",
            "My bro lived with a few guys while at uni. Few were stoners...came home late 1 night from work to 1 of them making a wheat-bix (Aust cereal) omelette\n\nThey also kept taking his food (esp the expensive/special stuff) so he got a fridge with a lock on it.",
            "Oh goodness! She brought in her father for... intimidation purposes of some kind! How vile!",
            "Good for you. Funny stuff.",
            "get fucked entitled bitch. way to go.",
            "Her dad be like \"we can't afford the 500 bucks moving fee, BUt wE wiLL dEfiniTeLy SuE YOu\"",
            "This is pettiness to its finest and I absolutely love it!!",
            "Knowing that girl she is likely to end up working at some fast food joint because no one wants to hire her when she threatens employees and all.",
            "My friend was in a similar situation, but instead the passive aggression just continued to build over the course of the entire year, ending with him creating an effigy of his roommate out of sticky tack, and hanging it with a string of paperclips with a sign that said \"NO MORE USING MY SHIT\"  \n\n\nHe was in a very dark place freshman year lol",
            "To notch malicious compliance. Great story, well told. Thanks for sharing.",
            "[deleted]",
            "Play stupid games, win stupid prizes!",
            "Oooo the wet laundry stuff used to make me mad when I caught some one do that to me I would take theirs out of the dryer soak it then throw it out the window.",
            "^The  ^art  ^of ^war",
            "Geesh. And I thought it was bad that one of my dorm mates selected a non-smoking room and then started smoking. What a delightful person you ran into.",
            "reading these horror stories makes me feel so lucky that 2 of my college roomates are still my best friends 10 years later. especially since we had to share a room between 2-5 people, depending on the dorm, so no private room or bathroom luxury. truly hating a roommate you had to sleep next to would've been disastrous",
            "Dang!  what country was this in that an apartment manager can get involved in a civil dispute and fine someone?",
            "Slow clap OP !!!",
            "I hope she moved to CUNTVILLE, because it sounds like that is where she belongs.",
            "Beautiful.",
            "This is poetry",
            "This is one of the best things I've read today.",
            "Good shes sounded like an entitled loser",
            "Holy fuck, what a freak! She sounds like a fucken nightmare to live with.",
            "What is it with folks like her who scream like that? Good grief. Should be the universal sign it’s time for a trip to the soylent factory",
            "Physically intimidated by you...? That’s a whole other level of weird in and of itself 😂",
            "“I’m gonna sue you cause I can’t use your things!”",
            "If she has $500 to move or the money for a lawyer, why was it so hard for her to buy her own toilet paper?",
            "WTF are the accommodation practices in the US?\n\nThose are some bullshit rules.",
            "You had me at “magnetic whiteboard”",
            "There are times when the Zennest thing you can do is respond to pettiness with pettiness. I bow to your Zen level, teacher.",
            "It takes 2 people to have this much dysfunction",
            "Putting post-it stickers won't get you respect (they'll see it as you hiding behind a post-it and not having the courage to speak up). They'll respect you if you personally inform them of the situation in a amicable manner.",
            "mcfadden?",
            "You evil genius...",
            "Awesome",
            "Damn kids shooting up drugs in MY school!",
            "From how you put it they had no proof that you hadn’t actually been bullying her so the thing that worries me the most is that if some other student came to the office because they were really being bullied they would have done nothing at all...",
            "I love these sorts of stories. She thought she could play victim to screw you over, but ended up biting off more than she could chew haha",
            "Blood curdling scream....muahahhahaha ahahhahaha (deep breath ) ahahhahahaha",
            "\"too much for her to handle\" what the fuck lmao",
            "You both sound like nightmare roomates.",
            "My first year I had a roommate who was Hispanic and hated white people. I'm a go along to get along person but she wasn't having any of it. After about 4 months she got meningitis B and had to drop out. Couldn't have happened to a nicer person.",
            "yes",
            "Don't forget Slippi. You can send that shit?",
            "Y-You can’t touch franchise and does this instead",
            "Q",
            "I would have left *your* items alone and waited for her to touch/use your shower curtain, to send the $250 bill and another $500 for your towel..",
            "Amazed if she could hold down a job for more than 90 days.",
            "You both sound totally nuts",
            "[deleted]",
            "[removed]",
            "[deleted]",
            "You are petty and immature. Their reaction was stupid but you started it. Childish. Just live your life and don’t do stupid shit. When your older, hopefully, you’ll understand how completely unnecessary it was to antagonize her. Useless\n\nSeriously, drew eyes?  Grow up and move on",
            "No offense, you are a bully. But I don't know the whole situation\n\nThis fits the sub so I'mma give it a pass"
        ]
    },
    {
        "post_id": "phh6vi",
        "author": "wbjohn",
        "title": "Can't take vacation time, ok.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/phh6vi/cant_take_vacation_time_ok/",
        "score": 19877,
        "num_comments": 669,
        "created_utc": 1630714926.0,
        "selftext": "My mother passed away several years ago and this is one of her best stories. She worked as the head of the transcription department of a government agency. Whenever she would ask for time off, her boss would refuse. This went on for years and her leave just accrued. \n\nOne day when she was about to turn 63 years old she walks into her boss's office and tells him she is giving him two years notice that she will be retiring. He is very confused as to why she is giving so much notice. Then she informed him she will be on vacation for the rest of her employment as she has two years of leave accrued and walks out the door.",
        "permalink": "/r/MaliciousCompliance/comments/phh6vi/cant_take_vacation_time_ok/",
        "comments": [
            "My father worked in local government for thirty odd years, before he was basically chased out of there by the ex mayor and his cronies for testifying against them in a courtroom. He eventually found a new career in piano tuning, which required a twelve month intensive course. He had enough long service leave accrued that the council literally paid him full wages to train for a year for a new job.",
            "This is similar to what happened to my mom. She had worked for a hospital for decades and at least 9 months of PTO. \nShe requested a raise and her boss told her he couldn’t afford one to his budget that year. So she found a better job and put in her notice. \nThen her boss found out he was going to have to pay her all of her PTO plus hire someone to replace her. THEN he wanted to negotiate a raise. She told him too bad and too late.",
            "Remember we are talking about a government agency here.\n\nI had an Aunt that accrued about 18 months of unused leave and retired early just like this lady.\n\nThey may not be able to do this anymore.",
            "When I was injured (accident that caused the disability that led to my leaving my job) I had 3800 hours of PTO banked.  My employer treated it like I was on vacation for almost two full years and paid me out normally, kept contributing to my retirement and insurance for all that time - and then when I ran out of PTO, they put me on paid FMLA for 6 months and unpaid FMLA for another 6 months and kept paying my retirement and insurance  just to be 100% sure I would bridge into SSDI and Medicare without any loss of coverage. \n\nI know exactly how lucky I am.  (Extremely, outrageously lucky.  Everyone should have employers like I did)",
            "When I did minimum wage security one of my first duties was as a guard for a hydroelectric dam, the facility had \"old timers\" who were basically people hired before 2003 (ish) who couldn't be fired unless they did something insane (one lady was bat shit consistently breaking company property and still wasnt fired).\n\nWell these old timer guards were all making over 100k a year, and their vacation time would roll over. I know one of the staff stated to me that they had over 400 days, part of me gets it, but the other part of me just wonders why she didn't take off a full month here or there when she still would have been around 30-40 years old, she was at least 60ish when we spoke. Like what is the point of getting 400 days of paid time off if you cant enjoy it well.",
            "Had the same with a co-worker years ago at a major city hospital, so government and this was in the 70s. \nHe had never taken any time off in 38 years and then went on terminal leave for just under 3 years. And since technically he was still an employee on leave, they couldn't fill his position. Lots of extra work for the rest of us.",
            "That’s awesome. My dad retired from the US federal govt in 1980 after 30 years. He was 55, he had accumulated the 240 hours of vacation time and about 13 months of sick leave. He went on “sick leave” for the next year, adding another year of service to his pension. They paid his vacation as a lump sum. My dad is still alive at 96 years old. He’s been retired for 11 years longer than he worked. Since federal pensions were adjusted for cost of living, he makes way more now as a retiree than he ever did working.",
            "My dad did this. While he was on “vacation”, he got a raise which increased his pension, too. And then they couldn’t fill his position, so they hired him back to do the same job again, but hourly.",
            "When I started my current job I was trained by a nice older lady who was around for about a month then told me she’d be going on vacation.  I was well trained by then and thought nothing of it so I said I’d see her when she gets back.\n\n10.5 months later I show up for the work day and see her standing at her old desk.  I asked where she’s been all this time and she told me she had a bunch of PTO time saved up and that while we are on PTO we actually still earn PTO so she kept using it until she had none left (she had maybe 2 hours left over at the end IIRC).  \n\nShe said today was her 1st day back but she had a meeting with HR in an hour.  Turns out she was quitting her job with her last day being the next day (which was the end of the pay period).  Only reason she came back was to screw with our manager (who was decidedly not a nice lady) and because the company was really stingy with that last check if they thought you had anything of theirs still (computer, access badge, etc).  \n\nShe was my hero.",
            "We had a manager do this.  Now if we can prove our manager denied our request and we go over a certain amount by years served, they have to cut us a check for the amount of excess vacation time. \n\nOf course they come up with a plan for us to the time in timely manner, but inevitable an emergency happens at least according to the manager.  That it is until the first time his budget took the hit for salary and vacation in a single month.  That cured him of most emergencies.",
            "My mother did a similar thing, working as a counsellor for a school. She had a long term illness, but was managing ok. \n\nWell, the union decided to eliminate her position and she was forced back into the classroom after many years. She figured out that in 2 more weeks, her accrued sick leave would take her through the end of the year. So she got a note from her doctor and retired.",
            "This is why companies are offering unlimited PTO with no accrual.  Employees tend to take their normal 3 weeks give or take a week.",
            "My state you can't do that any longer. 6 months is about it. But you can trade in the leave AND sick time to add on to your years of service. Essentially making it so you can do 23 years and get paid retirement at the 25 year rate. Or whatever.",
            "I worked part time at a Blockbuster but at some point I was mistakenly listed in the system as full time, so I was accruing vacation and didn’t even know it. Got a nice surprise bonus check for $600 when I quit.",
            "My agency had “Use or Lose” when you hit a certain number of hours of Annual leave so you had to use some before the end of the year. Sick leave had no maximum however so you could use it for retirement.",
            "Similar with a colleague of mine who left recently. She handed in her four week notice to our boss, who then asked HR to calculate when her last working day would be. Their was response was basically “she has to leave the office right now as she’s on annual leave for the entire four weeks, and we’ll include the five months of leave she’s not able to take in her final pay packet”.",
            "How do americans work year after year without taking any leave? I get 25 days of leave every year and 11 statutory holidays and still use all my leave every year.",
            "Someone in my high school administration must have pissed off my old phys ed teacher because he pulled a similar thing.  Teachers were allowed to carry over their sick/vacation days from year to year and I think could even trade them among one another so at the start of the year he tells everyone he's retiring and then just started using all the days he had saved up and stopped coming in.\n\nThe school wasn't even able to get an official \"full time\" replacement because he technically still worked for the school and there was a minimum on how long a teacher had  to be out before they could hire a full time sub and he'd show up for one day every other week on pay day to pick up his check and reset the clock.  They ended up having to just repeatedly hire a regular substitute to do his job for all but the two days a month he'd actually show up.\n\nAfter that they changed it so sick/vacation days expired every year.",
            "yeah almost all companies made damn sure that cant happen anymore. good on her though.",
            "The company I work for makes the covid tests and sense I am as they say am an expert at repairing the equipment I couldn't take time off to get married.",
            "not quite the same length of time as my dad, but the same idea.  he injured his leg (non work related) and was out for like 3 months on medical.  then he burned his 5 weeks of vacation.  went back to work for a week until his new batch of vacation time renewed.  then he burned that 5 weeks of vacation and retired.",
            "EPIC",
            "Our company gave us 21 days every year. I eventually had 96 days to take off. They chose to pay me out rather than me leave for more than 1 week at a time.",
            "Prior employer was a small company that had been around for 30 odd years before a larger company bought them. For those 30 years, you could roll over time off with no cap. The dude who ran the mail room apparently never took off work and you were given more time off each year the longer you were there. \n\nWhen the new company came in, they changed the time off carry over and said people had to use it over the next 2 years or take a payout. Mailroom guy apparently had almost 800 days saved and chose to take off the next two years, then take the payout and retire. It was fucking bonkers.\n\nI don’t know his exact amount of time he had, but he was gone for 2 years and appeared on the company directory that whole time.",
            "Nice. Supposedly my grandfather just didnt like using pto and accrued 2 years or so and retired similarly, on his ass 2 years and then a pension.",
            "Good for her, have an up vote. 👍",
            "cue **Boss**: oh fukk\n\nNicely done, mother, rest in peace!",
            "I accrued over 6 months of vacation before being fired without any warning.  I got nothing from it.",
            "Mum works for the ministry of health, because of recent events that are effecting the global healthcare system she hasn't had more than a few days off since end of 2019 and she's been doing stuff like managing quarantine facilities even though she's a contracts manager. Anyway HR has been on her back to take time off because she has 6 months saved up but neither she or her boss want her to use that time up so it keeps acruing and HR is freaking out because of the huge liability.",
            "This is why unions are needed. That shit would never fly where I'm from.\n\nEdit: to clarify, refusing vacation for years is majorly illegal.",
            "OP if this is only \"one of her best\" stories, I am most interested in hearing other top stories from this badass mother of yours.",
            "So many stories of people doing this - and I believe it.  My dad ended up retiring 2 years early from a Federal government job, but they just paid out his time off.  I understand that they had to do that to make the position vacant, otherwise he would have stayed on the head count.\n\nHe got lucky that he gets the military pension (20 years) plus the federal government pension (20+ years after military).  I think the rules have now changed and you can't \"double dip\" any more.\n\nMeanwhile, I'm wondering if Social Security will still be funded by the time I retire.",
            "In the uk you have to take your leave each years.",
            "You americans have weird systems.\nHere in belgium, you get 20 days of leave per year. If you don't take 'em that year, the company has to pay you for them that year. They can't accrue.\n \nAnd if you have a contract for let's say 40 hours, but it says in the contract that you should do 38, then you get 2 hours every week as 'ADV'. For example, i get 18 days of those every year. But only 3 can be transfered to next year. And have to be used by april next year.\n\nThe ofcourse there is overtime, depending on the company, there might be a cap, there might not.\nBut it should stay forever. Unless you go over the cap that is... We have a cap of 9 hours.",
            "This is The exact reason why every job I've ever had has a maximum number of hours you can accrue. After a certain point, you start to lose the time.\n\nAt some companies, if you're really lucky, they'll pay you out.",
            "This is why businesses these days may let sick type time roll over but usually not vacation time. \n\nGood on your mom though - never understood why places would deny vacation time.\n\nPopular days like the day before or after a holiday when many people may be off - sure that’s understandable. \n\nThese days it’s usually just manpower issues in general with no coverage. \n\nBut you know what? The people that have been coming in and working 12-14 hour days need time off bossman. \n\nBrother always says his boss gives him a hard time because they’re always so short staffed for people to cover routes. \n\nHe always gives the smile and I can either give well advance notice with this request form or I can use one of my dozens of accrued sick days. The time off requests are more of a notice and not asking for permission lol.",
            "A similar situation happened with my father when he retired back in '07.  He had enough medical leave built up that he couldn't use and they didn't have a policy for paying it out; they transferred it over as credit towards my parents health insurance.  Dad passed away 3 years after he retired and mom just passed away this year.  Insurance ended with mom, of course, but the \"we're done\" notification said something along the lines of it would've been paid for another 15 years.",
            "I just retired last week. Several years earlier than I had planned but that's a different story.\nMy employer has put themselves in a position to have to effectively pay me 4 months salary in a lump sum because they ignored our pleas for help for years, making it extremely difficult to use your leave properly and not paying out any sick time until you retire.\nAny leave on the books beyond my cap for payout goes to my retirement as service credit.\nIt's a silly system but it is how they choose to do it.",
            "I knew of an executive assistant who worked for someone fairly senior at one of the big financial banks (so she was paid fairly well). She had been there for something like 30+ years.\n\nIn 2008 financial crisis they offered voluntary layoffs and something like 4 weeks paid out for every year with the firm. Needless to say, whilst she loved her job she still took that offer!\n\nBelieve she also landed another job 4-6months later (she had a great reputation) around the corner earning similar wages etc.",
            "Uncle was Detroit PD. Had 3 yeas+ of Vacation and sick time and used it all to recover from two different cancer scares.\n\nI have several Indian employees (illegal to let their PTO \"evaporate\") who are just stockpiling it they can get huge checks when they move on to their new job. \n\nMe? I have \"Unlimited\" PTO that must be approved by the client and 3 internal Managers and it seems arbitrary reasoning is applied whenever we all put in PTO that is inconvenient. Before we switched to this system, we all work all year and took most of December off. \n\nThey thought it would stop us, but we're all about to put in our \"We're out for the month of December\" emails and we ARE OUT. We've decided there is no more saying 'No'. The company needs us more than we need them, so there will be no reprisals.\n\nWe actually have power now. It is really, really weird...\n\nEdit: spellingz",
            "reading some of the comments as well, i think some people will put up with anything",
            "My father was a civil servant, and over 35 years of working never took a sick day. He retired a year early because of that.",
            "Queen move.",
            "Boss move.  Very well done.",
            "I don't understand this leave adding up thing, it must be an American detail or something. My country (South Africa) and all companies ice heard of or worked at have a leave system where leave expires one year after the period it was added. This means that you essentially have year 1's leave in year 2, but year 1's leave expires when year 3 starts. This prevents the questionable stuff listed here",
            "My last job, someone retired with like 6 months vacation time that was used to before he was officially gone.",
            "I'm convinced that only Americans have this problem with taking time off for their vacation days, we get reminded in the UK that we need to take time off to use  up the days we are owed, before the next years come into play.",
            "According to law here you can only store the vacations you got in the last 3 years aka 42 days max. But usually 21. You don't use them and they expire",
            "I am grateful I live in a first world country. There is no way you could ever refuse vaccation like that around here.",
            "In the UK, employees are entitled to 5.6 weeks of paid holiday per year, so a full time worker working five days a week gets 28 days off, although this can include public holidays of which we have 8 per year.\n\nA lot of employers will give more than this though.  All the jobs I've had (in the IT sector) have given 24-26 days plus the 8 public holidays, and some have let me buy up to another 10 days, totalling up to 44 days off.\n\nAn employer can refuse a holiday request for business reasons, but if you get to the end of the year and haven't had at least 28 days off due to repeated refusals, you'd probably be able to take the company to an employment tribunal.",
            "This is why there is limits to how much vacation time you are allowed to have on the books. Then it gets wiped away if you don't take it. Oh you have 90 days of vacation saved well if you don't take it by 30 September you will get knocked down to 60 days and there is no repercussions for them taking your vacation days.",
            "Meanwhile my job has a PTO cap and if you don’t use it, you lose it.",
            "That's a thing? The accumulated vacation thing...",
            "My buddy’s dad starting working for GM when he was 18, straight out of high school. He never used a sick or vacation day and when he was 35, did the same exact thing, used up all of his accrued PTO and retired. I’m so fucking jealous of that man.",
            "Did she actually get her vacation time?  That would be badass if she did",
            "Max for federal leave is 240 hours.  State leave in my area is 480 hrs max.  Now there’s no cap for sick leave but you need to have a damn good reason and not me to get approval for taking 2 years off.",
            "In the US, we can't open that position until the person has completely retired.  As in the very last day of that leave.",
            "Your mom is my new hero!",
            "love it",
            "Called use or lose\nIe lose is payout",
            "Oh there has to ba more, more, more from this wonderful woman.",
            "Cool! This must be why almost all employers now cap how much leave you can accrue.",
            "My grandma did this too!",
            "At our workplace, which is an American company, if we don’t use holiday, we lose it, renewed every year",
            "This is probably why companies now limit the amount of PTO you can accrue.",
            "This is why the government has passed a law that you can only take a minimum of days to the next year and the rest is lost.\n\nThey sell it as an incentive to have you take you PTO, but in reality it is just a way to please employers",
            "This is shit. She gave up vacation when she was young until 63??",
            "My mum did this as a teacher. She had accrued long service leave & so took that for the last 9 months of her teaching career before she retired. The day after she finished up (her first day of leave), a kid died in a freak accident* in the playground. If she had been still working, she would’ve been the person on duty for that incident & permanently traumatised!! \n\n*one kid was pushed by another in a kind of play fight & he tripped backwards over a bench seat & cracked his head on a brick wall. Instantly gone. Insanely devastating for his friends & family!",
            "I did this in the army I didn’t take leave for the last 2 years (they often wouldnt “let you”anyway) so I was able to peace out like 2 months early haha!",
            "Can someone roll over so much PTO over the years? My company only allows 10 days of PTO roll over. The rest of it is use it or loose it.",
            "The problem isn’t ok though",
            "I work for local Govt in the UK and we have a \"carry over 5 days and use in the first couple of months\" policy.  It is stated in the contract you sign at the start of your employment that any over that are lost.\n\nWe have been told to take time off when we were too far through the year and had not taken enough time off.\n\nWe also have a cap on flexi (37.5 hours) and lieu time you can accrue, when some of the field workers were found to have more than 400 hours of lieu time.  It was only \"discovered\" when we went to a cloud based clocking system, away from the physical card records we had before.\n\nMy annual leave allotment is 29 days leave and 12 days flexi (if the hours are built up), so 41 days.  This is not including lieu time off or (relatively) unlimited sick days, so none of this \"5 sick days per year\", if we are sick, we can take time off.  The first 6 MONTHS sick on FULL pay!",
            "This is why any company that can will cap your leave that carries over.  I worked for video game company and they launch titles frequently to the point that people on my team were constantly denied  leave.  Max PTO (vacation AND sick leave pool) was 200 hours at any given time.  Once I was near that I started taking Fridays off to prevent going over and losing time I had earned off.  There was nothing my manager could do about it because he couldn't force me to throw away something earned.",
            "If a company offers you benefits and provides no way for you to use them, you are being manipulated",
            "It doesn't sound as satisfying of a story realizing she's probably got at least ONE health issue at 63, bum knee, etc. Maybe she was just looking forward to relaxing and putting her feet up, idk, but travel when you're young is my motto.",
            "Now the federal government has rules about paying out that much leave, you have to use it at a certain amount or you lose it. Its been a while since I've worked there and I suck at remembering some numbers, but I do remember that they limit it now.\n\nMy partner also worked for the federal government for a while and had a coworker take a month off because their boss argued with them over trying to ensure clients were taken care of properly. The boss was so bad with people their superior hired in another person at the same level of power as the boss who was just there to cover up the boss's messes, either screwing over the clients or her underlings.  \nThe boss was so bad they would endanger their underlings by sic'ing the clients on them, these clients would bring in guns on campus and knew where the office was located, the clients were a lot of the time mentally unfit while armed so her actions were life endangering to her underlings especially those underlings who were temporary/contract employees. And the federal government cannot do anything about it because her actions are hard to prove, she's a permanent employee, and she does the minimum of her job requirements and cannot be fired for her actions.",
            "💚💙💙♥️💜 this!😍",
            "My job (local government) allowed the same. All of your sick time and vacation time rolls into a bank. I can retire at 55, or i can retire at 55 minus your much time is in the bank. So i can retire at \"55\" when I'm 52 if i don't use any time from the bank",
            "Wow, thanks for all the awards and upvotes. My mom is  smiling in heaven. She loved telling this story.",
            "I work for the goverment in a country with strong unions. I am forced to take 3 continius weeks of payied vacation between may and september. The remaining 3 weeks of payied vacation I can distribute over the rest of the year (1 week can be transfered to the next year). If I don't follow the rules my place of work has to schedule my vacation time for me. (People working in companies only have 5 weeks guarantied, but most also get 6 weeks).\n\nDamn unions taking away my freedom.",
            "[removed]",
            "As much as people love to rag on big corporations, most tend to treat their workers pretty fairly in terms of time off and medical leave altho there are some exceptions.\n\nI work for a large engineering company and one of my coworkers got cancer and was on medical leave for 2 years before finally recovering and returning back to work. \n\nHer cubicle remained empty and unused for that entire time with her name still there, even as we were hiring more people and running out of space and shoving interns into the server room because we had no other places to set up a desk.\n\nI was pretty amazed considering I had worked for a startup before and know that budget issues would have forced them to sack that employee and leave her on her own to manage the medical bills.\n\nOn one hand, I think it's great for a company to do this type of stuff and on the other I think it's unfair to the people who are still working and the company because they need to manage more work with less resources for a long period of time. It's a really complicated issue, and I think it is a good argument for why Healthcare should not be tied to your employer.",
            "A lesson in toxic leadership and the most passive aggressive way to deal with it.",
            "How is this not illegal",
            "Don’t buy it one bit.  Most government workers at a certain time in their career get forced to use their vacation or lose it to prevent situations like the above.",
            "That is hands down the best story I have ever read on this sub.",
            "In Switzerland you get at least 4 weeks of vacation (two of which are to be taken at once). You can take the remaining ones as separate days off but the two weeks are sacred.  \nIf you don't finish the vacation days by end of year you'll need to take them before April 1st. And don't even think about getting them paid out (except if you quit and can't take the vacation).\n\nMany places give 5 or 6 weeks of vacations...and sick days as well as personal days off (your wedding, moving, deaths in the family) are separate from vacation days.",
            "If this was MC, she wouldn't have used it....\n\nETA: If this actually is MC somehow, I'd be open to hearing it.",
            "Yeah that didn't happen. She just quit her job and retired early.",
            "In Australia you just leave and they pay out your remaining leave. It's pretty sweet.",
            "Damn they didn’t just pay her out at the end of the years?",
            "the cap that now.  \n\nin some cases you can get paid hours (at the final rate) in lieu of time off",
            "At my work you're unfortunately only allowed to accrue so much time before you have to use it or lose it. Fortunately we don't even have to request leave, if you have the hours and give two weeks notice you can take time off anytime you want so I guess it's not much of an issue. I'd be pissed if they denied leave time and then we ended up losing our leave time because we couldn't even take it",
            "*seethes in Ontario teacher*",
            "My dad did the same thing, he's on paid vacation til the middle of 2023",
            "My last job would only let you carry 40 hours over, anything past that was lost.  And that 40 was only good until March 31st, then it expired also.\n\nThe supervisors were really good about making sure nobody ever lost vacation time.  Somewhere around September they'd start running reports, and asking employees when they wanted their vacations.  That gave them enough time to make sure everyone was able to take the vacation time they wanted, while still having enough staff.",
            "What kind of country has employment laws like this that it's even possible? How disgusting.",
            "My month literally got a out a month or so per year of leave, but it didn't accrue into the new year. She, and most of her department, just took the first and last couple weeks of the year off. Literally about a month straight of time off and still had plenty of time through the rest of the year.",
            "The things old people put up with from their employer back in the day astounds me. Deny me two years worth of leave ? I don’t think so",
            "That's why there's caps on eto lol",
            "Probably why they don’t allow accruing too much PTO these days. The company I work for either makes you use or cash it in before the end of the year. I definitely use all of mine.",
            "Things like this is strange for me.\n\nIt's mandated by law that you get 4 weeks vacation in the summer (jun-aug), if you want it they have to give it, but you can of-course opt to not take your leave then.\n\nBut you can also not save up too much vacation either, only like 5 weeks or so, don't remember exactly, before you have to take them or loose them.\n\nEdit: This in Sweden btw.",
            "In my home country, Spain, workers have one month of paid vacations every year if they are full time. You can't decide to get the money and keep working unless they're laying you off or your contract ends. If you don't negotiate your vacation dates with HR they will literally pick dates for you and kick you out of the door that day.\n\nTherefore, this scenario is not possible in many countries.",
            "This is the reason why PTO caps nowadays. I can only hold like a month of vacation then its use it or lose it. I'd love to hold a solid fat half year",
            "I had a co-worker burn about a year of terminal sick leave (can't just cash that one out) before his retirement.",
            "My last vacation day was back in 2003.\n\nI feel you.",
            "Ha wrecked",
            "You mom sounds like a legend. RIP",
            "With public holidays I get 40 days’ leave a year. I have to take them by the end of each leave year - apparently accruing leave is a red flag for fraud so we’re no longer allowed to carry leave forward. Frankly, I’d rather swap some days for money but no can do.",
            "Wouldn’t it have been better to give two weeks notice and take the holiday pay?",
            "Yes Momma! 🙌🏽 Never let anyone fuck with your vacation!",
            "Bravo! I would have loved to be a fly on the wall just to see the look on his face!",
            "Ah, ok I figured it out",
            "In South Africa, we are allowed to accrue upto 40 days, I think",
            "Wow, this is hugely illegal where I live, and a government agency would mean it is actually controlled somewhat. Every worker should get a vacation every year, and use all the days that they have, or else there might be consequences for the workplace.",
            "The accrual rates are also way better than most private companies from what I have seen. I know many Gov employees who took the entirety of December off every year.  between regular leave, comp time, and holidays, it's really easy to make it to the magical yearly leave cap.",
            "AWESOME!!!!!",
            "Boss energy 🔥",
            "Clothing boutique willing to take a piss anyway....”",
            "Good for her. That’s awesome.",
            "My 7th grade social studies teacher did this. We saw her the first two weeks of school then had a sub the rest of the year and learned fuck all. LOL",
            "This is why my company has a 25 day maximum that you can roll over.  You don’t use it, you lose it.",
            "I took a government position after this guy retired. He was a frugal, single man who never really did much outside of work. He'd use his vacation time, but only just enough to keep from losing his fair share. Basically though, would just keep racking up and definitely due to the way it's structured. About 10-11 months before he was due to retire, he would come into work, sit down and read a book. He would always leave at lunch time and just use his sick time for the rest. If anybody bothered him or asked him to do something he would leave then and there, and just burn that little bit more sick leave. Nobody could do anything, and everybody was secretly rooting for him. I'm learning from what he did, and have several hundred hours saved up for myself. It'll be glorious when it's time to use all that time.",
            "I worked with a guy that had 147 days accrued. They were changing the policy so that you could only roll over 5 days. Instead of taking those days this weirdo just let it all expire.",
            "How many years did your mum not take a leave that she had 2 years worth of leaves with her?",
            "I feel fortunate to have worked jobs where requesting time off has always been approved. The idea of denying that is so foreign, that I'm not sure how I'd respond if my manager said no.",
            "Terminal leave",
            "Thats beautiful! 🥲 i hope she got to enjoy those two years!!",
            "Not as malicious, but I put in my two week notice earlier this year, making May 1 my official last day of work. Toxic management refused to speak to me at all, until I got on the radio on April 24 and told all of my coworkers goodbye. HR screeched, “Your paperwork states your last day is May 1!” *big smile as I answered, “Yes, but you already approved one week of vacation, effective tomorrow.” \n\nGot a nice little break before I started my new job, and had even more vacation pay owed to tide me over until my first payday.",
            "My dad had five months of various types of leave when he retired, but two years is insane!",
            "My office is okay about taking time, but I just find that between time in lieu for OT and the like, I accrue more than I take a year. I've been around for close to a decade and have about 36 weeks allocated. I also have been around long enough that I've earned quite a few wage bumps, so that just gets way more expensive than it was. Teach them to avoid right staffing my department!",
            "Parents did the same thing with teaching.  They both retired a year early due to accumulated personal days over 30 years.",
            "Couldn't he just refuse her leave, as usual?  Or was he just too stunned by her masterful MC?",
            "It's absolutely insane that they would let leave stack up like that! My company doesn't give many days off, but even still you have to cash out unused PTO at the end of the year."
        ]
    },
    {
        "post_id": "wtjoq4",
        "author": "clevercubed",
        "title": "Not allowed at the company party? Throw a bigger one and expense it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wtjoq4/not_allowed_at_the_company_party_throw_a_bigger/",
        "score": 19839,
        "num_comments": 636,
        "created_utc": 1661035565.0,
        "selftext": "A few years ago I went to a very large week-long conference in Las Vegas. One of the evenings our company was throwing a massive party for our customers. These parties were known to be epic, and everyone there to work the booth looked forward to it every year.\n\nBut, at the last minute, the CEO, wanting to keep costs down, decided that engineers weren’t allowed at the party because of the cost, despite the fact that we had been busting our butts for weeks for the show. Our VP protested, and was told just to take us all out for dinner, on the company’s dime. So our VP took us all to a VERY expensive restaurant on The Strip and said, “Get anything you want. Let’s max out my company card!” Everyone got Wagyu steaks, expensive wine, OLD ~~bourbon~~ Scotch, and all of the desserts. The bill came out to around $15,000. At least 10x what allowing us in the party would have cost.\n\nUPDATE: To answer many ?’s…\n\n- It wasn’t just about cost. It was well known that the CEO (who came from sales) only thought sales people mattered at all. He just didn’t like us “smelly” engineers. \n- VP kept his job but left (on his own) soon after, taking many engineers with him. \n- Wagyu + 21 yr-old Lagavulin = a spiritual experience.",
        "permalink": "/r/MaliciousCompliance/comments/wtjoq4/not_allowed_at_the_company_party_throw_a_bigger/",
        "comments": [
            "Had a boss that took us out to lunch quite often. \n\nWe’d stir down, he’d ask “How’s things.”\n\nWe’d reply “Just fine”.\n\nThat made it a lunch meeting and he could expense it. \n\nRest of lunch was just chatting about anything but work.",
            "Why the fuck would you selectively exclude one part of your company? Especially the engineers‽ Way to destroy any loyalty you've garnered over the years.",
            "Good VP.",
            "And that is the only leadership that those engineers are going to remain loyal too. When they leave, everyone else will either follow them or just leave as well.",
            "My best friend used to be low level IT for a BIG company (think Time Square office big). When they would have company shindigs, he would bring me along and expense my meal and drinks on the company card. I never worked there. Even the boss was like \"... who's that guy?\" but then immediately stopped caring. \n\nIt was pretty amusing.",
            ">OLD bourbon\n\nI only drink bourbon old enough to legally drink its own bourbon.",
            "In my experience clients usually love having the teams that do the hard work at the celebration.  They see the cc line in emails and know that all of these in the cc line were critical.\n\nIn the case of this story, I don’t think the CEO will make this mistake again.",
            "This is the exact thing which happened to me at a big vidya game show by the Marketing Team. \n\nThe VP wondered where I was and I told him they told me I wasnt invited. He immediately invited me to their swank restaurant and he and I talked about nerd shit over good bourbon, amazing red wine, and amazing steak. \n\nThey *hated* that he included me, an inferior non-marketing person.",
            "I plan these kinds of meetings and this is what happens when they cut budgets at the last minute. Good way to make groups in your organization hate each other...",
            "Engineers solve problems. If you like problems, sure, fire the engineers.",
            "Now THAT's a VP I would put in OT for...",
            "Oh this is exactly the kind of malicious compliance I love to see. Pure punching up.",
            "From now on, if the CEO tells the engineers to face left and the SVP tells them to face right, they will face right.",
            "A company I used to work for threw a huge party announcing the new company name. Everyone was invited, except the people actually putting in the work on transitioning everything over. I hounded the project manager until they got approval to take us out for a nice steak dinner.",
            "I had a similar story when we put this huge party together for the company owner, including weeks on end of planning and getting his approvals for the decoration, food and etc but at last minute the whole team couldn't even have lunch in the event and had to go to the regular canteen that day (dressed formally among operation workers drawing huge attention). It sucked, everyone felt like crap. \n\nWeeks later the director threw this huge party for everyone involved and paid it with the company card. It felt like a nice revenge after that horrible day.",
            "Your VP probably saved the company a million bucks in turnover.",
            "VP did a big FU to the CEO, but more importantly earned respect and loyalty from staff knowing he had their backs.  That's a good leader.",
            "So thaaaaat's who eats Wagyu",
            "I was part of almost identical story, though the executive wasn't quite as free with the card, but then again, we were in Baltimore, not Vegas.  We were at a sales conference, and  number of technical folks working in one particular product area were asked to come, as there was to be a big push, and it was new.  They wanted us to mix with the sales teams and make relationships, answer questions, etc. to support them, which was a great idea.  They gave Blackberrys to all the sales folks (Wireless data was the push) and not to any of the tech folks.  Our leading executive said fine, we bailed on their event, and went and ate a little sushi place into profitability on a Tues. night.  He apparently made it very public that he was doing it, and we all had our devices in the morning, with an apology.",
            "r/deliciouscompliance",
            "CEO said take the engineers to dinner.\n\n\\*chef's kiss",
            "Engineers tend to tell the truth to clients. Better to keep them apart, especially when booze is involved.",
            "That's a good VP, hope he becomes CEO one day.",
            "Your deal sounds so much better and well done 🙌🏼",
            "The CEO was trying to save $1500?\n\nTBH, sales dinners go like $20k regularly. My company has like 6 magicians ready in our major cities.",
            "Sounds like some companies I’ve worked with in broadcasting.  Leave the engineers out of the party so the sales drones can wine and dine the customers, when we all know it’s the engineers that know their shit and the salesies are usually several rings below.  \n\nTBF, I’ve been to some pretty epic vendor dinners in Vegas …",
            "When I was made redundant many years ago from an office job, our area director told us all to meet up at the office at 6am one morning.\n\nCue coach trip to France, free booze on board the ferry there and back. Visit to a hypermarket, trip to the beach and then a very expensive restaurant, (think silver domes and reveals etc).\n\nAll the food and drink went on his corporate credit card, must have cost a bloody bomb.",
            "I worked for a company that burdened employees with miserly expense limits. Going out-of-pocket above the limits was worth it to me, as that made my travels more enjoyable. With my expense reports I included receipts for meals and other expenses that were above the allowed limit, but only claimed the limit. This annoyed the bean-counters but there was nothing they could do about it.",
            "I could totally believe that if the CEO came from sales. I got let go from a job because I told the head of sales she didn’t know how to sell shit after we had poor numbers several months in a row. She tried to blame me saying I wasn’t servicing tickets well enough to retain customers. I told her she was selling to the wrong clients. Our service was better suited for smaller businesses that couldn’t normally afford what we offered. She insisted going after the large expensive customers (she had a thing for large law firms). I explained that those customers could afford the better services. And even if they were more expensive, they had a better product. They weren’t going to stick with us after they had been ‘driving a Mercedes and we offered them a Ford Eacort. We need to go after the people who were riding bikes’ (that’s actually a quote from my argument with her our product had nothing to do with transportation) \n\nA month after that incident, they let me go. They said since our region was under-performing they needed to cut expenses. So now they were going to manage our region’s IT and services from HQ. Since I was the lead IT guy in our region, that left two techs who were really only trained to go out and setup client equipment. \n\nJokes on them, 6 months after I was let go, the whole company collapsed.",
            "what happen tot he VP?",
            "Why does it take so long when people find out what happens when you mess with your best employees. Or simply put, FA2FO.",
            "[deleted]",
            "Decades ago I worked for a company that decided one year to \"save money\" by hosting a Christmas party for management above a certain level and excluding everyone else, including scientists and engineers many of whom had advanced degrees and shit. And they did it on the DL by having it at a hotel which happened to be one of the more expensive places in town. Well, of course, they got outed for it and boy did it throw a wet blanket on the place. Of course it didn't take long for management to notice that people didn't seem to be going the \"extra mile\" mile anymore and things weren't getting done they way they used to. I remember my boss, who was one of the attendees, came to me and basically said he knew this was a shitty thing to do and how people would feel when they found out and spoke out against it to which I replied \"But you went anyway though, didn't you?\". He was like \"yeah\" and i was like \"nbd, at least everyone knows where they stand now\".\n\nI think they really got the message when a member of upper management got deathly ill and needed lots of blood and hr organized a blood drive and even had the bloodmobile come out to the facility. Not one single member of \"The Help\" donated. Some even made comments about their blood not being \"good enough\". The dude ended up dying and attendance at his funeral was \"sparse\" at best. \n\nThe best part was when hr tried to \"make up\" for it by throwing a lavish Christmas party the following year at the same swank hotel their private affair was the previous year. One guy thought it would be great if everyone RSVPed then didn't show so like 300 people RSVPed and most didn't show. The company got stuck with a bill for tens of thousands of dollars for nothing.\n\nThe company lost it's edge and ended up floundering around until it was taken over by another company, losing people left and right along the way eventually laying off most of the staff in a bid to stay afloat and eventually ended up filing for bankruptcy. Like 2 of the original over 300 people are still employed with the firm that took them over and their old facility has been demolished to make way for \"redevelopment\". I still drive by there now and then a mind savor the sweet taste of  schadenfreude",
            "Hot take: It sounds like he didn’t want “back office” people at a client facing party, and cost wasn’t the issue. This was a way to save face with the engineers while still wining and dining clients.",
            "Man, imagine a company large enough to have a CEO and VPs and multiple engineers scrimping on $1,500. That’s like a medium to large purchase for a middle class family let alone an entire business.",
            "Someone else did this and posted about it a while ago. As I recall, there was a no alcohol on company property rule, so they held the party just over the property line at a park.",
            " Beautiful <chef's kiss>",
            "That server probably got paid orale vato",
            "When I first tried wagyu beef, I immediately proclaimed that it is now my favorite kind of beef. Also, of course that CEO came from sales. In my (admittedly limited) experience, sales people tend to be like that. Steve Jobs famously warned never to let sales people be executives.",
            "Sales people are always easy to replace... they are just charismatic and thats it.\n\ngood engineers can make or break your company in 5 seconds flat.\n\nFull disclosure: I am an engineer.",
            "I love this, buddies boss did the same thing except they had a team building evening at a strip club.",
            "Well played.",
            "What are the sales people suppose to sell if there are no engineers to create/improve/maintain the product?",
            "There is an undertone here that sums up every companies downfall.\n\nCompany becomes big because of great engineers -> company gets top salesmen to sell the great product more and more -> company starts investing in sales people more than in the engineers -> company products become subpar because all the good engineers have moved on -> company starts making inferior products and consumer moves to the competition -> company goes broke.\n\n\nYou guys are basically halfway towards going broke. Could take years, but once you get corporate /sales culture comes in. Engineers and company future go out.",
            "Let them eat cake.",
            "I used to dine out on a certain Lottery Corporation’s “Platinum Card” because of my wife’s affiliation with them. Those were the days!",
            "Did the VP keep his job?",
            "r/DeliciousCompliance",
            "I worked for a tech startup that is now a very large company.  We were MASSIVE users of AWS (Amazon web services)… like almost 9 digits in cost users. \n\nThe team went out to dinner with the AWS guys one night at a restaurant renowned for its wine cellar.  The VP went nuts ordering. \n\nAnyway, the bill comes, VP just hands it to the AWS guy. It was close to the same cost as OP.",
            "21 year old Lagavulin? My mouth is watering.",
            "I used to work for a company kinda like that. The president came up through sales, so they go whatever they wanted--over manufacturing especially. Imagine the fun! You want what when??",
            "I’ve had this happen to me at trade shows as well. The executives didn’t think the hard working engineers who actually setup and operated the booth were to be trusted drinking around our customers. No malicious compliance was had, unfortunately.",
            "CEO: \"Still worth it keeping those engineers out.\"",
            "This is strange. If the cost of having engineers at the party was only $1500 max, then that’s such a small amount to try and save. Then to suggest taking the team out for dinner as a compromise…how much did they think the dinner would cost?? Not sure how many people are on your team but I can’t imagine them expecting to treat a team to a nice dinner for less than $1500. So the CEO’s solution was to spend minimum of $1500 on a dinner instead of spending a maximum of $1500 extra on the party. All to “save money” when there clearly was an inconsequential amount of money to be saved to begin with. \n\nVery odd story unless it’s not true, the numbers presented are way off, or the CEO is a complete idiot. Could be multiple of the above I guess.",
            "I remember good ol' Uncle Arthur back working for Andersen Consulting. First and only time I got to enjoy Bern's Steak House.",
            "Great compliance but I am intrigued by the bourbon that was ordered.",
            "This sounds straight out of a Dilbert comic. Though the pointy haired boss wouldn't do what the VP did.",
            "Lol what are the odds this is Blackhat/Defcon and Rapid7.",
            "If you have a sweet party at re:invent again this year send me an invite. :)",
            "Selling as in talking someone into buying a thing should be illegal",
            "Good for your VP!  I hope he/she didn't get in any trouble for this.\n\nYou had one more higher-up standing up for you than I and my peers had in my last corporate position years ago.  But, that's a separate tragedy, with finance the whipping boy in my case.",
            "I would have loved to have been your limo driver that night.",
            "Did the CEO not want abunch of nerdy engineers at his chad frat party or something?",
            "This happens everywhere.  You can’t invite the entire company to a client invited event.  Otherwise it would be a national company meeting with clients.  Did the janitors get invited? Admins? Finance? \n\nThat said, your VP did the right thing. CEO should have thought of that in the first place.",
            "Sales people are sleazy. At least my husband and coworkers were.",
            "Ron? Ron Swanson? is that you?",
            "I’ve always been pretty extroverted for an engineer (ie I look at your shoes instead of my own) so have always enjoyed the parties at whatever company I’ve worked at. By and large engineering is very underrepresented at these; it’s often the other departments, but I’ve always found them super fun and a good chance to meet people. It would be ridiculous if engineers were actually excluded; thankfully this hasn’t happened to us, but I sometimes feel self conscious as one of the only engineers whether this party is “meant for me” or if I’m “supposed to be working”. (I’ve gotten a remark of the sort once or twice before)",
            "Great leader, that VP and got a good story out of it, too.",
            "Typical, but presently, your VP would have suddenly found other interests and left the company.  This is the future, the knowledge workers don't matter.",
            "What a ron Swanson move",
            "How many engineers we talking about? Me and 6 buddies rang up 8.5k at Hell’s Kitchen… but we like to parteyyy",
            ">It wasn’t just about cost. It was well known that the CEO (who came from sales) only thought sales people mattered at all.\n\nWhy are sales people often like that? It is like they are trying to compensate for small penises or something?",
            "How much was the tip? $3,000?",
            "Sounds like a Crestron party.",
            "Effing pointy-haired bosses.",
            "at least, that's what would have been cool.\n\nalthough the pizza was good to.",
            "what kind of idiot believes these shitty stories",
            "And then the VP handed every engineer $100!!!1!1!\n\nRevenge of the Nerds!!!1!!",
            "Lol",
            "When I consider I can get a bottle of that and 2 waygu steaks from Costco for <$500 and you probably paid the restaurants $$$ to cook it… it’s just hard for me to accept restaurants.",
            "What kind of company throws a huge party and then tries to save 1.5k? That's barely a rounding error for the costs involved. I'm kinda doubting these numbers.",
            "Michael Scott energy",
            "Mmhmm.",
            "$15000 doesnt sound too bad tbh. Is it missing a zero?",
            "I promise that your $15k dinner outing was not more expensive than throwing a corporate party in Vegas.",
            "I see a lot of people saying, \"Why exclude the engineers?\" And then a lot of IT and Geers chiming in that they are the red-headed step-child of any corporation... You know why?\n\nI'll tell you why...\n\nOne time my company got a deliver of fancy new desks for their dispatch centre. Each piece weighed no less than 400pounds. 3 pieces to each desk, times about a half-dozen desks. (These were super high-end hydraulic raising and lowering desks that would house about three towers and a half-dozen monitors, so, definitely not something you purchase foolishly)\n\nWe figured out that one 400 piece could go in the tiny wheelchair lift at a time, but since the lift was only rated for about 500lbs, we had to squeeze the tiniest female in there on top of the desk to work the buttons. We promptly overheated the lift hydraulics, which caused an electronic lockout for several hours.\n\nSo, we got about 6 big burly dudes willing to trash their backs and haul the fuckers up to the first landing, and we got stuck. Much like the couch on the landing of Dirk Gently's apartment building, the computer models all said the desk couldn't get to where it was, and there was no conceivable way to get it out.\n\nAt one point, my boss said, \"the engineers stated that in no uncertain terms, the desks would fit!\"\n\nTo which I replied, \"well, call the fucking engineers and have them come lift this fucking thing!\" \n\nI've always had a good working relationship with my employers, and have never shied from profanity.\n\nUltimately, we got the job done, we just waited for the lift to cool and went one piece at a time. To get the one unstuck from the stairwell, we just brought in more man power, and in the sketchiest move ever, lifted the god-damned thing above our heads and carried it all the way up the stairs like that. If one person started to slip, the thing would have crushed everyone in its path back down to the landing.\n\nIt's all well and good to draft something and claim it 100% will fit, but an Engineer with tech or trade experience is worth his or her weight in gold.\n\n-------------\n\nAnecdote aside. I work shift work, my shift rotation has fallen on both the company Christmas party AND actual Christmas with 2022 being the THIRD year in a row. Getting cut from the party sucks. I think you lot went a little gentle on the CEO IMHO.",
            "You are a bad person. No doubt",
            "AMX/Panja?",
            "AWS re:Invent?",
            "ahhh defcon, when the engineers get to play lol",
            "It'll come out of a different line in the budget. No biggie.",
            "I LOVE your VP. That's fantastic!!!",
            "And give all comments an up vote.",
            "I worked for a company that would have week-long conferences in Las Vegas, AND hold a party at the end for customers. I'm beginning to wonder if we worked for the same company in fact. Is/was it a US-based company out of Florida?",
            "How was the Wagyu?",
            "100/10 VP",
            "So, is the Wagyu steak all that and a bag of chips, or just another lump of cow?",
            "Unrealistically cheap meal or small team.",
            "That VP fucks",
            "Was this at G2E by any chance?",
            "CEO is a DICK!",
            "Is wagyu good if you prefer lean steak?",
            "People who eat like that regularly but also not fat are like aliens to me. I would be 600lbs if my menu was like that. I'm 47,160 lbs and would blow up inside 6 Mos....",
            "Ahhhh sounds like the place I work at 🙄",
            "Yb",
            "Nice",
            "Awesome! Well played!",
            "Soon as I saw steaks, the first thing I hear in my head:  “Tonight, we eat something’s flesh!  I WANT MEAT!!!”",
            ">Wagyu + 21 yr-old Lagavulin = a spiritual experience.\n\nRon Swanson definitely approves this.",
            "I went to a bought out bar at a mining conference, proceeded to get 18 year Macallan pours all night at $50 a piece. I love those events!"
        ]
    }
]