[
    {
        "post_id": "iqwebi",
        "author": "leaporlepor",
        "title": "\"Go to the head and explain exactly why you are being disruptive\" Okeydokey then",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/iqwebi/go_to_the_head_and_explain_exactly_why_you_are/",
        "score": 19607,
        "num_comments": 739,
        "created_utc": 1599849275.0,
        "selftext": "Many years ago when I was still in school, I was having an issue in one of my classes. The boy who was sitting behind me kept trying to undo my bra. I got fed up and asked if I could move to another seat. The teacher refused to let me, even after I explained why. He said 'boys will be boys, so just ignore it.' Then he told me that if I didn't sit down and do my work I would have to go to the head teacher and explain exactly why I was being disruptive. \n\nI stayed standing and was sent out. I went to the head and explained everything, just like the teacher wanted me to. This head had only started at the school a few months before and had implemented a policy where interference with another's clothing was not tolerated. This was because of the many girls who had complained the the boys were messing with their bras and sometimes even their underwear.\n\nThe head was very unhappy, especially about the boys will be boys bit and she escorted me back to class and told me to sit wherever I wanted. She then asked the teacher and the boy to come out with her. The teacher came back in about fifteen minutes later and apologised to me. I think the head made him because he didn't seem happy about it and he studiously ignored me every class for about a fortnight. The boy hadn't come back into class and in the afternoon assembly everyone had found out that he was suspended for 3 days for what he did.\n\nIt was probably a little unseemly how satisfied I was with the end result. I never heard that teacher send anyone to the head again.",
        "permalink": "/r/MaliciousCompliance/comments/iqwebi/go_to_the_head_and_explain_exactly_why_you_are/",
        "comments": [
            "If my son ever did something like that, the 3 day suspension would be the least of his worries.",
            "[deleted]",
            "'Boys will be boys' is supposed to be about a bunch of nine-year-olds throwing mud at each other and then seeing who can hang upside down from a tree the longest before the blood rush to the head makes them lose consciousness.\n\nNot sexual assault.",
            ">Boys will be boys\n\nThis is used to excuse behaviour that would not be tolerated from adults. Imagine if your coworker was trying to unhook your bra or flip your skirt up. We really need to get better at teaching boys that they do not have the right to touch anyone, no means no, and that harassing girls is not a healthy way to get their attention. \n\nGlad your headteacher responded the way they did.",
            "Good for you for standing up for yourself. “Boys will be boys“ is BS, boys are perfectly capable of controlling themselves and behaving like civilized human beings. I know that for a fact because I have two teenage boys that would never sexually harass a female like that.",
            "Bloody good on you!!!",
            "“Boys will be boys” is the dumbest thing ever. It’s meant to explain when they run into a fuckin wall on purpose, not sexual assault/harassment. Like when tf did that become the narrative. \n-Sincerely a boy",
            "Right on. I had to deal with a whole cadre of boys who were “boys being boys” who were sexually harassing me. It finally stopped when I put one on the fucking floor after I had enough. It’s bullshit.",
            "I'm glad you had supportive staff at your school.  I did not, and was, in fact, told by my parents to let it be known if it continued to be an issue, I had their permission to retaliate with violence. \nI only got tested once, and my parents went to bat for me with the school, and that particular issue stopped after that.",
            "That teacher’s attitude is what’s killing civilization. It needs to be replaced with love and empathy.",
            "Boys will be boys should apply to when they wanna see if they have enough pee to write their name in the snow or to prank their parents by eating a mayo jar full of vanilla pudding. \n\nNot sexual assault.",
            "That teacher disgusts me. He doesn't deserve his job, and that kid needs to be taught better by his parents. If I ever pulled that shit I'd have been in big trouble, but I never did because I was taught to have common human decency for other people. I didn't even have good parents, but at least I learned that.\n\n Yeah being a teenage boy floods your brain with hormones. That's the conversation a dad needs to have with his teenage son(mother could work too, but boys understand this from their dads more easily) to relate and explain what is happening, how it can make your judgement clouded, and why you need to control yourself.",
            "There was a boy who kept touching my legs in middle school.  The teacher said he didn't have any evidence and the boy acted all innocent when they asked him about it.  Finally one day I just shouted at him while he was doing it \"ANTOINE, STOP TOUCHING MY THIGHS!\" definitely disrupting the class, and everyone else was like a deer in headlights, even the perpetrator, who had frozen with this hand on my thigh and everyone saw.  It worked.  He was even transferred out of that class after that.",
            "Reminds me of a similar story I read on one of the Not Always Right websites.  A girl kept having her bra strap pulled by the boy behind her.  She told the teacher, who was a man, and he told her to just ignore him.  The boy does it so hard, it comes undone.  She turns around and punches him in the nose.  The mom, a nurse, gets called in and is met by her daughter, the boy, his parents, the teacher, the head of her year, and the dean.  The mom asks if they wondered if she was going to press charges for sexual harassment, which got everyone all worked up.  After her daughter explained what happened, the mom lit into the teachers and dean.  She had a word with the school's governors, and the daughter was moved to another teacher for the same class.\n\n[Found it.](https://notalwaysright.com/was-bra-ced-for-a-different-reaction/35572/)",
            "Yeah, boys will be boys. They'll jump in the mud and play with bugs and somehow manage to get filthy no matter where they are. They'll climb things and fall and get hurt. Sexual harassment is not a \"boys will be boys\" thing and my son will absolutely be taught better.",
            "Hurray for putting boys who don't know how keep their hands and the rest to themselves  in their place as well as anyone who lets them get away with it. \nWhen I was in high school  a boy in my math class decided to blow kisses at me.  I  barely knew him and certainly didn't want his kisses.  The math teacher was no help just like this teacher.  One day I told i didn't like him like that in the school store  and the teachers in charge heard decided to take it to the principal.  The boy gave a lame excuse about waving at me.  The principal just told him to knock it off and let him go and then complain about me complaining and sent me away.  At least I was able to attend math class in peace.  But I wish he gotten more of a punishment  considering that lame excuse.  This is high school  not kindergarten if you can't figure the difference between waving and kissing you don't belong in high school.",
            "The same thing happened to me. Some asstwat boy would constantly unbutton my bra, even when I got some that hook was in the front. I told my horrible 6th grade teacher,  refused to do anything, and used the same excuse of \"boys will be boys.\". Finally I got tired of it and just punched the shit out of him. The principal called my parents about me assaulting him. He planned on paddling me for it. Thank God my mom told the principal off, threatened to sue, and demanded the boy be punished. She threatened to pull my brother and I from the school. It was glorious. The boy was expelled, as he was treating other girls the same way, and was known to inappropriately touching them. I had no punishment, and was surprised when I did not get grounded.",
            "I read a story here about the same thing. Except the girl turned and knocked the fuck out of the boy. The princable called both sets of parents to come in. When the boys father wanted the girl to be suspended for punching his son her mother replied \"for what , defending her self from a sexual assult\". From that point on the mother had the upper hand and got it resolved in her daughters favor .\n\nThat story has stuck with me for years.",
            "Is a head teacher like a principal?",
            "Boys will be boys.\n\nNo, boys will be men and every moment of life should be preparing them to be good ones.",
            "Male here. Not touching people isn’t as difficult as every tells me it is.",
            "In 1977 I began the 7th grade (when junior high/middle school began back in the olden times). This was in Queen borough of New York City. New York was rough enough. But, middle school is just bad because of the ages of the kids. I had the same issues with the boys being very handsy. I had my bra straps snapped. The back undone on the daily. We held our books across our chest in the hallways to prevent the boys from touching our breasts. Also they’d run up behind us and undo our bras and run away. So the books would hide that fact until we could get to a bathroom to fix it. Hands found their way to your ass, too.  I asked my mom to get me a bra that buttoned in the front. I had some peace and quiet for a while until one smart boy realized how it buttoned (noticed I didn’t have snaps in the back) jumped up from behind me and pushed the button holding it together. Pain in the ass!!!!  When things escalated to when the boys had their hands in every girl’s butt crack we began literally screaming. The teachers became angry with the girls that fought back. Until one day my assistant principal saw a boys hand in action on my person. The teacher yelled at me. The asst. principal yelled at my teacher in front of all of us that he failed at his post to teach respect to the boys of his class. We stood stone cold silent. The boy that touched me was suspended for two weeks. He never touched me again.",
            "Was this in America? Bc American people seem to see this as quite common but where I live it is unheard of like they'd probably be expelled for sexual assault",
            "The phrase \"boys will be boys\" always makes me want to throttle whoever said it.",
            "For years people, including friends, gave me a hard time for daring to turn in a group guys for sexually harassing me in school. I'd had enough and they wouldn't stop. Many years after the fact one of them took a job where that event could've hindered their hiring process. and a I was again reprimanded by a mutual acquaintance for standing up for myself all those years ago.  I told them, maybe they should have stopped when I asked them.",
            "The sad thing about this is both the teacher and the boy got off lightly.",
            "> boys will be boys\n\nOkay, not only is that awful, but as a man, I'M insulted. It's like \"locker room talk\"...no, most guys DON'T talk like/do that.",
            "As an occasionally stupid male I'm so fucking sick of the \"boys will be boys\" bullshit.   What's wrong is wrong and gender has nothing to do with it. \n\nI'm unduly pleased that you stood up for yourself in the face of authority and am working to insure my daughter has the same courage.",
            "That teacher should have been fired outright. Firstly, you are helping boys become men. When a boy dies that he needs to be taught not to.",
            "As a (male) teacher, I want to punch your teacher in the face.\n\nSeveral times.",
            "this happened to me constantly as a girl who played basketball growing up -- good for you for sticking up for yourself and for sharing it here",
            "I am surprised teacher was not reported to the school/county board and suspended.",
            "When I was in high school, our school had just moved to a different campus that had locker rooms and a gym. It was decided that for gym classes, the boys and girls would share one locker room by taking turns. I think the custodian we had didn't want to have to clean both, so she convinced the principal it was a good idea. Girls were to go in first, get time to change, and then boys would get their turn. One day as a couple friends and I were leaving the locker room, a group of boys started to head in. We told them that there were still girls in there and that they needed to stay out. Apparently the gym teacher told them that he didn't care if the girls weren't done, the boys needed to go in and change. We wouldn't let them until the last girls were done. Many of the girls told their parents (including me), and parents were NOT happy we were sharing. Pretty immediately, the other crappier and creepier locker room was opened up for the boys to use, and the custodian threw a fit because she had to clean both.",
            "\"Boys will be boys\" pisses me off as much as \"if he's mean to you it means he likes you.\"\n\nI once (sometime in middle school, in the 90's) told a teacher about being picked on and way told the \"he likes you\" line. I told the teacher that I thought it was stupid he was essentially telling me that it was okay to take abuse because someone liked you. That is why people end up killing their spouses. (There was recently a news story locally about a spousal murder in our town, I think I just said that is how things like that case happen.) Teacher looked at me strange, nodded, and told the boy to lay off.\n\nWhenever I hear boys will be boys I tell the person, \"you should be teaching them to be men.\"",
            "“Boys will be boys” applied to shit like climbing trees, stealing house sale signs and riding them down hills, shooting each other in the bum with fireworks, doing burnouts, and all the other stuff my brothers got in trouble for when they were kids. It doesn’t give them the right to sexually harass their classmates and co-workers.",
            "This is great.\n\nI'm a teacher (male) and I watch the kids VERY carefully because sadly some kids DO like to torment the others. And in my experience it's mostly boys onto others...other boys or other girls.\n\nI think your teacher was a bit strange for saying \"boys will be boys\"...well, yes they will, that doesn't mean they get to pester others in class.\n\nEveryone has a right to feel safe in class.",
            "Boys will be boys is supposed to encompass dumb, harmless stuff, NOT violating a person’s personal space by messing with their clothing.",
            "When I was 15, the boy who sat behind me in one of my classes kept harassing me by pulling my hair, and constantly whispering in my ear that my hair looked like pubes. My hair was naturally curly... and clearly 15 year old boys are very clever. Anyway, I asked the teacher if I could move and he refused me. So I sat back down and the kid behind me started back up again - so I asked again to be moved but the teacher refused. \n\nMy temper got the better of me and I walked straight out of class and to the principal. Within 10 minutes, the idiot boy was moved, and the teacher was mad at me for going above him to the principal. \n\nWhy should a student have to be harassed or touched during class and have to tolerate it? Just because the teacher is a dick and won’t do anything about it? Screw that... I’m glad your story ended up the way it did!",
            "\"Boys will be boys\" is supposed to refer to playing in mud, roughhousing a bit, or liking monster trucks. It's not supposed to be an excuse for sexual assault.",
            "As a man, I’m really glad that my parents taught me to be respectful. If I had been behaving like the lad in this story, the 3-day suspension would have been the least of my worries. And if I have kids, I will raise them the same way",
            "There was a Reddit post about how some gents asking people to help name a pet scorpion was the very definition of 'Boys will be boys' as opposed to assault. I think about that post a lot for some reason.",
            "> boys will be boys\n\nThat's a great excuse for sexual harassment and \"just ignore it\" CERTAINLY will make those boys learn that their behavior is not tolerated.",
            "Sexual harassment is never ok.",
            "He really thought he was going to send you to his boss, a woman, and she was going to take the little creeps side?",
            "“Boys will be boys” if I told that to my dad his response would be “boys will also get their asses beaten”",
            "\"Men will be men\" was what my female manager told me when I complained about a male coworkers unwanted advances and attention. It got to the point he stalked me at work, happening to be wherever I was and  was doing this to multiple other females as well. When I told my manager, she made me sit in a room with him while he denied the accusations and sat there smug because they worked together for 15 years and were friends. I called hr sobbing on the way home- this guy would even go to my cubicle and mess with my wedding pictures! I gave myself a migraine and called in the next day using my FMLA leave. When I went in the following day I was written up. On the drive home I called the case manager and told her and she got pretty pissed. She was professional but was having none of it. She told me to stay home the next day and when I went back in the guy never bothered me again and the manager kept her distance until she apologized.",
            "In grade school while standing in line for lunch or something a boy had the nerve to pinch my butt. He did NOT expect me to turn around and wallop the daylights out of him. My friends with girls taught them the same thing.",
            "Those 3 days better be hell for that brat. Sexual assault is no game",
            "Kids in my school used to do this as a form of bullying too. One day I was sitting in class and the girl behind me undid my bra. I have big breasts so it was obvious. I asked the teacher if I could go to the toilet intending to fix it and she snapped, 'no, they told me why you're going and no, you can just sit there'. Kids spent the rest of the class passing me humiliating notes. I had long hair and tried to hide behind it but the teacher wouldn't even let me do that.\n\nAt the end of class, the teacher made me stay behind, intending to lecture me about whatever story the bullies had spun her beforehand. Facing me one on one was when she finally realised how upset I was and asked me for my side of events. I told her and she was LIVID. She explained that it was sexual harassment. From that point on, she was my biggest advocate. Unfortunately, she was young and without much influence so I wound up dropping out due to the bullying anyway. Still, at least she tried.",
            "\"Boys will be boys\" is super fucking sexist no matter how you spin it. Either you're saying Boys are incapable of modifying their behavior to be decent people, or you're saying Girls need to suck it up and deal with however boys want to act because boys feelings count for more.",
            "The difference in dress code between females/males and the expected/forgiven behaviour between the two in the education systems is both sick and twisted. Females are expected to cover up lest they excite the boys and the males are forgiven for boyish pranks. \n\nMy 11yo daughter is just coming into womanhood and is proud as punch about the changes. I don't want some hormonal little sh\\*t, inappropriately touching her, and setting her up with a teenage-full of self loathing!",
            "That is sexual harassment! What a fucking douche",
            "https://notalwaysright.com/was-bra-ced-for-a-different-reaction/35572/\n\nA similar situation.",
            "Gotta love a full grown man saying to a child \"boys will be boys\" about this. Like as if to say he would do that if the situation arose.",
            "[deleted]",
            "Man, this hurts. In my FOUR YEAR LONG battle with the same abusive boy, the administrative genders were reversed, and there was quite a different result. This creep tried everything to literally get inside my pants from 2nd through 5th grade, and it wasn’t until my female 5th grade teacher decided that she would be the first to believe me that I sorta got somewhere. My parents had tried to get the creep out of my class to no avail for three years, but we were in the same “educational level” so he always stayed. When I, with tears, finally told my 5th grade teacher that the guy was still abusing me and that I couldn’t take it anymore, I was sent to the principal’s office apart from the creeper. He threatened to paddle me (it was the 80s) and made me assume the position because I had “disrupted class over this for the last time.” He did not paddle me. He did, however, paddle the creep. The next year he was off to military school. I weep for those he abused there, because you know it happened. If he spent four years trying to get into a child’s vag, you know he did worse as a teenager. OP, I envy your luck in having a female principal. I wish mine had been the understanding type.",
            "The boys will be boys bit is extremely sexist. I grew up hearing that in school but it seems to be getting worse instead of better. Glad the head teacher did something about that.",
            "Boys will be boys is for accidentally smacking your mate with a stick during a sword (stick) fight in the park. Not for sexual assault",
            "So... the teacher ignored a complaint of sexual assault.  that the education system I've come to know and love\\*. \n\n&#x200B;\n\n\\* Not love.",
            "I had a really great teacher in 10th grade. She was young, new to her job, and just generally pretty cool. She would generally let us get away with almost anything as long as we put some effort into her class. Basically an \"I don't give a fuck about *what* you do, as long as you work with me\" attitude. I loved her classes, they were fun and educational, she tolerated some fucking around, and even encouraged it if it was on topic.\n\nIn 11th grade, she was gone. Apparently she was taking a year long vacation in Australia to work and travel. Good for her!\n\nIn 12th grade, she came back. She seemed a bit rusty in her teaching, and she was happily telling us all about her time in Australia - not going into too many details, but definitely spreading excitement with all of us. Everyone was happy and listened to her stories, and chimed in now and then. Basically not even a lesson at this point.\n\nThis was a private school, and generally, you only went there if the public school system failed you. Pretty much everyone was a \"problem child\" and it was expected that you worked with that, as a teacher. Aside from bullying (hard no) and distracting others during lessons (soft no) you could kinda do whatever because you were a paying customer.\n\nBefore the lesson, I went to a fast food restaurant. There was one nearby, I had a car (I retried two years in public school so I was older than normal), so I went there often to get snacks during breaks. I had been finishing up my food while she told her stories, a few other students had some too because I piled as many people into my car as I could, they usually didn't mind us eating if we weren't disruptive about it. I mean, really, *why* would you tell teenagers not to eat while learning?\n\nAnyway, I was done with my food eventually. I piled all the fast food trash into the paper bag it came in, and balled it up. I checked where the wastebin was... it was near the door, which was behind the teacher, and I was sitting at just the right angle for her to be inbetween the bin and me. Without even getting up, I tossed the bag over her head. Noise of paper bag rustling into a plastic bag. Score! I was super proud that I perfectly hit that shot. A few other students cheered briefly, but quieted down again to listen to the teacher continuing her stories.\n\nExcept... she did not. She got up, glared at me, and was full on furious. Completely upset with me. She yelled at me to pick that up. I had expected her to be somewhere between impressed and indifferent that I tossed trash over her head and into the bin... but she was mysteriously furious. I asked her what I was supposed to pick up, since I clearly hit the bin. She just kept yelling at me to pick it up. So I got up, walked to the door, lifted up the trash can for everyone to see, reached inside, lifted the trash out, and put the trash can back on the floor. I looked at her. She kept glaring and told me to put it in the bin. Teenagers were laughing at this point, since I clearly just lifted trash out of the trash can to put it back into the trash can. I obliged and put it back where I picked it up from. She got even more furious and told me to go to the head and explain what I did. So I said alright, and went. And I explained everything.\n\nThe headlady was surprised to see me, I had been there for over two years now and I'd never been sent to her office by a teacher. I told her everything. How the teacher used to be the coolest and I assumed she remained that way, but I guess a year in Australia changed her a bit, and I had to get used to that. Headlady fully agreed with me and said she'd keep an eye out for that. She did make sure to tell me it was disrespectful to throw trash over a teacher's head, but acknowledged that her impression of that teacher before the vacation was also that she'd be okay with that sort of thing, especially considering I did not hit her, and I did hit the trash can as intended.\n\nThere was no actual fallout for this story. I just stayed in the headlady's office for 10-15 minutes and we chatted about our favorite fast food restaurants since we were on the topic, and she asked me not to return to class until the next lesson so I wouldn't encounter the teacher and have a heated moment. I did exactly that, and nobody got in trouble. I made sure to be more careful around that teacher from then on, and scope out just how cool she still was after that vacation, and how it evolved over the year. She ignored me a little more but did not treat me unfairly. And now all I have to say about it is that it was really an incredible throw, especially for someone with terrible aim like me. I did not expect that trash to land the way it did, though at least I was confident I wouldn't hit anybody.",
            "“Boys will be boys” is dangerous. Because when, exactly, do they stop being boys, and become men? Are they supposed to turn 18 and suddenly understand consent, when everyone around them has told them all their lives that their wants are more important than others’ safety? It’s a grave disservice to them, as well as to the people they hurt.",
            "Hell, that's still a problem in many schools, my own included, it's damn toxic in there.",
            "👏🏻👏🏻👏🏻👏🏻",
            "I'm surprised the teacher didn't get suspended.",
            "I still don't understand the teacher's logic there: \"boys will be boys\"? I've been re-reading this for like 5 minutes and I still don't understand where he was coming from. He might as well have said \"boys will always sexually harass people\". Still though, good malicious compliance on your end and glad your headteacher saw the issue immediately and dealt with it immediately.",
            "Good for you. Make sure you share that with any girls that look up to you. Sexual harassment should never be tolerated.",
            "As a guy, if I had a son who did that, I would give them a verbal tongue lashing that would have him lashing his back in penance. I'm not even religious.",
            "Good for the head teacher. Shocking behaviour by the normal teacher and the boy. If I did this as a kid, my dad would severely punish me. In his words he’d “give me a good hiding”. Unwanted sexual contact at any age is absolutely not allowed. \n\nGood for you",
            "Being satisfied with that result makes sense, but like, what was wrong with that make teacher to think what is sexual harrassment is ok. *I'm not sure if it would be counted as sexual harrassment if I'm wrong correct me*",
            "How old was your teacher to be saying 'boys will be boys' lol. Some people really need to catch up with modern society.",
            "Its. Sexual. Harassment. My mum taught me young if a male touches you in appropriately including snapping my bra I had her permission to punch them in the face. It only happened once the boy got a suspension to go with his broken nose and black eyes. They tried to suspend me as well until my mother threatened yo get the cops and lawyers involved",
            "Glad your headteacher stepped in. If anyone dared try that sort of shit with my little sister and nobody did anything to stop it, the teacher would’ve gotten an ass-chewing from our mom, and that little snot of a boy would have her three older brothers to answer to. And that’s assuming she hadn’t already slapped the taste out of the bastard’s mouth. \n\nBoys will be boys my ass. That’s supposed to be what you say while rolling your eyes when a kid plays in the mud in their nice clothes.",
            "If my daughter came to me with this I would make it my mission to make that teacher's life miserable. Their job is to keep the kids safe.",
            "Don’t qualify yourself with “I acted unseemly” \n\nYou acted so mildly it hurts. Good job protecting yourself.",
            "Nothing at all “unseemly” about being satisfied with that outcome.",
            "teacher should have been fired on the spot tbh",
            "Them: \"Boys will be boys.\"  \nMe: \"Men will be men, and this man will beat the fuck out of that horrible crotch goblin if he does anything like that again.\"",
            "Kudos to you for standing up for yourself, and for your head for not rugsweeping it and taking decisive action on it!",
            "Always nice to hear when a school upholds the spirit of the rules instead of the letter AND actually seems to care. I don't always blame teachers for being jaded, but hot damn there's a difference between that and blatantly disregarding an issue.",
            "In high school my nephew would always try unhook my bra. That's why I started wearing front hook bras.",
            "If I was on another platform I'd drop the \"Orson Welles slowly and seriously clapping\" gif right here.",
            "I think if my brothers did that Woooo do you believe my mother would beat their ass with the leather belt",
            "I hate the boys will be boys thing. A kid twisted my wrists in 2nd grade and I heard/felt a crack. It hurt so bad and I was crying and told one of the adults and that was the answer I got. All the boys up until this most recent generation learning they can do whatever the heck they want to anyone because they have different genitalia and hormone combinations? Um no wonder rape and assault\nIs an issue. -.-",
            "That teacher is a piece of shit and shouldn’t be a teacher in the first place.",
            "Your satisfaction was by no means unseemly. It was appropriate and deserved.\n\nAnd that suspension may have stopped a future rapist...",
            "Not unseemly in the least!",
            "School could have been sued for creating a toxic environment, condoning sexual assault. Surprised the teacher wasn’t more reprimanded.",
            "Duuuude. If a boy did this at my school he'd get jumped.",
            "I LOVE the head! My daughter was in our junior high when this started happening to her. Boys in the hall would unhook her bra, or try to pull up her shirt. One group of 3 boys was known to walk up on a girl, grab and hold her arms, and one boy would stick a hand down the girl's pants or up her skirt. They actually tore the panties off of one girl who was in a skirt. They took them as a \"trophy\". The principal asked me what I wanted him to do when I went to the office to complain.\n\nHe said that the teachers can't watch the halls, so no adults were ever supervising the halls. And he said that unless there is video, there is no proof anything happened, so it is the boys' word against my daughter's word, and there are 3 boys at least, so her word would count for nothing. \n\nI couldn't send my daughter to school every day to be sexually molested and/or assaulted. We homeschooled for the next few years.  I am so glad that you got much better results.",
            "I would disagree; it was not unseemly at all.",
            "Schools are too lack with things like this. The boy was sexually assaulting you. I'm glad he was punished but he, and all the students, need to be taught the punishment for adults if this happened outside the school.",
            "I’m glad that you had a head teacher who supported you and wouldn’t take any shit like that from kids. I’m glad that the boy got a suspension and it’s a shame that the teacher didn’t either, however having to apologise to you in front of your peers was well played by the head teacher, because it would’ve spread like wild fire that a teacher had to apologise to you.",
            "Wtf that's literally sexual harassment at best",
            " Lead by example \nexcellent!",
            "I'd want that teacher out on unpaid leave for a bit too. Absolutely nothing good comes from condoning sexual harassment in the classroom.",
            "That teacher should have been fired for encouraging and allowed sexual assault.",
            "I used to like that phrase because it perfectly describes the stupid logic that guys have floating around in their brains and doing stupid shit even if it hurts them because “boys will be boys” but now I cringe every time it’s used as an excuse to hurt or sexually assault anyone around them. And adults who use it to excuse a kid of those behaviours specially a fucking teacher needs to be taken out of that environment because they’re making kids think it’s an okay thing to do because an adult says so. \n\nAnd I’m ashamed to say that I’ve seen so much of this behaviour when I was in high school and didn’t say anything about it to anyone because I was a socially anxious teen but hindsight is always 20/20 and at least if I do have kids of my own I know what to teach them to be a decent human being.",
            "Where the fuck do you live for this kind of behaviour to be chalked up to \"boys will be boys\"? Thats beyond stupid",
            "I’m a boy and I believe in boys will be boys but not to the degree to where you are harming someone else. Go drive fast in a secluded place, jump off a cliff, lick something unknown, shoot yourself in the face. But when it comes to making someone else feel uncomfortable, take on the motto boys will be gentleman.",
            "Never be unsatisfied with the results. You saved that boy from potentially getting into worse trouble later in life. At least, that's what I am choosing to believe.\n\nMen, well, people in general, shouldn't be touching another person or what's on them without that persons permission.\n\nThis was definitely an invasion of your personal space or whatever. (trying to sound smart here by using the word invasion. cut me some slack.)\n\nYou did good.",
            "“Boys will be boys” used in that context pisses me off. In my mind, it’s just boys doing dumb shit to themselves or each other. Basically Jackass and Viva La Bam stuff",
            "Well now im depressed for several reasons\n\n1. This is so common that it had to become a rule\n\n2. The teacher was not reprimanded in any way shape or form \n\n3. The kid got a 3 days off school for doing it basically rewarding him for his actions\n\nSince hes doing it in the first place i doubt his parents will care enough to punish him and since its such a common issue in your school hell have plenty of like minded people to talk to once he returns",
            "See, now _that's_ malicious compliance in a school setting.",
            "My sons father died when he was 10 years old. He is 20 now.  He has been raised by a houseful of women. Me, my mother, my sister, and his sister. Anyway it was  hard teaching a boy to be a man when yiu are a woman. BUT he was raised to be a respecter of women. If he had ever done anything like that to a female his dad would have came back from the dead just to beat him. Shoot i would have embarrased him in front of all his friends AFTER i beat him. Hes grown now and id still beat him.  He understands that every female is someones mother sister etc. The boys will be boys thing dont hunt anymore.",
            "Pretty sure if I had a boy trying to unlatch my bra I would have smacked his ass.",
            "What about the teacher- he should be suspended or fired",
            "I don't understand this. I was always able to keep my hands to myself throughout school.",
            "Fighting fires by day and supes by night",
            "Fortnight is an underused word.",
            "Back in the 80's it was normal to undo girls bra's once in a while, it happened a lot. I recently saw a girl from my class that I had done this to a few times, she was always a nice girl, not a tart. I actually had felt guilty for undoing her bra a few times when we were at school and told her I was sorry and had thought about it often in the intervening 30 years.\n\nShe was so surprised and thought it was funny that I had felt guilty over it, but I had realised how it could be damaging, she wasn't bothered, I lived with the little tinge of guilt for 30 years. Debt paid I hope.",
            "Wtf kinda school is that?!?? That’s the kinda stuff that only happens in anime",
            "Man, a girl oantsed me one time in highachool(12 yrs ago). My dick was out infront of the entire gym class, this bitch never even got asked to aoologize.... Until my mom found out, then it was her, the gym teacher and the principal all having to apologize to me and i got 3 free days. Plus my dick looked good at the point so probably had residual sex from it. It was fucked though, i know it was a joke and unintentional but i felt like dying",
            "My mother stressed “you can look, but DON’T TOUCH.”  \n\nNow, granted, that rule was delivered in another context originally, but was enforced so much in so many other circumstances that I just KNEW it would also apply for to girls. Thus, I kept my hands to myself. \n\nIn fact, I followed that rule so religiously, I remained a virgin until I was 29 years old!",
            "Honestly if my sun did this I'd beat him to death with my maglite.",
            "This is a very Bri'ish story",
            "God bless that Head Teacher as its about time that teacher and boy got put in their place.  Even when I was young I don't think I ever did stuff like that.",
            "Teacher's almost as bad as the shithead boy that did it, he allowed it to happen. I wish I could've heard him get chewed out by the head teacher for being an enabling dick lol.",
            "HA! Well done! That boys will be boys crap went out with the last century! Its sexual harassment pure and simple!",
            "Gawd that boy has no fucking self control.",
            "I've raised my daughter to use the system like this, and that if she in unable to get results at school, she is to immediately tell me and her mother.\nI will NOT tolerate shitbags harassing anyone, let alone my daughter.",
            "I wanted to mention that you suggest it may have been \"unseemly\" to have gotten so much satisfaction from both the perpetrator and the enabler of assault to have been ~~punished~~ corrected, but it wasn't.\n\nWhatever level of smug you may have presented as was completely seemly.",
            "Good stuff.",
            "Anyone else find it funny that OP is referring to the headmaster as “the head”?  Going to the head can mean very different things…",
            "Good for you and thanks for sharing your story.\n\nI hope others gain inspiration from this post and also stand up for themselves!",
            "why... would the adult male teacher allow adolescent, teenage boys do stuff like this?  My parents didnt do much raising and a lot of my social lessons were from elementary teachers. \"Treat others how you would like to be treated. Hands to yourself. Wait for others to finish speaking before speaking\"  but that goes out the window for school during puberty?! wtf???",
            "You handled it better then me. I socked a kid in the jaw for it before cus the school didn't do anything and my dad told me to teach him myself if I had to",
            "You’re amazingly amazing",
            "What the fuck goes on their head messing with personal space like that?",
            "I hate the “boys will be boys” argument.    \nSure, young boys can be shit heads, same with girls. This however does not give them a pass at sexual harassment.      \nAs women, we’re told not to wear revealing clothing or to not walk alone at night because of mens urges and “boys just being boys” mentality. How about we should be able to walk wherever and wear whatever and guys are just taught to... idk... not rape people?",
            "You should have knocked the hell out of the creep touching your bra. Behavior like that doesn’t deserve civility.",
            "I'm sure someday the world will recognise boys will be boys as an excuse for rape. In fact it's already happened in my country, India. A minister announced in public that the rape victim was at fault, she was apparently 'not covered enough'. He career was demolished.",
            "I once had a few classmate bullies in 9th standard who would coerce one of my then close friends into having sex with them. She one day complained about the abuse to our class teacher. He called those bullies outside the class, took them to a lonely area, and beat them like animals(like grabbing their head by their hairs and pull them back and forth vigorously, slapping the shit out of them etc. violently). Sadly, this complaint never made it to the principal's office(I'm assuming that because they never got suspended). Nobody else knew about this incident except for a few people, she just told me and very few of her friends.",
            "How did this teacher tolerate this? I’m disgusting.",
            "The teacher should have been suspended, the boy should have been assigned extra work/detention.",
            "How do they do the underwear? Panty wedgie?",
            "Boys will get a heart to heart stern talking to if they're going to \"be boys\"\n\nEdit: sexual predators",
            "They announced to the whole school in an assembly that this kid was suspended lol?",
            "Bad teacher tried to use fear of authority on you.\n\n\\*Idiot\\* bad teacher didn't consider that the school had a new head who might have different methods than the previous head who apparently didn't give a flip.",
            "The fuck kind of school is that??",
            "[removed]",
            "Boys will be boys is just a horseshit Saying and incredibly unfair to boys/men.  How little do you think of males that you think they can’t act properly?",
            "Go to the Head (read as Can/Toilet)",
            "Here in Australia there has been a whole advertising campaign against the whole “boys will be boys” excusing sexual assault like that.  Only a few years ago though, I see that you said this happened in the 90’s - and it was the same with me back then.  I used to get the bra pinging back then too.  I hope we have evolved more since then.\n\n\nhttps://www.respect.gov.au/the-campaign/campaign-materials/",
            "Just curious, where are you from?",
            "Fuck yeah.",
            "Shizz. Boys playing with bras and underwear. Where I'm from it was considered perverted to sit with a girl.",
            "Well done!"
        ]
    },
    {
        "post_id": "s67vaq",
        "author": "fr0st_byt3",
        "title": "\"If you don't like the way we do things here, you can leave.\" OK",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/s67vaq/if_you_dont_like_the_way_we_do_things_here_you/",
        "score": 19576,
        "num_comments": 354,
        "created_utc": 1642436571.0,
        "selftext": "This is a little long. Sorry.\n\nWhen I was in college, I worked for a mobile carrier in a mall. For a young person, it was great money. I was the assistant manager, which was a fancy way of saying I was in charge of most of the store paperwork.\n\n&#x200B;\n\n\\[A few months before\\]\n\nOne morning, I opened by myself and a guy approached me asking for a specific phone and kept balking at the price, asking if I could \"cut him a deal though\". I was confident we were BY FAR the cheapest in the area, so I told him \"If you bring me a better deal, I'll beat it!\". The guy does another lap, talks to other stores, and comes back. \"Come on, there is nothing you can do? Can I just get a case?\". I smile and say, \"Sorry that's the best I can do today, but can I get your number in case we get a sale that brings the price down? (This sometimes actually did work). His entire demeanor changed and he handed me paperwork out of his bag and showed me his Id. He was from corporate LP (loss preventions). Apparently my store ranked top in the state for \"excessive discounts\" and \"excessive waste\". He then hands me a document showing all of my \"friends and family\" discounts. So I flip open my phone (YES IT STILL FLIPPED) and showed him all the names on the list are in my phone, thus ARE friends and family. He thanks me and says he'll stick around to talk to my boss and one other team member. \n\nSince smartphones aren't really a big thing at the time, the LP guy starts talking to me about my job, and I ask him a little more about what exactly flagged our store. Turns out the other two people he wanted to talk to had more than 30% of their transactions marked with that discount code and our store seemed to \"lose\" lots of inventory. Store practice was that if you open an accessory and it was damaged  in shipping, you just throw it away and grab another one. Turns out there is a process you need to follow. He showed me the form and said \"you really should be between x and x a month to be considered average. \n\nHe then interviews my boss and co-worker who couldn't prove that their discounts were accurate and they were let off with a stern warning. From then on, I took on the responsibility of tracking inventory and warning the team when we were getting close to the monthly limit. Like a miracle, cases stopped breaking for the rest of the month with these announcements.\n\n&#x200B;\n\n\\[Fast forward\\]\n\nI open by myself again one morning. An older gentleman approaches me and starts screaming at me about being a \"heartless bastard\" and asking \"how the hell can you do this to people?!\". I look at him puzzled. \"Sir, I have no idea who you are, so you can't possibly be mad at me specifically. Lets go sit over there and have a quick chat\". As soon as we sit down I look at him and he starts crying and shaking. \"I don't know what to do. I'm gonna lose my house\". He goes on to tell me his son had gotten 10 \"free\" phones from my store and the monthly bill was roughly $800 plus tax. \"sir, if your son started an account with us, there is nothing I can do without him coming to the store.\" The dad shows me a photo in his wallet and explains that his son lives in a home because he's too old to take care of him. He's visibly disabled. He was already barely getting by paying for his house plus his son to be taken care of. My heart dropped as I figured out what had happened. My co-worker had sold the phones to his son while they were on a \"mall outing\" with his group home. \n\nFurious, I go back to the store and void the entire order. I instruct the dad to bring me every phone he can find. Anything not in the store that day would be marked as stolen. I write up the inventory report and mark all of those phones stolen for the time being.\n\nCo-worker comes in and I say, \"don't bother clocking in. I saw your order from last night. Just know that it's voided. If you pull ANYTHING like that again i'll make sure you're fired. Take the rest of the weekend off\". He argues for a moment, but leaves.\n\n25 minutes later (and early for his shift) my boss shows up saying he heard what happened. I show him all of the paperwork and explain what I did to solve it. Irritated, he looks at me and says something like \"you know you can't do that right?\". He then argues with me that I had no right to void the order and \"the contract was the contract\". Confused and angry, I say \"look, I will not sit by and allow people to be taken advantage of like that\". To which he replies, \"If you don't like the way we do things here, you can leave.\" Shocked, I walk back into the store where he tells me HE is taking care of all of the paperwork to \"fix\" my mess. Quietly I rip up my inventory report with a smile and tell him i'm leaving for the day. \n\nI call a friend who said, \"why don't you just get an IT job (what I was going to school for). He then calls a recruiter and sets up an interview for the next morning. Boss's little push gave me the drive to just go for it. I nailed the interview and get the job. My now ex-boss texted me shortly after and said \"Hey OP, you're late.\" to which I replied, \"no, I don't like the way you do things there\". Silence.\n\n&#x200B;\n\n\\[Fast forward a few months\\]\n\nBoth the boss and the co-worker were fired for theft. You see, with the unexplained \"missing\" phones and with no one watching inventory, LP quickly took interest in the store again. Turns out the \"broken\" cases were actually team members GIVING AWAY inventory to close sales. So when I was there \"balancing\" inventory and giving warnings, it was letting them know just how much they could steal and get away with it. Without me there they just did whatever the heck they wanted. From what I hear, they were escorted out by security and all. \n\n&#x200B;\n\nSo in the end, I was pushed to start the career of my dreams. They have a record.\n\n&#x200B;\n\nThanks for sticking with me, sorry it was so long.",
        "permalink": "/r/MaliciousCompliance/comments/s67vaq/if_you_dont_like_the_way_we_do_things_here_you/",
        "comments": [
            "I prefer the longer posts. Especially when they are as entertaining as this one.  Thanks for sharing.",
            "As somebody who use to work in retail for 10+ years you handled a screaming swearing person better than I ever could have. Good on you for saving that poor guy.",
            "Sounds like they got more bars when the interference was removed",
            ">  \"the contract was the contract\"\n\nThere was no contract, was there?\n\nYou would need a \"meeting of the minds\", and from the description, it sounds as if the people at the group home were not able to transact business on their own.\n\nIt would be like selling a phone to an eight-year-old: they're incapable of entering into legally-binding contracts.\n\n(At least, not for such sums. If it's like here in Germany, there's a \"pocket-money exception\" that lets them legally purchase things in the price range a child typically handles, e.g. buying a bottle of lemonade or a burger. But not a phone.)",
            "As the father of a 22 year old who lives in a group home and CANNOT control his spending I cannot tell you how much I appreciate your actions here. We have to strictly limit his access to cash because if has money, he will spend it. Mostly on snacks and video games and dvds.",
            "All it would take is for the father to go to the press, especially tv stations that focus on local issues and corporate would send people scarier than LP.",
            "*chefs kiss*\n\nBeautifully done my friend!",
            "I'll always stick with you bro, good story",
            "\"Hey OP you're late.\"\n\n\"No I don't like the way you do things there.\" \n\n*chef kiss*",
            "Reminds me of my husband's career story.\n\nHe was working a horrible, dead end job at a call centre answering calls for over 40 different businesses and was the ONLY person on his shift pattern that was experienced with all of them (yeah, he was there for too many years!). He loved IT but was totally self-taught and had no qualifications. Management at the crappy job basically tried to get him fired for fixing someone's computer in work time ( he worked nights). That someone was a frickin manager! Anywho, that prompted him to take a chance on an entry level IT job and ten years later he just got promoted to a role he still didn't think he'd get just a couple of years ago! So proud of him!\n\nThe old place? We were told they ended up hiring 4 people to replace him and today the company is less than half the size it used to be. Happy days :D",
            "You’re a good guy. \n\nBending the rules a little bit now and then, okay... but actually breaking them always gets you in trouble in the end.",
            "That was so interesting I couldn’t stop reading and not find out the outcome. It didn’t seem to be too long. Definitely held my interest. Good job on all counts…",
            "If the father had conservatorship of his disabled son, that contract was useless.\n\nBut even without that, you did the obvious right thing, and that makes me happy.  \n\nThanks for watching out for an often abused community.",
            "I used to work in a phone shop and these types of audit were called compliance audits, so this really is malicious compliance!",
            "HA...I used to do LP for a cell company back in the early 2000s...this brought back memories. Good on ya.",
            "I've never seen a cell phone store where some fuckery wasn't happening like this",
            "A few years back my wife and I upgraded phones and signed new contracts.  The store advertised that they would gladly recycle old phones in the proper safe environmentally friendly way and since her phone was actually broken we just handed them over.  I had wiped and locked mine cause mine was functional but hers wouldn’t charge because of salt water corroding the connectors.  I figured it was dead so why worry.\n\nTwo weeks later a woman calls me and asks for my wife’s unlock code.  So not only had the sales guys managed to get a charge into her dead phone and then sold it to this poor woman but they gave her my cell number to get the password.  Those are private.\n\nAnyway, they got in big trouble and I got an iPhone upgrade.  I also learned to always brick your old phones.",
            "Long?  This is a story sub.  Good stories are appreciated!  This was a good story and well written.",
            ">\"Sir, I have no idea who you are, so you can't possibly be mad at me specifically. Lets go sit over there and have a quick chat\".\n\nMan, you tai chi'd the shit out of that one. Gonna keep that in my back pocket.",
            "Reminds me of my previous job, I worked in the complaints team for a mobile service provider, and I often dealt with customers who have been misled about the price of their phone plans. Sometimes the system allowed us to apply discounts to bring the price down to what was promised, but if that wasn't possible, I would offer a lump sum credit equivalent to the price difference x 24 months (length of contract). So if it's a $10 difference, I'd apply a $240 credit.\n\nNow, I always investigated the call records to confirm that the customer's complaint was valid before applying any discounts or credits. The parent company wasn't happy with the amount of credits that were being applied and responded by reducing the amount of credit that I could apply to $49, anything more than that required approval from my manager. The parent company also required us to provide them with a report of all the credits we applied for auditing, which meant more time spent on paperwork. I got the feeling that the focus on reducing credits should be focused on the sales team that screw over customers, not the complaints team that has to clean up their mess.",
            "Beautifully done.",
            "Okay but what happened to the guy who was losing his house??",
            "[deleted]",
            "Ugh. I used to sell phones (think the Big Pink brand and the Big Yellow brand in the US) for an authorized reseller in the mid 2000s when I was in college. My store manager used to brag that when a customer was approved for 5 lines (the usual max) but only wanted one, he would open all 5 to get the commission (and stats for the store), then cancel the 4 unwanted lines before the deadline. Like. He openly bragged about this like he was proud. No idea how Pink and Yellow never caught on to that because he’d been doing it for years. \n\nThis is part of the reason I will still only go to a corporate-owned store for cell stuff.",
            "I used to work with people with intellectual disabilities, and I say a big THANK YOU for what you did!  Just because someone is of a certain age and doesn't \"look\" disabled doesn't mean they should be preyed upon.\n\nI love the example of what you did - you took the man and listened to him first, instead of trying to just get rid of him.\n\nIn my experience, some parents of the people I worked with went through the process to become their disabled sons' and daughters' guardians.  That helped a lot when this kind of thing came up.  Some people don't think these people having a guardian is a good thing for the person's sense of autonomy, but I think if it is sparingly used it can be incredibly invaluable.\n\nNo, this is not the same thing as what Britney went through!  All I'm saying is that sometimes this can be a very good thing.  Like with so much in life, it depends upon who the guardian is and why they want to be that for someone.  For most people with intellectual disabilities it's not done to get money from them.",
            "Congratulations on a sweet victory! Any idea what became of the old man and his son with the “free” phones?",
            "Holy fuck, after that, I’m surprised you didn’t call corporate about it. \n\nI’m sure they would have *loved* to hear about how your boss and coworker were totally fine with taking advantage of a person with disabilities.",
            "The staff at the group home????????  I've done that job and there is NO WAY I could have gotten my clients into that shit........\n\nAlso.....if the adult son was developmentally delayed /disabled, how was he able to enter into a binding, legal contract????",
            "He put ten phones on a person in a home. 10? I’d sue. That was definitely financial abuse.",
            "I’m pretty sure getting a signature on a contract from someone who is so mentally incapable of talking care of himself that he has to be in a group home voids the contract. Might be grounds for a lawsuit if the boss had actually tried to enforce it. So hopefully it couldn’t be reinstated etc.",
            "A similar issue of unconscionable conduct has happened here in Australia, where some franchise telco stores were connecting disadvantaged rural indigenous groups to multiple high end phones on expensive plans.\n\nThe result was a write off of all the plans and phones (there were many), a fine in the millions, and regular mandatory compliance training for anyone who has access to the telco's systems.",
            "Back in the eighties I worked at a electronics store who's owner was known as Cr\\*\\*y E\\*\\*ie.  The store had NO security or anybody watching the inventory. There were 2-3 guys who were moving more stuff out the back door than was moving out the front door if you know what I mean. VCR's, microwaves, stereos anything that will sell quickly.\n\nI only lasted there 2 weeks but it frustrated me that when a legit customer wanted to buy, let's say a VCR, we had none to sell. And since I was on commission I made no money. I managed to make in that time like $27\n\nSo I resigned and told my manager why, he flipped out and told me I saw no such thing which led me to believe he was in on it. I then walked out and they stiffed me on that paltry $27 they owed me. It put a smile on my face when the chain collapsed a few years later. I refused to work in some bullshit retail job ever again.",
            "If the disabled young man was not his own legal guardian, any contract he signed would be void anyway...",
            "> A contract is a contract\n\nNot true in this case. Anyone who is either underage, intoxicated, or mentally unsound cannot legally enter into a contract, and it seems that the person who was sold to was mentally unsound. (Which is to say you did good from both a moral and a legal stand point.)",
            "I love a happy ending.",
            "Good details and glad it worked out for you, since you were surrounded by sharks.",
            "This is what the the world needs.   Thank you.",
            "I fell like this is also an r/justiceserved story.",
            "I am proud of you for being a decent human being and helping that poor man.",
            "I am so very glad and grateful that you looked out for the intellectually-disabled man and his father that way. Well done. Thanks for being that kind of person. I have spent my life and career trying hard to help the marginalized and I so appreciate what you did there.",
            "I just got a warm fuzzy from this awesome story",
            "There was nothing malicious about that.   You did good bru.",
            "I'm pretty sure you can get in trouble for taking advantage of a disabled person like that. What a piece of shit, both of them.",
            "I love how you helped that man and his son.\nYou are an absolute legend and deserve every good thing that comes your way.",
            "You didn't have any fluff in there. It was just direct facts and backup stories for context. If anything that was really good writing and the perfect length.",
            "The old man's situation was heartbreaking, especially since the boss taking over your paperwork (and presumably sh\\*\\*canning it) may have meant the \"sale\" was never cancelled.  I hope someone eventually managed to void the deal.\n\nIt's not just retail.  I see so many people take advantage of people who can't properly make decisions that sometimes it simply hurts.",
            "Good for you!! I had a disabled aunt who lived in a home and went on these outings. In the early 2000s I was heading off to college and she tells me I can have her VCR because her new roommate has one that works better. I thank her and go to her closet to get the VCR. There were 3 large boxes with a high tech sound system (receiver, 6 disc cd changer, 5 surround sound speakers, and a subwoofer). I was livid and stormed off to the nurses station to find out who managed these outings. Turns out she had brought them with her a few years prior from a previous home. They had tried to track down any receipts or evidence of purchase so they could return it,  but couldn't find them. I kept those things for years and used them until they were completely obsolete. Still pisses me off that she was taken advantage of, but all I could do was keep them from going to waste.",
            "Excellent story, thanks.",
            "> So I flip open my phone (YES IT STILL FLIPPED)\n\nWell, TBH this could still be true. Samsung is bringing flip phones back with [Flip3](https://images.samsung.com/is/image/samsung/uk-feature-galaxy-z-flip3-5g-493886491?$FB_TYPE_I_JPG$) :P",
            "Great retelling of the story, nice work",
            "I really enjoyed this good luck with Your new job",
            "A good story, very well told. Thank you for this!",
            "Bravo.\n\nAnd for the record, those phone contracts were ABSOLUTELY void as the son will (almost certainly) not have had legal capacity to enter into a contract. So null and void from the offset. And coworker is a scumbag. I'm glad you helped the victim and his dad out.",
            "The disabled person may not be legally able to enter into a contract anyway.\n\nDad certainly isn't liable for his contracts in any event.",
            "You seem like an awesome dude(or chick)!  For all the mean people in the world, it's great to know there are people like you!",
            "You, OP, are/were a good and proper manager. I love this. Well done!",
            "Man, fuck mobile carriers and internet providers. They're the worst.",
            "The only thing I would have done differently would have been to alert the company fraud department to the transaction.",
            "There are so many gems in this long post. Thanks for being a person of integrity and honor. I've been developing software for over 25 years and it's been a great career. I hope it will be/has been for you as well.",
            "Nothing wrong with a long story! It was really well written, too, and easy to follow. I end up trying to decipher what people were trying to say from what was actually written far more often than I'd like. It was a great story, and I'm glad karma worked out in the end.",
            "Long stories are more entertaining.",
            "The dad received a monthly bill the day after the purchase?\n\nAlso, how spread out were your shifts that you were able to apply for a job, interview, and get a job offer before your next shift?",
            "That is so infuriating when people take advantage of others. There was a lady like that I unfortunately worked with at Macys. She had the highest # of store credit cards being opened in the entire state. Turns out she was TRICKING foreigners and teenagers in opening credit cards. She’d ask for their id and ssn, they’d ask what for and she’d lie and say that’s how things are done at this store if you want to buy something. Teenagers usually didn’t know any different and foreigners definitely didn’t know. When angry parents would come back into the store it’d be too late, the credit card was already opened. I had to take the brunt of the backlash and apologize profusely without having anything else I do about it. I complained to the managers daily about what she was doing and how illegal it was. They didn’t care because opening credit cards made their store look good. They let it go on for a YEAR before finally corporate got involved and she was fired. I felt so bad for all the foreign people who didn’t know what a credit card was (didn’t pay their bill because they didn’t know), teenagers who were clueless and just trying to buy 1 shirt. :/",
            ">They have a record.\n\nOnly if the company pressed charges.",
            "Sadly, store reps are infamous for ripping people off to get a sale / commission . When I worked for ATT , I was constantly getting calls from people who were screwed over at the store level. Stolen phones, broken phones, ridiculously expensive plans they didn't need.  It was so bad, I automatically scanned their usage and plan while we chatted. 75% of the time , the plans needed adjusted. One client was actually sold a phone sans charger! The rep insisted the charge cord cost extra! Ya, I sent them a free charger. Others would call asking for help with their phone not charging. After I walked them through cleaning their battery connectors and they declared I was an absolute genius lol they always , ALWAYS, told me the rep at the store told them their phone was toast and tried to sell them a new one. (Like OP, this was pre - smartphones lol and the batteries came out .",
            "Feels good.jpg\n\n&#x200B;\n\nahhhh justice!!!",
            "Congrats, you are awarded a crime buster award.",
            "Sounds like a cell phone booth I recall working in St Pete Florida some decades back... good on you for fixing what you could.",
            "Perfect length.",
            "Impressive.",
            "Are there other consequences besides losing their job?",
            "What a great tale. Thanks for sharing it.",
            "A read like this is not long at all. Well done!",
            "Thanks for doing the right thing. Glad you got out of there.",
            "It's savoury, but you came here!”",
            "OK. So what’s cool Mom!",
            "There is no way this is not an AT&T store.",
            "This makes me so sad. I work in a phone store and people put so much trust in me. I can’t imagine doing anything like that to people!",
            "LP guy really did go around checking other stores' prices? That's dedication.",
            "This wouldn’t happen to be the Sprint Kiosk at Town East Mall would it? Circa 2006/7?",
            "Aren't contracts void if someone isn't of sound mind?",
            "Wow, what a story. Thanks for sharing. So glad you were able to help that poor old guy. Really glad the two creeps were fired. Really, really glad you moved to the career of your dreams.",
            ">This is a little long. Sorry.\n\n>Thanks for sticking with me, sorry it was so long.\n\nIs this my long lost drunk Uncle Tom?",
            "Damn, people will really dig their own grave and hand you the shovel to bury them",
            "Good for you!\nThere was a post on here a few days ago that dealt with workers giving a “you need to do this or I quit” mentality. If you’re willing to make threats, then be willing to accept the consequences.\n That goes both ways, employers who do this kind of stuff should be prepared to lose good employees too",
            "Thank you for sticking up for the old timer. You saved his and his sons life by living up to your ideals.",
            "Not long, juuuust the right amount for that balance of quantity and quality. Well done.",
            "Isn’t it so satisfying to watch your ex-boss choke on their words which you fed back to them?",
            "Ugh. I used to sell phones (think the Big Pink brand and the Big Yellow brand in the US) for an authorized reseller in the mid 2000s when I was in college. My store manager used to brag that when a customer was approved for 5 lines (the usual max) but only wanted one, he would open all 5 to get the commission (and stats for the store), then cancel the 4 unwanted lines before the deadline. Like. He openly bragged about this like he was proud. No idea how Pink and Yellow never caught on to that because he’d been doing it for years. \n\nThis is part of the reason I will still only go to a corporate-owned store for cell stuff.",
            "Australia's largest mobile network, Telstra, were recently [fined](https://www.accc.gov.au/media-release/telstra-to-pay-50m-penalty-for-unconscionable-sales-to-indigenous-consumers) $50 million for exploiting first-nations people by manipulating credit assessments and signing them up to contracts they couldn't afford.",
            "Long but fun.\n\nAnd thanks for sticking up for the disabled.",
            "OP, how your co-worker manage to sell 10 phone to a disabled man without his family noticing the sale or that he have bunch of a new phone? I though scamming disabled people is a crime? how can your boss is ok with it?",
            "Long post, but good story. I don’t know you but I’m proud of you. It’s hard to do the right thing in a retail setting sometimes, especially when the “right” thing is not a black and white fix on paper. Good job, and take this story into your next interview!! A good company values integrity.",
            "[deleted]",
            "Need a TLDR",
            "You really should have checked with your immediate supervisor before voiding an order like that.\n\nBut they would have told you \"no\" anyway.",
            "the reality america had earnt for itself.    the land of milk and honey",
            "[deleted]",
            "Wow...some people",
            "Finally, some actual malicious compliance. Thanks for sharing.",
            "Fucking BRA-VO dude 👏👏👏👏",
            "Brilliantly done, OP.",
            "I’m just happy that man got to speak with you and not your boss or coworker",
            "I had the same type of job, working for mobile especially in a mall (I've worked both mall and brick and mortar) is so toxic. I'm glad I no longer work in that field.",
            "You write very well. Thanks for sharing!",
            "Wow what a story! I really glad there are people out there that dont worship the dollar and know when things are wrong. You even corrected the order of that poor man, GG!",
            "Beautiful is the only word that comes to mind",
            "Oh what a sweet dose of compliance",
            "That’s sad honestly",
            "The truth shall set you free!\n\nWell, this time. The world be a changin'.",
            "Absolutely fucking brilliant.",
            "Good on you OP, I'm glad you were able to get something better.  You deserved it.",
            "Any other time, I wouldn't have read this whole damn thing. But I figured out how to use the voice over feature on my phone. So, I can just have the phone read it to me.\n\nAnyway, congrats on the new position. It's always good when a bad experience at one job leads to a new job. Congrats again.",
            "No sorry dude, I love a Disney ending. \n     Jail woulda been nice tho",
            "That got my justice boner going.",
            "This sounds like some Best Buy Mobile shenanigans. I don’t know if it was just my store a decade ago or not, but shady practices ran rampant; especially by the lead managers.",
            "Sounds like the cow-orkers were a few bars short of a signal - but their new house had plenty.",
            "This was a long one but every beat was worth it. I hate to think the trouble that family would have been in if you hadn't intervened",
            "The ones that were stealing are lucky they were only escorted out by security.  They could have been escorted by the police... in handcuffs.",
            "Good read.  Glad you stuck to your principles and leveled up",
            "Love your writing style. Hope you're doing well!",
            "What happened to the older gentleman and his son, sorry I got a bit lost.",
            "Great story. Integrity wins in the end. I would have done the same as you with voiding that deal.",
            "Did LP ever het back in touch?",
            "Pretty sure that \"contract\" isn't enforceable."
        ]
    },
    {
        "post_id": "rus97a",
        "author": "None",
        "title": "I have to call in sick before 6 in the morning? Alright then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rus97a/i_have_to_call_in_sick_before_6_in_the_morning/",
        "score": 19578,
        "num_comments": 335,
        "created_utc": 1641182076.0,
        "selftext": "My job starts at around 14:00 usually that means i wake up about 9 in the morning. A few weeks back i woke up at 9 feeling sick and dizzy and throwing up. Went to bed fine the day before. Called work at around 10 and said i couldnt get in. Manager immediatly is like: our policy is to call in sick before 6 so you wont get your hours. \n\nMy manager arrives at the building at around 10 so it would have been impossible to call before 6. Anyways we also have to call daily to let them know if we are going to come in if we are sick. Next morning at about 5 i wake up and call. No answer (duh noones there yet) decide to call manager directly. She answers are groggily and is like \"what?!\" Me: yeah wanted to let you know i am still sick. Her: couldnt you have done that last night? Me: yeah but i could have been better this morning.\n\nNext day in do the same and the day after too. She then sends me an email explaining how the rules been changed and 10 is now acceptable.",
        "permalink": "/r/MaliciousCompliance/comments/rus97a/i_have_to_call_in_sick_before_6_in_the_morning/",
        "comments": [
            "I worked under a rule like this. I had to call my managers phone three hours before my shift…at 7am\n\nThey changed that rule quickly",
            "Amazing how Shit changes.",
            "If you make a stupid rule, you deserve to get beat over the head with it and have it used against you until you change it. Good job OP!",
            "Had the new boss say this when he first came to the shop. We reminded him that first shift starts at 5am and we would be calling out before the start of our shift and he said that's the way he wanted it. Ok, no problem dude. It lasted two weeks because our plan worked- we did a rotation of calling out sick which was 3-4 times each of those two weeks, calling him at 4am or earlier. He complained accidentally after the second call out so we knew it was working but we were suprised he lasted the full two weeks. He wound up being a really good boss after a few months.",
            "Just because calling in before 10 is now acceptable, it doesn’t mean that calling in before 6 is unacceptable seeing how it is still before 10",
            "Gotta love rules like these. I work night shifts at a hospital from 10:00 - 5:30 and I have to call in sick between 6:00 and  6:15 at the latest. So if I don't find out whether im sick or not in that 45 minute timeframe after my shift ends, I'm expected at work the following night whether im sick or not. Very sanitary and healthy when you work at a hospital, especially during these times /s",
            "Managers are great at changing inconvenient policies....when it inconveniences them.\n\n\nMy current workplace is trying to, for the 3rd time, make composite/steel toe shoes mandatory for our job. They are compensating us for the shoes but only from a specific website. The general consensus from all the workers are that they are highly uncomfortable and heavy, which sucks when you're on your feet for 10+ hours a day (when I was hired they even told us to get comfortable shoes and safety shoes were unnecessary). Well, guess how quickly the mandatory got switched to preferred once all the managers had to also wear them? Both times didn't even last 2 weeks and I don't see it being any different when the policy goes into place next week.",
            "I hope you got all your hours.",
            "If there's no way to leave a voicemail at the store, you did the only thing left available.",
            "> Manager immediatly is like: our policy is to call in sick before 6\n\nWhy would they even *have* such a policy in the first place if there's nobody in before 6 to call in *to*?",
            "Glad that issue got sorted for you...\n\nWhere I am, we have to come to work collect a form from HR, get the company stamp, take that to the clinic or hospital and get a stamp from the doc approving sick leave, then submit that form back to HR on the next working day. \n\nIf this is not done your pay gets docked. \n\nIt's not just my company though it's every private company in the country.",
            "Huzzah. What a dumb rule.",
            "Someone had to learn the hard way.  :)",
            "Had this policy at a place I worked. *was a great place and my boss was awesome management just sucked* got yelled at by hr for calling in at 3:30am, about 10 minutes after my boss would have arrived and unlocked the doors because shift started at 4am... so I started calling my boss directly at 2am and waking him up to let him know.\n\nMy boss was cool with this actually. What we didn't see was the quiet rage he directed at HR. After the first week we all had HR's personal number... she didn't have to be in until 8am... so the 3 or 4 of us that were sick called her at 2am this sadly lasted only 2 days before the policy was changed.",
            "Did you get your hours though?",
            "I’m so sorry you have to work for idiots like this.",
            "ours is an hour before or after your shift starts, and i imagine it's because of something like that. (granted, when i was in the hospital i gave my boss like, several days of notice once i could so i didn't have to text in every day)",
            "We're supposed to call in at least 2hrs before scheduled to start, which is actually reasonable-- management has a chance to call someone in to cover. My usual shift starts at 4:30am. Good luck getting anyone to answer the phone at 2:29am!",
            "I used to work somewhere where I started at 6:30 and I woke up with the stomach flu and called in around 6 and my boss gave me shit because apparently we were supposed to give two hours notice in order to find a replacement. Yeah sure let's start calling people at 4 in the morning and see how that goes...",
            "Former job they used to want an hours worth of notice before the shift but certain managers would answer (warehouse, lots of queen bees not enough worker bees) and throw a fit when you would only give an hours notice - my boss at the time being one of them. \n\nHe'd also try to guilt trip the people that busted ass compared to the average worker into coming in even if they were throwing up out of both ends offering you some Pepto - yeah, real bag of shit.\n\nDid something similar, called in super early on a Monday morning before they even opened the building. If the general warehouse phone rings to many times it goes to the overhead ringer and eventually to the DC Manager / Operations office phone for a voicemail. Left my call off message and made a comment about hopefully this is early enough notice for the call off, since the hour notice is not enough to prevent getting a talking to.\n\nTuesday when I came in the DC manager caught eyes with me and flagged me down to his office and asked what was with that comment about enough time since an hour is not enough. Told him how our manager and a few others give a little backlash if you call in an hour before the shift and want more notice. From the attitude with how our manager reiterated you only need to give an hours notice for call offs at the next pre-shift meetings I'm guessing the DC Manager brought it up at their morning update supervisor meeting.\n\nGuy was a bag of shit that lasted way longer than he should have. I walked into the offices and overheard him talking shit about me in the corner cubicle after I asked why these guys were taking another 30 minute break and I just wanted to get the shit done and go home (Came in that Friday at 5AM, it was now 3AM on Saturday). \n\nThe company merged with another which resulted in every store getting 2 of every major item in inventory, so after all the other departments finished their day and left, the shipping dock was buried in product - every store had a full trailer each Ropak triple stacked, pallets of oils / antifreeze stacked about a foot from the ceiling.\n\nThey ordered us pizza, so guess that was supposed to make up for the 23 hour shift.",
            "I usually take the: \"I'll show up and just puke on as much stuff as publicly as I can while making it know to the public why I am in that situation.\"",
            "Excellent",
            "Could also do it this way, want me to call the night before? Sure, if I het better by next morning I'll just enjoy my day off.",
            "One of the ways to change BS rules is to enforce them strictly",
            "Reminds me of when I worked at a university from 2pm to 10.\n\nWhen I came in, I'd always check with the office to see if there were any messages for me. After working there about three weeks I had a message to call a guy in HR.\n\nNo biggie. I called. was told he wasn't in, and left a message that I was returning his call.\n\nRepeat the same thing for two weeks.\n\nEventually, I asked the person answering the phone why I could never get ahold of him. \"Oh, he is semi-retired. He only works mornings.\"\n\nBlink.\n\nI tell her of my work hours (which they already know as HR) and say that I am never here in the mornings. Her response: \"Maybe you could call in the morning from home?\"\n\nDouble blink.\n\n\"I am not the one who is wanting to talk. He's trying to reach me. Maybe he should call me from home between the hours of 2 and 10?\"\n\n\"Um... I'll pass that on.\"\n\nNext day I get a call from someone else in HR who it's been passed to, was just a followup to make sure everything was OK.",
            "Meanwhile in Germany any of such rules would be null and void. When you are ill, you are ill. And company cannot opt to not pay you if a doctors writes you an attest. Any working court will give you the missing wage, and the company a hefty fine on top.\n\n\"You have to call before 6 am\" and if you have a car accident at 7:00? Or when no one is in the office? You jest.",
            "Lol! Well done JackeySparrow. I like you.",
            "As a leader always tried to think about how policy will blow back on me.",
            "Who are all these managers giving out their private numbers?  I’m 57 and worked most of my adult life.  I’ve never known a personal number from work!",
            "By law we have to call in sick as soon was we know that comming to work is not possible. That means if I wake up sick 20 mins before work, then thats when they get to know.\ngermany though",
            "We can just email because...yah",
            "One of my employers had an 8 hour rule. If you called in less than 8 hours before the start of your shift, they would also ask if you found anyone to cover your shift. If no, you'd be told to call back after you tried to find someone to work.  I'd tell them I don't know anyone's number to call and I won't be in. \n\nIf you were doing a shift swap and the person working your shift calls out, then you were responsible for either working it or finding someone to work it. This happened to me and I basically laughed and told them it wasn't my problem. I had already worked his shift, I was 150 miles away, and I needed to get back to the family event I was attending.",
            "Amazing how fast the rules change when those who make the rules are inconvenienced.",
            "We have to submit a sick day on our schedule app at least 12 hours prior, then find someone ourselves to cover it, then management still has to approve it. Problem is that nobody has their numbers listed in the app, so it's impossible to get ahold of anyone outside of the app, which people only use to check their work times.   \n\n\nWas forced to come in while sick on NYE and get shit on all night long, while running at less than half my normal capacity due to my head feeling like it was ready to explode.",
            "My current job has a rule for calling in 4 hours before your shift. For being sick this is fine. We just had a winter storm. My shift starts at 1400 and the storm went from 6AM- the next day 5AM. I went to work. The roads weren’t that bad. Omw home, the 35 minute commute, took about 1 hour and 15 minutes. It was not fun. Besides the fact my bestie also works the same schedule but in the next building over. So, we chatted on the phone the whole way. We have hands free. He got stuck in a ditch early on, on our commute home. I almost had to go get him but a plow was driving by and got him out. Thankfully. \n\nI just wanna know, if that storm was so bad and I tried to go to work but couldn’t make it… how am I supposed to predict that? The weatherman is always failing because of the lake effect we get from our Great Lake over here. He can’t predict it. How am I?",
            "The OP should keep calling at 5 in the morning till they get their hours back for the day they lost.",
            "This is amazing. What did she say the second and third time you called?",
            "My job has a 2 hour before your start time rule. Unfortunately I start at 5am so I have to call out by 3. But they need to find someone to cover me which is impossible at 3am so I have to call out the night before. If I don't call out by 7, then I ain't calling out",
            "Ah, the old “The stupid fucking rule can only change if it happens to be inconvenient for the boss”",
            "I used to work for a company in a city centre. The expenses policy was that they were only covered from the office onwards, which we all thought that was unfair as it quite often worked in the company's favour financially. \n\n\nSome time into my tenure there I was required to go to one of the clients sites twice a week, which happened to be a 5 min drive from my home. I of course expensed the milage from the central office which cost the company considerably more than if I had expensed from my home. Quite soon the expenses policy changed to be back in the company's favour.\n\n\nAmazing how quickly something can change when it's financially beneficial for the company.",
            "Yeah- my boss always said we had to give a 4 hour heads up at least. We open it 9. That means I had to call at 5am, but I get bad migraines that can sometimes come on super fast & out of nowhere.  \n\nBesides that- I don't usually wake up until 7 to go to work, so if i dont magically know i have a shitty migraine 2 hours before im even awake that sucks.   \n\nNeedless to say the first time I came into work looking like pure hell, and he was like 'WhY DiD yOu CoMe In iF YoU fEeL liKe ThAt?!' I got him to change that policy.  \n\nEdit: oof, I left out the best part- he's an old boomer, and so is his wife; so he never had his cellphone on that early. We'd have to call his HOUSE phone, and usually his wife would answer all groggy & mad- and she was super judgy about calling into work, so shed give all sorts of scoffing and attitude about it",
            "it was either designed that way so that it would make following the rules difficult, therefore forcing you to work, or whoever made the rules didn't use their brain.  \n\n\nalso, a set amount of sick days never made sense to me. If you're too sick to work, then you can't work. It's that simple. Literally no one can control that lol",
            "Had something similar. Was told zero remote/work from home (WFH) because company policy yadda yadda. Then it snowed, and everything was closed, guess who got to WFH? Would have preferred a snow day but oh well",
            "Had 2 supervisors at my insurance job allow us to text that we weren't coming in, which worked great for when I had a bronchitis flare up that turned into laryngitis so no voice.  Then we got a new manager who decreed no texts, only calls.  My supervisor ignored her until a nasty sup from the team over (that I had gotten into trouble for ignoring sexual harassment) decided to tattle and my sup got into trouble. At that point she had to obey but my team was so pissed.  We made that nasty sup miserable for hurting our amazing sup. 😈",
            "In the old days before I had a phone (yes, before I had a landline even), I had to go to a phonebooth to make the calls. I had to call in sick one day, and mustered the courage to do this one morning around 10 (crawl out of bed, put on some clothes, find some quarters, drag my self towards the phonebooth 3 blocks over). I got a strong reaction from the manager over calling in late, so I requested him to install a landline at my place (couldn’t afford it). He of course didn’t, but now understood I was making an effort.",
            "r/antiwork\n\nThis is a management default method used to make employees feel lesser.  If you aren't towing the \"give everything until you die\" line, you'll be criticized or punished.  Good on you for prioritizing your, your coworkers' and the public's health over her lack of morals, her ethical laziness and general ineptitude.",
            "No no no. You’re not supposed to follow the new stupid rule, you’re supposed to be frustrated, give up and get back to fucking work slave.",
            "Typical work environment.   Asinine rules that don't get changed until it affects management.",
            "That’s what she gets for being a bitch.",
            "Lol that's ridiculous! My old job required our staff to call in at least 2 hours before your shift, but if it was in the morning the earliest you could call was acceptable. we let people message in because it was easier :P",
            "Deadass when I call off its ten minutes before because before that I've been doing everything I can just to feel not sick anymore",
            "Yea, but are you getting your hours for the first day ?",
            "What did she expect? I don't get this at all.",
            "I had a job once where the policy was if you were sick and unable to work, they wanted you to call at least 4 hours before your shift started so they could find someone to cover your shift. Weekdays, that's fine- I works 2p-11p, so I was usually up before 10 anyway. But weekend shifts started at 6:30am. I woke up one Sunday with the flu, went to bed Saturday night feeling fine, woke up at 5:30 feeling horrible. I called my supervisor immediately, and her first response was \"you know you're supposed to give 4 hours notice.\" Yeah, I got \"scolded\" (for lack of a better term) at 5:30am for waking up sick and not informing her earlier.",
            "Where i work opening shifts for staff and management start both at 10 am. Management is routinely 30 minutes late for their shifts so when calling in sick it is 30 minutes past your start time.",
            "I was threatened with getting fired for gross misconduct for not telling them I was sick, I was working as a security guard 12-hour shifts, you couldn't leave until the next guard started, about an hour before my shift was due I started getting chest pains, I was in the hospital when I phoned, I didn't care when they threatened to sack me, I just said \"go ahead, I don't need this\" the Dr interrupted me so I didn't finish what I was saying, the Dr did say he would confirm I was there and what time I called the ambulance because I shouldn't be fired for potentially having a heart attack (it wasn't).\n\nIn a previous job I worked in a supermarket, the store was closed the staff including myself were all leaving, at the time I rode a moped, a car was parked with it's the engine running near the ATMs, the driver flashed his lights to let me know I could go, as I was level with the front of his car he drove at me, knocking me off the moped, he continued to drive over me before driving off, now this was witnessed by the staff leaving, the last few customers, and some members of the public using the ATMs, luckily two of them were off duty police, I was very lucky I suffered no major injuries, I was told to stay at home and get bed rest (different times), less than a week later my supervisor is ringing me demanding to speak to me, accuses me of swinging the lead, the hospital signed me off for a total of 6 months (it was reviewed every so many weeks), in the end I was bored at home, and my supervisor kept on ringing, I said yes going back early but on light duties, she didn't listen, within 30 minutes my back was gone and I was off for another two months",
            "crazy how all of a sudden then can change the rule because it’s inconvenient for them",
            "Acceptable but not required. I'd be malicious and keep calling before 6am",
            "If I remember right a place I used to work required 24 hour notice to not be dinged for calling in...that or like 8 hours? So yeah basically you had to plan I'm advance if you were going to be sick/deal with anxiety attacks",
            "lol my old retail job totally f’ed me over by refusing a really simple work adjustment request, after getting a note from my doctor saying if I didn’t get it I could not work because it was a health and safety hazard and an imminent danger to my health. Because they refused I took a 4 week sick line and also gave my 4 week notice. They would have had me till they went backrupt if they didn’t pull that move so I can only thank them, i guess.",
            "I have often found that following the rules exactly is a good way to get them changed.",
            "Did you get those hours then? Clearly she made this “policy” up by/for herself",
            "I worked at a grocery store for about four months during COVID. (I lost my job when we went into lockdown, and nobody but them was hiring, so the grocery store was my only option) Most days I was scheduled to start at 4am. I called in once and got written up the next day because I didn’t call in at least four hours before my shift started. That’s midnight! I’m not awake at midnight. Unless I wake up with a stomach bug half way through the night, I don’t know that I’m sick. I asked them how I’m supposed to know if I’m ill when I’m not awake, and they said I should call the night before. What if I’m not sick then? They just shrugged and told me not to be difficult. I’ve worked mostly as management the past twenty years, but at the grocery store I was entry level. They hated me because I pointed out how shitty their policies were, and all of their training deficits. My first day I walked around shadowing someone for *one hour* and then was left to my own devices. I figured out the ins and outs over the next month by getting in trouble. I’d get pulled aside and told you should be doing this, or you shouldn’t be doing this. Can you imagine learning your job by getting in trouble? It sucked. Every time I’d point out “if you are only going to train for an hour maybe you should write a list of do’s and don’ts and hand it out to new hires”. They’d roll their eyes, but fuck! That’s a really demoralizing way to train. The worst was when I got told I was too slow and would be fired if I didn’t pick up my time. I asked for tips on how I could pick it up, and it was then I learned the little computer we carried around to tell us what to shop could be paused between picking one item to the next! Seriously?! That doesn’t seem like info a new hire should know? I was literally the fastest picker after that because I got used to basically running between items trying to pick up my time. WTF! Sorry. I went off on a tangent. Lol",
            "Read the end of the first paragraph and was like \"well that's illegal\". Forgot that some countries don't protect employees the way we do.",
            "BWAHAHAHAHAHAHA!",
            "We're supposed to give 24hr notice of calling out, if we can't replace the shift, at my workplace, or get a write up. (The majority of the staff are teenagers and this policy is trying to discourage just calling off shifts. I am in my 20's.) This includes when you come down sick.\n\nI did it ONCE, three hours before my shift, and got massively told off. I had been working there for over six months and it was my first call out. I was dizzy and couldn't drive to get there, let alone drive home. I ended up having to get my parents to come and pick me up from wherever I was.\n\nSince I had such an over reaction for the first time I called in sick, the next time it happened, over 18 months later, I called in and cancelled the whole week. Then my doctor said I should take several weeks off with that I had (not covid!), and I happily called in and told the manager who had over reacted the first time. I produced all the correct documents for them, and then the government said those unvaccinated are not allowed to work. (Because of what I had, I was strongly advised not to get the covid vaccine yet, in case of side effects.) There goes another few weeks! The manager just about cried when I told her, as I have a reputation for extending any shift, and picking up lots of others, as well as working shifts no one else wanted in the first place.\n\nI ended up with about 9 weeks off, but my bank account took a massive hit as I'm a casual worker. Glad I'm still building a nest egg and living at home!",
            "[deleted]",
            "How quickly things change when they become someone else's problem.",
            "What's with all these places that don't just let you leave a voicemail on a call in line if no one answers?  Or even if there and the managers can just check it on a regular basis.",
            "Did you get your hours back, though?",
            "Take an extra day off just for the inconvenience",
            "I'm just wondering where you are that lets you call in 4 days in a row without a Dr.'s note. Most places I've worked needed one after the 2nd day off",
            "The policy where I work is you call in an hour before your shift starts. My shift starts at 6:30 and once I called at 5:35 to be sick and they said it was not an hour before so I was not paid for that day. Nobody checks that phone until 6:00 by the way.",
            "I work at night, 10 pm, I work only 5 mins down the rd… I usually wake around 9, we have recently been informed we are to call in before 8….",
            "10 is acceptable but didn't say 5am isn't still acceptable 😁",
            "At my place The policy is to call immidently you notice you cant work regardless of time we even have an emergency number that someone at The office are responcible to answer regardless of time of Day.\n\nDepending on time left before shift and degree of illness/injury one can still need to go to work untill they can find a replacement. \n\nThen again we are a public transport company operating a number of ships.",
            "My shift starts at 6am, but if we call in sick it has to be before 530am...was on my to work one day and got into a minor car accident. So I called at 545am and I got wrote up the next day for a no call/no show...",
            "Haha management are usually glorified babysitters with no skills",
            "Wasnt this posted just a few days ago????",
            "r/antiwork would love this 😀",
            "I have never understood this.  As a manager, I always fought the opposite.  I had an employee that would call or text my personal cell phone at 5 am.  I repeatedly asked her to wait until a more Godly hour of the day - at least until 7 as we didn't have to be at work until 8:30 and we didn't have \"subs\" or replacements.  She always said that she was up then so she may as well let me know.  OK...then call my work phone or email me.  I just wanted to know by the time I got to work, but I didn't need to know at 5 am just because you were up.\n\nAs an employee under this rule, I always went the other way.  If I \"lost\" my sick time because of some stupid policy, then I went to work sick.  Once, I passed the stomach bug to both of my supervisors.  Who knows who else paid the price for that one.",
            "Why can't you just send a text or email?",
            "Leave a voicemail.",
            "I I",
            "/r/facingtheirmanagement",
            "Almost like me inconveniencing you makes you able to rethink your “rules” , wow much unexpected",
            "same shit happened to me last month. Manager was all pissed off and saying how 'unacceptable' it was",
            "Dumb b****",
            "I wonder why this dumb policy existed in the first place.",
            "play stupid games...",
            "One of my bosses had the 6am rule, as our earliest shifts started at 7am. This led to people calling in at all times of the night and early morning, and in turn, the manager was calling to find replacements in the middle of the night. After one 2am phone call, that manager is now the reason my phone is on do not disturb from 10pm-7am",
            "At my job you have to call to hours before. I've always wondered what they would do if I called ten minutes before because I had started vomiting. How would they enforce that?",
            "My last job had a rule like this. We were to call in before 7:00am, anything after would be unacceptable and require a doctor's note. A friend of mine who also worked there decided to take it as literally as possible and called our dispatch office at 12:01 AM to say he won't be in in the morning. He got questioned about it. They asked why he was awake at midnight if he was so sick. Fuck that place."
        ]
    },
    {
        "post_id": "mrvy89",
        "author": "nategolon",
        "title": "Give me a hard time when I’m serving you and your friends? Okay",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mrvy89/give_me_a_hard_time_when_im_serving_you_and_your/",
        "score": 19561,
        "num_comments": 484,
        "created_utc": 1618547965.0,
        "selftext": "Years ago I worked at a busy, corporate sit-down burger restaurant. One day I’m hustling through the lunch rush and I have six college guys sit down. One guy flags me over and loudly pronounces that they’re ready to order right away.\n\n“What are you guys having?” I ask.\n\n“Guys?” the same guy says with a smirk on his face. “Guys? That doesn’t sound like a very professional greeting to me. I work at a restaurant too and if I walked up to a table and asked ‘What are you guys having?’ my manager would definitely let me know that was inappropriate.”\n\nThe other guys at the table look kind of uncomfortable at this exchange, and just silently sit there. The main guy looks around at all of them and keeps going.\n\n“Why don’t you come up to us again and do it right?”\n\nAt this point I’m looking around at my massive section of tables and getting the distinct feeling I’m going to be at this table forever. I’m trying not to lose my cool, so I smile.\n\n“Sure,” I say. I take several steps back and walk up again. “Gentleman, how you all doing? Ready to order?”\n\nThe main guy smirks and nods. I look directly at him.\n\n“How about you, Chief? What are you having today?”\n\nSome of the other guys laugh. He looks angrily at me but orders his burger and a drink. I get everyone’s order and hustle off.\n\nI return with drinks a little while later. I set everyone’s drinks down and do the main guy last. \n\n“Here you go, Boss.”\n\nI leave before he can say anything. Through the course of their meal I call him a different nickname every time.\n\n“You need a refill, Pal?”\n\n“How’s your burger, Buddy?”\n\n“Need more ketchup, Bro?”\n\n“Can I get that plate out of your way, Dude?”\n\n“Any dessert for you, Amigo?”\n\n“Need me to split your check, Brother?”\n\n“Make sure to leave me one signed copy, Muchacho.”\n\nSo by this time this guy is boiling. His friends are loving it though. As time has gone on, the rest of them keep looking at me expectantly. What nickname next?\n\nFinally, they all get up to leave. Lunch rush has ended and I’m chilling at this point. I casually walk up to them.\n\n“Thank you gentlemen for coming in.”\n\nThe rest of the group is smiling. I look at the main guy. \n\n“And you...you have a fantastic day...Hoss.”\n\nThe rest of the guys cheer. They all head out. I grab all their receipts on the table. Surprise, surprise, the main guy left me zero for a tip. I didn’t care. It was all worth it.",
        "permalink": "/r/MaliciousCompliance/comments/mrvy89/give_me_a_hard_time_when_im_serving_you_and_your/",
        "comments": [
            "He wasn't going to give you a tip anyway. At best it'd be shamefully small in order to feed his own ego.\n\nDid the others tip well?",
            "The arrogant guy was never a server, he was doing a pissing contest with op for no reason",
            "[deleted]",
            "“No thanks.  What are you guys having?”   People are such dicks sometimes.   His friends should have told him to knock it off.",
            "I am imagining the Canadian drama of “I’m not your pal, buddy.” “I’m not your buddy, slim.”\n\nReplaying over and over at the table.",
            "I was kinda hoping the MC when he told you to come back and try again; was to go to all your other tables first.",
            "If I was one of the other guys, I would’ve added his appropriate tip to mine even on the off chance that he would tip and to let you know that not everyone at the table was a prick with a complex.",
            "Not all rewards are financial.\n\nI don't get it. You would have to be pretty shitty at your job for me to not appreciate what you're doing. A real sit down meal delivered by someone who's at least acting happy to see me, rather than something plastic I pulled out of the microwave sitting in front of my compter? What's to not like about that? And to screw with the people that are handling your food is just, why would you do that?",
            "If you had thrown a *comrade* in there,   his head would have exploded.",
            ">\tThe main guy smirks and nods. I look directly at him.\n>\n>\t“How about you, Chief? What are you having today?”\n>\n>\tSome of the other guys laugh. He looks angrily at me but orders his burger and a drink.\n\nI can hear his ego deflating even from here.",
            "I have family that acts awful and abusive to servers in restaurants. I try to go early and talk to the server ahead of time and let them know that there will a big tip) proportional to how awful the fam behaves on that day).\nWhen one family member went \"Full Karen\" I tipped the server 40%.",
            "I'm a bar manager at a nice seafood restaurant in Ohio. I'd hire you on the spot if you'd told me this story at an interview.",
            "/r/TalesFromYourServer would love this.",
            "I “work in the same industry “ is a big red flag",
            "Great story,  bubba!",
            "that sounds like some shit that i would do. i dont have any serving stories that are too out there. I did have this one table that i clicked with really well. The height of their meal was after one of the women wanted a loaf of bread that we give for the table to herself instead of a salad or soup and the rest of her group and i gave her some “are you sure you’ll eat that” comments and i later came back with their entrees and she told that she finished the bread. I asked her if she was bragging or trying to impress me, and she played along saying that she was bragging. It was one of those ‘had to be there’ moments, but it is currently my fondest memory serving",
            "A burger and humble pie? Delicious",
            "Jesus Christ what cringe. If I was in that dude's party I'd have called him out like what the fuck.  Way to drive my social anxiety through the roof.",
            "> “Make sure to leave me one signed copy, Muchacho.” \n\nMade me laugh out loud, amazing.",
            "What a prick.",
            "Love it.",
            "Ugh, ‘can you try that again?’ Horrible. \n\nWell played my pal. Love it.",
            "\"I work in a restaurant, you have to talk to your customers this way because I also do it\"\n\nProceeds to leave no tip, universally known as the douchiest, shittiest thing you can do at a restaurant that doesn't involve physically attacking someone. And what's more, leaves no tip for what sounds like very solid service\n\nMake it make sense",
            "Excellent work taking him down a peg there, buddy.",
            "If i was his friend I’d tip the bejesus out of you",
            "It was worth it to see his 'boss' status going down in his friend group. But his friends suck too. They should have tipped for the show.",
            "He worked at a restaraunt himself and still left 0 tip. Guaranteed that guy still wets the bed or sleeps with a teddy bear or some shit",
            "I would have given them the ok, I will be back. And went and took care of other tabels for awhile. But well done.",
            "I had a friend of in high school who would give servers and wait staff shit all the time. She justified it because she was also a waitress. \n\n\nShe worked in a WAFFLE HOUSE! At any given time half your customers and half your coworkers are high and/or drunk. You don't get to look down on the server at Red Lobster for shorting you one cheesey roll, Karen.",
            "Had a few customers pull that “why didn’t you leave and start over” bs. No. Either let me know what you want or I’m not coming back.",
            "I would’ve upped the ante a bit first by going to another table to get their order and then circle back. Nevertheless a great way to put him in his place,",
            "Napoleon complex much?",
            "Satisfying story. Short and sweet with no harm to either parties and just laughs. He could easily laugh at it in a week or month too.",
            "Hoss as in horse?? I don't get it\n\n\nEdit: I get it now. Thanks everyone!",
            "This is when the customer is not always right and you should refuse to take their order at all. In a better world, there would be no repercussion for doing so. If you’re rude to my crew, you aren’t eating here.",
            "I hate to see a guy with \"little dick\" syndrome... But I love to put them in his place... Why don't you just cut it off",
            "He's the kind of dude that just watched American Psycho and didn't get that it was satire.",
            "This is Chad. Chad thinks it's funny to chastize food service workers and waste their time. Chad thinks it's cool to leave little or no tip to \"stick it to the man.\"\n\nDon't be like Chad",
            "When my dad and stepmom moved from the South into \"Yankeeland,\" she had a chip on her shoulder every time we went out.  Unless it's a place with $50+ plates, pretty much every restaurant up here addresses people as \"guys.\"  The third time we went out, the waitress started with, \"Can I get you guys something to drink while you look at the menu?\"  My stepmom barked at the waitress, \"Does anything about me look like a guy?  I am a woman and you will address me as such!\"\n\nMy dad looked at her and said, \"Guys is a unisex form of address up here.  Stop being so offended at everything!\"  He apologized to the waitress, who addressed my stepmom through the whole meal with an emphatic \"Ma'am.\"\n\nMy dad left a 20% tip, much to the chagrin of my stepmom.  Then, he handed me a $20, told me to go to the restroom, wait a couple of minutes so they can get out the door, then hand it to the waitress and apologize again for my stepmom's behavior.",
            "Oh I wish I'd been sitting with that group.\n\nMy reaction would have been to say, \"You know what he's having a rough day what with that stick shoved up his ass so far he can taste it.  So just ignore him, I'd like a cheeseburger medium....\"",
            "Why would he behave like that?\n\nVery enjoyable story. Thank you.",
            "Muchacho killed me. Well played OP. Love your work!",
            "Doubt he ever worked in a restaurant at all! No server would do that to another server! And yeah that's the best thing to do when you got one jerk in the group. Pick on him and make everybody else laugh! That's my favorite way to handle it! You did good!",
            "I own a resturant and I call guys dude all the time. Iv been in business for 10 years. If you were my staff I'd die because of this. Well done.",
            "I waited tables for a long time.  I love that story.  \n\nSteamingTheCat is right.  Some people start picking away at you about your level of service no matter how good you are at hospitality.  They can never be satisfied and they don't tip.  Because, you know bad service.",
            "Slam dunk.\nTHAT is how to keep your sanity and pride.\nBravo!",
            "“Sir, this is a ‘casual’ restaurant, so I’m going to have to insist you take that formal behaviour outside, pull the huuuuge stick from your ass so you can relax...then approach the table once more to bask in our fun-loving and casual atmosphere.”",
            "Ugh, if he worked at a restaurant as well, he wouldn't be a giant fucking tool to his server when he's out. Every restaurant worker I know is the least complicated patron ever. You would probably have to spit in their faces to get them to say something because they all know how much the job can suck. \n\nI really love your breakdown of nicknames in this. A mighty thesaurus of guys.",
            "They cheered?",
            "If he'd had any balls at all, he'd have tipped decent, for the effort and style you put into owning him.\n\nExcept he's a spiteful bellend about it.",
            "OP, you are a true champion. \n\nThe “Hoss”, on the other hand, without a doubt in my mind, has never ever ever worked in a restaurant. That entitlement just does not exist in restaurant folk (imo) or he may just be a verifiable sociopath.",
            "lol if he had told me to come back and try again I would have left, checked with my other tables and taken other orders, then come back a while later.\n\nGood for you, nice feel good story haha",
            "This is a god-tier response. On behalf of all servers, I salute you.",
            "100% this guy beats his dog and girlfriend. He's on a power trip and doesn't care who knows it.",
            "[removed]",
            "I was in a restaurant with 8 coworkers. One guy ordered the extra large version of the meal that was already the largest thing on the menu and a giant side. Then he ordered a diet coke. Without missing a beat, the waitress said, \"Oh, are you on a diet?\"\n\nEveryone at the table laughed. For the rest of the meal the waitress was charming but our friend was still mad and stiffed her on a tip. The rest of us dramatically over tipped and she probably made twice what she would have otherwise from the table.",
            "This is the best!  Good job OP!",
            "Nice one there, champ.",
            "This is the best I’ve seen yet. Go you!!!",
            "Hoss?",
            "A nice read there, bromie!",
            "Hoss.\nPerfect.",
            "Deliciously malicious.",
            "If I was in this group ( I wouldn’t be I don’t hang with jerks ) I would have lost it laughing at the main guy . Good job !",
            "Hoss. Perfect final jab.",
            "If I was there with that dousche bag, I’d tip you 50% just for the show, lol.",
            "Damn Skippy Ace",
            "That is hilarious. Might as well treat him like garbage when his demeanor indicates you’re getting zero tip anyway.",
            "The guy would instantly be punted out of the social circle, or at leas in so far as dining with us, including cookouts. If are rude to the wait staff you can eat a bowl of cold shit at home. And no tip? You will be made fun of, bullied, belittled, and shat on until until you willingly leave the group. Those things we do for friends, like job leads and references? Those stop too. Excommunication and ostracization.",
            "Hoss!! I love that shit. LoL",
            "That was extremely well done! You rock!",
            "Is the water wet enough, niichaan?",
            "As a Enlisted Marine( I got my dd-214 now) I am a civilian just like alot of you. I hated being called sir for awhile. Now I give no fucks what you call me. Being polite to a group of men and one man child doesn't warrant that attitude. But OP I admire the smartass in you. The world needs more people like you. And ladies don't find yourself a man child like that, red flags all over entitled brat there, and men ditch that MFR asap he will only drag you down. This has been my T.E.D talk thank you for tuning in.",
            "Shoulda hit him with a kemosaby",
            "\"Now why would you tell your mom about a giant robot, Slugger?\"",
            "Have a month in the lounge boss you deserve it.",
            "I was laughing all the way through reading that. Great post.",
            "A friendly reminder: Do Not Fuck with the one who brings your food they can do nasty shit in it and you'll never know.\n\nSincerely,\nA guy who works in food restaurant",
            "You have egg on your face, bae",
            "I wish I was there to see this, Has he been in since?",
            "😢such a beautiful short movie caught only in words",
            "Hahaha! Nice read, guy.",
            "Lord help me, so did mine....sighs....",
            "Give his drink a “tip”, and just the tip;)",
            "This might also belong in /r/prorevenge",
            "HA holy hell this was a great start to my day. Hank you for sharing this story, and keep up your somehow godly patience",
            "This made me chuckle. Good job, compadre!",
            "Excellent story Admiral",
            "Reminds me of the time I greeted the table with the same expression and a woman got pissed because she is NOT a \"guy\".",
            "Good story, champ.",
            "This made my morning!",
            "Don’t call me friend, pal.",
            "Reminds me of that south park episode \"I'm not your fried, buddy!\". This was hilarious 😂",
            "I was totally expecting \"Gaylord\" from the Dane Cook KFC sketch",
            "Excellent",
            "You are a goddamn champion, ese!",
            ">  “Guys?” the same guy says with a smirk on his face. “Guys? That doesn’t sound like a very professional greeting to me. I work at a restaurant too and if I walked up to a table and asked ‘What are you guys having?’ my manager would definitely let me know that was inappropriate.” \n\nWhat a weird fucking flex. Also, I doubt this asshat actually works as a waiter.",
            "this is the way",
            "Justice with a vengeance. Thanks hero. That sounded like fun.",
            "I would have given a $100 tip just for fucking with my friend. But I would have told that dude to shut the F up. I won’t be friends with asshats like that.",
            "I always get shocked that people are this rude i guess having worked in food I feel bad saying something when my order is wrong lol",
            "This made me giggle!",
            "Should’ve found out what restaurant he works gone and visit him",
            "Nice one, bucko",
            "OMG, that's awesome!  This guy expects fine dining treatment at a burger restaurant?",
            "My money is on the rest of the crew continuing that fine tradition with him for YEARS.  How many different nicknames will they come up with without repeating themselves is the real question.",
            "Heck yeahhhh! Good for you.",
            "That's amazing. It's just a shame he won't have learned his lesson after all of this, but maybe his friends will peer pressure him against behavior like that in the future",
            "I havent laughed like that in a while. Pure gold.",
            "I'm not your buddy, pal.",
            "Okay I love it, but I want to love it more. Please explain “hoss” to me?",
            "I feel this should be in a comedy show. It's pure gold",
            "Totally worth it",
            "🤣🤣Brilliant.",
            "Lmao this is awesome!",
            "Good shit, muchacho.",
            "Should have asked that guy - based on your experience, what’s the quickest way to deal with rude customers? Asking for a friend",
            "No kemosabe? Such a missed opportunity",
            "Hilarious!  Thanks for sharing.  I've had my share of rude customers in the service industry, too.  You handled it well.",
            "\\>and everybody cheered\n\nguys... c'mon",
            "Is there a reason all of these stories in this reddit are exceptionally long and drawn out or am I the only one who feels that way?",
            "Dude is acting all high and mighty while claiming he’s a.... waiter?",
            "And then the whole restaurant clapped",
            "Im guessing you're a guy? It wouldn't be right either way, im just wondering",
            "I call bullshit because you just had to say that everyone cheered.   \n\n\nThen the walls clapped.",
            "Sir, this was one of the best Wendy's stories ever!!!!!!!!!! Well done, and thanks for the laughs :D",
            "hey there buddy chum pal friend buddy pal chum bud friend fella bruther amigo pal buddy friend chummy chum chum pal i dont mean to be rude my friend pal home slice bread slice dawg but i gotta warn ya if u take one more diddly darn step right there im gonna have to diddly darn give u food and wowza wouldnt that be a crummy juncture huh? do u want that? do u wish upon yourself to come into physical experience with a crummy juncture because friend buddy chum friend chum pally pal chum friend if u keep this up then well gosh diddly darn i just might have to get not so friendly with u my friendly friend friend pal friend buddy chum pally friend chum buddy",
            "I’m from Detroit and moved to the deep south. Work in fine dining/craft yadayada. Made the mistake one time of telling a group of ladies at the bar ‘I’ll be right with you guys!’\n\nThey lost. The. Plot. Full on Karen ‘We are not MEN’ How DARE you?!’ My manager was awesome and glossed it over, good night. I have since learned the great southern way of ‘Y’all’. Gender neutral, everyone feels comfy, works well.\n\nWith my Michigan accent ‘Y’all’ does come out as ‘You-Oil’, but everyone seems to think that is charming, thank god.",
            "I’ve been a server. I know what the job is like. That was unprofessional. I know he was a dick, but it was. I get sick and tired of being called “honey” or “sweety” by female wait staff and cashiers, despite the fact that if I called them that, I’d be thrown out for sexual harassment. How hard is it to treat others the way you would want to be treated?",
            "I feel like I’ve read this before",
            "Where's the compliance?",
            "Is this real?",
            "Surprise surprise your pettiness got you no tip. much deserved.",
            "😂😂😂",
            "And unfortunately that loud guy will probably be a Senator someday.",
            "When I was waitressing, we used to hate seeing a group of frat guys come in. Every one of us would pray they wouldn’t sit in our own section. They were rude, demanding, and would monopolize the server’s time. How did we know for sure they were frats? By their calling card...the tip would always be four quarters embedded into the leftover slop on their plates. Real funny, eh?",
            "I'm sorry for mentioning Dane Cook but this just reminds me of one of his stand-ups, so OP would end it by, \"And you...you have a fantastic day...Gaylord.\"",
            "Saved the best one for last! The only one that might have topped Hoss would be Champ. :D",
            "The real question is how much the others at the table left for a tip.",
            "What does hoss mean?",
            "It's so weird that someone would be irritated by that (all the names). It's pretty funny.",
            "Well done, Nate 🤣",
            "You had me at muchacho",
            "Yeah I served for like 10 years. That’s dudes water would have been in his lap after I “accidentally” set it on his fork and it spilled.",
            "This reminds me of my time in the food and beverage industry.",
            "Having been in the industry previously, it is and was 100% fucking worth it.",
            "I didn't see anything wrong with the way you greeted those guys. What's more, if I were with someone who reacted that way to a simple greeting, I would leave and not want to eat with them. On the very rare occasion that I have encountered a rude host/wait-person I don't chastise them, I just leave.",
            "Please tell me you smeared some fromunda cheese on his burger.",
            "Omfg that is so great. 🤣🤣🤣 I would have loved to see that!",
            "Fuck that guy.",
            "I've never been waitstaff, but have known too many who are.\n\nFuck that dude.  You might get chewed out for that at a high end place, but a burger joint?",
            "Who the fuck is this monster and how does he exist?  Is he like the antagonist jock from a 90s teen movie?",
            "What did the other guys leave you? If I was one of his friends, I would have stomped him a new mid bike in his ass before letting him tip nothing.",
            "I would love to have seen you come back with \"I'm so sorry, what pronouns do you prefer?\"",
            "I don’t understand people who are rude to servers. If i was at that table i would be pissed thinking i’m going to but into a giant lugie bc of this guy",
            "I used to bartend and serve at a pretty busy place in Atlanta. One Saturday, I was slammed and I walked up to an older woman and her daughter and said \"Hey, what can I get you guys?\" and the daughter (probably in her 40s) said \"Uhh, we aren't GUYS.\" Her mother (70s-80s) cringed at her saying that. The lady was offended by my use of \"guys\" that she left the restaurant.",
            "I would have said ladies. What are you ladies having?"
        ]
    },
    {
        "post_id": "czoueg",
        "author": "NylakOtter",
        "title": "If you want me to talk in front of people, I'm bringing my dog. And human remains.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/czoueg/if_you_want_me_to_talk_in_front_of_people_im/",
        "score": 19548,
        "num_comments": 520,
        "created_utc": 1567622073.0,
        "selftext": "So, I've spoken about my dogs on here before.  I train search and rescue/human remains detection dogs, which basically means we wander around disaster sites, crime scenes, and wilderness area searches looking for bodies or other remains, to put it very simply.\n\nThis story is a couple of years back.  When I was in college, I was required to take a public speaking course.  I have stage fright and social anxiety, so this was basically torture.  My instructor was pretty jaded, and didn't much care that I was having a panic attack on stage.  She suggested I talk about something I'm more comfortable with, and to toughen up.\n\nThe final was supposed to be a demonstrative and informative presentation, and 30 minutes long.\n\nFine.\n\nMy dogs have clearance by campus police to train on the university grounds, and I have clearance from city and county police to bring bio waste materials with me throughout the county.  I prepare a fancy Powerpoint presentation, and bring in my big, crazy cadaver dog and scent samples, including a human toe, blood, and bones.  I spend half an hour showing how to train a dog to detect human corpses, along with a few vivid anecdotes about some of my past searches.  We even let some members of the audience come handle my dog and give clicker training a try (audience involvement in the demonstration was required).\n\nI got an A, but the mildly horrified look on my professor's face was far more rewarding.",
        "permalink": "/r/MaliciousCompliance/comments/czoueg/if_you_want_me_to_talk_in_front_of_people_im/",
        "comments": [
            "> audience involvement in the demonstration was required\n\nWhat you did was way classier than hiding a piece of the body in the room beforehand, then telling everyone at the 28 minute mark and promising a prize to the lucky guest who happened to find it under their chair.",
            "That's a presentation I would have paid to see.  Well done.",
            "I think the funniest part of this story is that the teacher gave some actual good advice, OP followed said advice and gave a great presentation.",
            "[deleted]",
            "[deleted]",
            "Yeah, who wants to hear yet another another rinse and repeat speech about common topics. I would have definitely learned something and been horrifiedly interested.",
            "\"Excuse me; wipe that look off your face and toughen up!\"",
            "OMG I was just telling one of my kids about your impromptu AMA in a comment thread! That was such a blast to read. You are a very engaging writer!",
            "Were you not expecting to have to speak publicly in a public speaking course?",
            "I know the professor was a bit salty, but it WAS a public speaking class, and when it comes to people who actually ever WANT to speak in public... Well, I'm guessing it's close to zero.  I could see as where a certain amount of saltiness could ensue for the instructor of such a class.\n\nAnd are you the girl with the malicously complying dog?  The one that wasn't supposed to alert on cadavers, so just... Stopped...",
            "Where do you get human toes from?\n\nAsking for a friend.",
            "Without any context, when I read the title all I could think was this person took their dog and dead bodies everywhere they went where they could encounter people.",
            "Wholesome malicious compliance",
            "In my head it happened like this:\n\n\n*turns to professor while setting up*\n\n\n“Here, would you mind holding this for me?”\n\n\n*hands professor jar with floating severed toe inside*",
            "[deleted]",
            "Good work!   \n  \nI used to be pretty shy about speaking. Then I moved to a new area and joined my community's board as their secretary. After 2 years of enduring the bitter infighting and vicious personal attacks from the cynical jaded hippies on the board, I had no more fears of public speaking (and no more desire to be anywhere near Robert's Rules of Order).   \n  \nMuch later at university, we were each taking turns giving presentations about our research to our class and professor. After me, one nice guy was presenting, and fumbled, lost his train of thought, and froze, sweating profusely. He literally just froze like he thought our vision was based on movement and if he didn't move we wouldn't see him. Never witnessed that before. The prof lobbed some softball questions at him and eventually we got him rebooted and on with the presentation.",
            "Dude, glad you aced it! Seriously, go with what you know on speeches. I would also like to add I would have paid to see your speech, too. Love the malicious compliance.",
            "My speach teacher stated the crazier the topic and props the better i would love it.  \n\nPs, i would have loved your speach.",
            "Who’s toe was it??",
            "[deleted]",
            "OP learning to do public speaking is a good skill to have, don’t fault your teacher for making you go outside of your comfort zone.",
            "The professor was just doing her job. \n\nThe assignment is public speaking. It's part of the grade. It may be harder for some people than others but that's the point. She wasn't being jaded, she was just tired of hearing excuses not to do something required for the course. \n\n*And* she was very helpful in giving you advice to overcome your fear which is going to be very useful when you may be called unexpectedly to speak and absolutely have to do it. \n\nScared of interaction is no way to go through life and this example paints her unnecessarily harshly.",
            "I'm happy to see you were able to overcome your stage fright, even for a little while.",
            "Honestly tho that sounds really cool - I’d pay to see it.",
            "As a professor, this is exactly the stuff I love to see!\n\nWhen we are getting you to give presentations and talks our aim is not to torture you. It's to get you more comfortable with giving talks, ready for whatever real world job you may end up doing. Maybe one where you have to show to team members, superiors, interested passing mammals, and interns, just what your work has been about or how things should change. \n\nIn my opinion you nailed it!\n\nSeriously, if a nervous or shy student comes in and gives an engaging presentation about their dogs, I'm giving them a high mark on that assignment. Even if it was supposed to be about the Abyssinian war of 1868.",
            "So what your saying is.....the professor was right",
            "Good grief, this is what I'm talking about when I assign my conversation class students their final presentation of \"Teach Us to Do Something Important to You\". Yeah, it's fun to learn to make guacamole, but I want to learn how to train a cadaver dog, dammit!",
            "I feel you OP I twice failed required public speaking courses due to nervous breakdowns the day of the presentation.  I ended up just begging the professor to let me off with a passing grade for all the work I did taking the class twice, so I could graduate.  \n  \nApparently I had improved my speaking skills enough to beg effectively.",
            "You know she won, in the end being a good teacher, right?",
            "malicious compliance because you took a public speaking class and had to speak in front of people? wow. your professor really asked a lot of you.",
            "How did you become a search and rescue person? What prompted you to train your dogs to be search and rescue/human remain finding machines?",
            "I saw a terrific presentation by a cadaver dog handler at Bouchercon (world mystery convention) in Alaska a few years go. Great stuff!",
            "Honestly, it sounds like you had the best presentation of the class.  I would love to see your presentation on a TED talk.  Peace sister/brother!",
            "Not applicable to your story but as someone with stage fright and social anxiety Karaoke is super great for helping get over it. At least, it helped me a lot. Once I got comfortable singing karaoke I realized I was much better in front of people all the time.",
            "how is this malicious compliance? you did what was asked",
            "I love dogs and study osteoarchaeolgy (archaeology of human bones)... I wish I could have been in that class!",
            "Sounds like you were able to really get over your apprehension with public speaking, at least for that day. Up to you how much credit you want to give your professor, though. Good job and congrats!",
            "Sounds like you did a good job. You ... *puts on sunglasses* .... Killed it!",
            "Sounds like the teacher did you a favor",
            "Love it !!\n\nLong, long ago, my first employer believed in up-skilling, so had us do in-house courses.\n\nMy wry take on 'How To Write Concisely' passed into legend, but 'Give a Talk' was hard.\n\nI'm a technical sorta guy. My first, so-carefully prepared presentation lost my 'preview' audience about a dozen words in.\n\nI'd spent a week crafting that first take, had less than twenty minutes until the 'real thing'. What to do ?\n\nInspiration struck. \n\nWith but a few, scribbled work-flow notes, I cheerfully explained how to home-brew, clarify and bottle five gallons of good beer for Christmas...\n\nGot cheers, an 'A', plus kudos for swift 'Change of Plan' after that initial disaster rather than digging my hole even deeper.",
            "Sounds like you conformed to the letter of the of the request of the college and did a fantastic job. A good public speaker knows how to keep an audiences attention and you nailed it!",
            "I don't see the malice. Plus he helped you work towards getting over your issue. 🤷‍♂️",
            "sounds like your professor was right and that by speaking about something you were comfortable with/passionate about you overcame your fear enough to give a solid presentation so much that you got an A? maybe even your previous speeches in the class helped gear you up for such? your professor’s horrified expression would the expression expected from a good presentation on the topic. she wouldn’t have given you an A if you stood up there and sucked. this isn’t malicious compliance. you followed a professor’s advice and got better at something. *it’s called college.*",
            "I was in a similar situation, what I did was a presentation on power metal, with plenty of clips from music videos showing sweaty shirtless dudes. She was extremely catholic, she was horrified at the noise and shirtless dudes, but whenever she interrupted me I asked her politely to let me finish my presentation and that I will take questions afterwards.",
            "We had a demonstration at my college campus with like 6 cadaver dogs and a demonstration with human bones. It was hands down the best demonstration I have ever had the honor of seeing!",
            "Not gonna lie, the teacher was probably happy you took her advice and did well",
            "Other headline, Teacher gives feedback to student. Student listens and has a successful presentation.",
            "This would have been fascinating! Id love to learn more, if youre willing to public speak again (via reddit this time)",
            "I thought you were going to say that you let people play with the severed toe.",
            "A 30 minute speech? Jesus. I don't even see how that's possible if your class had as many as 10 students in it.",
            "Who the fuck has 30 minute presentations in a basic speech class... I think mine were specificlly stated to be between 4-5, 6-7.5, and 9-10. I could never imagine having to do a 30 minute final for a comms 101 class haha.",
            "This sounds less like malicious compliance, and more like just an awesome presentation",
            "Let's just hope your dog doesn't find the body that toe, blood, and bones came from or you might be presenting in front of court.",
            "How did you get into it? Cadaver training, I mean. I’ve always been fascinated with S/R and cadaver dogs. But I never could figure out how to get into it.",
            "This doesn’t sound like malicious compliance. It sounds like a good professor that gave reasonable advice that worked.",
            "id been all up in that presentation. sounded really cool",
            "Do your dogs like being given bones when not in duty",
            "I don't get how giving an unusual presentation because you're more comfortable with it is MC. Like it's not bad as just a story, but I don't know how well it fits here.\n\nAlso one thing that's bugged me on my first read through, 30 minutes? Was this an individual presentation? Assuming that class met 3 times a week, that would likely mean the final took 5 weeks.",
            "Hey! I did my undergrad thesis on cadaver dogs like a million years ago.  They’re so amazing!",
            "\"You look mildly horrified.  Perhaps you should toughen up.\"",
            "I'mma be honest with you, as a teacher and former college lecturer, I stand by this professor's decision. You gave an awesome presentation and had to overcome your stage fright to do it.",
            "That's super cool and I would love to hear this presentation with special guest detective dog.",
            "Were they actually bothered by it or were they just happy  you did the assignment",
            "I just spent way too much time reading your responses in this thread and the other story about you accidentally finding a body.\n\nI'm on the Kansas side of Kansas City myself. :D\n\nHave your dogs ever messed up evidence while finding a corpse? Like moving or biting the various pieces, especially if it was a gory dismemberment scene or something?",
            "I hope someone video taped this",
            "Hey kids! \n\n# Wanna see a dead body!?",
            "r/normalcomplianceyoushouldthankyourprofessorforthemotivationtobeatyourfear",
            "Great! =:D",
            "I was in the same situation years ago, had to give a fonal speech that was a demonstration and had audience participation... so, I proceed to give a rundown on beer pong the various \"house rules\" that people play by, etc. I then pulled out a classroom table and produced cups and balls from my bag. my friend was in on it, and immediately got up and locked the classroom door as I pulled out a 12 pack of High Life and started to pour. luckily, the professor was pretty cool, and he even joined in when we started playing. all in all it was the best presentation I have ever given",
            "That definitely beats my public speaking experience! Good for you!",
            "I’m not going to lie, that sounds super cool and I would love to have seen that",
            "I am glad you got the presentation done. I would have liked to see your presentation. As to the teacher looking horrified, that is HER problem.",
            "Your school allowed you to bring *human remains* including blood and a human toe on campus?  Is this not a health concern/hazard?",
            "I was worried while reading this that the professor failed you under some obscure rule, so relieved you got an \"A!\"",
            "I would find your presentation fascinating.",
            "Thank you for your work.",
            "Its like hey sorry if what I’m comfortable with makes you horribly uncomfortable",
            "I have a similar story. We had to do the exact same thing. I dont do well with public speaking so she also suggests i do something I'm comfortable with. I was going to school for culinary arts. So my presentation was on sharpening knives. Shes like ok but get clearance to bring knives in...lady I bring my knife roll in everyday, its literally required...",
            "You're kind of painting your teacher as the asshole (and maybe he was), but it feels kind of clear was right. He pushed you to find a way to do something you thought was this huge obstacle, and you literally overcame it by following his advice.\n\nI mean, unless I'm missing something, I feel like you learned something thanks to him. And you did a great job presenting, so you should feel thankful",
            "Its the presentations people are really into that are always the best. This is a good one.",
            "That's not even malicious, that's awesome!",
            "So this song wasn't out at the time, but it would have been amazing to walk in to [Cadaver Sniffing Dog](https://youtu.be/YhWmbViBAxg) playing.",
            "My presentation was on how to shot darts. I unnerved a few people, but I’d have loved your presentation",
            "we demand to see the dog",
            "I wish presentations were done like this more often. Instead of 'give a 5 minute presentation on this subject,' why not 'give a 5 minute presentation on what you are most passionate about?'",
            "This is just fucking awesome. I wish I could’ve sat in just to learn more!",
            "That would be a super fun demo to watch.",
            "I feel envy for those who attended. I'd love to know how those dogs were trained. If such a profession existed where I live, I would have definitely studied that.",
            "I wanna hear these vivid anecdotes",
            "So is what my law enforcement professor said true? A cadaver dog can only smell 8 feet deep.",
            "Damn would have loved to be in the audience!",
            "How is this malicious?",
            "I would barely even call this malicious. Definitely far past what was expected, but this is the kind of thing people watch educational reality shows and documentaries for. People are going to remember your presentation and talk about how awesome it was for the rest of their lives.",
            "Part of me was hoping for weekend at Bernie's: the college years.",
            "You played right into the professor's plan. This is exactly what they asked you to do. It's a good way to learn public speaking.",
            "Well done to you! I also suffer severe anxiety about public speaking, so know just how hard it is to overcome this fear. I’m very relaxed talking to people one to one, but tell me I have to talk in front of a group and I go to pieces... this has definitely held back my career sadly. I’ve got slightly better over the years - I’m very good at my job, but I’ll only ever progress so far because I don’t want to give talks/host meetings etc.\n\nPs I would have loved to see your talk 😁",
            "Puplic speaking is super unnervying for anyone that doesn't have lots of experience with it and even then its not super comfortable so congratualtions on getting it done and scoring an A",
            "I love you for this. I wish you all the best. Have a nice day and more to come.",
            "Wow, I think you just gave me new life goals. I definitely want to be around pit bulls all day, and I'm not squeamish about bodies luckily. How did you go about getting into your field?",
            "do you ever walk them past a cemetary?",
            "This fits more on /r/ProRevenge",
            "Just wondering, where do the human remains come from?",
            "Sounds like a fascinating profession. Can I you got into that line of work?\n\n(I myself am *done* with my current industry and am looking for uncommon, unique job positions)",
            "Boy I wish I could've seen the look on that professor's face, it would've made the anxiety well worth it!",
            "[deleted]",
            "This is absolutely beautiful.",
            "This is an amazing response to a jaded teacher. I appreciate all of it and I envy the class who got to see such a presentation.",
            "Public speaking is one of the only important Gen Ed's. Don't hate on your professor for making you face your fears",
            "That sounds fascinating. Did you record it, by any chance?",
            "Haha! That sounds incredible! I wish I could have seen your presentation!",
            "will be great for bring your dad to school day. Dont change the presentation at all for the 2nd graders",
            "In high school we had to read a chapter of a random book in English (2nd language for me) and talk about it in the beginning of every single lesson in front of the class. \n\nI have really bad anxiety when I have to present something nor did I like the teacher much so for half a year all my classmates and teacher had to hear stories about serial killers, chapter by chapter. The teacher wasn't amused, lol. \n\nI'm not that interested in that topic, it was really just to horrify the teacher.",
            "I call that a win-win.",
            "I really respect you OP for what you do. It's an important job.",
            "Is this malicious compliance? Because it sounds like you took a public speaking course, were anxious, and the professor assisted you with finding how to be confortable speaking in front of a group by using something you are interested in.",
            "I'm so glad I wasn't in that presentation. Well even if I was. I wouldn't have been there in mind for long, by the time you have told me why the dog does I would have been lightheaded (even now I am slightly) and when I realized I am in a room with human remains fresh enough to smell,  passed out",
            "That makes the A much more sweeter",
            "Man you're so unique!!",
            "If you were able to convince me that what you were showing me was an actual severed human toe, and quite frankly, I don't think you could because I don't think I would have believed it no matter what... but if you did convince me I would have thrown up on the spot.  To be honest, I'm borderline just thinking about it.",
            " \n\n⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆  ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀  ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀  ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉  ⠄⢸⣿⣿⣿⡇⣏⣾⡞⡯⣥⣽⣷⡘⢶⡀⠡⣌⡔⢣⣿⣿⠄⠄⠄⠄⠄⠄ ⠄⢸⣿⣿⣿⣷⢹⡖⠬⣚⣛⣯⣭⣛⢂⣙⠦⠈⡇⣾⣿⣿⡆⠄⠄⠄⠄⠄  ⠄⠘⣿⣿⣿⣿⢰⣾⣿⣿⣿⣿⣿⣿⡼⣿⣿⣷⡆⣿⣿⣿⣧⠄⠄⠄⠄⠄ ⠄⠄⣿⣿⣿⣿⠘⡿⢛⣿⣿⣿⣿⣿⣧⢻⣿⣿⠃⠸⣿⣿⣿⠄⠄⠄⠄⠄  ⠄⠄⣿⣿⣿⣿⢀⠼⣛⣛⣭⢭⣟⣛⣛⣛⠿⠿⢆⡠⢿⣿⣿⠄⠄⠄⠄⠄ ⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄  ⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄ ⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄  ⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄ ⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄  ⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄ ⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄  ⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄ ⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄  ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠄⠄⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⣿⠁⠄ ⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠄⠄⠄⠄⠄⠸⣿⣿⣿⣿⣿⡿⢟⣣⣀⡀",
            "As someone who works in a position where public speaking is not necessary and never will be, I like this story. Public speaking is another money grab by universities.",
            "Dog names? Boy or girl (asking about all dogs)? If ok with you",
            "30 minutes long?? Dang! I don't think TED talks are even that long!",
            "Sorry to ask a question that im sure has already been asked, but im shit at searching for the answer :p\n\nWhat breed of super pups do you work with?",
            "I want to be a death investigator and I absolutely love dogs so I would have died to see that. Anyway I could get a copy of your PowerPoint?",
            "This is a cool job... I'd have loved to see your presentation!",
            "Lol you're a fucking child, OP.",
            "[deleted]",
            "Did you get kinda close to her to show her some remains and then when she got squeamish laugh at her and tell her to toughen up??  😈😈",
            "Sounds like a fun presentation. I swear stuff like this is what made school bearable.",
            "Okay, that's it! I want us to be friends now! This is the second post of yours I've seen and in this whole reddit hurricane I've remembered you.\n\nPlease be my friend, \n\nLove,\nAlso mental health issues, animal loving girl.",
            "youre a fucking loser lmao"
        ]
    },
    {
        "post_id": "sdca9i",
        "author": "Warlandoboom",
        "title": "Lady Demanded I Set Up Her Apple Watch",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sdca9i/lady_demanded_i_set_up_her_apple_watch/",
        "score": 19524,
        "num_comments": 408,
        "created_utc": 1643220519.0,
        "selftext": "I sell phones and everything that goes with phones in a retail setting. The job has gotten frustrating because the people who still go into a retail store are often just people who can't figure out how to work a website and won't bother to read anything. This is true for my customer the other day.\n\nThis woman comes in and buys an Apple Watch and wants me to set it up for her. I'm more than happy to do so, but it really just boils down to her needing to configure it to her specifications. Things like deciding which wrist it'll be set for. The lady demands I just do all the set up for her while she gets coffee. I insist she stay because it's going to ask her things that I can't answer if she's not there. She blows me off and tells me to just do it and she'll be back. I set it up and just guess what she wants. When it comes to her height and weight I put 6'2'' 385lbs, and set it to notify her about her daily workout progress as much as possible. She's probably more like 5'5'' 130lbs. \n\n\nShe came in mad that her watch keeps calling her fat and telling her she needs to walk more.",
        "permalink": "/r/MaliciousCompliance/comments/sdca9i/lady_demanded_i_set_up_her_apple_watch/",
        "comments": [
            "Also set the reminder to “Breathe” to go off with the regular rhythm of breath.",
            "I had people ask what 'click here to change your password' meant. Many times a day. You are not alone.",
            "You should have set the watch to remind her to set up the watch every fifteen minutes.",
            "I think I would have changed the language.",
            "Lol. Great malicious compliance.  I swear people just get lazier and lazier.  Recently had someone walk up and ask for an interview with one of the senior managers at my worksite. I asked if he had an appointment but the guy hasn't even done an online application or submitted a resume.  When I told him he couldn't get an interview without doing this he whined that it was too complicated to create a resume or a profile.  The position dude wanted was for an open spot in the group of engineers they have on-site. \n\nIt's really hard to keep a straight face when telling them that they have to get in their grow up box and comply with company standards before you can be considered for a job.",
            "This story is oozing with maliciousness, I love it. Great lunch time read OP.",
            "This is why when I worked in the squad we openly said we will not set up phones or smart watches for anyone. Too much info that is almost entirely personal",
            "Totally laughed at this one, would have done the same 😂",
            "\"She came in mad that her watch keeps calling her fat and telling her she needs to walk more.\"  \n\n\nI cackled way too hard at this. Excellent work on being an evil bastard. \\*cackles\\*",
            "Pettyness is sometimes the best option to teach a lesson",
            "I’m jealous of how good this must’ve felt! \nI aspire to be this level of petty ;) well done",
            "Calls her fat…….OMG, does it actually use that phrase?  Thank you for doing that “for” her…..next time she visits, make it worse",
            ">She came in mad that her watch keeps calling her fat and telling her she needs to walk more.\n\nFucking golden",
            "Thanks for the laugh, random internet person!",
            "Do you sell cell phones by the seashore?",
            "I think BWAHAHAHAHAHAHAHAHAHAHA about covers it. 🤣😂🤣😂🤣😂",
            "Man, I fuckin' hate that shit.\n\nBack in the 90's, I worked for a women's shoe store called Bakers.  One of the things we used to do was dye shoes.  Women would pick out a shoe style and size, then I would dye it the color of their choice.  99.9% of all customers would bring a piece of fabric to match or page out of a magazine (which sucked, because glossy paper).\n\nThat remaining 0.1%? About 99 percent of them would pick a color out of our color book, which would tell what dyes and chemicals to mix.  Easy peasy.\n\nNow, it needs to be said -- I enjoyed dyeing shoes.  It was fun and everyone said I was damn good at it.\n\nThen there was this woman... She came in, asked for a particular dyable in her size.  She tried it on, was happy with the fit, tossed the shoes back in the box and said, \"Dye them red.\"\n\nAight.\n\nMe: \"Do you have a sample of the color?\"  \nHer: \"No, just dye it red.\"\n\n  \nI got the color book out, turned it to the reds and placed it on the counter in front of her and said, \"If you'll just pick your color out of here...\"\n\nHer: \"Can't you just dye the damn thing red?\"\n\nNow, if you've played with MS Paint for more than five seconds or owned a box of the big pimpin' Crayola crayons, you know there ain't no such thing as just red.  I tried to explain that to her, but she wasn't having it and getting madder by the second.\n\nI was just a part-time salesman/stock clerk.  This shit had went well over my paygrade five minutes prior.  I told her to hang for a moment and I'd get someone who might have a better way to resolve this.\n\nNow, my manager was an ex-hippie (his word, not mine) from the legit 60's, a former drug addict during that period and at that point in his life, he had substituted Christ and Caffeine as his main drugs.  \"High strung\" doesn't even do him justice.  I went in back and said, \"Hey Tom... There's a lady out there that needs your help.  She wants her shoes dyed red.  She has no fabric to match, won't pick out of the book and says she just wants me to dye it 'red'.\"\n\nHe looked up at me and this facial tic he would get when he would hear something completely... Off... triggered.  He said, \"Okay.  I'll be right back.  I'll meet you at the dyeing table.\"\n\nThe next ten minutes were off the chain.  Tom tried to reason with her, she continued to escalate and finally the assistant manager decided enough was enough and called mall security to drag her out.",
            "this is how most boomers are. they don’t realize tech is designed for monkeys to use it. the companies want everyone to buy it and use it, boomers just give up before they even try.",
            "\"I sell phones and phone accessories I tell ya whut.\"",
            "This is my favourite kind of malicious compliance: an entitled person refuses to put effort in to something that benefits them and demands you do everything. So you do, badly. *chef kiss*",
            "top class",
            "Ferengi rule of Acquisition #82\n\n\n\"The flimsier the product, the higher the price.\"",
            "Damn, this made me laugh out….Nice Work!!",
            "I love this so much.",
            "You got an actual guffaw out of me there - excellent!!!!",
            "And set a timer every day at 4am",
            "LOL this is hilarious. Beautifully malicious <3",
            "“I want advanced technology but don’t want to advance my understanding of technology.”",
            "> She came in mad that her watch keeps calling her fat and telling her she needs to walk more.\n\nI cant stop laughing at this.\n\nThis is the best post ever here.",
            "I love this! well done",
            "My first hearty laugh of the day. Thank you! 🤣🤣🤣",
            "oh that's awesome. Tell her you just used your height and weight as she wasn't there, so you had to guess.",
            "I would set alarms for 11am to 4am on random days of the week.",
            "😂😂 absolute legend",
            "Hopefully,  you set an alarm for 3am.",
            "Oh, man, that's rich.  That's the best laugh of the new year.  \"Best guess\"; love it.",
            "That's just genius. Love it.",
            ">She came in mad that her watch keeps calling her fat and telling her she needs to walk more.\n\n\"Watch said it, not me.\"",
            "I sold wireless for 10 years. I felt this post in my bones. The absolute entitlement and laziness from 95% of the customer base.",
            "Omgoodness. I feel you. I work in a similar setting. \nThe day fb servers were down was a mad house. One irate man in his 60s asked “can’t you turn the servers back on?!” \nSir, if i could, i would not drive a Ford Focus.",
            "My dog died on Sunday and I think this might be the first thing to bring me true joy since. Thank you. You're a hero.",
            "genius!!!",
            "#😂🤣😂\n\n\nIt was my pleasure, Karen.",
            "Then set her birthday up for April 20 1969",
            "Omg. Literally laughed out loud at this. Bravo. Job well done.",
            "bahahahaha",
            "I used to be a sales rep for a major carrier and this shit happened all the time. I'd do the same thing for apple products since all she wants is for others to see that she can afford one (if she actually cared about functionality, you'd definitely want to set it up to your specifications and preferences). But man if someone bought any Android watch and I tried that, they'd return it same day",
            "LOL!!!  I almost spit out my drink!  Love this one!",
            "Don't tell me you work for premium wireless",
            "\"Sorry, you walked off so I had to guess your weight\"",
            "Worked at a cell phone store for the last 3 years, can confirm that 99% of the people that come in to the store are some braindead mother fuckers. The other 1% are the people that know what they want and want to get in and out, they just didn't want to wait the few days it takes to get shipped a phone.",
            "Work in same field.  I usually just get phone connected to watch and cellular network and thats it.  Any personal info like that is too much to deal with.\n\nBut hell, da bitch got what she asked for, and i died reading the story.  Ive read through 3 times already, thinking bout some \"wonderful\" customers ive had to deal with.",
            "[deleted]",
            "My son told me this one the other day as he had to help his G/F with her setup....\n\n\"Apple,    for people that don't want to think. \"",
            "LOL  really.",
            "LMAO. Good job OP.",
            "Sir. I still go into retail stores and I know how to use an website. I go in coz I dont want to wait for delivery. Who has time to wait 3-7 business days for an item I may or may not want in 3-7 business days?",
            "5'5\" 130 lbs and all karen.",
            "Ded🤣😂💀",
            "Hehehehe, love that.",
            "Hopefully she got her coffee with non-fat soy milk.",
            "Tell her she probably needs to just buy another one.",
            "I just laughed and laughed after I read the last line",
            "That's wicked funny.",
            "> The job has gotten frustrating because the people who still go into a retail store are often just people who can't figure out how to work a website and won't bother to read anything.\n\nI don't order phones online, because if I need a new one, I like to be able to check out the display model and play around with it first to see if I like it.  Can't do that online.",
            "Based",
            "I used to work at a cell phone kiosk within Costco. The most annoying people were people asking me to call a Costco associate to help them for some Costco product shit (technically I don't work for Costco, so not my job doing that) or annoying ass people who would could up with their mobile device asking me to make it faster or do troubleshooting stuff on it",
            "With that weight, she'll probably need a wristband extension",
            "LMAO that is hilarious. Love it!",
            "😂😂😂",
            "May i just say that you're a genius?",
            "You're absolutely right that these are folks that refuse to actively learn about the devices they spend their cash on. I spent many years selling phones and doing the same. Half the time they would come into the store and simply ask how to take the back of their phone off. Oh and all the comments I heard about how dumb having a camera on your phone is. Good times.",
            "This by far is the greatest post ever made on Reddit. Props to you!",
            "r/chaoticgood",
            "Former cellphone tech. I hated setup calls! I was a tech in the early days of mobile phones. Nokia was awesome ..5 steps and done. Samsung was universally loathed by techs everywhere! 17 steps to set it up! And this was before smartphones! The customers that drove me bat crap crazy went like this\n\nMe - please allow me a few moments to complete your process . Do not touch any buttons. \n\nCustomer - push da button?\n\nMe - no, not yet, I will let you know when to push the buttons\n\nCustomer (10 seconds later) push now?\n\nMe - no\n\nCustomer - now?\n\nMe - not yet \n\nCustomer - oops\n\nMe (sighing as the set up screen  blinks) we have to start over\n\nRepeat no less than 3 times till I was banging my head on the wall of my cubicle in frustration",
            "Apple Watch:  We’re going to stand all day moth’r fu’ker!",
            "Watch: You are fat!\n\nWoman: What the fuck?",
            "Sounds fair to me…",
            "I wish there was some way I could express just how hilariously vicious this was for me! Thanks for the laugh!",
            "As a former Apple employee I absolutely love this!",
            "What a good laugh I just had, thank you.",
            "Hahahahahaha! Genuine lol. That’s funny!",
            "Glorious!",
            "So? Her problem.\n\nServes her right.",
            "Should have kept the real height :)",
            "Bravo!!!",
            "Maybe 5'2 385 would be better. :)",
            "When I was doing phones, dude set up his brand new iPhone. Forgot the lock code and didn’t have biometrics set up. Off the apple store, sir. Nothing I can do.",
            "I really don't miss working retail. People ask you to do things that they *absolutely* need to do themselves, and then accuse you of being lazy when you say you can't. Had more than one customer try to insist that I call their bank for them when their card was declines. Like seriously, they're not going to tell me anything. *You* need to talk to them.",
            "🏅🏅🏅🏅🎖🎖🎖🎖🎖🎖🏅🏅🏅🏅🎖🎖🎖🎖🎖 here, please take these awards!!!!! Damn... \nWATCH::: hey lady, you need to walk!! 🤣🤣🤣🤣🤣🤣🤣🤣🤣",
            "Omg, I love this!",
            "I don't blame you in the least. Made me throw my head back and lol. Good job.",
            "Oh you!  You're the best!",
            "Last sentence gave me a genuine chuckle.",
            "A shame you didn't set it up the language for Chinese.",
            "I live this post working at a phone store myself...",
            "set it to remind her about her cars extended warrantee every two weeks.",
            "😄",
            "I worked for a retail phone sales vender inside a target. I feel this post On a spiritual level. I did some stuff like this too.",
            "Almost going into my 80th decade, my initial knee-jerk reaction was that you were a raging AH. But good grief - if the person helping you set something up requests that you stay present for that - and you blithely blow them off, then you deserve whatever malicious compliance can be doled out to you. \n\nI have a couple of issues with my phone that I haven't been able to figure out myself, and when I take it to someone for help, I most definitely will stick around if they request that, since I will certainly learn something so that if something similar happens, I can (possibly) fix it myself. \n\n(And I thought I was reading this on AITA, and I was going to say that you are NTA.)",
            "I had the exact same jind of job you did in an area with mostly old retired people. 90% of what I told them at the end was just to read your screen",
            "Working at the Fruit Stand? Such wonderful customers at those places.",
            "At first glance, I was like \"dude, just do your damn job\"  then I read the thread. So hilarious! Her watch is calling her fat lmao.",
            "Working in cellphone retail myself, thank you for that.",
            "I had folks do you that for years in cellphone retail. I'd tell them if you want me to set up your personal accounts you have to be present because I don't know your passwords and I can't know them by company and personal policy. \n\nYou wanna leave and come back three hours later? Here's your phone set up to make and receive calls and wait in line if you want it migrated over because I'm not putting in your personal info, I'll hand it to you to do that. I'll help, but I'm not putting in passwords.  If it's two minutes to close, come back during business hours. \n\nCan't tell you how many times that saved my ass with people who claimed \"you put in/made up the password\" and now I'm locked out of my phone. Nope, I didn't. No one on my store did because I'm the manager and we don't do that. Don't try to blame your fuckup on me. If you don't know your password it's your own damn fault.",
            "Yeah I did phones for a couple years and the amount of people who refuse to setup a phone astounds me. It’s literally clicking the next button until you have to sign in and if you don’t know your passwords I can’t really do anything. Always triggers me when they lock themself out of Apple or google accounts “cAnT yOu JuSt GeT aRoUnD iT??” No. No I can’t and if I could I wouldn’t be working here.",
            "Well done fellow shit up-fucker",
            "You got the weight setting right. But height setting should have been 5'5, so that the watch might have become a iDrill Sergeant and shouted at her all day to work it off.",
            "For the win",
            "Sounds like she got more than she deserved.",
            "I love this so much… a few years back I worked in a call center that supported iOS devices we weren’t allowed to say we worked with apple devices because technically we didn’t work for apple… when the Apple Watch came out I got a call and thru luck mostly I fixed the customer issue so of course she gave me a good review so of course I started getting most of the watch calls which I hated and my employer insisted wasn’t actually happening I always did the best I could but I still hate those damned watches",
            "Oh good grief!  Nicely done",
            "Sir, you have done a great service to humanity. 🙏🏾👏🏽",
            "Awesome! You nailed shitty costumer 101",
            "The best interactions are always the old fucks that come in demanding you fix their crusty ass old flip phones\n\n (Work in cellular sales too)",
            "Bravo!",
            "So, instead of RTFM and change the settings herself, she came back? Some people....",
            "Selling cellphones is the new ptsd of retail I lecture the customer of why they are stupid specially when they are  on their 8th iteration of the same model.. bitch learn teach them don't do it for them .. tine to take off those training wheels",
            "Wake up you stupid fucking cow, it's time for a workout",
            "I did this for ages my guy. Best advice is setup expectation before hand. Tell her you will help them get started on the process and they finish up on their own once setup is done. Don’t do what they did not pay you to help the with. I used to straight up tell them an hour is gunna Cost you $69 and if they wanna pay no problem. Don’t feel bad for not helping them time is not free.",
            "Noice!!! I loved it!",
            "It would be fun to set up her watch profile as a male, and then when she complains just say \"I couldn't tell\"",
            ">\"*The job has gotten frustrating because the people who still go into a retail store are often just people who can't figure out how to work a website and won't bother to read anything.\"*\n\nI certainly understand your frustration with this customer, but I very strongly disagree with your website premise.\n\nWhen I can, I prefer to shop at a brick and mortar store because:\n\n* I can see/feel/touch/try out an item before purchase\n* If I buy <item> locally, I can probably get support locally\n* support local business', i.e. ones that provide jobs to people such as yourself.\n\nThe above isn't always possible, but I purchase locally when I can.  I've worked retail myself.  I'm not there to cause you grief or hardships.  I just want to buy stuff.",
            "Why does it matter which wrist it’s on?",
            "was is Margorie Taylor Green? It was MTG right, come on we know it was her.",
            ">because the people who still go into a retail store are often just people who can't figure out how to work a website and won't bother to read anything.\n\nSpecifically in the department of phone sales like you're in, cell providers (at least where I live) do a pretty shitty job at listing their promotions or deals, or what stores have which phones in stock, or really anything outside of a price.",
            "> The job has gotten frustrating because the people who still go into a retail store are often just people who can't figure out how to work a website and won't bother to read anything.\n\nAlso, people who don't want to spend $800 on a phone and have it dropped off at their front door without signature handoff.",
            "Lol. I’m that type of customer… somewhat. I go into stores because I want stores to keep employing folks that staff bricks and mortar location locally. I also believe that I can multi task a lunch break by ordering lunch, run to pick it up, eat while walking to drop off my electronics “somewhere” to the magical genie and that will do “stuff”, while I run to the bank, while stopping to do weird yoga stretches at every red light intersection (nyc), WHILE searching frantically through my purse to find my phone that I dropped off to be fixed by the wizards in the Apple store… On behalf of all of the burnt out-half asleep people of the New York Delegation, “We are sorry and vow to do better”",
            "I used to sell phones and once there was some younger like teenagers with their parents there shopping. The kids were pissing me off so I set my text notification to that high frequency tone that only people under like 30 can hear. Texts would come in and the kids would touch at their ears and look around confused because its so shrill it hurts and the sound source is almost placeless. I acted like i didnt hear anything and their parents were old enough that they genuinely couldnt hear anything. After a few texts the kids couldn't stand it so they told their parents they were gonna wait in the car. Rest of the sale went so smooth without them there.",
            "Upvote for the malicious compliance - downvote for the first paragraph. I’m computer literate & usually set anything I buy up myself (and often for family & friends) but I much prefer buying in-store.",
            "Ah, sounds exactly like your stereotypical Apple user lmao",
            "There's malicious compliance, and then there's being a jerk.",
            "Surely you mean, \"I sell phones and phone accessories. Hear the voice, not the noise.\"",
            "You wouldn’t last working in an Apple store 😂",
            "5'5 155lbs ? She does need to get off her fat ass , good job brother",
            "I don’t think this is malicious compliance. Why not set it up for her to your best ability, even if you have to estimate the specifics. Is this against your job description? Or did you just not like this individual? This might not be the job for you because you might encounter people who need help with technology.",
            "I'm not going to bother reading the rest of your comment because the fact that you work at a phone retail store and just absolutely bilittled and insulted people who need a little phone help shows that you shouldn't be working at a phone store or with customers at a phone store. Shame on you. You should be working at mcdonalds where customers bilittle YOU for no reason because that's where you belong and then maybe you'd think twice before insulting your customers.",
            "i sell phones and phone accessories",
            "I read that first line in Hank Hill's voice...",
            "Irrelevant comment but I've been reimmersing myself in the Wheel of Time and I read this as Lady Demandred... I was wondering when Demandred got married in the book Age...",
            "I’m still in the iOS universe precisely because when I buy a new device I just put it next one of the other ones and it literally walks me right through it?\n\nTo be fair I basically only use my watch for golf related apps, but it took about two minutes to set up for that?\n\nIf you’re having trouble with that level of tech I suspect you’re not actually buying it for any reason other than as a status symbol.",
            "Whenever I go yo put my weight into the health app, it always asks me if I’m sure. Yes. I’m sure. I know that people don’t usually put that number in, but maybe look at my history. It just makes me feel bad, and it’s not like I really wanted to record it anyway. It’s just a useful tool, even though it makes me feel bad every time. \n\nVent over.",
            "That’s pretty common tho in retail commission sales at a phone store. I’ve set up plenty of apple watches.",
            "“grow up box”\n😎cool, i like that!✌️",
            "bro i work in a cell phone repair shop and deal w the same shit. not MP but you know how many old people come in here saying their phone doesn’t work and their mobile data is off? it’s astounding. i have one customer who somehow activates the zoom feature on his iphone almost daily. he comes in, i double tap w three fingers and it’s back to normal, dude just doesn’t understand how to fix it and i don’t understand how he gets that shit zoomed in all the time but can’t zoom it back out.",
            "You are my hero! (her watch was telling her she was fat)",
            "Lmfao I'm even gonna lie ,I busted out laughing when I read \"her watch is calling her fat\" you my kind sir deserve a raise and applause ✌️😂💯"
        ]
    },
    {
        "post_id": "tdzoq5",
        "author": "None",
        "title": "\"Bin everything in this room? You got it boss.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tdzoq5/bin_everything_in_this_room_you_got_it_boss/",
        "score": 19527,
        "num_comments": 366,
        "created_utc": 1647270646.0,
        "selftext": "Not my own malicious compliance but overheard then witnessed at work.\n\n\nA few months ago, the two owners at my work had a huge disagreement which has escalated to full blown screaming matches in the middle of the office and nearly into several physical fights. It came to a head last Friday and owner A decided to pack it all in and leave effective immediately. \n\n\nAfter lunch owner B called the warehouse manager up to the office and pointed at owner A's office (situated just off the main open plan office) and said \"I'm too stressed to deal with this so I'm going home. Bin everything in that room. I don't want to see a shred of evidence that owner A worked here when I get back on monday morning.\"\n\n\nThe warehouse manager looked at the offending office and back to owner B. \"Are you sure you want to bin *everything* boss?\"\n\n\nOwner B looked ready to explode already and apparently this  extra bit of clarification sent him over the edge. \"Did I stutter. Get rid of everything in there or you can clear out your desk too.\"\n\n\nAnd so owner B stormed off and our warehouse manager took out his walkie talkie and summoned up two of his warehouse staff and relayed the instructions. The warehouse workers questioned it and got the same answer: yes, absolutely everything. \n\n\nAnd so they got to work, owner A's personal effects were put into a box and sealed up to be taken to him by one of the purchasing staff who lived nearby. Everything else was bagged up and put into the bins. The paperwork and stationary were boxed up to be shredded and destroyed. Next the monitor and printer were taken to the bins, followed by the desk and chair. When I left at 4pm, the warehouse workers were just starting to take down the wall mounted bookshelves.\n\n\nI would have expected them to stop there, but when I got in this morning there was nothing in the office. The curtains and blinds are gone, plug sockets and light fittings taken off the walls leaving exposed wires, the tiles removed from the ceiling showing the ductwork and wiring above, the carpet that owner A requested be put in was torn up leaving the underlay. Even the door with owner A's name plaque on it was taken off the hinges. It looks like a construction site in there. \n\n\nOwner B came in at 10 this morning, took one look at the bomb site and started screaming his head off and demanded to see the warehouse manager. He wanted whoever did to put this right and then get off site as they were fired. If no one owned up, then the whole warehouse shift was fired. \n\n\nOur warehouse manager, never one to give a shit, just peered into the office and said \"You said bin everything boss. Looks like they did.\" And walked off.\n\n\nOwner B looked like he was going to burst a vessel.",
        "permalink": "/r/MaliciousCompliance/comments/tdzoq5/bin_everything_in_this_room_you_got_it_boss/",
        "comments": [
            "The perils of management by tantrum\n\nEdit: Thank you for the upvotes and awards.",
            "Gee, I wonder which boss they liked more?",
            "Wtf, what kind of company is this?",
            ">Next the monitor and printer were taken to the bins, followed by the desk and chair.\n\nI'm willing to bet someone now has a new desk, new chair, a monitor and a printer. ;)",
            "[deleted]",
            "[deleted]",
            "\"Did I stutter\"  \n\n\nI totally read this in Stanley's voice lol",
            "I'm picturing the Who's houses in Who-ville after the Grinch struck! Lol!",
            "You're fired! \nWhat for?! \nFollowing instructions.\n\nMakes sense.",
            "Marvelous.",
            "[deleted]",
            "They really trashed the whole office.",
            "That “did I stutter” saying is so freaking arrogant.",
            "Was this by chance a Pennsylvania based paper company?",
            "I just don't understand how these people get ahead in life, but then I've only worked in big corporations where all people leaders are offered management training.",
            "Seagull Management: swoop in, squawk loudly, shit all over everything, then leave.",
            "As an IT worker...\n\nIf the PC wasn't properly handed to IT, I'd be screaming at the owner (because it was his order) because when someone that high profile leaves, that shit needs to be secured.\n\nWhat a child.",
            "Sounds like boss A and B are both colossal dickheads.",
            "\"Do this or you're fired.\"\n\n\"Come here or you're fired.\"\n\nWhat a great atmosphere.",
            "You said \"Everything.\" I asked you said \"Everything or you're fired.\" And short of stripping the paint off the walls, that looks to be everything.",
            "The best way to fuck with management is do exactly what they tell you",
            "A Laurel and Hardy routine",
            "Ferengi rule of Acquisition #63\n\n\"Work is the best therapy-at least for your employees.\"",
            "[deleted]",
            "Not the ending I was hoping for, but still epic. \n\nI was hoping for Bossly Unit B to look for some super important paperwork, only to hear that everything's binned, and the tax collector's waiting with bated breath to yeet Bossly Unit B into a bin.",
            "And now we know which owner was The Problem.",
            "I would have gone a step further and just taken all the door trim off and put in a piece of sheetrock so there's not even a room anymore LOL",
            "Hahaha, I can't stand people with short tempers. If you can't take more than a half second to compose your thoughts, and then scream at people like an animal, you deserve whatever happens to you.",
            "Reminds me of a place I spent some time at for an audit. The company was being run by five brothers and a sister who had inherited it when their father passed on. The five brothers were constantly at each other's throats, yelling and screaming, ordering staff to do things then countermanded the order, then reinstating it etc etc. The staff I spoke to were all clearly suffering PTSD and had that deer in the headlights look about them. The sister could often be seen just sitting at her desk with the door shut and her head in her hands.  I was only there a week and I needed a vacation and several stiff drinks afterwards!",
            "I'm thinking everyone in this company who isn't Owner B needs to be on job hunting sites, effective immediately. This company is clearly about to go down in flames, and you and the rest of the staff do not need to become collateral damage.",
            "I'd have moved all the stuff into the Warehouse, out of sight, waiting for the scream over something essential going missing. Taking owner A's personal effects to him was good. I'd probably have redeployed the printer and other bits, where appropriate.",
            "I love this so much - do you happen to have a picture of what the office looked like?  Thanks for the laugh haha",
            "Of course, Spaceballs is playing whilst I read this. (not the \"Comb the desert do you hear me? Comb the desert!\" scene, but still!).",
            "I died when they got to the fixtures and ceiling tile...then they took off the fuckin door",
            "it's like being dragged into someone else's bad divorce.",
            "Did the warehouse manager get fired?",
            "Secretly hoping this happened where my partner used to work. Left a few months back... owners were at each others throats... a man can dream.",
            "That warehouse manager is a legend 🙏🙏🙏 can work for me any day lol",
            "Love the you got it boss moments, just like bad Genie wishes, they forgot to put stipulations",
            "Wow, I can't imagine why Boss A left. Boss B seems like a reasonable, agreeable guy.",
            "Would like to be a fly on the wall in owner B's room.",
            "Oh man. Wonder why A got tired of B's shit?",
            "*\"You said bin everything boss. Looks like they did.\" And walked off.*\n\nRead it in Darryl Philbin's voice",
            "your workplace is incredibly toxic, why are you working for those people?",
            "Well, this warehouse manager just got unemployment.  When the state unemployment gets involved,  he can say he literally followed all instructions. \n\nOwner B actually might end up in a hospital.  Stress kills.",
            "Sounds like owner B is the cause of a lot of problems there",
            "Totally not related, but today I (facilities manager) cleaned out an office that was supposed to be vacated. I usually find obsolete shit and this time was no different so I tossed a 30 yo microwave and typewriter.\n\nApparently the tenant kept his personal typewriter (complete with 16k of memory sticks the size of my cellphone) in the cupboard and is pissed at me. He wants the 1987 value of the typewriter back.",
            "Why did this office still have walls? Don't you have any understanding of \"everything\"!?? That includes walls and ceiling (assuming this is a warehouse, and the office is some kind of encloser put in there)",
            "Wow, I have an inkling of why owner A left.",
            "That would have been so funny if the whole shift just said \"we'll save you the trouble\" and left. Then refused to return until he apologized.\n*I know -- in a perfect world",
            "So did he fire someone? It’s kind of moronic to say came fix this and then I’m firing you.\n\nEdit : autocorrect typo",
            "the employees work for a dick and they should all quit",
            "Lol reminds me of when I was told to clean all the clutter out of “my” room by Thursday and that everything else would be thrown away. Problem was I already lived outside of the house and just had a bunch of mostly old and useless stuff there. The result was a very easy cleanup for me which ended with a large pile of clutter in the middle of the room…\n\nBe careful what you wish for\n\nEdit this was a parent’s house, I’m not some horror tenant lol. I hadn’t been there in ages but allllll of a sudden my things were a problem even though they hadn’t been before",
            "They must hate B",
            ">Owner B looked like he was going to burst a vessel.\n\nIm imagine his forehead is like when Doflamingo gets super pissed\n\nhttps://youtu.be/RvRbuPKNu8M\n(spoiler if you haven't watched one piece)",
            "Sounds like  the wrong one quit.",
            "When the silverback gorilla wants to motivate the other gorillas, he will do so by running around, beating his chest, waving his arms, making loud noises, and tearing up the jungle.\n\nThere is no justification for an intelligent human being who relies on these same methods.",
            "Treat your workers like shit, And they will do shitty work.",
            "By all means fire the entire warehouse shift, that will really help the company!",
            "[deleted]",
            "Are we just making things up now? And not even bothering to try and make them sound realistic?",
            "ha ha ha, love it",
            "Now that is malicious compliance!",
            "Sad that owner B didn't burst a vessel. Oh well, good that he didn't or else it would have been extra sucky cleaning work for the warehouse shift.",
            "Oohh, terminate an entire shift. See how well that works out for your company.",
            "If I were involved in the \"bin it all\" work, the ceiling gridwork, drywall, insulation and wiring (switch off the breaker for that room), and any plumbing (if a valve upstream can be turned off) would have gone into the dumpster as well. If I'm getting fired, I'm taking it up to 11!\n\nHad this been the case, this would have become my #1 fave story on Reddit.",
            "Hahaha the fucking light fitting and roof tiles and the carpet, fucking epic",
            "Cocaines a hell of a drug",
            "I have the vague sense the employees’ favored boss was not the one that stayed.",
            "Sounds… realistic… I suppose",
            "What a load of shit. You literally used The Office references.",
            "That's pretty shitty to be honest.  Likely thousands of dollars of electronics gone to waste, not to mention construction materials and labour.\n\nIf they had stopped before tearing the building itself up then I might have a different attitude towards it.",
            "even in anger, “bin EVERYTHING” can not be misinterpreted as this…  \n\nthis…  well, this speaks to just how much those people hated owner B",
            "Absolutely fucking brilliant.",
            "That's awesome!!",
            "I'm picturing Owner B as Gary Oldman in Leon.",
            "Def should have gotten that instruction in writing.",
            "Dude that workplace sucks",
            "Big baby with big money doesn't like his just desserts served like an airplane crashing into his mouth.",
            "Apoplexy. \n\nWell done.",
            "Well that was a no win situation!",
            "Best one I’ve read, really captures the soul of malicious compliance",
            "Been there. Worked for a little man like that. Walked out after clearing my desk and handing off my key that night at the end of my shift. Went to pick up my last check and the account jerk wouldn't give me my check till I explained where I had been. I guess an empty desk and someone else closing wasn't a big enough clue. DUH!",
            "Yet another Reddit fabrication. They tore up the carpeting? Bullshit.",
            "Okay, this was the one time I laughed out loud at a Malicious Compliance.",
            "I doubt this ever happened. Another example of a little creative writing",
            "I think this might be my favourite MC yet!",
            "This is kind of MC I want to see here lolll",
            "Sounds like the warehouse manager was a prick too.",
            "Brilliant",
            "Don't you just love capitalism. Really bring's out the best in people.",
            "LMAO! That was great!",
            "Removing *fixtures*? Pfft. This isn’t MP. It’s a straight-up-amateur-exact-words-Jan-Brady move by warehouse personnel. MP is a response to a completely unreasonable and/or contradictory demand. How embarrassing.",
            "You have to be careful when you use words like All or Everything. They can come back to bite you.\n\nTechnically, Owner B did it when he gave the order.",
            "You have to be careful when you use words like All or Everything. They can come back to bite you.\n\nTechnically, Owner B did it when he gave the order.",
            "Brilliant action",
            "🤣 **soooooo funny!** 🤣"
        ]
    },
    {
        "post_id": "bqta38",
        "author": "out_run_radio",
        "title": "“Unless you’re in the middle of nowhere you have to work during vacation, you’re salary!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bqta38/unless_youre_in_the_middle_of_nowhere_you_have_to/",
        "score": 19502,
        "num_comments": 658,
        "created_utc": 1558344169.0,
        "selftext": "Mobile, crap formatting and no TLDR (Ok you broke me, TL;DR at the bottom)\n\n\nI work for a small company in the trades as head of the IT department (aka the only IT person). Truthfully the gig is pretty great. Good pay, benefits and I can come and go as I please within reason. The two people I have to answer to are the VP and CEO and as is par for the course they know dick-all about anything to do with technology and generally leave me be as I’m good at my job and everything runs smoothly.\n\nBeing a small company a lot of us don’t take vacations due to A) building the company and B) not having replacements for the time we’re gone but after two years vacationless (we’re in the US) my wife convinces me to use the time I’m given to decompress and take a small, one week, get away. I talk to VP and he gives me the thumbs up to take the time barring I get everything in order and do some minor teaching to other staff incase  of an emergency. Cool, easy.\n\nEnter FOD (Field Operations Director) a man who is an attack dog for the VP for no reason as the VP is nothing but polite and reasonable. FOD loves giving everyone a hard time, adding steps to tasks to make himself look like he’s part of the process, reminding everyone how much of a “boss” he is to the rest of us in management and calling me a nerd any chance he gets.\n\nFair to say - I dislike FOD immensely \n\nAfter making my rounds with other staff it’s FODs time to do some scary computer related learning. FOD refuses to look weak under any circumstances and gets very aggressive when learning new things because “I’m the boss, I already know.” In the midst of learning it dawns on him to ask why he has to learn this stuff anyway, I’m the nerd and it’s my job to do this. I clue him in on the week I’m taking off and this stuff is just precautionary. This worries FOD as he’ll have to retain information, answer questions and do some minor troubleshooting. \n\nThe conversation went something like this, and I wish I could tell you that this guy isn’t this much of a jerk, but he is.\n\nFOD = “boss” \nMe = me\n\nFOD: Who approved your vacation?\n\nMe: VP did as long as I could get you guys comfortable with some small maintenance.\n\nFOD: I only approve vacation time, I’m your boss.\n\n(Side note: he does THIS so much that VP actually wrote out the hierarchy in chart form and we all carry a digital copy with us to remind him who he’s actually in charge of)\n\nMe: You’re not. *shows chart*\n\nFOD: Well fine! But you’re salary so you have to work during your vacation. You’ll bring your laptop and work phone with you.\n\nMe: When YOU vacation you make it very clear you’re unreachable and can’t be bothered even if it’s an emergency.\n\nFOD: That’s because I go to places without service and unless you’re going to the mountains you have to work! You’re salary!\n\n*Malicious Compliance Initiated*\n\nMe: Just to be clear; if I go to a place without service I won’t be expected to work, yeah?\n\nFOD: That’s right, but you’re a nerd you don’t do anything outdoorsy.\n\nMe: Great, thanks for clearing that up.\n\n\nFast forward 3 weeks later and it’s vacation time. All my ducks are in a row, people are comfortable with me being gone for the week and are all encouraging me to just disconnect. A close coworker of mine knows of the conversation FOD and I had and asks what I plan to do to about it so I shared my easy but effective plan.\n\n1) wife and I rented a cabin in the woods, 2 hours from the nearest town and it doesn’t have service\n\n2) set up automatic email replies that have all IT questions and concerns forwarded to FOD since “he’s the boss, he knows.”\n\n3) leave work phone on the charger in my office with ringer on, door locked so he has to hear it and voicemail changed to have FOD become IT for the week.\n\nCoworker loves the idea of flooding FOD with questions he can’t answer so much that he gets other coworkers in on it. \n\nMidway through the week I get a call from coworker with an update: FOD loses it. He can’t keep up with any requests for help and didn’t bother to memorize the simple tasks I showed him so he does what any good “boss” does and puts in a request to take a vacation until I get back. Retreat is always an option. Nothing screams *leader* more than retreat. It’s not weakness and failure if he’s not there! \n\nMy coworkers were able to manage and FOD got his 3 day vacation, unfortunately.\n\nAfter the week off I’m called to VP’s office to catch up and get things back on track. VP obviously heard of the hardships FOD faced in my absence and laughed at my MC surprisingly. VP struck a deal with me moving forward since it was made clear to him no one else knew how to do my job: I can go on vacation wherever I’d like as long as I bring my laptop and phone and check it once a week. They’ll refund my vacation time for that day even if I only work for 5 minutes. \n\nI took that but with the caveat of making FOD actually learn some of my duties just in case. VP agreed. Now I do an hour of teaching a week to a very surly FOD. After all, he’s “the boss” he’s gotta know.\n\n\nEDIT: Oh hey my first ever silver. Is this what it reddit is supposed to feel like?!?! Also, I post almost never and this is by far the most attention any post has ever had of mine. Love hearing about how much better off our EU and AUS counterparts have it in terms of vacation. Drink a beer for me friends.\n\nEDIT 2: My first gold. Be still my beating heart. Thanks internet stranger!\n\nEDIT 3: My god the shiny coins keep rolling in! You guys are wicked nice. I don’t know what platinum or gold does but man, the colors are real nice.\n\nTL;DR: Guy who thinks he's my boss gives me grief for using vacation time. Insists I work even when on vacation. I point out he doesn't do the same. His reasoning is because he goes to places where there is no cell service or internet. I use his logic and become unreachable leaving him with fielding all IT related issues for a week.",
        "permalink": "/r/MaliciousCompliance/comments/bqta38/unless_youre_in_the_middle_of_nowhere_you_have_to/",
        "comments": [
            "Awesome. And you even ended up in a way better place than you began with, regarding your vacations.",
            "Word of advice as one IT professional to another . If you're showing FOD parts of your job every week , once he feel's comfortable doing small tasks he's going to complain about why do they even need you. \nGreat story though.",
            "> They’ll refund my vacation time for that day even if I only work for 5 minutes.\n\nDamn right they will. That's a serious violation of labor laws in the US.",
            "It is so strange that you can go for 2 years without vacation. We have 20 days and at least 2 weeks of it unbroken by law and companies give even much more. Rested people perform much better then overworked.",
            "If you went somewhere without service, how did you get a call from your coworker?",
            "2 years without a holiday and then you only get a week wtf. I feel bad for you. I think if I didn't have my holidays (28 plus public holidays and most of Christmas) I would go insane.",
            "This is not the time to bully the \"nerds\" - we know how your phones and computers work and how to make them not work. Even better when there's only one, because if they have more than one thing to do, you may end up on the bottom of the list. \n\nIf I was in the position, I'd do it too.",
            "It makes a huge difference when you have a good team.",
            "Very nice malicious compliance but a question please.\nHow many people in the US don't take leave from salaried jobs?\n\nI'm from the UK and I've never had a job where I got less than 25 days plus bank holidays. I must admit I am lucky at the moment in that my current IT job gives 35 days and the sector I work in means I have to have at least one unbroken 2 week break a year. I couldn't imagine not having leave unless I worked for myself and got all the benefits of being my own boss instead.\n\n\n*edit. Bloody hell guys, take your holiday. Work to live, not the other way  round, you have one life so fucking enjoy it.\n\nNot wanting to sound facetious but the US sounds like The Land Of The Free*\n\n\n*some restrictions to freedom apply.",
            "My father in law is a networking monkey for a large cellular provider. He loves to take cruises.\n\nHis reasoning: Cant contact someone when they are in the middle of the Atlantic ocean.",
            "did you get it in writing? the new terms of your vacations? dont expect it to happen if its not in writing!",
            "Where I work, this is almost enforced: if you're on vacation, don't respond to phone calls from work. \"If it's truly urgent, ***I*** will leave you a voicemail, just as a heads up so you don't walk into a fire when you come back. I will deal.\" You must put an email auto-reply, and state \"I will be checking emails infrequently.\"   \n\n\nSometimes I make the mistake of checking emails...because I'm compulsive about it. I get really worried that something is going to break while I'm out and have SO much more work for myself when I get back. Sometimes it makes me dread being away.",
            "No contingency for if you get hit by a bus or something?",
            "What kind of company expects you to go 2yrs without a vacation and then work while on holiday.",
            "Brilliant plan, brilliantly executed. My department went through a reorganization a few years ago, and was trimmed down from 4 employees to just me. I had to be off the grid for 2 weeks for National Guard orders, and my boss’s poor performance of my job while I was gone led to me finally being allowed to hire some help. Boss screwed up some items of consequence while I was out, but they were fixable and it worked out for the best.",
            "That's great that the VP has your back and has realistic and fair expectations.   I've worked at so many places that didn't care at all.    \n\nThe worst was a medium sized / geographically spread out company.  This company fought having IT so hard.  They had different IT managers over the years and a few desktop support people and had tried out a few 3rd party helpdesk / desktop support companies.   I came in just as they were to transition to a new company.    Luckily this IT partner was good and not too hard to manage.   The upper brass figured that with a good IT partner they just needed one person it IT, a manager to manage that vendor and other it vendors.    That was my role.    \n\nIt sucked because I was the only one that understood what had to be done IT wise with the company.  The people who I reported to knew nothing.  There were a few business technology people in the company but they came from the IT manager role at different points and wanted nothing to do with it.   That made me the single point of contact for extreme emergencies, upper brass who didn't want to talk to the service desk, and the person to contact if you needed a new phone.\n\nAt one point I had to have surgery and there was a complication and what was supposed to be outpatient turned into a painful, morphine influenced, 4 days in the hospital.   I was bored and did open my laptop at one point.   There we tons of emails and voicemails.  \"I heard you had surgery.... but I need to get a new phone\".   One of them was from my boss saying he was getting pressure and to get them done when I could.    \n\nMonths later I was on vacation in Hawaii with my family.   One morning like 2-3 AM a VP at a site calls me, says she knows I'm on vacation in Hawaii and it must be in the middle of the night, but she really needed to order a phone.   I was pissed and at this point I really knew I needed to look for new job.   \n\nWhen I got back I tried to get them to get me someone as backup.   One new \"genius\" SVP came up with the idea of turning the the manager role into two junior roles.  I was given the choice to take a 50% pay cut and look like a tool to everyone that I worked with or find a new job.  I went with the latter.  I did hear all things went to crap for a few years until they decided they needed a manager.",
            "US paid time off sucks. PTO/Vacation, sick time, parental leave. Basically anything to benefit the employee is not given in the US. I have 14 days PTO and 10 sick days. I can get more but only at promotion as my company doesn’t like people who are stagnant in their career. My company did just increase parental leave to 6 weeks full-paid but only as the primary caregiver. I will say though, when I’ve needed something, they are good at letting me do it. As I work from home when not on client sites, it’s easy to take an hour out of whatever I’m doing to get personal stuff done. Example, I billed for time from the other side of the world. \n\nIn reference to your post, good on your VP. He sounds like a good guy with a general understanding that people need time to decompress and recharge. If you continue at this company, baring a massive offer in pay/benefits, he would be a great person to continue to report to. Your FOD sounds like someone I indirectly reported to. He was an ass who worked all the time. Interestingly enough, once you picked him apart, you knew why. If you haven’t, I would suggest that you attempt to figure out why the FOD is like that. It might surprise you. I did and I was recommended for a big project as one of the SMEs. It was great and put me in the role I am in today.",
            "Love it. \n\n&#x200B;\n\nBe careful about that double edge sword you're making. Being the \"BOSS\" he might get the idea to implement some changes that could cripple your company, because he's the \"Boss\" and knows what hes doing.",
            "Perhaps you need to speak with your VP about 'bus factor' - as in 'hit by a bus'. If you're the only person who even vaguely knows how a large chunk of the company works, the company is only one accident away from disaster. It's a very good argument for cross-training staff.",
            "I had a friend in that same boat; he is salaried and specialized in a big company and had 3 weeks of PTO built up, decided to use it. On his vacation time, people kept calling him, asking him to check on emails, etc... and he was happy to. 1 week in was when HR got involved and told him that any time over 2 weeks was not allowed as PTO but was instead a leave of absence which required approval from HR, not his boss.\n\nSo he called his boss, they went through the employee handbook and that is when he realized that any time he answered a phone call on his day off or read an email, he was \"working\" and it was no longer PTO.\n\nHis boss revoked all of his PTO for his vacation and put it in as \"work\" time since my friend could document that he logged in via VPN or received a work call each day on his vacation.\n\nHe continues to take \"time off\" and work on them resulting in him having 3 months of PTO or so at this point since the employee handbook never specified a cap on PTO. If he leaves, PTO is paid out per the handbook.\n\ntl;dr: HR pisses in specialist's cheerios about PTO vs leave of absence, end result is specialist now has a 3 month severance package (and growing) whenever he decides to bail on them",
            "Goodish. My concern is that if you’re so irreplaceable does that mean you’re also unpromotable? If you’re cool with that fine. If not might want to cross train fellow coworkers on some of your responsibilities if you ever want to move up within the organization.",
            "Good luck taking any earned vacation time if you are I.T. \nI was at an agency for 5 years. Took 4 days worked every day. \nSpent 18 hours recovering from a horrendous server crash, only to collapse from a kidney infection. 3 days in the hospital working remotely still with tubes running in me.",
            "1)  That's not what being on salary means, you have a right to vacation time\n\n2) If forced into that arrangement because \"small business\", I'd demand an ownership stake",
            "He was not retreating, he was just advancing in a different direction.",
            "Jesus fuck, US people, take your fucking vacations. This is the best job market in half a century. If you're in a white collar job like this guy, you are 100% in a position to make demands for your most basic labor rights. It's a seller's market, and you're the seller. Stand up for yourself and for your rights.\n\nEspecially notice that \"FOD\" gets vacation time on demand with little notice. This means that the company can deal. (I know it's a different position and maybe FOD is worthless, but here comes the solution.) If they can't, they can hire a coworker for you or hire a temp. No one is indispensable and don't let a company claiming you're indispensable inflate your ego or inpire you to give up your vacation time. God damn, people.",
            "Who the fuck approved FOD's vacation time?  Short-term relief shouldn't be able to go on vacation until the person they're covering is back...",
            "ITT: All the non-US countries bragging about their minimum annual leave rights",
            "#Į̸̠̥̖͚̘͚̩̮̱̀̏̄̽̋͋̋͛̈́̔͋̌͜͝͝ͅ ̵̢̧̡͇̲̥͕̣̬̤̘̦̘̳͎̄́͆̂̆̽̈͠Ä̵͎̘̼́̋̀́̓̽̾̓̎̈́͋̀̈́͜͠͠M̶̡͋͠ ̶̛͙̀͛͋̄͑̆́͊͆͊͐̕Ṡ̸̛͓̮̓̐̌͂͒Ȃ̴̢̞̰̗͙͚̩̰̺̻̩̗̭̍̂̇̑̔̾̀̀̓͘͠͠͝L̴͎̣̲͗Ą̶͒̈͂͌̽͛R̷̨̹̖̘̹͚͖͙̬̎̂͋̃͋͠ͅỲ̸͇͎̩̣̙̭̬͌̿͆̅̑̾̑́̈̕͝͝#",
            "You work far too hard.",
            "[deleted]",
            ">I took that but with the caveat of making FOD actually learn some of my duties just in case. VP agreed. Now I do an hour of teaching a week to a very surly FOD. After all, he’s “the boss” he’s gotta know.\n\nHonestly, this is good for the company.",
            "Just an FYI, that vacation refund is the law.\n\nEven if you answer one email, you get the day back.",
            "As a European, nobody taking vacation in your company sounds like a dystopian hell.",
            "Working as a system engineer taught me to just tell people I was cave diving. Some how, people understand that when you are in a cave 15m under water, you probably don't have cell reception. 19/20 times the cave dive ends up \"getting cancelled due to inclement weather\", but every so often I actually do go.",
            "Excellent job!\n\nI just learned this recently, and you should check your state laws (assuming you're from the US), but even though you're salaried, you may not be an exempt employee, meaning you may be able to collect overtime. You may not be exempt because your job is of \"mission critical\" status.\n\nYou could work it out that on vacation weeks, you just get paid overtime.",
            "> VP actually wrote out the hierarchy in chart form and we all carry a digital copy with us to remind him who he’s actually in charge of\n\nWell this tells me everything I need to know about FOD...",
            "> calling me a nerd any chance he gets\n\nAnyone reading this comment. Never, **ever** let someone call you names at work. Not once. It's a pro environment not a playschool.\n\nIf you are called names in jest, that's different.",
            "My wife has the same issue where she’s so important that any time she takes vacation they’re constantly calling and emailing her with questions. So now we take cruises. No service.",
            "I'm sure this was unintentional but in my line of work, FOD stands for Foreign Object Damage. In layman's terms, debris that gets sucked into a jet engine and wrecks it. The walking talking breathing FOD in your story sounds like he fits the bill.",
            "I ran into a similar situation so my MC was to start going on Cruises for vacation. Great time with the family and the internet is too slow to be attached to my devices.",
            "[deleted]",
            "> Enter FOD (Field Operations Director) a man who is an attack dog for the VP for no reason as the VP is nothing but polite and reasonable. \n\nWell, this could be deliberate posturing on the VP's part - perhaps he WANTS FOD to be the attack dog so VP can look reasonable.",
            "[deleted]",
            "I feel for you in terms of vacation. The joke at my office is that if I don't go in the building might burn down. In truth, I've had to go in to the office in the middle of the night because the alarm system tripped, so, it might be true. I haven't been on vacation in over 10 years, if you don't count maternity leave which was a all of a week despite the c-section. \n\nEU and AUS might say they have great vacations and poor us for not having any but in the next breath they'll call us lazy and fat. That must be code for overworked and underpaid.",
            "I really enjoyed your story",
            "May I suggest /r/talesfromtechsupport ?",
            "Who tells their company where they are going on vacation. I tell them what days I won’t be at work and that’s the end of that.",
            "I am in a similar position to you, albeit probably at a somewhat larger company. A couple of years ago, I took a two week vacation in another country. My immediate boss can do about 2/3 of my job, if he pays attention, but not the rest. He was so worried about not being able to handle an emergency, the company paid for a rental cell phone, just in case. It was a nice touch, since I'd already booked and paid for said rental myself (that being the one serious recommendation for traveling in this country, if you leave the big city).\n\nI half expected to come back and find my boss curled up in a fetal position in the corner of his office, but I got zero phone calls (despite him having to deal with one ongoing issue that I'd clued him in about) and he was his usual chipper self.\n\nI suspect the major difference between us is that none of the people I work for are idiots.",
            "Why do people like FOD not just get purged from leadership positions? Everyone below them hate them, and everyone on their level and above them should be able to see that they are incompetent and hurting morale.",
            "Hot DAMN that was a good thing to read first thing in the morning. Bravo.",
            "As only one of the only techies in my fam this made me Laugh so hard. I love a great read like this.",
            "You should convince VP that FOD needs a satellite phone with him on vacations because he is so indispensable. \n\nThen call him once a day with some very annoying questions \"for the boss\"",
            ">Being a small company a lot of us don’t take vacations due to A) building the company and B) not having replacements for the time we’re gone but **after two years vacationless** (we’re in the US) \n\nWow. My deepest sympathy.",
            "I have certainly never seen the supposed culture in the US that pushes people to forgo their vacation time. I have work in some pretty varied fields, non profits to fortune 500 companies and while occasionally someone will lose a day or two, it's certainly not a trend I have seen.\n\nMy current company starts at 2 weeks vacation, 7 holiday days, 5 floating holidays, unlimited paid sick days, and the option to purchase an extra weeks vacation if you want.",
            "My favorite part was FOD's incompetence. You gave him what he wanted! Boss for the week! He's finally getting what he thinks he rightfully deserves! Annnd he can't handle it and bails out. :'D",
            "I'm working in a *really* small business >10 people and and I have 30 days vacation time a year - just as almost everyone here I'm my country. Working for 2 years without vacation? That's just wtf. No one would do that. I don't think that would even be legal.",
            "He’s calling you derogatory names like “nerd”? Sounds like he’s creating a hostile work environment, brother. Bring it up to the higher ups and shit will stop or he’ll be let go.",
            "> VP struck a deal with me moving forward since it was made clear to him no one else knew how to do my job: I can go on vacation wherever I’d like as long as I bring my laptop and phone and check it once a week. They’ll refund my vacation time for that day even if I only work for 5 minutes.\n\nThat is actually how employment law works in U.S., so your VP is not doing you any favors. When you are an exempt/salaried employee (management or professional capacities), you are paid by the day. On one hand this means that you can be expected to work more than 8 hours a day if there is a high load. On the other hand, if you do anything work related on your day off, no matter how trivial  - that day legally counts as a work day. Of course, it's not a good idea to abuse this mechanic if you want to stay employed.\n\nI am kind of in the same boat - small company, a lot of work, etc. I generally take working vacations, but people I work for and with are great and try not to bother me short of real emergencies.",
            "> After all, he’s “the boss” he’s gotta know.\n\nIt's astounding how few managers get this basic point. Unless all of your subordinates have specialized PhDs or MDs, every manager should know how to do his subordinates' jobs.\n\nIf you can't do what they do, how do you know if they are doing it correctly? How can you fill in for them when they go on vacation, or train their replacement of they suddenly quit?\n\nIf you don't care about the company, but only your own power and prestige, how can you properly subjugate a subordinate who knows things you don't? You have to realize they will make you look stupid in front of your boss at their earliest opportunity, and it will come soon.",
            "In my industry FOD stands for \"Foreign Object Debris\". It's quite fitting in context!",
            ">Enter FOD (Field Operations Director) a man who is an attack dog for the VP for no reason as the VP is nothing but polite and reasonable.\n\nI think you answered your own question here. I think there might be a bit of good cop bad cop going on behind the scenes here. VP can afford to be polite and reasonable specifically because there is an attack dog waiting to drop the hammer when something comes up that politeness can’t handle.\n\nNot advocating for the guy at all, but I doubt it’s an accident. After all, the end result here is that you agreed to take your laptop and phone on vacation to check once a week...",
            "As I like to say to that kind of jackwagon, \"you are either part of the problem or you're part of the process.\" They always assume I am confused.\n\nWell played, in any case.",
            "This made me so happy because salary =/= to being always working, especially on vacation time.",
            "We should just call him “Fod” from now on.",
            "I had a similar situation a few years back. I was running a mobile dev team of 2 and my company had instituted \"unlimited vacation\". I decided to take a 3 week trip to Hawaii for my 20th anniversary and it had been approved for a year by my old boss. New boss says that I should take the laptop, just in case, which I did. My saving grace, and the reason I never had to work during vacation was that I'm extremely anal when it comes to documenting stuff. That alone allowed me to go peacefully because my backup had everything he needed documented on our confluence site. While you can't document experience, you can document process, setup and common solutions. Hopefully whomever is covering for you can piece together enough to keep the lights on.",
            "> VP struck a deal with me moving forward since it was made clear to him no one else knew how to do my job: I can go on vacation wherever I’d like as long as I bring my laptop and phone and check it once a week.\n\nAbsolutely the wrong move on the part of your VP. It is completely unacceptable for a company to depend on the good graces of one employee to remain alive and employed by that company.",
            "Lol fake. “You’re a nerd you don’t do anything outdoorsy”. Yeah you lost me there that was a lie he didn’t say that",
            "Salaried",
            "If you had no service, how did you get a call in the middle of the week?",
            "Why would a small company like yours with such a friendly VP even keep someone like FOP around? He seems useless, and worse than that, a massive asshole.",
            "Ah, flashbacks to standing in line at a Comic Con for an early panel, when my phone goes off with an IT hardware emergency (dead 100-ft KVM extender on a critical system) over 800 miles away. Had to leave a MacGyver solution via voicemail.\n\nI deliberately vacation now in no-service areas.",
            "VP sounds like a great guy to work for/with",
            "Your VP is a generous and reasonable man. Your FOD sounds like he peaked in high school.",
            "\" Midway through the week I get a call from coworker with an update\"\n\nSo how did that happen being at a cabin in the woods with no service and your phone locked in your office?",
            "Idk how you live without holiday time. How much do they pay you? Like if it's work 10 years and not have to work ever again money I'd understand. But to go years without travel or rest weeks is crazy to me. I get 5 weeks. My favorites are weeks where I font have plans and just do what I want and go on 2-3 day road trips.",
            "I guess they're lucky you never got the flu or anything else that put you out for a long period of time",
            "The US is completely fucking mental. If this is \"freedom\" I don't want it.",
            "In case it hasn't been made clear already, get this shit in writing!  \n\"I can go on vacation wherever I’d like as long as I bring my laptop and phone and check it once a week. They’ll refund my vacation time for that day even if I only work for 5 minutes.\"",
            "Loved this!\n\nLeaving the phone plugged in behind a locked door with ringtone on was just pure genius. \n\n\nExquisite!",
            "I went camping last autumn, and I was really disappointed to find my campsite had a better signal than I got at home. I guess I was up high enough that I had line-of-sight to several towers.",
            "Would you say FOD is malicious and out to get you disciplined or just a grumpy, set in his ways kind of person?  I get the feeling he's at that stage of his career that anything new scares the crap out of him, but I may be wrong and he's just generally a dick.",
            "Great story. The fact that the FOD unironically calls you a nerd is also really funny.",
            "I",
            "I wonder which carrier your company has, that would make for a great time. If it’s Verizon swap the sim into a GSM only phone and go wherever you please as it will not get service anywhere and it just bounces to voicemail. If it’s T-Mobile just go to somewhere out of the way and call it a day. ATT, same thing.",
            "They’re not my general” comes to mind",
            "Chances are if you take another vacation you can stay out indefinitely now with a new day of vacation every time you need to fix something.",
            "All of that because he called you a nerd smh",
            "Everytime I see a post that says \"I'm the only IT at my place of work,\" I know it's going to be good.",
            "\"And every now and again, when I'm teaching him something new on the computer, I'll lean over FOD's  shoulder and whisper 'I guess you didn't already know how to do this, huh bitch?'\"",
            "You should crosspost to r/TalesFromTechSupport",
            "Why don't you tell that fucker to fuck off? It's your vacation and you don't have to work. Unless vacation means something entirely different in the USA. \n\nThe fact that you skip your vacation days is sad as well. Holy fucks guys, you're being exploited.",
            "Fuck that deal. Your vacation time is YOUR time. You have earned it. You can't fully enjoy your time off and decompress if you have the possibility of work looming over your head.",
            "I work in IT/comm. We're all lazy nerds until someone needs us. Some of the biggest smiles have been brought to my face when I've gotten to say \"You didn't put in a work ticket and I have a lot of work ahead of you. You'll have to make due for three more days until I can get to you. And no, I can't expedite.\"",
            "Just so you know, if you work at all during a vacation, you've basically undone the entirety of the stress relief it should give. If they can't go a week without you, they don't deserve you the rest of the time.",
            "How did your coworker call you midweek?",
            "Platinum and gold give you access to Reddit premium and r/lounge. Enjoy it while it lasts!",
            "Thank goodness your VP sounds like a saint. What is it about operations directors/managers always being giant, incompetent, demanding, needy assholes? It seems like a pattern ha",
            "Wow! I work at a local florist that also has a wholesale division. They have several stores in the western suburbs of Chicago. Also a wedding and event department, as well as a fairly independent corporate plant installation and maintenance division(housed and operated at a different location with limited interaction.) We have three owners onsite, but they don't really do any day-to-day stuff. Instead, they have a General Manager(GM), who pretty much runs the show. He is essentially the President's thug, who does the \"unpleasant\" things the President might not like to do. The GM likes to speak loudly, intimidating the low-wage workers into obedience. If confronted quietly, though, he tends to back off. If people show they can't be cowed, he'll stop trying.",
            "Openned inbox on Outlook online, reply with a couple \"Yeps, right on it\" = saved Vacation day. It is the mantra here.",
            "I don't get the part about having to work bc salary. Isn't vacation supposed to be paid time off?",
            "Ooof I'm in the middle of this right now actually. I work in government finance. I got a phone call at 7:45 am on Saturday from a lady running an event we put on asking how we were going to reimburse someone for paying for bagels for the volunteer staff.\n\nI immediately blocked her number as this was the second week in a row she called me on my day off to ask me about something that could have easily wait until Monday. The previous Friday I requested off as my brothers were in town and she called me to ask if I ordered her some bullhorns for the same event.\n\nI am 100% ready to quit my job if there is any hint of an expectation that I am to be available at 7:45 am on Saturday mornings when I normally don't even get to work M-F until 8 AM.",
            "The initial conversation with FOD is so perfect. Too perfect, for my taste... Whatever.",
            "Better make sure your co-workers are setup with questions FOD wont be able to answer while you are on vacation. Not every day, but as many as you think you can get away with.",
            "Why do they have some high school kid as FOD? Seriously, he thinks all people that know how to turn a computer on are nerds who don't go outdoors?   \n  \nWhat a ridiculous person, how does he manage to dress himself?",
            "What does the FOD even do? Can’t they replace him? He sounds like a right nut.",
            "Why does this FOD person even exist in the company? Your VP and CEO sound like reasonable folks, amd the FOD sounds completely useless.",
            "It's *amazing* how people equate nerd to knowing basic technology, my fucking CIO looks like he benches cars, tatted up, and is the dad that has that conversation with her daughter's boyfriend's in tank top",
            "Constructive *and* satisfying! That's like dessert that's good for you!",
            "Wow you have a real Dwight",
            "But what day is he supposed to check his email? First day? Middle day? Last day? That doesn’t sound helpful at all.",
            "I most sincerely LOVE that cellphone in a locked office with ringer all loud and stuff forwarding to FOD.  Wow this was a work of art",
            "Why do you put up with being called a \"Nerd\"?",
            "I send this in a message but in case you don’t see it: It means you get a month free of ads and extra coin to extend your ad free reddit. 🥳 So in a way it’s we are saying awesome post, so enjoy reddit without ads for a while!",
            "L/A represent",
            "People who circumvent leadership like your FOD don’t last long- just sayin. \n\nOh and awesome MC.",
            "Wow I'm depressed as fuck and this made me laugh. I'm gonna go for a walk now.",
            ">The two people I have to answer to are the VP and CEO and as is par for the course they know dick-all about anything to do with technology and generally leave me be as I’m good at my job and everything runs smoothly.\n\nI hope your job title says CTO, because if not and you're making those calls, then you should get that title. That'll look REAL good on a resume, and maybe get FOD to stop thinking he's your boss.",
            "Wicked nice?  A fellow masshole I see?",
            "For me F.O.D stands for “Fuck Off and Die.”",
            "I have no clue how much you make...but you deserve a damn raise!",
            "why the fuck would you work in a place that lets someone like fod even have a job",
            "When you're salaried, is it not based on X amount of hours per year?",
            "At the company where I work, \"FOD\" means \"Foreign Object or Debris\" and it is a very bad thing, to be avoided as much as possible. Circuit boards don't like FOD, surprise surprise.",
            "r/titlegore",
            "This is one of the best malicious compliance stories i've ever read here. This is absolutely awesome.",
            "I'm always \"Out Of Office With Limited Access To Email,\" even if I'm just sitting at home in my undies.",
            "Theres a lot of things in my job, that only I know do to my years of experience.  This is great for my job security, but at the same time we are working towards redundancy, because what if the unthinkable happens and I am in an accident.  So being prepared is always a good idea...",
            "Vacation is part of your compensation package..way to push back on a request that is clearly the same as being asked to take a pay cut.",
            "You should've had people call him while he's on vacation. He said it was okay lol.",
            "1 week of vacation in 2 years? That's fucked up...but then again I'd probably do the same thing for good money and benefits.\n\nThis is America.",
            "r/awardspeechedits",
            "This is pure gold. If I had money I’d give you gold just because. Glad it all worked out OP.",
            "You're first silver feels like [this](https://imgur.com/gallery/sy9lVl4).",
            "Ah so your friend called you in while you were on vacay at that cabin that has no service? Alright buddy",
            "Why are you tratching him?\n\nIf I was him I would record everything and learn as much as I can to replace you lol",
            ">VP struck a deal ... I can go on vacation wherever I’d like as long as I ... check in once a week. They’ll refund my vacation time for that day even if I only work for 5 minutes.\n\nThat is a very sweet deal for you, basically if you save up 5 weeks of vacation it's like you've actually got 6 weeks. You essentially got a 20% increase in your annual leave. That's pretty sweet. It sounds like your VP appreciates that at small scale, coverage is a tricky concept.\n\nI have to wonder why they bother keeping FOD around? In bigger orgs you can haul the dead weight, he must do something important that any other director level recruit/promotion couldn't.",
            "Brilliant :D\n\nGoes along with the old saying, leaders **lead**, bosses **boss**.",
            "FOD seems like a a legit \"Alpha male\".\n\nOr at least a wannabe one.",
            "Is this what work is like? Being surrounded by children?",
            "Next holiday ask around the office for different people to call you on different day for something simple and 5 minutes long like; my printer doesn't work oh I unplugged it sorry to bother you on your holiday, I know your on holiday but I can't login I forgot my password or I can't email justin in accounting is his email [jutin@accounting.com](mailto:jtin@accounting.com) or [justin@comapny.com](mailto:justin@comapny.com)?",
            "My work doesn’t ask me to work on vacation, but I always tell them I’m going to the middle of nowhere... just in case lol.",
            "Do people really read this and think it’s factual I mean it sounds like it was written by an amateur storyteller",
            "Why do they keep FOD around? Is he a co-owner?",
            "Llo\nl l no l km l mk l)ll..lol mmk o o"
        ]
    },
    {
        "post_id": "momao7",
        "author": "mypostingname13",
        "title": "Oh, you've made me hourly instead of salary because you're afraid I'll stop selling after I hit my commission cap? Should've just let me stay home.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/momao7/oh_youve_made_me_hourly_instead_of_salary_because/",
        "score": 19488,
        "num_comments": 692,
        "created_utc": 1618124904.0,
        "selftext": "Years ago, I was an \"inside sales\" rep for a simultaneously large and tiny company in a niche market. The quotes are because it was at least equally outside sales, I just didn't go outside except to smoke (I've since quit). They had about 50 branches across the country of various sizes. The smallest was literally one guy who processed local orders and used hot shots for delivery, the largest had about 50 employees. I made 6 for my branch. \n\nI was literally the first salesman with a background in anything resembling sales that my branch had ever hired (they'd always hired the least socially awkward industry professionals they could prior to me), and they'd had their CSR doing the selling for over a year until I came on, so expectations were high.\n\nWhen they hired me, we had somewhat heated negotiations over the comp plan. It was a $42k base salary + commission with a $56k OTE and $65k cap. I asked what I was meant to do after I hit the cap; to which they replied, \"Continue to do your job?\" as if I wasn't going to have a problem with generating new business for free. I said that I was gonna need a bonus structure beyond the cap if they wanted me to do any more hunting after that point. I made it clear that I'd service my accounts when they called, but I wanted to be clear that they were going to be disappointed if they expected me to make outbound calls looking for new business after I'd maxed my comp plan, and that I'd definitely enjoy the extra time at home with my family over the holidays. They said they understood, and we went through the onboarding. \n\nI worked almost exactly 40 hours for almost 2 months (early October- early December) before I had jury duty and missed a day. My check was about $150 light compared to what it had been, so I complained to payroll (benefits kicked in at 90 days). That's when I found out I was making $21/hr and was not, in fact, pulling a salary. Presumably, this was to force me into the office, as we didn't have remote access to the local network that logged our hours, just the ordering/inventory software. I didn't get even a prorated Christmas bonus because that counts as \"benefits,\" and you have to work 90 days to receive those.\n\nCue malicious compliance. \n\nI discovered that if I left the house 30 minutes earlier, my 80 minute commute would take less than 25, so instead of showing up around 8:30 and chilling in my car for a bit so I was working at 9, I was there at 7 with the warehouse guy, sending emails. \n\nI started working through lunch as I ate at my desk as opposed to burning an hour off campus or in the break room (I didn't even realize I was losing an hour/day to lunch )\n\nI also discovered that if I stayed til 6:30, I'd get home by 7, as opposed to leaving a little after 5 and getting home around 6:30.\n\nSo, I spent an extra 5 hours/wk away from home and worked an extra 22 compared to the 35 I was getting paid for before I figured it out. \n\nWith the OT, I was clocking north of $2k more than intended every month, and oddly enough, no one even noticed until the internal auditor verified W2's and noticed that I made significantly more than the branch manager. \n\nI didn't hit my commission cap until late November, so I spent the rest of the year \"training\" with the tech and/or warehouse guy. Both stoners.\n\nThey tried to put me on the same salaried comp plan I'd originally agreed to, but it was enough of a pay cut to qualify for constructive dismissal, so I got to quit and still collect unemployment for a month before I found another gig",
        "permalink": "/r/MaliciousCompliance/comments/momao7/oh_youve_made_me_hourly_instead_of_salary_because/",
        "comments": [
            "I recently had a company of only 200 employees tell me they dont do offer letters because they are a small company. EVERY company I have ever worked for GINIRMOUS (100k employees) OR TINY (30) did offer letters. I want terms and pay spelled out so there's no waffling or backtracking.",
            "Just one thing confuses me, does your contract of employment not detail your pay structure?",
            "I'll never understand managers/owners who try to \"save money\" by underpaying sales people. Literally every dollar that salesperson takes, home, she's putting 5-10 dollars into the company. \"OMG, this guy made us too much money, let's shut him down.\"\n\nIt's like if you were buying $5 of materials, putting in $5 of labor, and selling the widget for $20. \"That third shift made 1000 widgets, that cost us $10,000! Shut it down!\"",
            "I work for a city, and at one point the police department ended up working extra hours because one of the employees was out on extended sick leave. \n\nThe way their contract was written had something that basically said they would cover shifts for ill employees without extra pay as long as it was less than 2 hours per shift. So people would come on 2 hours early or stay two hours late. Always seemed fair to me since everyone did their part. \n\nAnyway police threw a fit about the contract they basically wrote and demanded that they get OT or didn’t have to work extra. They were all salary employees so this wasn’t usually an issue until now. City Council said that they didn’t have to work more than 40 hours a week and they would just go without police coverage part of the day, usually in the middle of the night to early morning. If they did work more than 40 they would get double time. \n\nThing is, they modified the contract that covered all emergency personnel for the city that said we didn’t have to work more than 40 hours a week. \n\nThose of us over at the fire/EMS department work 96 hours a week. 48 hours on, 48 hours off. Since the contract changed the council made it do over half our week was now double time. \n\nCouncil shit a brick once they realized they just gave us huge raises and said that the contract didn’t include us in wage increases (which it absolutely did). They rewrote it in a way that said we didn’t get the pay increase the police were getting but missed the part about not working more than 40 hours.\n\nHalf way through the first week after the change we asked them when they were going to hire a bunch of new medics to cover the rest of the week, since we had already all capped out our time. \n\nNow as an agency it would be illegal to not respond to emergency medical calls (failure to act). But since we were no longer allowed to work more than 40 hours, we were going to have to leave our first shift 8 hours early and it was on the city to make up for the lack of available employees. \n\nWe ended up negotiating a new contract that included some things we had been asking for for years and we continued to work our normal shifts, but it was fun watching them try to explain why it was okay to bend over backwards to do whatever the police wanted while trying to screw over the medics and firefighters. Local paper had a field day with that.",
            "So, you apparently signed something saying \"yes, I'm salary\", and then you weren't?\n\nScrew malicious compliance, that's a contract lawsuit giftwrapped.\n\nUnless of course you didn't sign anything and these negotiations were verbal.",
            "Yeah,\nThe best way to not motivate your sales force is to give them a quota with no bonus structure.",
            "My husband is in sales. He landed their biggest project yet by several zeros and then the day of, once the purchase order went thru they capped his commission. It fully prevented the commission from matching that PO %. Im still ugly mad over it and it's been 3 yrs.",
            "I've never understood the logic of putting anyone in sales on a structure other than commission or base + commission. You're giving them an incentive to stop selling (or never sell at all if they're straight hourly)",
            "Growing up one of my friends dad was always home. I thought he was a deadbeat but apparently he had structured his sales contract so well that with one big sale he was set for life so long as if renewed. I was 12 when he explained it to me so I don’t know the details of his contract but basically he made a nickel for every case of juice that sold through his contracts. He had secured the contract for a national chain of grocery store.  He had some other small contracts he managed as well but once he got that big fish he capped out his commission and decided to do the bare minimum. He attended meetings and would help when it was asked of him but basically he just checked email a few times a day and answered the phone when it rang. He would obviously also check in regularly with his big fish to make sure they were happy.",
            "They tried to screw you over and you got your MC revenge. Well done!\n\nI gotta say though: after working in IT, building sales tools for over 10 years, sales people are generally the most demanding and pampered employees in the company. Their coin operated attitude can be pretty toxic, especially when you have sales engineering or other functions involved.\n\nWhen IT has to work weekends or late, to conference with offshore, they don’t get more money, but don’t you dare ask a rep to lift a finger for anything that doesn’t contribute to quota.",
            "Who the everliving fuck just gets to decide a limit for how much money someone is allowed to make with their sales?",
            "I've worked sales jobs where I had an hourly wage & a cap on my commission I could make for each pay period. Once I met my max commission I would push off sales leads until the next pay period. There's no incentive to bring in new leads when I didn't get commission for them. But pushing them off, even for a short time, could mean we lost that potential customer. Unfortunately the management & owners never thought about that or maybe didn't care? It's a stupid way to set up pay structure for sales positions. The company is the one who loses out, not the employee.",
            "Sales really sounds like hell😭",
            "I just did the math and at $21 an hour plus 2k equals about 67k per year. The same amount as your cap, plus you have to work a ton of overtime. Am I missing something?",
            "” Good paper makes good friends” comes to mind here.  Glad it worked out in your favor, but I'm surprised you didn't get an offer letter.  \n\nFunny story, our HR department sent out offer letters as .docx files until we had someone edit one and adjust the compensation.",
            "Capped commission is the dumbest thing any company can do. If I have to pay someone 15 cents (or whatever the rate) for every dollar they bring in, it's a no brainer. Why would anyone continue to bring money in after they stop getting paid for it.",
            "Reminds me of my tax accounting class. \n\nPeople will actually turn down money to pay less tax. Yes, if you get an extra $1K and pay $300 in taxes you’re paying more taxes. But you still get the other $700.",
            "You saved an HOUR on your commute by leaving earlier?! Holy shit, traffic",
            "Obviously this is rather trivial, but I have a small story add. \n\nA few years ago I was working as a supervisor at Burger King. They decided to switch the pay structure for assistant managers and general manages. Previously they both got bonuses.\n\nSo I'm told I can her bonuses for being an assistant. Cool, right? Well, I get promoted and then told \"lol nevermind, we changed it. All new AMs get no bonuses\". So I just totally stopped giving a fuck. Drive through times? Horrible. Food quality? Horrible? Inventory? Hardly tried! Why? Because I have no incentive to. Corporate were spinless and never fired anyone.\n\nSo I basically ran one of our best performing stores into the ground by not trying anymore. Sales went down, ratings went down. Kept getting bitched at. No punishment and no reason to improve? Why should I try harder?",
            "Experienced the same situation although I am an auditor. They ended the commission structure & put everyone on salary one division at a time. I was in the last group to be put on salary (because we were the highest producing area) Guess what happened once we were on salary? Hint, we were no longer motivated to grind to meet budget, no more staying late and everyone working 40.00 hours a week, no cap.  Also all of a sudden everyone started taking their paid time off/vacation and the audit suddenly became much less profitable [insert surprised Pikachu face] Penny wise and pound foolish. Oh and once commission no longer reflected our efforts, mass exodus i.e loss of industry skill and experience (which also meant less skill remaining)",
            "I'll never understand capping commission. I could see it being a cashflow problem if payment is made on net30/60 terms, but I would find a way. \nCome work for me and make $250,000 in commission a year, I dgaf so long as I'm making money.",
            ">I discovered that if I left the house 30 minutes earlier, my 80 minute commute would take less than 25, so instead of showing up around 8:30 and chilling in my car for a bit so I was working at 9, I was there at 7 \n\nAmazing how this works, considering rush hour.  When I figured this out, I was nearly euphoric.  Well, as euphoric as you can feel having to commute during rush hours.",
            ">I made significantly more than the branch manager\n\nFantastically malicious! 🍀",
            "Another example of a cheap manager thinking they're being clever, and turning out not to be quite so cheap after all.",
            ">I worked almost exactly 40 hours for almost 2 months\n\nShit, 40 hours in two months, you missed like, 7 weeks. That's a dream job right there.",
            "And here I am working without commission like a chump every day",
            "Can someone explain the logic behind capping commissions?\n\nI mean the company is losing money because no one capable of reaching a sales cap is going to keep working at it.\n\nWhat exactly is the goal and why is it so common?",
            "You must live in the Seattle area based on your description of traffic alone.",
            "Constructive dismissal?",
            "Isn’t it illegal for an hourly employee to skip breaks/lunch? Just curious...?",
            "Do you not get written contracts of employment in the states? \n\nI'm pretty sure it's mandatory here in the UK. I've never checked the law, but I don't know of a single person who hasn't had a written contract for their employment. Everyone I've ever known has had the ability to check their contract when discrepancies like this happen. It's pretty much to first thing we do as employees here when something doesn't seem right. Check the contract see if we inadvertently signed up for whatever BS the employer is trying to pull before going to HR.",
            "Good for you brother. Fuck the system. Give em what they wanted to give you! So happy for you partner :) keep it up",
            "You seem like a professional guy. How do you work, get a paycheck, not check that paycheck until the 3rd month? I don't understand that. I literally check all my paychecks line by line every month to make sure I'm paid correctly.",
            "Your description of the commute perfectly matches Austin right now. 30 minutes to get in most of the time, 85-90 at the wrong times.",
            "Why do companies even have a commision cap and not just pay commission, whatever it is?",
            "I never understood commission caps when commission based compensation is at play. \n\n“Oh wow this successful salesman is making TOO many sales. Let’s disincentive them from making more! And this makes sense because commissions are built into our sales price so that we can still make a profit.”",
            "Where’s the malicious part? Just sounds like you have a good gig. They don’t control your commute.\n\nThink I’m starting to understand why sales was never my thing just from reading your post.",
            "“The quotes are because it was at least equally outside sales, I just didn’t go outside except to smoke”\n\nWhat in the world does this mean?  You know “outside sales” doesn’t mean actually selling things outside, right?",
            "nicely done, looks like they caught you around late 20's/early 30's in this almost trap. nice job flipping it on them, takes the courage of an adult to push back like this....many people don't know how to win at the game of life like this until at least early 30's.",
            "I don't understand why you would make a commissioned sales position and then cap the earnings.\n\nPresumably, they make money when you do, so why wouldn't they want to keep that rolling.  If they don't make money until after you 'cap' then they have no business running a business.",
            "i lost it when the shit hit the fan",
            "What the hell do you sell? \n\nOr is it you? \n\nCongratulations either way!",
            "\"They tried to put me on the same salaried comp plan I'd originally agreed to, but it was enough of a pay cut to qualify for constructive dismissal\"\n\nCould you tell me more about this if you would be so kind.\n\n\nI work IT and our last HR guy ~2.5 years ago put the department on salary.  Now they want to switch us to Hourly.  Now we never pulled a LOT of OT but I am interested in where the line is.  Thanks!",
            "I’ve seen this episode of ten office already",
            "This, on top of ethical issues was something that made me walk away from a sales and marketing career and not look back. It doesn’t stop by the way. It’s always a “production breeds absolution” industry that is always trying to tame and trick and take more, and will churn and burn everyone except the financiers",
            "The rush hour in your place seems insanely short if leaving home at 6.30 am and leaving the office at...well, 6.30 pm, is enough for you to dodge traffic jams...\n\nI used to have a 15-20 minutes commute w/o traffic (only on week-ends and late evenings of course), and 30-40 minutes w/ traffic. \n\nBasically, if leaving home sometime before 7.30 am made the trip \"decent\", I was doomed to traffic and an average speed of 10 mph if I left the office sometime between 4.30 and 7.00 (even 7.30 on Fridays).\n\nAnd even I did not have a hourly schedule, I could not really leave the place before 5, that would have been...weird.\n\nSo I figured I would just show up at 9.30-10 and get out after 5.30-6. At least I could sleep past 6.30 am.",
            "My company was purchased by a larger one years back. In 2019 they made a change to the online employee handbook and sent a small email. No one really paid attention, but it took away hundreds of hours of PTO that folks had earned over the years in my company.\n\n If they leave, the company doesn't have to pay them their PTO  time in New Jersey or New York. You can't  take two weeks of PTO  and then leave. If you work in Massachusetts, you must be paid for it. Sick days are different, you have to be paid for them, which is why I'll never use my sick day.",
            "You are clearly to smart for that company. It's dimming you and your work. What do you do now?",
            "Sorry, I'm still caught up on how you can class _doing your salaried job_ as working for free.",
            "God damn you should be making much more than that my dude. Sales is fucking brutal. You're constantly reset every single month/quarter/year. Plus if you're working with the general public, even worse. I left a couple years ago, and yes I make significantly less now, butttt I'm not balding anymore nor do I have heart palpitations so I'll take it as a W.",
            "I've never heard of constructive dismissal. I do recognize reindeer games when I see them.",
            "I’ve been an engineer for years. What I discovered is that the sales team is 100% the most important. If you’re not selling you’re definitely not building anything new.",
            "With the I quit parentheses is that in the context of smoking or your sucky job",
            "Does anyone else feel like OP seems to interpret \"outside sales\" as standing outside smoking? Or am I the only one?",
            "I love how smart you are.\nSincerely a stay at home mom who previously worked My ass off for a small consulting group and got screwed.",
            "Okay, MC or not you were still working 11+1 hour days to game the system, and you were still working 8+3 hour days before, and either way that's fucking toxic.",
            "You get a base salary and commission, why do you think you can stop work when you reach a commission cap? You’re still being paid a base salary to work, so you should work."
        ]
    },
    {
        "post_id": "npnnwt",
        "author": "yllwdy",
        "title": "Boss says I don’t know anything yet so I do the absolute bare minimum.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/npnnwt/boss_says_i_dont_know_anything_yet_so_i_do_the/",
        "score": 19485,
        "num_comments": 872,
        "created_utc": 1622529737.0,
        "selftext": "Some background: \nI started my first, full-time, office job at a corporate America hell hole a week after college. It was an industry I hadn’t worked in before and I needed to be licensed. The company that hired me, we’ll call them Smith Inc., paid for my licensing fees, study materials, classes, etc. for me to become licensed. The total cost was about $500. It was a sweet deal. They gave me approximately 90 days (paid) to study a textbook and pass an online course. I didn’t have to do any work for the company, simply study and pass the licensing exam. It was pretty easy and I passed on my first try. \n\nMy boss, let’s call her Mary, was super excited that I passed and I began training under an associate level coworker who had just been promoted from the position I was in. The coworker, Jen, was super great and helpful. She began training me on two simple tasks that I could do, the only rule was if the client had a question specifically about their contract, I would ask Jen or forward it to my team-lead. Well, I ended up getting an email from a client about their contract and I video called Jen to ask how to handle. She walked me through it as I shared my screen with her. I wrote the email back to the client exactly how she told me and she read the email before sending. \n\nA month goes by and everything is great. I’m learning and getting more comfortable. Then I get a really nasty email from Mary. She CC’s my whole team into the email going on and on about how I cannot answer contract questions and how she’s gone over this with me before (she hadn’t, Jen was the one who told me I can’t answer contract questions). Both Jen and I try to explain what happened and that Jen was the one who wrote the email, I just typed what Jen said and sent it from my email since the client emailed me and not Jen. Mary then calls the team up in a video call and goes on about how I don’t know anything and I just started and I really dont know how this industry works and that answering contract questions is out of my job description. It went on for about 5 minutes. I say “Okay.” and get off the call crying. \n\nThe next day out of pure pettiness I simply do the absolute bare minimum. I don’t know anything, right, Mary? I still complete all my tasks and everything that’s required of me. Anything more advanced that I would normally try to learn with Jen’s help? Nope. I just forwarded it to our team lead and said “Sorry, Mary said I can’t do anything outside of my job description!” Work was much less stressful after I decided to listen to Mary (and what many others told me before) don’t do anything outside of your job description!\n\nAlso: Mary later fired me for being a whistleblower when I reported the company to the health authority for violating COVID protocols. I sleep better at night knowing how much money Mary wasted on training me.",
        "permalink": "/r/MaliciousCompliance/comments/npnnwt/boss_says_i_dont_know_anything_yet_so_i_do_the/",
        "comments": [
            "[deleted]",
            "Here in the UK there are safeguards to protect whistleblowers. They can't just fire you like that, it's unfair dismissal and you would be able to take them to claims court",
            "I worked, very briefly, as a patent paralegal and during the interview process I made it very clear that I wanted to continue to take classes.  I worked 9-5 and my classes where from 6-9 and all day on weekends.\n\nI was assured that they absolutely support their employees higher education goals and that my time outside of working hours was my own.\n\nLiar liar their pants on fire!  It took about two weeks before they tried to screw me over.  They were working on a big project and I left at five to make my class at 6:30 and when I arrived at work the next day I was pulled into my team leaders office and was accused of dropping the ball and abandoning my job for leaving at 5.\n\nThis guilt trip bullying went on for most the entire year I was there but I always referred back to our interview when they tried to lean real hard on me. When I finally quit it was like a huge weight I didn’t even know was there got lifted off of my shoulders.\n\nHowever I absolutely know I twisted them into knots way more than they twisted me.  From what I heard from my former co-workers I kept in touch with it turned into a complete shit show after I left.",
            "That you-cannot-email-clients-re-contracts might have been a legal requirement. Boss handled it poorly still. Jen may have advised you wrongly.\n\nWhy am I getting flashbacks to Boiler room reading this post :p",
            "Forget all these people who are telling you that you can be fired for \"unrelated\" issues and there isn't anything you can do.\n\nCall a labor attorney, tell them the story. If you were suddenly terminated with no history of write ups, you may have a case.\n\nTake legal advice from lawyers, not the internet.",
            "Rule for GOOD managers:\n\nPRAISE in PUBLIC.\nPUNISH in PRIVATE.\n\nMary is not a good manager.",
            "Reminds me of this boss I had who was a network administration for the company.  People assumed since he was in IT he would handle anything computer related, so they'd always come up to him asking for help.  He would listen and nod, approvingly, then after they were done talking he would say \"that's not my job\" then walk away, rofl.  Miss that bloke.",
            "Mary sounds quite contrary. What a b",
            "Here in Australia we have whistleblower protections to prevent revenge dismissals.",
            "If you have proof you were fired over whistleblowing you might be able to sue Mary and the company",
            "I've used the same energy at a few different companies. I'm an electrician, and not only did I start young, but I looked young at the time. \n\nSo kind if industry \"teambuilding\" is to haze the new guys by sending them on fools errands. Looking for nonexistent tools. Like skyhooks, left handed bender, wire stretcher etc. \n\nSo last few companies I worked for I was in MC mode. Think I'm new and dont know anything? Game on.  \n\nSo I'd get sent to find something and told dont come back without it. So I would find a nice hideyhole, pull oit a book and disappear until quitting time.  The person that sent me is laughing his ass off, cause I spent all day looking for it.  I'm laughing inside because i didnt do shit all day. And big boss is upset that I played guy 1 like that and didnt work all day. But cant do anything as I was following \"chain of command\"",
            "I’m pretty sure you can bring down the legal hammer on Mary in most countries if you can prove she fired you for whistle blowing. And if the only bad part of the job is Mary you could probably get you job back and get her fired if you do please.",
            "> Also: Mary later fired me for being a whistleblower \n\nDoesn't this mean you can sue them? I thought whistleblowing is protected in some capacity",
            "Lol did you get an attorney? Your firing was illegal and you could seriously make $$$ with a lawsuit against her.",
            "Before you left did you give Mary a new desk nameplate?  One that says \"Karen\" ?",
            "Me, in high school newspaper class: having a bout of writer’s black (edit: writer’s block)\n\nMy teacher: you’re being useless\n\nMe: oh really? Well boy oh boy are you about to find out. \n\nMan that lady sucked.",
            "Mary Mary why you buggin",
            "Hope you filed for unemployment.",
            "Mary ought to be locked up. Firing whistleblowers should carry a multiple year sentence, regardless of how small the matter is.",
            "Yep. Mary is a typical manager who doesn't know how to trust the people who she has working for her. Good job OP.",
            "It's legal to fire someone for whistleblowing on your employer for failing to uphold health and safety protocols?????",
            "Mary wasted no money, the company did...",
            "You could be in for a real windfall for being fired for whistleblowing. Might be worth consulting with a lawyer.",
            "*Mary later fired me for being a whistleblower*\n\nPlease tell me you sued them for that and got compensation!",
            "You got fired for whistleblowing? Isn’t there federal regulation protecting whistleblowers from backlash? Is this not illegal, or am I stupid?",
            "Depending on the labor laws in your country, that seems like a wrongful termination lawsuit waiting to happen. Firing someone for reporting you for violating health and safety requirements?",
            "If you can prove their reasoning for firing you, you could absolutely win a lawsuit against them,at least if this was in the US. Workers are protected from retaliation in cases like that.",
            "That's literally illegal, that's not a valid reason to fire someone.",
            "Blowing the whistle on your work place sounds terrifying. Mad respect to you for being able to do it",
            "One key lesson is this: if it _looks_ like it came from you, it came from you.  If it's not from you, make sure it doesn't look that way.\n\nThis is the opposite of getting credit for someone else's work - you got the lumps instead.",
            "I got fired because I refused to do something that would put myself in harms way LOL",
            "You'd sleep even better if you sued for being fired for whistleblowing.",
            "ESH",
            "GOD this is a concept that has been nearly impossible for me at my current (soon to be former) job. DON'T DO ANYTHING OUTSIDE OF YOUR JOB DESCRIPTION",
            "I currently have a boss like this.  When I first started in my position, she told me that if I was emailing someone that is at a higher level than me, she wanted me to CC her.  This was understandable as I can appreciate wanting to be kept in the loop.  However, she would then message me afterwards and criticize how I worded my email, some information that I should have included / should not have included, the format of my email (\"you need to use bullet points when making a list, not a numbered list!\"), and various other minutiae.  And honestly, there really wasn't anything wrong with my emails -- she was just extremely insecure and a micro-manager.\n\nI finally got sick of being constantly criticized so I started sending her drafts of every email I was planning on sending, and asked her to approve the draft or to send back her comments so that I could edit it and then send it back to her for approval.  She got very angry when I started doing this, but I told her that I didn't see any other solution since I'd never managed to send an email that she didn't have a half-dozen issues with after the fact.  \n\nTo make matters worse, I'd do this when she was out of the office, so oftentimes she wouldn't see the email until a day or two after I'd sent it to her.  Some of these emails were time-sensitive, but I'd explain to the person asking for information that my manager needs to approve the contents of any emails that I'm sending, so it might be a day or two before they received a reply.\n\nShe eventually ordered me to stop sending her drafts of my emails and to just go back to CC'ing her.  She also stopped complaining about the contents of my emails, but when I mentioned to her one day that she hadn't complained about my emails for awhile, she claimed that it was because I had \"learned how to properly write emails\" so I no longer required her assistance.",
            "Depending on the jurisdiction of Mary fired you for whistleblowing specifically then she is acting against the law and in some places firing someone for whistleblowing is against the law. Might be worth and look and if it’s the case (and you not outside the time limit) I would sue the company y",
            "Mary sounds like a flaming bitch who shouldn’t be in management",
            "Just throwing this out there; their are plenty of fields/contexts where you retyping what Jen says and presenting it as from you (your email) would be a complete violation of either their code of ethics, regulatory law, or other compliance. It sounds like Mary was protecting the Smith Inc, and you lol.",
            "TBH, you only did yourself a disservice. While your boss did not handle the situation very well, you lost out on learning experiences that could have helped you get a job for a better company. I'm not saying it is right, but when breaking into a new industry, especially one that requires 3rd party/government licensing, you may have to work for a shit employer for a period before you have enough experience to move companies. But it's important to learn as much about the industry while you put in your time with said ass hats.",
            "You could report her for firing you for being a whistle-blower. There are laws protecting people from retaliation by companies and employers for reporting them.",
            "Isn’t firing someone for that like illegal? It doesn’t seem fair",
            "> Also: Mary later fired me for being a whistleblower when I reported the company to the health authority for violating COVID protocols.\n\nIANAL but...that sounds a lot like wrongful termination. I think that’s worth looking into.",
            "Sounds like you were doing Salesforce work.",
            "I hate to say it but many bosses are insecure and seek security through the means of belittling subordinates.",
            "I had a similar, although more positive, experience with my previous job. I came from a background in contract work where I would regularly work 60-80 hrs per week on stringent deadlines. At my new job, we were preparing for our annual convention and I was trying to offer helpful ideas on how to improve the process. I was used to being required to make an immediate impact.\n\nMy boss, having heard enough, told me to hold my ideas until I've been through a few. I was like, \"But this is an *annual* meeting. Are you saying you don't want to hear my ideas for several *years*?\" He said yes.\n\nI had never been afforded the time to learn something that well before taking over responsibility. It was quite refreshing. They paid me well enough to decide how best they wanted to use my time. By the time I took over the planning for that meeting, I knew every facet inside and out and was able to make meaningful improvements.\n\nI worked there for 12 years, and is still the only place I've ever worked that gave me all the resources I needed, and time to learn. It didn't always move as quickly as I wanted, but things generally went in the right direction.",
            "My organisation tried to kick me out twice last year. Now I do bare minimum and take personal time offs every month.",
            "Every time I try to exceed the bare minimum at my current job I get more restrictions put on me. I barely do my job now. Get told how great I’m doing from time to time but I’m not actually doing anything",
            "> Mary later fired me for being a whistleblower when I reported the company to the health authority for violating COVID protocols.\n\nFuck. I was hoping it'd be a better happy ending for you :(\n\nOffice drama and bitchy superiors/coworkers are always so annoying, especially if you're new and not \"properly setup/trained\" to do some particular workflow. I hope you found a better place and had a much more enjoyable time after this terrible experience though!",
            ">  Mary later fired me for being a whistleblower\n\nisnt that illegal?",
            "My old boss used to say everyday was my first day. I would just say “you pay me by the hour anyway”",
            "Depending on where you live, there is protection against firing whistleblowers and you may have legal recourse.",
            "Did you also report the employer for retaliation for making a whistle-blower complaint. You are federally protected and they would get a massive fine as well.",
            "Sounds to me like you could sue the company for retaliation, since she fired you for whistleblowing. But I'm not a lawyer, and cant say I know much about the law, so I could certainly be wrong about that.",
            "Somebody was working in insurance is what it sounds like to me :-)\n\nOnly job I was ever fired from. And laid off. Yup, laid off and fired, for coming in early. Screw that industry!",
            "This is the way",
            "Reading this has brightened my day. Thank you",
            ">fired me for being a whistleblower \n\nI'm pretty sure you have the basis of a really good court case",
            "Never go above and beyond. Corporate America will suck you dry, steal the value of your labor, and toss you aside 30 years later, a broken person who spent their best years slaving away.",
            "Good for you!",
            "For the people telling you to learn to take criticism better.... no. Don’t stand for abuse in the workplace. It doesn’t matter if you did something wrong, we need to stop accepting that this kind of attitude and treatment should just be tolerated in the workplace. I hope you find happiness and support in your next job.",
            "Don't get me wrong, the boss' reaction was uncalled for and highly unprofessional but I'm not sure you're in the right here. When I was training to be a customer support at an airline there were things I was asked not to handle at the beginning. Even with the help of my direct supervisor, cause even she didn't know everything and those were sensitive issues. There were cases where we just forwarded a case to the boss. I made mistakes even with the supervisor babysitting me. My boss understandable was not pleased with those. However, even with being a lazy ass I still did my best to not repeat those mistakes. You made a mistake, your boss had a shit way of dealing with it but the fact that you just... did absolutely nothing to improve afterwards? And even increased workload for everyone else on your team cause you were feeling petty? Do you really consider this to be a good work ethic? If this was AITA I'd be calling ETA.",
            "So, you sabotaged your own career over some petty office politics.  Great way to start off.",
            "When you “don’t know anything” you do your best to learn. You don’t just give up and do the bare minimum or your salary won’t be increasing. However, the fact that multiple people said that is a red flag and you don’t want to work for people like that looking down on you.",
            "I worked for a company right out of college.  I busted my ass and got a couple decent raises, promoted to supervisor.  One day I was talking to the director, and advocating for a pay raise for one of my employees.  I jokingly suggested that I needed another one too, and he looked at me and said \"You're done getting big raises\".\n\nI instantly stopped caring about work from that day forward.  Stopped doing extra work and stopped trying to encourage my employees to be more efficient.  From that moment onward the entire team just did the bare minimum to get by.  \n\nWhat a stupid thing to say to an employee.",
            "You should check into whether or not the circumstances of your firing are actionable.  I would bet a lawyer would listen to that story for free.",
            "I was waiting for a juicy malicious compliance.....and all it was you just did the bare minimum? \n\nWhy does this post have so many upvotes?",
            "Damn are people really this sheltered?",
            "You sound like a difficult employee with a bad attitude and they were probably glad to have a reason to let you go.",
            "You got fired for being a whistleblower? Hmmm sounds like you need to get a lawyer.",
            "Anyone know what her issue was in the infield",
            "[deleted]",
            "Sounds like the company is lucky to have gotten rid of you.",
            "You had me until your COVID nonsense.   Whistleblower my ass.",
            "I would fire you.",
            "You had been working for a month at that point doing just the basic tasks. Your boss was correct in saying that you don't actually know anything. \n\nThey were obviously unprofessional but I can't believe you would just completely shut down from the smallest mistake because your boss is potentially trying to cover everyone's ass. \n\nAnd your job description isn't a legally binding contract saying \"OP only has to do these things to be employed\" there's always a line in there about extra responsibilities as expected.",
            "Welcome to corporate America champ!!  College is over and the corporate cucking begins!!",
            "Tbh sounds like you’re soft . It’s a fuk u fuck them mentality in the corporate world. Even if a person actually offends you, you have to learn to truly not give a shit.",
            "I hate to say this, but this is one of those where I'd love to hear Mary's side of things lol",
            "Sounds like you didn’t do malicious compliance, you just did your job. \n\nAnd Mary isn’t even the bad person in this story and you’re not the hero for trying to do more. She’s just a normal and honest boss.",
            "For everybody on here that hates where they work, I have one word for you: FlexJobs(dot)com. I improved my life, and you can, too! 🌈",
            "Firing you for being a whistleblower? That's a lawsuit.",
            "Aren't there laws protecting whistleblowers? Assuming this is the States",
            "Isn’t it illegal to fire whistleblowers for being whistleblowers?",
            "Sounds like a lawsuit for wrongful termination. Literally retaliated on you for reporting them for breaking the law/public health orders. Just saying",
            "OP you got fired for being a whistleblower? Have you looked into legal action as that’s not okay",
            "I hope you have gotten better at handling criticism. You may see it as a victory but to me it reads like your boss set boundaries they wanted you to adhere to, you cried and decided to do as little as possible out of spite. Then you take pleasure in the fact that the company that took a chance on you and helped get you licenced wasted their money doing so. Your boss doesn't sound like she was abusive in any way and if you think a boss has to be right before they tell you what to do you still have a lot to learn. Hopefully with experience you will gain more maturity?",
            "Damn you have absolutely no fortitude and from what it sounds need to see a therapist.  Surprised you got the job at all in the first place.  Attempting to fuck over your employer because YOU did what you weren’t supposed to is quite low.",
            "This person sounds like an awful manager, not a great idea to start building your career with a doochebag for a manager. \n\nCurious though what COVID protocols though? COVID is over in the US as a real threat.",
            "You failed the first test, listen to your boss. You were wrong and Jen should have but didn't know better. Take your spank and move on. Or not and be fired from your first job.",
            "“He’s a don’t-get-poor-slowly scheme",
            "So you had a new job fresh out of college and a proper boss but quit because you had one shitty circumstance with another boss?   Your retaliation ended up doing nothing other than fucking your old coworkers.  Better luck next time, but don’t expect sunshine and rainbows from the job market."
        ]
    }
]