[
    {
        "post_id": "7msv0r",
        "author": "jhoudiey",
        "title": "No, I don't have a belt.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7msv0r/no_i_dont_have_a_belt/",
        "score": 19242,
        "num_comments": 675,
        "created_utc": 1514532020.0,
        "selftext": "Many years ago i used to work for bestbuy, and part of the uniform was a black belt. Now, I worked the night shift stocking the shelves with 10 other people or so and no one else. For months no one gave a fuck, but right before Christmas they changed store managers and the new one was a humorless dried up sack that was a dick to everyone. If she couldn't find anything wrong with your performance she'd find *something* to write you up for.  Admittedly, i never followed the dress code exactly, my pants stay up just fine - so fuck wearing a belt.   One night she of course comes up and essentially throws the employee handbook (or whatever the fuck document it was), with the dress code at me. \n\n\"You need to put a belt on\"\n\n\"I don't have one, I'm broke as fuck\"\n\n\"Well go buy one before work tomorrow or you'll be sent home\"\n\n\"Sure, i don't need to eat, I'll get a belt instead of lunch\"\n\nShe clearly missed the sarcasm and walks away, leaving me with the dress code. Upon inspection i realize it says something like \"belts will be worn with all pants with belt loops\". Clearly these pants weren't the best quality so i took pleasure in sawing off my belt loops when i got home. The next day I get to work and she comes up to me and asks \n\n\"Where's your belt?\" I stare at her and say \n\n\"Where are my belt loops?\" \n\n\nShe was fucking *livid*",
        "permalink": "/r/MaliciousCompliance/comments/7msv0r/no_i_dont_have_a_belt/",
        "comments": [
            ">Part of the uniform was a black belt.\n\nAll I can see is a bestbuy dojo for special employee training.",
            "This is without a doubt one of the pettiest /r/maliciouscompliance I’ve read in a while. Bravo op. ",
            "Why is this NSFW?",
            "You threw her for a loop. Nice work.  ",
            "A guy I used to dat got hired at best buy for the geek squad.  This was like 10 years ago.  He had this huge Scott Ian from anthrax goatee.  The fucker was like 8 inches long.  The employee handbook said employees must be clean shaven, no beards or facial hair permitted, etc etc.  But it also said something like we cannot discriminate against your religion and religious attire (think like a hijab or something) or ask questions about your personal religion.  At his orientation he said \"I'm Muslim, I can't shave my beard for religious reasons.\"\n\nGot to keep the beard. ",
            "[deleted]",
            "“My belt holds up my pants, but my belt loops hold up my belt. What’s going on down there? Who’s the **real** hero?”- Mitch Hedburg",
            "I worked at a place where the dresscode was collared shirts. I'm a software dev, TShirts are life.. I ended up buying a slew of tie-dye polo style shirts to comply. Eventually they let us dev wear whatever.",
            "Good job on taking advantage of loopholes. ",
            "I remember going to Best Buy for an interview right after school, I didn't have time to change, but I did wear a nice polo and jeans.\n\nI showed up and asked for the person giving me my interview and waited about 5-10 minutes for them to make their way to me.\n\nHim: \"You aren't wearing khakis\"\n\nMe: \"I didn't know I had to and I came right from school.\"\n\nHim: \"I'm sorry, I can't interview you if you aren't wearing g khakis. We can reschedule if you want.\"\n\nMe: \"No, thanks though.\"\n\nWhat the fuck? Who requires khakis for an interview?! Especially from a 16 or 17 year old?",
            "I always used to offer to buy a belt for employees that refused to wear them because of money issues. Either they would stop being cocks and just buy a damn belt or they would take the money. Either way they had a belt. ",
            "When I read the title talking about a belt and the post marked NSFW I thought this story was going in a completely different direction... ",
            "I prefer suspenders and typically pick out the belt loops on most of my dress slacks.",
            "The thing that always annoyed me in retail is that often the dress code is always enforced very strictly for guys but women can do whatever the fuck. No shorts allowed for guys but girls can all wear skirts without anyone saying a word; shirt needs to be tucked in for guys but half the girls walk around with theirs untucked, no one says a word; have to wear khakis for guys but girls can come in wearing tan colored yoga pants...no one says a word.\n\nShit was annoying as fuck.",
            "Reminds me of the military. I pulled shit like this sometimes, and it was always interesting interpreting their reactions to it. In a case like this one, she should be happy af that you're following the rules to a T now, but instead she's livid. Just shows she doesn't give a fuck about the rules, only telling people what to do.",
            "why's this NSFW?",
            "You really found a loophole in her argument.",
            "Is it really too much to ask to wear let alone possess a black belt?",
            "Wait wait! What happened after? Did she yell at you to buy pants with belt loops so then you also had to buy a belt?",
            "I thought for a second I was in /r/factorio and was about to lecture you why belts are superior to bots.",
            "\"I'm broke as fuck. I work here, remember?\"",
            "That's fantastic. Managers who pull shit like that can fuck off.",
            "I don't get it. Why do they require fucking _belts_? Isn't there something more important care about?",
            ">She was fucking livid\n\nThat's news to me.",
            "They pulled the \"shirt must be tucked in\" thing on my department when I worked there. It's fine for sales, but we would routinely lift above our heads, and our shirts would come out sometimes. They went at it for like a week, and when they realized that half the seasonal crew didn't even have work shirts, they kinda gave up. ",
            "This reminds me when I worked at Rucker’s. I had been an employee from the day it opened. Then a year or so later the owner decided to hire this dickhead of a guy to be the manager. I would work shifts alone in evenings all the time but all of a sudden I needed a babysitter? He was only five or so years older than me and for he most part we got along. \n\n\nOne night we were standing behind the counter joking around as usual and then his demeanour changed in an instant. He got this look on his face that most women know. He wanted to over power me (not physically). Was on my back that my shirt wasn’t tucked in. Becoming verbally aggressive. It was never a problem before. We wore golf type shirts and they weren’t that long so it never looked untidy. And that night no one was even in the place. I almost quit right there. It was an unnecessary power move.",
            "And then what happened?!?",
            "You took a job and agreed to wear a uniform. She's a dick but you agreed to the terms of employment when you accepted the position.",
            "It was never about compliance for her. It was power. Far too many bosses out there. Not enough leaders. ",
            "You admittedly have zero money so you decide to anger your immediate supervisor at the one job that's keeping you afloat over something as petty as a $3 belt?",
            "Once upon a time, a guy worked for Best Buy and ran into the typical over-aggressive power hungry manager. \n\nBack then the employee discount was really something. (Does F4 Emp#1 Enter F2-print still work?) And this college grad couldn't find a real job during the great recession so he packed up for a sunny location and took the easy job. Made friends and had all the carefree experiences you're supposed to while being extremely underemployed. Fast forward a few months. The job is boring and grad has another higher paying job. He's there for the discount. Comes in once a month, is polite, takes people's orders for TVs, chats with some friends, and goes home happy. \n\nApparently that was a problem for the back-stock warehouse manager. A career Best Buy retail hero who wanted the 100% commitment. Still not sure of the motivations to this day. Anyways, it is important to note the QUICKEST method to fire someone is to catch them abusing the employee discount. **If you work there** and someone starts asking you questions of past purchases, keep in mind they are **not** trying to help you out.\n\nFast forward to a large TV purchase was accidentally rerouted to an old college dorm address. Mistake but hey, shit happens. Well Mr. Manager would not refund the new TV sent to another state! Angry comments and WTFs later and a meeting was set to straighten it out. In a closed door office never before seen began a discussion that was supposed to be about the fate of one lost HDTV. Instead he went over item by item each purchase on the employee discount to force the trap. It didn't work. \n\n\"How can you spend more in store then you've made all year?\"  He showed his had too quickly trying to force the firing and was exposed as hostile. Tried to refocus back on the TV, more frustrated anger ensued. \n\"How many cars do you own?\"   \n\"2 maybe 20, what does this have to do with my TV?\"   \n\"I see you purchased 3 radar detectors\"   \n\"...and?\" \n\nTL:DR\nFuck Best Buy",
            "[deleted]",
            "outstanding",
            "Why is it tagged NSFW",
            "My first thought was whenever I read Best Buy was the video where a few people went in Best Buy wearing a blue polo and khakis and just walked around",
            "I’ve actually been planning to do that with a pair of pants I wear to work (Buc-ee’s) because our dress code is the same exact way and I’m going to cut them off before I go back to work on the 3rd.",
            "My employer has a key 🔑 department because we are still in the stone age. The master locksmith won't issue you keys or cut a new one (for worn out keys) unless you are wearing a belt to clip them to. I wonder if he thinks everyone wears belts out in the buildings. We dont.\n\nI had a key break off in a lock recently on a day I was wearing suspenders. He refused to issue me a new key. Normally I would just spend the day in the break room & bring a belt the next day. I had already started a project so I kinda needed to finish. So I've got some industrial Velcro strips that I just wrapped around my waist. He didn't look hard enough or didn't care. I got my key.",
            "how is this nsfw?",
            "They don't provide a uniform when it's required?  WTF best buy!",
            "[deleted]",
            "Is this supposed to be funny? lol you're telling me that you couldn't buy a belt for a couple bucks from a thrift store in town somewhere? And you can put extra holes in belts if they don't fit if you are that desperate. And you obviously knew the dress code \"for months.\" This isn't even petty. It's just dumb. ",
            "/r/madlads",
            "What's the point of intentionally pissing off your boss? It seams like on the long run this won't really have positive effects on your life. ",
            "Honestly you are the type of employee that I would fire. I would first ask you nicely about it but with that kind of attitude it's a wonder you are still there (if you are). Idk if you live in a right to work state but making your manager \"livid\" is not the best idea, especially if you are too broke to buy a belt and doing so would mean you couldn't eat lunch. \n\nBeing a good follower precedes being a good leader. ",
            "This is definitely malicious compliance. That being said, pants with belt loops worn without belts look pretty shitty. You're kinda the dick in this situation too. ",
            "[deleted]",
            "Wish I could upvote ya twice!",
            "What happened when she got livid? ",
            "I’d have guessed you would use a black power cord or some such.",
            "lmao this exact thing happened at my fast food work the other day",
            "I feel like we had the same manager at BBY. \n\nMy first GM when I started was this fairly portly, extremely sour woman who lorded over the store from her guard tower (GM office was on a second floor, overlooking the sales floor).\n\nShe literally never came down if it wasn't to yell at/threaten/write up someone. ",
            "Well done!",
            "I would've used a shoe lace. I like this better",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestbuy] [No, I don't have a belt. x-post (self.MaliciousCompliance)](https://www.reddit.com/r/Bestbuy/comments/7mzfos/no_i_dont_have_a_belt_xpost/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "You tucked your shirt without a belt?",
            "I was kinda hoping you'd worn the belt around your thigh or something, but this is better :)",
            "My high school had the same rule, so my friend did the same thing. She just made one cut right through the middle of each belt loop, didn't even bother to actually cut the loops off...they still made her wear a belt.\n\nThey also had a rule that shoes had to have backs on them, so people started stapling ribbons to flip flops. They changed the rule to allow flip flops."
        ]
    },
    {
        "post_id": "ss5r99",
        "author": "None",
        "title": "We're going to court? OK!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ss5r99/were_going_to_court_ok/",
        "score": 19220,
        "num_comments": 871,
        "created_utc": 1644827333.0,
        "selftext": "The setting: United States, Northern Neck of Virginia.\n\nThe situation: Bought land and built a house on it.\n\n\nBack when my wife and I were much more newly wed than we are now, we hired ourselves an architect and went whole hog on having our cozy little dream home designed.\n\nWhile this was being done, we went shopping around for a parcel of land on which to have it built, which went quickly and easily, and we even got a pretty nice deal on a half-acre lot that was just far enough back in the sticks for us to be happy, but close enough to our jobs that it wasn't much of a commute.\n\nBest part of all?  No Home Owners Association.  There weren't any active back in that area because, point-blank, it was full of poor people back there.  Dirt poor country types and working poor wage slave types. \n\nWe made very sure with our lawyer that no previous owner had ever had the title amended to allow for any HoA nonsense as well, because that's a thing some real estate developers like to do - they'll buy up a property, get the title amended to force the membership of that property into a local HoA (that they usually operate or are in cahoots with those that do) and then resell it with that as a new requirement for any prospective buyer to automatically agree to when they sign the title.\n\nFlash forward to August of 2019.  Covid was just around the corner, but nobody knew that yet.  Everything was that which passes for normal out in those parts, and my wife and I had since moved to a different location, but retained that property as one of our various rentals.\n\nIt was our dream home for several years and we loved that place.  Moving was tough.  It was a good neighborhood out there and folks were very welcoming.\n\nThen a company that's totally not named Ryan Homes or anything even slightly similar came in and spent some years buying everything up back there that got the market and pressuring folks into selling, which worked out for them only too well.\n\nAnd of course, they gentrified everything.  For three years and some change, there was massive amounts of the old being torn down and hauled out and the new being built up and sold.\n\nThe HoA was built right in, because of course it was.  Folks with money enough to throw down on shittily built houses that looked nice from the front moved in one by one and two by two, property values in the area skyrocketed, property taxes skyrocketed right along with them and more of the less-poor people were forced to sell because they got taxed out of their own homes.\n\nMy wife and I knew what was coming from the get-go.\n\nWe knew those dinguses from Totally Not Ryan Homes were going to come sniffing around our way not to try to buy us out, but to see if they could finagle, schmooze or threaten us into joining the HoA they were installing.\n\nIt was inevitable.  Lots of information is public record. They knew we had money.  They knew we were living below our means by two orders of magnitude.  They knew we clearly meant to be exactly where we were because we sure didn't have to be.\n\nThey knew they didn't have a snowflake's hope in hell of pricing us out on taxes, so they tried nagging us to death and coming right up to the line on harassment, always to 'talk to us about joining the HoA'.\n\nThey failed.  They got told by One Expensive Lawyer to find something else to do before we all got super busy helping them find things to worry about.   And so they desisted for some years.\n\nThen my wife and I moved and got the property set up as a rental. \n\nAbsolutely Not Ryan Homes starts bothering our tenants there, both trying to get them to pressure us into putting the property into the HoA as well as getting our tenants riled up with the most outrageous lies about what could happen if we, the owners, don't 'protect our renters better'.\n\nMy wife and I were livid after hearing about this crap, and so we got ahold of Definitely Not Ryan Homes to let them know that this was our formal request that they stop bothering our tenants and that all further communications would be from our Really Expensive Lawyer.\n\nThey must've assumed we were bluffing or maybe whoever was in charge of thinking that day didn't show up for work, because they just kept right on with their nonsense.\n\nIt got so bad that they were even sending fake but convincing-looking envelopes with 'EVICTION NOTICE' that, upon being opened, said '... Could be what you find in your mailbox one day without our wondrous HOA!' and containing information about the benefits of the HoA.\n\nWe gathered it all up and got the tenants to talk to our lawyer and got the police involved to get the ball rolling on a harassment investigation.   Another formal request to cease and desist was sent to Never Ryan Homes by the Very Expensive Lawyer, which they... Utterly ignored.\n\nI think their guy that's supposed to come to work and think about things quit a long time ago.  Maybe he never told anyone.  Maybe nobody noticed.\n\nWhatever the situation on their end, when my lawyer talked to their lawyer, their lawyer told my lawyer that their client was doing everything legally and that if we wanted to pursue the matter in court, that was what we'd have to do. \n\nSo we did. \n\nI'm not sure what kind of lawyer magic my lawyer and his fellow legal demons worked on this front, but we were in court for one single hour when my lawyer and their four lawyers and the judge had a private talk after the preliminary hearing.\n\nHalf hour later and the lawyers from Maybe Ryan Homes come back into the court room looking like a quartet of cats that had been pissed on.  My lawyer takes a seat beside me and says 'They're going to settle.'\n\nAnd I was like 'I didn't think we were that far along into this yet. What happened?'\n\nAnd he said 'They built fifty one homes in COUNTY OF CONCERN over two years.  Every single one of them was inspected before close of sale by a real estate agent that never actually got around to getting her home inspector license.'\n\nAnd that's how Was It Ryan Homes The Whole Time paid me ten grand to not sue them while they got bent over by the county and the state and tag-teamed like the new boy with the pretty lips in a prison yard.\n\nTl;Dr - housing developer harasses my wife and I, then harasses our tenants after we leave and rent the property or, to try to make us join their creepy HoA.   They make us take them to court to get anything done, at which point my lawyers let the judge know that everything the developer built in that area was unlawfully sold because the home inspector wasn't actually a home inspector and all the legal documents she signed off on during every closing on every one of those units in the whole county were invalid.\n\nDeveloper gets throat-punched repeatedly by county and state for probably millions of dollars in fines and fees and settlements with home owners that were sold properties that were never lawfully inspected before being turned over.\n\nI got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nEdit: spelling words is hard",
        "permalink": "/r/MaliciousCompliance/comments/ss5r99/were_going_to_court_ok/",
        "comments": [
            ">maybe whoever was in charge of thinking that day didn't show up for work\n\nI have worked for an organisation that must have had someone in this role, though I never saw any sign of it. They only way I knew was because I was often told that they were not paying **me** to think. Apparently having more than one person doing this kind of work is dangerous.",
            "Was part of the settlement that you signed a NDA? If not, you could have told your tenants, the tenants could have put the word out, now technically you've only kept your tenant informed, after all they were witnesses in the case, they could potentially have been involved. Hey, it's not your fault if the tenants speak to the neighbours",
            "/r/fuckHOA would appreciate this as well I think",
            "The market was booming so fast...the inspector didn't even get their license yet!",
            "Good on ya for taking care of your tenants. Every HOA and REA fucked over puts a smile on my face",
            "r/todayilearned you can be taxed out of living in a certain area.",
            "You should have sent everyone a letter in the HOA telling them it's class action lawsuit time.",
            "That's it. I am now calling paralegals legal demons, and no one can change my mind, because paras are extremely fierce and get paid to find every law that can make life hell for their opponents.",
            "For those of us not in the United States, can you explain what the \"Home Owners Association\" is, please?\n\nEdit: thanks for your replies. In Australia this is all mostly managed by local govt. The parallel would be a Body Corporate in a block of units/flats I think.",
            "Why didn't they just try and buy you out , instead?",
            ">I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nWell done! And it makes up for the harassment. \n\n/points and laughs at Maybe Ryan Homes",
            "This was glorious. Fuck HOA's. And fuck Totally Not Ryan Homes.",
            "This totally fictional company that is totally not named Ryan Homes was actually kicked out of OH for a few years due to how  bad they were. Unfortunately they have returned. If you ask anyone in the trades in my area, they will tell you ABSOLUTELY DO NOT buy a house from the company that is not named Ryan Homes. They are garbage. The HOA part is only a small part of it.",
            "This is just beautiful.",
            "I wish there were more landlords like you.",
            "This is the best thing I've read and my oh my did I enjoy everything about it!",
            "I’m not far from your area and I can confirm that Totally Not Ryan Homes are the worst! It was super obvious to me when we were house hunting that their builds were garbage and it was easy to find all the terrible reviews from people they’d screwed over. I have friends who didn’t know better and plenty of them were financially ruined because they couldn’t afford the repairs for their new builds, but couldn’t live in them safely. They have such a horrible reputation that I can’t figure out how they’re still in business.\n\nLove that they lost millions while you stuck it to them.",
            "You are beautiful landlords. We are SO SO lucky, we have a kind landlord now, they really are hard to come by. Glad it all worked out for you!",
            "Only $10K?\n\nI had a totally not Ryan Homes townhouse in PA. They forgot parts of a wall (my beat bill was INSANE) and skipped insulation. If I hadn't occasionally stopped by during construction, there would have been more issues.\n\nThey also have another name they use for \"higher end\" build. NVR Homes, iirc.",
            "The story was a nice one made even better by the writing. Enjoyed it from definitely the beginning to you bet your ass off the end...",
            "> And that's how Was It Ryan Homes The Whole Time paid me ten grand to not sue them while they got bent over by the county and the state and tag-teamed like the new boy with the pretty lips in a prison yard.\n\nBut that's a separate tragedy.",
            "Love that you gave the money to the tenants!",
            "That’s actually terrifying.\n\nRyan homes sells some awful homes.  It’s well known by most out there.\n\nThe look nice.  But man they have a terrible reputation.\n\nTo hear they weren’t even inspected by someone who had a license is awful for the buyers.",
            "I moved to my current property just before COVID.  The property I bought is not HOA, but we're a border territory: Farm Land on one side right up to our lawn without so much as a fence between the grass and corn.  A thin strip of wind-break weed-trees on the other side that separates us from an about 20-homes micro suburb development.  All of the development is an HOA. \n\nCOVID lockdowns being what they are, there were very few opportunities to meet the neighbors until recently.  Last autumn, we got invited to a neighborhood halloween party.  (I have kids in the local schools so it's worth it to maintain *some* social ties to the surrounding neighborhood).  When we got there, we met various neighbors and shortly one very self-important gentelman introduced himself and said \"I am the one you have to talk to if you want to make any sort of changes to your home!\"  It was a moment of pure pleasure watching his look of shock and wounded arrogance when I said… \"Oh no, I don't have to worry with any of that crap… I'm the new owner of that property on the otherside of those trees over there.\"",
            "Mmm, tasty.\n\nThis totally sounds like it belongs in r/fuckhoa as well as here.",
            "OMG I have a fun totally not ryan homes story. They built a development where I lived many years ago...I was working residential construction at the time and knew they were...let's say less than reliable in their construction techniques. Anyway, they had to blast some bedrock for one of the lots to put the foundation in. Three nearby houses (still under construction, not occupied) collapsed when they did so.",
            "As someone renting from also a good landlord, one day I aspire to be like you!",
            ">I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nGood grief, where were you when I was renting?  That was incredibly generous of you.",
            "Can I just say, your entire story of success has put me at ease.\n\nYou and your wife are the type of landlords/landladies that the general population NEED but barely ever get! \n\nKeep up the good work my friend 😁 and have a fantastic day 👏👏",
            "Is hiring a lawyer actually malicious compliance?",
            "Aside from the actual story, I have to say I thoroughly enjoyed your telling of the story.  \n\n...and I don't mean to insult you guys by this, but I am totally picturing a redneck with both money and an education, lol. The HOA never saw it coming. 😭😅🤣",
            "This story was made ten times better by the way it was written. I couldn’t stop reading. \nEntertaining, funny, and delightful malicious compliance. I say, well done,  niasonod.",
            "What is A 'COUNTY OF CONCERN' and why were they so desperate to get you into the HOA?",
            "thankyou for your wonderfully-written story & also for being good guys to your tenants.\n\ni’d say totally not ryan homes could go fuck themselves, but apparently that’s being done for them. nice.",
            "Best story ever. Wonderfully told. 10/10 will read this to my husband before we have sex tonight just to set the mood.\n\nFive stars.",
            "In my head, I'm hearing \"Ryan started the fire!\" in Dwight Shrute's voice.",
            "Thats strange. Not Ryan Homes does a lot of things Ryan Homes does. How they are still in business and why people keep buying their cardboard houses is a mystery. Growing up near me they bought a single house on a few acres most and turned it into a full cul-de-sac of mcmansions on just enough land to walk between houses, and have a patch of grass to call your front yard.",
            "\"And that's how Was It Ryan Homes The Whole Time paid me ten grand to not sue them while they got bent over by the county and the state and tag-teamed like the new boy with the pretty lips in a prison yard.\"\n\n\\- This, right there, is some damn beautiful literature.\n\nAs for Ryan Homes, that company is sketchy AF and I will NEVER buy a house from them.",
            "Can I rent from you?  Not because of the payout but because you actually had your tenants back.  I would take fastidious care of your property.",
            "r/fuckhoa would love this",
            "A wise man once said, FUCK HOA's. \n\nI agree with him.",
            "There is definitely more to this story.  Unless your dream home was looking like absolute shit no company is going to those lengths to get you to join an HOA for no reason. Builders couldn’t care less about the HOA once they have sold the homes.",
            "The story goes sailing along, then the unexpected *body check\" to the HOA. In my mind the sound effects were glorious!",
            "Giving the $10k to your tenant was a class move.",
            ">I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nAnd they say all landlords are scum.  Thanks for proving them wrong.",
            "If you have an extra 10k sitting around that you don’t need, feel free to look my way 😝\n\n(Edit for atrocious grammar)",
            "This is excellent.\n\nAnd I'm stealing this, because it applies to SOOO many businesses these days:\n\n>I think their guy that's supposed to come to work and think about things quit a long time ago. Maybe he never told anyone. Maybe nobody noticed.",
            "You clearly have more stories…\nFace it, they need to be told…",
            "New boy with the pretty lips in the prison yard \n\nI'm WHEEZING",
            "You and your wife are the real MVPs. Seriously, you are outstanding humans.",
            "Could they also get charged for putting \"eviction notice\" on their envelope? 'Cause that sounds like both harassment and fraud.",
            "> My lawyer and his fellow legal demons…\n\nFiling this away for future use.",
            "Funny how Americans want all their civil liberties, to not wear masks, to not get vaccinated and to own guns they don't need - and yet, will willing sign up with the devil",
            "A developer that totally wasnt ryan homes built a bunch of townhouses across the road from my apartment. I put on my hard hat and safety gear, and walked around that construction site with a tool bag and a level. I repeatedly put that level against things that should have been level. They were not.\n\nWhen they were done I heard rumor that they bought their siding from a cheap reseller who didnt offer any warranty on the material, and it wouldnt last. So I called into the totally not ryan homes helpline, and all the automated voice asked for was my address. I gave one of the units, and it asked me what my issue was. I said \"Siding.\" The automated system automatically hung up.",
            "Why do they want an HOA so much?  I always thought the HOA was there to relieve them of any duty after building their houses.",
            "It was an absolute delight reading this! You almost never find something so well-written. I loved the adjectival progression, too.\nBy any chance, we’re you taught by nuns?\nPs. I apologize for the phrase ‘almost never.’",
            "You know, I think people watch too much TV and think \"so sue me\" is a magical phrase instead of an invitation to being sued.",
            "How is this legal in USA for lawyers and prosecutors to go behind the scenes and discuss the case with judge in a secret, WTF.",
            "Good job, you really taught them a lesson about responsible housing affairs. You could even say you really home-schooled them.",
            "I can't tell you how many things in my 'definitely not a Ryan Home' my father (who was a licensed contractor and inspector for the government) has fixed because they were not to code.  My bathroom ceiling fan was wired with an extension cord from the 70's.",
            ">I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nAnd that is where this story went from good to epic.\n\nYou guys are awesome. Keep it up!",
            "Man this was the best.   And told so well to boot.  Thanks!",
            "Can I be your tenant?",
            "You turning over the ten grand to the tenants who bore the brunt of the harassment is such an awesome move.  Damn.  Good for you guys.\n\nThat's how to keep good tenants, that's for sure.",
            "Fuck HOAs.",
            "Whatever company that was not named Ryan Homes, won’t be expecting my business if I ever come across them ;)",
            "For somebody not from US, can you explain:\n\n>property values in the area skyrocketed, property taxes skyrocketed right along with them and more of the less-poor people were forced to sell because they got taxed out of their own homes.\n\nHow is the property tax defined? Because if it depends on average price in your area or smth like that, it has a looooot of abuse potential.\n\nWhat is county of concern?",
            "This deserves to be r/prorevenge",
            "This was absolutely infuriating to read. I've lived in the same area as you my whole life. Ryan Homes is a fucking plague. The housing market here is absolutely insane and the average person can do nothing about it, all thanks to Ryan Homes.\n\nI make pretty good money for the area I live in, but I'm by no means well off. I have basically zero hope of buying a home any time in the near future thanks to them.\n\nAlso, their houses are pieces of shit.",
            ">which my wife and I gave to the tenants\n\nYou're the kind of rich that somehow hasn't lost their soul.\n\nWelcome to the do not eat list.",
            "\"They got told by one expensive lawyer to find something else to do before we all got super busy helping them find things to worry about.\"\n\nIt was at this point I knew this was gonna be good.",
            "I wrote about an experience over in r/NuclearRevenge  (\"Never Piss off a Rick Redneck\") about a friend of my grandparents that had a very similar story.   Hats off to you, fellow Redditor!  Your story made me as as gleeful as the resolution of the story I posted did.",
            "The writing here is beautiful, very cleverly worded -- and the moral of the story, don't be a bloody gobshite. Cheers!",
            "Y’all must really refer to the poor working class like that? You rich people are horrible people. Super privy that’s for sure.",
            "This is pro-revenge",
            "Actual licensed home inspector roughly in your area who heard Northern Neck and thought, \"Not them, that would be too sweet\". \n\nSo when I saw it wasn't THAT one I was glad, this couldn't have not happened to a nicer builder who is definitely and defiantly not THAT one. \n\nGood work OP!",
            "I may have orgasm’ed reading this…..",
            "> we were living below our means by two orders of magnitude.\n\nYou are aware that means a factor of 100, correct? So, you were saving 99% of your income?",
            "I enjoy karma a lot.",
            "This is fucking awesome!!! Fuck Definitely Not Ryan Homes!!!",
            "This was a fantastic read.",
            "My guy is going to break some people’s brains on here by being a landlord AND a good person 😂 \n\nIncredible post - thank you OP!",
            "That Totally Not Ryan Homes outfit is in our not far way from your COUNTY OF CONCERN area as well, and they have a reputation for building crappy WAY overpriced houses that are only pretty from the front side. We call them \"yuppie farms\".  What I resent is like many modern developers, they'll buy a bunch of acres and scrape it down to bare dirt... every tree, bush, blade of grass hauled away or mulched, essentially destroying the local ecosystem.  Frack  those jackalopes. Couldn't happen to a nicer bunch of thieves. And might explain why we're not seeing so many of their signs around.",
            "Brilliant!  I, too, would live in a CAVE before I would sink money into a property where someone else (usually a Fascist dictator-type) could tell me what I COULD or couldn't do with said property!  I H-A-T-E HOAs with a passion!\n\nSo very glad you were able to reign victorious over Unmistakably Not Ryan Homes!  We rented a home in Maryland that they built only to wake-up to a waterfall from the bay window in our kitchen.  Our waretdog Golden Retriever LOVED it though!",
            "I don't care how many times I read this, I will always come back to have a smile at Surely Not Ryan Homes getting screwed.",
            "Does anyone in the sub understand what malicious compliance is?",
            "Why did they want you to join the HOA so badly?\n\nI don’t know much about HOAs.",
            "This may be too political by half, and will delete if it is, but I do not understand how a country full of people so proud of their freedoms and rights that they will talk your bloody ears off about it for literally ever, manages to find ways to invent freedom constraining entities like HOAs and then people willingly join them.",
            "tl;dr rich guy flexing on the rest of us for being rich, or maybe a totally fictitious fantasy",
            "r/fuckHOA would LOVE this!",
            "You GAVE your tenants 10 GRAND? The story seems like a good one, but I find that part a little hard to believe. Unless, were you renting the house to your own children or something?",
            "It's fucking awesome that you could afford some justice. The system works!",
            ">Flash forward to August of 2019.  \n\n>For three years and some change. \n\n>And so they desisted for some years.  \n\n>Edit: spelling words is hard. \n\nSo is maths apparently. This has all happened since August 2019? Three years from then is August 2022, never mind the change, or the \"some\" years after that where they desisted.",
            "Thank you for doing this.",
            "Beautiful. And also you have a wonderful way with words, u/naiasonod",
            "Oh, please tell me they also paid for your fancy lawyer.",
            "Y'all are dope",
            "You and your wife are awesome people. I'm sure you have your problems and flaws, and I'm not trying to trivialize them, but you are both also very, incredibly, awesome people.",
            "Not only was this a great malicious compliance, but well written in the form of a (true) short story! Thanks for the great read - nice to hear of the satisfying resolution.",
            "A quartet of pissed on cats….well done , and visual as fuck.",
            "Did this take place in the northern part of the NNK, closer to CB, or closer to the bay? Been going there since before I was born. Side note, nobody should ever buy from Not Ryan Homes EVER and your home inspection part does not surprise me even slightly",
            "I love how you name and shame.",
            "Dude I'm not in the usa but can you be my landlord........",
            "These \"totally not Ryan Homes\" guys sound like real chums. Hopefully their business-- whatever the name of it is-- goes right into the dirt.",
            "> I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nThis is just amazing. It's the most decent, splendid thing I have read on reddit all day.",
            "Don't eat this one.",
            "This is beautifully written and a pleasure to read",
            "Wow...some people are so dumb...I wish I was a fly on the wall to see the look on there faces when it came to light that they did everything wrong lol",
            "Damn, this sounds like the kind of thing Ryan homes would do",
            "I like your writing style.  Can we have more stories please?",
            "Sometimes, while my aunt takes my grandfather to the doctor, I go stay with my grandmother so she doesn’t get confused and try to drive somewhere or something, so we often watch TV, mostly the news and we see commercials for this Totally Not Ryan Homes you speak of, she always asks me if she thinks he’s got a lot of property, I’d say yes since he probably lowballs them and other shitball tactics like that, anyway I’m glad you won the fight friend!",
            "Fuck RH, they suck worse than the Toll team",
            "I wonder what builder it could be since it definitely wasn't Ryan Homes.",
            "I love how you gave the 10g to the tenats. So wholesome!",
            "Fellow Northern Necker here. Was this by any chance some development maybe or maybe not similarly named as \"Skip\"yard Farms?",
            "Bwahahaha loved the writing style and lol’d",
            "What a great piece of writing.",
            "You got a way with words.... 🤣🤣🤣🤣🤣🤣🤣",
            "As a native Virginian, FUCK RYAN HOMES",
            "Ten grand?  That's it?  That's nothing to them.  The probable millions in fees and fines will certainly do damage, but you should've sued them anyway, as you had plenty of evidence and police reports of harassment, on top of them just straight-up ignoring the cease and desist letter.  Hell, you could've thrown in an intimidation charge for the shit they were trying to pull.  I think you could've easily sued them for 10-100 times that amount, if for no other reason than to make a point, and possibly just to add a few kicks to them while they're down for good measure.",
            "Your edit comment had me LOL-ing in my doctor office waiting room.",
            "Every word of this is pure gold. Take my shitty gold award. Glad it worked out well and even more impressive your lawyer steamrolled them. Well done 👍",
            ">I got ten grand in the settlement, which my wife and I gave to the   \ntenants in that property because they deserved it and we really didn't   \nneed it anyway.\n\nDamn, you actually are a great landlord. We need more like you and a lot less like Ryan homes",
            "Why would a Realtor have or need to be a licensed home inspector? And what does not having a proper home inspection have to do with anything? Asking as a licensed home inspector....",
            "LMAO. Love your wit. Well now I know not to go to Totally Not Ryan homes when we build on our property.",
            "You write a very nice story. Your style really stands out.\nWould definitly read more of your's",
            "Happy for OP and his wife, happy for tenants ... surprisingly happy for Really Expensive Lawyer as well, who'da thought!!",
            "This is GOLDEN but I have no Gold Award so please take a silver instead?",
            "> I got ten grand in the settlement, which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\nBut remember reddit, all landlords are greedy and evil.",
            "It's great hearing that there's still landlords out there protecting their tenants and fighting against BS like HOAs. You sound like a good person.",
            "one of the most infuriating parts for me was seeing them suggest they could be evicted if they *don't* join the HOA. in all likelihood it's the HOA that will end up evicting you because you didn't plant the right sub-species of shrubs along your northeast property line.",
            "You clearly are awesome landlords! You defended your tenants and gave them the money to make up for all the harassment when you didn't have to. :) Also, awesome story telling skills! You had me chuckling through the whole thing.",
            "You and your wife are my heroes",
            "Ryan Homes sucks especially in Delmarva. All they do is go into the sticks and financially bully people to giving up generations' worth of land.",
            "All that for only $10k?  Hope that was after legal fees.",
            "Wife and I got a nice little piece of land on the edge of two cites.  I literally can walk to the north end of my property, cross the yellow line on the road, and be in the next city limits.  City we live in isn't developing the north end of their city yet and it is nice and relaxing.  City to the north of us is spitting up high dollar homes and neighborhoods as fast as they can and it is getting closer to our house.  I keep waiting for the day that some HOA decides that my house doesn't live up to their standards and starts crap like this.",
            "You're a poet. Thank you for those lovely snippets of verbal violence.",
            "Op, that’s awsome giving the settlement t to your tenants. I wish I had landlords that took care of tenants ya mike you!",
            "This is so poetically written. I want to hang it on my wall. Just... ****chef's kiss****",
            "I would have asked for 10x that amount.",
            ">tag-teamed like the new boy with the pretty lips in a prison yard.\n\nI absolutely lost it with that last line! What a great portrayal of how they got royally screwed!",
            "Outfuckingstanding.",
            "Have you considered becoming an author? Because this was written beautifully",
            "This is so well written!! Bravo !!",
            "> totally not named Ryan Homes or anything even slightly similar\n\n> shittily built houses\n\nIdk, this sounds a lot like the Ryan Homes I know and hate. Source: I own one of those shittily built homes and further learned that the only thing worse is their \"warranty service\", which can best be described as people with no functional knowledge of tools beyond a caulk gun or house building beyond where they think caulk should go.\n\nETA:\n\n> their guy that's supposed to come to work and think about things\n\nI'm 99.9% certain this person doesn't exist at Ryan Homes.",
            "Wow you sure write pretty. \n\n\"Pretty lips\" in the prison yard? LOL. \n\nUsually I find the lawless stuff stops when you call their attorney.",
            "Too bad your lawyer couldn't get the HOA declared null and void and forced to be abandoned, in the process.",
            "As someone who works for a company that gets contracted by Ryan homes for work, this is completely par for the course.\n\nDO NOT BUY A RYAN HOME. THEY ARE GARBAGE HOMES BUILT BY A GARBAGE COMPANY.",
            "That was the “shortest” long MC I have read in a long time.  Then you gave the settlement to the tenants.  I salute you, I enjoyed reading this one ‘cause HOAs can gorge themselves on a huge bag of….",
            "Was the hoa shut down?",
            "Almost bought a Ryan Home.\n\nFuck Ryan Homes.",
            "You need to be careful with HOAs. Our HOA is for the pool club only. ONLY!\n\nAbout a decade ago the old board was voted out and a new board voted in. Fine fresh blood. Dues hadn't been raised in 15 years or so at that point and the club was showing it. Raised dues and slowly improved the infrastructure. Looks beautiful now. But then things happened.\n\nSuddenly residents looking to put in fences, for example, had to get HOA approval before the town would issue a permit. Weird thing was the HOA automatically approved the requests and didn't charge. As a 50 year old development most residences already had fences and it was generally just the newbies, who didn't know better, were being affected.\n\nFast forward to this past summer. Now what could happen to the pool club property as stated in our deeds was very basic: belongs to the HOA or can be donated to the town. Remember how I said the club is looking nice these days. Long story short the HOA president is also a township committee member with desires to move up the political chain and threatened us with either our dues double for new infrastructure issues or we donate the club to the town. No alternative and she was going to show us the books, which never happened. Oh and thanks to Covid the annual meeting didn't happen.\n\nNow, our deeds all state we own our lots and a portion of the pool club. We are in NJ so that little portion is worth quite a few dollars. Lawyering ensued, including attorney residents who did not mind a little pro bono work. And that is where will i stop aside from noting that the HOA president lost, for now.\n\ntl;tr -- don't mess with NJ lawyers, we are super a-holes when pissed",
            "> which my wife and I gave to the tenants in that property because they deserved it and we really didn't need it anyway.\n\n  \n\n\nYou are good folks.",
            "I love you. I love this story. It would make a good movie. You’re an excellent writer and you’re right, spelling words is hard.\n❤️❤️❤️",
            "So if Not Ryan homes is made of money, why accept their measly payment and not take them for more? Why did the county and state benefit more than you when you and your tenants were getting harassed? It sounds like you had a solid case. \nJust wondering,  but kudos for keeping your head and sharing the love with your renters.",
            "My sister and my parents have been through absolute **hell** with their respective HOA’s. And so on their behalf, i was cheering you on, loudly, for i knew you were going to bend them over in the end. \n\nYou are my hero.",
            "Love the story and how it's told.",
            "Who needs viagra when we have tales like this FOR FREE.",
            "This was enjoyable to read and absolutely loved the outcome. Kudos for giving the money to the tenants! Ten grand can improve someone's life drastically",
            "This was beautiful. Love the writing style as well!",
            "As someone who formerly worked for Definitely Not Ryan Homes Ever, they do not pay employees to think. Everything was templates, new ideas were discouraged, sales were a \"planned activity\" and the reps went clipart rogue on a weekly basis making crummy flyers for expensive-to-hold open houses. Their commission structure is fucked, too. Only management makes money. Typical corporate.",
            "Loved it, your excellent way of wording what happened had me in stitches. Superb! 😁",
            "Enjoyed reading about the hell that is NoVA (northern VA), grew up in that hellhole and occasionally go back to wonder why. Good news is the house she and dad bought for $200k in 1982 is now worth close to $600k. Bad news is she could never afford to live elsewhere in that area. Fuck NoVA-oh and that stretch of 95!",
            "I just came here to say, I love the way you wrote that......",
            "Seems the Really Expensive Lawyer was worth his salt, and you did your part to uncover the scandal by agreeing to sue!",
            "Glorious! Love your storytelling flair too. This was ***so*** entertaining",
            "Reddit exists so we can read triumphal stories like this. Way to go, naiasonod!",
            "I loved every single instance of Decidedly and Assuredly Not Ryan Homes.  LMAO",
            "I love these one liners you put in, best read on here for a hot minute.",
            "It's nice to hear about someone beating those HOA crooks! When good money goes after bad month... I LOVE IT!!!",
            "\"...got bent over by the county and the state and tag-teamed like the new boy with the pretty lips in a prison yard.\"\n\nLol I gotta remember that one\n\nGood work my man. I'm in Europe HOAs are as unknown as the terms \"medical bankruptcy\" and \"civil forfeiture\" but still a hilarious story",
            "I find it hard to give a fuck about the woes if anyone who rents property.",
            "Too much embellishment made this an unbelievable read.",
            "[removed]",
            "From the UK: \n\nWhat's with HOAs in America? Is it self-righteous NIMBY (Not In My Back Yard) types? Or something more corporate\n\nOne house related issue over here is \"Leasehold\" and \"Management Companies\", who charge management fees to cut the grass & conduct repairs for communal areas.",
            "Reading this felt like one of those old standardized tests where every other sentence is unnecessary fluff and you have to figure out which sentence to delete",
            "I...I think I love you.  That was beautiful.",
            "What did I just read? You sound almost as bad as the HOA, whatever that is...",
            "Hey great story. I especially liked the part where you own multiple homes while an entire generation has been priced out of home ownership.",
            "Fairfax or Loudon county? Use to live in Manassas but had a son who lived in Fairfax county for several years.",
            "Love the writing. Love the revenge. Love your generosity to your tenants. Bravo!",
            "It was a good story until you casually described a person being raped. There are so many analogies in existence, and you picked that one.",
            "Fuck corporate developers but I must point out the irony of you taking advantage of cheap land in a poor neighborhood to build your dream house on only to call somebody else a gentrifier. Not to mention you also decided to rent your property. You're as guilty of gentrifying as Ryan Homes.",
            "You gave the ten grand to the tenants? Are you sure you're US landlords? Imma need to see that long-form birth certificate LOL! Seriously, you two are gems.",
            "I love that you gave the money to your tenants you probably got it back in rent because I would never leave that property. You probably made their year.\n\nEdit: a word.",
            "I love this. There's a screw HOA sub of some kind with a similarly awesome story where the battle ended with the HOA paying rent to the guy and then eventually folding entirely. They are evil. Also thanks for \"not\" naming names the way you didn't. Brilliantly hilarious.",
            "Great story nicely told, but it s/b \"my wife and me,\" not I.\n\nBrought to you by Unsolicited Patronizing Writing Tips LLC."
        ]
    },
    {
        "post_id": "yk6nsf",
        "author": "13aph",
        "title": "McDonalds Compliance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yk6nsf/mcdonalds_compliance/",
        "score": 19205,
        "num_comments": 641,
        "created_utc": 1667399176.0,
        "selftext": "So, once upon a time, I was a McDonald’s employee. They always put me on drive thru because I was white and spoke fluent English. (Yes that’s pertinent. Literally everyone was Hispanic and only like two people besides me spoke fluent English.)\n\nSo, I always winged it when greeting customers, and they always liked me. They’d ask about me when I was off, and loved me for brightening their day. My manager came to me one day with a script and demanded I spoke from it. I repeatedly did not use it. And eventually she got frustrated and threatened me with a write up if I didn’t read from it. \n\nHere comes the malicious compliance. There was a typo in the script that referred to McDonald’s as McDondald’s. So. I’d repeatedly say it, and because everyone has a headset, they’d all hear it, And the staff would chuckle because most could read English, and they all got the script. My manager was not amused. She told me that I needed to say McDonalds. And I reminded her that she demanded I read from the script exactly what it says.\n\nI got sent home that day and they cut my hours. I still feel like I won.",
        "permalink": "/r/MaliciousCompliance/comments/yk6nsf/mcdonalds_compliance/",
        "comments": [
            "I was a McDonald’s manager for overnights, one time this new crew member kept taking orders like “Welcome to McDonalds how may I Mchelp you today?” Eventually changing all the words to have Mc in front of them. “Are you going to be paying with mccash or mccard?” And some of the customers would respond with mcthank you, etc. I didn’t stop him.",
            "I bet she was the one who didn't proofread the script properly, hence why she sent you home and cut your hours. People don't like to be reminded of their laziness or stupidity.",
            "This sort of thing is a great litmus test for evaluating a manager's ability to lead.\n\nWhen I had a supervisory role, I made it a point to openly accept feedback from my staff, even (and especially) when it made me look like a fool.",
            "[deleted]",
            "You won. Take that gold medal with you always.",
            "My wife does a retirement job at McDs and got a customer complaint for calling someone \"dear\". Also for calling someone ma'am because they weren't \"that old\". My wife is 64 and the lady was clearly older than her. She just ignores the minor reprimands as she is one of the very few that show up and work.",
            "\"McDondald's, home of the gilded bumps\"",
            "[deleted]",
            "I worked at a McDonald's that was in the food court of a mall (I was the ONLY person at that location that understood and/or spoke French) a couple of days in a row I had one customer who they didn't speak English very well (I heard the accent that they had and when they spoke in French I was able to answer all their questions in French) The second day I had just asked another customer to come up, but I saw them and asked my customer if they could go to the other open register and I explained to the customer that I understood/spoke the language of the next customer.",
            "There's one guy at a Tim Horton's in my area who is always on drive through when I go there, and he literally sings \"good morning weeeeelcome to Tim hortons, what can I get you on this marvelous day?\" In his best stage-voice. It is the best ever, i always leave smiling. Idk why she'd think forcing a cold script on you is the way to go, lol.",
            "Look... me and the McDonald's people got this little misunderstanding. See, they're McDonald's... I'm McDondald's. They got the Golden Arches, mine is the Golden Darcs. They got the Big Mac, I got the Big Midck. We both got two all-beef patties, special sauce, lettuce, cheese, pickles and onions, but their buns have sesame seeds. My buns have no seeds.",
            "That really made me laugh! \nGreat compliance, to the letter.",
            "[deleted]",
            "As an employer with staff that point out my mistakes, I would've made that a running joke at work.\n\nYou won. That manager sucks.",
            "You can’t write mcdondalds and expect it to be right though, lol. Though I do applaud Disney for telling employees at the hotel what we were to consider Goofy’s Kitchen and Goofy’s Chicken the name of our restaurant for our ESL speakers and we weren’t allowed to laugh.",
            "When I worked at McDonalds I would go full MC on rude customers. Ask them ‘do you want fries with that? Would you like to upsize your meal? Would you like a dessert? How about an extra cheeseburger?’ All with the biggest fakest smile on my face and the sweetest tone ever. It made the customers so much more angry because I was wasting their time, but if they complained to the manager they wouldn’t punish me because I would act dumb and say ‘I was only up selling which is what you’re always telling us to do!’ I would \nBe sure to finish with ‘y’all have a GREAT day now!’ It worked every time. Turn the friendliness up to 11 while annoying the customer as much as you can.",
            "McCompliance",
            "At burger king, \"Welcome to the whopper flopper, want me to flop you a whopper?\"     Funny to me at least",
            "Years ago when I worked McD's I was alwyas late night drive-thru.  A manager decided we should say \"Hi my name is EcelecticDragon welcome to McDonald's\".  I was NOT going to give out my name. I already had enough issues from male customers' unwanted attention. (Including a guy who wanted to suck my toes)  So one night I was threatened with being written up for not saying a name.  That manager's name was very similar to my own.  So I used hers.   Hi, my name is manager's name, welcome to McDonald's\". =) They scraped the requirement.",
            "I used to go over notices from management, at my shop job, with a red pen and correct the spelling and grammar mistakes with a red pen.\n\nThat went down well.",
            "Heck, I don't understand why something like that would need a script",
            "My first job was working at McDonalds and I actually didn't mind working the drive through, but in the exact same fashion, my manager gave me a script that involved saying \"See you again\" or \"see you next time\", in ***every single interaction***, to the point where I'd be reprimanded the second I forgot. It's almost like they were listening to me specifically waiting for me to fuck up it was so quick.\n\nI quit not long after and I've still never heard any McDonalds employee say that to me. Don't know why I was told to say it.",
            "There used to be a vegan restaurant in a punk bar in my hometown - Winnipeg - and their menu had the \"Stanta Fe Ranch\" wrap. I used to order it all the time, and to this day I struggle to say \"Santa Fe\"!",
            "\"You told me to read from the script,  you pay me starvation wages,  you want adaptability,  flexibility,  and common sense instead of rote following of orders,  *pay for it.*\"",
            "It will now be forever McDondald's to me!  Or at least for the rest of today.",
            "Mcdonalds was honestly the worst place I've ever worked. I started Valentines day 2020 and walked out that December. It felt like hell. I wear hearing aids, and at the time i was trying out a different part on the hearing aids. Normally the microphone where all the sound comes in is in the hearing aid itself but i was trying one where the microphone was in the mold that goes in your ear. What i didn't know at the time was that sweat would get into the ear piece and dissolve the glue holding the microphone, which made it stop working, which meant i would have to constantly send it off for repair. Well one time i told the kitchen manager, not the GM, the situation and her exact words were \"I know you can't hear but you still need to listen.\"\n\nAnother time i was told to do something and i heard the GM tell this girl, let's call her Anna, to watch me to make sure i did it right. I heard Anna say \"Why do i have to be the babysitter?\". There was another time where i did something with the dishes not in the exact way the biscuit maker wanted because she talked so soft i couldn't hear her, so when we ran out of biscuits in the middle of breakfast rush and i asked her to make more, she refused, which screwed the whole store up. The kitchen manager told me \"She says you ignore her, she ignores you.\"\n\nBut what was the most infuriating one to me, is when it was slow they would always have me washing dishes, and call me back to the fryer if we got busy. Well one time Anna literally set up a whole crew meeting to \"talk about my attitude.\" She said \"I don't know why MustangLover22 always has such an attitude with me, i ask her to do something and she doesn't do it.\" To which i said \"Well don't have me washing dishes when it's slow because i can't hear you when that sprayer is going, maybe if i had a second person with me-\" I instantly got cut off with \"You shouldn't even be using the sprayer anyway.\" They didn't even acknowledge that i couldn't hear when they needed me and asked for help. I bit my tongue so hard and almost walked out then, but i stayed for another couple months until i lost my temper over another incident and walked out during lunch rush.",
            "Oh yeah. You won.",
            "You totally won, this is hilariously awesome!",
            "Was this the script ‘hi, welcome to mcdondalds home of the mcdondalds, can i take your order?’",
            "#McDondalds",
            "Where is this McDondald’s?  I’d like to sphinx to the malmager.",
            "Lol she would of loved me “Thank you for choosing Ronald Mcgoddamn Donald’s what can I get for you?”",
            "\"I still feel like i won.\"  \nThat's because you did. Her reaction was that of a petulant child.",
            "[deleted]",
            "One of my old roommates worked at McDondalds and would regularly greet the drive through with “welcome to the clown house” and the manager made her stop after one complaint. Truly tragic.",
            "What a great compliance. Unfathomable that they would spell the company name wrong like that. That would be in every single store they own, right?",
            "Write me up? At McDonalds? Should’ve told them, “now ask me if I give a shit”",
            "Managers at McDonalds are some of the most petty and bitter people out there. Probably because of their poor life decisions that lead them to that job.",
            "“Welcome to McDondalds. I love you.”",
            "I worked at McDonalds 20 years ago. Got \"promoted\" to the close shift, which just meant I was the one doing all the cleaning work while all the older kids cracked open beers.\n\nManager came in on my third night doing all the work and yelled at me for everything not being done to standard, so I quit.\n\nSpread the rumour amongst staff that I urinated in the soft serve machine on my last shift. Came in the next morning to hand back my uniform and found the guy on his hands and knees scrubbing the thing from top to bottom.  Saw me and effectively chased me out the restaurant before I could hand my uniform back.\n\nEnded up selling it online for a few hundred dollars for someone who wanted an authentic Halloween costume instead.",
            "How much of a script do you need to say hi welcome to McDonald's how many I help you??",
            "Not gonna lie it took me far to long to realize the typo. My brain kept fixing it as I read it.",
            "Look... me and the McDonald's people got this little misunderstanding. See, they're McDonald's... I'm McDowell's. They got the Golden Arches, mine is the Golden Arcs. They got the Big Mac, I got the Big Mick. We both got two all-beef patties, special sauce, lettuce, cheese, pickles and onions, but their buns have sesame seeds. My buns have no seeds.",
            "That's major bullshit. I worked at mcds for 7 years and as a manager for 3 of those. I always told the people working the drive thru could mix it up as long as they started with a friendly greeting, ex: \"thanks for choosing mcdonalds, welcome to mcdonalds, etc\" and ask what the customer wants, \"what can I get started for you, what can we whip up for you today, etc\". There's no such thing as an official drive thru script.",
            "Sounds like a constructive dismissal lawsuit waiting to happen.",
            "You did win, no feelings about it. Anytime a person bucks the bullshit that low-paying jobs try to distribute amongst their overworked staff, they're winning that fight. If you work plenty while still providing a quality, personalized experience in service jobs, you're better than 90% of people working that industry. Let's be real honest here, McDonald's wages ain't worth going home mad and frustrated for the 3 following hours after your shift. Make sure you're consistently giving your best parts of yourself in any given day to someone you get excited to be around, or to an activity which means a lot to you. Jobs are not worthy of receiving 100% of any of their workers effort. 👍",
            "Oh you definitely won! As a manager there's nothing worse than willingly shooting yourself on the foot by sending people home.",
            "Reminds me of a story somewhere on this sub about a McD that was missing the L from its sign, so the author have since called the place \"McDonads\".",
            "Like you can't work literally anywhere else I love it when cheap fast food jobs act like they're doing you a grand favor for allowing you to work there",
            "When I worked at dominos I basically refused to go by the script. I had the highest call rating in the store and was always given the upset customers because I could solve their problems without some stupid mumbo jumbo. I got in trouble for it a few times but I never listened.",
            "Funny, when I worked at McDs, we were encouraged to mix it up, so we didn't sound like we were reading from a script.",
            "Pretty sure if you had sent the copy and cut hours to the district GM, she'd have had hers cut instead.",
            "I’m currently a manager at McDonald’s and we freestyle all the time with the orders especially after 10pm and it definitely puts me In a better mood when I hear one of my coworkers say welcome to the Krusty Krab instead of the type welcome to McDonald’s",
            "I honestly would go around your manager to corporate.  Your manager's power trip is harming customers.",
            "McCompliance, it's McMalicious!",
            "Fewer hours at McDondalds likely was a win.",
            "You did win, OP. Well done! I love the pettiness.",
            "George: I'm sorry the card says MOOPS  \n:)",
            "I worked the drive through and got in trouble for saying welcome to Micky Ds. Didn’t even realize I did it. Just what everyone called it.",
            "My first summer job, many years ago, was at a McDonald's. Apparently they're still getting the same caliber of store managers.",
            "At least you weren't forced to say \"McHello and welcome to McDonalds\" like the one near where I live... >.<",
            "Literally why would she make you read from a script when you already gave such good customer service you had a fanbase? Terrible management. I imagine she must have been jealous.",
            "So I was a GM once at McDonalds, I can vouch for that manager in the fact he or she wasn’t upset with you. They probably got a message from the higher ups or corporate saying you need to improve on service times. Especially the cash to present time which they monitor and judge the stores on during inspections.",
            "You did win! I worked at one with no drive-thru in college. Quit when we had literally 10,000 people at our mall for an event. The mamager on fries left their station, and I went to get the fries but had to restock the holders. Fry manager came up behind me and YELLED at me to get back to my register, startling me and making me drop the holders.  I did. I turned to go back to pick up the fries and saw them tell another cashier that I made them so mad (I can lipread). Owner came and told me to go on break. I did. Permanently.",
            "You make your customers happy and your coworkers laugh.  That's winning, imo.",
            "Ha I worked at domino's and we would answer with \"thank you for calling domingo's\"",
            "Now my brain is stuck saying McDondalds.",
            "A good manager owns up to their mistakes... They are human too... Throwing a hissy fit and sending the employee home is not good managing",
            "Manager sounds like she's in a bad place in life. You'll go much farther in life than her. Keep up the good attitude  😀",
            "missed opportunity to title the submission 'McDondald's Compliance\"",
            "McDondalds Compliance.",
            "Definitely the winner in this situation. Got to make people laugh AND worked less at McDolands?\n\nWhere's the downside?",
            "I remember when my ex manager attempted to give us a script to follow for our tech support. We never had one and he was annoyed by long call times ( which as we all know, a 1 minute answer may not take 1 minute if the caller decides to take their time explaining) and decides to write one from start of a call and a list of what we need to do depending on what is the issue.\n\nThis script ended up actually making calls take longer, and one of my leads (now current manager) voiced how dumb it was because the crucial piece of information we need is question number 6 on the list, after a bunch of preamble. There was also a part that mentioned removing the Cmos battery.\n\nIt was short lived since my coworker was at that part, and the manager heard him say Cmos battery and immediately starts yelling at my coworker about telling someone to remove the cmos battery and who told him to do so. He told him that it's on the script, which the mangler declines is there. Cue the embarrassment as he and my lead show him the exact script he wrote and approved saying to perform this action.  He threw a bit of a fit and hid in his office for a good part of the day.",
            "Ahahaha. Managers are really so bad at managing.",
            "You may not have won moneywise, but at least you have internet points",
            "You cannot beat the golden arches but bless you for trying",
            "Oh hell yes I love it",
            "Goat",
            "You did win.",
            "This is the perfect use of malicious compliance",
            "Use a Ben Stein voice.",
            "You definitely won.",
            "You definitely won. You can tell that story forever.",
            "I laughed out loud! You are awesome!",
            "Mc-DONDE-alds",
            "Ahhh, the Mac daddy once told me I wasn’t a “team player “ when I went to put drinks in a carrier for someone else, that’s not yours! I’M BEING A TEAM PLAYER was not a proper response apparently 😞",
            "When I worked for wendys drive thur I would say McDonald’s. Sometimes even Burger King.",
            "Oooh retaliation, your manager is lucky you didn't report it.",
            "Heaven forbid a franchise chain develop any individuality or unique personality to stand out from the crowd.  The beleaguered masses are comforted by cookie cutter sameness, repetition and mediocrity.  Adding that genuine human touch is not what they're paying you minimum wage for.  /s",
            "Lmao awesome",
            "Imagine being told by your corporate overlords that your staff needs to follow the corporate scripts, then when you try to implement them you are down a cashier because they can't help repeatedly mocking a word that you mistyped. The perks of management.",
            "Fuck mickey ds theyre terrible",
            "<Cartman>Respect Ma AuthOriTie!</Cartman>",
            "I love these! I’m so glad you pointed out the inherent racism and bigotry. You’re waaaaayyy smarter than any ole mcdondalds mgr",
            "It amazes me how illiterate management is. At one of my old jobs they were ALWAYS fucking up signs for guests. Things like Banas being on the menu, or that an Entance is closed.",
            "Oh, you won alright.",
            "“Welcome to MacDowell’s, would you like a Big Mic?”",
            "I don't know who needs to hear this but cutting hours punitively (like as a punishment) is illegal, but very hard to prove in court. If you know this, you can tell them and probably get some satisfying back peddling/squirming, which is always fun.",
            "Revolutionary hero origin story.",
            "Manager at McDonald's and can't spell McDonald's. She's a keeper.",
            "Most people could read English but not speak it?",
            "Your manager sounds like a power tripping douche who desperately wants to be important but isn’t.",
            "Should have titled this as McDondalds Compliance",
            "Mclicious McPliance",
            "long and pretentious scripts being forced on employees.\n\nthe employees hate it. customers don't consider it genuine and it gets annoying after enough repetitions.\n\nyet some businesses swear by it. no idea why.",
            "Sounds like you were a valuable employee, so she kinda fucked herself there",
            "I do not miss working at Mcdondald's. I picked up a second job and I got scheduled to work the same night as my other job that I made more money at and had more fun doing. They had already cut my hours down to one or two overnight shifts a week so I was just like *\"yeah I'm already working that night, i won't be able to come in.\"*   to which they said *\"we need you though!\"* \n\nWell my other job needs me to and they aren't trying to make me quit, so I'm not gonna be coming in.",
            "I lasted 6 weeks at a McDonalds when I was in high school, back when dinosaurs roamed the Earth. That place was a nightmare.",
            "Very compliant, and soooo delightfully malicious!!",
            "In the grand scheme of things, your employment of \"McDondald's\" means jack shit. Future employers when you're working better jobs won't care how well/bad you did.\n\nThat said, you definitely won that battle, and I'd say it was probably well worth it!",
            "I can honestly say I've never been greeted with the welcome greeting used in tv ads. And if you go inside you're lucky to even get a smile. For some reason I don't blame the employees. Perhaps because when it's slow I talk to the drive through people. I ask questions and I'm pretty certain that 99% of MC D's turnover rates are do to bad managers.",
            "I walked into Bloomingdlae's in NYC once and one of the perfume sprayers they have trying to spritz you came up to everybody and said \"Tommy Hilfinger? Tommy Hilfinger?\"",
            "There’s was guy at our local Maccas that when we asked for a frozen coke through the drive thru would say ‘okey cokey’ He was awesome.",
            "I was also a drive-through wrangler for a long time, once it got late my go-to answer when the headset was \"hotline bling, how can we help you?\"\n\nGotta keep them cusomer on their toes.",
            "\\*chuckles\\* Next time you'd like someone to read from a script that you wrote, \"boss\", PROOF READ IT/ Read it Your self just to make sure that there are not any grammatical errors like the one OP mentioned.. Otherwise you may get a reading that makes everybody smile and laugh. :)",
            "Managers...Satan's followers.",
            "never quit from McDondald’s\n\nMake them fire you",
            "Karens hate it when you win",
            "Many years ago... I think it was at McRonalds... the counter staff at this location were instructed to \"embellish\" the item names when speaking to customers, to sound just like in the ads. \"Would you like fries?\" became \"Would you like some crispy, golden brown, fresh, hot, tasty french fries?\" (Heh. Yeah I would; do you know where I can get some? 😄)\n\nAnyways... my pals and I thought this was really great, so we started packing on as many superlatives as we could think of when ordering. 7 seconds of \"Gimme a cheeseburger, small fries and a chocolate shake\" became a 35 to 55 second verbal ordeal, with the poor frustrated counter person becoming very annoyed.\n\nThey soon dropped the enhanced crapola, but probably not because of us - it was just so industrial-strength lame.",
            "I came here to write McDondal's McCompliance, several years ago I worked at a McDonald's I mean McDondal's.",
            "> give me little gifts for brightening their day\n\nDude. NOBODY is bringing gifts to the McDonald's drive-through guy",
            "\"Welcome to McDondalds!\"  (Said super enthusiastically)! Makes me laugh just imagining it. 🤣",
            "Hold on. You work drive thru and people are giving you gifts and asking when you’re off work? Lol you were probably holding up the drive thru flirting with customers.",
            "[deleted]",
            "While I never agree with reading scripts, how hard is it to understand that you work for Mcdonald's, not the other way around? If they want you to read a script, do it properly and collect your paycheque.\n\nOf course, you'll be sent home and have your hours cut. You're not some irreplaceable part of their machine, and you aren't paid enough or high up in the food chain to improvise or develop the customer relations policy. Drive-through in Mcdonald's is the lowest-end, grunt, student-paid, minimum-wage job you can ever do. What possibly thought that you were more prominent than the script you are told to read?\n\nI hope you grew up and don't do the same in your current job.",
            "Getting fired/demoted/hours cut by a McDonald’s manager is usually a compliment to your intelligence and work ethic.",
            "So… you’re no longer white and can’t speak fluent English anymore??",
            "Why does the extra ‘d’ in Mcdondalds absolutely wreck me 🤣🤣",
            "If most people in the area were Hispanic, wouldn’t it make more sense to have a Hispanic person on the drive through?",
            "Good for you, I guess, if you feel getting your hours cut means you won.",
            "As a frequent customer of McDondalds just read the script it's what I expect I don't need my day brightened I don't need small talk I don't need to processes what you are trying to say to me, (getting old hearing ain't what it used to be) Let's just get through this as quick as possible.",
            "\"I got sent home that day and they cut my hours. I still feel like I won.\"\n\nNo you did not.",
            "You made your point, but you did not win.",
            "It’s always interesting to watch a sub slowly develop into a creative writing echo chamber.",
            "I feel like getting your hours cut at McDondalds is a win.",
            "When I worked at McDonalds I would go full MC on rude customers. Ask them ‘do you want fries with that? Would you like to upsize your meal? Would you like a dessert? How about an extra cheeseburger?’ All with the biggest fakest smile on my face and the sweetest tone ever. It made the customers so much more angry because I was wasting their time, but if they complained to the manager they wouldn’t punish me because I would act dumb and say ‘I was only up selling which is what you’re always telling us to do!’ I would \nBe sure to finish with ‘y’all have a GREAT day now!’ It worked every time. Turn the friendliness up to 11 while annoying the customer as much as you can.",
            "When I worked at McDonalds I would go full MC on rude customers. Ask them ‘do you want fries with that? Would you like to upsize your meal? Would you like a dessert? How about an extra cheeseburger?’ All with the biggest fakest smile on my face and the sweetest tone ever. It made the customers so much more angry because I was wasting their time, but if they complained to the manager they wouldn’t punish me because I would act dumb and say ‘I was only up selling which is what you’re always telling us to do!’ I would \nBe sure to finish with ‘y’all have a GREAT day now!’ It worked every time. Turn the friendliness up to 11 while annoying the customer as much as you can.",
            "When I worked at McDonalds I would go full MC on rude customers. Ask them ‘do you want fries with that? Would you like to upsize your meal? Would you like a dessert? How about an extra cheeseburger?’ All with the biggest fakest smile on my face and the sweetest tone ever. It made the customers so much more angry because I was wasting their time, but if they complained to the manager they wouldn’t punish me because I would act dumb and say ‘I was only up selling which is what you’re always telling us to do!’ I would \nBe sure to finish with ‘y’all have a GREAT day now!’ It worked every time. Turn the friendliness up to 11 while annoying the customer as much as you can.",
            "This is why I tell my kids to study hard in school.  Working at McDonalds is already a life failure scenario."
        ]
    },
    {
        "post_id": "cksuo3",
        "author": "Exs_in_Texas",
        "title": "Got what they asked for twice",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cksuo3/got_what_they_asked_for_twice/",
        "score": 19194,
        "num_comments": 637,
        "created_utc": 1564686781.0,
        "selftext": "I used to wait tables at an upscale restaurant that was known to be the place to have your holiday or office parties. Great money if you got the right group. The menus were pre-set, the wine and liquor was pre-set, and it was all auto-grated at 18%. All of it was in the contract the host signed pre-event. Usually the host would make themselves known fairly early on so you would know who to talk to if there was an issue and who to give the check to at the end of the night.\n\nOne night, I am splitting a party of 30-40 with another server. This event had top tier food and mid level wine and booze. Very nice. A small group of 5-6 people arrive a bit ahead of schedule. 2 guys and 3-4 women. Not a problem, its actually nicer if they slowly roll in so we can get drinks started. I walk over, introduce myself and the other waiter and ask for drinks. Now this was back in the early 2000's and chads weren't a thing yet, but the 2 guys were the chaddiest chads. If they could have popped their collars in their suits, I'm sure these guys would have found a way.\n\nSuperchad1 - \"Me and my bro are going to start with a round of Johnny Walker blue, and these ladies are going to have (expensive red wine)\"\n\nSuperchad2- (turning to the girls) \"Once you have Johnny Blue, you just cant drink anything else. It changes you, bro\"\n\nMe- \"If you like, I can put those on a separate tab, the event contract has Johnny Walker Black, but not blue, and the red wine selection for tonight is (less expensive wine)\"\n\nSuperchad1 - \"This is our party, just get me what I ordered and dont question me again!\"\n\nSuperchad2- \"Who do you think you are? You're just some waiter, we have MBA's. Just get us our drinks!\"\n\nI walk over to the other waiter and tell him we are in for a hell of a night, but the check should be nice. For those that dont know, Johnny Walker blue is 3-4x the cost of Johnny Black. So one round of drinks for these people is over $100. The whole night goes exactly as we thought. Nothing was good enough, the appetizers were crap, the food was horrible, not enough bread, too many bread plates, drinks were taking too long, why do some people have food and others dont (its 40 people man, it takes a minute to get that much food out). To make it worse, chads and co are all over the place, moving seats and making others move so they can talk to who they want. This makes serving hell because we did everything by seat number.\n\nSurprisingly, most of the table was normal, not entitled people and who knew that waiters are people too. They were impressed by the food, and graciously ordered the drinks that were in the contract. One older gentleman at the other end of the table from the chads apologized for their behavior, saying \"they might have fancy degrees and good jobs, but you cant teach class\". Love that guy.\n\nFinally, they are winding down and after drinking almost a full bottle of Johnny Blue along with all the other food and drinks they have a VERY hefty check and the other waiter and I are excited to get paid. We start picking up the dessert plates and asking for last drink requests. The nice older guy at the end of the table says to bring him the check. Not wanting any more interaction with the chads than necessary, I bring it to him. I tell him I can take care of it whenever and go about clearing the table. A few minutes later he calls me over\n\nNice guy - \"Maybe there was a mistake in ringing up the drinks? There is almost $600 for Johnny blue, when the contract I signed only included Johnny Black. And there are some single glasses of wine that are different from what we agreed upon.\"\n\nMe - \"No mistake sir, that is what was ordered and drank.\" (He is being awesome, and I feel bad)\n\nNice guy - \"Why did you give the drinks to them when we clearly had a contract?\"\n\nMe - \"I apologize sir, they told me that this was their party and since I was just a waiter to shut up and do as I was told. So I did. Im sorry, I took them at their word\"\n\nI point them out and he calls them over. What follows was the singularly greatest ass chewing I have ever been witness to. He goes on about how he was doing something nice but apparently that wasn't enough. About how horrible their behavior was that night and how he is ashamed for them. But my favorite line was how you see a persons true colors in how they treat people that work for them and they had shown theirs. Then he calls me back over.\n\nNice guy - \"Apparently I thought this was my party. Guess I was wrong. This is their party and they will be taking care of the check. Oh, and up the gratuity to 25%. You earned it.\"\n\nHe turns around and walks off, leaving the chads with the check. All in all it was about 3k. I have never seen 2 grown men look so defeated.\n\nEdit: credit to u/beepolai The boss might have been their father. It makes total sense looking back. Thanks!!\n\nEdit2: Holy crap. Thanks for the gold and silvers!!!  Now if someone can tell me what that means!\n\nEdit3: The words have been paraphrased, this was 10+ years ago. The only word for word thing that I remember is \"Once you have Johnny Blue, you just cant drink anything else. It changes you, bro\". It was such a DB thing to say I still remember it.",
        "permalink": "/r/MaliciousCompliance/comments/cksuo3/got_what_they_asked_for_twice/",
        "comments": [
            "There's a certain beauty in seeing arrogance defeated by those who actually have the power.",
            "I hope you were able to throw your own party on the gratuity, even after splitting.",
            "[deleted]",
            "/r/talesfromyourserver would *love* this op",
            "I had to host an event similar to this for my company but thankfully the restaurant had something in the contract stating that if anyone asks for top shelf liquor, it would have to be approved by me first or else they would deny them. Luckily my guests were all responsible and no one ordered top shelf because they were gratuitous enough that we were paying for an open bar and appetizers. At the end of the night, we still had $4k left in the $10k pre set menu for food and drinks so we left the rest as an additional gratuity for all the amazing servers we had.",
            "Karma can be a real bitch sometimes.\n\n I really like the way Mr Niceguy handled it.",
            "Don't know why they look so defeated, $3k should be no problem at all for a couple of big shots with MBAs",
            ">\"Once you have Johnny Blue, you just cant drink anything else. It changes you, bro\"\n\nThis is the Chadiest thing to say. I've had Blue (50 bucks at a bar for a glass). Black is just fine",
            "As a nice man once said:\n\nHoly shite, you feckin' killed him, OP!",
            "That was a well-poured *shot* of MC on the rocks.",
            "Ha! Good to see the Chad's get wrecked!",
            "Nice old man just destroyed the souls of those two people",
            "Now the only question is, which one of them stiffed the other on reimbursement.",
            "Jee-zus. 25% on three grand? Nice shit.",
            "I hope you don't mind, but I x-posted this to r/screwyoublessthem as I thought it would fit well there...",
            "Chads: “We have MBAs.” Still gets chewed out by nice guy who’s truly in charge.\n\n\n\n“Any man who has to say ‘I am the king’ is no king— Tywin Lannister.",
            "But they've got MBA's! They can afford it!",
            "Do y'all not have a policy that requires approvals from the host/boss for changes that cost money? That would save a lot of trouble.",
            "[deleted]",
            "[deleted]",
            "I'm sure there are some great MBA's out there, but my experience has been with one's that had little to no real word experience and their arrogance far exceeded their abilities. They didn't leave me with positive thoughts for when someone says they have an MBA.",
            "DAAAAAAYYYYYYYUUUUM.\n\nClassy ass chewings are the best kind when not directed at you.",
            "This was SO worth the read. I wish I could have seen their faces during the boss's speech.",
            "Thats what I'd call a CLM (career limiting move) for those guys.",
            "Anybody working in food services knows this is the dream",
            "> chads weren't a thing yet \n\nChads have always been a thing.  Chads are eternal.",
            "Once you have Johnny Blue, you just cant drink anything else..........Still laughing.",
            "Man, not all heroes wear capes, eh? That’s awesome.",
            "This is one of the most satisfying stories I have ever read. Thank you.",
            "They were left hanging with the check. Hanging chads.",
            "Scotsman here. Fucking Johnnie walker. Laughable. So many better whiskies out there",
            "Absolutely fantastic",
            "May your glory last forever.",
            "This was a satisfying read.",
            "\"Your check, sir. And would you like an MBA with that on your way out?\"",
            "Johnnie Walker whisky is also fucking disgusting blended crap. I don’t get the hype.",
            "Awesome story. But I'm so glad I found this here instead of surfing through 3,719 ads to read the story elsewhere.",
            "That story made my day. I once had a patron tell me “You don’t get paid to think”...I work in a somewhat educational field btw, so technically thinking is a part of my job lol.",
            "You can tell it's a true story because the dialogue is so realistic",
            "How to be a chad by Niko omilano",
            "magic, pure, magic",
            "this is awesome",
            "[deleted]",
            "thanks for the fap session OP",
            "That's fucking awesome. If those bro's were the hot shots they thought they were, they'd have had no problem paying.",
            "[removed]",
            "Thats incredible",
            "They really deserved it. Nice guy just doesn't give a fuck. You mess with him you get to pay for food for 40 people",
            "A very satisfying story. Thanks.",
            "Expensive lesson. I hope they at least learned it.",
            "Forgive me, what is a chad?",
            "Just what the boss man asked for.",
            "Just what the boss man asked for.",
            "The end had my heart beating similar to when a girl ive been crushing on just said she'd go out with me. I'm not sure what this means but I'm really happy.",
            "Good thing they had MBAs",
            "Oh man that’s what they meant.",
            "i hope he was their father and fired them and cut off trust funds or whatever these spoiled brats had.",
            "Thanks for this story dude, really made me feel better!",
            ">\"they might have fancy degrees and good jobs, but you cant teach class\". \n\nThat is so true.  My uncle used to host garden parties for bigwigs from Nato.  They included some titled people, high ranking military and their wives.  Super nice people all of them.  My uncle?  Nope.  He was pretty much all show and when the party was over treated the staff (and us, since we were 'enlisted' to help at some of these) like peons.   Never forgot that.",
            "The funniest thing about Johnny Blue is that it's just overpriced blended whiskey.\n\nI bet 90% of the people who drink it wouldn't have a clue it was any different than any other whiskey.\n\nPeople who actually know their scotches and whiskeys mostly prefer other drinks and will say Blue is horribly overpriced as a means to appeal to people who just want to impress with the price tag.",
            "This was such a joy to read. Thanks for sharing",
            "I love hearing about MBA holders acting like douches and tossing their degree letters around, because it reminds me of this classic ad.\n\nhttps://youtu.be/NcoDV0dhWPA",
            "I expect people to be honest no matter where i go.",
            "I've had Johnny Blue, it's not worth the money honestly. There's much nicer whiskey's around at a fraction of the price.",
            "Chaching! Johnny Blue honestly isn't that great. Better cheaper scotches.",
            "\"It changes you, bro.\" Yes it did. It changed your banks accounts into ones with less money in.",
            "[removed]",
            "I want to believe",
            "This is the best thing I've read so far tonight. Good on that guy for giving those punks what they deserved.",
            "[deleted]",
            "Some other stories are questionable malicious compliance in this sub, but this was pretty good.",
            "Now that's what I call a happy ending!",
            "Why do I have the fiercest hard-on of my life right now?",
            "This is the single most amazing thing on reddit.",
            "[deleted]",
            "Wow I work in almost that exact situation now and I have some stories about these Chad's that come in to my restaurant, usually around the holidays. Usually suplimenting their own income with some family money. \n\nGreat writing!",
            "One of the best server stories ever. So glad \"Chad\" was still there, and you got to see him eviscerated.",
            "What’s chads stand for? Is it like chav?",
            "I love stories , that I read. They’re like movies but with words.",
            "Autograted?",
            "[deleted]",
            ">\"we have MBA's\"\n\nOhh look out we have a bad-ass! \n\nlol, I really can't believe they said that, so as to justify their \"status\", or in this case, lack their of.",
            "Greetings fine bros of reddit I thoroughly enjoyed that story and wanted to take some time to clear something up.\n\nThe gentlemen you had at your table were in fact Brad’s not Chad’s I can understand where the confusion lies as they are fundamentally similar beings.\n\nHOWEVER, Chads are known to uplift the spirits of their fellow virgins and Stacy’s and they would have most likely just drank the black like the studs they are. \n\nThank you for hearing me out\n\nr/chadsriseup",
            "Johnny blue isn't even good for the money.",
            "Sounds like a great 1-2 combo here, entitle people + malicious compliance.",
            "well. i don't blame them, i've never seen \"stay in your lane\" as part of an MBA curriculum.",
            "Single Malt or forget scotch completely.   That said if someone else is picking up the tab.. Well drinks are just fine.  Some amazing low priced wines out there too!",
            "> \"Once you have Johnny Blue, you just cant drink anything else. It changes you, bro\"\n\nFunniest part of that whole story... Johnny has great marketing but not great whisky.  So many others that are WAY better, and most of them are cheaper too.",
            "Couldn't the chads also just walk off without paying?",
            "Bought a Jhonnie Walker Blue yesterday because of this post, it was actually really nice, but I still prefer Japanese whisky like Hibiki.",
            "Why is blue more expensive?",
            "3k for a dinner than fed 40 people in pretty fucking affordable for a fancy place. I've spent that much with a party of 4.",
            "This was posted on some trash Facebook resharing site, but I'm glad I came here to the original source."
        ]
    },
    {
        "post_id": "w7jlgn",
        "author": "Wabisabi_girl",
        "title": "HOA wants me to build a shorter fence? Got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/w7jlgn/hoa_wants_me_to_build_a_shorter_fence_got_it/",
        "score": 19180,
        "num_comments": 866,
        "created_utc": 1658738377.0,
        "selftext": "I’m piggybacking off of the HOA trend going around here.\n\nThis story was relayed to me by one of my favorite professors over 5 years ago, so my apologies if the details are foggy or inaccurate.\n\nMy professor was a very, very private person, the sort of guy who would hesitate to tell you his favorite color if you hadn’t known him long enough. He had recently had an incredibly nosy couple move in next door and realized the flimsy four foot fence he had got for the dog wouldn’t keep out peeping eyes.\n\nSo he installed a fence. But instead of using a standard size, which he knew his neighbors would peer over, he built an 8 foot fence.\n\nIt wasn’t even a week before HOA was on his ass, threatening every fine they could and claiming he couldn’t have a fence over 6 feet tall. So, being a dutiful citizen, he called the fence company to uninstall said fence. \n\nWhile the fence was being taken down, he closely examined the HOA handbook on the precise definition of a fence.\n\nHe installed a new 6 foot fence that fit every single regulation, but with a 3 foot brick wall beneath it.\n\nEDIT:\n\nA lot of people are pointing out they’ve seen a story like this here or on Tumblr. I acknowledge karma farming is a major thing, but I am relaying the story as I heard it. \n\nI have plenty more from him, granted they don’t fit in this sub. He used them to illustrate points mostly, like one about the horrendous public transport of Galveston where he literally ran through people’s yards. \n\nI don’t know if his stories were true— honestly I bet many of them weren’t. But he was a real man. I’d share his name if I felt it was okay. \n\nHe served Cuban coffee during office hours. We got a random sub toward the end of the semester because he had a triple bypass that he had told none of us about. \n\nTruthfully, I don’t know if he’s alive even, which was one of the reasons I wanted to share this. I have no way to make people believe that I am telling the truth, but if you look through the comments here, several people say they’ve heard of or even done similar things.",
        "permalink": "/r/MaliciousCompliance/comments/w7jlgn/hoa_wants_me_to_build_a_shorter_fence_got_it/",
        "comments": [
            "This reminds me of a guy I worked (as construction worker in his new house) for many years ago. \nHe wanted a huge concrete wall next to his driveway. I'm talking about the entire length of his land-huge. \n\nCity planning didn't allow it. Not a chance that he was permitted to put something so large on the border of his land. He was a well-off dude and he let his lawyers loose on the matter, he really wanted that wall!\n\nA month later, his wall was there with a mailbox fixed to it. All within the city planning law. It turns out that city planning stated that he could build \"a mailbox on a fixed structure\". They never gave precise size requirements for the fixed structure..",
            "There is a similar story about I think Jim Barksdale (Co founder of Netscape). He wanted to build a fence but the city said it was too big, so he built a hill with a smaller fence on top of it.",
            "The HOA is somehow both the most American and Un-American thing I've ever heard of at the same time.",
            "Exactly the same thing happened with me. We live in an old house in a village in rural England, we are only the second family to ever live there after the very elderly original owners moved out. It has a very large L shaped garden going around the side and front of the house and a tiny 3m x 3m back courtyard garden. The property is strange as our front gate is down a secluded footpath but the side of our property abuts the main road. \n\nThe old boy who lived here before had a very small white picket fence around the garden right next to the main road. He used to be into his gardening and would chat to people over the fence and at the bus stop on the road. He also let people cut theough the garden to the village green rather than walking round. We have three children and after several incidences of delivery people and even villagers jumping the fence to use our garden as a short cut, we decided to put a 6 ft fence up for safety. Meaning people had to walk around our garden and our kids could be out there in peace \n\nNot 2 days later we got a letter from the parish council saying 6ft fences are not allowed at the front of a property and it needs to be 4ft. Thus was odd as the fence in question was at the side of our property, we were not addressed on the main road but on the road the footpath leads to so I ignored the letter, again they wrote to us and said they'd be reporting us to the planning office or something if we didn't take it down. \n\nI decided to write back saying that it is the side of our property, and said anymore letters will result in the fence being painted shocking pink (they were very, very pre-occupied with what the village looked like). They obviously checked and confirmed what I said as I received no more letters and it's been 10 years.",
            "They go low you go high",
            "Some big rock-band member had a big piece of property with a conventional house on it. Many years ago he decided he wanted an off-grid home on one of his hills to be powered by solar panels, toilet on a septic tank, and he wanted a well near a creek that could be pumped up to a cistern on the hill. Had an architect draw everything up and submitted it to the city. Of course they refused it.\n\nThe architect called to see when the permit would be approved, and was informed of refusal. He said \"give me a day\". At no charge, he made a few minor changes, and resubmitted the plans as a barn with an \"office\". It's legal to have running water, electricity, and a toilet in a barn.",
            "I did this last year to hide my pool from the perverts next door watching my teenaged daughters sunbathe and swim. The HOA was bent out of shape about my 6 foot fence (4 foot is the max) so I installed 8 foot bushes to cover the 6 foot fence and told them I had that section replaced (they only cared about the 15 foot section that could be seen from the street). The fence is still there, but you can’t see the top 2 feet. \n\nAs a side note, they lost their drone when they tried spying on another neighbor’s daughter and he blew it out of the sky with a 12 gauge.  Their house is up for sale, so it’ll be nice to get some new neighbors (I hope).",
            "HOAs are ridiculous. The fence gate here was rotting and falling off, so FIL puts in a new one. The letter from the HOA arrives: the new fence you out in wasn't approved, you can't have that. So he takes down the nice new fence and puts back the old rotting one. Much better! The HOA approves. Wtf? Isn't the whole point of the HOA to keep everyone's property values up?",
            "When I was a kid, my dad had bought a house that had been foreclosed on  in a gated community.  After multiple tickets from the HOA for having an enclosed trailer on the property, the HOA found out that since the property was bought on foreclosure, the property no long fell under HOA covenants.\n\nEdited for clarity.",
            "Something tells me he was an engineering professor.  \n\n\nI had a professor who was incredibly smart.  He was also a crafty SOB.  The guy already had 4 completely unrelated degrees and in his 60s he got his law degree.  In part he did it because he was a life long learner, but it was also because the university (that he worked for) build some vent or condenser for various utilities near his property line.  He sued the university to get them to change the design and he represented himself in the case.  \n\nThere is something about the fact that he works for the school, got a free degree through the school (since he was faculty) and then sued that same school that made the guy a legend amongst his students.",
            "My parents have a raised house (1m / \\~3ft)  to allow for a big basement. The terrace in the backyard is on that 1m level. Since code specifies a max fence height of 1.8m from the ground the fence sits on, they effectively have a 2.8m (\\~9ft) border with their neighbors when taking the terrace height into account. While on our side it only looks 1.8m, so does not look stupid.\n\nThe neighbors are actually the parents of one of my best friends, and have huge plants/trees on that side of their backyard so they dont mind.",
            "This SAME thing happened to my parents with their neighbor. They wanted a privacy fence but you're not allowed ANY privacy fences in their neighborhood. \n\nSo they went to the handbook and read the rules. They now have a 6 foot tall solid brick wall around their pool and patio area.",
            "Guy must have had a lot of money to burn.",
            "The malicious compliance is...\n\n...\n\n...\n\n...\n\n...\n\n...\n\nBuilt on a good foundation.",
            "[deleted]",
            "My wife’s old boss (rich lawyer/retired Navy RADM) had a neighbor on his street who was in a battle with the city about trying to shoehorn a garage on his property. \n\nRADM told this guy his plan wasn’t going to fly, city ordinance was real clear about distance from property line for permanent structure. RADM had lots of credibility because he was the guy who usually got into pissing battles with city over pushing code/zoning rules. \n\nNeighbor starts to build, city says stop. RADM advises him he should not fight this one but neighbor goes ahead and gets contractor to finish the 1mil + Ferrari habitat thinking he can present fait accompli to city and then work it out.\n\nCity has none of it and pulls the whole thing down and bills him for the trouble. \n\nI loved driving by and looking at that property. Always brought a smile to my face knowing that a rich person fucked around and found out for once.",
            "I'm beginning to learn you need a lot of money to be maliciously compliant.",
            "[deleted]",
            "I am a home contractor and recently did something very similar. Client had a steep slope in the backyard to where the house was a good bit higher than the property line in back where the privacy fence was. Original 6ft fence wasn't tall enough and the house behind them (and their yard) was clearly visible from the clients back deck. But the HOA wouldn't let them install an 8ft fence even though the circumstances of the slope meant it wouldn't be any taller than any other fence around them. So instead we built about a 3ft \"bulkhead\" and then a 6ft fence on top of that, totaling about 9ft of height coverage. Now the client can entertain and barbecue and all that jazz without his behind the fence neighbors being able to see in from their living room windows. HOAs can be so petty sometimes, so you have to be petty back.",
            "Well, 6 foot fence is legal, and a 3 foot brick retaining wall on sloping land would be allowed, especially if the wall is inside the property he owns, and the land on his side is built up to that height afterwards, with the proper permits from the local municipality. Just has to build the brick wall to code, but carefully make sure the builders built it ugly, either bare brick with unraked joints, or a plain bagwash alone on the exposed brick, or even concrete blocks, with the correct drainage and backfill to not pool water, but let it percolate through to the other side and grow a nice algal and moss bed.",
            "As a builder I've built so many fences that take advantage of every loophole in the hoa wording that I've thought about making a textbook for home owners.  It's pricey, but my personal favorite is making large metal flowers and welding a lattice between them. Gotten back yard fences 20' tall without breaking any hoa rules.",
            "My uncle and aunt did this for their fence. Their side yard faces a street and they wanted a private garden without people seeing everything. When the city kept refusing because it was too tall (they couldn’t have it taller then 5 feet (the reason was “it wasn’t a back yard”) a lawyer friend told them they could build a retaining wall to “keep their soil from eroding” and then the five foot fence on top of it. Worked perfectly, the “West Garden” is a beautiful place. And it’s quite and peaceful without having the neighbors walk by and look in. :)",
            "Great! Then what happened?",
            "[deleted]",
            "Our neighborhood only allows 6 foot fences. So we have 10 foot tall hedges instead",
            "I've lived in both HOA and non neighborhoods, no difference, both were nice. I don't see any value in having a HOA.",
            "People around here in Los Angeles love to install Ficus(Hollywood)hedges instead of walls. No permit is needed. Because my neighbor did that, it means I have to have my side of the hedge on the driveway trimmed on a regular basis. Unfortunately, the neighbor doesn't top his side and I can't just arbitrarily, trim and top off the entire hedge wall. Now the fucking hedge is 16 feet high. A standard fence or block wall height limit is 6ft. If it is planted bushes, trees, or hedges, then no limit on height.",
            "Why do people buy homes that have HOA’s ?\n\nThey sound like a giant pain in the ass.",
            "we dont have HOA in our country,. but similarly a dude wanted to put up a 4 mtre antenna for internet - but got denied by council when applying. Checked the rules, made a letterbox with a 4 mtre poke (letterbox at the bottom) with antenna on top",
            "Commenting for visibility, if you’re in an HOA and it’s within your availability in your daily life - get on that board! If you can’t do it, see if you can help a friend/trusted neighbor/family member do it. Boomers are running these boards just like they’re running the worst businesses and the worst government and courts. We need to replace them and start helping people live peacefully and reasonably.",
            "Still it must have felt pretty shitty to do all the work over again. A brick wall in addition to the new fence? Shit gets expensive.",
            "Love that.  Wish it would work with my HOA",
            "There was a guy in buffalo who spent like a million bucks on a wrought iron fence that was 8ft tall. Neighbors complained because 6ft was the height limit but he already had the fence manufactured and paid for so he had to dig a 2ft trench around his property so the top of the fence was 6ft above the the normal grade. Ended up spending like 2 mil on it and the fence still isn’t done like 5 years later",
            "Man fuck HOAs, next time they tell you to do something, throw dog shit at their houses.",
            "Reminds me of a story of the old director of my school.\n\nHe was big into radio satellites and had a dish in his back yard. I've never seen it but it was supposedly quite big and tall. So big that his neighbours started complaining that it was annoying their view. It was pretty petty imho, but apparently he had to do something about it. \n\nOur laws state that a fence can only be 1.80 meters.\nSo he masoned a brick wall below it. Making the fence about 3.50 meters.\n\nHey, the dish was invisible for the neighbours.",
            "Literally this is the plan for the back of my house... Basically a wall to act as a leveling area across the back where it dips down, And then a 6-ft fence across that... Making a 8 to 12 ft high fence across the rear of the yard and blocking out the sound of the road in the distance behind it.",
            "This reminds me of the dude that wanted to build a spot for his horses to get shade. The city for whatever reason wouldn't let him build it. As he looked though the building codes he found out there wasn't any size limit on public art. So he built a giant [Table and chairs](https://www.snopes.com/fact-check/helter-shelter/)",
            "I love this professor already",
            "Bless this man, for his exploits have warmed my soul this day and I REALLY NEEDED IT.\n\nI’m sure the HOA coven will cook up some other way to fuck with him, but he sounds ready to dance. We speak his name!",
            "Love stories like this. Fuck HOAs.",
            "We may have had the same professor?? He told us that they had no regulations on foundationed structures and that the only requirement for a concrete slab to be foundation was that it had something on top of it, and it had rebar in it, so he built a 3ft concrete wall with rebar in it and put the fence on top",
            "That's why fence height above grade, not just fence height.",
            "Alternatively, pile 2ft of dirt around the base of the 8' fence. Boom. 6' fence on a slight hill.",
            "A 40,000 dollar settlement was recently awarded in Nashville, TN in regards to a similar issue. Might want to down load the ACLU free app that allows one to record conversations while your phone is locked and represent yourself well. In small claims court.",
            ">  like one about the horrendous public transport of Galveston where he literally ran through people’s yards.\n\nIs your professor Ferris Bueller?",
            "An architect told me a story of one of his clients. Had a big house, but wanted a little beach house down by the water. Beach houses were not allowed. So they built a beach house on a pontoon boat frame and got a boat license for it and dragged it ashore. There was no law against beaching your licensed boat on your property!",
            "When I was shopping for a house, I told my realtor \"No HOA no matter how nice it is\". \n\nMy first realtor told me they had three houses to show me. I looked them up and noticed they appeared to be in a gated community or had \"Stone/Pebble/Whatever\" in the name for the subdivision, which is an instant red flag. I inquired whether they had an HOA. \n\nRealtor: \"Yes but it's only $120 a year for dues\".\n\nMe: \"I said no HOAs\"\n\nRealtor: \"You won't find any nice houses that aren't in an HOA\"\n\nImmediately fired and blocked. Told them I was done working with them and that I'd be working with someone else. \n\nFound my current 1960 built house and love it. It's not in an HOA.",
            "The tone of the post suggests we think this guy is pretty clever, but he paid to uninstall a fence, install a new fence, uninstall that fence, then install a wall and a fence because he was too foolish to check the HOA rules at first.",
            "Bahahahahahahaha",
            "I mean… I wanna believe, but for the sake of conversation this can’t be real, right?\n\n\nI’ve had my own shit experience with a previous HOA so I just fail to see how they’d be like “oi, you got us pal” before bringing the new regulation to vote at the next meeting, as opposed to just saying “contract says no walls over x height, you sir, clearly have a wall over x height, and yes we can see it is composed of two different materials.”",
            "Nothing beats rubbing it to the HOA’s nose",
            "/r/fuckHOA",
            "What's cheaper, a new fence and wall, or 3ft of backfill?",
            "Sometimes the height of the fence doesn't matter. I lived in a townhouse style condo (with an hoa, but not an evil one). The way the condos were positioned, when I looked out my second floor bedroom window, I looked over the fence and onto the patio and into the kitchen where I was frequently treated to the 80+yr old sitting at the kitchen table in his boxers and tank style under shirt drinking coffee and reading the paper. NOT something I liked. I liked the huge amount of sun that came in through the window, but it wasn't always worth it because I felt creepy for letting the sun in (I love the sun).",
            "I remember reading a similar story on Reddit. Instead of building a brick wall beneath the fence he had contractors build a hill of dirt upon which he built his fence.",
            "I live in Brazil, and houses in here are very different from the US. Example: my grandma's house has a big garage (enough to fit 6 or so cars) with the house above it, so we don't have this problem here.",
            "We live in an HOA and are only allowed to have 4ft fences. The neighbors next door have 2 great Danes that run unsupervised and can easily clear a 4ft fence. The fence installer told us that the HOA would not approve anything higher than a 4ft. Seems like a safety hazard that this is the rule.",
            "And to think the rich and hedge funds are buying up mobile home parks how long they start buying HOA ‘s and putting in their own people?",
            "Fun fact, Anyone with any basic knowledge of governing documents for a HoA would be able to still fine him.",
            "There's always a loophole. 😈",
            "We have a 2 foot concrete base on our new 6 foot fence that is 8 feet tall.",
            "i’ve seen this post before…",
            "Do you live in Texas??   Look what happened today!  \n\nhttps://nextdoor.com/p/2qM3S6KP9zbd?utm_source=share&extras=MzQ2MTIyNDE%3D",
            "We’re only allowed a 6 foot fence so we put up an 8 foot trellis inside the fence with a vine that maxes at 10 foot.",
            "My uncle had a terrible junky backyard. The city told him he needed to put up a fence or clean his yard. He installed the chain link fence and towed his junky vehicles out from the garage. \n\nIt’s been 20 years. Hasn’t changed",
            "7. Include the fallout.\n\nNot sure why this rule is so difficult for some.",
            "I’d like to hear more stories. Honesty you will probably never know if some of his stories are real but they stuck with you and that’s what matters I guess",
            "I love these little victories or I guess in some cases big ones lol.",
            "I'm well over 6' tall. If i want a fence high enough that i can't see over it, and an HOA gets in my way, I'll put their heads on spikes. I'm so used to looking over fridges, divider walls, 6' fences, cars, shelving units, clothing racks... I don't need that all the time. Honestly, it's annoying.\n\nFucking give me privacy.",
            "My favorite HOA takes it up the bum story: [https://www.washingtonpost.com/local/2013/02/09/d46f9bec-6652-11e2-93e1-475791032daf_story.html?noredirect=on&utm_term=.b540157216fa](https://www.washingtonpost.com/local/2013/02/09/d46f9bec-6652-11e2-93e1-475791032daf_story.html?noredirect=on&utm_term=.b540157216fa)\n\nI have sent it to my HOA more than once.",
            "These HOAs in the „Land of the Free“ are quite ironic and frankly ridiculous",
            "People got too much money to be doing this petty shit. Fencing is very expensive, masonry much more so.",
            "This whole post smells like updog",
            "Sounds like this professor is made of money to tear down a 9ft wood fence, only to build a 6ft fence on a 3ft brick wall.  Of course, the first thing any contractor would do is have a survey before starting a fence project in a HOA community.  \n\nI'll take this didn't happen for $1,000 Alex!"
        ]
    },
    {
        "post_id": "10sh0m0",
        "author": "iwasthechubbylady",
        "title": "Want my section because I make more money. Go ahead I will still make more than you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sh0m0/want_my_section_because_i_make_more_money_go/",
        "score": 19124,
        "num_comments": 765,
        "created_utc": 1675419545.0,
        "selftext": "This all happened about 18 years ago. I was a waitress for a Village Inn. I worked the morning shift because it had the most business. Now this is back when smoking was still allowed in restaurants and we had a smoking section and a non smoking section. Our seating chart was designed for this in mind and never changed even after the restaurant went full non smoking. Now on Sunday we had your wonderful church rush that would pack the entire place for hours. So Sunday was totally non smoking until 3pm.\n\nOn the weekends we would have about 8 servers. This ment that smoking side had 2 while the other side had 6. So if you worked the smoking side you had 10 tables to take care of while the other servers had 4. Management knew I was good at what I did and would always put me in the biggest section on Sunday and I could take care of all 10 of the tables no problem. Now servers always talk about their tips and without fail I always made more than anyone else. This caused anger from some of the newer servers and they said it was because I always got the better section.\n\nManagement came to me and told me what was going on that's when we decided on malicious compliance. Ok you can have my section next Sunday I will take this small section. But since I am on the other side of the restaurant I will not be able to help you much. I then got to enjoy a less stressful Sunday did my job like normal turned my tables and made a ton of money. The other server was running around like crazy and not getting much done. At the end of the shift they learned that they made less than the week before because of how bad they were taking care of their tables and the church crowd are horrible if you aren't taking care of them right. \n\nIt was always great to hear the server say you can have your section back I don't want it ever again. Now this was not a 1 time thing this happened many times over the 5 years I worked there. Everytime it happened I still made more money. Everytime we would get a new server complain I just smiled and said go ahead take my section I could use a break.",
        "permalink": "/r/MaliciousCompliance/comments/10sh0m0/want_my_section_because_i_make_more_money_go/",
        "comments": [
            "“No no, you misunderstood me. What I wanted was to do the same amount of work I used to do and get more money”",
            "Imagine actually being competent.",
            "I was a server for ~7 years and yes, 10 tables is a lot! I wasn't a terrible server and did a lot of things really well, but after 6 tables I would sometimes get pretty frazzled, especially if it was constant turn-over. For those who can handle 10, that's amazing! But no newbie should be given more than 4, even if they have a lot of server experience but are new to that restaurant it takes some time to completely become acclimated to how that place does things. Honestly, it feels like they should have been able to SEE that they wouldn't be ready for that section!",
            "I’m surprised the other servers didn’t suggest pooling tips 🤪",
            "I work in restaurants and it's a running joke that the worst/least competent servers are the ones who are always complaining about tips. \"can you believe {x} table only left me $Y dollars??\" Yes, yes, I can.",
            "100% different but this reminded me of when I was a cook and ALWAYS had to close the restaurant, usually alone and never got the easy day shifts. New people would start working there and would get these breezy schedules (I would have to work events, they frequently did not) and after a number of months of this I was pretty fed up and complained directly to my kitchen manager.   \n\n\nHe said \"the reason K doesn't put you in during the day is that he trusts you and knows you're a good worker. The reason *they* get shifts during the day is so he can keep an eye on them and make sure they don't fuck everything up.\"   \n\n\nI was never bothered by it again. I had just never considered that it was about ability and that small change in perspective made me feel a lot better about the inconvenience.",
            "Oh how the turned tables",
            "I haven't worked in a restaurant/bar in almost 15 years but still have dreams of being in the weeds non-stop with an endless amount of tables and more filing in. Hate those dreams as I wake up stressed out.",
            "I used to work in a restaurant as the only server most days. We had 21 tables plus counter seats. Somehow I was one of 3 waitstaff that could take the whole restaurant on by myself plus help the cooks some. No hostess and only a dishwasher part of the time. I also knew to call for help when I needed it. \n\nWe once had a server decide he didn’t want to call for help because he didn’t want to share tips. I happened to be driving by and saw how busy it was. Of course I stopped and ran in to help. He was telling everyone it was a 45-60 minute wait for food. I was able to knock every table out within 30 minutes. \n\nThe amount of customers that called our boss to complain about him were obscene. Our boss never put him on a shift alone again. He ended up quitting a week later because he couldn’t make the amount of tips we could.",
            ">and the church crowd are horrible if you aren't taking care of them right\n\nI was with you till you said this.  Church crowds are the worst, customers and tippers.  I'd rather deal with a bus full of kindergarteners",
            "As a former food and beverage manager...an excellent server is better than most other positions.  A good server can cover for a bad chef, but a good chef cannot cover for a bad server.  Further, a good server can easily make up for poor management.",
            "Sometimes it's not the section that sucks, sometimes it's you and you just don't learn that till it slaps you in the face lol",
            "My mom volunteered for her churches yard sale. She always made the most money. Sold the antiques. The deacons decided the section that made the most money should be run by deacons. They put her in charge of selling used towels and sheets. In the past they would put them in shopping bags sorted by color and you could buy a bag for $2. She folded every towel and sheet and sorted by size and color. In an area where there are lots of Airbnbs. She contacted all of them. They came and bought up replacements and extras. $1 a piece. Anyone who tried to negotiate she’d remind the money was going towards charity. $1 at a time she made more money than the deacons selling the antiques. Minister asked that she be made a deacon since she worked so hard and made so much money for the church. They did. The next year they said she could go back to sell antiques inside with AC instead of standing outside in the heat. She went back to selling towels and made even more money.\n\nEdit:typos",
            "Sometimes, the best way to convince someone that they don't want something is to give it to them.",
            "My sons mother worked at an On the Border years ago, and every Sunday, it would get slammed by these one set of church goers that wore camo shirts with their church name on it. They were notoriously bad tippers, no matter the quality of service, and would make the servers run around for them with many many requests. \n\nThey were dubbed the God Squad, and the servers would take turns with them as they were so repugnant.",
            "I've been serving for a long time. This year I was told I work too hard and am making the other servers look 'bad'. This is the second time I've been told this. It's the best unintentional compliment. I'm not making you look bad, you're making yourself look bad. Maybe stop watching tictok all shift?",
            "I once worked with a guy that was THE epitome of a server. Didn't matter what section he worked when, he made bank. \n\nOther servers would always whine about one specific section, saying they could never make money in it, regardless of the night. Boss would throw him in there, and as always, he'd clean up. \n\nThere are some places you are going to make a certain amount of tips, but to get higher levels, it's on the server.",
            "There’s quite a few folks here who work as a server many years ago… wonder how you feel about the service you normally get as a diner today, as compared to the service you gave years ago.?",
            "OK.... But if you were the best, AND you made more money on the smaller section AND it was easier?\n\n... Why not just keep the smaller section?",
            "\n>the church crowd are horrible if you aren't taking care of them right\n\nSo much for \"Love thy neighbor\" and all the assorted BS",
            "When I took a job as waitstaff, at 16  my mom said,  \"You have to keep this job for at least six months.\" But I suuuuuuuuucked! I simply did not have what it took, and I HATED the polyester, houndstooth-checked dress we had to wear (I got chub-rub, and was always sweating in that damn thing!). \n\nI noticed the other teens/young adults who were good at it always wanted more hours.  So I would often pack real clothes with me, and when my parents dropped me off,  I'd ask the other staff,  \"Anyone want my hours?\" Never heard \"no.\" Then my bf would come get me, and drop me back off to be picked up by my parents at closing time. Five and a half months later, I put in my two week notice and stopped torturing everyone involved in my awful waiting skills.",
            "If nothing else, when someone says take the thing I have that you want, you should know you just fucked up",
            "It truly takes a certain talent to work with the church rush. I had a friend who worked in food service who told me similar stories.\n\nI guess spending the morning engaging in a supposedly love-based religious ritual makes you less likely to tolerate bullshit from someone trying their hardest to make you happy.\n\nI think you handled these situations well.",
            "Waiting tables is hard work. Not just the running and carrying, but all the data one must keep in their head. Being a busy server is a lot like a ballet, but therr is no director and no choreographer. You gotta do it all, and do it on the fly.\n\nI have ADD, I'm terrible at it. I would forget so much and piss everyone off. I do well with a little more repetitive work and a little less multitasking. Tip your servers, folks.",
            "I also find it rather humorous that the church crowd are less forgiving and less generous.",
            "Back when I was a waiter we used to call them suicide sections",
            "People who make good tips are people who bust their ass to give good service. Amazing how many people don't understand that",
            "\"and the church crowd are horrible if you aren't taking care of them right.\"  \n\n\nI was waiting for that single line. While I would argue in some areas, it doesn't matter how you treat them, they'll shit all over you 15 minutes after praising the lord and being wiped of all sin.",
            "\\*stomps feet like a child\\*\n\n\"This isn't fair!! How does she get the section that makes all the money?!!\"\n\n\\*realizes can't handle 10 tables\\*\n\n\"I don't want to work this section anymore! She can have it back but she should be sharing her tips with us that don't make as much!\"",
            "Gotta love how the church going folk are known for treating you like garbage if you \"don't treat them right\".  Hypocrites, every single one of them.",
            "Don't you just love know it all idiots. I worked 10 years waiting. Until I lost it on a party of \"karens\" a half an hour before shift change.  After that I switched to Banquet waiter/bartender what a joy.",
            "Make sure you can do the job before whining you don't have the opportunity someone else does.",
            "This is beautiful",
            "Having never worked in a restaurant, it was surprising to me when my college-age cousin told me the craptons of money she made waiting tables at a very busy Red Lobster. She was working her way through college and was a busty Barbie-girl - blond, blue eyed and super cute.\n\nShe made so much money there she told her parents she didn't need them to support her college career any more after her freshman year. She paid for all her tuition and living expenses by working a few nights a week at the Red Lobster.",
            "Been there done that. Even worse was when my regulars got pissed with the newbies. They were brutal. Knowing your regulars and having things the way they like them also contributed to better tips.",
            "A couple of years after we graduated college me and a few close buddies of mine who decided to all stay in the area of the college town we went to would get drunk on a Friday night at a friend's apartment then walk over to the local greasy spoon 24-hour diner. We had the drunchies, we were all 24-28 years old and wanted to sober up and avoid a hangover for whatever Saturday shenanigans we chose. \n\nThis place was typically a ghost town but sometimes they would get a few tables from the bars letting out and the locals who knew they were open 24 hours. Typically it would be 6-8 of us. We ended up becoming regulars and the waiter who typically served us was this guy named Mike who was working Friday nights for extra cash. We were always pretty wasted but Mike was a damn good server and really cool and friendly. He never really hung out but would make sure we had plenty of coffee and would stop by for a few minutes at a time to laugh at our bullshit typical bro shenanigans. Typically they only had two waitstaff at that time of night and some kitchen staff. We always requested to be sat at Mike's section because we liked him and he was a good server. We did this for years and no matter how many times we tried to convince him to come out Mike stayed professional (which as a former server, LOL) and never came out to party as much as we tried to convince him. \n\nI don't know what the fuck happened but I think the other servers who were occasionally scheduled to work Friday nights as part of their rotating schedule started complaining that Mike would leave with a big fat wad of tips from a half dozen or more drunken former frat bros. We started coming in on Friday nights and he would have to avoid us and we would be sat in a different section. The servers we got weren't as friendly and would sometimes rush us (we would stay for an hour or two to end the night of partying) and weren't as down with our sense of humor as Mike was. \n\nEventually after a few times of going there and getting seated in a section without our preferred server we decided to stop going to that diner all together, even when we were wasted and hungry on a friday, because it wasn't the same atmosphere/ambiance without Mike. \n\nSo the owners/manager decided instead of making at least a few hundred on (back then) cheap af to purchase and prepare breakfast food, to lose that money to appease some squeaky wheels who worked night shift at a diner that didn't get a ton of business late at night because they didn't want to work hard.",
            "10 tables all sunday service? You must be a superhero haha.. \n\nOn another note, how the hell cant they manager 4 tables.. cant be that hard",
            "I don’t know if anyone has suggested this but you should post this on r/talesfromyourserver",
            "It's weird how good workers always seem to get punished with the harder work. \n\n\nI had a job where the boss would ask me to take the angriest customers \"because you're great at calming them down\". \n\nI always had the harder tickets because I wanted to not only fix them (and calm the people) but I also wanted to understand why! \n\nThe upside was I got travel \"because you're cool with different cultures and stuff\", so foreign travel happened.",
            "My mom was a waitress when I was a kid, and a damn good one. She worked at a popular lunch place downtown. She actually made minimum wage plus tips, not just waitress minimum wage, but like, standard minimum wage. So she would actually get a paycheck, too. And she always got the best sections during the lunch rush. New folks would get jealous, and want her section. Okay. But then all her regulars would just insist on sitting where she was working.",
            "\"wonderful church rush\" lol, I still have vietnam flashbacks of these people",
            "> and the church crowd are horrible\n\nAgreed",
            "Quality work in both ways.",
            "Good on you OP.  It was the same when I worked at McDonalds, but not because I made more $$$ (I did, but that's another story) It was because my coworkers assumed what I was doing was EASIER because I wasnt rushing around or freaking out.  I'm just a methodical, meticulous, person that attacks things systematically.  I WAS always busy, just not rushing.   I would offer to switch with them and within 20 minutes-1 hour, they would ALWAYS ask to switch back because they were behind, stressed out, etc.  THEN I would turn it up a notch or 2 until I caught up and then just go about my task normally and nonchalantly.",
            "I can't imagine not asking followup questions when someone in your position willingly cedes it.",
            "Man I still have this happen even though I work in a kitchen that runs food and we do tip/ profit share. The only reason I make more every week is I work more every week. I offer up my hours every time it's brought up but nobody seems to want to take em lmao. My partner is the real breadwinner in the relationship so we don't really *need* what I earn but it is nice for once in my life (I'm 30) to actually be able to afford to start a savings or buy things out of want and not need",
            "Village Inn, goddamn that takes me back. I haven't seen one since sometime in the late 1990s, but I left the city I grew up in at that time.\n\nRespect for being able to handle that many. The ones I went to were always throwing 10+ tables at people during drunk rush. Looks like one of the two franchisees in my hometown left the chain and became Butter Smith.. I think I still have a Village Inn coffee mug though.\n\nI've waited tables before and felt like I was in the weeds once I had more than 6 tables, but I was in a tiny place where people seated themselves (they didn't prepare or bring everything out together either...). Usually only had 1-2 servers.",
            "I was a server for a long time at Dennys and Bakers Square. I am in absolute awe of the people who worked Sunday mornings. They probably earned 4x what I did and they deserved it. \n\nTbh, I was not a very good server (probably because I have adhd) and I always worked dinners (the slowest shift for diners). The Sunday morning servers were in a different class. \n\nI still miss the pie from Bakers Square ☺️",
            "I gotta say, you are the kind of server I had aspired to be back in my serving days haha I tried my best but juggling 10 tables solo was incredibly challenging and I always ended up missing something here or there. Water refill here, extra side of ranch there. I did alright but would never willingly take on a full section like haha",
            "Mmmm....the French skillet. I always get the French skillet at Village Inn - except at the crappy Village Inn, in Coco Beach, who didn't serve it.\n\nI usually go to the Village Inn in Virginia Beach and have the impression that it's not a great place to work, as there are always new people.",
            "Ha, took me back to the good ol' times thank you. Reminded me of similar incident while waiting tables where I had just started at this place with only 10 tables, and due to it's size it was only 2 of us on on weekend nights.(mind you I was seasoned compared to the gent who was senior to me in tennior at this place).\nI saw how the place ran and offered for us to split tips that way the work gets done no matter, he was adamantly against that and was not even wanting to hear it...it took him 10days of watching me stack that 💵 with the same amount of tables/diners as him before he \"sat\" me down to discuss us being a team and how we should tip pool.  I laughed at him and straight up asked him- what changed your mind?",
            ">and the church crowd are horrible ~~if you aren't taking care of them right~~.\n\nFTFY",
            "Man this sounds like the Denny's is use to work at I high school. It was so much fun running circles around some of the other servers when it came to situations like this. They never understand how efficient you have to be when taking care of a section that big.",
            "I place I worked at was open 24-7. The overnight servers used to make a killing and only got busy on weekends and maybe for an hour at the end of their shift. One new server came in, took over nights, and didn't make shit. She claimed she was a better server, she wasn't, and the one new cook she worked with was a good cook, he wasn't, so she didn't understand how she didn't make much money. I would insist you probably aren't serving as well as these other people, and you're pushing the regulars out of the building. There used to be loads of bartenders that would come in late night after work. Do they do that anymore? If you're saying the food is better and you're a great server, why is there less people and why do you make less money?",
            "Running 10 tables is not for the faint of heart.",
            "> turned my tables\n\nYou sure did. Good work!",
            "In my experience, church crowds were horrible no matter how good we treated them. We'd be lucky to get $5 for a table of 20.",
            "So what are the basic go-to strats for getting real tips out of the Sunday crowd and not just Chick tracts pasted onto monopoly money?",
            "You just described experience and efficiency. \n\nYou're hired!!",
            "I worked at the chilis in lake buena vista years go..  for those not familiar with the area, this was the chilis RIGHT OUTSIDE of disney property \n\nused to work the section we dubbed “hells corner.”  It was dubbed this for obvious reasons.  money was great, but on Fri/Sat nights, it was a fucking gauntlet to say the least.  \n\nThere was a reason only myself and my partner worked it religiously.  God forbid one of us needed one of those nights off, the other would take it off too.  Wouldn’t work it without a partner i could depend on \n\nNever had a malicious compliance issue come up for just that reason.  Occasionally we would take the night off together, and other servers would be thrown to the wolves.  Us taking a night off every 3 months or so was enough to keep the newbies (and even a good portion of the older servers) in check, lol",
            "Lol I’ve always laughed at servers who get greedy and end up biting off more than they can chew. They got exactly what they asked for…but at a cost.",
            "The church crowd being horrible if not taken care of right is the icing on the cake.",
            "As a person who never worked as a server, I will always admire the work you guys do. And tip accordingly although I'm against tip culture.",
            ">go ahead take my section I could use a break.\n\nnow that's a foreboding warning if ever i've heard one",
            "My mother and her BFFRose were both waitresses when I was young.  They didn't always, but often would work at the same place.  And if at all possible tried to get the same shift.  Both worked super hard, good with customers and smart.  So when they worked together they'd cover each other and multiply their efficiency.\n\nLike you they also helped anyone else they worked with, but they where best as a team.  Smart managers knew this and would put them on the bussiest shifts together.  They made bank. The actual pay check just went into the bank, paper money tips paid all the bills and my mom had a 5 gallon water jug that she'd put all her change in (that I stole from constantly).\n\nBut every place at some point would get someone else on staff that hated them (several times with was the server who was sleeping with the manager...) and so management would always after a while throw a wrench into the system.\n\n\"We're going to pool tips from now on.\" or \"We can't have you two working together all the time because it's unfair.\" or whatever BS it was.\n\nI remember so many, what I would come top realize later where petty, trips to restaurants my mom used to work at on a Sunday morning to \"Say hi to the old gang!\" that were really just to watch the disaster things had become since she quit to work somewhere else.\n\nTo this day one of the things I do in any busy restaurant I go to is to spot the one or two servers who are doing 90% of the work while also being the nicest to the customers.  Sometimes it's a balanced staff, but usually you can spot the star. They probably refilled your coffee quickly as they passed by while not being your server.",
            "That comment about \"wonderful church people\" was sarcastic, right?",
            "Fuck. If I only had 4 tables I would be in heaven.\n\nAt my current place we don't have a section with less than 10 tables. We have 60 tables and 5 sections. \n\nEach section also has at least 2 big party tables.\n\n\nWe don't have church ladies though. Only drunk peple and Karens",
            "This is just another condemnation of the idiotic, obscene tipping culture in the U.S., where your wage depends on tips. This is slavery in all but a name.",
            "My mom was a waitress at Denny’s, almost always worked breakfast shift, especially on Sundays. Worked hard and was good at her job. Had regulars that would leave if they couldn’t sit in her section. On average, turned over nearly twice as many tables and made nearly double what any of the other servers made.",
            "While in high school I worked at McD's. Sunday morning was always the worst. We had a huge baptist church near us and they would always destroy the dining area. Most wouldn't even clear their table. I stopped one family and told them this is not a full service restaurant and please remove your trash from the table. They just smirked at me and told me to have a blessed day.",
            "“The church crowd are horrible if you aren’t taking care of them” \n\nNever a truer word spoken.",
            "Great story. Funny as an aside how in every story about waitstaff who serve \"church crowds,\" the person telling the story always mentions how difficult/unpleasant/unkind the after-church Sunday crowd is. So ironic.",
            "I notice in countries with tips that servers will just stick to their sections instead of helping out wherever was busiest",
            "So why didn't management just move 1 server from nonsmoking to smoking.  1 person gets 4 tables, 4 people get 5, 1 gets 6 and 2 get 7.  As people get more experience they get more tables.",
            "You would think if this was a recurring event, that some of the folks who already went through it might warn off the new folks. But I guess even if they did...those folks still wouldn't believe it until they learned the hard way.",
            "Pro's make everything look easy!",
            "Maliciously delicious!",
            "the church crowd are horrible if you aren't taking care of them right.- can confirm.  \nI worked a coffee shop for years and there was a local mega church than had small groups on Wednesday night. and their specifcally \"over 40s singles group\" would come in every Wednesday and they. were. horrible.  Terrible tippers, so mean, but yea the church crowd is the worst.",
            "I just love the description of how bad church crowds are.  As someone who worked in retail they suck.",
            "     “...the church crowd are horrible...”\n\nSounds about right.",
            "Woah....Village Inn was a chain? What the fuck?",
            "When you have ultra instinct, and people don't realize the power difference",
            "If you were there longer than them then you should get the better section. Especially if you’re better than them.",
            "The Glengarry leads are for closers",
            "I looked everywhere in this sub and the info and I can’t find anything about this so I don’t know where else to look… what do the flairs mean in this sub? For example, the green “M” on this post.",
            "Sounds like the Valentinos in Nebraska City, NE.",
            "the icing on the cake would be one of the church tables requesting you specifically. \"Wheres the nice Waiter who always is here, I want them!\"",
            "As a waiter, I always liked 5 * 2 tops. I could turn them easily and the difference of $20 a night (late 80’s) did not mean much to me.",
            "My dad was a manager at Village Inn in Florida. Loved that place.",
            ">\t[T]hey made less than the week before because of how bad they were taking care of their tables and the church crowd are horrible if you aren’t taking care of them right.\n\nThis is my surprised face. 😐",
            "\"The church crowd are horrible if you aren't taking care of them right\" lmao what an irony",
            "Waiting tables is a very difficult job. I put it up there with other stuff that I would never even bother trying my hand at, like being a Paramedic or any position that puts me on-call 24/7. \n\n   Waiters are heroes; I put you up there with Nurses for the difficulty in dealing with the public and even the crazy hours, and the part about working for peanuts just makes it worse. \n\n   You get only respect from me especially because I know it is a job that I could never do. I just don't have the patience for it. You are a Saint. Bless you. \n\n   I worked in Fast Food at an Arby's and at a Hardee's at a different time but I never worked at any place that had waiters. I do know LOTS of people who wound up with waiting jobs though and they all have horror stories. \n\n   It's ROUGH out there. You are completely right about the so-called 'Christian' crowds. Most of those entitled people are the skinniest of skin-flints; they will give you verbal tips (usually about going to church) and nothing more. \n\n   SOME of them actually do try really hard to live up to their names sake but not enough of them. \n\n   I am glad you survived that job and I hope you are doing MUCH better in your life now. :)",
            "I was a waiter at a place where I worked my way up to about 7 tables and was able to handle while feeling busy but not overwhelmed. One day, they decided \"oh, dur can handle 6 tables in this room, 3 in another, and 5 in the last one he can't see from the other two rooms\". This was a regular section for the dude that worked 12-14 shifts a week during the summer - there are only 14 shifts/week. \n\nI lasted all of one hour before they took the last room away. I never asked for that, and they never gave it to me again. Waiting tables can be really difficult.",
            "I remember years ago being jealous that I never got the best section that had the best tables by the windows that everyone wanted to sit in. A few years later when I had more seniority and got that section, I found out that the people who asked to sit in those best tables were a lot less pleasant to wait on than the customers I was used to waiting on who didn’t mind sitting at the regular tables away from the windows.",
            "Nicely done… I know exactly what you mean. I used to work at VI, too 😂",
            "I had this only one time. I worked at a furniture delivery place. I did a 420km trip to a truck stop and waited to swap trucks with another driver then made the same trip back. I did this Mondays and Tuesdays with the occasional Wednesday. One of the boys Get's annoyed and speaks up saying \"Why does he get the easy job? All he does is drive. I want to have a turn\"\n\n&#x200B;\n\nI told him go for your life. What he didn't realise is there is literally nothing to do other than pull over for a 5-10 minute break and your lunch. You can't cruise like if you were an offsider (Most crews had 2-3, one being a designated driver and the others being labour. You'd chill in the cab, sometimes have a nap and wait till the next location and maybe move 3 items max per job and build a couple). \n\n&#x200B;\n\nHe lasted one round trip. The moment he got back to the yard he said \"This is bullshit. You can have it back\" but I said \"Nah, I like this more. You told them you wanted the run, you can have it\"\n\n&#x200B;\n\nHe took me out for a night on the piss and I got the run back lol",
            "Nothing beats efficacy and experience.  The new blood don't get it today. But want the perks. Learns the hard way.",
            "I served for a little bit in high school, but tipping culture really left a sour taste in my mouth about it. Not sure if it was my age or my gender, but even on nights where I would take more tables and provide quicker service I consistently made less money than the older female servers. I thought serving was fun, especially interacting with the customers, but what I was getting paid for it definitely did not justify the workload.",
            "I only worked as a server for 2 years, but I can relate. I would get other servers talking smack to me or trying to make me look not good in front of the manager because I spent a lot of time in the back chilling, since pouring drinks and typing in orders isn't really complicated for anyone past the 7th or 8th grade. Actually I specifically remember an exercise in the 1st grade where I had to pretend to be a waiter, so I was about 6 and it didn't seem much different. It turns out that most of the service industry has nothing to do with worker ability, bt a lot to do with worker and management \"relations\"",
            "Church people are horrible! I don't know what they do in the church that make them insufferable baboons in restaurants",
            "And so many people think all servers should be paid the same no matter the workload",
            "US restaurants could just pay their workers a living wage and just get rid of tipping all together. It should be on the people to pay someone’s wage.",
            ">because of how bad they were taking care of their tables and the church crowd are horrible if you aren't taking care of them right.\n\nThats how a tip based system is supposed to work. If you are good, you make lots of money, if you aren't then you don't.",
            "\"church crowd are horrible if you aren't taking care of them right\". Is church a congregation of white haired babies??",
            "As an ex-dishwasher, I can only get so much enjoyment out of this post.",
            "“the church crowd are horrible if you aren’t taking care of them right” well then I guess they missed the point of church huh",
            "[deleted]",
            "> This all happened about 18 years ago. [...] Now this is back when smoking was still allowed in restaurants \n\nWhat backwards place still allowed smoking in restaurants in 2005?\n\n> Now on Sunday we had your wonderful church rush that would pack the entire place for hours.\n\nBible belt... got it.",
            "Eighteen years?\n\nJesus christ.",
            ">the church crowd are horrible ~~if you aren't taking care of them right~~\n\nFTFY.",
            "If you made just as much working the easy side as the hard one, the only winner was the owner.",
            "I know this is supposed to be a feel good story of malicious compliance.\n\nBut to me it just exemplifies the unfairness of the tipping system.\n\nBusinesses make servers fight each other over the scraps with arbitrary and random tips from strangers and their preferences and biases (including stuff like sexism and racism) whilst the people at the top have almsot zero financial risk and make profits regardless on whether a server gets a tip or not.\n\nIt's a shit system.\n\nI mean, you admit you have to suck up to church types just to get a good tip. 👍 good job.\n\nIt would be better if everyone just got paid a liveable wage.",
            "You’re a bad coworker with awful bosses.  Sections are supposed to be based on turn time and head count.  This is just a brag post about how you and your bosses screwed over your coworkers instead of providing even sections.  Is it no surprise someone’s section more than doubles and they struggle?",
            "Sounds right.",
            "Bro I’m the best waiter ever and ten tables is a nightmare.  I know a lot of servers that think they can handle that many tables, though.  Your incompetent management should probably have just scheduled two people out there so that their patrons actually got taken care of.",
            "Surprised the church people tipped at all.",
            "My question is do you take the time to do the other parts of your job that don't involve sucking as much tip from your table as you can? Do you scrape the food from your plates? Do you jenga tower the dishes trying to kill the dishwasher? Do you just yeet the silverware into the bucket, throwing nasty water all over the dishwasher as he takes a bite of his food?\n\nThere's nothing I hate more than an overworked server that only cares about tips.",
            "Thanks, but this isn't really \"malicious compliance.\"  You were not malicious.  If anything, you were kind and gracious.",
            "So instead of maybe helping your fellow workers by giving them advice or something you work with your bosses to set them up to fail and then feel the need to gloat over their misfortune to the Internet later?"
        ]
    },
    {
        "post_id": "lnjta8",
        "author": "-AceCooper-",
        "title": "Converted from salary to hourly, best decision ever.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lnjta8/converted_from_salary_to_hourly_best_decision_ever/",
        "score": 19117,
        "num_comments": 417,
        "created_utc": 1613751775.0,
        "selftext": "I worked for a mid size fashion company with around 150 retail stores nationwide as a maintenance and safety coordinator.  4 months into the job my manager quit and I picked up everything and was doing fine on my own for years and I was the only person in charge of maintaining the stores and the alarm systems in all the stores.  I did get a pay bump but not a promotion in title.\n\nI put my contact number on every store's emergency contact list just in case the primary contacts, usually the store managers, don't pick up their phones in case of emergencies.  And the store managers almost always refuse to pick up calls during off hours, so my phone would ring at least 2 to 3 times every night.  99% of the times are false alarm, usually caused by window break sensors getting tripped by vibration from a big truck passing by or a leaf hitting the window.  I hated it but had to do it because if no one on the emergency contact list picks up the phone, the alarm company automatically calls the police for dispatch and there are penalties for false alarms, ranging from $50 to $200 per incidence after 2 or 3 freebies, varies by location.\n\nIn 2017, Department of Labor passed a law requiring all employees making under a certain amount of $$$ to be converted to hourly so they can earn overtime.  My salary was $800 short of making the cut.  I brought it up with HR stating that an hourly schedule would actually interfere with my duties and a $800 raise in pay would make everything easier.  And HR simply said, \"well, that's too bad and we can't do anything about it at the moment.\"\n\nWell, ok.\n\nAfter that conversation I put my phone on mute and stopped caring about anything outside of my 9-5.  In hindsight, life was actually so much easier and better that way and not sure why I even wanted to stay on salary.  Months go by without any serious issues, except for the penalties for false alarms starting to pile up.  One day Accounting and Operations brought me into the office asking what those costs were. I told them what they were and Operations sent out a memo reminding all store managers that safety is of critical importance and they have to pick up calls from alarm companies.  No one bothered asking why there was a surge of these additional costs and I didn't care enough to remind them that it was because of me.\n\nFew more months go by and one morning I woke up to almost 20 missed calls on my cell.  Apparently, one of our Florida stores was broken into the night before at around 3am.  The store manager tried to get a hold of me because I was the one in charging of requesting/dispatching vendors for things like emergency board up.  After an hour of trying to get a hold of me, she eventually started calling up everybody on the hierarchy for help and I had 6 missed calls from the Senior VP of Operations alone.  Eventually the Director of Constructions was able to get a crew to board up the store but that was almost 3 hours later and everyone was royally pissed.\n\nUnsurprisingly, the second I stepped into the office I was called into the office with all the senior management and HR and were asked why I was not there to take care of it.  And I simply replied \"because I already clocked out.\"  The senior VP of operations was obviously not pleased with that answer and said it was my duty and I needed to be on standby at all times to handle these situations even during off hours.  To which I stated \"oh, so I should be on call then.  In that case I'll have to work with Accounting to get properly compensated for my on-call hours once we have a schedule established.\"\n\nThe room went silent.  And nothing came out of the rather short meeting.\n\nLater that afternoon, HR called me into the office again asking whether I'd like to become salaried again with a pay bump.  I said I'll take the pay bump and but I'd rather stay hourly and walked out.\n\nThey didn't give me the pay bump.\n\nEdit:  Sorry I didn't provide what happened next.  So here's some closure.  I was put on call for a few weeks because it was summer at the time of the incident and HVAC systems kept failing over the weekends in our Florida stores.  And again, I was the one to dispatch vendors to fix them.  Money was great during that period lol.  Eventually the Director of Constructions was put on as the emergency contact for off hour issues and he absolutely hated it.\n\nI left the company last year.  They had to scramble to get a replacement and hired a maintenance supervisor with an MBA in political science, but no related experience......  My last contact from the company was the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems.  I didn't reply.",
        "permalink": "/r/MaliciousCompliance/comments/lnjta8/converted_from_salary_to_hourly_best_decision_ever/",
        "comments": [
            "Nice.  Employers routinely take advantage of people's goodwill.  This is wage theft no matter how you slice it.",
            "[removed]",
            "Some tip: If they ever decide in the future to arrange for you to be compensated for on-call hours (which they probably will), a 5-minute call can turn into a minimum of 1hour of work. So that's the best.",
            "Another example of penny wise pound foolish on the part of companies who think that dismissing the recommendations of those underneath them is a good idea.",
            "never work for free.\n\nIt is not your money that company wastes, so you should not care. they dont care about your time, you dont care about their money. simple as that.",
            "Something similar happened at the hospital I worked at. The supervisors were salary and were in charge of taking call outs and arranging for coverage. Once that law passed, HR didn’t want to bump up their pay to keep them salary so the supervisors were no longer able to take call outs. I was a manager at the time and I knew the value of my supervisors. I had fought for them to get raises because i knew they were worth it. They all offered to still take call outs because they knew it would fall on me if they didn’t. I told them to not take any calls off hours and instructed the employees to only contact me outside of work hours. I ended up getting burnt out and quit about a year later. That wasn’t the main reason but it was just the icing on the cake of being overworked constantly. I still have friends who work there and conditions have gotten steadily worse in the 3 years I’ve been gone. I count my blessings every day that I was able to escape.",
            "*Later that afternoon, HR called me into the office again asking whether I'd like to become salaried again with a pay bump. I said I'll take the pay bump and but I'd rather stay hourly and walked out.\n\nThey didn't give me the pay bump.*\n\nSo what happened next? Did you quit or simply continue to refuse to answer any calls after hours?",
            "I remember working as a general manager of a fast food chain restaurant. I won’t name the restaurant but it rhymes with “shit-fondles”. \n\nAnyhow, my district manager was on my ass about labor cost and I kept insisting that I needed that much labor in order to break the sales records that I was breaking. I had a regular clientele that reliably showed up every day for breakfast (seniors) and then construction workers were flooding in for the “Golden hour”. I scheduled 28 employees every day to handle the lunch rush, and my deposits from lunch alone were up to $10,000 a shift! In my first year of doing this our store went from 1.2 million in profit to over 3 million in profit. My manager didn’t care. She wanted me to only have 12 people on to do the shift. \n\nI held out as long as I could because my crew was so happy to be making a good paycheck. Everyone was getting 38 hours a week. It was the best I could do for them, 40 hrs a week was not going to be allowed period. \n\nAfter many arguments my manager started dictating how to run my store and scheduling was done by her and we dropped down to 12 people. That when shit hit the fan. Every lunch was a disaster. It took hours to clean up after the lobby had been destroyed and I finally started thinking maybe I should quit. One night I was still in the store doing paperwork at 9:00 at night. I realized that I was getting up at 4:00 a.m. to open, working breakfast and lunch, then cleaning with my crew and then helping them set up for dinner. On average I worked 4a.m. To 5p.m. Every day and I was working that schedule 6 days a week. \n\nOne day I did the math. I was earning a little over $7 an hour. I put in my notice and never looked back. I think my experience with the shitty arches really informed my opinion of the corporate world in general.",
            "I love the very last line: “I didn’t reply”. Bravo!",
            "In 2005ish I worked at a job where I was on a rotation of being on call. It was shifts around the clock. If anyone didn't show up for a shift, I had to be available to cover for them. The last shift of the day started at 11pm, so when I was on call I would wait until about 1130. By then everyone who was scheduled to work had shown up, and I could go to bed.\n\nI was also an assistant manager (basically I was a manager but they structured it so they could pay me less). I always kept my phone charged, near me, volume up, in addition to the on call pager when I was on call.\n\nOne morning I came in to work and my manager says I'm in trouble. Why didn't I answer my phone at 3am? I took out my phone and showed him my call log. No incoming calls since the afternoon before. No missed calls. I asked if he had paged me. He said no, he had just called me directly. This was technically a violation of procedure, but everyone did it that way because you were supposed to call back asap anyway. I hated that damn pager--why bother when everyone has cell phones?\n\nSo he tells me that he decided to do a spot check in the middle of the night. He was required to do a certain number of these on each shift. He went in at 3am found a violation, fired the staff member effective immediately. Then he called me to cover the rest of the shift. \n\nBut that's not what the on call person is for. I'm only supposed to cover staff calling out sick. I told him this, explained that for whatever reason his call hadn't come through, and that he didn't use the pager. I didn't have a land line and wasn't required to. He was generally a fair minded person and he didn't really have anything to write me up on, so he \"only\" gave me a warning. I told him if I was on call all night I wanted a heads up on spot checks. He said that no one could know about spot checks ahead of time or they would be pointless (reasonable).\n\nI left the meeting and made a complaint. The company had a shift called a \"sleep shift\" where you would sleep on site. If you weren't needed you got $25. If you were needed someone would wake you to and you'd clock in. I said if I was on call all night I wanted sleep shifts.\n\nWell, a bunch of people talked to each other. The fallout was that company policy said that if you fired someone on a spot check, YOU cover the shift--not the on call person. I was there when they told my boss and he was like, \"...oh.\" If he was acting, he deserved an Emmy. He genuinely thought he could fire someone and the drag me out of bed to clean up his mess. \n\nI never figured out why I didn't get his phone calls. He called 5 or 6 times that night. I verified he called the right number. I even called my cell carrier and they had no record of calls.\n\nNot long after that the company made nighttime spot checks voluntary for managers. They said too many people were getting fired (not a good reason) but I think it was that managers didn't want to cover their own shifts.",
            ">  there are penalties for false alarms\n\nUnless they come out of your pocket, why were you losing sleep because someone else didn't want to do their job?\n\nI'll never understand people lighting themselves on fire to save their employer money, especially since that employer often wouldn't even spit on you to try and put the fire our.",
            "I would have accepted the out of hour calls and then just charge them the over time as per law. Probably cheaper than the call out charges....",
            "[deleted]",
            "I don't think you're allowed to be salaried when you are required to be on call for many hours in addition to normal working hours. It's abusive. Those employees SHOULD be hourly.",
            ">>I didn’t reply.\n\nAnd that’s how it’s done.",
            "I experienced something similar with the 2017 regulation regarding salaried work/required pay. The woman who ran the business office openly despised me and flat out stated she didn’t think my position (running an admissions department for a law school) was worth the required $47,500/year salary. I said, “Okay, well how about I keep track of my overtime and we can see if it’s cheaper to switch me to hourly work.” \n\nA lot of my job involved travel (drive time, events at schools, recruiting to classes, etc), constant emails, and phone calls all hours of the day (6 pm California time = 9 pm my time). After a month, I hand her (and my boss) a carefully tracked spreadsheet of all of my work alongside a calculation for how much overtime they would owe me. It ended up being about $2,400 of overtime a month, which would have almost doubled my salary. Needless to say, I got the salary bump (although not before the business office woman pitched the idea of me only working 10 months a year so they could avoid the regulation altogether).",
            "That 2017 change had my employer at the time switch me from hourly to salary to hourly within 6 months. Kept giving us more work, but never delivered on promises to hire more people. I tracked my hours, put in my notice and went to the Department of Labor to file a complaint. They ended up owing me almost 10k in overtime.",
            "I used to knock myself out for the company when I was young and dumb.  I have grown up a lot and I treat the whole thing like a mercenary.  9-5 I'm yours excepting lunch and my agreed upon breaks.  Anything happens before or after those times is officially not my problem.  If you want it to be my problem you pay, and it is going to be extra.",
            ">My last contact from the company was the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems. I didn't reply.\n\nthis shit right here. magnificent.",
            "> ...the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems. \n\nI'm sorry, I removed all company confidential information from my systems the day I finished up.",
            "I worked at a place where everyone supervisor and up were salaried. All except one guy. He was the head of maintenance and he had been at the job forever. So long in fact that he was there before they made the switch to salaried, which is why he was still paid hourly. He made obscene amounts of money, and still got to go home at 4:30 everyday. Last I heard they were still trying to get him to switch over to salaried.",
            "I was in a salary position for the last ten years and it was not worth it at all. I did get a fairly big bump when I started the salary but after all the “extra” time, early mornings, late nights and weekends the math works out to minimum wage... I left that company over a year ago to go back on hourly and get OT benefits and let me tell ya, I’ve made more in this last year then I ever have in my life. I’m now averaging 50K more then I was making on a salary position plus bonuses and no weekends or on call BS.",
            ">I didn't reply\n\nAw man that was the cherry of all cherries",
            "You only made one mistake. When they ask you for all those login credentials you should have made them hire you as a consultant. Good job sticking up for yourself.",
            "In my previous job I was paid hourly, plus overtime for the few times I had to work after hours. And was making really decent money. The contractor I was working for told me they were trying to get everyone switched over to salary, but we're giving me the choice. I told them no I want to stay hourly. I knew I would be missing out on a lot of overtime if I went salary. They actually let me do it for a couple years after that. My manager knew I didn't want to do it for that reason. When they pushed him to get me to do it, he ended up saying if I switched, he would let me continue to get overtime, by just adding the hours to my time card every pay period.\n\nI ended up caving, and you know what they followed through. It was a really good company to work for, and they took care of me. Unfortunately it was a government contract and they ended up losing the contract to the lowest bidder one year. I left shortly after that.",
            "A couple of jobs ago, shortly before I quit, I was complaining to the HR lady that, after I worked every day through November, my boss got mad that I took off for Thanksgiving. In the course of conversation, she asked me if I really would rather be hourly. I held out my hand and said \"if that's an offer, I accept.\" She didn't respond. I quit three months later.",
            "Good for you OP.   I was a salary manager for a bit and my Director changed my role to take any and all alarm calls for our 15 Buildings and find coverage for all staff that call out.  We had 50 employees and the hours of operation were from 6am-10pm.   I literally got no sleep because I was either responding to alarms,  call outs, or so worried I'd miss a call that I couldnt sleep.  After 18 months of this, I took a voluntary demotion to an hourly role and never looked back.  6 weeks after my demotion she was shitcanned for ignoring alarm calls and not finding coverage for our buildings lol.  I got soooooo many apologies after the fact from her superiors and others.  In hindsight, I should have complained but I was trying not to lose my job while my wife was in school full time.",
            "I was regularly working 60+ hours a week on salary. I had terrible managers, awful and impossible sales goals, micromanaging from people who are married to work (generally no families or lives outside of work), and just couldn’t take it anymore. I finally decided to look for something different. Better pay, no sales goals, and essentially set my own schedule (which means I can work mostly nights and enjoy my time with the family). My old job pretty much had me going to work before kids woke up and getting home around bed time. It was a major stress on my marriage and family. I felt guilty, angry, and resentful. Salaried for a retail company is about as bad as it gets. You’re replaceable, insignificant, and unimportant. The sooner people realize that the sooner they can stop looking for purpose in their work and just see it as an avenue for a paycheck to enjoy their life. Unless it’s a company that likes to promote from within, hard and extra work only earns you more hard and extra work.",
            "Our staff get about 2.50 an hour to be in call.\n\nIf the are called we pay out a minimum of 2 hours at 125% nights, 150% on Sat, 200% on Sun.\n\nSome of that is our local labor law, the 2 hour min is something I believe we choose to do.",
            "> hired a maintenance supervisor with an MBA in political science, but no related experience \n\nIt's always bothered me how far companies will go to hire somebody with a degree over people with experience, even when it makes absolutely no sense. It has to be one of the strangest things about our society I think.",
            "My employer doesn't like me, and hasn't offered me salary.  We moved offices 2 months ago, and the only employees truly helping with the packing were two salaried employees and me.  I pulled double my normal hours over the winter holidays, 3 weeks worth of 80 hour weeks.  I got it straight from the managers mouth that he was trying to find a way to not pay me.  It's hilarious.  I'll stay hourly, thank you.",
            "Lol, nice one",
            "> My last contact from the company was the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems. I didn't reply.\n\nFucking poetry",
            "I always remember that guy from bar rescue saying, “saving dimes but losing dollars”. The downfall of many companies.",
            "I work in facilities maintenance too, and once I’m clocked out, I’m out. Thankfully my company is very against working off the clock when you’re hourly. I’ve seen people become miserable once they’re salaried, and I made a decision long time ago to always stay hourly.",
            "You should have replied.\n\nTold them you were off the clock.",
            "Wow, OP you must have been really underpaid! The salary minimum is pretty low IMO, way to low to be dealing with that crap. Glad you left!",
            "If you want me on call, pay me to be on call.\n\nI love that answer you gave them!",
            "What I don't understand was, when the penalties started to rack up, why they weren't leaning on the store managers to answer the phone.",
            "Goes to show you that if you don't value your time , the company in most cases will not. How many years of free labor did they get out of you?",
            "I read your whole story and it really surprises me why people even get slightly shocked whenever I bring up the fact of how employers would literally replace you with illegal child slave labor if they could get away with it without so much as blinking.\n\nHow do you even get jobs like this though? I'd kill a dead tree to make over 47k/yr. That's $3,000 a month after taxes and a PPO buy up health insurance plan. Rent, utilities, food, car and I'd still have a grand left.",
            "How does someone even get an MBA in Political Science?",
            "I read this as \"converted from slavery\"",
            "I make more money than my boss because he's salary. His consolation is that when I annoy him, he can send me across the country at his whim.",
            "As a one-man shop, I rented private space from an occasional client. Right by the loading dock, so I could load in/out day or night with my own alarm code. My number was logged with the alarm service, and would be called if my zone alarmed, but was also down the list if the main owner's alarm was tripped, due to combined loading dock access.\n\nOver time, various personnel left, and I did also.  Years later, I was still getting alarm calls when I had no business interest there. At first I would try to reach people I knew who lived near there, because there were escalating penalties for false alarms. After about two years of intermittent calls, and continued requests to get taken off the list, I just started telling the alarm service, \"Well, it must be a real break in, so send the cops.\" After about 5 of these, they eventually heeded my request to *actually* remove me from the list.",
            "They hired a maintenance supervisor with a business degree in political science and no experience..... I’m sure that went well for them.",
            "Set your boundaries early. \n\nMake yourself indispensable in smart ways, not ways that create too much work for you though.\n\nGo interview and get a new job making more before you ask the existing job for a raise.\n\nAsk for the raise/promotion.  When they say no immediately say ok here’s my two weeks then.\n\nWatch the fun happen.  I played them back and forth till I made at least 10k more each time.",
            "So you did this without the pay bump? Did they make you salaried (I'm guessing they had to)?",
            "I thought this would end with you earning way too much overtime",
            "It is actually HR’s job to know employees’s duties and to compensate them properly. They fucked themselves over by fucking you. This is DELICIOUS compliance. :D",
            "3-4 calls a night? How did you even let it come this far!\nReally happy to hear you got your priorities straight.",
            "I need to hear more stories like this.  They make me smile.",
            "r/maliciouscompliance should be called r/satisfactionporn, because goddamn was that satisfying",
            "I love stories like this. I love seeing big shots squirm because they cant incorporate empathy into their \"costs/benefits analysis\".",
            "We build engineered flooring. So it's a woodshop/factory. They use the paychex system for clock in and out. Paychex does payroll. So after about a month of staying 15-20 hell even 30 minutes late, shutting machines down, making sure my.spot was ready to go in the morning. I realize that my checks are just straight 40 hours. Come to find out, no matter how long you stay past 330pm, or early you are before 7am? U wont get paid. Which is fine. OT is expensive I get it. But now they act like I'm not committed to my job because I clock out on the dot at 330. I dont care if we only have 2 more pieces to make to finish order, if a saw is on fire, I fucking leave when they stop paying me. It thought initially it was just some stupid 15min block deal, like if you clocked out at 344pm or rounded down to 330, bit the time clock is a computer and, even staying until 400pm hasn't added any time on my  checks. It's become quite a sore spot with me because they are constantly bitching why everything isn't ready at 7:05 a.m. and I tell them I'm setting stuff up and the previous day did not leave me enough time to get the stuff ready. Primarily because they are greedy and want to keep running product until about 5 minutes until shutdown. If we stopped at 3 p.m. everyday, things would be able to be fired back up at 7:03 a.m. but they don't so I don't and I really don't give a fuk. That has to be considered wage-theft right? I tell everybody I work with to not let them take advantage of you, because they definitely f****** will",
            "I thought you were going to clock in for every call you answered off hours",
            ">   I didn't reply. \n\nExcellent",
            "Yeah it does depend. I worked two similar jobs one salaried and the other hourly. I made TONS of money being hourly but had no benefits. The other I had full benefits with sick and vacation leave but lower regular take home.  I think it probably came out about equal.",
            "My favorite part...\" asking me what the log in credentials were for all the 150 stores' alarm systems. I didn't reply. \"",
            "I thought this was going to turn into you keeping up with all of your off-hour duties and racking up overtime until accounting realized they were hemorrhaging money on you and trying to get you to come back on salary.",
            "I'd *Express-ly* assume the *Gap* in the *Hollister* account would *Abercrombie and Finch* itself into a whole other *Limited*....\n\nI can't think of any more names....was I close?",
            "Good on you. 9 people would gladly hand their \"on-call\" responsibilities onto 1 person and never think twice about the burden they put on that 10%. Never again, I expect you learned.",
            "Never heard of an MBA in Political Science before.",
            "In my head Im singing Big Yellow Taxi. You know the line ...you don’t know what you’ve got til it’s gone",
            "I didn’t reply. \n\nMic drop. \n\n\n\n\n\nEpic! Made me laugh.",
            "> My last contact from the company was the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems. I didn't reply. \n\nLike the closing roll on a movie while the musical theme goes a little rock and roll. Nice!",
            "Oh man, my dad did this when he was the district TLE manager for Walmart. One paycheck came out to roughly 12K, and this was back in like 2004.",
            "Good that you left that place. Sounds like shitty management and they deserve to get in trouble.",
            "MBA in political science?\n\nYou should have said \"I'll give you the login for a grand\"",
            "Penny wise and pound foolish",
            "MBA in political science 😂",
            "Please please please send this link to all the employees relevant at this company. That would be gold",
            "While I applaud your malicious compliance, you spent years getting 2-3 phone calls a night to deal with false alarms and other nonsense? Holy shit that must’ve sucked. Why didn’t you address this earlier?",
            "I'm an hourly employee and from 7:am - 3:30pm (Sun - Thur minus my 30 min lunch) I will work.  Outside of those hours I'm not paid so I don't work.  I don't have my email on my phone and I don't check via my computer.  I have rarely gotten texts from my boss on Friday asking if I can work if people are out sick - but haven't gone in because I'm usually busy on my days off.",
            "> My last contact from the company was the supervisor asking me what the log in credentials were for all the 150 stores' alarm systems. I didn't reply.\n\nI think I just came.",
            "An MBA in political science?? If that was in the replacements resume, then he is a liar.\n\nMBA is a graduate level business degree.",
            "I'm a newb adult who's only had maybe 3 or so actual jobs in my life and so far based on what I've seen why would anyone be salary? It just seems like something they do so that they don't have to pay overtime but still get overtime work. Is it just so mathing out the end money's is easier at the end of the month/year?",
            "Please tell me you got out of retail space and entered into something more potentially lucrative in facilities management.",
            "Honestly, this comes off as way more malicious than it does compliant, sorry dude",
            "Why did you not think to warn the company of the possible falout? I’d fire you just for that.",
            "Thank you for the excellent laugh, Redditor! Well played!",
            "Sometimes a little math can go a.long way.",
            "Dont understand why you took so many off-hour calls for so long to keep the company from paying the fines. I mean, who cares, right?",
            "This rules. If they make it clear you can't expect anything more from them than what they're contractually obligated to provide you with, then don't give them anything more than you're contractually obligated to provide them with in return.\n\nIt's not good or bad, it just is what it is. Play by the rules they set.",
            "What a great Friday read! I need this and so many others. Thanks",
            "Upside down is the best fking comment ever.",
            "His salary will have to do more paperwork.",
            "Wonderful story.",
            "Salary without a solid contract is an excuse for management to completely abuse your hours.",
            "Stick it to those fuckers.",
            "A side thought,\n\nI'm surprised a company with only 150 stores across the entire nation is so high strung that they expected windows to be boarded up before sunrise. Or did you sleep until like 2pm that day? lol\n\nConsidering managers weren't answering phones for alarms as you mentioned, I did not expect there to be a company culture of expectations between dusk and dawn.",
            "Best response ever.",
            "\"hired a maintenance supervisor with an MBA in political science\"\n\nFunniest thing.",
            "What's the amount you have to make to be salary? I might be able to be hourly too!",
            "Ya hate to see it..",
            "Wow...sounds like back pay to me...",
            "The best I could do with that",
            "Username: Password\n\nPassword: Username\n\n\nAlternatively you could contract me for a full day and i shall send it as aoon as I find it.\n\nSend.",
            "I feel bad for your replacement. Went to school for a grad degree and can only get a job as maintenance guy for shitty company that will make him be on call.",
            "This warmed my heart ❤️",
            "I’ll never take salary. I’ve never met anyone who said salary was more beneficial than hourly. Ever!",
            "Why on earth would you have brought up the 800 dollars in the first place? Makes no sense.",
            "i love this, good for you.",
            "Bravo!",
            ">I didn't reply\n\nwhat an absolute chad move!!",
            "Your lucky... i have the opposite prob as a manager and I cant get the owners fav employee to actually perform so im just letting them drown",
            "They asked you for a login credentials. Why didn't you reply?",
            "The room went silent.  😂😂😂😂 LMFAO",
            "I am always astonished there are so many \"I did not do work I was not getting paid for\" stories that are considered malicious compliance.",
            "Had a job once that I found out in my last few days, that it was illegal for them to pay me salary... because of all the forced overtime (IT Admin)\n\nEnded up getting a huge settlement check a few months after I left the company. Wish I would have kept immaculate logs of all the overtime, probably would have gotten twice as much.\n\nOnly left because they relocated out of state.. really loved the job, and didn’t mind the overtime... and the extra pay at the end was a nice little bonus."
        ]
    },
    {
        "post_id": "13ss73m",
        "author": "ineedatinylama",
        "title": "The Doctor I worked for paid hundreds of dollars to eat dinner leftovers.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/13ss73m/the_doctor_i_worked_for_paid_hundreds_of_dollars/",
        "score": 19094,
        "num_comments": 627,
        "created_utc": 1685144618.0,
        "selftext": "I worked for an orthopedic surgeon who constantly ate people's lunches and would leave $10  on the fridge. He really loved left-over home cooked meals. \n\n \" I don't get lunches off, I have to work to keep paying your salary. You can go buy another lunch\"   He would say. \n\nI hated him so much, but I got paid a lot. He was fresh out of his internship and residency, and he thought he was above everyone. \n\nWe complained to the office manager. She went to the doctor and said we were all pissed about it.  The doctor told her to \"deal with it\".  If the Doctor  decided to eat one of our lunches, we could have the office manager just order us something.  \n\nThis was amazing! There were 2 people besides me  that had family and kids, so we always brought leftovers. \n\n If he ate my food, I ordered from the most expensive steak place in town. Appetizers,  22 oz steak,  3 sides, a salad, and dessert.  I'd eat the salad, and the rest went home.  And of course, there are plenty of leftovers to take to work the next day! \n\nThe rest of the staff was doing the same. Ordering full chickens,  4-5 different Chinese dishes, spending hundreds of dollars to replace stolen meatloaf sandwiches and day old soups and spaghetti. \n\nThe office manager went along with it. After all, he said we could order what we wanted if he took our lunch. \n\nIt went on for 2 months until dickhead doc caught on.  From then on, he had the office manager order him a lunch. \n\nI did miss trading off a cold pork chop and Spanish rice for  prime rib and all the fixings. \n\n(I posted this as a comment on r/askreddit, but, as I typed it out I decided it belonged here.)",
        "permalink": "/r/MaliciousCompliance/comments/13ss73m/the_doctor_i_worked_for_paid_hundreds_of_dollars/",
        "comments": [
            "Sounds like a fair trade to me.  Dr. steals your lunch, so gets to replace it.",
            "I love this so much.\n\nOn the flip side, I used to work with a GP who specialised in treating patients with addiction issues - many of whom were homeless. We couldn't use the freezer part of staffroom fridge, it was filled with frozen meals. \n\nIf a patient came to see him and hadn't eaten in a while the doc would get us to heat up a meal for them. \n\nGuy was absolute legend. Sad day when he retired.",
            "He's lucky you didn't deliver over salted or over hot sauced food to the fridge for him.  \n\nOr worse.",
            "“Malicious compliance is a dish best served au jus and with all of the a la carte options.” — Ancient Klingon medical proverb\n\nEDIT: Whoa! Thank you for all the appreciation on this one!",
            "We were having a staff meeting one day at the surgery center where I worked and I looked across the table at the anesthesiologist who was loudly eating and realized he was loudly eating MY LUNCH. I had an absolute fit in front of everyone. He made more in a week than I made in a month and still he had the audacity to steal my shitty leftovers. In the furthest reaches of my imagination, I couldn't even imagine doing that to someone else.",
            "What's the difference between a Doctor and God?\n\nGod doesn't think he's a doctor.",
            "Had to reread the first 3 sentences like 10 times cos of how baffled i was. Like thats not how transactions work. That kind of thing is why people buy fridge lockboxes or lockable lunchboxes.",
            "[deleted]",
            "truly prime example of r/deliciouscompliance",
            "Cannot believe the idiot thought the solution was stealing peoples lunches and not just having the manager order him something all along. \n\nAlso, leaving $10 is fucking pointless. Sure, some people take in meals to save cash, but it's also for the convenience of having it there.",
            "This is amazing hahaha literally why I read this sub",
            "This is A level.\n\nI would file this under pro revenge.",
            "I would have offered to bring him lunch (leftovers) every day for $75 a week. Man that would help with the grocery bill.",
            "I like this, but you also flew too close to the sun. If you had taken advantage more subtly could have gotten good free lunch for even longer.",
            "He could have just asked nicely…\n\nIt’s amazing how well that actually works.",
            "You were just adding a reasonable 'convenience charge'.  If someone asked me I'd probably share my lunch, but if they stole it I'd be \\*pissed\\*, because sometimes your body is just really set for that cold pork chop & rice after half a day of hard work.",
            "Who the fuck eats other people’s leftovers\n\n*Huuuurrrrrk*",
            "I would have put some max hot sauce extract on it.   I already put ghost pepper sauce on my sandwich, so it's not a leap.",
            "Should’ve included an apple in your lunch box",
            "I have celiac disease and if someone eats my lunch I can’t replace it. \n\nI would be so fucking mad.",
            "Delicious malicious compliance.",
            "You can never teach anyone that knows everything",
            "I would’ve been farting on the food bro!",
            "who thinks \"I want food, let's eat somebody else's and then order them a replacement\"\n\nin what world does that make any sense? why the middle step?",
            "Back in the 80s my boss was jealous of my homemade leftover lunches. I started bringing him a lunch every day and got $30 a week for them. Not a bad deal.",
            "I love this, he had to work to pay your salary, and your lunches (don't know how true the salary part is, but I don't doubt he said it lol).",
            "Awesome",
            "You are correct OP. This does belong here.",
            "Doctor: \"Shit, man, these peons are eating like KINGS, what the hell, at least I get some of their food...\"",
            "Love when a boss decides he is a feudal lord and entitled to your worldly possessions.",
            "I truly don’t understand the entitlement and mental gymnastics some sociopath has to do to justify **eating someone else’s fucking lunch** ! Have they truly no shame whatsoever?",
            "lol I would have been packing my lunch in the most appetizing clear container to entice him.",
            "crazy part is if he would have offered me $10 to just bring him leftovers for lunch, i would just make an extra serving most nights and bring it in.  Very few of my dinners are over 3-4 bucks per serving (and even 4 bucks is high)",
            "At least he reimbursed you or replaced it. My mom used to work with a Dr that just ate everyone else’s food and they were out their lunch.",
            "I wonder what his issue was? Parents never there or involved enough to cook him a meal? Or just some psychotic belief that everything he sees is his to take",
            "When I worked at one of the top hospitals in my state, there was a surgeon who would steal only my lunch everyday for about a month. I was 32 weeks pregnant and packed my biggest cravings to help survive my shifts from hell. I started bringing my lunch in a tacklebox that took up a majority of the space in our staff fridge lol",
            "[deleted]",
            "\"Doctors hate me for telling you about this one amazing food hack!\"",
            "Man, home cooked left overs really are the best though 🤤",
            "what a sadistic fuck. (the doctor)",
            "Yeah people like that shouldn’t be aloud to exist let alone be doctors",
            "I worked as a medical assistant in a practice with 5 surgeon's. General surgery. You should see how much food they eat for breakfast! Because rarely did they have time for lunch if it was their OR day. And I can only imagine what they ate after a day in the OR. Not a single one had an extra pound on their bodies. They work incredibly hard. I was happy to share whatever I had if they asked, which they did.",
            "OMG. It would have been so easy to ask someone nicely to make a little extra dinner every night and bring him a lunch. He could have paid them $200 per month extra. I would take that deal in a heartbeat.",
            "Also r/deliciouscompliance",
            "I don't get it. How did the doctor pay for that? Did you take his credit card?",
            "What an insane prick",
            "Massive Compliance, Love it.\n\nMany years ago, we had a food thief, who stole lunches, etc.\n\nOne day, a colleague un-wrapped a bar of Ex\\_Lax, and left it in the fridge.\n\nWe found out pretty fast  who the thief was",
            "You may have intended malice, but that was a very loving way to deliver an otherwise disregarded, but important message. Well done.",
            "There is no leftover food, it is just food.",
            "You're a saint compared to me. I would have found out what gave him the worst stomach problems and started *exlcusively* bringing that in, encouraging others to do the same.",
            "I don’t get the entire concept of eating other people’s food unless you are starving.  Who knows what’s in it or how safely prepare it.  It’s just asking for food poisoning.",
            "This is all well and good unless you were on a strict diet. This doctor sounds like a psycho.",
            "Seems like an even trade... Though... I know I can turn into hose beast from hades if I was really looking forward to a specific lunch. You don't fuck with food ... Like EVER...",
            "Was it the 4th Doctor? I could see him doing that",
            "Just ask a nearby Cafe to bring a sandwich everyday for $15... bizarre.",
            "Someone needs to learn he’s not the only one working hard to pay salaries.\n\nLike, if everyone in the office just stopped doing their job, he wouldn’t be able to do his and he wouldn’t get paid either.",
            "Could have just asked everyone to bring an extra serving for him.",
            "Ortho surgeons can be a piece of work.",
            "You had a great deal going there for awhile until the doctor figured it out.",
            "You know how hard it would be for me to not lace that shit with some laxatives?",
            "I worked for a neurologist and the staff ordered pizza one day. He came up and took a piece, looked at us and he said \"well I pay you, so technically I bought this pizza\" I was dumbfounded.",
            "Time for the anonymously left \"Ex-Lax Brownies\" desserts to be left in the fridge!",
            "Write “Best before” and some date about three months in the past on a piece of tape on top of the container.\n\nHe’ll probably eat someone else’s lunch.",
            "I used to work for a major computer maker and we had numerous break rooms on each floor, each with a fridge and microwave. Anyway people would bring in their lunch and leave them in the fridge for when it came lunchtime. Got to the point that there were some people who didn't bring lunch and apparently either couldn't afford to or just didn't feel like going to the cafeteria or even leaving to go get something at a nearby fast food joint, who decided to eat whatever they could find that they liked in the fridge, much to the displeasure of those whose lunch this person ate. One of the girls in my team got struck by one of these 'freeloaders' and decided they would get back at them. Next day they brought in a special meal to leave in the fridge. Sure enough someone ended up taking it, ate half of it and then put it back in the fridge. What they didn't know is that the meal was spiked with laxative. The beauty of this was that the girl on my team NEVER had to deal with anyone taking her lunch again. \n\nUnfortunately we never knew who did it as we worked around a bunch of tech support nerds who were always eating crap food and regularly turned the bathroom into their personal throne if you get my drift, so it was very hard to tell who was making a run normally or who was doing so because they just had a dose of laxative",
            "Yeah, I get it, doctors can be jerks and have a God complex but y'all could've made some extra money... I bet he would've paid someone 10 or 20 bucks a day cash to bring him in a home cooked meal. Win win. Dude probably really missed home cooked meals after ramen and take out for the 8 years of school he just completed.",
            "You were a lot nicer than I would have been.\n\nI'd have gotten that steak.  He'd have gotten shrimp that had been left out on my porch for two days.",
            "At least he was willing to replace it--until he saw how much it was costing.\n\nPerfect response, though.",
            "This comment section filled with a lot of toxic hatred for doctors, damn",
            "This is bro’s 4th story here, she must live a wild life 💀",
            "Put some ghost peppers in the meatloaf sandwich",
            "Dam!! If you guys didn’t spitefully over order you could still be having great lunches for free. But two wrongs make a right so it worked out.",
            "You must not be in America.  Here, drug reps buy lunch for the whole office most, if not all, days of the week.",
            "I'd sabotage my own lunch with lots of spicy ingredients and laxatives and maybe something mildly hallucinogenic. Fuck that guy.",
            "He knew but just missed having a home cooked meal for lunch like his momma used to make",
            "I would have just dumped an entire bottle of buffalo sauce in my food",
            "Yeah, I’m too petty. I’d take up bringing chocolate desserts with a special chocolate in them",
            "Go to your local dollar store, get a mix of cheap foods.",
            "Genius MC!!! Love it!",
            "This also belongs in /r/deliciouscompliance",
            "\"He's a doctor, he should know what to do if he's been poisoned.\" Is what my defense statement would be.",
            "Were all these meals being paid for by salary deduction from the Dr?  They should have.",
            "Make food.\n\nEat most of it.\n\nPut the rest in containers, in the refrigerator.\n\nEat the rest the next evening.\n\nThe next day, bring in the dirty containers.\n\nTell the office manager to order lunch, because the doctor ate mine.",
            "Wait, who's paying for all this?",
            "We are denying your claim because your HCFA 1500 form was missing the fork or spoon box.",
            "This is where you cultivate a taste for very spicy dishes, if you don't already like spicy food.\n\nA few diced habaneros in with the spaghetti might induce a change in his behavior.",
            "I'm a married bloke, but do most of the cooking at home - the way I am, I'd have definitely asked him if he wanted me to make extra for him the next day, for the $10. If he was happy, I'd be well up for that.",
            "Where are the device and drug reps? Bring that man a meatloaf ffs 🤦‍♂️",
            "\"I always cook with Exlax, that way I stay regular\"",
            "How did everyone miss this opportunity to leave this guy some rotten/undercooked chicken, or some Exlax brownies?",
            "What kind of demented power-tripping sociopath...",
            "Two months?! Wow. Shame it wasn't more than that, but it's still pretty darn impressive.",
            "I worked in a hospital in the 90s and one of the doctors was caught in the staff room eating lunches.  There was a LOT of yelling from the staff member regarding taking food when we had a 30 min lunch and how we didn't have time to get food from the cafeteria - let alone pay for it.  Food never disappeared from there again.",
            "Someone that arrogant needs to be introduced to reaper peppers.",
            "Even if he is cocky what he said is true, he is overworking so you all have a job but when he said you could order a lunch you abuse it by spending hundreds and hudreds of dollars? You are a bit to much",
            "He... really never thought of asking somebody to order lunch for him before then?",
            "I would’ve been licking the food and sneezing on it before I put it in the fridge…",
            "whether there is compensation after the fact or not, he still stole other people's possessions and that is a criminal offense. he could have just as easily paid a different office member a hundred bucks/wk to bring him in a leftover lunch and been totally above board.",
            "Ever thought of offering to make extra specifically for him (at a cost) ?",
            "Me, being the person I am, would have brought him homecooked food for himself. He'd have paid me for it and would have left ither people's food alone. There's always solutions that don't include a big ole \"fuck you\" just to be spiteful.",
            "Sounds like a conservative doctor that expected “socialism” for himself but “bootstraps” for everyone else. I’m familiar with that personality type- turns out they were  a psychopath",
            "[deleted]",
            "Sounds like you had a good thing going. Until everyone abused it and ruined it",
            "☠️☠️ sounds toxic and codependent, but work. Lol",
            "Hm. Call me a Karen, but he said\"by a new lunch\" not \"dinner for all\"... And gave 10$ for it which is (but maybe that's only here in my country possible) more than enough to buy yourself a proper lunch.\n\nI get it, you want to get back on that prick, because it's a downright bitchmove for him to just take whatever Mr Doctor pleases. But calling this malicious compliant, I wouldn't say so, rather a perfect revenge.",
            "yall abused the new system you couldve been riding for a while lol. you played yourselves through greed",
            "Really you could have just sold him your leftovers for $20 and he would have been cool with it. Dude would bring you a crisp $20 for something your family didn't finish ifmr a sandwich you made while making yours.",
            "Short sightedness! Just take advantage of the free meal without all the extra and you probably could’ve gone on getting nice, fresh meals your entire tenure there……why ruin it?",
            "Well done, but...\n\nMaybe if you all didn't overdo it, it would have lasted a whole lot longer.",
            "[deleted]",
            "Most doctors are millionaires within a few years of graduating. Yea yea they might have student loans,  it if you’re making $600,000/year how long does it take to pay off a $200,000 loan? \n\nEarlier this year the other doctors were giving one doctor shit because he couldn’t pay cash for his new Tesla. But he said in his defense, it was $120,000 Tesla, he could’ve paid cash for the $80,000 Tesla…",
            "Belongs in r/antiwork",
            "I'm sorry, but everybody gets a lunch break. He's full of shit.",
            "Sounds like a few people should lose their jobs over that type of loophole, but I don’t mean the people ordering the dinners.  Office manager, really?  Where is the person controlling the finances and expenses of the hospital?"
        ]
    },
    {
        "post_id": "uen7gr",
        "author": "Mittendeathfinger",
        "title": "Dont want to heed my warning about giving Deep Discounts to Wealthy Clients?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/uen7gr/dont_want_to_heed_my_warning_about_giving_deep/",
        "score": 19081,
        "num_comments": 472,
        "created_utc": 1651242683.0,
        "selftext": "I work for a company that does commissions for clients.  I am the manager of my department.  This comes with a number of responsibilities, one of them is bidding on work.\n\nLast fall I evaluated the current global situation and how it it would be effecting the costs of our supplies and possible shortages as well as inflation.  As a result, I priced a few of our pieces of work to help prepare us for the price increases I had predicted, giving us a 8-10% profit upon completion.\n\nA well known client came in and contracted us to do a rather large and time intensive project.  This individual is very well off and is in no way in any danger to be going broke any time soon.  However, this client complained about the new prices.  He had contracted us in the past on certain items and wanted the same work done again, but seeing the new price, he complained to the boss and threatened to go elsewhere.\n\nThe owner, my boss, decided I had priced the work too high based on the complaints of this one customer.  (Previous customers had not batted an eye) Boss asks me to adjust the price down to be the same as the \"competition.\"\n\nJust so you know, the competition does not carry the same quality standards and often has a 2-3 year turnaround.\n\nI explained this to the boss that my numbers were based on the increases from suppliers and subcontractors, who I speak to regularly.  These companies we work with warned me before hand about what was coming, and I took it all to heart.  I had passed the warning on to the boss at the time but it appeared he blew it off or forgot about it and at the time of making the new price list, he didnt complain.  It wasnt until this one, somewhat well known local client rose a stink that he decided to bring the issue up with me.\n\nSo Boss insisted that we should be pricing lower to keep up with the competition or we would lose this customer.  Of course I argued that it would hurt us in the long run and all we would be doing is attracting tire-kickers.  He stood his ground though, and I didnt have the energy to fight him on it, so in the end, he's the boss and got what he wanted.\n\nSo the time came to order the supplies and pay the subcontractors.  The costs of these materials as well as the work done on them were 90% of the price Boss had agreed to the customer.  This is before my own labour costs were factored in.  Boss sees the bill and gets really upset and asks me what the customer was paying to have the work done.  I gently reminded him this was for Rich Tire Kicker Customer, and I had warned him well before hand, but because he wanted to retain Rich Tire-Kicker Customer, he got what he wanted, but the company did the work at cost, and perhaps more with my labor factored in.\n\nBoss later came to me and asked me to make up a new price list.  I told him I didnt need to, I did that last fall and as long as no one gives deep discounts, we will be in the green.\n\nHes listening to me now.\n\nEdit: Spelling!",
        "permalink": "/r/MaliciousCompliance/comments/uen7gr/dont_want_to_heed_my_warning_about_giving_deep/",
        "comments": [
            "I’m the Chief Inspector of a helicopter maintenance facility.     \nWe have a few high net worth individuals (billionaires. Not multi-millionaires, multi-**billionaires.**) whose helicopters we perform annual inspections on. One of them has over-the-top documentation requirements (well above and beyond the FAA minimum requirements, which already aren’t anything to scoff at) due to their management company’s policies. For the last two years, I’ve been telling our sales & contracts folks to bid higher on that particular customer, to help recover the cost of the man-hours associated with all their additional documentation. Sales & contracts: *”Oh no, we can’t do that. We could lose the customer that way!”*       \n[facepalm]       \nFor the last two annual inspections, our profit margin on this customer was **negative** once, and *almost* made 1% once, because we refuse to charge the billionaire’s flight department a little extra over an irrational fear of losing them as a customer.",
            "My boss has a LOT of extremely wealthy friends/acquaintances. He’s always in hustle-mode so we get quite a few projects from his contacts. \n\nWhenever I do an estimate for one of these, I give him the quote break-down using our routine numbers (mainly determined by square-footage of the job).\n\nHe routinely kicks it back with a note to “double it because I told them 3x that amount initially so now they’ll think I’m giving them a deal.” \n\nNever had any push-back from those clients.",
            "I'm honestly just amazed that he learned. I guess that means the company may actually be around for a while and potentially profitable.",
            "\"May I please have that in writing, boss?\" will save your bacon every time.",
            "[deleted]",
            "Worked at an app startup a while back. \n\nWe had a (shockingly) very well thought out product design, and adoption and retention was very good. \n\nAbout a month or two after release, an “influencer” gave a meh review and stated that it didn’t do X. \n\n(For the sake of obscurity, let’s just say we had an awesome personal media player, and this one guy said ‘But it doesn’t stream the video to my 40k followers’)\n\nThe CEO goes “how soon can we add this feature?”\n\nBackend developer and I basically go\n\n“Add this “one” feature. That has nothing to do with our current app or overall company goals. That has no common code to our current base. That requires a heavy cloud requirement. (Dude had problems keeping the ISP bill paid). That only 1 out of 200,000 customers asked for”\n\n“Yes” (not detecting any sarcasm)\n\n“2 years”\n\n“Oh”",
            "This drove me crazy with my old boss. Small <15 people business? Full price. \n\nMultimillion Fortune 500 companie that could buy the that company outright? I want that followup contract, doesnt matter if we loose money on this one.\n\nGuess what, that followup never came.",
            "Your boss also needs to make a call to that customer to give them a head's up ahead of time, that all contracts will be more expensive from now on due. He also needs to emphasize that your company actually lost money on him but that he's been such a good customer that he's glad if it was anyone, it was him (asskissing.) \n\nYour boss needs to head off any entitled b.s. early, so that the client doesn't think that if he fusses enough at the cost, he can make it come down significantly (hey, it worked once already!)",
            "I don't know what your supplies are, but you might want to start working on revising your prices again.  I'm constantly seeing price increases anywhere from the 8-13% range almost on a month-to-month basis.  I tend to re-order material every three months, generally, and each time I do I get hit with a price increase on almost everything.",
            "Used to work in a big pharma company (evil, I know). Key customers were seen as important to business, so they got special treatment. Big money flowing in. \n\nAccount Receivables (Finance dept. invoicing customers) were always worried about late payments, for obvious reasons. The more money not collected, the more money lost on interest. Among my duties was to make monthly reports on accepted orders, so AR could predict future invoices. \n\nWhen year-end financial reporting was approaching, AR stepped up their collecting duties to get better results under the line. More notes were sent and Customer Service was making reminder calls to customers late with their payments. \n\nWe noticed one key customer, or actually just one European division of theirs being horribly late with their payments. Like months past the due date. 7-figure sums. More than all the other customers combined. Other divisions of this same customer had no troubles paying, only this one. It was not due to lack of money, just plain old-fashioned negligence. Very obvious target, the late fees alone were running in hundreds of thousands. \n\nBut no. Key Customer manager jumped in to stop the collection. Not even a request for information was allowed. Because they're Key Customer and they might leave. Where exactly, I really don't know. They were a long time customer using our products for their processes, and those can't be just simply moved to another provider like you would change your favourite sausage stand. And a single division can't step out of a global supply process, because mothership tells them what to do. \n\nSo we took the monetary hit, only hoping that customer would pay. Even the late fees were nullified. They kept making monthly orders and they'd pay eventually. But they clearly abused the lack of targeted collection process. \n\nAnd at the same time our small and medium size customers would be ruthlessly harassed for their unpaid bills - and definitely no mercy on late fees. Which all were basically nickels compared to this single Key Customer division. \n\nThis kind of spineless and completely useless a$$kissing just blew my mind. Not even a reminder or request for information? Just hoping they'll pay some day? Bollocks, I say.\n\nTL:DR; Single subdivision of a big customer gets away with super late bills, because someone is afraid they *might* leave - while in reality they can't. \n\nEdit: Corrections and TLDR",
            "I think this Order of the Stick explains the thinking nicely:  https://www.giantitp.com/comics/oots0135.html",
            "A company I worked promoted this book “Raving Fans” . Basically the customer is always right and by going the extra mile will pay off in the long run.\n\nSeveral of the examples violated company policy as well as empowered the lower employees to give away free services.\n\nI dared to ask \n\n“How are we supposed to do this without renegotiating are contracts to make it profitable?”\n\nThere were a lot of corrections made due to implementing the plan.",
            "I have a specialized position at my job and a decade of experience. We always get new managers in who have an idea, and I can always tell them how well it will or won't work.\n\n\nDo they, the person with little experience, ever listen to me, the person with years of experience? No, they take it under advisement but want to try it anyway, just to be sure.\n\n\nI'm paid hourly, so I do not give a fuck how much of ~~my time~~ the company's money is wasted.",
            "I used to do IT support for a yacht dealership. Imagine what it's like dealing with people who sell yachts. That's it, that's the post.",
            "I've started to realize that it's the wealthy more often than not asking for handouts. But no one says anything because they apparently worked hard for their place in the world. Yet when poor people ask for  help so they can live inside and have food in their bellies they're lazy, good for nothings who should stop playing victim, take accountability, and \"pull themselves up by their britches\". Like, okay. I'm pretty sure rich people can pay full price for crap but nobody says anything to them when they DEMAND free LUXURY items and services.",
            "The ultra rich know the prices on everything is going up \n\nThey are the ones causing it",
            "Native English speaker but unfamiliar with “tire-kickers.”  What kind of person is this?",
            "Here’s the argument I had to make for the 25% price increase in our rates this year:  “Every single one of our clients got big raises this year, why shouldn’t we get one too??”",
            "I worked for about 30 days in a call center in NJ back in the 90s.  The owner had two (2) waterproofing companies.  Why two you ask?  He was evil.\n\nThe call center was in a basement, the owner ripped pages out of the white pages phone book and we called every number top to bottom, offering basement waterproofing.  We were company #1.  If we got someone to bite on the \"free estimate\" (most people just screamed \"I don't have a goddamned basement!\" and slammed the phone down), an employee showed up, looked at any issues, and gave them an astronomical price.\n\nSome people paid it.  Some looked at them and said \"you're crazy.  Get out.\"\n\nThat is where company #2 came in.  \n\nTHEY already had the inside info.  They had the name, address, problems noted from the first inspection, and a fair idea of what this guy thought was too much.  THEY still quoted a price a little higher than the customer wanted to pay, but it was in line with what he could pay, and much less than the first quote.\n\nThey usually got the deal.",
            "I’m a new business development manager for an engineering and manufacturing company and we have done a lot of price increasing. Here is the thing, as a business leader you need to be a business leader. If all you do is price sell you will surely fail. You pointed out what differentiates you from your competitors and boss needs to step up and value sell based on a value prop/value add proposal. \n\nIt is literally business 101 and cracks me up how many people have authority like OP’s boss without the spine to raise price off of increased raw material inputs especially factoring in the current rate of inflation and consumer price index.",
            "I hope you're not commission, being told to make less so a rich person can keep more sucks.",
            "This is one of the most maddening things. Every business has customers that produce negative margins, but most are unwilling to either raise that customer’s price or fire them (either is fine with me).\n\nThe root problem is sales reps (and their managers) are usually paid based on revenue rather than margin. Fix that and the problem solves itself.",
            "I would consider it a bonus if a customer that complains about the price doesn’t want your services.\n\nYou don’t lose money doing work for them, and you don’t have to listen to their complaints.  Win win!",
            "Per our conversation, I will do ......\n\n&#x200B;\n\nthe CYA email, everyone needs.",
            "Rich fuckers getting shit cheaper than everyone else because people are scared they won't get their drip fed pennies is abhorrent.",
            "Good compliance. \n\nMiddle of sixth paragraph has “bass” instead of “boss”.",
            "Anyone can sell anything if the discounts are high enough.",
            "This is such a classic construction scenario lol. \n\n\nThe amount of contractors that go under over this exact situation every year is a crazy amount.  They get so obsessed about winning loyalty to score bigger contracts and bypass bidding wars then don't realize how bad they've fucked themselves until its too late.",
            "I'm envious that your boss started listening to you after just one time. I'm stuck in a repeating pattern where I warn my company about a coming problem and provide a way to avoid it, get ignored/told I'm wrong, then the problem happens and they get me to fix it. I count myself lucky if I don't have to try to politely listen to a lecture about \"needing to find these things in advance instead of waiting for them to happen\".",
            "Had a very similar situation in which I bid a job significantly larger than what was common for our office. Majority of the cost came from my field and office time, opposed to the usual case in which majority of cost came from other office workers. I spent a week and a half writing the bid, and had it (metaphorically) torn to shreds because “We don’t want to lose this client”. I explained that we offer a service that very few can compete with, there is only a 10-15% profit margin built into this quote, and it’s already going to be a nightmare for this to be completed on time. \n\nWell, we re-evaluated the scope and reduced the cost. Again. \n\nThe client decided the cost was too low for what he was anticipating, and decided to abandon the project. A few months later, I left the company. Life has been less frustrating ever since.",
            "I owned a flower shop for 30 years. I always priced for worst case scenario for weddings. They wanted prices a year in advance.  I had to take hurricane season, droughts, civil wars, etc into account. Plus increases in air shipping from oil increases.  I always doubled the price. And then presented both to my customer. I never came in over budget... Not even after 9/11.",
            "So...  Let me see if I have this correct.\n\nSomeone who wasn't aware of the nuances of the situation decided to force themself into a place that they didn't need to be in and wound up costing higher ups a lot of money (probably more than I'll be able to earn this entire year).\n\nSo, that someone is fired, right?  If people like you and me get nickel and dimed on threat of being fired, then obviously someone who loses more than we could hope to make in a year is fired instantly.  Right?",
            "Well, sir, I'll be honest with you, I need a large African Elephant and I need it today. But I'm afraid this just isn't what I'm looking for.",
            "The one that makes me laugh are the clients who DO go elsewhere without looking any further than the price or doing their due diligence about the competition. Like taking the slick sales guy's word that they do indeed have [expensive and difficult to get/keep accreditation] without actually checking the official register and then having to call you back and pay all over again to fix the other company's fuck ups/redo everything because it's classed as not up to official standards and they can't use it until it is.",
            "So biggest discount to someone who does not need the discount.  Sounds like you were spot on with your pricing.",
            "You need to negotiate a pay rise.",
            "What is a tire kicker ?",
            "Oooh, so satisfying",
            "Does not compute!\n\nAt best break even? No!",
            "How is your pricing from the fall holding up???? We’re on a 24 hour quote only policy at my company. If you don’t get your order in by 2pm your pricing isn’t even guaranteed. Weekly 5-10% increases on everything.",
            "How does your company survive on 8-10%",
            "Deep Wealthy client discounts should t even be a thing. What’s the point of having a wealthy client just to charge them normal prices",
            "This is a classic example of when you write a CYA memo. Where at the time when you see something that's going screw over the company and you don't have the power to change it. You write the memo how its a problem get it dated. Then when it blows up and people try to blame you for the problem you can pull out the memo and point out you were ahead of the problem but those in powered over ruled you. \n\nOften what it does is cause the issue like here to change quietly and go away without your job being in peril. \n\nIn a modern context that memo would be an email. You want to keep a backup folder of your CYA emails and make sure they avoid the document retention policy if your company has a aggressive one. If they won't allow you to keep it that's when you print it out and keep it in the desk.",
            "I work in plumbing and I told our estimator that they need to bump pricing... Material cost we're going crazy and projects he was bidding were months in the making. He responded with, \"then we won't get the job!\" I was like, fine. We are not paying these gc's to work for them. Company was happy with a 5% margin but now they are paying these projects to work on them.",
            "So you're saying they should....do it for the exposure?",
            "Man that headline speaks mountains…they will take the inch and spread it for miles.",
            "Great story. Thanks for the write up!",
            "It's almost like we hire people with know how in specific fields/areas for a reason.",
            "Your boos sounds like our sales department.\n\nPurchasing costs have been going up for years now but thr competition selling cheaper than ever before...",
            "Dude that's not even malicious - that's just compliance! \n\nKudos for knowing your shit though.",
            "There are reasons why people become wealthy. One of those is they never pay retail.",
            "Factor in a raise for yourself.",
            "Solid. This is what adults do when challengesd by other adults. They rely on their hard work and due diligence to confirm their position, but also realize it is the Boss's money to lose. \n\nCheers to the most decent post I've ever read on reddit!",
            "He's listening to you for now. But I was in a similar situation at my old company and if your company is small and doesn't know what they are doing like this I suggest you start looking for other employment.",
            "Great story, loved that your boss finally came around to your way of thinking. I'm an estimator for a mid-sized electrical company. My taught me from day one to make sure you are bidding correctly, he'd rather lose a job than lose money.",
            "God forbid the boss listens to the people he pays to do the work...",
            "S",
            "OMG do I know you. Are you in south MS?",
            "\"we will be in the green\"\n\nBlack. Black is the color you're looking for.",
            "Liar. Reddit told me inflation is just you being greedy.",
            "VANE: Verb: Affect. Noun: Effect. Or, use the word \"impact\" instead. \n\nThen asshats like me won't mentally tut at you when you use the wrong word.",
            "I saw the headline and thought, \"Bet it's a Republican.\"\n\nYeah. I wish I wasn't right, but the odds were in my favor.",
            "This just compliance that worked out for your boss",
            "I get pissed when I get different pricing on things based on my house.  I used to be broke like everyone else so I know how much shit costs. Don’t come here trying to rob me just because you think I have it.  \n\nYour business model should be set up to make a profit based on the work you do not what the client is worth. Nothing pissed me off more.\n\nI cut every single business out of my loop for good if they do that crap.",
            "***OP*** Since this is a well-known customer then the trade-off of losing money is to use their name as one of your clients in your advertising.",
            "Cool story but not really malicious compliance, you just did exactly what he asked with no bad intentions lol",
            "[deleted]",
            "Why did you price it 10% over material cost?  The competition wouldn't price their work like that.  Sounds more like passive aggressive behavior.",
            "You repeat yourself a lot. Did this have to reach a word count?",
            "> As a result, I priced a few of our pieces of work to help prepare us for the price increases I had predicted, giving us a 8-10% profit upon completion.\n\n\nThis is the guy creating inflation.",
            "I would've been tempted to make that new pricelist he requested, and boosted another 8-10% on top of the already existing bump.",
            "Your company didn’t get paid to do a job, you paid to get the job. Some people are short sighted on billing clients for services rendered. Sometimes you can do a low bid, but it must be because you’ll get future work from same client that’ll absorb any lost costs from the low big job.",
            "The ending. \n\nHe listened. \n\nAmazing.",
            "My boss will over bid a job by a lot when he feels we would get the short end with more tedious tasks than there needs to be.",
            "I'd easily find another job after all that. Fuck a boss who can't remember shit. When your head is up your ass that much, you get very little air. So you need to trust that the people you put in specific spots are gonna do their job right.",
            "This man is YOUR boss?\n\nHard oof."
        ]
    },
    {
        "post_id": "e5oe9z",
        "author": "MermaidGLITTERgurl",
        "title": "Stripped in the principal's office.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e5oe9z/stripped_in_the_principals_office/",
        "score": 19068,
        "num_comments": 572,
        "created_utc": 1575410061.0,
        "selftext": "This did happen about 15 years ago, but I cant help snickering about it from time to time.\n\n\nIn high school, I was a pretty mild mannered kid.  I came from a very strict household, and a call from the school was absolutely unacceptable.  I also wanted approval from authority figures (as I rarely got it at home), so I kept quiet, did good work and was generally well liked by my teachers.\n\nLike I said, it was a strict household and my outfits were closely inspected for \"modesty\" by my very conservative parents.  If it passed at home, it wasn't going to get me in trouble.  I tried hard to fit in with the other kids though, and found that wearing a layer underneath made regular outfits pass the home dress code.  So I still got to wear the distressed jeans, but you could see black leggings instead of my knees. Not a huge deal, and it helped me feel better about my appearance, at least socially anyway.\n\nAs trends were set, leggings became super popular!  Finally, I was ahead and on point with my style!  Some girls did begin to abuse the system though.  School dress code required skirts to be no shorter than 3 inches (1 index card) above the knee.  Standard was suddenly lots of tiny denim mini skirts with leggings.  So the school cracked down and said leggings were no longer allowed under skirts.  Of course, since I had different home rules, I didn't even own a skirt that short.  My skirts had to reach the knees, which was 3 inches longer than the school requirement.  I didnt even mention the new school rule at home because I didn't think it was an issue.\n\nSo I get super cute, wearing my knee-length denim skirt and leggings (as it was still trendy, and a bit chilly out), pass home inspection and head off to school.  Nothing was said in my first three classes, but like I said, I was a good kid and always well covered.  One of the super mean teachers (not even mine, just one standing outside her door) spotted my skirt and leggings in the hall, and grabbed me and marched me down to the office.  I knew of the rule change, but I truly thought it wouldn't be a big deal since I wasn't wearing a mini skirt.  She shoved me in and yelled something about a dress code violation and left to return to her class.  \n\nI was called in, thinking the principal (who I didn't know well) would laugh with me about her unreasonableness.  Boy was I wrong.  He screamed up and down how I was dressed inappropriately, and he would be calling my parents to come get me to take me home to change.\n\nOh no.\n\nOooohhh nonononoNO!!!!!\n\nAs I stood and turned around showing him my clothes, I tried to argue that my skirt met code and the leggings covered more. I even tried to explain that my parents would take it out on me in an aggressive manner.  He wasn't going to hear any of it.  I had to think fast.  Cue malicious compliance.\n\nWhile he was still looking for the number to call, I kicked off my shoes and began wriggling the leggings down and off, right there in his office in front of him.  Since my skirt was long enough, I shoved my pants in my bag and stated that now he has no reason to call my parents.  I was fully compliant with the dress code of the school.\n\nAs he stared with his mouth agape, I could see him turning red while trying to figure out how to deal with me. He ended up just yelling, \"Get out of my office! Get to class!\"\n\nNever have I felt so relieved.  \n\nTLDR:  Leggings weren't allowed under skirts but I thought mine would be fine since it met regulations.  When I got in trouble, I removed my leggings from under my skirt right in front of them.",
        "permalink": "/r/MaliciousCompliance/comments/e5oe9z/stripped_in_the_principals_office/",
        "comments": [
            "WELL... That's one way to change the subject. Well done.",
            "\"Principle Tightass? Why did Mermaid come out of your office without her leggings?\"\n\n\"Well see she started stripping in front of me and-\"\n\n\"I understand sir. Hello, FBI?\"",
            "Wow. These school uniforms are ridiculous. It seems like enforcing it just takes time away from instruction. Like how that teacher walked away from her class to take you to the office. 🙄",
            "I don't understand a policy where wearing more clothes (leggings under a skirt)  is worse than wearing less (no leggings with a skirt).",
            "That was perfect. I'm sure that princapal was having fits about what people would think seeing you walk with leggings, and walk out *without* them.",
            "What crappy teachers. You learnt to deal with Karens early on 👍",
            "In addition to being a jerk to you, that teacher totally violated the teacher bro code. If the morning teachers don't dress code the kid, you don't send her down in the afternoon. (Makes the principal mad at the morning teachers for not catching it).",
            "I had the same experience! Off the shoulder shirts were not allowed and also shirts with straps less than one inch thick were not allowed. I did wear an off the shoulder shirt, but had on the one in strap shirt underneath. I made it through my day until lunch, when the teacher threatened to send me home for dress code violation. I simply took off the shirt that COVERED MORE and went the rest of my day wearing only a tank top as opposed to a real T-shirt.\n\nMoral of the lesson: schools be cray.",
            "I've never understood how people can get in trouble for violating the letter of a rule when they're still complying with the spirit of it",
            "Reminds me of this other story I read on this sub, only reversed. Leggings were allowed, but short-shorts weren't. Girl showed up to work with short-shorts over leggings, manager told her that short-shorts weren't allowed, so she made a show of taking off her short-shorts. Since leggings were allowed, she was in compliance with the dress code, despite being less clothed than before.",
            "Nice job dealing with idiot adults. What was the reaction when you got home with no leggings on?",
            "What a stupid rule, and what a ridiculously stupid principal. Fuck that teacher too.",
            "That mentality is really freakin' scary... \n\n\"Always follow **The Rules** to the letter, do not question **The Rules**, obey **The Rules** even if **The Rules** don't makes sense! You're not supposed to understand **The Rules!**\"\n\nAnd this is at school. A place where you're supposed to *learn how to think.*\n\nGood job on managing to escape unscathed from that world where it sounds like most adults were tyrannical robots... If you have children I hope you can pass that on.",
            "I've only been out of highschool for 10 years and it already sounds 10x worse than when I was there.",
            "I’m very long legged and always got in trouble for my skirts. Our cafeteria doubled as an auditorium and the administrators would sit on the stage during lunch to monitor the students. They called me up there to tell me my skirt was too short. When I got up there I put my hands to my sides to showed them that it did go to my fingertips, which was the required length. Well, that wasn’t good enough and the vice principal told me she could see my panties when I was walking up the stairs. Apparently, “what color were they?” was the wrong counter argument because my choices were to change into my gym pants or get inschool suspension. My mom was pretty pissed about it. I just stopped wearing skirts all together. Well until the leggings became a trend and then I rocked the fuck out of it.",
            "Authoritarians be authoritarian.",
            "You should have told the principal that you'd make sure that every other girl knew that if they were going to wear leggings under their skirts that he would make them go into his office and take off their pants-- just like he made you do, so they shouldn't do it.",
            "I'm from the UK, we have school uniforms. We were only allowed to wear black shoes. One morning I put my green converse on by accident. First time I'd ever done something like that, I was a top set nerd who never got in trouble. In school isolation for the whole day. Thankfully my parents are reasonable, and my mum was pissed at the school because it was rediculous.",
            "You are fierce! Well done!",
            "Abusive. That's the word you are looking for, not strict.",
            "Kid: \"Wow, how did you get out of trouble with the principal\"\n\nOP: \"Well, i took my clothes off, and he just let me go\"",
            "I’m sorry that you had to deal with such irrationality from both your parents and the school. If your parents were using Christianity to justify this type of stuff then they probably weren’t very good Christians.",
            "Nice compliance and well thought.\n\nIn other news, \"teen scapes detention by taking off her pants in principal's office\"",
            "I'd have thought they would approve of leggings rather than the girls wearing shortish skirts have the boys/girls/teachers being able to view their underwear. At least with leggings their skin or underwear isn't on show.",
            "The title had me worried, but the story was a pleasant surprise. Well done.",
            "Hooray for zero-tolerance policies. Zero-tolerance--because it's easier than thinking!",
            "What would your conservative strict parents have said if they learned of the schools new rule that more clothes under the skirt was not allowed? That leggings to cover your bare skin was not allowed?",
            "You should have told your parents that the principal forced you to remove your leggings. With your parents being as strict as they are, they would have gone on a crusade against the principal, and maybe then he would have used a bit more common sense about the dress code.",
            "This is fantastic hahaha what a quick thinker. And you won!! Way to go 👌🏼",
            "How to make a teacher fear for their career in 1 easy step.",
            "He must have been shitting bricks when he realized that he inadvertently manipulated a female student into undressing (partially) in his office.  You could have had him lose his job or get in some serious hot water if the story came out how you escaped punishment by undressing.",
            "I never understood this attitude. \"Leggings on their own? Ok. Those same leggings with shorts or a skirt on top? Inappropriate!\" Like do they realize the same amount of skin is covered???\n\nIf my daughter came home without wearing the leggings because her principal made her remove them (especially if you factor making you show more of your body then you were comfortable with), I would be livid and be going to the superintendent.",
            "Yet another good example of why slut shaming is bullshit, particularly when school sanctioned",
            "No please. Continue calling my parents, explain to them how you forced me out my clothes.",
            "Reminds me of that story where a rule was introduced in a school stating that bra straps were not allowed to be visible.\n\nVery soon after a rule was introduced saying that female students were not allowed to go braless",
            "Wow, it is *seriously* fucked up that you straight up told them you were afraid of being beaten by your parents and they still didn't give a fuck. That should be an instant call to CPS.",
            "So essentially the principal and the teacher forced a female student to dress LESS modest. I feel the newspaper would have a field-day with this information.",
            "Fucking school dress codes. There was a brief fad of girls wearing pajama pants to school. Not sexy sleepwear, but big, baggy, boxy flannel pants with silly prints on them. The school banned pajama pants because \"They sleep in those! The boys might be distracted by thoughts of the girls in bed!\"",
            "Let the local school board know. I know it was probably a long time ago. But the idea of a minor having to take off her leggings during a one on one interaction with a school principal to save herself from aggression from family, alone in the school principals office is foul. It is situations like these that created opportunity for abuse by religious organisations in Ireland and I'm sure in other organisations elsewhere.",
            "This is my new favorite MC.",
            "These rules are fucking nuts.  The length of a skirt shouldn’t matter if you have pants on under it.",
            "Wanted to mention really quick that whether you did it on purpose or not, you're a really good writer. At the climax of the story where you said you had to think fast and cue malicious compliance, you used short sentences in succession in such a way that the reader would sympathize with your anxiety and dire situation. I really felt my emotions going there and wanted to point that out.",
            "Ah, the ol “take off your clothes in front of someone who should never see you take off your clothes”–trick. Checkmate.\n\nEdit: of > off",
            "What did you tell your parents when you came home without the leggings on??? I’m very curious!",
            "Now that you’re an adult, have you ever told this story to your parents?",
            "LOL, he wanted to avoid a lawsuit since a young lady got undressed in is office. He's not telling anyone anything.",
            "How very \"Utah\" of everyone involved.",
            "School dress codes are so ridiculous.\n\n“Can’t wear shorts.”\n\nBut also the girls volleyball team wears tight shorts that ride up their ass and no one bats an eye.",
            "Off topic, but I don't think I could handle parents that thought that way. Good job",
            "see this is why i like animals more than people\n\nOP sounds like a beast tho +1",
            "Lol just wait til you tell your parents the principal made you take off your clothes in front of him. (Does not sound like they would have actually been okay with that excuse)",
            "The only time I had an issue with dress code was when one of the elderly male teachers grabbed my shoulder to tell my my shorts were too revealing (they went to my knees?) and that other men may feel distracted by them. They sent me to the office for disciplinary action. Well my mom didn't like that. She came bursting in demanding to speak to the teacher. The next 2 hours were of us sitting in the office with the principal, a security guard, and the teacher, while my mom went OFF on the teacher for staring at, touching, and fetishising an underage child... And the principal for allowing such a disgusting man work anywhere near children. She even threatened to get the police involved. Needless to say... He went on administive leave for the rest of the year. Btw this was in 8th grade so I was 12...",
            "Probably the only time he had a girl take off clothing on the same room as him",
            "Oh that principal was having so many \" oh shit\" thoughts going through there had at that moment",
            "This is just compliance though... \n\nWhat I thought was gonna happen was you'd take the skirt off and leave the leggings because the rule is no leggings *under skirts*",
            "In theory the rule was a good one. No using leggings (which aren't really good on their own) to circumvent the skirt rule. They were just ridiculous about it  it should have been that skirt length rules still applied with leggings underneath them. \n\nIf it were me I would have told them to tell my parents to come see my perfectly appropriate outfit, and stay in the office to prove I hadn't changed. But you also know your parents and how they'd react better than I would.",
            "Well played, dress codes are bs anyway.",
            "Sounds suspectly like a certain \"mountain time zone\" religion that has pages of asinine, baseless, and idiotic dress standards.",
            "Geez the adults were total idiots all around.",
            "Did you happen to attend high school in Florida? This sounds similar to the teacher we had, people would avoid her hallway.",
            "Ugh grew up with similar parents. Hope you’re free of that now!",
            "I grew up in a similar situation, but the school dress code was even stricter than my parents. I wore a tshirt with a picture of a sunset on it once and they made me put on a big baggy sweater over it.",
            "Sounds like you'd have a home in /r/insaneparents or /r/raisedbynarcissists",
            "OP’s Mum: “How was school today?”\n\nOP: “Good the principle made me strip in his office today.”",
            "Given your upbringing that was one hell of a brave move for ya. I'm dead impressed. Well done...",
            "This is especially hilarious because I'm a grown ass Hijabi woman who wears leggings with short skirts\n\nWhatever makes you feel cute sis",
            "The atmosphere at your home was terrible. A home isn't a home where you are not supported.",
            "Wow! What a great way for the school to teach you that minute details of your clothing is more important than your education.",
            "I hate incompetent adults. This was a great way to deal with them. Morons.",
            "“I also wanted approval from authority figures (as I rarely got it at home)”\n\nAww man. You’re great! You deserve praise and recognition. I hope you have a wonderful support system now.",
            "This is the stupidest rule. It just shows adults reactionary behavior, and then realizing they are wrong but can’t admit it.",
            "Good thing they pulled you out of your LEARNING ENVIRONMENT to ... do nothing and complain about technicalities no one cares about.",
            "Fucking asinine, the shit girls have to deal with to not be \"too sexy\" so as to \"force\" men into harassment/assault.",
            "I hope you went home like that, and when your strict parents asked why you didn't have the leggings on, you tell them the principal made you take your pants off.",
            "What a good example of dress codes in school and female sexuality and peoples uncomfortableness with it.",
            "Waiiiit, so covering your legs with leggings was worse than having them bare?  \nWhere does that come from?",
            "I had to strip in the principals office was on penis inspection day. Didn't everyone?",
            "Ah yes, the arbitrary rules of hugh school. Does anyone actually miss those days?",
            "Ah, yeah, that's the type of bullshit I remember from school.  The US school system needs an overhaul, sadly.",
            "What a piece of shit. People like that need to be fucking chummed.",
            "If you’re going to be a stickler about the rules, that’s what you get.",
            "Wow, I had a way more understanding principal. Similar issue (except parents were cool). We weren't allowed to have holes in our pants that showed skin. I had these really comfy jeans, but they had holes in the knees. I wore some PJ pants beneath so no skin would be showing and everyone seemed fine with it. Everyone except for the librarian. I offered to remove my outer jeans because there were no holes in the PJ pants but she wasn't having it and sent me to the principal. Principal laughed and told me to take off the outer jeans for the period and then put them back on for the rest of the day.",
            "I fucking hate it when people focus on such totally unimportant things. And then people say we germans are so focused on rules while schools in the us (i assume its the US?) Focus on fucking skirt length.",
            "That is an asshole rule. Wearing less clothes made you more modestly dressed.",
            "Just for a second I bet the principal though \"Oh God is she gonna try something here\".",
            "What an absurd rule to require less clothing instead of just enforcing the existing skirt length rule",
            "/r/raisedbynarcissists",
            "Not mine, similar story[No-pants test](https://universe.byu.edu/2014/11/04/26-years-later-the-story-of-anita-welch1/)",
            "All I gotta say is that you have a whack ass school and whack ass parents",
            "Holy shit. You are my hero.",
            "smh im so sorry that principle was so unreasonable",
            "My first high school's uniform was khaki pants and a purple polo shirt. The rule was relaxed to allow any pants that were khaki colored as long as they weren't tights. The girls started wearing skinny-cut khaki pants and the school decided that this violated the \"no tights rule,\" so one day they decided to check every girl's pants as they were coming in and showing their school IDs (security was tight). The school also decided that in-school suspension for the day was an appropriate punishment for violating the dress code in such a MAJOR way.  How were they determining whose pants were too tight? By having a make cop who worked in the school look us over and personally decide if our pants were too tight or not. Before all of the girls even got to school they had written up like 300 of them, realized they had nowhere to put them for their in-school suspension, then gave up. Just dropped the whole thing that same morning. Trying to enforce a dress code rule that isn't needed is such an annoying power trip for loser administrators.",
            "This type of stupidity kills me. Good on you for keeping calm.",
            "I am both astonished and proud",
            "What kind of place do you live in???",
            "Adults want to treat high school students like children, and they can't understand why it's so hard for them to take on responsibility after graduating.",
            "Perfect! This post ought to be a stickied example of r/MaliciousCompliance.",
            "Reminds me of the time I got sent to the office and forced to change for wearing a thick ,completely opaque, pair of leggings under some shorts, with almost knee high boots, and a sweater. Literally completely covered, because my shorts weren’t finger tip length, smh.",
            "This is so stupid. Like prime example of how following the letter of their idiotic law makes zero sense.  If your argument is that it's a modesty issue congratulations now you've got nothing but panties under your skirt and bare legs. Great wins for modesty everyone.  My school was never super bad about dress code but when I was in high school jeans were literally all anyone wore cause that's what was fashionable at the time.",
            "True. Good point",
            "Well why don't we just cover kids in sheets then wrap it with some duct tape (No Monroe moments people) and call it good. No one will even know your gender then, solves all the problems. /s",
            "It's amazing how many difficult situations can be defused by merely taking your pants off.",
            "My principle phoned my dad one morning because I had skipped school the previous day to stay home and complete a Maths assignment.\n\nHe didn't know about it but after hearing the reasoning, simply said \"Look, I'm never going to let school get in the way of my kid's education.\" & that was the end of it.",
            "Sounds like shitty teacher, principal and parents, the triple threat.",
            "One lesson I truly learned from school is the dumbest people possible got jobs teaching children.  And they wonder why our society sucks. Stop letting idiots teach.",
            "He must have been shitting bricks when he realized that he inadvertently manipulated a female student into undressing (partially) in his office.  You could have had him lose his job or get in some serious hot water if the story came out how you escaped punishment by undressing.",
            "what a complete and utter jackass",
            "Your subject line made me think I was about to wade into someone's attempt at erotica! :D \n\nVery nicely done.",
            "I'd pay to watch a cage match between your parents, the teacher, the principal, and a bear.",
            "Ugh, I had a similar experience in high school. \n\nI'm hoping things will have changed by the time my girls are in school.",
            "Dang nice quick thinking better than I can think fast I give you a 10/10 for that 👍🏼",
            "Baller move.",
            "School dress codes are weird.",
            "Bruh if I got beat at home for a call from school you bet your shiny ass I'd remove any piece of clothing to fit dress code. Good move.",
            "Oh man, nothing like a good striptease to shut a man up!",
            "You're my new hero. That is all.",
            "Report the jesus lover to the police, because he likes some young",
            "Ont time at my school i got in trouble cause my white shirt was colored slightly yellow from our well water and my other uniforms were too old to fit and my mom didnt wanna buy a new one because the school year was almost over so i was forced to wear that one for the last month of school and ended up getting detention once during the last month, i dont mind my old school's uniforms and stuff cause they look nice and feel great but this is the only time i wish we didnt have them",
            "I would’ve thought that legging meeting more coverage under a skirt would be great. I guess not with them.",
            "Why's everyone shitting on the teachers when the parents were the real problem?",
            "This is like a story from a book I would definitely read.",
            "What an awful couple of educators",
            "I was raise with school uniforms and post like this make me realise that it was a blessing. It was way easier not have to worry about what are you gonna wear and our school uniform rules weren't that strick so it was still some room to personalize it.",
            "This is kinda like that scene in Fight Club.",
            "What a fucking powermove.",
            "I had a Stormtrooper sweatshirt that zipped up all the way even over the face. \n\nDuring the early mornings during 3rd period campus assistance (basically helping out with paperwork in the office and going around the school dropping off office call slips) and because it gets cold I zipped up the zipper all the way. Delivering  the slips. I bought it because im a hug starwars nerd. I woud then enter the classrooms the hood all zipped up. And had in the slips to the teacher and ether say\n\n\"Lord Vader wants to see these cadets.\" \n\nOr\n\n\"Emperor Palpatine wishes to see these students in the Darkside.\" \n\nEventually during one of my rounds. I get shoved i to some teachers room and get yelled at for violating dress code. (Even though there was no dress code against the sweatshirt) and that i enticed White supremacists ideals by pretending to be a stromtrooper and that i was racist for handing only students of color office call slips. \n\nI was surprised but in the end didn't even give a damn. The principal talked to me after that and after explaining why i keep the hood zipped up and juat having fun with students im my grade and other teachers sense it was my senior year but also the fact that my only head gear for the cold was broken and it was the only thing i had with a hood. \n\nThe principal was understanding but advised that i dont zip up the zipper all the way.",
            "Sounds like a good reason to have uniforms tbh",
            "OP: strips down in office to avoid punishment\nPorn Directors: **WRITE THAT DOWN! WRITE THAT DOWN!**"
        ]
    }
]