[
    {
        "post_id": "z9y9cv",
        "author": "Jamespg614",
        "title": "Break the law? Sure thing Boss, sign here please!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/z9y9cv/break_the_law_sure_thing_boss_sign_here_please/",
        "score": 18822,
        "num_comments": 573,
        "created_utc": 1669925442.0,
        "selftext": "Long time stalker, first time poster. Only doing this now because it FINALLY came to fruition last week.\n\nI used to work as a spare parts estimator for a fairly niche industry. My job was essentially to work out what parts of our main product the customer wanted, find out how much it would cost us to make, add a little mark up and send them a quote. My boss was pretty strict on traceability so everything needed to be recorded, including why a certain mark up had been applied to a particular product.\n\nNormal value of these quotes is somewhere between £200 and a few hundred thousand. Very rarely do we get orders for anything more than that (once or twice a decade in my experience)\n\nA request for quotation landed on my desk when I was WFH during Covid, and it was a biggy. Just looking at the list of parts the customer wanted, this was going to be an absolute killer, over a million pounds all by itself. I was told by the sales guy that if this one went well, there was another to follow of an even bigger size, ultimately looking at ten million over the next four years. So I set to work.\n\nNormally I can do five or six of these quotes in a day, but this one quote took me six weeks to put together. I was in constant contact with 20+ vendors getting specifications, technical details, prices and lead times for over four hundred items. Finally, my masterpiece was complete.\n\nThen came the snag.\n\nSales guy then says that because of the country this customer is in, they need to have four or more quotes in from different customers in order to get it cleared by their government (some anti-corruption policy that had been instituted). We were the OEM of the product and there’s nowhere else on the planet they could get these parts from, so we’d have to work through third parties to get it done, and he knew just the guy.\n\nIn comes a one man band with a dodgy looking entry at companies house to save the day. Sales guy and him go way back, so he was going to be the “preferential supplier”. I was asked to do the normal quote to him, then to bump the prices up by 30% and send that to three other companies who had been asking about it so they would absolutely not get the contract with the end user. I argued the point, saying that the whole purpose of the anti-corruption policy is to prevent situations exactly like this, but I was overruled. The COO of the company now tells me to just do it over a phone call, at which point I request that in writing before I go ahead and do it.\n\nFast forward two years and there’s still no order been placed. Then I find out through a different sales guy that the One Man Band has been put on a blacklist by this country’s government over this project, the other three companies have been turned down, and the end user is asking other companies to come in and take our product out and replace it with their own. A huge investigation is called for by senior management, my quote is ripped to pieces and examined in microscopic detail, and the question gets asked “why did you give different prices to these other three when you knew it was all to do with anti-corruption, we should fire you! That’s millions of pounds of order you’ve lost us!” Out comes the email from my little black book, on the desk it goes, everyone suddenly gets veeeeeery quiet, and the COO starts packing his desk in a box the next week.\n\nAnd the moral of the story is, if someone tells you to do something borderline illegal, make sure to get it in writing.\n\nEDIT: Wow. This really went crazy, thank you so much guys. My first silver too!\n\nFor those asking about the legality of what I did, because all of the third parties were outside of the country where the anti-corruption policy was in place, I didn’t personally break any laws. Whilst the anti-corruption policies are in place for the end-user, the worst the government can do it put us on a blacklist so all of our bids in the future are either refused outright or looked at in far more detail than others might be. I did investigate this at the time, and if there were going to be any implications on me that my company wouldn’t have been responsible for, it would have been a flat no. I was acting against the intention of the policy, but not expressly breaking it. Do not do something illegal just because your boss told you to. \n\nThe issue as far as the company was concerned was the lost millions in revenue and the damage to their reputation (the end-user is a huge company with contacts and is in a reasonably close knit industry, people talk). They ultimately wanted a scapegoat to parade in front of the board to explain why the multi-million pound deal they’d all been talking about for the last two years had suddenly vanished.\n\nI did also look at OEM angle at the time, but because we aren’t the only company who make this TYPE of product, it didn’t appear to be possible to use this as an exception (the reasoning being that the option existed to replace our system with a competitor’s)\n\nEDIT 2:\n\nAfter posting this, I did a bit of research into the final customer and their VP of Finance did some fairly well publicised jail time a few years back for buying an oil rig for the company at a suspiciously low price, so there was no way we would have been able to convince the government that everything was above board with a direct sale.",
        "permalink": "/r/MaliciousCompliance/comments/z9y9cv/break_the_law_sure_thing_boss_sign_here_please/",
        "comments": [
            "When will managers learn that if they are asked to put it in writing, they need to step back and rethink the whole idea?",
            "I once typed an email outlining the impact of delaying paying a vendor for ~~preventative~~ preventive maintenance on a machine they ran for us. Not doing the maintenance could result in the machine crashing and being down some time for repairs. \n\nI printed it and added a handwritten note, “I will take the action but will not be responsible for the consequences. Please sign below acknowledging that you accept the consequences of delaying this maintenance.”\n\nI placed this on my colleagues desk. \n\nA few minutes after he returned to his desk, he approved the money for the maintenance.\n\n___\n\nEdit: misspelling preventative > preventive.\n\n___\nEdit 2: there seems to be some controversy on the spelling correction, so down the rabbit hole I went. \n\nhttps://www.merriam-webster.com/words-at-play/preventive-or-preventative\n\nhttps://www.dictionary.com/e/preventive-vs-preventative/\n\n[This](https://www.grammarly.com/blog/preventative-preventive/) references the English/ American difference\n\n[This](https://www.differencebetween.com/difference-between-preventive-and-vs-preventative/) site mentions noun vs adjective uses. \n\n“The most respected publications favor preventive” from [here](https://www.dailywritingtips.com/preventative-vs-preventive/).",
            "Anytime someone who's a subject-matter expert says, \"I need you to put that in writing,\" to a superior, it means they know shit's gonna go down eventually and they're making sure they have their own ass covered...",
            "There are fewer phrases more threatening in the english language than \"Can i get that in writing?\"\n\nIts equivalent of a shotgun being racked.",
            "Good on ya! Get that shit in writing. Accounting and the auditors eventually find it.",
            "This makes up for all of the posts where they couldn't wait 1 week for fallout before posting.\n\nGold star.\n\nWith something this far out, I'd be worried that I got the appropriate CTA email about it but it was auto-deleted after X years by the company's deletion policy.",
            "I'm shocked they still didn't just blame you. In my experience, that's usually the way it works. 'Okay, yeah, the direct order from the higher ups led to a massive fuck-up, but you should've tried harder to make them understand/mitigate the problem!'\n\nOnce I worked in a healthcare facility, and our boss made a change to one of the med charts. And it was a pretty massive change. Instead of giving two pills, we were now giving seven. I was the next person to work, and I immediately called her saying that this didn't look right at all. She told me that's what the doctor told her to do. I asked her to double check. She got annoyed, said she double checked, and to just do it. \n\nOf course, it turned out that it wasn't the right dosage at all. Thankfully, nobody was hurt or sick, but it was still a pretty major incident. But our boss was a pretty big deal in our company, so I got pulled into the office and told that while I did the right thing by double checking with boss, I should've followed it up by calling the doctor's office to make sure. Of course they didn't really mean it, it was just to diffuse the blame from being on the boss's shoulders. \n\nThat job was such a shitshow, and the only reason I stayed in it as long as I did was for the clients I had grown close to.",
            "I would just like to point out to everyone that you waited two years to give us this malicious compliance story.\n\nTruly a golden effort!",
            "Unrelated to the point of the story, but usually those \"you need four quotes\" policies have exceptions for situations where something is only available from one vendor, or for repairs/spare parts for existing equipment. \n\nSometimes the low-level government employees don't know that, so you end up with weird situations where they're trying to get several quotes for something that's only available from one vendor.\n\nMight be handy for future situations, so you can say \"is there an exception in your policy for this kind of thing? We're the only supplier for those parts.\"",
            "[deleted]",
            "A manager once asked to to break the law and lie.. told him exactly this.. he still tried to pressure me for a couple of days to do it but was smart enough not to do it in writing.. he was just a shit person in general to be honest",
            "Fucked around and found out",
            "A tale as told as time.\n\nAlso, thank you for not posting till the fallout happened. Even despite being a real there’s too many stories where people are posting with no fallout and they say they’ll repost once they find out what happened.",
            "Commandment 4 of the 10 IT Commandments:\n\nIf you think it's going to be a disaster, get it in writing. Cover your ass.\n\nWell played by you, sir\n\nEDIT: The pound sign bolds everything? I had no idea so I took it out.",
            "Some vendor reps had come in for meetings and took the managers to lunch.  While they were out I had some geniuses ask me if I could hack into their laptops to find out how much margin was available on a quote so they could try to get the cost reduced.  Told them it wasn't possible without it being obvious, plus, you know, illegal.  Got laid off not long after.",
            "Perfect - there's even comeuppance for the ones that made the decision!  I feel like I should have a cigarette now, and I don't even smoke.",
            "Literal bid rigging. COO could’ve been prosecuted, never mind fired.",
            "Sometimes doctors would yell at us to scan their patient without properly screening them for MRI safety. We’d agree to do it, but only after they put a note in the chart accepting responsibility. They’d mysteriously disappear and order CTs instead. \n\nNo one wants to put it in writing.",
            "I just love it when those meetings get real quiet.  Extra points for keeping that email for two years.  Well done!",
            "My number one rule in business has always been “I don’t go to jail for anyone “. To many people are willing to do wrong for the company and it always ends up getting them fired or worse. When I first took over my current company so many people were amazed and relieved by this policy. Truly scary stuff that the previous person did to cover things up.",
            "\"C.Y.A\" the most important letters for any employee.\n\nYou did well Grasshopper.",
            "Cover your ass at all times. Demand everything in writing and make copies.",
            "It's called \"sole source\" and usually grounds for dismissing the competitive bid process",
            "Moral of the story can be even more broad. Get everything in writing. If someone at work asks you verbally to do anything,  always respond with an email restating what they asked for and that they can confirm. This avoids any miscommunication and is very effective for CYA.",
            "I’m civilian support to a government entity. We routinely are allowed to not present 3 or more quotes when submitting a purchase request but must document that this is a “sole source” product and therefore no comparable product is obtainable. \n\nWe show why we need the product, what impact the purchase (or lack of purchase) will cause, and what specific features are provided by this item that are not available elsewhere. We also have to show a reasonable attempt verifying that we made a reasonable search to find suitable alternatives despite including the “sole source” letter from the manufacturer. \n\nIf there truly is only one seller  for the thing and you document all these facets, you can still get completely legal permission to make the purchase.\n\nFalsifying information is completely unnecessary and should come back and bite you.",
            "I thought this was going to be something waaaay different when it started with “long time stalker”",
            "Another way to ask to put it in writing that's always worked for me is \"can you email me the request so I can have it as a reminder and follow up on it?\" Works like a charm.",
            "My mother is a CPA and she tells people that if your boss at works tells you to do something that is unethical, at the very least you need to update your resume. Getting it in writing that it was your boss who told you to do it is also a very good step to take. 10/10, great read!",
            "No. Yes, CYA. But don’t still do the illegal thing, you can still be criminally liable and FCPA (and other countries equivalents) is no joke.  You could do mail time, and you’re probably not as equipped to defend yourself as the execs. \n\nThis is a situation you should seriously consider whistleblowing.  Yeah it can backfire on you, but not in any criminal way and many countries and states have protections for whistleblowers (worth talking to an employment attorney or at least googling which may apply and how to make sure you fall within it).\n\nLike OP you were potentially at risk for criminal charges if your country had similar anti corruption laws.  Be careful.  But good that you at least CYA’d for within the company.",
            "Perfection. Absolute perfection.",
            "Keeping the email might not be enough protection.\n\nIn a lot of companies, the Code of Ethics includes a duty to report, backed up with a whistle-blower hotline and \"no retaliation\" policy. \n\nMy company recently fired some people for failure to report.",
            "Break the law Sargent? Ok, can I get the request in writing?\n\nWas informed along with my company that we are too run naked down battalion Drive during PT for exercise, by our first Sargent.\n\nI asked him to give me a written notice of what he wanted me to do, and why it was mission related. I even asked for a copy to go into my military file.\n\n3 weeks after this started we as a company had a serious shake down from DC about the situation.\n\nMy nice little letter from the FS saved almost everyone's career.  Poor first Sargent got dropped 3 ranks and Loss of pay and extra duty on top of the blemish on his record. \nE8 rank USA army rank drops to e5.",
            "The other moral of the story is that if somebody tells you to put something in writing think three or four times about what you asked them to do and if it's really the best idea",
            "I never had an employee ask me to put something in writing.  I mean, lots of things are put in writing, of course.  But I learned to perk up my ears as soon as I heard:  \"Are you sure you want me to do that?\"",
            "One of my former bosses would always ask me to cook the numbers of the country/company I managed in order to help out his underperforming other countries. “No problem, Patrick, just send me that request in an email, and we will adjust our monthly report to match what you want.”\n\nNever got an email from him any of the times I asked for one.",
            "If this had happened to me: When they ask why I did it, I would grab from my pocket a pristine pair of white gloves and put them on, dramatically. I would then remove a red bowtie from my other pocket and put it on--slowly and deliberately. After that, I would take a pristine red handkerchief out of my pocket and place it on the table. All of this without breaking eye contact. Finally, I would procure the email, and place it down perfectly centered on the handkerchief and slide it over. When silence befell the room, I would blow into a party blower.",
            "Every time my boss would ask me to do something illegal or insanely stupid. I would wait a few hours then ask him to send me an email stating what he wanted as I had forgotten. He never emailed me back and I never carried out any of his schemes.",
            "Why do they need you to send costs +30%?\nCouldn’t they just send your estimate plus 30% and keep you out of the loop?",
            "I think “lurker” is a better replacement for “stalker” for future reference.",
            "1. I'm dying to know what else was said in the meeting after you brought our your Email Of Ultimate CYA? \n2. OP, other than this specific issue, how was your relationship with this COO?",
            "I can relate to this worked in aerospace for a while being an expiditer, everything had to be traced tracked and certified by 3 different people, my project manager wanted to side cut steps which in aerospace is a huge no no, so I made him put the paper work through to circumvent this, I then told his boss what was going on and why it was approved, he was walked out the next day for faa violations,  moral of the story follow the laws and regulations they watch that shit heavily in these feilds",
            "I play d&d. \n\nAsking for a manager to put it in writing is the same thing when a DM asks the players \"are you sure?\"",
            "I had a similar situation, though with less far-reaching consequences. I am an educator, and my department head at one point told me to commit fraud, so I asked for it in writing. Suddenly, the request was forgotten.",
            "Any halfway decent low-level manager should know that \"Can I have that in writing?\" means \"You're not going to blame me for this.\"  That should be part of the onboarding package every company gives to new managers.\n\n\"Congratulations on your promotion.  Here's everything you need to know:  If somebody asks you to put an order in writing, stop doing whatever you're doing before it hits the fan.\"",
            "Absolutely correct. \n\nWas involved in a similar situation back in the early 90's. Long story short, the end result was that the government team running the RFP were convicted of receiving kickbacks and the lead (a general in their military) was executed. \n\nSooooo glad we didn't win that one.",
            "That kind of bullshit will land your ass in jail. Anti-corruption laws exist to prevent this exact type of crap from happening. You have personal liability and can be held criminally and financially responsible... \n\n&nbsp;\n\nYour former COO is most likely going to face some fat fines and maybe even jail.",
            "I make sure to get as many instructions in writing as I can. The more is in writing and backed up onto at least two external hard drives, the better.",
            "I'm guessing this operation isn't large enough to have a full fledged Compliance, Internal Audit, or Risk department. If this action had occurred at a larger company, you'd both be fired: the COO for ordering it and you for not reporting it.",
            "Nice! I remember learning about those blacklists and anti corruption measures in my international trade class.\n\nNot something you want to skirt the law on. Your instincts are good. Glad you were able to save face!",
            "As someone who is a meticulous record-keeper of important personal and professional documents (thanks military!!) I salute you!!!",
            "Dude I went thru this July 2020. First week of starting my last job my boss told me to commit commercial bribery (obviously I didn’t). This conversation was over instant messenger so every message was saved - at least, my side was. Boss turned their saved history off, presumably under the impression I did the same. lol. No. They kept their job. I didn’t. Go figure",
            "I had a boss that on more than one occasion used to ask \"Why do you put everything in E-mail?\"\n\nBecause of course, if you have to ask that question....",
            "Well played, op! Well played!",
            "Dang this kind of thing sounds so familiar, the US-based branch of the company I worked for did stuff like this as well.\n\nYou wouldn't have happened to be working for a company that rhymes with She Chafes Me, did you?",
            "Not arguing or anything, but what was the alternative? If you were the only ones (OEM) what would have happened if no other quotes had been advanced? Just curious.",
            "I can’t believe it. You actually won. This could have uprooted your whole family if you didn’t have that. Holy smokes",
            "This is why I love the slack.app screenshot that and dm it to myself. When they told you to do it it’s already in writing. I dm myself the screenshot because I work with a bunch of slack admins. \n\nEven if I were fired and my account immediately disabled I know how long it takes before my slack account gets the systematic shut off the account command.\n\nIt would take someone way up there food chain to get that shut down quicker. In the event of any lawsuit, even deleted messages can be easily exported.",
            "And then that COO got another job. Sad life.",
            "Over twenty years in security where everything hinky that could happen, does happen. I document everything. Got my but out of trouble many times.",
            "If you are the sole supplier, you could issue a certified letter saying this fact. Usually, the procurement agency will accept after due diligence.",
            "Thank you for sharing OP and yes as a sole trader and small business owner, anytime anyone asks for a quote I ask for their permission in writing for my service. \n\n**I am loving your CYA**\n\nWhen did you leave? Got a better job?",
            "What an absolute idiot the COO was. Thanks for the story.\n\nOh by the way I think the word you were looking for was Lurker rather than Stalker. Unless of course you are hunting down members of the sub in your free time for nefarious purposes or consumption.",
            "Wow that's almost straight out of the quiz section of our anti corruption training.",
            "I compile quotes, too. My Salesperson wanted me to revise an existing quote with an updated vendor quote that included an additional upcharged spec plus freight. But to try to leave the sell the same so the customer won't know we forgot to add it the first time.  \n\nAfter I did the math, I realized we'd be going from a 20% GP (gross profit) to a 4% GP. Technically my job is to just carry out the tasks my Salesperson asks of me, but I pushed back on that one. \"I'm going to need management approval for that low of a GP on this high of an order\" (it was like $20,000).",
            "Ran a Learning Management System for a college and we were running out of seats and the cheapskates didn't want to fork over more money for a bigger license. Well my boss asks me to hack the licensing so we can go above the limit we pay for. So I drew up a nice email basically saying that I will do it if x, y and z conditions are met. XYZ is basically saying that my job is threatened if I don't, all my legal bills/fines will be paid for and if imprisoned a daily rate of $1k. Boss man never brought the subject up again. \n\nHe never was the brightest. He and his buddy got frogged marched out by security one day after I had left for running a for profit gaming server on the school network. A network that was always slow and they always blamed me for it being slow. Dirty bastards!",
            "I met a guy who drove one of those huge gravel trucks.  Every morning he'd run through a 15 minute safety check, making sure all the brakes, indicator lights, etc. work.  His boss asked him to skip it as it took time (money).\n\nBuddy asked, \"Are you willing to sign off that this truck passes the safety check, then?\"\n\nSuddenly, the 15-minute on the clock safety check was A-OK.",
            "Your coo is the exact reason some of have to take yearly training on. This stuff. It’s painful and dry. But because it happened somewhere, it’s yearly vs “an onboarding training”.",
            "My apologies, but I do not understand this probably crucial part of your story:\n\n>...they need to have four or more quotes from different customers in order to get it cleared by their government (some anti corruption policy...) We were the OEM ... So we'd have to work through third parties...\n\nI understand this as if there need to be other quotes from competing providers, and do not understand why that would be your problem?",
            "Absolute beauty, this one! And a healthy reminder for every professional out there. \n\nThanks for sharing",
            "Sounds like middle east and oil field equipment.",
            "Lurker*",
            "Lurker my guy. The term is lurker.",
            "As a fellow estimator, I applaud and bow down to you.",
            ">My boss was pretty strict on traceability...\n\nAKA '*transparency* between upper management, so they can rip the miscreant who screwed the pooch to SHREDS.",
            "I do the same exact thing you do but it sounds like a different industry. When these types of things come up we usually negotiate open book pricing with an agreed upon markup with the end user / gov't agency.",
            "C.Y.A.",
            "My company has us wasting time and signing documents constantly. They want everything in writing, and it's gotten so bad that a large percentage of the workload is now signing forms saying we did the work.  \n\n\nSo now I demand everything in writing too. If management wants to play, then I want to play too.",
            "Moral of the story, if you don't want to get caught doing that, make the quotes different prices and not just an exact 30% difference. This is probably what got them caught in the first place.",
            "Perfection. Absolute and complete perfection. There should be a module on office politics in software engineering courses and you should write the textbook.\n\nThey thought they'd set you up as the fall guy. Nope.",
            "Being the OEM you could have just offered the literal exact same price say 1 dollar every one of those 4 companies would have added overhead and been 1.05 etc it makes no since to mark up what a clueless COO",
            "How did you convince the guy to send you an email? Or how did you document this? That's pretty interesting!",
            "Nice story. I would still argue that the biggest fuckup was on the requester side - either they have good reasons to stick with your product - put it into writing, explain why you are in a \"single supplier situation\", and order the stuff from your company.\n\nOr except the possibility to replace your product with those from the competitors, but then there is no need to ask for sham offers... compare the price & effort of buying from you vs. replacing the product.",
            "Per our conversation, I will do the following per your request,  Please correct if I misunderstood.",
            "Man - in my industry, there are only like 2/3 companies in the world that make what we utilize. We may only utilize 2 of those brands' instruments because it plays nice with our software. \n\nBut we just can't get sole-source bids for things. Like everything has to have 3-4 bids. 3-4 bids for 1 (generally 1, honestly) company's equipment.\n\nIt's maddening.",
            "https://www.boredpanda.com/break-law-sure-boss/?utm_source=com.google.android&utm_medium=referral&utm_campaign=organic you're going viral",
            "What are the letters under each post for? I cannot figure it out",
            "What does OEM mean?",
            "Documentation kills conversation.",
            "So what you're saying is if it's just outright illegal go for it?",
            "Compliance Officer here and yes, you can be held liable and the company would work with the government saying that you still did wrong. You could also be fired for not reporting the wrong doing as some companies Code of Conducts require an employee to report these things.  \n\nInstead, what I would recommend is say no, report the wrong doing.  If you end up fired, you now have a multi-million dollar lawsuit against the company for retaliation and if you knew they still did it, you can recoup fees from the government worth millions.",
            "You should keep in mind just because your boss puts the order in writing that doesn't absolve you of any legal liability",
            "Never ever trust a manager or a co-workers word.  This is exactly why right here.  Get everything in writing or refuse to do it.  Good job OP",
            "So would you feel comfortable with your mother or sister was to do that?",
            "I don't believe it, bit I like the story, and the moral.  Cheers!",
            "I wonder why there were no provisions to defend the choice? Like the client categorically states that OP's company is the only one in the world, therefore this is the only quotation source.\n\nI worked for a non-profit for a good while and checks and balances are also a thing for us. three quotations from different suppliers and such. My husband, on the other hand, has government agencies as clients. His field is quite niche here.\n\nThere are provisions in our acquisitions processes though where we can defend our choices, or defend why we only got one quotation. In OP's case, because that company is the only one on the planet. In my case, it's small things like printing brochures and collaterals; exclusively used one company and kept the results of the one and only time we tried to use another supplier (epic fail).\n\nFor my husband's government-agency clients, they have the same thing. Most of them justfiy that my husband's company is already an established institution in this very small field. In fact, one of the agencies just crawled back. Husband's company was underbid by a newcomer. According to government regulations, they have to go with the lowest bidder. Because the field is quite niche, my husband knows everyone on the lowballer team. He knows they'd mess up the project. BUT he let it slide, because this is one particular government agency he really did not want to work with. lol. Fast forward three months, the agency cancelled their contract with the lowballer, and asked if my husband's company could fit them in for this fiscal year. And now, this agency's vice president for operations told my husband that from hereon, they will be exclusively using my husband's company.",
            "I don't understand. You give out one quote to one customer, very specific stuff. But some law says \"nah you have to give more quotes to other customers\" even if there's only one customer?\n\nWhat does the government/law expect in very niche situations like the one you described? \"Oh hey customer, that's a very specific request! But sorry, can't give you a quote unless 3 others ask for the exact same thing even though you may be the only ones in the world asking/needing this\". \n\nThat's a recipe for workarounds. And businesses WILL look for workarounds, like those paying a fee for illegal dumping rather than properly dumping which costs more than the fee.",
            "If you knowingly acted against the law, the e-mail from your boss doesn't help you. You could and should be held accountable. Not sure if I really believe the story.",
            "And that one man band? Hunter Biden.",
            "Tldr?",
            "Yesss 👏🏻 \nAlways keep the receipts",
            "> And the moral of the story is, if someone tells you to do something borderline illegal, make sure to get it in writing.\n\nThis did not work in the military.  They were keen to this little gambit.",
            "CYA 101",
            "Odd decision from the COO to require the other quotes be bumped up too - unless the other potential suppliers were willing to sell to the buyer for less than they paid, and to eat all their operational expenses, the OPs company would have still been the cheapest.",
            "Why do I imagine someone tearing the papers literally to pieces..",
            ">They ultimately wanted a scapegoat to parade in front of the board to explain why the multi-million pound deal they’d all been talking about for the last two years had suddenly vanished.\n\nAnd they certainly got one!",
            "But did you have your sword.tc at the ready??",
            "Okay, someone ELI5 please.\n\n* You do a quote for a customer.\n* Some anti-corruption law forces the customer to get in four quotes...from other customers? What? I thought he *was* the customer? Okay, I assume you mean \"other suppliers\" here.\n* This will be impossible because only you produce the products. You are literally the only supplier.\n* And then there is a one man band who *also* receives a quote from you...and then sends that out to other companies who have been asking about a quote? Where did those companies come from suddenly? And wouldn't those quotes also have taken six weeks?\n\nI'm completely lost here.",
            "That there are other companies that make the same type should have been irrelevant. In the US, governments have similar policies, but when a certain part or service is unique, it can and often is designated a “sole source” (only one company provides it and bidding would be pointless) or “single source” (multiple companies provide it but only one provides it in a way that’s useful under the circumstances).",
            "Always cover your ass",
            "Gonna go out on a limb here and guess France. My partner has to do this any time they want equipment for the lab that's over a certain amount.",
            "This is the way",
            "Your COO is the damn reason the millions like the rest of us have to take these goddamn anti-corruption training every year.",
            "On top of it, there was no need to add the 30%. If you sell a product direct for 1000 or to me for 1000, I can't resell for 1000. Not only would I make no profit, I would lose money due to overhead costs. The normal expectation for a \"preferred supplier\" is to get a discounted rate in order to make a profit. An audit of them being the same price would raise no flags though.\n\nIf it was 1000 for the product and 1000 for you to install, I could undercut the install. However, the overhead on the product is also taken out of the reduced profit on the install.",
            "I wouldn't even call this malicious, just solid C.Y.A. Well done."
        ]
    },
    {
        "post_id": "sevn76",
        "author": "WritesForDough42",
        "title": "No One Can Fire My Boss So She Does It Herself",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sevn76/no_one_can_fire_my_boss_so_she_does_it_herself/",
        "score": 18817,
        "num_comments": 452,
        "created_utc": 1643390158.0,
        "selftext": "This isn't my story, but I was able to witness it in all its glory because I used to work for one of the people involved.\n\nYears ago, I used to work at a state government agency where my boss was a political appointee. Her mom was a bigwig in our governor's party who wrangled a political appointment for her daughter, which meant she had some clout behind her.\n\nLet's call her Shannon.\n\nShannon was not good at her job. At all. She was frequently out of the office for \"meetings\" (e.g., two-hour lunches, coffee with friends, a bit of shopping).\n\nShe was also a bully and a tyrant. She bullied her staff and would hold the threat of firing over everyone's heads to get them to do what she wanted. She wasn't a micromanager because she was never around enough to actually micromanage anything.\n\nAnd she was widely disliked throughout the entire building. This was a *large* agency, so to have a building where almost everyone disliked you took a lot of work.\n\nThe problem is that, as a political appointee, she was untouchable. The people who had the power to fire her couldn't because of her family. Even the number three person in the agency couldn't do it, and he was a political appointee as well.\n\nBut after a year of mystery meetings and time out of the office, her excuses were catching up to her. The agency director removed her from her job and put her in charge of \"special projects.\" Anyone who's worked in a corporate job knows that people get put in charge of special projects because they were largely incapable of doing their previous job. They didn't get fired, but they no longer had any power.\n\nThis was Shannon's case.\n\nFor a while, she seemed to get the message. She shaped up, didn't have any more mystery meetings, didn't disappear from the building for two hours, and treated people somewhat nicely.\n\nOf course, it didn't last and Shannon returned to her old ways.\n\nAround that time, we got a new assistant director — we'll call her Tricia — who was also a political appointee. She was the number two person in the whole agency, and she was great to work for. She was very serious about her job.\n\nShe had access to Shannon's electronic calendar and saw what Shannon had been up to. She then cross-checked the security logs to see when Shannon was in and out of the building.\n\nAfter her brief investigation, Tricia emailed Shannon with a list of dates and said, \"Can you tell me more about these different meetings you were having? And why they took so long?\" (I'm paraphrasing.)\n\nWell, Shannon wasn't having any of that! How dare Tricia call her character into question?! This was an outrage! It was so outrageous, in fact, that Shannon wrote a resignation letter and slammed it down on Tricia's desk! That'll show her!\n\nAfter a few hours, Shannon had time to think about what she had done. She remembered that she had a 1-year-old at home. She also remembered that her husband was an unskilled truck driver who made $8 an hour. (**Edit:** He was a local delivery driver for a construction firm, NOT a CDL driver.) And she remembered that she was the primary breadwinner for her family.\n\nShe went back, hat in hand, and apologized for her attitude, she said she was willing to try harder, and she asked Tricia if she could please possibly have her letter back, pretty please?\n\nTricia said, \"Oh, I'm sorry, you're too late. I already processed the letter and sent it off to HR. I'm afraid I can't undo that.\"\n\nDo you remember in the movie, *The Incredibles*, when Mr. Incredible fought the giant ball with legs? The ball was so indestructible and powerful, the only thing that could beat it was itself?\n\nThis was that moment. The previously untouchable political appointee had just been fired by the only political appointee who had that power: herself. And rather than protect her or do her a solid, Tricia would not undo her self-termination. She just let Shannon be her own undoing.\n\nWhen news of Shannon's self-firing raced through the building, you could hear the cries of \"What? Are you serious?\" followed by howls of laughter as each new person heard the story.\n\nShannon was out and everyone who had to deal with her was much happier than they had ever been in that job.\n\n&#x200B;\n\n**EDIT:** Thank you to everyone for the great comments and the awards. That's very cool, and I really appreciate it. You all are awesome!",
        "permalink": "/r/MaliciousCompliance/comments/sevn76/no_one_can_fire_my_boss_so_she_does_it_herself/",
        "comments": [
            "This is like a fairy tale come true and told to children at bedtime.",
            "I worked with a supervisor who would turn in her resignation as a way to get a pay raise. It worked for years until, we got a new director. A director who was not her buddy. The very first time she pulled this stunt he accepted and processed her resignation. When she came back to say she changed her mind and was staying, his response was, “Oh no, you tendered your resignation and have accepted it. Your position has been posted.”",
            "The malicious compliance doesn't get much more perfect than that. Well written, too.",
            "Sounds like Shannon, if only for a moment, was a good boss at the very end, saving some legwork for Tricia",
            "She’s not the first person to fire themselves. Casey Stengel, baseball hall of famer as a manager of the Yankees, did it in the 1920s.  \n\nAfter his major league playing career, he was president and player-manager with a Boston Braves minor league affiliate at a mid-level league, and got an offer to be a manager (at a higher salary) from the Giants affiliate at a higher level league.  But his boss (the owner of the Braves minor league team) wouldn’t let him go, and the new club wouldn’t pay his existing boss for his services.  \n\nSo, as manager he released himself as a player.  Then as president, he fired himself as a manager.  Then he resigned as president, and took the new job.",
            "This *kind of* happened where I used to work. Also government. She was so awful to everybody. Cried wolf so many times. Openly demeaned staff. Constantly on her phone. Our metrics were very easy to meet, and she wouldn't even try. Just get sour when someone called her out. \n\nShe decided to quit her secure state government job, and got hired on at a small county office. She got fired within two weeks of working there. For \"irreconcilable differences outside of her control\". \n\nFelt so good when I heard. Fuck you, Jordan.",
            "[removed]",
            "I would have cried happy tears for 40 days and 40 nights",
            "This story was really well written. You should consider a writing career if you haven't already. You sound like a good storyteller.",
            "I had a manager that did this. She was in a position that she was severely unqualified for and should never have gotten getting overpaid. I was abused and harassed by her constantly and I ended up doing all her work and getting paid a low hourly wage despite being more qualified. She was so incredibly stupid that I often felt sorry for her and tried to catch all her mistakes before she royally fucked up. We’re in healthcare so it wasn’t like a minor error. She wasn’t qualified to be giving care or supervising anyone let alone doing anything or even speaking to patients. \n\nIn the entire time she had two meltdowns out of the blue and during one she had actually sent in a resignation email. This would be on days where the rest of the team stepped up and made sure everything had run smoothly. She’d just disappear or clash with the team (especially the women). The management let her stay when she came to her senses because again they needed her. But likewise she needed the job more than anyone. Her son was in remission from leukemia and he’d lost his dad to cancer recently. She was lucky the step-mom was so generous and kind because she really couldn’t support two college aged boys while being one step away from being homeless herself. \n\n\nAnd then some ugliness with the former manager came out and in the interest of transparency I tried to let her know.\n\nShe had me fired after throwing me under the bus to take the fall for it. The entire team told her that it couldn’t have been me but she would not listen. \nI did get asked to come back a few weeks later by management and I needed the job at the time so I came back. It was apparently a shitshow where nothing had been getting done properly and the records were a nightmare that was high risk for an audit. At least this time the management knew it was her fault. But they couldn’t fire her yet bc they needed her and had no replacement ready. \n\nLiterally the first day back she tried to again file a complaint against me because I was acting ‘shady’ aka being busy with my job while she walked around being a nuisance. This was after she left work to handle personal business while making me do her job.\n\nSo wouldn’t you know it, the second management found a replacement for her, they essentially pulled out her resignation and accepted it effective immediately. The best part for me was that she had bought me a giant birthday cake the day before her firing (she insisted on it) and had the audacity to complain to me about how expensive it was. I knew it was going to happen the next day so I made sure to take the cake home lol. \n\nAnd the day she got fired she confided in me ‘how could they do this to her knowing her kid has cancer and *needs* the insurance?!’\n\nLike…okay maybe don’t send out resignations to your boss if you have something to lose?",
            "Shannon sounds dumb.",
            "| her husband was an unskilled truck driver who made $8 an hour  \n\n\nSorry to be that guy, but truck driving takes skill let's not shit on the husband because Shannon's a B.  \n\n\nIn fact let's just stop using the word 'unskilled'  - it's just a reason for \"the man\" to pay people less.",
            "That's like getting Mxyzptlk to say his own name backward!",
            "I love it when trash takes itself out.",
            "Huh, my experience with special projects is they take the best people and add it to their workload.",
            "Her unpopularity reminds me of a co-worker who was so universally disliked that we had a huge going-away party on his last day—and didn’t invite him.",
            "This is my favorite MC story to date!",
            "Even better: by resigning rather than getting fired, she was likely ineligible for a severance package or unemployment insurance!",
            "We had a unit manager on one floor of the hospital where I work who was like that. She also tantrums her way into an on the spot resignation. And the powers that be were only happy to accept it.\n\nI described the event to may wife (This was a couple years before she died.) and she asked if anyone broke into a chorus of \"Ding Dong The Witch Is Dead\".",
            "Isn't it nice when they maliciously comply against themselves? :)",
            "This could be a movie",
            "If she was a political appointee, why was she desperate for the income? I thought those people were generally rich and connected",
            "\"Ding dong the witch is dead\"",
            "\"If anybody has seen the incredibles...\"\n\nThat paragraph in itself was pure art\n\nSo visual lmao",
            "Tips to CEOs.  Hire someone to be an absolute nightmare to work with.  Have them bully and harass your peons.  Then after some time have them terminate themselves which would improve employee morale.  Rinse repeat for any department with \"low morale\".",
            "What I don't get is why anyone minded her being gone for 2 hours a day, if she was terrible when she was there?",
            "as they say here, trash took itself out",
            "If you give some people enough rope…",
            "Her immediate response to being challenged was to resign without any forethought to the results of those actions? How else could she have expected this to go over?",
            "This is so freaking funny.",
            "There were howls of laughter here too.\n\nNobody heard it, though.",
            "Best MC I've read in weeks.",
            "And they all lived happily ever after",
            "Hope everyone in the building bought Tricia a drink.",
            "\"Don't threaten me with a good time.\"",
            "As a political appointee due to nepotism myself, I feel very much called out.  I do my best to do the things I was hired for, but I totally take advantage of those 2-hour lunches.  \n\nThis bitch was too greedy.  She will serve as a lesson to us other nepotee to know our place. \n\nThanks for sharing.",
            "When a problem employee hands you a resignation letter, consider it a gift. All you need to say is ‘I accept.’",
            "I've told this story on here before, but my ex was super emotionally abusive and would frequently \"break up\" with me during arguments, only to act like everything was back to normal when she'd finally decided to cool off. She'd go \"we're still together, right, Hylanos?\" And me being spineless, I'd take her back.\n\nWell finally she did it to me, and I decided I was done. SurprisedPikachu.jpg from her, of course, but she was out of the apartment within a week, and my life got so much better :'-)",
            "Could you please tell Tricia that this old lady says she is a hero.",
            "[removed]",
            "She sounded trashy from the start.",
            "Im here for the Incredibles reference.",
            "How did you get what went through Shannon's head?",
            "Now she'll probably get some super high paying consultancy job just because of her years working in government.",
            "Tricia is the super hero we need",
            "This is absolutely delightful.",
            "Anyone else picturing Shannon from “Kims Convenience”?",
            "Delicious.",
            "Awesome story :)",
            "I have been having a completely fuct 2022. This story warms my heart!!",
            "I worked with a Karen who also made everyone in a three story building hate her. She had Plans to become a Manager. She was notorious for picking favourites and going to breakfast with them during work hours. She made other supervisors cry, She finally quit when she gained some awareness that she'd burned every possible bridge to senior management.\n\nShe quit at the same time that my father died. When I came back from bereavement leave, I thought, \"At least I won't have to see Karen's weaselly face around any more.\"",
            "Shannon its confused!\n\nShe hurt herself in her confusion!",
            "I hope this is true.",
            "She put her foot down... and promptly shot it.",
            "I also have worked in state government. The governor appointed leadership can be a mixed bag of interesting sorts. At one time we had what I called the triad of terror.  \n\nWell it ended badly for them. They were removed and the trials began. Yep, they were had to deal with being charged, losing their job, paying fines and looking at jail time.",
            "For a supposedly meritocratic place 'Murica sure is nepotistic",
            "“Oh you want to fire me? Then I quit- wait”",
            "As a boss, I once heard from one of the managers: “If you don’t do it my way, I have no other option than to quit.”\nHe said that as a power play during a meeting with other managers in my team. \nHis idea was really bad so I just said: “Well, it’s been a pleasure”, called HR and informed them that Mr. X had just quit and would come over to sign the papers. \nHe turned red, yellow, green, blue… and left.",
            "\"The agency director removed her from her job and put her in charge of \"special projects.\" Anyone who's worked in a corporate job knows that people get put in charge of special projects because they were largely incapable of doing their previous job.\"\n\nThis is called the Dilbert Principle",
            "this...this is the meaning of heartwarming",
            "TLDR? Political appointee resigns, regrets it but too late",
            "Yes, sometimes they do themselves in. 😁\n\nI used to supervise several people and had one 'problem child' that got several PIPs (Performance Improvement Plans) that were never his fault, according to him, but they totally were. \n\nThe way the (silly, *short-term*) PIP process was set up at the time, once you 'improved' according to the plan and its timetable, it was over and done with.  ('You must meet this criteria and continue to meet it for the next 6 months or you will be terminated.') So if a person kept getting them, each was totally separate and we couldn't get rid of someone that would do what they were suppose to do during the PIP and then backslide afterwards. We had to start over 'fresh' with a new PIP. \n\nAfter two PIPs for the same issue, my manager and I were fighting with HR to make it more permanent. We were writing up a third PIP, but wanted to reference the previous two and add wording that no more PIP's would be given for this same specific issue - if he relapsed again at any time in the future, he would be terminated. \n\nDuring this internal fight, problem child came to us *verbally* saying he was resigning and giving us 2 months notice. *happy dance* (Apparently he thought he had an opportunity elsewhere, but we found out later that it fell through. Oops.)\n\nHis BIG screw up: Normally at that time, if we didn't want someone around, we could just accept the resignation, walk them out, *but still pay them up to their official quitting date*. (2 months!) We didn't have anything in writing from the employee, so he was asked to fill out a written exit interview. (I guess they wanted to make sure he couldn't later say that we fired him - ?)  He kept putting it off and every few days I would be told to ask him if he had finished it so it could be turned in. \nHe finally said that he was stalling because he knew that once we had his signature, we would walk him out. That was true, but I didn't mention he would still be paid. Over the next week or so, I kept nagging him for his paperwork (per my manager), so he knew we wanted him gone. \nOne day he went to lunch and didn't come back. The receptionist told me he handed in his access badge and told her he wasn't coming back. 😃",
            "Love everything except the \"unskilled truck driver.\" There is no \"unskilled labor.\" Every job requires skills of sorts",
            "I don't get the (malicious) compliance, but I think it could go to r/LeopardsAteMyFace.",
            "Just love it when the trash takes it's self out.",
            "I do have to feel some pity for her.",
            "[deleted]",
            "Great story. One small quobble... In no reality have truclers made $8 an hour in my lifetime",
            "Almost every corporate setting big enough to have a HR department also has a 24 hour cooling off period.",
            "For once, can we not have a redacted story. Who was the person???",
            "She deserves it but I feel fucking awful for her family ):\n\nI wish she was single and alone.",
            "This reads like an urban legend. How could someone have family connections and a husband who makes $8/hour? \n\ncome on.",
            "X. Doubt.",
            "[removed]",
            "[removed]",
            "While funny it's a shame that a baby came out from a piece of shit human being",
            "In the UK at least, this can count as unfair dismissal- if an employee in a tantrum tenders their resignation and quickly recants (this probably counts as that), they should be able to or could claim at a tribunal.\n\nSorry, being boring on a great post though, thank you!",
            "She pulled a niel young",
            "It was believable until I read $8 an hour for a truck driver for a construction company.. Unless you're in a third world country that's just not happening..",
            "Why are they always named shannon",
            "\"And we all lived happily ever after. The end.\" Now go to sleep.",
            "\"Own Goal\"",
            "\"I demand that you fire me immediately!\"\n\n\"Okay, sure.  Done.\"\n\n\"No wait, not like that!\"",
            "i don’t even understand her threat of resigning…. she’s threatening the building to have a good time?",
            "I didn’t know people thought that about special projects. My experience is very different. I decided to quit a full time job because I wanted to go part time while I finished my studies. My boss instead created a part time special projects role for me so she wouldn’t lose me altogether",
            "Ain’t it great when the trash takes itself out?",
            "I have my misgivings about politics, but damn, did this bring a smile to my face.",
            "What is a political appointee?",
            "r/idontdreamoflabor",
            "And today, her \"unskilled truck driver\" husband is making $14/mile.",
            "An *eight dollar an hour* truck driver?!",
            "And if course that half with would screw over her family who depended on her.",
            "That is beautiful.",
            "How to trick a corrupt official out of office",
            "This deserves all the awards.",
            "Easiest way to get political appointees (lots of people call them “points”) is to get the public involved.\n\nSince almost everything they do while they are supposed to be on the job is public information, just release all their slackery and assholery to the public, the media, etc.  anonymously of course.\n\nAlso, in pretty much every US state, it’s obvious she got her job through nepotism which is a major violation of state ethics laws.  Easy to report to the independent review board.",
            "I love this so much. Can you imagine how much shit she got from her family for failing so hard when success was literally given to her. Chef's kiss! And well told!",
            "Lovely, just lovely.",
            ">Shannon was not good at her job. At all. She was frequently out of the office for \"meetings\" (e.g., two-hour lunches, coffee with friends, a bit of shopping).  \n>  \n>She was also a bully and a tyrant. She bullied her staff and would hold the threat of firing over everyone's heads to get them to do what she wanted. She wasn't a micromanager because she was never around enough to actually micromanage anything.\n\nThis describes at least half, maybe two thirds of the management I've ever worked under.  And damned near 99% of upper management.  Though direct management seems to find a way to micromanage you despite their lack of presence.  They just correct the mistakes they *assume* you're making, whether you've actually made them or not, whether they were around to see it or not.",
            "Must have been 40 years ago, even a “unskilled truck driver” made more than $8 an hour. But nice story, I think I have a few myself although mines name is Karen.",
            "Sad for the 1 yo, but hot damn if that isnt the consequences of my own actions.",
            "Shannon sounds like a [5th dimensional imp](https://death-battles.fandom.com/wiki/Mr.Mxyzptlk)",
            "fdx",
            "I’m a bit curious, what country is this?",
            "Ding dong, the witch is dead",
            "Nicely done.",
            "That’s hilarious 😂",
            "Wow. Shannon sure showed Tricia!",
            "The whole office: \n\n“ding dong the witch is dead”",
            "This made my whole week.",
            "Very nice. Self-actualisation played live, in three parts.",
            "Where I work at there was a person, slated for the fast track to executive.  Cleaned house, fired management, employees, close to retirement employees, all it took was a call to certain executives that got him his job and had his future slated. He knew everybody hated him, spent a year making our lives hell. Got promoted, millions in bonuses, went to his next step, 7 people under him, fired 5.",
            "This was my bedtime story. I can happily sleep now",
            "\"...And they all lived happily ever after.\"",
            "All anyone in that position needs is \"enough rope.\" Feed it out to them and just wait.",
            "Same thing, but privately owned business: one of husband's former  co workers was a good friend of the boss, one of several good friends who worked there. She got away with a lot of \"mental health days\" that based on her behavior at out of town meetings, were definitely hangover days with or without blackouts. People just had to work around her.\n\nStrangely enough, the business didn't prosper. They had to sell to a larger company in the same field. The boss's buddy left very quickly. Husband is doing great at larger company, several years later, with a genuinely good boss who recently got him a promotion and raise for doing his job well.",
            "Applaud Shannon!",
            "A good story of how self sabotage destroys.",
            "Lol, I tried that once. Good thing I was prepared to walk.",
            "I love poetic justice.  I'm a retired government employee and saw way too many political hacks who were lazy, incompetent,  entitled and often all three.",
            "this sounds like the demon Kristi Noem and her uneducated daughter",
            "This is in the USA, right? It sounds like it is the USA.",
            "\"The people who had the power to fire her couldn't because of her family.\"\n\nContext?"
        ]
    },
    {
        "post_id": "dophsu",
        "author": "MiaFknWallace",
        "title": "‘Just put me anywhere’",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dophsu/just_put_me_anywhere/",
        "score": 18806,
        "num_comments": 942,
        "created_utc": 1572354203.0,
        "selftext": "I work at a cinema and the other day I had a guy come up and request to see a movie. I asked if he wanted to see the 2pm session (it was around 1.30pm) and he replies ‘obviously’. It’s not always obvious to me though and I’d rather be safe than sorry so I always check. It’s also a thing at my cinema where if you sign up for our rewards program (free to join) you save a hefty amount of cash off each ticket so I always suggest joining before selling a ticket. I started my spiel with this guy when he interrupted and said ‘I’m not joining anything’. So I ask if he has any concession cards and he rolls his eyes and says ‘no, i just said I’m not joining anything’’ which wasn’t even what I had asked him. At this point I’m getting annoyed cause I’m just trying to help the dude save money and he’s getting annoyed with any question I ask him. I know I have to ask where he wants to sit and when I do he says ‘in a seat’. I ask if he wants to be more specific and he gives me the filthiest look and says ‘this is taking so fucking long, just put me anywhere’. It had only been probably a minute or two of conversation so I’m pretty ticked off at this point. So, I pick his seat for him. Front row as far to the side as possible in a 400 person cinema with a giant ass screen.",
        "permalink": "/r/MaliciousCompliance/comments/dophsu/just_put_me_anywhere/",
        "comments": [
            "Now that our theater has assigned seats, I see this interaction almost every time we go now. I hope they all respond the way you did LMAO",
            "I used to get in shit from management for this but when I worked at mcdonalds in drive thru, I would have people coming through ordering value meals and when I would ask \"Was that coke for the drink?\" They would so fucking rudely just not even acknowledge that I was speaking to them and say nothing. I got so sick of it that when people did that I would put it through as diet coke and when it would come up on their screen they would go \"NO wtf I wanted coke\" and id just say in a real casual tone \"oh sorry, you didn't respond so I thought you would be okay with whatever\". Luckily I was one of the best employees otherwise so I never got in any real trouble.\n\nEdit: the sweetest plum of this whole thing was when they would say specifically \"No I ordered a coke\" and I would oh so politely remind them that they actually didn't say anything. Ugh, fuck that job but it was those little victories that made it worth it.",
            "[deleted]",
            "I just ask the cashier where he/she would choose to sit. They know the place and I get the best of what they have to offer.",
            "Not excusing they guys behavior, but I do understand why he was so annoyed, even if you were trying to save him money.\n\nEvery dang shoe store, pet supply store, home good store, movie theater, grocery store, restaurant, and fast food joint wants me to sign up for their loyalty program.  I'm sick of it.  Nine times out of ten I just want to get the transaction done, even if I could have saved 3 cents per gallon of gas or saved 20% off today's purchase.  The hassle of the text messages, phone calls, email, and junk mail just isn't worth it, even for the discount, and I just want to get on with what I'm doing rather than stop to fill out yet another application or give someone my email address.",
            "I feel the same way as this guy, but I am not rude about it. I don't want to join a club, have a rewards card, or do a survey, ever. What happened to just paying money for something and getting the thing?",
            "Person like that isn't going to be sitting in the assigned seat.",
            "[deleted]",
            "> giant ass screen\n\nPicturing you seating this guy then calling over your one co-worker who only does one thing, but does it really well:\n\nCo-worker is a big fat dude who bends over in front of that customer and moons him for the duration of the movie.\n\nYou could call it \"Asses for asses\".",
            "To be fair I totally understand the guy. When I buy something, I expect to just buy it and be on my way. I hate having to decline offers that \"save me money\" (which they do, but there's always a catch, typically \"we collect statistics on your viewing habits and sell that information to advertisers\"), and I preferred when seating was first-come first-serve. How am I expected to know if I want to sit in the first or tenth row? It depends how close the seats are to the screen, the speaker placement, where the tall people are seated, etc.\n\nPlease, just charge me, and let me be on my way. I don't want to talk to you or think about what you're asking me. Don't try to save me money, if it's too expensive I'll just pirate the movie.\n\nActually, because of the complexity of the endeavour, I'm generally so annoyed at the movie going experience that I don't go to the theater anymore. Why would I pay up the ass to leave my home, have 3 minutes of uncomfortable interaction with a clerk asking me stuff, 15 minutes of ads for products I despise, and then a movie that's too loud and that I can't pause when I inevitably need to pee? No thanks.",
            "Yeah he just went and sat somewhere else but nice try dude.",
            "I’ll never understand people who are rude to customer service.",
            "You should have put him in the bathroom. Make sure to upcharge him for the flushable seating.",
            "idk why so many people are trying to defend the other guy, just be an adult and say no thank you instead of being a dick abt it lol. blame management not the employee for the sales pitch",
            "It is annoying when you're just trying to do a simple transaction that should take 10 seconds but you keep getting asked about joining all these rewards programs and shit. I know the tellers have to ask but boy is it obnoxious.",
            "[removed]",
            "[deleted]",
            "Hello there, fellow AMC employee!",
            "Did he come bolting out of the theater, screaming his angry head off, when he discovered his *\"* *just put me anywhere\"* assignment?  \n\nIn an ideal world, he'd look up his seat, reflect on the exchange, smirk and say, *\"Well, I asked for that, didn't I?\"*  😉\n\nWould never happen but that would be beautiful to witness.",
            "It IS super annoying when you just want to do something and a sales assistant appears. I know you think you are helping, but to the person who just wants to be left alone, it's like a fiery itch that you can't scratch. People annoy me at the best of times, when they won't leave me alone in a cinema, my god I would whip my hot dog at them.",
            "This shit annoys me. I do the same not to be rude intentionally but regardless I'm just there to buy a ticket and be on my way. 3 or 4 dollars is insignificant and I'd rather pay it and avoid the convo.\n\nIts not even annoyance at being asked to sign up it's the annoyance of having it thrown at you regardless of intentions 10999fnf448 times a day literally everywhere you go. It's madness.",
            "yeah if only he actually sat in that seat. if it wasnt packed you know he didnt fucking look at his ticket he just sat where he wanted.",
            "Who are these savages actually buying tickets at the theater?  Just Fandango that shit and you don't have to deal with any people at all.",
            "If he's getting annoyed stop and just hand him his ticket. Who the he'll cares if some random guy who wants to ignore everything and isn't even listening pays more for his movie.",
            "I almost always tell the cashier \"anywhere is fine.\" Turns out, if you do it politely they tend to give you a solid seat :)",
            "made me laugh because i was expecting it and still was funny as hell",
            "To be fair, I would get annoyed with this as well. Though I wouldn't get rude with the guy behind the register. It's not like he's making up the procedure.\n\nWhat I expect to when going to the theater I want the process to be a simple as this:\n\n* Hi, I want to watch movie X\n* Ok, that'll be X amount of money\n* Buy snacks at stand\n* Walk to the seating area, pick a free one, sit my ass down and enjoy the movie\n\nI don't want to spend 10 minutes at the register playing 20 questions with the cashier. I just want to watch a movie. The assigned seat thing is something I can live with, even though I don't really like it. \n\nI hate the whole spiels for membership cards or other \"opportunities\". Just ... no. It takes you 30 seconds to do for each customer, and you made the wait 20 minutes longer than it needed to be because you were doing the same spiel for the 50 people in front of me. Put whatever you want to offer on a sign which I can read while in line. If I'm interested, I'll ask. \n\nThankfully the theater I frequent still works the old way, with the option of buying your ticket online allowing you to skip the line at the register.\n\nMy post office on the other hand can get lost with their flipping credit card subscription offers...",
            "He just wanted to see a movie and you haven't even offered him a seat after two minutes of chit chat. I understand you have to say the things you say but it's not so bizarre for him to get frustrated that your management has made a simple purchase take many times longer than necessary. Imagine how quickly it could have gone:\n\nHim: I'd like to see Big Movie 2\n\nYou: What showing?\n\nHim: 2:00pm\n\nYou: Here's your ticket. Enjoy the show!\n\nI know it's hard, but don't take things personally.",
            "please tell me it was a sold out showing",
            "I support your pitch entirely and thank you for your courtesy. I often go to cinemas in advance to buy my ticket in order to make sure I get  good seat. It would piss me off if the assistant sold me a ticket \"for the next performance\" without asking. It would also piss HIM/HER off, because I'd be back in five minutes for an exchange. I also expect advice on where to sit and often ask to see a seating plan. As for the rewards program - you probably have to do that on the insistence of your employer, proper cinemagoers understand this.\n\nSo thanks for your courtesy and don't change the way you are.",
            "You know, the fact that theaters are starting to insist you pre-choose your seat is just one more reason I've been avoiding going. I have enough anxiety picking a seat in a dark hall where I can just plunk down and be done with it, I'm not doing it when I can't see where other people are sitting and there's someone staring at me.",
            "I love you.",
            "I can almost guarantee you that dork just sat where ever the hell he felt like it when he got into the auditorium.\n\nMost people in our area seem to despise the assigned seating and more or less refuse to use it as it’s intended.",
            "HOYTS cinemas out here doing God’s work",
            "Some people value a ticket at its full retail price. No need to be offended that he doesnt want to make that process 5 times longer.",
            "I think we've had numbered seats since like the 70s here.\n\nAnd who still stands in line and buys tickets from a clerk in 2019?",
            "I get why you acted like this but come in, all he wanted to do was buy a ticket for a movie and you're here playing 20 questions with him. You don't know what kind of person he is or what kind of day he had, probably a bad one, and this doesn't help.\n\n>I started my spiel with this guy when he interrupted and said ‘I’m not joining anything’. So I ask if he has any concession cards and he rolls his eyes and says ‘no, i just said I’m not joining anything’’ which wasn’t even what I had asked him\n\nYoud think after the first question you would have known not to ask another fucking question about a stupid program. \n\n>**At this point I’m getting annoyed cause I’m just trying to help the dude save money**\n\nThis sounds like something a corporate bigwig would think.",
            "It was a 2pm show in the middle of the week. I'm sure the theater was probably almost empty. Great malicious compliance, you really got him.",
            "Spoiler: he didn't sit in that seat.",
            "Oh my fucking GOD I also work at a theater and the showtime thing PISSES ME OFF SO MUCH. Same with ticket type. “One for Joker” Ok, which showtime?” “Now” [lets say it’s 5:45] “uh, ok, we have a 5:30, 6:00, 6:30, 7...” “6:30, DUH!” HOW THE FUCK AM I SUPPOSED TO KNOW THAT?! Or one person comes up and says “2 to Addams Family” I say “2 adults?” “What the fuck else would it be, do I look like a child to you?” GEE I DUNNO YOU DONT EXACTLY LOOK LIKE TWO PEOPLE GO DIE IN A FIRE YOU PIECE OF SHIT HOW HAVE YOU GOTTEN THIS FAR IN LIFE BEING SO RUDE TO PEOPLE?!",
            "I hate that new system. I took my son to see Toy Story, and paid online the night before. When it prompted me to pick my seats, I picked the best seats they had. Go the best evening after school, and when I go inside, someone is in our seats. No big deal. I just sat next to them. Then someone came in and said I was in there seat. So I take it my ticket, any day oh ok, and then turn to the people in my seat and ask them to move. They were pissed and didn't want to, but they did it because I wasn't sitting in their seats they offered. It happened to about five or six groups before the movie started.",
            "I dunno man I feel like this was uncalled for. Not everyone wants to give up their personal data and privacy to save a few bucks you know? There’s a reason the company does it yah? \n\nIn the future just minimize the questions and give him a decent seat, he’s saving both of you time. You don’t have to have the same interactions with everyone, you should be able to read what he wants yah?",
            "I kind of get why this is annoying for the customer. In the olden days, you could just buy a ticket like \"1 adult for Gone with the Wind\" hand over your nickel, get the ticket, walk away. All over in 30s or less. Now there's all this \"stuff\" you have deal with, and the up selling, and the thinking, and the talking.\n\nI mean, the obvious thing now is to buy online so you don't have to deal with people...",
            "Sounds like my father visited you. He‘s exactly that kind of idiot.",
            "The cinema I go to has assigned seating for every showing now. \n\nPart of me realy loves it because it stops all these one person gaps in packed screenings.\n\nThe other part of me hates it because I go on my own and have a realy specific seat that I like (right above the entrance against the wall)\n\nTo stop any confusion I went to every screen in the cinema and noted the seat number I liked for all 17 screens.",
            "Good on you. If I have any religion at all one of its major tenets is \"Thall shalt not make someone's already shitty job even shittier\". It's really not difficult to treat people like human beings.",
            "To be fair he probably just wanted to buy a ticket.",
            "You should have accidentally given him the price that it would have been with all the discounts, then said \"Oh wait, no sorry that's only for people that signed up for the free memberships.  Here's your total...\"",
            "You’d save yourself a lot of time and hassle if you just assume your customers want the most convenient solution. \n\nGuy wants to buy a ticket?\n\n1. “Our next showing is at 2pm. If you have our rewards program, you’ll save $$”\n\n2. “We have food. If you have a coupon, you’ll save $$. What would you like?”\n\n3. “Would you prefer to sit in the front or back of the theatre? What side of the theatre?”\n\nThen say thank you.\n\n\nI worked in retail for 8 years and I think just about anyone would tell you it’s crazy to feel entitled to respect. Just do your dang job, be nice, and move on. There’s no room for your ego here.",
            "I get what the other people are complaining about. It sucks to have a card for every store. It’s marketing, and that’s how it is now. Deal. \n\nThat said, I signed up for membership at the movie theater because I love movie theater popcorn. I get a free refill on large bags. So I eat the shit out my popcorn in the movie and then before I leave, I get more.",
            "Imagine getting annoyed at a person serving YOU and literally doing their job to SERVE YOU",
            "Every one here is jumping on op for trying too hard to sell rewards. But if I got a shitty sarcastic answer like \"a seat\" followed by him complaining that it's taking to long. He'd be sitting in the outside dumpster if it were an option.\n\nSome of you have never worked in the service industry and it shows.",
            "Okay, the guy was a jerk but seriously, nobody's interested in all the extra crap buying a ticket, and it's not like this guy's going to sit in his assigned seat anyhow. Plus malicious compliance like this just opens you up to complaints to your manager. My customer service practice was that as soon as someone got even slightly pissy I tried to get them out of my sight as soon as possible so that I'd never see or hear from them again.",
            "My God I love it.\n\nI worked in a cinema many years ago and our box office computers were slow. So I made a point of chatting with people to pass the time while the computers processed the payment and printed the tickets.\n\nOne lady got up to the window and started yelling at me for talking too much and taking too long and to just do my job. I said, “Ok ma’am. We’ll just wait on the computer then.” And I stared at her with that dead-inside smile all customer-facing employees develop as we waited, in silence, for the computer to do its thing. \n\nShe was super uncomfortable by the time the printer finally started to slowly creak out a ticket, which I passed through the window so fast she flinched, then bolted inside.\n\nEveryone in the line laughed, cheered, and applauded.",
            "So the dude repeatedly indicated he wasn't interested in the spiel and the other shit, just wanted to watch a movie, and after you utterly failed to pick up on the hints even you acknowledge he was giving you, you decide to fuck with him.\n\nGJ kid, enjoy working that concessions stand.",
            "Exactly where he deserved to sit.",
            "Brilliant, lol",
            "I hate this shit. You're just doing your job, and trying to help the customer out, and they're going to be dicks about it? That's what he gets.",
            "You: Front row as far to the side as possible in a 400 person cinema with a giant ass screen.\n\nEarth: That'll do.",
            "Wow.  You have ass screens",
            "Your system of questioning is flawed and not very customer friendly. I can understand how he got annoyed. \n\nThe seats where in the cinema he wants to sit is the most important question (after the time of the session). You can offer him your rewards programs before he has to pay, so near the end of the exchange. Then is the time where money is important for him, since he will be paying directly afterwards.\n\nBeing maliciously compliant with a disgruntled customer's requests when the reason for his bad mood can be found in your own behavior (or the setup of questioning as is dictated to you by your boss; I'm not blaming you alone) doesn't fit this sub as much in my opinion.",
            ">I’m just trying to help the dude save money\n\nFor some people the loyalty programs aren't worth the cost of tying their spending to their identity, and don't have particular reason to trust that _this_ vendor will actually protect their data. Sorry he was rude though; he deserved that seat.",
            "AMAZING. Movie theaters can be so pricey and you were literally just doing your job. Good for you!",
            "I mean, the dude just wanted a goddamn ticket. You were pretty annoying to be fair",
            "W",
            "[deleted]",
            "Maybe he just needed an alibi.",
            "Fully booked? He probably just moved",
            "we only have assigned seats here for certain movies and you have to buy your ticket online in advance\n\n i love the idea tho. being able to actually get a disabled seat i need without having to kick an able bodied group of mombies and kids out would be awesome",
            "Love it, my only question is whether the theater was full enough to actually make him sit in his assigned seat",
            "Would it kill you to be understanding and kind? I don’t go to movie theaters anymore because the price is outrageous, I had no idea you had to pick a seat now. I’m just asking you to be more patient and understanding.",
            "Considering his attitude I’m sure he sat wherever the fuck he wanted",
            "That's like the movie Bowfinger, where Steve Martin's character is seated front row to the leftmost seat during his movie premiere.",
            "he probably moved",
            "No way that dude stayed in that seat. He moved as soon as the previews started.",
            "lol that's pretty weird behaviour from the guy. Why would he just ask for a middle seat? Definitely deserved it ahaha",
            "Did he complain or react in any way when he discovered his seat?",
            "Unpopular opinion: why act so rude even if you’re annoyed?? Go to a different place. If nowhere else has what you like or does what you like, then I feel it’s a bit entitled to expect to go out and a minimum wage worker to just spare you the spiel and just somehow know you’d be annoyed. Either get used to it/get over it, or go somewhere else. A minimum wage worker doesn’t wanna tell you all that. And they can’t tell if you wanna hear about it or not till it comes out of their mouths. And by then it’s too late to take it back. \nAnd for me, I know the chain I’m in has you ask if you have xyz card then asks if you’d like to sign up after. And someone said they’d rather not ask and someone be irritated, than ask twice and someone be angry. But I’d rather angry because then it’s angry at what my manager told me to do and they won’t give me a verbal write up.",
            "You sound annoying."
        ]
    },
    {
        "post_id": "9mit98",
        "author": "TheUntitled1993",
        "title": "\"We all know you are faking being sick to avoid the class\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9mit98/we_all_know_you_are_faking_being_sick_to_avoid/",
        "score": 18795,
        "num_comments": 512,
        "created_utc": 1539032552.0,
        "selftext": "This happened to me while i was in elementary school. Our mrs. math teacher really hated my guts for no reason really. She would always find an excuse to lower my grades or blame me for something i didn't do. I was a pretty sick kid that had bad astma, dermatitis and was sickish in general. Thinking back, I think her hating me had a lot to do with that, as she felt i had \"special treatment and privileges\".\n\nOne day we were doing a test and i started feeling very bad. It came to the point of really needing to puke but i held it in because i knew she wouldn't believe me. Then i started shaking and kinda puked a bit in my mouth so i stood up and started to go towards the toilet (we had a rule that anybody who has to go to the toilet can do so without asking).\n\nShe ofcourse stopped me and told me to sit back down. I tried explaining but she wouldn't have it. One girl stood up for me and said something like \"he is really pale and shaking and sweating, i think he needs to go home\". That caused the teacher to go on a 5 minute rant how i'm a spoiled liar who didn't study for the test and now i'm trying to fool everybody and that i'm taking away their precious test time and they should hate me for that\" I said i really need to puke and she just scoffed saying \"You ain't going anywhere with your lies so you might as well do your imaginary puking here\". \n\nYeah... You can guess what happened next. \nNot sure if this is compliance because i couldn't hold it in anymore anyway but i was so happy while doing it.\nFirst i puked a bit trough my arm and then it all went out. Across her desk (grading book was ruined) and all over the floor. She tried to blame me saying that i \"threw up by force\" but the principal didn't buy it after the doctor examined me. Nothing special happened to her but she never bothered me again.",
        "permalink": "/r/MaliciousCompliance/comments/9mit98/we_all_know_you_are_faking_being_sick_to_avoid/",
        "comments": [
            "Yeah she had it coming.",
            "Teachers like her deserve all the vitriol they get.",
            "Damn I’m a teacher with the opposite problem, kid looks sick, acts sick, complains of being sick so I send them to the nurse to go home (honestly even if they’re taking they are set on not learning anything).\n\nNurse says “no one can come get them and they cannot stay here all day doing nothing...” \n\nNurse sends them back, I’m pissed. \n\nGawd Ellen you’re the nurse, at least you have a bed they can lay down in you bitch, why should they suffer in a cold ridged public school chair all day anxious they’re going to barf or shit themselves in front of their friends?! \n\nThey’re rarely faking, but even if they are something is wrong enough they need to pretend to be sick so someone will take care of them and I don’t mind- except I have 24 other students and no bed for them to lay down on and rest. \n\nThe damn nurse sends kids back to class, even during flu season... even with 102 fever. ",
            "I was once sick in maths class, I got up to go to the toilet but only made it as far as the class bin. The teacher sent me straight home. I felt a little bad for her as she had to clean the bin out, and I knew she would understand if I'd come back from the toilet and said I'd been sick.\n\nIf I'd have had a teacher like that, I'd have plastered the walls and everything she owns within striking distance",
            "I was excused from a middle school math class because I felt like puking. Another teacher stopped me in the hall and started lecturing me for not having a hall pass on me. I threw up all over the hallway floor. The teacher demanding a hall pass just shut their mouth and walked away. My math teacher had my personal belongings delivered to the office so I wouldn’t have to return to his classroom.",
            "Reminds me of year two, I had a grilled cheese for breakfast and then told my mum I didn’t feel well. She sent me to school. \n\nI told my teacher I didn’t feel well, she didn’t listen and told me to stay seated. \n\nI then threw up stinky grilled cheese vomit all over mine, and about three other kids desks and the floor. \n\nIf I was mum I wouldn’t have believed me either, the teacher though, I’m sure I looked pretty bad just before I yakked everywhere and I’m pretty sure I asked her two or three times to go to the bathroom. ",
            "Once I had missed two days of school with the flu I didn't want to miss anymore (I was always sick and my school had a limit on sick days) my parents told me if I couldn't make it they'd come get me. I went to the nurse she wouldn't even hear me out that I was sick just sent me back. I ended up going back next period she got all pissed for coming back I told her I was still sick and was getting over the flu. She yells that if I had the flu my temp would be 102 she finally checks it was like 100. She had to make a remark it wasn't the flu but I was sick and I did get sent home. I don't get why some people just assume kids are faking. ",
            "in high school i had an asshole math teacher who was generally more of a dick to the girls than the guys. i had to use the bathroom pass one day, and grabbed my backpack to go, and he stopped me and told me to put it back, and started going on about how i was gonna skip class and blah blah blah\n\nand i stood there and listened. and finally when he stopped i said “no. i keep my tampons in here. i need to change my tampon.”\n\nand he looked like he short circuited. the class burst out laughing and he let me go. he never questioned another girl who left for the bathroom with her bag in my class.",
            "Oh my god. When I was in year 5, we were at a school camp and doing some group excercises sitting in circles in a big gymnasium. The teacher supervising hated me mostly because of my older brother (a giant asshole to this day) who looked similar to me. I’m really feeling ill so I told her; she goes “no! Your brother just tried this same trick. Go back to your group”. So later we all assemble in lines to watch our group presentations. I puke all over about 10 kids, then more as I rush out the gym. I keep puking all the way to the bathrooms. \n\nAnyway I told my parents about this when they came to pick me up the next day and that teacher had nothing to do with me for the rest of my school year. I feel sorry for the other kids, though. ",
            "She was a terrible person. I'm glad she didn't find some way to take it out on you after. Maybe there is a ray of hope for her after all as a person?",
            "[deleted]",
            "[deleted]",
            "One day in sophmore year I'd felt sick since third period, but knew I'd have to tough it out, because I had to ride the bus home anyways. I nearly made it, too, but five minutes before the end of my last period, I felt it coming on. Could I make it the next five minutes?\n\nMy hesitation did me in. It was inevitable at this point. I made it to the door of the class room, and uttered out, \"I'm going to puke,\" to my teacher. And then I took two steps out the classroom door, and vomitted along the hallway floor.",
            "I'm a teacher and I love it. But it really kills me that there are so many c**** like the one you had who absolutely can damage Kids for Life. Kudos to you for getting it all over her grade book, that would be hours of work for her to recoup.",
            "I had horrible health my 3rd grade year. Ended up having my tonsils and adenoids removed after the year was over. My teacher told my mother I was faking ALL of it, including the CT scans of my head that showed all my sinuses were plugged. ",
            "In the third grade I threw up in the hallway and since the janitor wasn't in the lunchlady made me clean it up myself. Was pretty awful since I continued to throw up as I was cleaning it up. Luckily, a friend of mine was with me and supplied me with plenty of napkins, whilst the lunch lady just stood there and watched. ",
            "Why wasn't she fired??? ",
            "[deleted]",
            "I got yelled at for sneezing by my 2nd grade assistant teacher... I don’t remember what she said anymore, but I now wish I could’ve sneezed in her face. ",
            "I really don't get this level of suspicion with elementary kids. They aren't smart enough to decieve you yet. A sick looking elementary school kid is sick. \n\nThough this story puts some salt into old wounds: when I was eight and on holiday with my cousins family I fell of some playground thing and hurt my arm badly. Now it hurt like shit and it felt numb and hard to move. My aunt kept asking if I needed to go the hospital but I didn't know if I needed to. I told her I didn't know - but maybe that was the right thing to do? So my aunt and uncle drove me a couple kilometers to the next hospital where they took some images and came to the conclusion that it was 'nothing'. Just to be sure the doctor asked me if I was maybe a little bit whiney and well, that was true, I've been told I was whiney before so I said 'yeah maybe'. This made my aunt really mad and passive aggressive. For the rest of the week she wouldn't talk to me at all if she didn't have. Granted, all of this was in Germany and I was insured; she literally just cut me for \"making her take me to the hospital\". \n\nThe incident really soured our relationship, but it helped me appreciate my mother more: she never deligates responsibility shes uncomfortable with downwards the food chain like a little bitch. ",
            "I once had a teacher tell me that I needed to be louder when I presented but my throat was physically impossible of it. Later found out I had a birth defect. ",
            "Similar situation with unhappy ending: \n\nHad trouble breathing. Felt unwell all the time. Teacher thought I was faking. Principal thought I was faking. Mom thought I was faking. Dr said I didn’t have asthma and I was fine. Found out 20 years later I have an anxiety disorder and those “breathing issues” were panic attacks because I was constantly bullied. Teacher was one of those guys who wanted to be “cool” so conveniently never saw anything. ",
            "Our teacher was really pissed for some reason one day and said that no one was allowed to leave class for any reason. The real wimpy kid ended up pissing his pants, and the only thing the teacher could say was a lame \"why didn't you tell me?\"",
            "Never thought I would say this to anyone but I am so happy you puked. ",
            "I called in sick one time on a Monday morning. My boss insisted I come in and that I would let go early. I was let go very early because I puked at her feet the literal second I walked in. Turns out I had rotavirus. \n\nThe next week I was the only teacher there. The other teachers out sick had...rotavirus",
            "I have to stay home sick from school a lot.  I always feel bad emailing professors that I'm sick, they probably think I'm lying, but I have IBS and I feel bad real often.  ",
            "My brother had a teacher like this; he had dysgraphia growing up, and had an IEP.  Teacher assumed IEP == mentally retarded, could not accept that he was demonstrably the smartest person in the room (IQ testing).  She refused to accommodate him at all, basically saying that he was either too dumb for her to bother with, or if he was as smart as testing revealed he could deal with it.  Miserable person.",
            "I had a first grade teacher who was very strict about asking to go to the bathroom and I was the kind of kid who incessantly asked questions, so she started ignoring me when I had my hand up. Naturally I peed my pants. That's life.\n\nFast forward to the first day of high school. I'm the new kid so I know basically no one, and I meet this girl, and wouldn't you know it, but she recognized me, was in that class and remembered that.",
            "Huh, small world. I had a similar thing happen when I was a kid. 1st grade teacher decided to make me the class punching bag to blow off steam about being moved to a new school the year I had her class. Culminated in the school field day at the end of the year, where she refused to let me go to the water fountain at all for the whole day, ostensibly to punish me for forgetting to bring a water bottle (note: I was the child of an overworked single mother; also, I was like freaking seven). After mandatory exercise in 90 something degree weather for a full school day, I'm feeling queasy and ask to be allowed to visit the bathroom. Teacher berates me for being disruptive and gets right in my face about it to really lay into me, saying all sorts of witchy things about my character and what it indicates about my \"upbringing.\" After a few minutes of desperately trying to keep things together as she goes on and on, first grade me gives the jerk a free bile and vomit facial in front of the whole class. More than 20 years later I can still remember the look on her face.  \n\n\nWeirdest thing was, the next year, she made a very visible effort to treat me like I was some former beloved student. My guess is the school district was watching her due to her bullying tendencies and she wanted to prove her victims actually liked her. I certainly wasn't the only student she had that harbored less than pleasant memories regarding her.",
            "I remember once when I was in 7th grade, i had messed my knee up pretty bad and torn some ligaments. My doctor advised me to stay home for up to two weeks (my middle school was packed and hard to get around) and to get a homework package of what I would miss while I stayed home. When my mum called my teacher to arrange the homework package her response was “I don’t believe Ladybugs hurt, you’ll have to come in and show me before I give you the homework.” She really had it out for me for some reason and I had to hobble in with my swollen knee and crutches just so I could prove to her I was hurt and not fall behind in school. ",
            "[deleted]",
            "Man, that sucks... but sounds like she got the rough end of that one.\n\nI have a similar story... I was the youngest and smallest kid (skipped 1st grade), and had several elementary school teachers who seemed to resent that.  My 4th grade teacher was one of them. Once, during an hours-long standardized test, I finished a section early and asked to go to the bathroom. She addressed the class and said, \"\\[my name\\] needs to learn that racing through a test doesn't get him special treatment\" and made me sit back down. Even afterward, during the break, I had to stay at my desk, as a 'lesson' or something. I finished the next section of the test early as well and got up to ask to pee again, but was told to sit back down. I held it as long as I could, but eventually pissed my pants.\n\nFinally we got let out for lunch, and I went to the bathroom and was in there for a long time, trying to dry my pants (I was mortified that all the other bigger / older kids would see I'd pissed myself). The teacher came in and got me eventually, and took me to the principal's office for dawdling in the bathroom and \"making a mess\".\n\nThe principal took me into the office, asked me what had happened, and then called my mom to ask her to bring me some clean clothes. The principal apologized to both of us and privately spoke with my mom. My mom told me later that the principal was going to have the teacher counseled and taken off the gifted program, because she'd been treating a some kids from other groups poorly as well. She was having marriage problems or something, and taking it out on her students. Anyway, we got a really nice new teacher who was way better, and she was the first teacher who helped me realize school could be enjoyable / learning could be fun.",
            "My sister once threw up under her desk when denied. The girl next to her started crying.",
            "[deleted]",
            "I’m sure she really hated your guts after she saw what was inside them",
            "[deleted]",
            "Elementary teachers have ZERO reason not to let a kid go to the bathroom\n\nHigh school: They might want to go hang out or skip class\n\nMiddle school: They might want to use their phone\n\nElementary: They will shit themselves if I don't let them go",
            "I never really vomited much, but there was this one time where I turned it up to 11. I was like six or something.\n\nBasically, my mom was tickling me. I was on her shoulders and she was squeezing my thighs(I was very ticklish there). I was laughing so hard. I was laughing so hard, I discovered there is, in fact, a point at which you are laughing too hard. That's when I sneezed and it just messed something up.\n\nThink about the physics of this. My mouth was engaged in the action of laughing very hard. The contents of my stomach physically couldn't exit through my mouth. Instead, they were redirected through my nose. What was below my nose? My mom. I sneeze-vomited right onto her hair. This wasn't a small vomit either. This was a massive one. After my mom cleaned up she put me in front of the toilet in case I vomited again. After a while I felt that it was unlikely that I would vomit again. Boy was I wrong. The moment I close the toiled I immediately vomit all over the cover.",
            "Similar thing happened to me, only I was one of those students that all the teachers liked because I was quiet and got good grades. So my teacher sends me to the nurse because I tell her I don't feel good, and then I can't remember why but the nurse eventually sends me up to sit on the bench in the hallway next to the principals office to wait. The admin assistant in the office wouldn't call my parents to come get me because it was only a half hour before school let out and for some reason thought I was faking. After another 15 min I go in and tell her that I feel really bad, she tells me it's almost the end of the day and to just wait. So a couple min later I throw up all over the hallway. And then the principal comes back and steps right in it. Next time I was sick they let me go home immediately.",
            "Both my kindergarten teacher and my first grade teacher made me throw up. One day in kindergarten I didn't want to finish my lunch but my teacher, crotchety old lady, thought I just wanted to go play. So she made me stand in the doorway and finish my sandwich. This wasn't the first time she forced me to eat all my food before I could leave, but this time halfway through my sandwich, I started throwing up everywhere.\n\nSimilar deal in first grade. I said I was done eating but I guess my teacher, who is already bullying me, felt that I didn't eat enough food. So she made me pack her way and told me that I could finish it later for a snack. We went out to recess then came back in. Sometime later I could feel my stomach rumbling and I thought it must be hunger so I asked if I could eat my apple. She said no I could eat my sandwich. I took one bite and hurled all over my desk and the floor. My parents were there almost immediately to pick me up, and according to them they were pissed as hell at her. Turns out I had strep or the flu, I was actually pretty sick.",
            "> She tried to blame me saying that i \"threw up by force\" but the principle didn't buy it after the doctor examined me. Nothing special happened to her but she never bothered me again.\n\nI'm about positive something did happen. She had a proper talking down to, and was told that if she allowed this to happen again, she wouldn't last.",
            "My nurse in junior high was the same. Everytime I went to her office she gave me a little plastic cup of water and sent me back to class. One day I came back an hour later with a trash can in my arms and covered in puke. ",
            "Yeah, something similar happened in my 1st grade class way back when. \nSickly kid ate some popcorn and told the teacher he wasn’t feeling well. She told him to go sit down, but he ended up getting up a couple minutes later to ask to go to the nurse. As she was in the middle of telling him no, he threw up half digested popcorn all over her shoes.\n\nWe got to have a long recess after that while the janitors moped up the vomit.",
            "[deleted]",
            "\"HE THREW UP BY FORCE\"\n\nBitch what? How do you do it by force",
            "If an elementary student asks to use the bathroom, it's not a question.  They're gonna go one way or the other, the only uncertainty is place",
            "I too had terrible asthma as a child, and this only caused issues with one teacher, who much like yours didn’t believe my asthma was as bad as it was. \n\nIt took more than one trip in an ambulance to get her to believe that it was serious. All three trips that were from the condition were brought on from her class. \n\nThe final time was brought on purely by stress, from getting sent to the office for not participating, and the only reason was my parents finally heard what was going on with the teacher they tore her a new one. \n\nShe was convinced I was faking to get free rides in an ambulance and miss classes, despite being a very involved student in literally every other class than gym. ",
            "You done messed up, A A Ron!",
            "Looks like Johnny Johnny was not telling no lies ",
            "I remember when I was young I felt really sick but my mam wasn't having it and took me into school anyway. All day I sat alone on the carpet trying not to throw up, so I get home and as soon as I open my bedroom door I puked all over my bedroom carpet and she had to buy a new one because it was ruined\n\n&#x200B;\n\nedit- Not on purpose, I didn't wait til then just to throw up on my carpet. I just couldn't hold it anymore",
            "I hope she was axcused from her position.",
            "My elementary school had a music teacher who kicked 2 kids in the face (seperate occasions) and managed to keep her job it was wild",
            "there was  a student in my 7th grade class who had a similar problem in that he would always find a way to skip class and one day he was complaining that his side hurt but teacher would not let him go to the nurse so during lunch he went and did not come back, the next day he was also absent.  turns out he was having an appendicitis and could have died.",
            "I wasn't sick often as a child but one monday morning in the 4th grade, I  was not feeling well and kept putting my head down. I had taco bell for dinner saturday night, and knew something was wrong. \n\nTeacher kept telling me to keep my head up as i would repeatedly just bury my face in crossed arms on my desk because it just felt better.\n\n Long story short, i end up throwing up what was a vile green sludgey vomit all over the class. When i threw up, the kid next to me threw up and we ended up having 5-6 kids throw up all over desks and somewhat over each other. \n\nI remembered thinking \"I F\\*\\*\\*ING TOLD YOU SO\" in the middle of said vomit fest. 'Twas the most LIT 1st block of her life.",
            "Should have thrown up *on* her.",
            "I’ve had bad migraines my whole life starting in elementary school. I used to have to go to the nurse almost every day because of them. I was seeing several doctors and neurologists for them and had medication for extreme migraines. \n\nWell, the school nurse, who was married to the local town doctor thought I just used them as an excuse to take an hour nap almost every day (full disclosure, sometimes I did, but who wouldn’t?). So she told the assistant principal of her suspicions. One day while I was in the office for a headache the principal comes up to me, wraps his arm around me, squeezed my shoulder really hard and says he doesn’t want to hear anymore about these “headaches.” As he’s doing this my mom walks in and catches him. \n\nTurns out, the superintendent of the school corporation was my mom’s science teacher in high school. All throughout high school he would pin her to his desk and try to force her to kiss him or he wouldn’t let her leave for her next class. He was also sleeping with at least one of the female students at the time.  So my mom went to said superintendent and said that if this principal or nurse ever bothered me about my headaches again, she would tell EVERYBODY what he did to her in high school. \n\nThey never said anything about my headaches after that. ",
            "Imagine being in that class, watching the teacher treat OP like shit everyday. Then one day she takes it too far calls OP a liar and insults them. You wish, hope, dream that OP will blowchucks all over her. \n\nThe mad lad does it. The angels sing.",
            "Fuck you my 3rd grade teacher who I don’t even remember her name and I am so glad I forgot it. You were a bitch!",
            "It's over Anakin I have the puking ground\n",
            "Last year when I was a junior in high school some student shut on a teachers desk literally. He just squatted and shitted wtf",
            "I have a very vivid memory of the exact same thing happening to me in first grade. \nThrew up all over the teachers shoes after she accused me of trying to get out of participating in some stupid activity. I remember how amazing that projectile vomit felt... for like a moment.",
            "She got off easy, I would’ve thrown up on the bitch. ",
            "r/boneappletea",
            "This one terrible math teacher in my old middle school wouldn't let my friend go to the nurse because it was first period of the day. My friend promptly threw up everywhere, and the teacher made us all stay at our puke covered desks for 42 minutes",
            "She probably hated you after hearing the prophecy on the day of your birth that you would be destined to puke on her. ",
            "Are you a pretty sick adult? Or did you grow out of all of that?",
            "Are you sure it was your math teacher and not your english teacher?",
            "She definitely deserves to be fired because she obviously didn’t teach you spelling or grammar!",
            "I think your English teacher should have been a little more concerned...",
            "I really wish creeps like would get what they deserve.",
            "Kudos on remembering elementary school.  I barely remember hs",
            "Puke right on the desk. Puke right in her face if necessary. Then watch as she takes a leave of absence. Karma served.",
            "We give so much respect to teachers, and yet there are individuals like these who really are a disgrace to the teaching community.",
            "Having personal vendettas like that should be grounds for firing in teachers",
            "1 sick student + 1 dumbass teacher = a whole lotta mess",
            "This reminds me of the entirety of Elementary School where I vomited a lot. For most of 4th grade it was on purpose though because my teacher was a bitch, and I'm super lucky I never had her when she moved to the middle school.",
            "“Threw up by force”\n\n*looks off dramatically into binary sunset*",
            "Oh man you missed a perfect opportunity to puke in someone's face.",
            "That's the bs about teachers: even if they bully you to the extreme, nothing happens! My class had a teacher (I didn't take the course) that would tell the girls that if they don't want to do their work they should throw themselves under a bus, pointing at the nearest highway. After we collectively told our class teacher she just waived it off saying that the other teacher is a special kind of person.",
            "few things sicken me more than a teacher with an obvious vendetta against a kid; especially in elementary school",
            "> elementary school\n\nJesus Christ, what a fucking awful woman",
            "This story made my mother-bear twitchy. ",
            "Same thing happened to me in third grade. They had to move the class to another room because there was puke eeeeeeverywhere.\n\nTurned out I had a food allergy and actually was feeling sick on a lot of mornings, buncha jerks called me a liar for months.",
            "When I was in kindergarten, my mom got a letter saying I missed too much class. Now, I was already counting to 100, knew how to read, etc, so kindergarten was basically a free daycare for my parents. But they were threatening to hold me back anyway because I had missed too many days of school \n\nWhat really pissed my mom off was that this letter was signed and sent by the principal who had taken six months off to get surgery on her foot.\n\nSo a week or so after we got this letter, I felt sick and my mom said I had to go to school anyway because the school said so. Less than 10 minutes into class, I threw up all over the floor and had to go sit in the nurses office until my mom came to get me (this was pre-cell phones). ",
            "I would have walked up to here face, tried to talk to her, knowing it'd make me puke and then say she was accusing me of being a liar and I was trying to defend myself. What a cunt. My blood is boiling for you..",
            "> She ofcourse stopped me and told me to sit back down. I tried explaining but she wouldn't have it.\n\nIt sucks that this happened to you, and shit like this is why I teach my kids that if they really need to leave the classroom -- they're sick or hurt or have a bathroom emergency -- they don't have to listen if the teacher tells them not to leave. Just go. They aren't allowed to physically prevent you, and we can deal with the consequences later, together.  The only exception is when the school is in emergency mode (e.g. tornado emergency), where it might be really unsafe to leave the room.",
            "Holy shit. Pretty much the exact same thing happened to me when I was 8. Was dicking around with a friend in class, and announced I didn't feel well 5 minutes later. My teacher didn't believe me (can't blame her though, I was dicking around just before that after all), and I ended up covering my desk in puke.",
            "My bitch of a math teacher used to tell me I'd grow up to be a garbage man. I'm sitting in my law school classroom right now, last year before I become a lawyer.",
            "What a cunt",
            "I had something similar but i just had to pee. Pissed my pants and ruined my teachers shoes. She never liked me cause my family is muslim.",
            "I had something similar but i just had to pee. Pissed my pants and ruined my teachers shoes. She never liked me cause my family is muslim.",
            "Sounds like a right old cowbag, glad she gave you no more trouble.\n\n  \nI wish I threw up on my language teacher, she was scum that gave me detentions all the time for no reason (I was a kid that had no friends in that class and was the kind that worked hard at school and never got into trouble so kids found it hilarious I kept getting detentions).\n\nShe even kept me back late so i'd miss the bus telling me shit that made me never feel confident in class again. Went from a Hermione to a Neville in a space of a few months.",
            "I actually had a teacher that also hated me in elementary school for what seemed like no reason. I was diagnosed with diabetes and was in the hospital for what seemed like a week or more, followed by appointments about 2 hours away to the nearest pediatric endocrinologist. When I finally return to school my teacher asks where the book report that was assigned the last day I was at school was. Obviously being sick and having many other concerns I didn't do any homework at all. She gave me a 0 and basically said I had no excuse not to have it done.",
            ">She tried to blame me saying that i \"threw up by force\" but the principal didn't buy it after the doctor examined me.\n\nEvery opportunity thereafter, I'd throw up on her by force, then feign innocence.",
            "As someone who has two students who are battling cancer (and thus get very ill from the chemo) I could never imagine acting like this teacher.",
            "And then you woke up ",
            "Are you sure she needed an “axcuse” to lower your grade?",
            "Principal - the person in charge at your school\n\nPrinciple - a different thing\n\nNow you know.",
            "Did you just day axcuse?",
            "Yeah I'll go with \"shit that never happens for 300\"",
            ">Nothing special happened to her but she never bothered me again.\n\n\nPretty sure this means she got a stern talking to lol",
            "Should’ve puked on her. Sorry for your trouble smh.",
            "Excuse* ",
            "Love this story. I have to correct you tho, sorry not trying to be a dick. You said a girl stood up to you. That makes it sound like she's helping the teacher. It should be she stood up for you. Sorry, anyway love this cuz I basically did the same thing when I was in elementary school",
            "[deleted]",
            "The only way this could have been better is if some of it got on her.",
            "Oh man, that’s very satisfying to read. I hope you got at least a pit of vomit on her. ",
            "Should have vomitted straight into her purse/bag after ruining the gradebook tbh. What a cunt.",
            "Omg something similar happened to me in Kindergarten. Fuck you, Mrs. Johnson. ",
            "I'd have given her a new asshole if you were my child. Absolutely horrible. ",
            "For some reason I want that to happen to my teacher right now.",
            "How the hell does one throw up by force? And even if they do, how about letting them go to the bathroom *as they requested* yeah that's a hard sell. ",
            "I had a similar story in elementary school, except I really needed to *pee*... ",
            "I like to think you completely destroyed all records of the grades up to that point in the semester. ",
            "Similar thing happened to me but I hit her new hiking boots and two bullies instead. ",
            "What an asshole. I'm glad you barfed on her stuff. You should have barfed on her.",
            "Should have puked all over her, the chair, computer...just her entire life in general.",
            "I'm imagining an exorcist style scene, was your head rotating hen it happened??",
            "What a fucking cunt. I had a math teacher like that too, an atrocious piece of shit.",
            "Oh my... that was horrible for you.",
            "“Threw up by force” lmao why am I not surprised. These people junts CANNOT be wrong ",
            "Deserved.",
            "\"Sucks to your assmar!\"",
            "What a fucking cunt",
            "In a similar vein, there are a lot of kids who pee themselves on purpose, like at any given elementary school there's at least one that is notorious for doing it because they aren't getting their way.",
            "How didn't this have some sort of consequences?",
            "Nicely done!",
            "Hope she got fired",
            "She brought that on herself.",
            "I did this to my dad who insisted I couldn't still be ill and forced me to eat a whole meal.",
            "Should have aimed for her. ",
            "She tried to get the class to bully you...... I hope vomit landed in her mouth.",
            "I woulda been biled up.",
            "Damn...was hoping you puked in that bitches mouth. But still sweet revenge.",
            "Geez. What a fucking cunt. I hate ppl like that...",
            "Not sure if r/maliciouscompliance or r/pettyrevenge but a good read nonetheless",
            "In fifth grade broke my arm in PE. I tripped while running and when I put my arms out to catch my fall, I felt at least two fingers bend the wrong way. I didn't know if it was broken but I could tell from the pain something was wrong. I told the coach I needed to see the nurse and her professional medical opinion was, \"Oh it's just sore, you'll be fine in a few hours,\" so neither the nurse or my parents were called, and I continued on to writing class and with what was later learned to be three broken bones. And to end it all, when I finally came back to class, one of the other students said it was \"a baby injury.\"",
            "Sick story, dude. ",
            "Some teachers are just assholes I had a teacher like that, I would get in trouble for doing something 3 other kids were also doing, but they wouldn’t get in trouble for the same thing.",
            "Was it projectile?",
            "Too bad you didn’t power puke in her face. She was being an ass. Have you seen her since and told her what a piece of crap she was?",
            "When I was in elementary school we were practicing for a play and we had this sort of dance thing we had to practice. In the middle of it I start weezing (asthma) and I ask to go to the nurse. She says im faking it, but I dont relent and eventually she has the nurse come to the music room. Nurse just says, \"Yep this is the time he usually comes in and takes his inhaler\" Then we go to the nurses office. Basically the only thing I remember about my elementary music teacher.",
            "Reminds me of third grade where a group of 7 boys threw me to the ground and beat me for 20 minutes for daring to defend a girl from them tying her up with jump ropes. And then because she hated me the hall duty lied and got me suspended for a week when she told the principal I was fighting with weapons...the boys who beat me had no punishment.",
            "What the fuck is throwing up by force?",
            "Huh. I had almost the same experience, except it wasn't during a test. Pretty sure they make those teachers on an assembly line. ",
            "My 1st grade teacher would always emergency brake stop the class and call me out for picking my nose. I don't know how this relates but that old hags shaming needs to be public. I was just a child. Mrs. Stanley for all those who are cursing her under your breath... the smell of old mothballs still lingers in the back of my nose you crusty bitch. ",
            "What a cunt.",
            "I wish you acidpied her across the face. Burn that make-up away to reveal her to be the witch she truly is.",
            "I had something similar but i just had to pee. Pissed my pants and ruined my teachers shoes. She never liked me cause my family is muslim.",
            "\\> axcuse\n\n&#x200B;\n\n\\> astma\n\n&#x200B;\n\n\\> i\n\n&#x200B;\n\nYou probably should have paid some heed in junior high and high school.",
            "You were lucky she didn't respond in kind\n\nhttps://www.youtube.com/watch?v=UVBlWWQszeI",
            "> You might as well do your imaginary puking here.\n\nOh, she got what she asked for. Just not imaginary.",
            "Who the fuck hates people just because they get special treatment? Surely it must have crossed her kind that maybe, I dunno, some people have special treatment for a reason?",
            "Dean Vernon Wormer-ed her!",
            "Hoo boy. I had something similar happen. In 1st grade a kid was out with chicken pox. He came back and later that day I was feeling off. I had a couple red spots on my arms that were itchy. I asked to go to the nurse saying I thought I might have chicken pox. I got a 5 minute tirade on how I was a faker and just looking for an excuse to leave and how I wasn't going anywhere. That night my mum brought me to the doc and low and behold I had chicken pox. I was *pissed*. ",
            "I automatically downvote any post about any shitty teachers where OP can't spell principal correctly. You played yourself.",
            "Shame she wasn't fired, banned from ever teaching, and jailed for a year for emotional abuse of a child.",
            "I wish you puked on her.",
            "I wanted you to puke all over HER.\n\nYou disappointed us OP.",
            "> One girl stood up to me \n\nShe stood up for you, not to you",
            "[deleted]",
            "Did you throw up on her at all?",
            "She was either a narcissist and/or one of those people that can’t handle sickness. How can you be a teacher and not expect sickness from children? Jeez. Really sorry you had to go through this.",
            "\"Nothing special happened to her\" seriously? Bitch should have been fired.",
            "That's called harrasment or mobbing. And usually she is the one that will end up in trouble if someone could just report it. \n\nOf course if this repeats. Remember that those teachers teach hundreds of kids and she maybe used to them faking stuff.\n\nAlso what is happening to you maybe stress related.",
            "I still think you should have puked right smack in her face ",
            "Maybe your English teacher should have been harder on you. If they were maybe you would be able to write like an adult."
        ]
    },
    {
        "post_id": "vr7mgr",
        "author": "kissmegoodbi",
        "title": "“You can’t be sick for that long, bring her back to school”",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vr7mgr/you_cant_be_sick_for_that_long_bring_her_back_to/",
        "score": 18787,
        "num_comments": 971,
        "created_utc": 1656941850.0,
        "selftext": "This happened when I was in elementary school but the compliance was my moms. I got whooping cough which has a life span of 100 days. We got a doctors note from my school and everyone seemed fine with it except the main office administrator who was constantly calling my mom to bug her about when I was coming back.\n\nAbout a month in she calls my mom and tells her it’s impossible I’ve been sick for this long and if I’m not in school on Monday she’s calling social services. Keep in mind at this point I can barely lift my head, I sound like darth Vader and every few minutes I start coughing like I’m doing an impression of a goose fighting a Toyota. \n\nMy mom was so sick of this shit that she put a mask on me and took me to school in a taxi. She practically had to drag me to my class and didn’t even bother leaving. I got sent home before the bell even rang. \n\nBecause of school policy I was sent to the office and had to be signed out which meant nasty admin lady got to see exactly how miserable and sick I was. She then had the nerve to ask me how could my mom even consider sending me to school. Unfortunately for her my mom just to walk up a flight of stairs to come get me (because she knew what the hell was gonna happen). She signed me out and let the admin lady know that I would cough on anyone who thought I wasn’t really sick.\n\nEDIT: because lots of people are asking about vaccinations. I’m not in the US, I’ve jut googled it and it’s not standard here to give the vaccine to children under 18. I think it may be something they do for pregnant moms but we immigrated and my mom got her pre-natal care at a very small under funded hospital. My mom was super on top of all my vaccinations. \n\nAlso to the people commenting and messaging me to say my mom is a terrible person/parent. She was effectively the sole parent to two kids. At the point this story was happening I had been extremely ill and she was at her wits end. She worked full time and didn’t drive which made getting me to the doctor already really hard without my school threatening CPS on her. She did her best to make sure I didn’t breathe on anyone or even go near them. Worth mentioning there were NO other cases at my school, before or after.",
        "permalink": "/r/MaliciousCompliance/comments/vr7mgr/you_cant_be_sick_for_that_long_bring_her_back_to/",
        "comments": [
            "I caught pertussis as an adult (right before the booster recommendation came out) from my son, and since he was more recently vaccinated and lucky, it was just an awful cold for him. It was longer than 21 days for him, btw. \n\nFor me, it was months. I broke two ribs coughing. It was horrible.",
            "I had a PE teacher that didn’t believe my asthma would stop me from running because his asthma was well controlled he could run.\n\nSo I collapsed with a major asthma attack while he’s forcing me to keeping running.\n\nGood teacher climbed out of a window to rush me their inhaler (I was using a rotahaler and ran out of capsules given how many I’d used that day and they rammed their puffer in my mouth and had me take multiple puffs which probably saved my life, worse attack I’d had up to that point).  They put in a complaint about the PE teacher.\n\nMy Doctor complained to the school, pointing out that they may have to take it further.\n\nMy mother (all 5 foot of her) went up the school, which had a parents evening that night, and grabbed the (part time rugby player) teacher by his tie and collar and threatened to deck him if ever ignored my asthma again.  Left him shaking and the school wrote her a letter threatening police action if she repeated her actions again.\n\nPE Teacher was gone from school a month later (not the only complaint, and there was not a pupil who missed him).",
            "In my first grade year we had first chicken pox, then 2 months later measles, then 4 months later mumps run through our school. This was in 68. Mumps was the worst. \n\nIt made me a firm believer in vaccines.",
            "Not the same exactly but shortly after my dad died (I was out of school for 2 weeks; one week while my father was in hospice at our home, the second after he had passed away).....\n\nI had a PE teacher reprimand me for my \"lack of motivation\" when I returned, he even threatened to call my father.....who at that point was probably in the process of being cremated.",
            "I was fully vaxxed as a kid but still got a ‘mild’ case of whooping cough aged 3 or so (and scarlet fever when I was 7- have discovered immune system probs as an adult). I was sick for weeks and have vivid memories of how sick I was and that terrible cough.\nPoint being, this happened in 1982, I was vaxxed in 79. Mum remembers doctors reassuring her that my vax still gave me some protection and that Australia thought they were close to herd immunity- but we’d been traveling in semi-remote areas, so it was likely vaccine rates weren’t as high as they could/should have been.",
            "Well played mom !\n\n&#x200B;\n\nI remember I was 16 or 17, I had something that lasted around 5 months. Whenever I'd do something which needed the slightiest breathing (sports, running to catch the bus, laughing, you got it), I would cough for at least 15 min. I was then a sport addict, I was really on my nerves not being able to do anything.\n\n&#x200B;\n\nBut my sport teacher stated that I was \"faking it to dodge volley-ball lessons\". I hated (and still hate) playing volley-ball, but man I can't have my 20h badminton a week, and you think I'm faking it ? I have a medical note, but my doctor sides with me ? Ok go on then.\n\n&#x200B;\n\nI showed up next session with my sports clothes, and started giving the best I could. I was awful at it, sending the ball anywhere but in the field, but running as never, catching and playing everything. Then the cough started, like big deep cough, the one who hurts deep inside the lungs. I had to sit I couldn't stand anymore. My teacher, who at first thought he was right, started panicking when I started ejecting some smalls blood drops. He told me to calm down, asked others players to get the nurse.\n\n&#x200B;\n\nI guess it cost me around 4 additional healing weeks, but definitely worth it.",
            "I developed asthma at a yr old but since it was the early 70s , drs were still stupid and told my parents it was a cold. As a result, I was the fragile little kid in school who caught everything moving. Had constant so called colds, lung infections, bronchitis. I was missing about a week of school every month. Lol it was so bad, my dr at the time would ask me what flavour medicine I wanted - banana or strawberry. Well I had yellow last time so I’ll have pink this week haha. Fortunately, I grew up in a small town where the teachers all knew me so nobody commented on my absences",
            "But.... surely whooping cough is a notifiable infectious disease wherever you live? It's illegal to have a kid at school with whooping cough",
            "PSA: *everyone* should get a TDaP (tetanus, diphtheria, and pertussis) vaccine *every* ten years.\n\nETA. Pregnant people are the exception to this in that they'll need a dose even if it hasn't been ten years since their last.",
            "For all the people that thought whooping cough was gone....you may have heard of it as Pertussis. The infection itself doesn't last for 100 days but the cough can last for months. You are infectious for 1-2 weeks after symptoms appearing and during the 1-3 weeks leading up to the symptoms so roughly a month of being infectious but you don't know you have it for half of that time.\n\nThe bacteria actively damages the cells in your throat and lungs that move mucous so you end up coughing for months until the cells work again, It is particularly deadly for infants as they don't have the strength to clear the mucous and also have trouble sucking due to weakness and general illness.  They don't get the cough as much but have periods of not breathing or slow heart rate.  \n\nSince babies don't get the vaccine for 2 months, it is very important to breastfeed to get those antibodies in the colostrum. Most hospitals are vaxxing new moms before they leave to go home to help decrease the risks of pertussis.  Adults are getting  Pertussis because  the vaccine antibodies decrease with age. \n\nIf you have a newborn, please urge all grandparents or anyone who may be around your baby to go get the pertussis vaccine if they haven't had it in last 10 years.",
            "I had pertussis in my second year of University. I had zero clue you had to get a further booster at 18. Despite annual checkups with my family doctor, no one ever thought to tell me I needed my immunizations updated.\n\nI was sick for ages, infected my then boyfriend (who was able to take the antibiotics early enough to prevent serious illness because we knew what he had because of me, he was only sick a few days), had a bunch of chest x-rays because they didn't initially believe it might be pertussis, missed a load of classes, and couldn't return to my part-time job without a clean health panel which I couldn't afford because I was a poor student *before* contracting pertussis and had been out of work for over 3 months by the time I stopped hacking my lungs up.\n\nI'm going to put this out there, just in case people don't already know this and no one else has already posted this. This is from Health Canada:\n\n**Routine pertussis immunization of infants, children and adolescents:**\n\nDTaP-IPV-Hib-containing vaccine should be provided at 2, 4, 6 and 12 to 23 months of age (generally given at 18 months of age), followed by a booster dose of either DTaP-IPV or Tdap-IPV vaccine at 4 to 6 years of age (school entry) and a booster dose of Tdap vaccine at 14 to 16 years of age.\n\n**Routine pertussis immunization of adults:**\n\none dose of Tdap vaccine should be provided to all adults 18 years of age and older. One dose of Tdap vaccine should be administered in every pregnancy, ideally between 27 and 32 weeks of gestation.",
            "This sounds like a vendetta on the part of the admin lady",
            "I personally would have told that admin, call social service. Ill let my lawyer know.",
            "Went to school with a girl who was allergic to the sun, like would break out in hives, and her throat would start to close up if she was out in the sun too long. PE teacher thought she was making up bullshit, and had her run laps.\nCut to half a lap later when she cant breath, and almost falls unconscious, and all of the people near her are trying to get her in the shade, and medical help. Fucking P.E. teachers.",
            "This one time I got H1N1. For those who aren’t familiar, it’s also known as “Pig Influenza” as it started in pigs. \n\nI had it for about 1-2 weeks. (Everything excused) On about the tenth day the office administrator gave my grandma a call, threatening DFCS involvement if she didn’t have me at school tomorrow. \n\nLet’s just say she didn’t get as far into the sentence as your administrator did. For those (all) who haven’t met Grandma DeeDee, let me just tell you, Grandma is great, until you come at one of her kids sideways. I swear on my life she cussed that lady out so hard the damn phone caught on fire, then proceeded to hand the phone to my 7ft 290lb grandfather. We didn’t receive another call.",
            "I was vaccinated as a kid and still managed to pick it up in Morocco. Freaking terrible illness, I was coughing for months. I can't imagine how much worse it would have been if I hadn't been vaccinated.",
            "When my daughter was in high school I had an incident with her soccer coach. My daughter has asthma and had a permission slip to carry it so she wouldn’t have to go to the office to get it, (at first the school didn’t want to do this - I complained to the school board). My daughter’s asthma was fairly well controlled so she didn’t have to many issues but would occasionally have an attack. The coach felt like she was somehow faking and wouldn’t allow her to use her inhaler. This was the last straw as there were some other issues I had with this coach (favoritism, discipline, and a previous blood sugar drop she wouldn’t allow a snack for), so I wrote an email to her, the principal, and the athletic director. I cc’d the school board. It wasn’t long after that the coach was gone and the assistant coach took over. There had been other complaints so it was the last straw for her.",
            "One time in primary school, I didn’t feel well.\nIt old my teacher I wasn’t feeling well and would like to go to the sick bay and then go home. \nShe said no. \nKeep in mind we are only an hour into the school day here and I had a history of leaving school early because I wasn’t feeling well.  \n\nLunch time rolls around and I’m feeling worse… off to my teacher I go, she tells me no again. \n\nIt’s now 2pm and I’ve asked her again \n“Mrs I’m really not feeling well can I please go to the sick bay and go home” \nShe says no again because we only have an hour left of school.. “You will get to go home soon, suck it up till then”. \n\nI threw up on her shoes almost instantly after she said this to me. \n\nOff to the sick bay I went. Although I felt awful I was pretty chuffed with myself.",
            "When my brother and I were about 4 and 7 respectively we both got some kind of respiratory illness. I don't know the exact details but it was pretty severe. I'm being vague but I was 7 with limited understanding of what was going on. I think it was probably pneumonia from my limited memories of that time, in any case we were constantly going back and forth to the doctors, trying all different kinds of medications to figure out something that works. My brother was a lot sicker than I was, I was well enough to go back to school first but my brother was out of school for maybe 2-3 months. He couldn't eat, couldn't breathe, and definitely couldn't attend school. The school kept calling and asking my parents to bring him back to school, my parents kept refusing. They were understandably worried, because we were recent immigrants and they were concerned about a child disappearing like that, so they did send out social workers to check that we were still alive and such. When my brother did eventually come back to school, and they saw what he looked like, recovered from his illness but still near skeletal with bags under his eyes, the school never questioned that any of his future absences were anything but legitimate again.",
            "I was at the bank one day waiting in line.  The teller obviously knew the lady in front of me and they were chatting.  The teller asked the lady why she had her kid with her Instead of him being in school.  She says \"oh he has mono.\". The teller and I both back up and give her a look.  She says \"what?  It's just a cold\n\"\n\nNo bitch, it's not just a cold.  That's why it's not called a cold.  Poor kid looked miserable.  But a lot of people don't understand some diseases because they aren't as common as they used to be.",
            "I had mumps in kindergarten,  chicken pox in first grade & measles in second grade.  (This was in mid 60's when there were no vacancies for them) I went to the same elementary school for six years (gave theses illness to my sister before she started school) I have 5 autoimmune diseases & heart birth defect,  so when I get sick, I am seriously ill. I remember when I came back to school after the measles,  the teacher complaining about me being out of school for 2 months.  My mom told her off.",
            "You had me at 'goose fighting a Toyota'",
            "Had the whopper at 7 in '87.  It's a huge core memory, I remember so much from that time. My docs name and his face, appointments every two weeks, and the lil bucket I had to have with me at all times.",
            "My step-gram had Scarlett Fever when she was in elementary school - i think first or second grade. She doesn't remember most of it due to the illness, but was out of school for almost a whole year. It was bad. She does remember a teacher coming to her house because he didn't believe she was really that sick. Afterall, her sister was just fine. She also remembers hearing her mother cuss him out and run him off their property. It was the only time she ever heard her mother swear. Apparently, when she was finally able to go back to school, the teacher was no longer there.",
            "> I start coughing like I’m doing an impression of a goose fighting a Toyota.\n\nThis alone earned my upvote.",
            "This was me! Not exactly me, but same thing. Had whooping cough while in elementary school, and after a week off was forced to go back in by the school. Only lasted a few days before I was asked to go home, but the damage was done; every kid in my class (with one or two exceptions) got whooping cough, and nearly half of the rest of the school did too. This was in Spring, and the rest of the school year was pretty much 1/4-1/3 of the school out sick, all because the admin desk thought it was unacceptable that I was going to miss school for more than a week, and didn't care that my mom kept telling them that I was actually really sick still.\n\nTo this day I still have a cough as a result of the infection; if I exert myself too much too fast, particularly in water, I have a pretty bad coughing fit, and the residual cough can then last for hours.",
            "I had pneumonia but not really any other symptoms.  It was so bad I couldn't breathe, because I'd get phlegm stuck in my throat.  I'd have to cough it out in order to breathe again.  My teacher sent me to the nurse.\n\nNurse took my temperature.  \"You don't have a fever, go back to class.\"\n\nMy teacher said, \"You're basically dying here.\"  Sent me back to the nurse and this time I ended up going home.",
            "I first got ESRD when I was 11 going on 12. I had to spend a month & a half in a children's hospital 6 hours away from home; miserable and really going through it. I found out in the middle of my stay that *someone* had called the cops on my parents, because I was missing so much school - despite several times letting the school know what was happening, and despite my doing some schoolwork that was faxed to me weekly. \n\nCops showed up to my house, upsetting my parents while they were stressed out about me, and my parents fought back. I'm still not sure how, but all I know is that the matter was quickly resolved. What bullshit.",
            "I had a super racist Jamaican teacher in highschool. She was the last class of the day. She refused to let kids go to the bathroom, would shit talk anyone who wasnt Jamaican or Trinidadian & would only give us school work to do about Jamaican or Trinidadian people. So story time;\n\nI went to a school of about 5500 students & MAYBE 500 were white. Primarily hispanic south Florida school. Cuban to dominican to mexican to Argentina & everything in between.\n\nThis one girl, got fed up & said well what about my people. Her family was from Cuba. They came here on wet foot dry foot (look it up it's super impressive & major props) The teacher cut her off saying surviving Cuba wasn't that honorable & started boasting again about Jamaicans.\n\nA few other kids stepped up, from Honduras & the Dominican Republic etc. She SLAMMED her fist down & said no.\n\nA guy stepped up & said I'm going to see the principal. This teacher said no, nobody leaves.\n\nSo from that day forward nobody was allowed to leave to even go to the bathroom. About a week into this a girl who had a permanent laminated personal Bathroom Pass b/c she has cancer asked to use the restroom. The teacher said no.\n\nIt was all hands in this classroom, yelling & screaming. Angry ass 17 year olds ready to throw hands. I called my momma who was on her way down to the school (I'm white but my mom used to run the streets of Detroit & she a big bitch)\n\nSo all this chaos right, the girl with cancer steps up calmly & quitely & stands on this womans desk & says I will pee on your laptop. The teacher snarkily said  \"go ahead that's not my desk & thats the schools laptop\" Most teachers didnt have a solod classroom, a lot of teachers floated rooms due to high number of students. THIS GIRL LIFTS HER LEG KICKS THE CALL BUTTON FOR THE OFFIC & STARTS PEEINGGGGGGGGG\n\n😂😂when I told you I was howling. The dean of that department (English) escorted both the girl AND the teacher away😂😂\n\nMy mom then raised hell, I was called in to write a statement. We all were. The parents that had the ability to come did & also raised hell. As far as I know the teacher was only removed for a month for training however her entire class load was relocated to other teachers. She got a new one after training. \n\nFlorida is fun.",
            "Honestly, I'd ask them to put that in writing, then forward their mail, and the doctor's note, to the CDC and/or state health department \"asking for advice\". Or tell them after the fact that you were forced to comply with this and to please let the school know if they want any follow-up, although that has more risk of backfiring.\n\n\"Pertussis is nationally notifiable\" tells me that the CDC may not like that.\n\nGood on your mom to put a mask on you, but she should have instructed you to remove it when dealing with nasty admin lady.",
            "If you have the gall to ask “how could you even bring them to school” after bugging me for MONTHS *and* threatening to call social services, you should just prepare to defend yourself",
            "I need to see a goose fighting a toyota cause im tempted to see if my car can win a goose fight.\nDont wanna bring a toyota to a goose fight if imma loose",
            "You're mother did exactly what she was supposed to do beside let the admin have it. I worked in a preschool where staff were given tools by administration to intimidate families to promote attendance for school funding. Even though we must do mandatory house visits to see the kid. During covid this was the worse. We had to call child services on families that did not answer the phone or do virtual learning after 4 days in a row. And they would be kicked out of the program after 2 weeks. Mean while these family are underprivileged and have multiple children also out of school with no electronic devices. \nI also noticed that staff who has nothing better to do tend to do the most of nothing. The admin sounds like she's been in that seat for ages.",
            "I feel for you and your Mom. My youngest, when they get sick, they get SICK. 1 week minimum for a non-cold virus running through the school. Two of those in a semester and our kid would be past the max allowed absences. We'd be threatened. A quick call of, \"So, you WANT me to send the kid in with a fever? OK, will do.\"\n\nWait.\n\nYeah, I thought so.",
            "I got pneumonia in kindergarten and was out for almost a month. My awesome teacher made a couple of extra crafts for me and delivered them to my house for me. She made sure I knew I could catch up when I feel better and she told me I was smart and seemed to know everything we were working in anyway",
            "No disrespect to your mom.  She did what she had to do.  I hope that nasty woman caught whooping cough. Vaccinations for that wear off. A childhood vaccination isn't lifelong.",
            "My son at the age of 6 got shingles. I kept him off school for 2 weeks like the dr suggested. After two weeks he was still really ill couldn’t stay awake as it was on his throat and face when he would roll on that side of his face he would scream in pain. The dr signed him off school for another 4 weeks. \nI had been threatened with Social Services and the EWO. After the 6 weeks I sent him back to school sometimes I couldn’t even make it out of the gates and they were calling me to come and get him. Then I’d keep him off until he started picking up and then the same again. It look 7 months for the shingles spot/ rash disappear and he started picking up. \nThe the EWO came round I explained everything he then looked at the records of where the school sent him home sick then would put unexplained absence in the afternoon or following days. The EWO said that the school were obviously trying something so he went into the school and read them the riot act. After that day if they tried it again the EWO would phone me and ask what’s going on. The school then got fined for falsifying documents.",
            "If this was the States (does not sound like it) then the only reason they wanted you back in is because funding was (still is?) determined by daily attendance numbers. I do not know if long term medical absences are taken into account.",
            "I got whooping cough my sophomore year of High school and they almost kicked me out because of how many days I missed. They gave me so much shit for it too , they were so pissed off. I was like , “do you really want me in here with tons of other kids?” And I was in a trade school and I worked on cars everyone touched the same tools and stuff.",
            "Oh my god, primary schools are festering holes because parents treat the place like free childcare and will dump their kids off regardless. My daughter caught endless lurgies, some of which I had never heard of before!! Then there was that time one of her mates threw up all over her, leading her to be ill too. It seemed endless!",
            "LMAO @ goose fighting a Toyota.",
            "Assuming there's a doctor's note saying this was a long-haul illness, I would've called CPS or applied for a restraining order against the bureaucrat.",
            "Goose fighting a toyota is one of my fave things ive ever read, thank you",
            "got whooping cough in high school. misdiagnosed for 3 months and put on wrong medications. broke a rib in one particularly bad coughing fit where i actually suffocated and passed out. went to school that entire time because it was \"just bronchitis.\" somehow managed not to get anyone in my school sick those 3 months despite being in close contact due to sports - honestly a miracle. i wouldn't wish it on anyone.",
            "Not gonna lie, if this were my kid I'd go full male-Karen and demand the admin lady get fired on the spot.",
            "I’ve had mono twice. \nOnce as a adult (19 from a resort pool) and when I was 9 (from a water park). You can’t really function when you have mono, until it rides out. Safe to say that I wasn’t going to school, and my mom had to do the same thing to get the admin off her backs. My mom had a BSN and a Masters in Nursing so she knew what she was doing keeping me home. \nAfter they saw how sick I was, I was allowed to stay home after it. My teacher didn’t care either. She sent work home with my siblings and knew I wouldn’t fall behind.",
            "I went though something like this. I was a sickly child so was off a lot. So the school threatened to call social services on my mum. (Single parent)\n\nSo she started sending me to school sick and would wait for them to decide I was sick and send me home. \n\nA few months later they tell her if she keeps sending me to school sick they would call social services.\n\nShe walks into the head teachers office and rips them a new one asking if they won't take her word I was sick then how the hell was she supposed to parent. \nI wasn't in that school much longer.",
            "Same thing happened to me in middle school. I went out in an ambulance. That gym teacher was fired. School paid for ER visit and ambulance ride.",
            "My PE teacher didn’t believe I had arthritis (joints were already deforming and I limped very obviously.  Made me do gymnastics and was shocked that I couldn’t.  Forced me to spike volleyballs repeatedly until I could do it right and got mad at me that my arms swelled up and I couldn’t move.",
            "I start coughing like I’m doing an impression of a goose fighting a Toyota. R/brandnewsentence right there",
            "My mother would have stormed that administration office and screamed that woman into oblivion. She would then have spent the remaining number of years I was enrolled at that school tormenting her at every possible opportunity.",
            "Your Mom wasn't horrible. ❤️",
            "UGH - my daughter tore her meniscus ( something in her knee) she was in a brace from her hip to her ankle with it set at some angle by her PT.  She was in this brace for 8 weeks. I had to go to school because my daughter called me crying. The teacher was in the background saying she's just coming up with an excuse to not participate in **dodgeball**, because her family doesn't value education.",
            "That “100 day cough” is viral whooping cough, rather than the bacterial version. My son got the 100 day cough and it wasn’t diagnosed by my gp, I had to go to a pediatrician who diagnosed it instantly. It left him with asthma.",
            "How long ago was this? I'm surprised they didn't send a tutor. I had rheumatic fever in the 70's and missed 4 months of school. I don't remember how often he came - maybe twice a week - often on days I was too weak to lift my head, much less write. On those days he would read the lessons and I would answer questions. Had lots of homework to do during times of strength. I hated missing school and falling behind my peers.",
            "This is the way.",
            "This is because our children in public schools are a money maker.  Butts in the seat mean reimbursement from the State.  Schools are paid by the butt in the seat each and every day.  One butt out of the seat means $$$ lost to the school.",
            "I caught whooping cough three years ago, right at the end of May.  When I went back to school in August, I’d have to stop teaching so I could cough.  My students all immediately learned where I kept my water and inhaler.  There were many nights where I woke up puking from coughing so hard.  I had my booster less than three years before I got sick.  Stop yelling at people for not getting vaccines.  They’re not foolproof.",
            "That is crazy. In 7th grade I was out sick for about 3 months. Nothing serious but like a cold that just wouldn't go away. As far as I know, the school was fine with me being out. My sister was bringing me homework once a week, and then taking it back with her. No idea how anyone can think that someone cannot be sick for more than a week or 2.  So long as they are still doing the work, who cares if they are physical in class or not.",
            "Whenever I had to run or do anything active,  I would get sick.  The teachers always said I was just lazy.  I found out a few years ago that I have heart damage consistent with rheumatic fever. After 50 years, I finally felt validated.",
            "It’s because they don’t get money when you are not in school",
            "I also had whooping cough when I was ten. I was really sick one day and the teacher got tired of me hacking so she made me stand in the hallway outside of class. Another teacher checked to see what was going on because she could hear me down the hall.  I told her that I was made to stand out of the classroom and she went into the class and told my teacher off. I was sent to the nurses office and missed a lot of school.",
            "I had whooping cough right before I turned 40. I was vaccinated against it. But still got it anyway. Fortunately, my husband and kids didn’t come down with it. \n\nI’ve never coughed like that in my life. Unfortunately I also have a bad gag reflex so when I cough hard I throw up. I don’t think my bladder muscles have ever been the same again either.",
            "I had whooping cough when I was 16 (2004). The health department did contract tracing and basically everyone at my school had to take antibiotics. This was before they started doing tetanus shots as Tdap with the pertussis booster in it. Months of coughing until I puked. Worst year of my life.",
            "Why would your mom be considered terrible? If anything it sounds like the Administrator was incapable of believing anything she said unless she physically brought you to school in your condition which is par for the course sometimes when incompetent and uneducated administration is allowed to prosper. Said administrator shouldve had access to the doctors note regarding the whooping cough diagnoses. It should not be considered a simple recommendation but a firm reason on why you cannot go to school.",
            "> Also to the people commenting and messaging me to say my mom is a terrible person/parent\n\nGod I hate this fucking website",
            "You can’t trust someone else’s petard.",
            "My mom had whooping cough in 4th grade. She missed something like 4 months of classes.",
            "If you are on antibiotics you are contagious for about a week.That is where people think “you should be better” My kid caught it as an infant and was sick for SO long",
            "I had chronic bronchitis as a kid and it got so bad I was on an inhaler, coughing up gnarly stuff, and anytime I thought I was on the mend after a week or so to go back to school I came home early with a fever, chills, and I really thought I was dying.\n\nI was a pariah for a while even after I got the all clear to return to class and could finally breathe easily.\n\nMy elementary teachers found my hacking up gunk distracting and didn’t want me in class so admin never questioned it.",
            "If this was the US, your mom was a very gentle and kind lady. If this happened to my kid, the office admin would have been out of a job and the district would have been on the receiving end of a lawsuit.",
            "my friend once got labrythitis and was home for like 3 weeks?\nthe school kept sending her letters telling her to come in",
            "I was out of school for 3 weeks with whooping cough at 10 and then it was winter break! It took them forever to diagnose because I HAD been vaccinated, but apparently the 80s version didn’t always work. It was awful. Your mom did what she had to!",
            "Wow thats kinda crazy. I had whooping cough in grade 6, got to miss half a year of PE...but i still had to be in the gym, so i joined in when i could.\n\nI actually remember very little about being ill, like virtually nothing. Only one single flash memory of coughing till i threw up in the middle of the night.",
            "Schools lose funding for students if they miss more than XXX days.  This includes illnesses and explained absences.  If your child is well enough to do online, in my city  can be transfered to alternative learning high school, and they receive the funding.\n\nWas probably greed more than anything, especially with a doctor's note.  My daughter got long mono in grade 10.  Back then, no online learning, but lessons sent home and homework work at your own pace.",
            "Yay to your mom. She is/was one of the best kind.",
            "Sounds like your mom did what she had to do.  She knew what was going to happen so she didn’t leave. Bet that administration lady didn’t bother her again. I say good job to your Mom",
            "i had whooping cough in elementary school, i had the vaccine and still got it. it was the worst ive ever felt, coughing so hard to the point id throw up. i was out for a while too",
            "Reminder, I need to go get a booster shot soon. For a few things.",
            "Awesome mom",
            "I don't think your mom is a terrible person. Yes, exposing people to a dangerous virus is bad, however, she put a mask on you, and also, *it isn't like the school gave her much choice, did they?*",
            "I love your mom! Crazy admin are so annoying sometimes...",
            "School nurse didn't believe I was having partial focal seizures and wanted me to got back to class and didn't let me go home. She was right. I have a rare form of brain damage and there's even less treatment.\n\nI also saw her give a kid the wrong dose of insulin. And she was gone so often the principal once had to do her job and did it just as well.",
            "Your mom rocks. That was some pretty tough stuff to do honestly.",
            "Oh my goodness. Back in 2012, I had to return to work as my ex and I were separating. Only job I could find was in daycare, and I had to get another booster of the MMR and the TDaP (or is it DTap? I forget which is for adults and which is for kids). I had my originals in the late '70s/early '80s, boosters at 18 in 1995 (at that point, they had discovered immunity wasn't foolproof and vaccine boosters weren't really important to our dr or community, as cases of those diseases were fairly unheard of in our area--it was either that or my folks didn't have great health insurance and couldn't get us the boosters), and I was boosted in 2002 when I started working for a federal preschool agency (it was close enough to 10 years that they wanted it redone). \n\nAnyway, in 2012, I got boosters in early June, but in mid-August a mom brought in her very sick son, complete with fever, barking cough, runny nose. She claimed he only had the croup, but never told us about the fever--she had given him Tylenol at 630 that morning and had him at the center by 7am. 1130am rolls around and he had a fever of 101.4 and he had fallen asleep. Called his mom, who said she'd come get him during her lunch break, but did not bother showing up until 545pm (we closed at 6) because she claimed her boss wouldn't let her leave for the day, since she'd already taken off too much time in previous weeks due to her older son having appendicitis and needing to be home for a couple weeks afterward (gotta love empathetic employers, especially ones who specialize in medical insurance, right?). She was told by the center director NOT to bring him in until the fever was gone for 24 hours. Every other day, she'd bring him in since she found a loophole in the policy (I mean, give the kid Tylenol, fever \"disappears\", therefore the time started at that point, and ignoring the fever returning the next morning). After about 2 weeks of this, the director got fed up and would not allow the kid to come back until this \"cold\" was gone.\n\nNeedless to say, this kid was in my classroom, and 7 weeks after receiving my booster, I ended up with a nasty case of pertussis/whooping cough but I didn't know what it was. Since I had just started, I was not allowed to call off because probation there was 6 months instead of 3, and paid sick time was non-existent with that company. They told me that if I needed to go to the doctor, that's what Saturdays were for. The bad thing about that was that my stbxh was a jerk and wouldn't let me use a Saturday morning to go to the doctor to get antibiotics because that was my time to be with our kids and his time to do \"whatever\" with his girlfriend. I tried to get his parents to watch the kids, but they said no, and that it was my job or my ex's job to do so (my folks lived too far away, and none of my friends had kids yet and were unwilling to babysit for a couple hours for me to go to the doctor). \n\nTwo weeks after this, our oldest daughter caught the nasty cold, and this time, the ex made me take her to the doctor myself, saying \"You wanted to be a parent, right? Now do your job!\" At this point, I still had yet to see a doctor myself, but I still took my kiddo in to the pediatrician, who immediately diagnosed her with Pertussis B, which isn't covered by the vaccine (which only covered Pertussis A). She gave her antibiotics and an inhaler, and she recovered in about 4 more weeks. She looked at me, and said, \"Let me guess, you've been sick, too?\" When I nodded, she sighed sadly (I couldn't tell at the time if she was judging me or if she felt bad for me) and urged me to get to the doctor so I could get treated too. Because of work conditions and the ex being who he was, I never did get treated and was sick for 16 weeks (from August until mid-December that year). Ever since then, I now have allergen-induced asthma (they say that pertussis doesn't cause asthma, and while that may be so, the timing of my asthma being triggered was a bit conspicuous) and I have a rescue inhaler for when I'm exposed to lilies, certain air fresheners (typically ones with lilies or strawberries, which I'm allergic to), and certain times of the year when dogs come inside after rolling around on the ground in whatever it is they find interesting (it feels like I'm breathing in fiberglas). \n\nPertussis is no joke--in fact (and I'll probably get a lot of flack for saying this), the current virus going around the world right now was a lot easier for me to deal with than pertussis (then again, there were a couple articles that touched on previous pertussis exposure may enable a patient to have milder cases of you-know-what, but nothing was definitive). I was only sick with the current virus for 2 weeks, with lasting effects for a couple weeks last August/September (not counting taste and smell--those are still ongoing in spurts), and I had it again end of May this year, and was only sick for 5 days with no lasting symptoms afterward. I'd rather go through that than experience pertussis again (though, ymmv, as everyone is different).",
            "No kidding.  Pertussis can last for 3 months (90 days) if untreated.  The treatment is appropriate antibiotics.  I know this from personal experience because I came down with pertussis and did cough for 3 months.  The only reason I finally got treated was that my mom was bothered by the sound of my coughing.  Never mind if I was miserable.  My coughing bothered HER.  So anyways, I was finally taken to see the doctor.  The doctor read my mom the riot act, and again, it was all about HER.  You see, she was mortified that the doctor had scolded her.  Never mind me.  Antibiotics and a short course of codeine cleared things up.\n\nI had been given the old (1960's) pertussis vaccine, which was notorious for not working.",
            "The only thing I would have done is go over the head of the administrator to the boss - and ask why a person unqualified for that role is making medical decisions that could have a negative impact on my child, and possibly risk the health and safety of ALL the students..  (not sure if contagious, but when in doubt, treat as if it is).\n\nThat administrator on a power trip should NOT hold that job if that power hunger means putting health and safety of children in danger.",
            "HAHAHAHAHAHA THAT'S GOOD\n\nYour mom is a badass. How are you gonna threaten someone with social services for their kid being sick? And then be like \"the nerve to bring your kid to school\" PFFFT\n\nI'm impressed she even put a mask on you",
            "I found this on the goodpanda news site thing, and I have a similar experience. \n\nI was in the hospital at 8 years of age because I was healing from brain surgery. It took me a year to fully recover, 6 months in the hospital having to relearn how to walk, eat, and talk. A teacher had the audacity to contact cps on her own accord without taking it up with the head administrator who had been giving my mom a handful of homework every week so I could try and catch up. \n\nMy parents got pulled into another room by a nurse, they came marching back with a case worker who just so happened to ask little old me why I wasn't going to school. Idk maybe I just had my brain sawed open and dug around in?! Once she saw the wound/scar she went away and never came back.\n\nMy mom would still get calls and emails, but only from that teacher. Once I was back in school, a different teacher thought that it was absolutely impossible for my medical care team to decide that P.E. and recess were dangerous for me.\n\nQueue me being pulled out of the library (where I spent recess time) and told to go outside. It took me a maximum of 10 minutes to fall, hit my head, be knocked unconscious, and have to have an ambulance called because I wouldn't wake back up. \n\nI got removed from that school and ended up homeschooling all the way until highschool.",
            "Growing up I had \"reactive airway disease\" basically any time I got a cold it would develop a very crop/whooping sounding cough. I wasn't contagious I just had no energy from spending it all on breathing and coughing. In highschool I had a teacher call social services because she thought my mom was keeping me home with her or something. Next time I was sick I just sat through class coughing and she asked if I wanted to go to the nurses."
        ]
    },
    {
        "post_id": "y343zn",
        "author": "tpb772000",
        "title": "Only for new hires? Fine.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/y343zn/only_for_new_hires_fine/",
        "score": 18789,
        "num_comments": 826,
        "created_utc": 1665681042.0,
        "selftext": "So during high school I worked at a part time job at a grocery store that sounds similar to \"jingles\". We had a lot of cashiers quit and desperately needed more cashiers. At the time I was making 10.50 an hour. Our general manager made a promotion where any cashiers hired got paid 11.25 an hour. So I go talk to my manager like hey, can I get that raise. He said no, it is only for new hires. Well after about 2 weeks I got fed up being the only one who knew how to run the registers because I was really the only one with experience. I was training employees who were making more than me. I asked again to be on the same level of the people I am training. I realized that the promotion ended in about a month so I talked with my parents about my plan.\n\nI waited until I knew that he was going to struggle because of people already asking off. I went in to my shift, and I told my manager I quit. Here is my time card, here is the keys (I helped close once or twice), and here is my vest. He said woah wait lets talk about this, I said no and walked straight out. I enjoyed the weekend off and hung out with friends more often than I normally did, didnt work at all that week and on Friday (a week and a day later) I went on the website and applied again. I was called in for an interview, with my former manager. He seemed relieved and arrogant that I was coming back but at the end of the interview I asked, \"Since I am a new hire I get the new hire bonus pay right? and also, Janice (the only other lady who I liked) gave me her referral code so I get that as well right? I could tell he was very unhappy but I did end up getting both.\n\nI missed 3 days of work but ended up making more from the referral bonus ($250) and got myself a .75 raise.\n\n\\*Edit: Someone gifted me a gold medal anonymously and I just wanted to say thank you! Thank you to all of those who commented and gave me positive feedback. I did not expect for this to blow up and receive awards love you guys\\*",
        "permalink": "/r/MaliciousCompliance/comments/y343zn/only_for_new_hires_fine/",
        "comments": [
            ">hey, can I get that raise. He said no, it is only for new hires.\n\nWhat goes through their minds when they think it's acceptable to pay new people, with less work responsibilities, more money than a currently employed workhorse?",
            "It always blows my mind when a manager will risk their whole operation to pick up a dime.",
            "I did almost the same thing.  I did however leave a 2 weeks notice as i would not be rehire able if i did not. My last day was on a Thursday. Friday i put in an application and the HR hiring manager came out when they heard a qualified applicant was handing in an app. She looked confused, so i explained that my mgr refused to increase my pay to match that of a new hire.  \n\nNeedless to say, she hired me on the spot.  She didn't like my manager either, so set my wage at the top end of the new hire pay scale because i was qualified due to my work experience(duh).  AND she gave me a $100 sign on bonus.\n\nI showed up for work Monday morning and the boss says \"Ha. I knew you were full of shit when you said you were quitting because you found a better paying job\"\n\nMy reply?  \"Yep. I did\".",
            "I successfully started a revolt at the movie theater I worked at when new hires were being paid more than experienced ushers. We will showed up together for our shift and asked when our raise would kick in. When they said no raise was in the work, we said we deserved to be paid as much as the people we had to train or we walk. They said no, we walked. Ten minute later they had 3 sold out theaters to clean, 2 untrained rookies, and no support. We were still in the parking lot, got our raise, and went back to work.",
            "Reminds me of a time when my manager's hands were tied. The only way (or at least the easiest way) to give me a raise was for me to quit for a week or two and then he was able to hire me at a new rate. Looking back he was a pretty decent manager.",
            "He cost them more money and had to do extra paperwork.  Manglement at it's finest.",
            "I assume the interview did not ask the “why did you leave your previous job?” question. \n\nSounds like he probably figured it out, though.",
            "Literally just happened to me. I work for a government agency and we have been short staffed for a while. We finally hired three new people after not being able to hire anyone for almost a year. Just before this I was promoted to field supervisor, so I get to train all the new folk. \n\nTalking to the new people, I found out they’re making about $2.50 an hour more than me, and the college requirement or experience in lieu of college was removed from the job listing. \n\nWhen I found that out, I immediately went to my superiors and requested a raise. HR came back and said no because it was for the level of employees below me and not for my level. I went to the union and fought back and forth for 2 months and nothing. \n\nJust two weeks ago I put in my request to self demote and a bump in pay because I qualified for it as the lower level (great logic, right?) I signed the paperwork to demote on the next pay period. \n\nA few days later HR came back to me and said they would like me to stay in my supervisor position and they’ll push through my pay increase for more than everyone else. I’ll also be getting some retro pay at my new pay step.",
            "[deleted]",
            "That's one of the reason I quit my last job..they offered $2/hr more for new hires during the pandemic but nothing for the ones who continued to show up for work... my new company changed their pay scale about 3 months in to me working for them, sat us all down (one on one meetings) and said \"We are offering $1.50 more an hour for new hires, anyone here less than a year will automatically get the new wage, and everyone here a year or more will get the $1.50 raise as well.\" Now THAT is how you keep employees. They also gave us bonuses of $300 for working during the pandemic at 6 months.",
            "I'd have applied and interviewed while still employed. You're saying the same thing to the employer, without twisting their arm. If they allow you to \"quit\" then restart at the new pay level, everybody wins. If they buck, peace out. I don't ever bluff.",
            "Nice.  You ended up costing them more than if they'd just given you the raise when you asked for it.",
            "Pro tip: Consistently check your work-place job portal for new job listings. If they list the wage, you can have a better understanding if you’re being undervalued. \n\n\nI’ve had it happen where I got bumped up from $10.55 to $11/h for my 1 year anniversary. Then was told I was getting bumped to $11.33/hour only to find out that was the new employee starting wage. So essentially I worked for two years only to be paid the exact same as new-hires.",
            "Good-boss story here: In college, I worked in the head office for the school's food service department. I helped input the menus into the food ordering system, collected service data, and designed posters and flyers that went into the dining commons. Basic office stuff.   \nOne poster I made was advertising for student help in the cafeterias, offering $0.50/hr more than I was making after a year on the job. I showed the poster to my boss, and when he approved it, I said I was thinking of applying for one of these spots. He asked why, and I said \"you'll pay me more to spoon corn on the line than work in the office, so I should be there I guess.\" (This was almost 30 years ago, but the phrase \"Spoon Corn\" has stuck with me from that moment.)  \nThe next day, my co-worker and I were given $0.75/hr raises to stay in the office.",
            "If I were that manager, here's how I would have handled it.\n\n\"Of course you'll make what the new cashiers are making. You'll also be in charge of training them so you'll get an additional $? ph.",
            "Played the system well",
            ">...a grocery store that sounds similar to \"jingles\"    \n      \nI need another hint.",
            "Before the pandemic I saw that my job was hiring for $5 an hour more for starting employees than what I was making. At the time I had been with the company for 2 years and had 15 years experience in my field. I had talked with a manager who was already on her notice and leaving, she encouraged me to talk to the owner. Before I got a chance to, the pandemic hit our area and we went on a stay at home order. I have asthma and got a drs stay at home order, so I did not go back when the stay at home order for the state was lifted. They tried to get me to come back several times and I refused. Once the vaccines started to be available, they tried again. I told them to send me their offer and I’d let them know when I could come back. My “offer” was for my wage before the pandemic, while there was still job openings on indeed for new people to make $5 more an hour to start. \n\nI didn’t go back. Fuck that spa.",
            "I'll never understand the thought process behind spending more on recruiting but not throwing money at retention.",
            "Dont forget to use \"Sorry I have not been trained to do that yet.\"",
            "I worked for jingles as well.\n\nI quit when they asked me to redate food and put moldy out of date bread on the shelves.  Pro-tip: You aren't fooling anyone by changing the date on croissants.",
            "Can you imagine the idiocy of screwing over a trained and good employee for 75c an hour?",
            "> He said woah wait lets talk about this\n\nThe time to \"talk about this\" was in the past; you tried to bring up the subject at least twice.\n\nServes him right.",
            "Good for you.",
            "I’ve left cell phone providers because they wouldn’t give me the same offer as a new customer. I’m already in their system, so less work is required, but they’d rather get a new customer than keep an existing one.",
            "Well played !",
            "My wife works as a teacher in our local school district. They are notorious for being one of the lowest paying districts in the county, even though we are in one of the more affluent areas of the county with the highest rated schools in the county. Last year they had a mass exodus of teachers. One school had 15 teachers leave for neighboring districts. Some of them got an immediate 30% pay increase at their new schools.\n\nThe district decided to offer any new teacher a $3000 sign on bonus this year, to attract much needed staff.\n\nThe teachers who stayed got nothing.",
            "How long did the Manager think you would continue being the lowest paid while training them? \n\nThat was mighty managerial of him. 😂 \n\nGlad you got a “PAID” quit vacation with bonus pay and a raise.  Kudos!",
            "My company started paying more for people I was hiring during COVID. These are six figure technical jobs. I went to HR and said I needed raises for existing people. The. Talked to the COO (my boss). Then gave them all market adjustments. \n\nI kinda like my company. \n\nI also try to act as if I know all employees will tell each other what they make (maybe some do). It helps keep the system honest.",
            "actually, since u were coming in with experience, AND they were expecting u to TRAIN new hires, u should have been making more than the new hires.",
            "I was in a similar position.\n\nI had worked a camera watching security position for 9 years and had gotten a massive total increase in wage of a whole dollar during that time and had capped out at the maximum pay for that position ($11.20 an hour).\n\nThe government increased minimum wage and that starting wage went up and the company was bought out by a larger company and all the employees below branch managers were transitioned to the new company. My wage stayed the same.\n\nNew company starts hiring new employees and I start training a few. I find out that their starting wage is $11.10 an hour with a guaranteed raise of $1 after the first three months and further raises every year. I go to my boss and and ask to be put on at least the same wage. I get a no as well as a song and dance about how aim already maxed out for the position.\n\nSo wait till some of the new hires don’t work out and then I quite as well. With no one to train new staff for the position and not enough other staff to cover the company lost the contract.",
            "I bought a cake and had the bakery put a sweet sentiment from the boss to me on it.  Then I served it up for lunch in the break room on my last day.",
            "I’m surprised they rehired, especially so quickly, after you quit. Some jobs won’t let you even reapply for up to a year if you quit or ever again if you get fired.",
            "Honestly I'm proud of you! You got 3 days vacation basically and $250 for it!",
            "I saw a lot of people quite my old retail place because of this. If you're going to give new hires a pay raise, you need to bump up your actual loyal employee base, otherwise all you'll have is new hires. It baffles me how people can't seem to understand this. Oh, wait, yes I can, greed.",
            "Jingles sucks. My son worked there all through the pandemic. Only made $8.25 an hour. One night, it was literally him and a manager running the entire store till closing. His father and I came up and helped bring in all the carts (we don’t work there 🤣) just so they could get out of there at a reasonable hour. They were also supposed to get a bonus for working through the pandemic. Was told it would be several hundred dollars. He got $50. Glad he moved on to Bullseye and since moved on from there.",
            "The truth is that you should have made MORE than new hires. You had experience, which has value.\n\nI appreciate what you did, but you were STILL getting screwed after all that.",
            "It is stupid that you even had to do any of this to get a .75 raise. Terrible manager with terrible management skills.",
            "I have no idea what grocery store chain rhymes with “jingles”.",
            "My current job is doing this. Can’t get anyone in the door so they raised the wage. When I confronted my boss about it, he said “We needed to do that to get people in here.” Lol. So they only care about getting new people in here but don’t care about keeping their current staff happy. All these new people who are slower than the staff like me who has been there and don’t know how to do everything like we do are getting paid more than us? This is offensive and a slap in the face. They are having us train new people making more than us? The trainer shouldn’t be paid less than the trainee. They would be screwed without us. I am leaving in January when me and my partner move and I am not giving them a 2 week notice. These new people making more than me cannot do what I do nearly as quickly and accurately. They think they can take advantage of us and are so confident that we just won’t leave.",
            "So strange to me that managers are so opposed to helping their direct reports. I’m a manager and even if I was fairly certain I couldn’t get you the raise I’d still advocate for you and try. It’s like these managers are actively trying to be hated by their employees.",
            "When I was 15 I worked at a burger king for $5.15/hr. Did all the front of house stuff and drive through. When I turned 16 they trained me in on everything else except closing which I couldn't do because legally I couldn't work that late. Well, I was told when I could do the back end cooking stuff I would get a pay raise to like $6.50 an hour. After 2 months they had a sign out front saying they were hiring for $7.25/hr. I again asked for a raise, I was training people in and doing more than them yet making less. I was told \"you haven't demonstrated that you've earned it yet\"...I'm sorry what? I had a new laid back job at a hobby shop making $7.50/hr two weeks later.",
            "This is happening currently at a local convenience chain store. Signs all over the place. New hires start at $15.XX per hour. \n\nOne of the fellas I regularly see behind the register is pretty fed up about his hourly rate beginning with a 13 compared with, you guessed it, the people he’s been training for months. \n\nThat’s really just the tip of the iceberg, of the complaints I hear from employees there.",
            "2 options. You put me at $11.25 effective immediately, or I quit and my rehire rate is $12.25",
            "Man, I was a manager until like a week ago, and if I thought this would work at my job I'd be telling all my more tenured direct reports to do this to get the higher pay",
            "The nice thing is that anytime you ask for a raise or something in the future and get declined you can smile and nod and say “ Oh, so it’s going to be that way again.”",
            "Very few employers will look at that situation and think, \"My experienced cashier is making less than the new hires they are training,\" and promote the person to Sr. Cashier and bump them to $12/hr. Some will make good when it's pointed out to them, but a not insignificant percentage just feel that individual pay is a deal between each employee and the boss. \"You agreed to work here for 10.50. What I pay other people I hire in the future shouldn't affect that.\" \n\nIt seems like the only solution, besides what OP came up with, is to switch jobs regularly. Even if you like your job and the company you work for, go work for a competitor for a couple years and then come back. Another benefit besides a decent bump in pay is that \"the new guy\" doesn't have the extra responsibilities that everyone seems to accumulate after years in the same job (training new hires, representing your group at that monthly interdepartmental meeting, ordering supplies, closing, opening, etc.) So you end up being paid more in a new job with fewer responsibilities.",
            "Ok I love this story but I’m dying what grocery store rhymes with jingles.",
            ">...a grocery store that sounds similar to \"Jingles\"    \n      \nOkay, the only thing that's coming to my mind is Kringles and I feel like Santa would pay his workers better. Anyone know the correct answer??",
            "This is the main reason I quit my job at my old lumber mill. I was a forklift driver making $2.50 less than the guy my bosses always complained to me about and asked me to train (he was just a puller) after I asked to match his pay since they always complain about him they told me no even tho I was in a more complex, dangerous, and difficult position. They moved 4 of us onto the night shift (no raise even after asking) I waited about 2 months to make sure no other lift driver would want to switch to nights before I walked out.\n\nI was the assistant lead and my lead was very happy because they had to close the night shift he and his girlfriend hated it because he wouldn't be home til nearly 1am. He gave me a case of beer as a thank you for forcing them to close the shift lol\n\nAlso that guy they complained about only made $0.50 cents less than my lead who was there for 3 years with less than 6 months of experience in a lumber mill.\n\nThere was other reasons I left too but pay was a big part of it",
            "Good for you.. well done. I had a similar experience.. working a part time job at a C Store,in addition to a full time job. My position was assistant manager..C Store. The manager was to take a week vacation. I was able to fill in ( had a great deal of flexibility on other job managing multiple field service offices) During this week, I knew I’d be opening the store, reasonable for deposits and reconciliation of cash and other receipts . Product ordering… much more. What I didn’t know is that I would be training 3 employees hired for another store. When I submitted payroll.. I found that all three employees where making $.50 an hour more than me. First job for one of these, no retail experience. High school diplomas. I was much more qualified, experience and education. I actually didn’t have to say anything, District Manager realized that I would have seen salary info and gave me an immediate raise to match. Which still was not an equitable compensation. But I knew salaries were in part determined by the sales of the store. My location was opened 18 hrs a day as opposed to the 24 hr store the new workers were assigned .",
            "The fact that you had to go through all this just to get 75¢ is insane.",
            "I hope the manager had to cover OP's shifts on the weekend himself.",
            "Every new hire, new customer bonus should be applied to existing staff/customers.",
            "Store got confused—cell phone companies can pull that “only new customers” sh-t but employers need to take care of the staff that is there first.",
            "You could have negotiated for more.  I bet if you asked for 15 dolars an hour they would have caved or at least settled at 13.  He was acting arrogant to intimidate you so you wouldnt do that, they were desperate and you had them by the balls.",
            "I witnessed a cashier flip out and quit at an ingles the other day. Wonder if this was his plan too.",
            "The recruitment budget has more money than the retention budget. Job hop when you are young.",
            "Hahaha if my boss pulled this crap on me, I'd quit, then go to a rival company. That would REALLY leave him stewing",
            "I applied once for a company my best friend works for. I was offered a higher starting wage than he made after being with that company for years. He was beyond mad when he found out.",
            "Same thing happened to me as a dental assistant.",
            "That policy is so stupid I knew what the post was from the start. Except for Janice. I wasn’t anticipating her.",
            "Flawless execution lmao",
            "Good on you!",
            "aka Shingles",
            "People will treat you better once they understand you're willing to walk away from their bullshit.",
            "You did all that for .75 cents?",
            "The process here is identical to many retail MC stories...\n\n\"I bought this product from your store last week and I see the price has dropped by $50.  Can I get refunded the price difference?  No?  Okay, I'd like to return it please. Thanks, now I'd like to buy it again at the lower price.  Thanks!\"",
            "You should’ve straight up asked for MORE",
            "Freaking baller move right there. A+ on playing the game.",
            "Good for you. I love this",
            "And by far the biggest thing you got was the life lesson, in high school no less. Probably saved you tons of cash and agony in your working life.",
            "Way to end run the situation.  Step 2, look for new job in the interim",
            "My new go to for me.",
            "That's what's happening at my job. I have worked there for 6 years but make less than the new hires. They get $5 more for 120 days. It's complete bullshit.",
            "I had a job do this to me, once. Working with children with special needs, and I was in a position that \"wanted but did not require a relevant degree\". I hold such a degree. I had been working there 4-5 years, and we had been through a few rate-freezes where we got very minimal raises due to funding. When that broke, they started hiring people without a degree at my same rate, because it became the standard. I asked if my pay was going to get a bump due to longevity and holding a degree, and they said \"No, that is the standard pay\". I did not stay much longer, due to additional reasons.",
            "That's when you give him the \"You made me do this.\" look.",
            "I work for that company at the moment.  For a company that makes most of their money off of real estate (and is really only a grocery store chain for a tax write off) . . . This checks out. Good job on getting a pay bump.",
            "I'm laughing so hard right now lol. Brilliant.",
            "Stupid on the part of your manager to refuse to give you equal pay in the first place, especially since you already knew the system and had experience.  I hope he had to man the cash register while you were gone and got plenty of snide customers complaining about his work.  \n\nSmart on your part to do what you did, given the above.  Unless you would have lost other benefits too when you quit (like health insurance. )\n\nWhy do many companies play these games with employees?  People aren’t like cogs, you can’t necessarily swap one out for another.",
            "I worked there for 13 years. I got a raise everytime I asked. I was the scanning coordinator in a huge store. 48 hours a week. I had a single backup for my weekday off. Others were using my office as the break room and not cleaning up after themselves. I asked that it stop to no avail. One morning I came in and it was disgusting. They refused to address it. Fine. Fine. I walked. Left several vendors standing there. Sorry guys. I’ve had enough. My son ( a front end manager) said they panicked. They did replace me with 3 people that all had to be trained. They had no idea what it took to do my job. Yes, they asked me back. No thanks. I still have the store keys 20 years later. They probably change the locks. Maybe.",
            "You understand you could have asked for a raise when you quit? You could have asked for more than the new base rate even.",
            "Well done!",
            "Good for you!",
            "managers are so fucking dumb.",
            "Ah good old \"jingles\" I remember working there. Guessing NC?",
            "Work the system.  Good for you.  And stupid, foolish, manager.",
            ".....Shingles?",
            "And it all could have been avoided if corporate would have just taken thier heads out of thier asses. \nBeing in the service industry for 20 plus years I can't TELL you how many times I saw this level of stupidity... \nIncluding when I was the GM trying to manage my crew and corporate wouldn't let me do these kinda things.",
            "Management can be stupid.  Good for you making it work in your favor.",
            "You should also post this on WorkReform",
            "Nicely done!",
            "Why would the manager care? It’s not like the money is coming out of his pocket.",
            "I'm honestly surprised I always worked places that gave raises properly with all of these stories. They seem insane , was I lucky. Was I an amazing worker ? Both? Who knows",
            "Glad you stood up for yourself. It could be it was out of the manager's hands. But still, I'd go to bat for an employee to get a raise if it meant not having to pay for training, etc.  It's like when phone companies only offer new customers the deals and don't reward their loyal customers.",
            "beast",
            "Yeah. Good point. I think you handled it be well, other than negotiating for an additional raise, sure to your experience. After all, if new hires are valued at 11.25, surely a veteran trainer with no onboarding necessary should be worth at least 13.",
            "A+ Malicious compliance",
            "I used to get 2 people talking to managers about me a day to sing my praises. I left that job because they wouldn't give me a raise they promised me for a month. Went in and talked to them about it and said \"okay fine I guess I will look for another job\" \n\n\nThey weren't happy but held their ground.",
            "The Macy's of Spain is \"El Corté Ingles\" or the English Court.\n\nWe call said grocery store \"El Mercado Ingles\" for lols.",
            "This is one of my favorite /mc posts yet! \nGood on you.",
            "This happened to me at tech job in 2000. I was brought on board for a reasonable salary, not great, but not terrible. Just at the lower end of what I found acceptable. \n\nAnd then a few months in I found myself training kids straight out of college, most of whom had six figure offers (so 20-30k above my salary, and I'd been working for about 6 years at this point).\n\nI took it to my manager, who did give me a raise, but nowhere near parity, I think it was like $3000.\n\nThen the dotcom / NASDAQ crash happened (at least partly because of the company I worked for revising their financials and how they accounted for revenue). \n\nAbout 70% of the people I knew were laid off within 3 months. I wound up staying another year.",
            "Did you ask to be fully trained before working the register?",
            "Well played.",
            "Why not just say ingles?",
            "Following for glorious quitting update",
            "I am loving this turn around!!! 😍😍",
            "Well played!",
            "unhappy to get a good employee, what a world.",
            "I do this for all subscription stuff like broadband etc where new customers get a better deal as most won't add you to the promo. It's stupid.",
            "nice - you champion.",
            "If you had negotiated when you were quitting there's a good chance you could have gotten even more.",
            "High risk, high reward!",
            "I like the thought, but personally I would have said if new hires are getting $11.25 I would have said I want $11.50 or I'm walking out right now.  By asking for the same amount then your responsibilities should be the same.  Because you are a trainer you have more responsibilities.  They need to understand that they need to pay based on the responsibility, not just role.",
            "This is the most delicious malicious compliance.",
            "Was this an Ingles? That’s the only grocery store I can think of that sounds similar to jingles.",
            "Shingles ? Not gonna work there nor shop there",
            "I had a similar thing but it was a raise for everyone in the department and I was new so I had to keep bugging for the new rate. It’s a silly thing when you won’t get paid the little extra if you don’t complain.",
            "Honestly you're still kinda getting screwed since you're not getting extra for being experienced",
            "Happened to myself and our entire warehouse in 2014 @signaturehardware, made us take the tests new hires had to take for a job we already had and if you volunteered to take the test as conditions for the raise it was a two part test, failed either part, no raise.\n\nAt the time it was family owned father and son duo.",
            "Amazing",
            "u/tpb772000\n\nUnknowningly...\n\nyou have given a recipe for success to all those, who are rotting their life in a job, where they are the workhorse and cannot leave it for their personal issues.!!\n\nI would give a pat on your back for making legit raise and referral money. ha ha...!!\n\nAnd the best part of the story... which I must stress, ***you were indispensable for your work*** *...*  People tend to miss this most of the times.",
            "The stakes feel SO HIGH when you're fighting for that $1 more per hour, because they've designed the entire system to oppress and underpay the majority of their employees. \n\nIf/when you earn a salary over \\~$50k+, people can gain a LOT of innate bargaining power just by moving to a competitor with their expertise and acquired negotiating skills. I hope you make it into those leagues, or even break the mold and start your own thriving business! Since this is from your HS years, maybe you've already landed a great career :)",
            "Well played!   Hope you took your parents at least for ice cream.",
            "Working in stores is pretty annoying. I was told I would get a raise after a couple of months when I started my then summer job bevause I had experience and the period we go from the lowest to the semi decent pay is about a year worth of experience but hey here I am, almist a year in, signed a contract to stay at that job until I got myself in a uni but no more pay. \n\nThe only thing that got higher is our rensponsibilities and goals for a day which are almost impossible to complete. And now that we are close to the busiest time pf the year starting pretty much now we were told no new hires would be coming to help during the christmas because apparently it's too much of a trouble. We would be relying on rent workers (is there a real term for that?) who also know nothing and by making constant mistakes make our jobs so much more harder. Annoying. \nIt's already so hard and we have almost no space to move in the storage cause of all the stuff coming in because of the independence day. And Christmas is going to be even worse according to my coworkers.\n\nJesus the only good thing in that place is our coworkers, they are absolutely amazing. And it's not even a small store. I'm gonna miss them when I fibally have enough of back killing or go to uni hah.",
            "My 2nd job was at a sandwhich shop.  I was always told I was a great worker and I did opening, closing, and everything inbetween.  Like you, i found out several new people were being paid more than me including people I trained and who werent to great of workers in my opinion.   I just straight up said I quit and said when my last day would be, didn't explain or tell her why.  Part of why i didn't say anything was because I did avoid confrontation back then, but a lot was bc I felt so undervalued that I just wanted to be done. \n\nA similar thing happened at my last job, but I just told them if I don't get paid more than them then I'm done, and explained why I deserved to be paid more including work ethic and attendance.   I did get that. \n\nI dont get why its so hard for employers to do and understand why it's the better way to do it.  One of the longest jobs I had was at a taco place (not taco bell) and they would actually go into the system and look at what people were making and adjust people's pay if they realized someone deserved more or was there longer than another.   But they were really good owners overall."
        ]
    },
    {
        "post_id": "82uocu",
        "author": "egglessomlette",
        "title": "Company's Policy: \"All beverages must be in a cup with a straw\"... too amused to argue with the employee loophole discovered tonight.",
        "url": "https://i.redd.it/puvt5t4brgk01.jpg",
        "score": 18767,
        "num_comments": 381,
        "created_utc": 1520481735.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/82uocu/companys_policy_all_beverages_must_be_in_a_cup/",
        "comments": [
            "Wtf is the point of a rule like that?",
            "That straw is gonna get in the way though. Move it to the cup but outside of the can. Still compliant.",
            "It seems like “Lid” should be the operative word here, not straw...",
            "Health inspector: \"still docking points off because it doesn't have a lid like local code requires\".",
            "/r/deliciouscompliance ",
            "Former large national bank chain employee here.  The bank had passed a rule that all branch level employees had to have drinks in a cup with the company logo on it.  I used to drink a 32oz iced coffee every morning, and they supplied us with 12oz coffee mugs.  So i every morning i would come in and use the condensation on the plastic cup to adhere a deposit slip to the side of my cup....it had the company logo on it......",
            "bit off topic but where did you get that monster? it was avalible in the uk for a while and now i cant find it anywhere :(",
            "Why don't they just pour it in? It seems like a sound rule",
            "If you're gonna put a straw in a can of pop, twist the pull tab around, put straw through it, no more dodgy evasive straws.",
            "Beer me!",
            "You **must** have a straw? That's gotta be one of the most stupid fucking things to mandate and I can't even imagine why they would enforce that upon people",
            "What a wasteful policy. Both straws and the cups are so bad for environment. ",
            "Just a side note for Brits - any can of coke/monster or same sized can will fit in a standard mug (like from argos etc)\n\nAssuming the US doesn't have bigger/smaller mugs as standard it'll work there too.\n\nThen your energy drink has a handle!",
            "Goddamnit, now I want one. You owe me $3.22",
            "r/madlads",
            "In Oregon, health code says we either have a  lid and a straw, or a lid and a handle.  \n\nEdit: clarification, that’s for restaurant employees ",
            "The real crime here is drinking a Monster. ",
            "My last company tried that. They gave us small 10oz blue plastic cup with a lid and said ALL drinks have to be put in there, including our coffee. \n\nI \"accidentally\" put mine in the dish washer and it was ruined.\n\nA lot of my employees burned themselves trying to drink coffee from the straw. There was also a large increase in people taking breaks to fill up their cups, as most of them used to have double to triple the size of water bottles before.",
            "Stupid ass rule anyway boss. Feel bad about yourself ",
            "What’s the purpose of this rule?",
            "Reminds me of a time I was about 6 years old and woke my mum up to ask if I could have an apple for Breakfast. She said no a few times and wanted me to have cereal so I was more full for school I am guessing. \"Have something in a bowl\" was the stipulation. \n    She walked out a few minutes later and I'm eating an apple in a bowl of course. Not chopped as I was to young for the knives, whole apple, in a bowl.\n",
            "Wouldn't pouring it into the cup look less stupid?",
            "Seems actually more dangerous than being in a can. Cups don’t have the same center of gravity as a can. If your company wants to really make sure spills are prevented, they should require all beverages be contained in a screw cap container and drunk with a straw, with incentives for bell shaped containers or weighted bottoms.\n\nBut that would all be assuming It’s more of a big deal...",
            "How is that monster btw in England we do t have all the fancy flavours",
            "With a lid on top",
            "Look at all the extra trash thats creating...",
            "But....you could've just poured it into the cup",
            "FUCK ALOHA! 😒",
            "When I was a kid working fast food we would put a little bit of ice in a large cup, rest a can of beer in the ice, straw in the beer and lid on top. Looked like a normal drink. Teenagers who wanna get fucked up at work are clever.",
            "r/2mad4madlads",
            "[These](https://www.amazon.com/Premium-Soda-Can-Lids-Assorted/dp/B01CUNJ3U2/ref=sr_1_1_sspa?s=home-garden&ie=UTF8&qid=1520507415&sr=1-1-spons&keywords=soda+can+lids&psc=1) shut everyone up at work.",
            "Wow what is this beverage, it looks good. Never saw this kind of Monster here in France ",
            "Why do no one understand how to use a straw in a can???\n\nYou're suppose to insert the straw in the metal thing so it doesn't go up!",
            "Take it one step further: Fold the straw in half and tape or paperclip it to the side of the cup.",
            "Tell them 500 million straws go into landfill daily. ",
            "Get this mother ducker to our tax department! ASAP! ",
            "This would allow all the employees to spike their drinks if they wanted to!",
            "Just.....pour it into the damn cup",
            "All the flavours you could choose and you chose this...why?",
            "They should have put the straw in the cup. That way the drink is literally in the cup with a straw. ",
            "I don't live in the US.. What's that monster like? :D We don't have it here",
            "The best Monster flavor ever",
            "We used to have a rule that if you were carrying a drink through the office, you were required to have a napkin under the glass/cup and I think you were supposed to carry it with both hands.  It cracked me up.  Like we were supposed to walk with coffee like servants in some 19th century manor house.  At a CONSTRUCTION company.",
            "Should've opted for a margarita to go from the local watering hole. ",
            "Depending where you live most health codes require it also have a closed lid as well. At my store that would be a violation. ",
            "Is that Olive Garden?",
            "You make them drink coffee with a straw?",
            "Night shift is where the *real* innovations are created.",
            "Our manager would probably still scream at you threatening to write you up because she's \"the Manger and you have to listen to her\"",
            "Love it! Convenience store?",
            "This is stupid",
            "Whereas most places are taking steps to reduce the plastic usage, this company is trying to undo it all! \n\nBut yeah, office environments are all about finding loopholes to just about everything.",
            "Please don't tell me that's a Monster inside? Loca Moca? ",
            "top notch example of malicious compliance....",
            "What a ridiculous waste. I hope you at least reuse the cup. Ugh.",
            "Now have everyone start slurping the last remnants of drink every time the managers walk by. When they complain remind them that those annoying slurping sounds only happen when using the straws required by company policy.",
            "Get a reusable cup with a reusable straw. Better for the environment.",
            "Spin the tab over the opening and put your straw through the hole.",
            "Completely unrelated to your drink but, do you hate the radiant pos as much as I do? Ours mess up allllllll the time",
            "mmm m mom\n Zhang",
            "You could even put the straw between the can and the white cup. Extra malicious. It's in a cup, with a straw.",
            "I'm guessing Sodexo?",
            "Why not pour it in the cup",
            "/r/wewantcups",
            "That looks like the cash registers at My. Snow.",
            "R/madlad",
            "Man I used to crush on Aloha. ",
            "Marcus theater?",
            "so your company hates the environment?",
            "Is that Aloha POS?",
            "circle k?",
            " Why the fuck don't you just poor it in. ",
            "Would it work with the straw in the cup alongside the can?",
            "The fact that the guy drinking a Monster Loca Mocha needed to find a way around this rule is not surprising ",
            "Ours is \"spill-proof mugs only\". So I took the spill-proof mug they gave me and took off the part that made it spillproof. Now it's easier to clean and my drink cools faster. win-win",
            "Those monster coffees are addictive as fuck",
            "On the bright side it’s way easier to hide your booze. ",
            "Aloha!",
            "Dude, you work around food, that is not cool.  Take the 5 seconds to pour it into the cup.  And, remind me never to go to your place of work =(",
            "Ahh yeh she should of done that. I was a 10 apples a day type of kid though so could of been that. ",
            "AMC?",
            "The Oklahoma House of Reps has a rule where the only consumables that can be brought onto the floor must be in a Styrofoam cup.\n\nSo Reps bring various candies and foods in Styrofoam cups, I've even seen a couple of insulated bottles put into cups.\n\nThe kicker is that they made the rule.",
            "Wow. That is so wasteful. ",
            "If I was a manager and saw this I'd really try to get this person a raise and/or promotion.",
            "I'm not sure what I'm more annoyed about- the fact this rule exists or the fact that this is a needless loophole and the employee could just pour the can into the cup...",
            "That’s not company policy, it’s health code. ",
            "This company needs to join the movement to give up plastic straws. Straws can end up as marine waste and they are entirely unnecessary. Billions are made every year, almost all are used once, and then discarded to become pollution.\n\nEvery company should stop offering plastic straws. Switch to waxed paper (which were how straws were made in the past) or don't use a straw.",
            "Isn't this a health code rule? I hate it when businesses enforce state guidelines onto their employees to follow. This is America if I want to do whatever the hell I want where I work then it shall be done",
            "Or you could just pour it into the styrofoam and put a lid on it... the way it is right now, you can’t sip without getting poked in the eye with the straw. What a life hack. "
        ]
    },
    {
        "post_id": "axavd9",
        "author": "reallyageek",
        "title": "Warned my sister I was taking a shower as per requested",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/axavd9/warned_my_sister_i_was_taking_a_shower_as_per/",
        "score": 18771,
        "num_comments": 401,
        "created_utc": 1551726113.0,
        "selftext": "I'm home on spring break, and Saturday night after we finished watching movie, I turned on the shower, got ready to get in when it sounds like the KGB were going to break down the bathroom door.\nI open it expecting my dad to yell at me about something, but it's my teenage sister screaming at me to let her use the bathroom. So I get out, let her use the bathroom, she comes out again, screams at me some more about how I need to let her know when I'm going to take a shower, goes into her room, slams the door. I take my shower.\nI'm on a college sleep schedule so I go to bed at 1am, so the next night I'm doing some work and I start to get ready for bed around 12. My sister has high school the next morning so she's in bed.\nBefore I take my shower I open her door and say in a loud voice that I will be taking a shower now.",
        "permalink": "/r/MaliciousCompliance/comments/axavd9/warned_my_sister_i_was_taking_a_shower_as_per/",
        "comments": [
            "Nicely done. You give crap, you get crap.\n\nBtw, would go well in u/pettyrevenge.",
            "The KGB waits for no one.",
            "Yeah, my older sister would do the same thing. I ended up getting freaked out about taking showers, but one time it was too much. She was having a hormonal fit and put a hole through the door banging on it so much. Parents didn’t really know how to discipline her at that point, she was psychotic to the point of not seeming human anymore",
            "This story is not yet fully developed. There is no climax, no catharsis. You need to do this several nights in a row until she either releases you from the obligation or tells your parents and to her dismay they side with you. Only then should you report back to us.",
            "You don't take long showers do you?  I mean I take Forever Bath™s that can last up to 5 hours but I'm an exception to the norm.",
            "[deleted]",
            "Ah yes, a proper sibling response. Well done.",
            "It's. Just. So. Goddamn. BEAUTIFUL!!",
            "I love the level of evil here. Please continue doing this. Please tell me, did she wake up when you did this, or will you need to shake to get her to wake her up?",
            "The order of operations should have been.\n\n1. Fuck off go use another bathroom.\n\n2. I she does not Fuck off spray her like a bad cat with the shower head.\n\n3. proceed to inform her every time you take a shower from now on. ",
            "Your sister is in high school and goes to bed before 12? Is that possible?",
            "Just aheads up, my older brother did the same thing to me and it turned out he was doing drugs in the bathroom.",
            "Your sister yells at you, your father yells at you...  Why do you go home?  Maybe you need hearing aides.",
            "[deleted]",
            "“I’m going to take a shower now! Does anybody need to use the bathroom?!?”\n\nIt’s like some weird ass, fuckin quiz where you’ve revealed the answer first!",
            "How can anyone who is not deaf be unable to detect the sound of a running shower several feet away from the door? Never understood that.  ",
            "Don't forget to let her know when you're finished in the bathroom as well. It's the considerate thing to do.",
            "\"College Sleep Schedule\" \n\n\"Go To Bed at 1am\"\n\nWe have very different definitions of college sleep schedule. ",
            "By any chance did you steal your sister's phone charging brick? ",
            "She was pretty rude about it with the yelling and whatnot (teenagers...), but is it not common courtesy where you're from to let the household know you're taking a shower if it's the only bathroom? Here it is, just to double check no one needs to use the toilet first.",
            "In fairness, I grew up in a one-bathroom home and you definitely don't shower without giving everyone a chance to use the toilet first.",
            "Maybe I was raised differently, but when you go to take up the room, which people need in order to take a deuce, for fifteen mins to an hour, it's polite to ask if anyone needs to use the restroom.\n\nYour sister is pissy and you're a jerk.",
            "It really do be like that with siblings",
            "She sounds like a cunt.",
            "Ah I know how that feels coming home from college and having to share a bathroom with a unwelcoming sister. She was used to having her own private bathroom for weeks until she started college herself this year. Not gonna lie and say I'm a little happy that she now has to use to a communal dorm bathroom. ",
            "wtf why do you have to let her know when you need a shower, tell her to grow up",
            "As the older kid you are obligated to not even give a shit in the first place. It's stunning that you did, imo.",
            "I like the malicious compliance but what a brat she is. I'd have told her to f*** off but you're probably a better person than me ",
            "Get yourself a kazoo. Go in there tonight singing \"I'm going to take a shower\" while dancing around her bed and playing an awesome tune on that kazoo. ",
            "🎶 I wIlL bE tAkInG a ShOwEr NoW! 🎶",
            "Who *requested* that you take a shower? Lol",
            "Play shitty games, win shitty prizes ",
            "Why does this sound like something my sister would do as well",
            "I thought this was going to end up like some incest porn and him exposing himself to his sister 😂",
            "Like, she was able to HEAR the shower going. She should know someone is planning on taking one.",
            "I've seen enough porn to know where this is going.",
            "I never open the door when I'm in the bathroom. First come, first serve, wait your damn turn.\n\nSource: youngest of 3. Bathroom time was precious. The older siblings are also the reason I lock the bathroom door. ",
            "Is the shower curtain transparent? Can't\n she pee with you in there?\n\nIt's just weird.",
            "Sounds like you’re both immature twats",
            "The killing gloves of boxing",
            "Very nice :-)",
            "This is definitely something that would happen between me and my high school senior sister. ",
            "This sounds like exactly something my cousin would do lol. Nice story!",
            "Short and sweet. I like it.",
            "Lol. Siblings.",
            "Such a sibling thing to do",
            "I could ctrl-c/v this post, but instead of barging into her room, I have Alexa do it.",
            "Play stupid games, win stupid prizes.",
            "How hard is it to let people you share a bathroom with know when you're going to be using the bathroom.",
            "Had a roommate once complain about the bathroom carpet being wet after someone takes a shower and asked that \"people\" please dry their feet first before getting out. Clearly, since I was the only other one using that shower, her complaints were aimed directly at me.\n\nNow I totally get that stepping on a wet rug can suck, but the problem with her complaint was that I always did the thing where you lay a portion of the towel down as you step out so that most of the water is absorbed while your feet dry, so her complaints were either her nitpicking or wholly unnecessary. Well, unnecessary until I started putting one foot down without the towel *on purpose* after every shower to get the point across that things could've been much worse in the soggy sock department than they already were.\n\nOddly enough, I never heard another complaint about damp rugs after that. Go figure.",
            "Teenage girls and bathrooms. My advise is end this now! You can’t win. This can only get uglier. ",
            "I really like how u/reallyageek has labelled it a \"College sleep schedule\" & I'm definitely using that moving forward",
            "You know... if PornHub has taught me anything in my short life",
            "... and then what happened?",
            "yall need to learn how to communicate ",
            "So I'm feeling a bit guilty about the door smacking and yelling I've done here.  And it was to one of my daughters. \nBut in my defence,  6 people sharing 1 bathroom and she spends 20 minutes in there during peek usage time EVERY DAY.\nBut probs still wrong.\nP.S. I didn't ask her to warn me she was about to shower.  Honest. \n",
            "But will she help out because of your broken hands?",
            "It's actually considerate to let people use the toilet before your shower. I even go so far as to ask if anyone is showering before starting the dishwasher and washing machine as those take up the hot water. But since she was screaming at you, so nicely done!",
            "r/passiveaggressivedouchebaggery ",
            "In mother Russia, sister turned lose on streets for man yelling. ",
            "Spring break? It's not even spring. ",
            "My brother still has nightmares from what my friends and I did to him. Poor guy",
            "Ugh, siblings suck. But do y’all seriously only have one bathroom, or was she such a lazy jerk butt that she insisted on using the one already in use? ",
            "Sisters...",
            "R/karma ",
            "She's a teenager, with teen angst.  You have now forever become the mean older brother. ",
            "[removed]"
        ]
    },
    {
        "post_id": "sy11x1",
        "author": "af_cheddarhead",
        "title": "If you pay me for 40 hours you get 40 hours",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sy11x1/if_you_pay_me_for_40_hours_you_get_40_hours/",
        "score": 18766,
        "num_comments": 618,
        "created_utc": 1645469227.0,
        "selftext": "Not sure if it belongs here but here goes:\n\nI work a consulting engineer designing and implementing systems (network and server) upgrades for organizations with worldwide locations. When initially hired by my company the agreement was I would get paid for every hour I worked, usually 40 hours a week when at the home site, up to 80+ hours per week when at the customer's location.  No overtime, just straight time as my position is \"exempt\".  While on-site I would also be paid MI&E (Lodging expenses, Mileage expenses, and Meal & Incidental Expenses) to include rental car. MI&E can add up to a couple thousand a week in places like Hawaii, Japan or England.\n\nFlash forward a few years and the company has been bought and merged a couple of times and the new company decides that exempt employees are now salary and will not pay for any hours over 40 plus of course no discussion of negotiating a new rate due to the change in working conditions. This reduces my annual compensation by over 20K per year as I would be at a customer's site for 4-6 months a year.  I walk into the bosses office to discuss, he says nothing to discuss.\n\nNext time I am planning for a site, the plan is for me and my team to work 40 hours a week meaning an additional 3 weeks on site, neither the customer nor my boss were happy.  The additional three weeks added over 50K in MI&E to the estimate because it isn't just me that does the work and the total number of chargeable hours is the same if we are on site 4 weeks or 7 weeks.\n\nSorry, if you only pay me for 40 hours I only work 40 hours.  A couple of VPs were quickly brought into the conversation and the new policy was quickly modified, when at a customer site we now get paid for every hour we work.",
        "permalink": "/r/MaliciousCompliance/comments/sy11x1/if_you_pay_me_for_40_hours_you_get_40_hours/",
        "comments": [
            "I've had managers in the past try to get me to work overtime without additional pay. My response is always \"if it's important enough for me to work overtime to do it, it's important enough for you to pay me extra.\"",
            "I quit a ten year job because of this.\n\nShould have left after 5 but.....",
            "good for you. They cannot make you work without pay and if they set the max limit at 40 hours, then you stick to the 40.\n\nAt my job, we are limited to 8 hours max daily, so everyone stops working and leaves after 8 hours.",
            "The last job I worked, we were all exempt and there was this unwritten contest to see who could stay the longest at work. People coming in at 6am and staying until 6pm. I'm a fast worker, my boss was constantly handing me one-off projects because I would power through them. I also am a firm believer in sticking to my scheduled hours. So I'd come in every day at 9-9:30 am and left at 6pm every day. The lady that sat next to me got increasingly upset and hostile at my failure to work long hours like the rest of them.\n\nShe hit the roof at the end of the year when I got the highest evaluation and largest bonus. She tried to lodge a complaint with the boss. When she came at me in a staff meeting with a passive-aggressive \"Some of us don't have to work as much as others\" I laughed and told her \"Some of us can get our work done in 8 hours. Some of us can get your work and our work done in 8 hours. Who's the slacker here?\"\n\n***Never work one more minute than they are willing to pay you for.*** And if you can't get your assigned work done unless you spend hours of unpaid time every day, you need a new job because they are either overloading you with work or you suck at your job.",
            "I work in the military, so we don't really get compensated for working overtime.\n\nNight check tends to work way later (usually a 8 hour shift stretches to 10, on bad days 12).\n\nBUT, night check is a \"Do what needs to be done, then we go home\" shift. I.E. if everyone's done at 8PM we go home 4 hours early. It never makes up for how often or how long we stay late but it's still nice.\n\nAnd this is also how it went while we were out on deployment. \n\nThat is, until day check found out we occasionally leave early... Despite them leaving early *every friday*, they complained that occasionally we leave early. Despite more often than not staying late. (We even stayed SUPER late one day looking for a tool that the daychecker making the fuss took home with him.)\n\nSo the night check boss was like \"Aight. If we can't leave early, we won't stay late.\n\n Que a week of us leaving at exactly 12:30, every night, regardless of if the work was complete or not. Sure there was one day we all sat around for about 3 hours doing fuck all but it was worth it to make Day check have to clean up after US rather than the other way around.",
            "My first salary job I was working like 60 hours a week and my boss tried to have me cover the job of a woman who went on maternity leave for three months.  I said “sure, but I’ll need her salary too because im already working a ton of hours and picking up more would just crush what I actually make per hour”….he got pissed and said, well it’s not much more work, I’ll just move you to hourly and off of salary.  (Like it was a punishment to take away my salaried position and move me back in with the “hourly” people)\n\nWell it turns out HR just went and gave me my hourly rate based on my previous salary divided by 40 hours a week I was supposed to be working….and then I got time and a half for all hours I was working over 40. \n\nI literally got a 100% pay increase just to cover the 60 hours I was already working….plus all the additional time and a half I wanted while my coworker was on maternity leave (she ended up being out for 3 months and then part time for another 6 lol).\n\nTo be fair, the boss (who was the owner) came back like 6 months later and apologized and said he didn’t realize how many hours I was putting in and what he was asking me to do….he hadn’t realized I was taking on additional duties assigned by a manager (his daughter) and thought I only had like a 20 hour workload. He also cut my workload, and offered me a new higher hourly rate or a higher salaried rate and said I could take what worked better for me.\n\nEnded up being a good boss….just one that could go off the handle and make some dumb decisions lol",
            "At my first job as a computer programmer, I had an incident where someone from a different department complained to my supervisor because I left before she did. I clocked out at the same time I always did.\n\nThe issue was I had to walk past this department to the time clock. Her complaint was that her department still had work to do and it wasn't fair that I got to leave on time, even though my work was done for the day. I told my supervisor that's too bad but if my work is done, I'll be leaving.\n\nEven though I was hourly, I did not care at all to spend any more time at work even if I was paid for it so when my shift ended, I left for the day.",
            "I had the exact thing happen to me.   Our small consulting company got bought by a huge conglomerate. They went crazy when they saw all the OT our people were racking up.  We tried to explain that OT is good because we bill the customer for each hour we work.    \n   \nOur new manager said that as salaried employees we should be willing to work OT for free.   You can imagine how well that went over.    \n   \nI’d like to say that after a few months of declining revenue the manager was sacked. Instead he got an award for reducing OT and was transferred to a completely different division and our little business was closed.  \n   \nIt wasn’t a total loss.  One of the perks of working for this conglomerate was the discount on home appliances. I bought a new washer and dryer.",
            "Had a supervisor not long ago that tried to make overtime mandatory even though the contract stated all overtime was on a volunteer bases only. \n\nI had worked every several hours of OT and weekends for many weeks/months before I started to feel burnt out so I stopped coming in on the weekends. As did many of my co-workers. One Friday he informs us that we have to work the weekend and he needed volunteers, no one raised their hands. He got pissed off and shouted that we are lazy fucks. \n\nThe next week I get called into the office to receive a write-up for intentionally delaying the product to the customer by not coming in on the weekend. I laughed and told him I wasn’t signing that bull shit. He got HR involved at that point for insubordination. When I was talking to HR and brought up the mandatory OT he was forcing, they were surprised to find this out as he had left that part out. I was asked to leave the office noting that no further action was to be taken against me. We no longer had a supervisor by the end of that week after HR interviewed all 10 of us on shift and we all had the same story.",
            "I’m a paralegal and by federal law there have extremely high bars to meet in order to be exempt as a salaried  employee. \n\nI started working at a law firm 4 months ago. In the interview I asked, how often was overtime expected. They said rarely. Low and behold I find myself pressured to work over time consistently, even coming in on the weekends. I once Was told “this isn’t a 9-5 job”. Dude, as a lawyer is! But for me as a paralegal I’m out at 5. I discovered the firm considered  me exempt as a paralegal for overtime. This didn’t add up, I didn’t meet the standards for exempt in super high salary, specialization higher education related specifically to my daily duties,  or have the power to fire and hire employees. I didn’t meet any federal exemption. I asked HR to specifically tell me how I was exempt in writing. They brushed me off. I pushed again and they set up a meeting with a lawyer at the firm. He gave me the “trust me you’re exempt speech”. I will be reporting this firm to be audited for fair labor practice. This morning I  accepted a much better paying paralegal position across town. This firm actually values personal lives. When I told this new firm about the expectation at my old firm they were appalled. Fuck that noise. Oh by the way I asked for a raise at my old firm and they laughed me off. I’ll be making 10k more at this new place.",
            "What's the saying?\n\n&#x200B;\n\n\"F\\*\\*k you, PAY ME!\"",
            "So many salaried jobs do this. I recently left one that put a 40-hour work week in the offer letter so when they asked me to stay late I was already on my way home. You can't pay me for 40 hours then make me work 50. I'm not going to do that.",
            "I'm have a similar situation. \n\nFirst job out of college (still here) where I was managing a manufacturing operation in Arizona while my office is in California (long story as to why it was like that but it was a royal headache). Starting out I was paid hourly and I was putting in a lot of hours/weekends with frequent trips out there to check in with employees, meet with vendors and customers, etc. \n\nAnyway, after about a year, I was told I was getting a \"promotion\" which included a title change and I would be put on salary. Except I was still getting the equivalent of what my hourly wage was based on a 40 hour work week - according to my boss \"so we don't have to pay you more than we have to\".\n\nAlright... Well then I'm not working any more than I have to if that's the case. I made less visits and wouldn't work some hours so my net work week was 40 hours.  Now I get to my office at 9am and I am out the door by 5pm. Sorry boss, you sleep in the bed you make. \n\nWe have since relocated the operation closer to my office, so it's easier to manage those hours but still sorry, no more weekend work and I stick to that 9-5.",
            "At a couple of plants we had hourly “specialists” that got like maybe $1-2 more then the techs.  But these people were doing the work of managers, in addition to their regular work of essentially being a plant engineer.\n\nWith extra projects always assigned they were working OT and did well overall.\n\nEveryone they tried to “promote” then the salary would be lower then what they made with OT, but doing the same job.  Company just wanted out of the OT. \n\nTurned down every time.   The new job title, doing the same work, was not worth a pay cut.  The only advantage was promotion opportunities, but these guys were not interested in that, moving, etc.",
            "I was changed from hourly to salary without being told until after the change was made, with no raise. We were in our busy season and I had been working overtime. I now work exactly 40 hours a week and keep track of my time down to the minute in a spreadsheet. My boss made a comment one time how managers should be early to set a good example. He didn’t tell me specifically that I needed to be in earlier, but I show up right on time or maybe a few minutes early (never late though) so I felt it was directed at me. Overall, I like my job and they’re usually very flexible but this has been a year ago and I’m still kind of bitter lol. I think mainly because they did it without informing me first. It was “oh by the way we’re changing you to salary”.",
            "Had that happen to me too. Went fork hourly to salary after a raise and I did my time. 40 hours in and out. One day my manager tells me that I’m not “pulling my weight” and I was expected to work 45 hours a week at least. I didn’t say anything at the time but man I wish I did. I also didn’t work over 40 hours after that conversation 😂 but if you’re not going to pay me for those 5 hours I’m not doing it. Also, if it’s not in my contract to work said hours I’m not. Doing my 40 and getting the heck out of there.",
            "> This reduces my annual compensation by over 20K per year  \n\nGoogle for 'constructive dismissal'.  Shrinking your compensation without your agreement can be taken as firing, and you can collect unemployment for it.  \n\nThink about it.  To make an extreme example--  I hire you as an engineer with an agreed rate of say $80/hr.  I then decide I don't want you anymore but I don't want to fire you, so I reduce your pay to the federal minimum wage of $7.25/hr and never schedule you for any jobs, I then sit back and wait for you to quit, which you of course will.  That's great for me- I never have to fire anyone and pay unemployment, I just shrink their pay to near-zero.  \nThus, constructive dismissal is a thing.  If I did that, you can argue that you're effectively fired, and collect unemployment.  Same thing often applies if your compensation is reduced.",
            "Same thing happened to my husband. He's a recruiter on salary and his \"quota\" is to hire enough people to cover his salary x3. He knows how to time manage and is good at his job, so he usually works from home 7 to 3 with no real lunch and still manages to get x4-5 his salary. They tried making him work weekends because they had an important project and many other recruiters weren't meeting their quotas. He had to meet with the CEO because he refused. He basically told them you either change my contract and pay me more to get more work from me or you can fire me if your don't my work ethic because I'm meeting all my work expectations and more...they didn't do either and he didn't have to work weekends when his colleagues had to.",
            "A) Well Done\n\n  \nB) They are looking to replace you as soon as they find more exploitable employees. I hope you already started searching",
            "Modern management structures are based on getting credit for removing parts from a working machine. Remove a spring per month and you may not see any negatives for a while and may even save money on springs! Long-term the reason those springs were put in place and replaced regularly is to have the machinery avoid catastrophic failure. \n\nRemove too many springs and you get OP's situation.",
            "Being salaried seems to come with the notion that you work until the work is done. I'm sorry but if my pay stubs show that you are converting my salary into an hourly rate to get my pay, I'm only working 40 hours. I have done this since I became salaried. In WA it is kind of expected to work 50+ hours as a salaried manager. I get grief from my peers all the time. Sure I will work over 40 hours in a week sometimes but I'm not staying on site for 10 hours a day just because that's what people expect. If you want me to stay for 50 hours pay me for 50 hours. Or make my salary enough I don't mind working 50 hours.",
            "Pennywise, Poundfoolish",
            "Play stupid games, win stupid prizes.",
            "If you pay me for 40 hours, you usually get around 32.",
            "They really, *really* miss their slaves.\n\nThere was an interval just before all the boomers really got too old to work, and were still staying in jobs longer than previous generations due to healthcare advances, where there were just a lot fucking less jobs than people wanting them.\n\nNow, not so much.  But these fuckos just *don't want to believe* that The Happy Time, when you could make people dance a jig then lick your crusty taint while saying please sire may I have some more - just to stay in a job, any job, are over.",
            "I love how a lot of stories here is basically the same as raising kids; if they don't listen then make them deal with the consequences",
            "I worked for a company a few years ago that decided to put us all onto the on call rota. They also had a rule that the first hour of work if you were called was out of \"expected hours as required\" because we got a standby payment. OK, that's fine, we used remote access to fix issues so my on call hours were at home so I would look at the issue, figure out what was wrong and then spent an hour drinking coffee and watching the world go by before hitting the keys to fix the problem. Didn't care that incident managers were screaming, not going to pay me for an hour, I'm not gong to work for you in that hour. Simple.\n\nThe other aspect I brought tot he table was the EU Working Time Directive. Now this was a clever piece of legislation and to those in the UK who voted Brexit, you're going to miss this one big time. The rule was simple you must have an unbroken break of 11 hours between shifts and you must have an uninterrupted rest period of 24 hours in a week or 48 hours over 2 weeks. You could choose to opt out of this if you wished, but I made sure my contract was explicit when we were forced into the on-call situation. I was very definitely NOT opting out.\n\nThings ran quite well for the first few cycles of on-call. I didn't get called. Then came the first call out. I got home from work at 7pm after finishing at 5:30. My phone rang at 8:30pm and it was a fault on a database server. I did some digging, identified the problem had my coffee, watched a little TV and then fixed the issue. The job was closed out at 11:00pm. I went to bed and the phone rang again at 3:00am. Another issue, so I got up, looked at the issue, made a coffee, read for a while, fixed the issue and closed out the job at 5:30am. I went into the overtime system and booked in 90 minutes overtime for the 8:30 to 11:00 call (2.5 hours minus the hour I had to do for free) and 2.5 hours for the early hours call because you only get the first hour of the on-call session for free. I headed back to bed.\n\nAt 9:30 my phone rang. It was my boss. \"Where are you, we have an important meeting\"\n\n\"I will be in at 4:30 this afternoon\" I said. \"I have to have my break\".\n\nHe went off at the deep end and I just said I will see you later and put the phone down. \n\nWhen I arrived at work I was met by the boss and a representative from HR. He handed me a letter suspending me. I looked at the rep from HR and asked \"Do you really want to do this?\", they responded that yes, I had failed to turn up for work without excuse. My response was OK, that's fine. Let me call my union legal representative, meanwhile I suggest you check my contract and you check the Working Time Directive regarding legal obligations for breaks and then you pull my timesheets for yesterday showing my unbroken 11 hours break commenced at 5:30 this morning owing tot he mandatory overtime I was forced to carry out, then we can schedule a meeting. It's fair to say their face drained of colour. \n\nI pushed this all the way and a few weeks of paid gardening leave later we went to a formal meeting with the HR director where the legal team from the union tied them up in knots right down to challenging the legal status of not paying for an hour of mandatory overtime where staff were called out. The company caved in pretty quickly and overturned the suspension, this didn't go down well with the boos and he made some comment about \"how can I run this department and keep costs down while troublemakers like this insist on using the law to their own advantage?\". I asked what action was going to be taken about the boss and they were \"Oh I'm sure this is a learning experience we can all move on\" and other such platitudes. \n\nMistake number 2.  \n\nI handed in my resignation with a claim for constructive dismissal because I was sure the boss was going to make my life hell from that point onwards. He had make a statement in front of my legal representative and in a meeting where minutes were being taken calling me a troublemaker. Yes I did have this ready to go as I was pretty sure this was the way the meeting was going to go. The boss was a fragile ego and tried everything to cut corners. It ended up costing the company 3 months pay in lieu of notice and another 4 months pay in compensation for unfair dismissal. I moved on to a much better job, have no on call to suffer and my previous employers are legally bound not to provide a negative reference if anyone looks back over my employment history.\n\nThere is a moral to this; join a union, they will fight for your rights all the way.",
            "If you get paid $800 for a 40 hour week, that's $20 an hour.\n\nIf the bosses REALLY REALLY REALLY NEED the job done this week in 80 hours at $800, then you're being paid $10 an hour. Can't be that important if they're only willing to cut your pay.",
            "We used to take shipyard workers to sea with us, 4 or 5 days at 24 hours paid time.  They had to pull long hours when shit broke but, most of the time nothing broke.",
            "lol I literally just spent 2 hours on my day off finishing some JIRA ticket crap because when I was asked on Friday how much time I allocated towards a project this week I said \"full 40\" and one of the managers on the meeting chimed in with \"only 40?\"\n\ngotta love it",
            "You should have countered to these VPs \n\n\"according to boss dude there is nothing to discuss - why am I here\"\n\nSeriously - they will only see 'reason' if their actions cost them - not before...",
            "A company I worked for used to hire contractors from time to time just to compensate for sudden rushes or unexpected work. And these contractors woukd always get paid very fairly. Like they would quote for say 12 hours of work and if they did 13, they got paid for that extra hour. The regular staff, however, was quite often expected to do unpaid overtime in those cases. And it always struck me that contractors getting paid for their time was the norm but staff could get fucked.\n\nProbably because they knew that the contractors were free not to work for them...",
            "Managers just want you to simply wave the tech wand, so magic gets it done. Story wand has flat batteries, it’s gonna take hourly to finish/fix.",
            "> A couple of VPs were quickly brought into the conversation and the new policy was quickly modified, when at a customer site we now get paid for every hour we work.\n\n\"sorry, boss, but theres no discussion of negotiating a new rate due to the change in working conditions. theres nothing to discuss.\"",
            "company i subcontract for did something similar.\n\n\"hey, we need you to work the weekend so the devs can have new desks. overtime is approved\"\n\n\n\n\n\"am I getting time an a half?\"\n\n\n\"no\"\n\n\n\"then I'm working no more than 40 hrs'",
            "Cost cutting done by people who don’t know the history or about the job rarely comes out well.",
            "I have never worked unpaid overtime, whether salary or hourly. You pay me for 8hrs, you get 8hrs. Need me to stay late but want me to clock out, sorry I don't work for free. I have only ever outright quit twice using this policy. I had one boss tell me if I didn't stay to not bother coming back the next day. I took him at his word and went straight to the labor board, got my two weeks back pay and accrued vacation pay, plus I was eligible for unemployment for being (verbally) fired without cause. They weren't going to pay me for the overtime, but I was expected to be \"part of the team\", promising us there will be pizza, fuck the pizza I want to be paid, I can buy my own fucking pizza.",
            "My last job tried to bring up some section in the labor act that exempts employees with certain computer skills as a reason for not paying me overtime. They highlighted that but missed the very next sentence where that only applies to salaried employees. They were misclassifying me as independent contractor so that made no sense. They brought it up during my retaliation case which wasn't even relevant. The overtime case had already been brought up with the department of Labor and they lose just a month prior. That's how dumb they are.",
            "Well, I've been at the both end of the spectrum. It's like a lucky draw whether you land on an easy job or a tough one.\n\nI'm a salaryman. I get paid at a fix amount regardless of the workload. So I've some tough months with like 12-14 hours a day. But there are some chill moments like only 3-4 hours a day too.\n\nMy company is sport enough to not assign me (or anyone actually) the extra work when we are on the \"chill month\". They just told us to \"enjoy it while it lasts\".\n\nSo no complaint from me.",
            "Lucky you.  Work to rule (doing only the ostensible workweek hours) as a salaried person tends to put you on the list to be tossed (fired or \"let go\"). Something to do with not being a \"team player\", is sometimes how it is put.  The general argument that gets used is that they support you during slow times so you can pony up when push time comes. That is a valid view in some situations (certainly not all), where slack time is fairly frequent and press time is sporadic. The profit from the overtime supports your employ when you have make-do work for periods of the year.  Places where hourly staff gets furloughed or short weeks if the work is slack.  They keep salary because the time is sort of banked already.\n \nIt seems to me that, in most cases, your on-site work ought to be billable hours though, so the company would be getting paid for your time, and you ought to be paid for it as well.  They are probably charging 2.5-3x your unit wage, all the more reason you ought to get a slice.",
            "This reminds me of a remote job, where the client would only pay for 40 hours. It ended up being 4 10s, and three days of hotel/meals, as this was a remote job for everyone as the drive home was 4 hours. ironically the fuel bill in each company vehicle came in WAY over budget, as everyone drove home for a 3 day weekend, and made it work with the expenses...",
            "Yeesh these companies man",
            "Are you an employee of your company, which provides consulting services to clients? \n\nThere’s a very narrow range of positions which are overtime exempt when paid on a hourly basis, but plenty more that are exempt when paid on a salary basis with contractual bonus pay for working more hours.",
            "In obviously much nicer, I have reasonable overtime written into my contract, but I'm also pretty upfront about what is unreasonable. 1 if the overtime is planned pay me. 2 if the customer is being charged pay me.",
            "This type of post just warms my heart! It is so freaking amazing to be living in a time that people are learning to stand up for themselves and not take crap from their employers. \n\nI have heard so many times, how much better people's lives are once they've stood their ground and moved onto a better company. \n\nUgh, I don't have kids but this feeling must be close to watching them succeed at something you've watched them struggle with for years.",
            "This is the way.",
            "They pay for what they get. You want more work you pay more money",
            "Know Your Worth! Don't Work For Free!",
            "When exempt from fucking ot isn't enough...",
            "It sounds like you would have most leverage in this position. You should start checking the market to see how quickly you can get a new job.",
            "If they're not going to pay you past 40 hours, you're damn right to walk out the second you hit 40 hours.",
            "Lmao what is this “overtime” you speak of",
            "When manglement hands down an edict, they have made a decision, and will not brook argument until they see that it costs them dearly. I've been a union steward for a few years now, and quickly realised that my mantra of \"seek first to understand\" was both something new, and something that would help me come out with a net benefit more often than not.",
            "If you start as salary and that's what you negotiated it's one thing. But if you're paid hourly I'm pretty sure you can't be overtime exempt. Someone can correct me (if this isn't just elementary) but in most US states I believe this is illegal.",
            "Personally I think salary is a joke. I’ve been in salary roles and hourly and I much prefer hourly because of the potential for OT to be paid out. Some cases it wasn’t often but when you work in a salary role and you factor each hour you work- it’s ridiculously unfair.",
            "Damn, they were already screwing you on overtime when they tried that. Idiots",
            "You should post this on r/antiwork.",
            "Exactly!  Slavery has been illegal for a long time!",
            "How were you hourly and exempt, that doesn't make sense?",
            "This isn’t malicious. This is just normal. This is what people who aren’t morons do.",
            "This sub is a goldmine for anyone that thinks capitalism sucks.",
            "I think I’m fuckin dumb because I can’t understand this story smfh",
            "Unless you are specialised consultant or doing jobs where the employer is benefitted if you work longer hours (eg.fast food restaurants) why would they pay you on an hourly basis ??\n\nI can see how this is going to end. The new VPs or the board will come up with a revised salary structure (about slightly higher than what is the existing compensation )\n\nFor eg. Assume you get paid $10 per hour, so for an 8 hour shift you would be technically paid $10 x 8x 20 = $1600 per month.  (20 working days in a month with 4 weeks) add another $400 for the mileage expenses and traveling allowances and you make $2000 per month.\n\n\nNow when they  move to a salary based structure- they would ideally be paying  you say 10% higher - so yeah your base salary will now be $1600 + $160= 1760. But expect some reduction in the expense allowances, but still you would make say $2100 as opposed to $2000 earlier.\n\nNow here is where things get tricky. Since you are now paid on a monthly basis and not on hourly basis your working hours will shoot up, you could be asked (not often) to shoulder some additional burden especially if someone from your team is unwell or sick or on leave and also expected to be more available for work calls. They may also take a longer time to fill positions that are vacant. Effectively for a 5% bump in pay, you are going to work maybe 9 hours a day which makes it a total of 12.5% increment in working hours. You would, in most situations,  be getting the shorter end of the stick. \n\nNow is it bad, not exactly. Its a great system if you are able to work harder because that will get you promoted faster. The downside, if you are in your 40s , its gonna be little difficult to compete with the younger guys. \n\nBut yeah that's how things are probably gonna end up in your company. It could be even worse, but you always have an option of leaving. Their company, their rules and employees  don't get dictate terms.\n\nAs for the reasons the company is doing a overhaul of the existing structure,  my guess is that the new bosses want to show \"improvements in reduction of labour expenditure\" or pretty simple, someone's fucking the existing system and misusing the trust the company has, for their personal gain, thereby spoiling the party for everyone else.",
            "So what if you work under 40 hours? Should they cut your pay?",
            "13th amendment,  yes. But first you must be convicted (guilt in too many cases has been questionable though! )",
            "How is this a malicious compliance? This is literally just full 100% compliance, you did exactly what they wanted and they didn't change things for your sake or because you did anything different but just because they realized their mistake",
            "Oh relax",
            "r/workreform would appreciate this.",
            "I'm not sure what else they were expecting to happen.",
            "Cutting your pay by 20K and not being open to a discussion? They’re just asking you to leave without having to fire you.",
            "you would be surprised how many people work unpaid overtime because they think is \"expected\" \n\nThe fact of the matter is you shouldn't work a minute that isn't paid for. its not work at that point.\n\nHave a deadline that you aren't going to make? tell the boss you wont be able to make the deadline with the time you have left.\n\nIts your responsibility to manage your time while at work, but its their responsibility to make sure the workload is manageable.",
            "If they can bill your overtime..they can pay you",
            "To bad you guys didn't negotiate overtime on top of the 40/hrs a week. They canceled the old deal and there was no reason to go back to the old way"
        ]
    },
    {
        "post_id": "lqgoq1",
        "author": "freeasabird_ta",
        "title": "No contact unless it's via legal representation? OK.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lqgoq1/no_contact_unless_its_via_legal_representation_ok/",
        "score": 18747,
        "num_comments": 456,
        "created_utc": 1614081315.0,
        "selftext": "This happened about 15 years ago. Relatively early in my career as a web developer/software engineer, so some details are not remembered precisely. Names changed etc. Tldr at the bottom.\n\nAnyway, I thought I had landed a dream job at a small media company that had gone all-in on digital media and marketing a few years prior and had started to land some big clients (think NHS etc…).\n\nThe team comprised of two owners, we will call them Jeff and Nige. Jeff was the lighthearted, approachable and more tech-oriented member of this double act. Nige was the straight man, less approachable, and less likely to join us in any social antics but ultimately a seemingly decent guy and the main driver of the business. \n\nIn addition, there was an office manager, James, who was also Nige’s other half and Rachel, an office assistant and a good friend of Nige.\n\nThe rest of the workforce made up the media team which comprised of a senior and a junior designer, a senior and junior dev and me (another senior dev).\n\nWhat made this a dream job for me at the time? Well, on top of the fact they were doing some great work with what was, at the time, cutting edge technology, it was an overall great place to be. Flexible working hours, lots of holidays and lots of social events.\n\nTo give you a better idea, most lunchtimes Jeff and the media team would all go out for lunch together, or play a FIFA tournament, go to the pub to mob on a new idea etc. Most importantly for this story, every Friday we would all finish an hour early, at 4 pm instead of 5 pm, and head to the pub and have a couple (or more) drinks together.\n\nIt was a very open place to work at the time and the two owners were clear on how they expected the business to expand and our future positions within such an expanded company. Basically, all the guff any potential employer peddles when you interview but we were actually doing it and living it. \n\nThey were receptive to new ideas or different ways of doing things, and regularly included us in sales meetings and we could see the direction the company was going in. Everybody who worked there was excited and I honestly thought I’d be there for the rest of my career.\n\nThings, however, change.\n\nAs time went on the company became more successful, and with more success came more recognition, more clients, more money, and greed.\n\nI won’t go into too much detail, but by the time of the main event in this story a couple of years after starting there, this once open and relaxed workplace had become hell.\n\nThere were no longer flexible hours, you had to be in at 8.50 am to get ready at your machine and you didn’t power down until 5 pm at the earliest unless you had been asked to stay late to churn out more work (unpaid).\n\nNo more lunchtime socials, there was a lunchtime rota that stated who could go for lunch and when, so we could no longer take lunch together.\n\nDespite the ever-growing workload of more complex and larger websites, no new members were added to the team. Even when the other lead dev left, no replacement was found. On top of this, despite the growing workload and shortening deadlines, promises of raises and bonuses never came to fruition, which was especially galling when coupled with the fact both owners were by now getting a new car every 6 months.\n\nNigel also made it clear that with the success of the company as it was, his plan was to sell it at the ripe age of 45 (I think) and semi-retire to a life of travel writing and photography (despite being mediocre at both), without a second thought for the rest of us.\n\nThe business was now being run in a manner that allowed the owners to line their pockets with as much cash as possible whilst also making it look like a good takeover prospect.\n\nThe only perk that remained was the 4 pm Friday finish which by this time, instead of all going for a drink together, we just went home early. \n\nMorale was low.\n\nOne Friday afternoon, Nigel, Jeff and James went to visit a prospective client. Rachel was off for some reason which left nobody in charge of the office. \n\nExpecting the usual early finish everybody had completed their work by 4 pm, but having not received any word from the owners, we hung on. At around 4.50 pm and with nothing else to do we collectively decided to “fuck it”, lock up and go home.\n\nApparently, at about 4.51 pm Nige had tried to call the office, probably to tell us to go home, but of course, we had already left. Monday morning, every one of us was called into the main office, given a bollocking and told that a planned upcoming social was now cancelled (it probably already was anyway, but why not use it as a punishment) and that our wages were going to be docked for leaving early.\n\nNow, here in the UK, it is naughty to make deductions from a salary unless it is for some legally mandated reason, e.g. taxes, national insurance, student loan etc. or unless the employee has given explicit written permission so I didn’t think this last threat would actually happen.\n\nI didn’t have to wait long to find out as we were paid weekly, but sure enough, that Friday, there was a deduction from my wages as well as everybody else on the media team.\n\nI approached the owners about it, but I was basically given the same speech as on Monday morning previous.\n\nLaw has been a particular interest of mine, still is, and whilst I’m no lawyer nor any kind of expert, I know enough to stand up for myself and those around me, and so, with the backing of the rest of the media team I sent what may be considered a “Notice Before Action” just prior to leaving on Friday.\n\nThat NBA being a formally worded email to both owners stating my grievance, the illegal deduction from salary, and my proposed resolution, the repayment of the deducted salary in our next wage along with a formal apology to everybody on the team. Failure would mean the engagement of legal services.\n\nOn Monday morning the owners arrived late and instead of Nige’s customary visit to the media room to ask how we were\\* (\\*make sure we were slaving away) they both retreated directly to their office and shut the door. \n\nThis was shortly followed by an email to us all stating that due to my “threat” and after taking legal advice they had been told to cease direct communication with any of us until the matter was resolved. The resolution they wanted now being a full apology by me to them and the agreement that salary should remain deducted. Any communication should be via email.\n\nNow, I’m reasonably sure they hadn’t had any legal advice on the matter, or if they had, it was shit. \n\nFirstly, a decent solicitor would have told them they were idiots for doing what they did and to give the money back and apologise. Secondly, because the entire point of a Notice Before Action is to try and find a resolution prior to taking any legal action, in closing up shop in this manner they are practically forcing a legal engagement.\n\nMy belief is that they were simply calling my bluff, and didn’t believe I would take this any further. They reinforced this by adding to their email that any further communication about the deduction from our wages would need to come from my legal representation.\n\nI, of course, was not bluffing and complied with their request.\n\nWhat they didn’t know was that a member of my family was not only educated in employment law, albeit not an actual solicitor, but also a union representative at another company, so by the end of the day a legally drafted letter arrived on the owner’s desks laying out the illegalities of what had happened as well as the expected timeline of events going forward.\n\nWithin 30 days (I think) we were to have had a formal meeting between the owners and myself, with me entitled to legal representation present in that meeting, and with the expectation that my demands in the NBA were to be met as they had no defence.\n\nShould that not occur, this would be going to a tribunal or maybe even full court with the company liable for expenses. It was a slam dunk, so they would end up with a relatively hefty bill.\n\nInstead of folding, as I expected them to do, this led to them doubling down on their stupidity. Their door was permanently shut with very little direct communication between the whole media team and the owners, with it mostly being done by email, or via Rachel and James.\n\nAt this point, Rachel and James, who were obviously on good terms with Nige became openly hostile toward me. For a small example, Rachel would make everybody in the office a coffee in the morning, now it was everybody except me.\n\nSeemingly, neither the owners nor Rachel and James seemed to know or understand that I had the full backing of the rest of the team. \n\nThey didn’t have the know-how or the will to fight it themselves, but they were aware of the downhill direction in the working environment and that my actions were preventing the owners from further taking the piss in the future. Now the environment had become exceptionally toxic and nobody wanted to be there. \n\nThey, and I, started actively looking for different employment.\n\nIf I remember correctly, an extension was requested and granted but the deadline for the aforementioned meeting came and went so my representative sent another formal letter to my employers stating that we would be going to tribunal. \n\nIt also now stated that I would be leaving the company immediately and I would be claiming “Constructive Dismissal” due to the actions of the owners, James and Rachel which had all been logged over the previous weeks. \n\nThe only result of the extension they requested being an extra few weeks of workplace bullying logged.\n\nReceiving all this was the last straw and their resolve was broken. An apology was sent via email along with the promise that the money would be returned in our next paycheque.\n\nI’d had enough however and I immediately handed in my notice which I believe was 4 weeks. I hadn’t found another job, but I had decided to move to the city anyway and go freelance.\n\nBefore my notice period ended, the junior designer also handed her notice in, also to go freelance, and within a few months of me leaving the junior dev and the senior designer had done the same.\n\nThe business owned by Jeff and Nige was essentially dead, with many of their existing clients seeking us out to continue doing work for them on a freelance basis.\n\nI learned that Jeff and Nige eventually had a falling out, with Jeff resigning as a director and becoming CTO at another tech company. \n\nNige renamed and rebranded the old company and attempted to carry on somehow but to this day the examples of work on their web page are still the ones we made 15 years ago. Most of them aren’t actually his clients anymore or are defunct. \n\nI also later learned, as we had all suspected, that Jeff wanted nothing to do with the wage deductions etc. Although I’m not sure how hard he fought against it.\n\nAlthough I’ve not physically met them since the day I left, I am connected to everyone in the media team and they are all doing well. Jeff also reached out a few years later and he is doing well too.\n\nAs for Nige, James and Rachel, I have no idea. Rachel was close to retirement anyway, so I guess she was reasonably fine. \n\nLooking at the public details of the businesses Nige now owns it’s clear that none of them makes any money and his travel and photography blogs stopped being updated a few years ago. Nige’s (and James as his partner) plans to retire early and travel the world are probably now permanently on hold. As is his penchant for a new car every few months.\n\nAnd the amount deducted from our wage over which Nige lost his business and planned future for?\n\n£6.80p\n\nTldr; Owner illegally makes deductions to my salary and insists on only discussing it via legal representation, so I get legal representation and he loses his business and dreams.",
        "permalink": "/r/MaliciousCompliance/comments/lqgoq1/no_contact_unless_its_via_legal_representation_ok/",
        "comments": [
            "Wait a minute! ALL that hostility over Nigel not wanting to pay £6.80?! F'n idiot! Glad that greedy little pig was unable to \"retire\" early.",
            "Almost expected the threefiddy joke at the end.\n\nBut given the horrible working conditions; it's a wonder people stayed as long as they did.",
            "For fifty five paragraphs, you had my interest. With the fifty sixth you had my attention. \n\nThat’s like $10 USD. Way to stick to your principles.",
            "damn, this was more a tragedy than anything else. one of the best work environment's I have heard of got absolutely shat on and turned into a swamp full of greedy scumbags. human nature, ladies and gents, human nature.",
            "You write well.",
            "Take my free award dammit! This is priceless, it just boggles my mind how entrepreneurs forget how they started their business and who got them there. If it isn’t broke, don’t fix it! An employee that feels appreciated will always do more than is expected. Not to mention moral would be at a high. Start micromanaging and moral goes down and so does the company. What a stupid and crazy thing for them to do over few bucks. Serves them right!",
            "They destroyed their own business and likely their own lives.. over less than 10 bucks? Fucking morons. At least their pride’s intact! /s",
            "In the US it is also (super) illegal to deduct anything from anyone's paycheck without prior written *consent*, the obvious exception being any and all state and federal taxes. You have to sign up for and agree to health insurance, 401k retirement deductions, and the like.\n\nYou can, however, make deductions from salaried employees pay for no-shows (call outs, unpaid sick leave, unpaid vacation, etc), as long as it is a company *policy* and the employee was notified beforehand. Typically you have to have a record of them having notice of said policy (as in their signature saying that they read the policy). That becomes their *consent* (meaning they agreed) to have the money deducted because they knew it would be if they missed work. But, yes, here too. You canNOT take money from anyone's pay for any reason whatsoever if they didn't agree to it in writing first. That's, like, the first thing they teach you when doing payroll. I'm surprised they gave you any blowback about that at all. Especially if those were your agreed upon hours. Way to stand your ground, dude. Well played.",
            "The first rule of owning a business, never, EVER, tamper with an employee’s wages. The legalities vary from jurisdiction to jurisdiction, but without doubt, it ALWAYS instills district and acrimony towards the employer. \n\nMy employees received the majority of billable compensation, while my own compensation was a small ($5) management fee for every billable hour. If I wanted to increase my compensation, I could increase billable hours, either through additional workload, not my first choice, or by increasing the staffing level... but my compensation was no secret and if increased workload became necessary, which happened from time to time, the employees generating the increased billable hours benefitted directly the most.",
            "This. is. EPIC!!",
            "Destroying multi-million dollar businesses over $10 is my kink",
            "This would do rather well in one of the revenge subs like r/nuclearrevenge.",
            " \n\n>At this point, Rachel... became openly hostile toward me. For a small example, Rachel would make everybody in the office a coffee in the morning, now it was everybody except me.\n\nconsidering this as open hostility is the most british thing i've ever read",
            "I was reading along and cheering you on all the way and then I got to the amount they deducted. They tried to call your bluff over an amount less than a pack of cigarettes costs?! My eyes almost popped out my head!  GLORIOUS!",
            "Old boss tried this with me once. I'd fucked up and cost a client about £100 on a survey fee for a house they were buying. Totally my fault and I took ownership of it but I also knew that when my boss wanted to reimburse the client and deduct it from my wage that it was illegal to do so. It's a company expense, not mine.\n\nMy step mum is a retired lawyer specialising in employment law so I ran by her what my boss had said and she said she'd have no issues writing a legal letter if need be. When my boss threatened someone else for a perceived mistake and said any future expenses would be deducted from our salaries I told my colleague not to worry. Nothing came of it in the end, he was all tall, but it feels good knowing you're in the right from a legal point of view.",
            "That is the best punchline ever. £6.80p. What a bell end.",
            "\"Now, here in the UK, it is naughty to make deductions...\"\n\nThis might be the most British line I have ever read.",
            "I love stories where employers get their comeuppance. I've been taken advantage of quite a few times and unfortunately wasn't able to take things to court because the upfront fees for legal representatation and court fees are high where I live.  So I doubly enjoy other people's revenge stories, well done!",
            "Good for you!! The owners of the multi-million dollar companies, built on the backs of good, loyal employees are such a joy to watch fall. Especially when the staff was gaslighted into believing they will be brought along on the ride to success!!\n\nMine was asking for a raise to be even with the the young pretty blondes that were hired after me and that I trained. Fired for talking about wages. Long story short - the legal shit storm that followed cost them more than twice as much as giving me the raise that would have seen me thru retirement. Ahhh ... Makes me giggle.",
            "I'm so glad you saved the deducted amount until the end.\n\nBravo OP what a tale.",
            "That last line buildup was gold.",
            "> The business was now being run in a manner that allowed the owners to  line their pockets with as much cash as possible whilst also making it  look like a good takeover prospect. \n\nOh, have I been there, had that done to me, and had the cost of the t-shirt deducted from my redundancy (while the company founders got massive golden parachutes, of course).",
            "This rocks!  I will never understand why owners/bosses get so greedy that they forget who actually makes the business run. Why shouldn’t everyone share in the success that everyone is creating.",
            "> What they didn’t know was that a member of my family was not only educated in employment law, albeit not an actual solicitor, but also a union representative\n\nAnd it was at this moment I knew OP's former employer was toast.",
            "So was it all worth 34 pounds in total? I'm sure for you it was.",
            "Damn. I AM an employment lawyer so this read was mildly interesting, but that punchline at the end.. Phenomenal.",
            "Holy shit, what a reveal! All of that over 6.80? FFS",
            "When I read this story, I totally was reminded of this anonymous poem I read as a child. I think it was supposed to be about the War of the Roses, but I'm not certain. The one little thing that brought down the company.\n\nFor Want of a Nail\nby Anon\n\nFor want of a nail the shoe was lost.\n\nFor want of a shoe the horse was lost.\n\nFor want of a horse the rider was lost.\n\nFor want of a rider the battle was lost.\n\nFor want of a battle the kingdom was lost.\n\nAnd all for the want of a horseshoe nail.",
            "BEAUTIFUL! BRAVO! ENCORE!\nOP took down a whole greedy company!",
            "Did you get the  £6.80p?",
            "For the sake of  £6.80p a business closed down... \n\n&#x200B;\n\nthis.is.SPARTA!!!",
            "Worth the read. That’s ending man. Holy cow.",
            "Here’s the part I don’t get, they were successfully building a company with the laid back environment, what was the logic of becoming more hardcore?",
            "You destroyed a mans company over £6.08... amazing! The fact that his pig headed Stubborness was his own downfall over that little is hilarious",
            "Holy shit, that was a good read and to top it off was the value of the deduction it started from!",
            "Awsome, that last line got me!",
            "Nigel may be modiocre at writing, but you sure got talent OP",
            "I often read these and end up wanting more or a better ending, but this? Finding out that guy lost out on his dream life over that level of pettiness??? Lmao I couldn’t be happier",
            "I am SHOOK. \n\nThese mofos ended their business over the price of a sandwich.",
            "I feel like I just read a screenplay for a movie, or like a UK version of Silicon Valley. I mean it hits all the beats of a good story structure. It even has the \"where are they now\" montage at the end (cue Walk of life by Dire straits)",
            "I've seen this exact kind of shit in my wife's place of employment. \n\nWhen we met she loved her job.  A relaxed environment that really focused on making sure employees were happy and relaxed so they could do their best work.  Flexible working hours, various lunch get togethers, fridays were days when they'd bring in kegs and let people have a couple drink at the end of the day, and they threw some of the most outrageous holiday parties.  Open bar, live music, great food, raffles for TVs/iPads etc.  The company was making money and everyone enjoyed working there.\n\nThen suddenly there was talk of them getting bought out.  They had to go corporate so the owners could sell off, make their money, and get out.  No more relaxed environment, no more flexible hours, no more booze, no more parties.  Suddenly it was 9-5 with no exceptions unless you had explicit reasons.  Work was crammed down everyone's throats to increase profitability and make the company look as good as possible for a sale.  The products were oversold to new customers and under supported, everyone was running at %500 utilization on case work, etc.  The place became hell.\n\nOnce they sold things eased a bit, yeah the new owners weren't as nice as the old ones in the beginning but they came in and provided much needed support and a more relaxed atmosphere (if still with a larger corporate mindset).  Ultimately a lot of toxic management was shitcanned by the new owners and things are ok now.",
            "Dude, you should post this in r/prorevenge,\n\nPs, wjat was the company fined, or was it only the wages?",
            "IDK why companies have this mindset that they need to change what was already working. Let's be honest part of the reason the company was so successful is because of how happy the employees were and happy employees tend to mean successful employees. Had they just stayed the path, grew the staff with the work I'm sure they would've been able to retire even earlier.",
            "Well done. Although there is no way their failure to pay £6.80 amounts to a constructive dismissal (assuming you were presenting to work, working and getting paid).",
            "I sacrificed precious sleep after breastfeeding to finish reading this. How glorious. \n\n10/10 would sacrifice again!",
            "This deserves to be cross posted to /r/prorevenge.\n\nUtterly spectacular, and a wonderful read. Thanks for sharing.",
            "That was a fun read. And they deserved it.",
            "[removed]",
            "Absolutely satisfying to read. Well done",
            "Good, long story but I don’t sense any delicious MC\n\nJust you standing up for your rights... and you never had your lawyer represent you ... and you quit before it went to court ... and before  you and others got you’re missing wages\n\nEdit:  with 13K upvotes, I guess I’m wrong",
            "That was really really long.",
            "Standing ovation! What a couple of idiots. They ruined the good that they had for greed...",
            "I would have paid that easily, more so with so few employees. Hell I could double it",
            "Thank you Karma!!!",
            "Regardless of the deduction, these guys were shitty people. The whole business plan sounds incredibly shitty. How tone deaf can you get?",
            "£6.80?! Wow. What an incredible self own for less than the cost of a fast food meal.",
            "You've had me giggling the whole way through, but the amount of deduction made me burst out laughing 😂 hahahhha Nigel, you petty little arse. No doubt he has learnt something from the experience.",
            "Ego",
            "Man, nice micdrop at the end there.... 6.80. Sweet Jebus.",
            "This was very satisfying to read and I’m glad you stood up for yourself and the others. Lately it’s just so scary to do that for fear of being dropped. I know a lot of folks will say just get another job, job hunting is a bitch these days even without the cloud of a pandemic and/or recession making things even more difficult. Every time I left a job, it was due to poor leadership. You end up over worked and unappreciated; raises don’t exist or stopped existing but the amount of work and responsibilities continued to increase.",
            "£6.80p per person? Or is this altogether (how many people)?",
            "Why would they think that the rest of the crew wasn't on your side?! \"Hey we docked your pay and this person is fighting that, so you're on our side, right?\"",
            "Raclure de bidet.",
            "\" And so the mighty empire of Rome falls \"",
            "I have to ask this: when the company started go big and the working conditions became worse, why not just talk to the boss and ask what’s going on? Tell them about how this new reality is making things worse and ask them if the new clients warrants taking the whole company is such a worse direction.",
            "When you pick a hill to die on, make sure it’s worth it.",
            "This story gave me the horn",
            "[Love it when morons double down.](https://i.gifer.com/g3a3.gif)",
            ":D :D :D :D\n\nr/ProRevenge needs to hear about this.",
            "As an american, I'm so fucking jealous.\n\nWe get majorly fucked and have no recourse.\n\nYou get minorly inconvenienced and the law is on your side.",
            "About tree fiddy",
            "£6.80 each, or £6.80 total?",
            "[deleted]",
            "Bravo.  Well done.",
            "r/PettyCompliance  \n\n\nnever knew this existed",
            "Fantastic writing & an epic takedown. Your story belongs on r/prorevenge! Thank you for sharing!",
            "Oh this is just GLORIOUS. Bravo, OP!",
            "Was this really a toxic environment or did you just get pissed and sought revenge in any possible way because two business owners actually realized that you cannot run a successful company with employees dicking around during 2-hour fifa lunch breaks every day and finishing their work day at 4am? Actually, am I right to understand that your former job « became hell » because they asked you guys to work between 8:50am - 5pm? How dare they .. this is outrageous! \n\nAlso, I can bet you my weight in gold that you didn’t leave « around 4:50pm » on this Friday.  \n\nThe simple fact that you now rejoice over their failure pretty much tells it all.",
            "£6.50?! Absolutely brutal. One of the best examples of \"it's not about the money, it's about the principle\".",
            "Can we get a XXL flair on this, please.",
            "r/ProRevenge",
            "This should be a case study for Harward Business School curriculum. With an epic title “How to screw your business over £6.80”.",
            "tldr was all i needed goddamn thats a book",
            "Pigs get fat, hogs get slaughtered...",
            "You kinda deserved to work there that long",
            "[deleted]",
            "And that company...was Google",
            "You are a true hero",
            "Would this be considered r/ProRevenge?",
            "That total at the end was just the perfect cherry on a brilliant cake with exquisite icing!! Bravo!!",
            "Hahahhaa! That's brilliant. Silly fools. Good on you. All of that for less than £7",
            "It's nice being related to someone with legal experience. My SIL is a lawyer.",
            "Oh, that was beautiful. Bravo.",
            "This man got destroyed",
            "You actually kept me rather entertained",
            "Great story! And you are a wonderful storyteller and writer.",
            "Most start ups have the goal of selling before the owners get old. That's how they make their money.",
            "Don’t get any good representation.",
            "r/prorevenge",
            "Lol. It's just accurate representation of the industry.",
            "What a fucking mong, of all the sketchy things you’re gonna pull blatant wage theft in the UK is probably the dumbest.",
            "Why is this legal",
            "A great read and a great thread, nice one. I have to know, did you sue for constructive dismissal?",
            "You are my actual hero.",
            "Thank you for the follow through.",
            "oh shit. Did this company employ hundreds if not thousands of 'telecontractor' freelance web & graphic designers thru a central pipeline service?",
            "Why is this legal",
            "Can you dm me this workplace to make sure that I never work there? I'm in my final year at uni now and UK based.",
            "That penultimate line was really something!",
            "Sadly, it's not religion!\"",
            "Sadly, it's not religion!\"",
            "Why is this legal",
            "Great revenge!!",
            "No such thing as casual heroin use.",
            "Ugh similar greed happened to my father and brother in law. FIL was just one day let go of his job along with others so, he was forced to find another job. The job was a small business, up and coming company with a lighthearted atmosphere- at first. Nerf guns were given to the employees and they had some exercise classes set up. FIL was happy there and when BIL came back from the army, he found a job there as did my husband’s cousin, J. All were doing well.\n\nThen the hell started, I believe two years in. The company expanded and the owner started to make promises he couldn’t keep to clients. Overtime was mandatory and often my FIL was sent to out of state test the product. Morale was low and people were working with burn out. \n\nFIL ended up retiring for his sanity and BIL found a new job. J ended up going in a different direction too. I don’t remember what happened to the company but I don’t think the product took off. A bunch of people left and got mad at the owner.",
            "This needs a drop in r/prorevenge",
            "Great job. Nucular revemge",
            "This sounds like where I work. This wouldn't happen to be a rostering software company based in Richmond would it?",
            "This was actually maliciously compliant. Thank you!",
            "Brilliant!",
            "Beautiful work, champ.",
            "Hey OP. I thought I was on r/ProRevenge until just now, when I double checked the subreddit you posted on. This would fit the subreddit I mentioned like a charm!\n\nFucking idiots, losing everything over cheapening out for what? The price of a burger and a couple beers?",
            "Woah! That's a long one, but it was worth it. He got what was coming to him",
            "This makes me so happy. It always feels like we have so little control and taking some of it back- good on you. Massive props",
            "Lovely stuff, fuck them and their new cars. Glad it hit them in the pocket, it's the only way they'll learn.",
            "I lived a Jeff and Nigel situation in my first job, and I can see my Nigel doing something stupid as that in the near future.",
            "It's always pleasant to read how greedy, shameless, Big little pigs get what they deserve, and blow up their endeavours for little pennies",
            "Assuming the deduction happened to five employees, and that your deduction was average (it was probably a bit above average, as you were a senior dev), this was all for 34 quid.  That's hilarious.",
            "I wonder if you could have gone after them for unpaid OT...."
        ]
    }
]