[
    {
        "post_id": "632g88",
        "author": "deadline54",
        "title": "Terrible boss and the dress code.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/632g88/terrible_boss_and_the_dress_code/",
        "score": 18573,
        "num_comments": 562,
        "created_utc": 1491169248.0,
        "selftext": "This boss has since been fired, which makes this story so much sweeter, but this man was a Grade A Douchenozzle while he was there. Fired a coworker who's been there for years over petty shit. Constantly reminding people he was their boss. Asked me to do nonsense work and when I questioned it he just said he was in charge. Threatened to fire me multiple times for being \"disobedient\". Luckily I was trained to do a job only 3 people were trained to do and the coworker he fired was one of them. \n\nAnyway, he called everyone for a meeting about the dress code and said there were people not tucking their shirts in. Whatever, I always had my shirt tucked in so I thought I'd get left alone for a day. \n\nNope. \n\nHe comes over with the dress code printed out and says we have to talk. I asked what was up since I had a tucked in button up on. He said my undershirt was light grey and the rules say it has to be white or navy blue. You've got to be fucking kidding me. So I looked through the company rules and it said you can have 2 top buttons undone and if an undershirt is worn it must be white or blue. If. So the next day I came in without an undershirt and the top 2 buttons undone. I forgot to mention, I'm a hairy motherfucker. And I fluffed up my thick ass chest hair so it was poofing out like an Italian mobster. I sat directly across from him at the meeting and kept leaning forward. He looked visibly uncomfortable and after the meeting I saw him frantically looking through the rulebook. He must not have found anything cause he never mentioned it again.",
        "permalink": "/r/MaliciousCompliance/comments/632g88/terrible_boss_and_the_dress_code/",
        "comments": [
            "I really hate people whose superior position has risen to their head. Like we get it, you are our boss, stop being a dickhead about it ",
            "There's a word for this particular breed of asshole.\n\nFrom Wikipedia: \n\n> A [Jobsworth](https://en.wikipedia.org/wiki/Jobsworth) is a person who uses their job description in a deliberately uncooperative way, or who seemingly delights in acting in an obstructive or unhelpful manner. **The term can also be applied to those who uphold petty rules even at the expense of humanity or common sense.**\n\n",
            "I work for Jimmy Johns and the only undershirts you can wear are compression shirts, either black or white. So I had been wearing a white one for a while and then just suddenly one cold winter day I'm told I have to take it off because now they only allow black compression shirts. Cool. \n\nJust random fucking bullshit that doesn't affect anything. ",
            "[deleted]",
            "Stuff like this is one of the reasons I took a pay cut to work at my current job.  Dress code is \"do your laundry, don't let anything hang out that shouldn't be hanging out\".  \n\nThe VP of my department walks around in tshirts, shorts, and flip-flops.  I've worn long pants to this job exactly ONCE in a year and a half.  None of us deal directly with customers in person, so we wear what we want.",
            "Had a boss, Executive VP level come to me with a vague bit of information \"Hey, I heard a thing about this group, see what you can find out and let me know whether we should hget involved\".  I researched it and made a determination that we were already involved in a more active and productive way.  He disagreed ripped me a new one and asked me how I could be so irresponsible for saying it was nothing we should get involved with.  \n\nHe had me prepare a presentation to give to his boss, I and our entire team were there.  Slide #2, 5 minutes into the presentation and his boss asks \"aren't we already doing this in a more effective way?\" And stopped the meeting.  Happiest moment at that job.  ",
            "Good one. I've got more hair on my legs than my chest so I would have worn a kilt in that situation.  :-) ",
            "I had a HR person who did something similar, except casual day had to be on Friday or the day before a holiday, and T-shirts could only be industry related or from a college.\n\nSo, I bought a bunch of fake college shirts, from Miskatonic U and the Klingon War Academy, etc.  I also bought shirts from open source projects we use propagandizing free speech and the right to code.\n\nRequirement swiftly disappeared.",
            "I have a related dress code story  I had a boss that absolutely hated me (feeling was mutual and we'll known). We worked overnight at Walmart.  To give you an idea of how much of an asshole he was, he got a 70 year old man, that worked for Walmart for 30 years, fired for forgetting to ring up a Snickers bar someone was holding when he rang up all of their groceries. Real shit head. \n\nAnyway, I wore cargo pants because I had to carry my badge box cutter, headphones, all that sort of shit and I don't like cluttered pockets. So, he was always finding ways to disrupt my day. He wrote me up for going to the bathroom (abandoning my department), which I got taken off. One \"morning\" meeting (we had them every start of shift) he talked about how cargo pants were against company dress code policy and he would wrote up anyone wearing them. People looked directly at me, as I was the only one who wore cargo pants that shift. He was just being an ass. AND, I must add, he was a \"preacher\" so when Sunday night would roll around he would show up in zoot suits and shit. Like, Steve Harvey style purple suits with purple alligator skin shoes on. To work. At Walmart. And he is lecturing ME about dress code. \n\nWell I spoke to his boss about it and he assured me that he wouldn't allow any write ups for it. I also printed out the dress code and carried it in one of my many pockets. \n\nHe was overnight for two years. Then he transferred to Texas. He was there for 2 months and they flipped his truck with the forklift in the parking lot. That truck was his baby. He loved it more than his 10 children.  Sweet justice. \n\nFuck that guy. ",
            "Have something similar going on right now. My boss has absolutely no issues with me, I get all my work done and work my ass off.\n\nHis boss? Got a bug up his ass about which hours people are at work. Not how many hours, or how much work, the only thing he cares about is that people are there between 9 and 5. Doesn't matter that I'm salary and there  10:45AM-9PM and get more work done than anyone else, to him that's irrelevant. Doesn't matter that I'm almost completely useless before 10:30AM, or that it's hard to work with other people in the office. \n\nNope, doesn't matter if I'm the least effective employee I can be, as long as I'm there from 9-5.\n\nHe got really pissed Friday when all the servers went down at 4:59PM and I just left without saying a word. So when he called me 5 minutes later, I answered the phone with \"You demand I be in there at 9 with absolutely no wiggle room, so I leave at 5 with absolutely no wiggle room. Be careful what you ask for.\" and hung up without waiting for an answer. \n\nI'll find out if I have a job tomorrow. \n\nUPDATE: I still have a job, a very amused direct boss, and a very annoyed boss's boss.",
            "I've had a boss get on me about the color of my socks. It was at Office Depot and we had to wear black pants, shoes, and socks. I get that it looks professional, but I stood behind a register all day, why does it matter? Do customers notice these things? \n\nAt another job I was required to buy uniform shirts. They gave me used and damaged shirts. I wore them every day and refuse to buy more. The collar on one polo had completely separated and frayed into a fluff before they gave me a replacement for free. When I quit, the manager asked for my shirts back. I asked for my $30 back. Ended that real quick. ",
            "This reminds me of the time I was working for a design agency in Manchester UK. The Managing Director was generally okay, but he'd go through periods of micro managing the employees, to an insane degree. \n\nOn this occasion, he'd decided (on a whim) that everyone should be wearing shirts with collars. We'd never had a dress code as far as I'm aware. We all used to wear jeans, shirts, tshirts, whatever we liked.\n\nOne of my colleagues came into work that day wear a decent designer tshirt (plain, no slogans or anything offensive) and smart chino type trousers. He looked perfectly fine and smart.\n\nThe (somewhat embarrassed) studio manager has to asked the guy, who was relatively senior in the company, to go home and change as the MD had said he needed to be wearing a shirt with a collar... Argument ensues, as the guy lives over an hours round trip away. He eventually says \"Fine!\" and storms off home...\n\nHe returns over an hour later in a scruffy pair of jeans and a Manchester Utd top... the kit at the time had a collar. Legend.\n\nHe did get sent home again, but we're all salaried, so it was the MD's money he was wasting, and it was totally worth it to see the look on my boss's face. ",
            "I used to work in an office where shorts were not allowed, but dresses were.  There was no gender assigned to these rules so on a blisteringly hot summer day, my male coworker showed up in a dress.\n\n(yes, he had a change of clothes.  it was more of a joke than anything, the company tended to treat its employees pretty fairly)",
            "Had a boss just like this. Just. Like. This. Years ago. \n\nHe had fired *a lot* of people over petty shit as well. Napoleon complex and all. \n\nHe sent me an email that was intended for the woman whom he was cheating on his wife with. \n\nHe scrambled in screaming at me to delete the email 10 minutes later. But I had already read it and copied it for later use. He watched me delete it from my computer however, he looked relieved. \n\nYears later and many many people he had fired fired later (all petty shit) - I also find myself at the end of his boot. Why? I had a wooden #2 pencil tucked behind my ear - says I'm stealing. Fired me on the spot. All access codes and cards disabled he even tried to fight my filing for unemployment. \n\nI'd had enough of him. So since I knew the entire company blanket email address and that of his wife and all his friends, decided to forward that email anonymously and via a proxy on a throwaway email of that really raunchy and explicit emailing that he had sent using his work email accidentally to mine several years before. \n\nTurns out *all* his friends dropped him, wife divorced him and took him for a ride out of all money he'd acquired through all those Back door deals he was stealing from the company to make, she took half everything else and got the house. He was later fired as several people had come forward to sue the company over this \"boss\". \n\nLast I heard he had a measly simple job at a small company who's boss was ironically, just like he had been. \n\n\n\n",
            "That reminds me of when my old manager (that antagonized me) having already changed the uniform twice already said we could only wear polos or v necks fully intending for men to wear the polos and the women to wear the v's. What he failed to do was actually write it in the new rules so I wore a v-neck deep enough that it was between my nipples just to spite him. The best part is I'm somewhere between Robin Williams and Sasquatch on the hair scale. And corporate wasn't about to let him mess with uniforms again so I wore that until the day I quit. ",
            "I have a similar story but its the opposite of what happened to you. I had a manager named Dave back when I worked at a grocery store. One day, the district manager called and announced he was coming. Now for reasons, Dave liked to leave the top two buttons of his button up uniform shirt unbuttoned. The store manager told Dave that he had to have every button except the top one buttoned since that was the uniform and the store had to look good before the dm arrived. Dave flipped out, and started yelling \"But Sarah doesn't button both of her top buttons and you can see her CLEAVAGE. Jasmin doesn't button both of her top buttons and you can see her CLEAVAGE. Why do I have to do it?\"\nThe store manager told him it was just because he had chest hair sticking out and it was unsanitary. Now Dave did have a lot of chest hair, and he wore it proudly where that second button should have been. However, Dave didn't let this experience set him back. The next day I'm in the break room and Dave walks in with the second button unbuttoned and his chest shaven.  He proclaimed proudly that now they will have to let him unbutton the second button and says he's gonna go talk to the store manager right now.  I told him thats a great idea and we walked down to the store manager's office.  Dave walks in and says \"Hey Jeff, I shaved my chest so now you will have to let me leave the second button unbuttoned.\" The store manager goes quiet and stares at Dave for about 5 seconds and yells \"GET THE FUCK OUTTA MY OFFICE.\" Dave waited a few more months to push the issue again, but since the store manager was worried that Dave might say something he switched him off the mornings and into the evenings (Dave hated working mornings). I think they developed a pretty good relationship after that though so I guess it all worked out.",
            "Fraternity president back in college ranted and raved about people not wearing neck ties to meetings.  Said anyone not wearing a tie would not be admitted and fined for missing meeting.  One guy came down for meeting wearing a tie and nothing else.  \n\nI'm still looking for opportunity to do this at work. ",
            "In my youth (Early 1990's) I worked for a Marriott hotel. I progressed from host to busboy to waiter, to training waiter to bar-back and eventually to bartender. At one point when I was the training water, I was asked if I wanted to be an assistant restaurant manager. I was in college at the time with personal goals, so I declined. It was just a job to me.\n\nI was in my 20's. A clean shaven thin white guy, but with long hair, (not very popular at the time) which I always kept in about a 8\" ponytail. \n\nThe manager who was hoping to groom me for assistant manager was so beside himself that I declined his gracious offer to join their management team, that he whipped out the employee handbook and told me that I had to cut my hair or I would lose my job. It was straight up a spiteful move. It was right there, in print. After about 2 weeks of contemplation, I decided to cut my hair. Hell, it would grow back, and I had been working there for about 7 years.\n\nHowever... in the very manual that said my hair could not be longer than shoulder length, it also spelled out that male waitstaff had to wear black pants and black shoes. *Nothing* was said on any page about the color of the socks. Women's stockings were mentioned, but nothing about men's socks. So... I went out and bought a rainbow assortment of neon colored socks and wore them with my black pants and shoes. They were pretty hard to miss.\n\nSeveral times that same manager mentioned my how my socks weren't appropriate, and all I had to say was, \"Show me in the manual where I can't wear them, and I will comply. Just like I did with my hair.\" He looked, he studied and he came up with nothing.\n\nI graduated about 6-8 months later and left the company on my own terms, but it felt really good to at least have beat them at their own \"manual\" game for a little while.\n\nFor what it's worth, I'm pretty certain that I made that manager submit a modification request to the corporation about the employee manual to include sock color for future dress code compliance.",
            "[Relevant.](https://images.hellogiggles.com/uploads/2016/01/12/giphy.gif)",
            "Definition of a chicken shit boss there.  I've had one before.  It's because they are incompetent and don't know how to do anything of value.",
            "One of my Dads friends when they worked at an airport got called out for not following the dress code, he spent 4 hours going through it and found out it hadn't been updated since 1949 so he came in a full fancy dress that followed the rules to the letter with socks above the knee and over the pants and all! He also rode in on a horse down the car lane and demanded free stabling as it was provided in the rules.",
            "Strict dress codes are ridiculous.\n\nI was once written up because my white undershirt was \"cream\" colored instead of white. \n\nThere were about 2 square inches of undershirt visible underneath my long-sleeved pullover that was part of the uniform.",
            "I have this mental image of OP getting ready in the morning with a hair pick.\n\nFluff\n\nFluff\n\nFluff",
            "Good for you! I wish my co-workers would've come to work with their chest mane all fluffed. \n\nThen again I had all female coworkers so that might've been weird if they had...",
            "Those are some really strict rules. Where the hell do you work?",
            "As a gay man into beard I have a coworker who does this and it made me finally appreciate how distracted straight guys can get by cleavage.",
            "I once had an unusually punctilious assistant at a start-up who spent a good half of his day digging through the employee handbook, seemingly for fun. The problem was that it was written hastily by our German investors, who understood that employee handbooks were something Americans considered mandatory to avoid being sued more than once an hour, and as such the level of detail was inconsistent. As a result, my assistant would occasionally come to my office and announce that he was taking one of his permissible twice-daily ten-minute breaks, for instance, or ask where he could find the water cooler to which the handbook claimed he was entitled.   \n\nEventually I got bored of his time-wasting, so I dug through the book myself, and discovered that (and I paraphrase) \"Employee clothing guidelines are dictated by that employee's superiors as per their preferences for that office's dress code.\" Since it was a ten-person company of which I was technically the boss, I informed my assistant that I'd decided that everyone in a non-technical role (that is, him) would be required to wear only alligator-themed shirts, beginning immediately.  \n  \nBeing a benevolent boss, I cut him some slack on that day, and the following morning I made it clear that there would be disciplinary repercussions (as per the handbook) if he failed to comply. On Monday he showed up in a t-shirt adorned with a grinning cartoon reptile, and asked if that would suffice. I noted that, due to the shape of the snout, it was certainly a crocodile pictured, thereby rendering the shirt non-compliant.   \n\nI never saw the handbook again after that.",
            "I pictured you as a woman until the fourth last line... then I realised you were an Italian woman.",
            "We need pics of this manly pelt.",
            "The guy is probably the president of an HOA now.",
            "I just got a justice boner reading this. Good work, you hairy motherfucker!",
            "If you need to remind your subjects you are king, then you are no true king.",
            "The dumbest thing about this story is a light grey shirt is correct. When you wear a white shirt under a white button up, it's easy to see it through the dress shirt, but a light grey one will blend in better for whatever reason. It's weird I know, but true. \n\nFuck that guy. ",
            "The real question here is, have you permanently adopted your Italian mobster alter-ego? ",
            "Sooo, how about those TPS reports.....",
            "I would have loved to have seen his face when he realized that what you were doing is perfectly allowable.",
            "Enforcing that dress code like a middle-school hall monitor!  I don't know how people like that even get into positions of responsibility.",
            ">And I fluffed up my thick ass chest hair so it was poofing out like an Italian mobster.\n\nGod that is SO evocative. :)",
            " How is this NSFW?",
            "r/PettyRevenge",
            "I'm picturing you as a woman and getting much more enjoyment out of this story.",
            "I have to say good on you for wearing gray undershirts. It makes them practically invisible underneath dress shirts. Looks much better than a white undershirt. That's a really strange rule though. ",
            "\"like an Italian mobster\". Best thing I've read in days. Thank you.",
            "Plot twist, op is a woman. 😀",
            "I've been seeing this sub pop up in all from time to time but you're story made me laugh and actually subscribe.",
            ">  it said you can have 2 top buttons undone and if an undershirt is worn it must be white or blue.\n\nWhat in the actual fuck? Who enforces a dress code like this?\n\nIn my company we have two offices. One where a majority of the workers are and one where all the big wig execs are. Now if you go to the main office, you dress up a little. Some nicer pants, a button down shirt. At the regular office you can pretty well wear what you want. I go to work in jeans and a t-shirt most days, might throw the odd button down on every now and then. Perfectly acceptable attire. Why would I sit in a cubicle all day and be uncomfortable in a job where 95% of my interactions are with colleagues in my department related to something I'm working on?",
            ">Constantly reminding people he was their boss.\n\nIf you have to do this, you're a terrible boss.",
            "Point for passive aggressive chest hair use.",
            "That black sweater isn't to code ",
            "I love the mental image of your fluffed up chest afro peeping out at your boss, rustling his Jimmies.\n\nStay fabulous you half gorilla.",
            "I was written up once because my skirt was \"too flouncy\".  When I asked what that meant, so I wouldn't repeat the mistake, I was told, \"it troubles me that I'd *have* to tell you.\"\n\nStill have no idea what they meant.",
            "Similar story, was in the Marines and a fellow Sgt of mine was a hairy MF'er and would neglect to wear an undershirt in uniform (very similar uniform regs, must be certain color if worn but not required) as often as possible. Gave the Staff NCOs fits every single time while the rest of us were laughing our asses off. ",
            "A consistent theme among all of the worst bosses I've ever had is nitpicking about dress code. I was waiting tables at this place awhile back where one of the managers had a huge stick up her ass about dress code. The restaurant itself was medium scale, most entrees were <$30, it even had the word diner in the name. So don't think this was some super high end establishment. Well one day I made the mistake of forgetting my black socks, I only had white socks on. I figured NBD I'm wearing an otherwise clean and pressed uniform of long pants and clogs, so who is even going to see my socks? Naturally the uniform witch is working that day and naturally she sees my socks and naturally she sends me home for the day. She'd rather understaff her restaurant than have someone on the floor with white socks on. Later they brought this incident up at my performance review where I got 3/5 stars on the \"uniform\" section. They docked me a star for wearing the wrong socks once 6 months prior and this placed me further down on the list for getting shifts in the off-season. But wait you say, the scale goes to 5 and you got a 3!! Yes, well, apparently the maximum that anyone can ever get in any category is 4 stars because \"there's always room for improvement! :)\"",
            "So one of my bosses at the place I worked did every like this. By the book, I mean. Even the little tiny things, just like you said the undershirts and what not, MUST be followed. Well, we work at Burger King so the shifts were opening, mid-shift, and closing (for managers, that is. I was a manager, but she was an assistant. I don't know where she's at now, but I left a few years back). *Anyway*, whenever she opened or closed, she didn't follow any of the rules until another manager came in, then she made the crew members fix everything she didn't do (like stocking and stuff) and quickly yelled at everyone for not following the rules and doing stuff earlier. She was a vial cunt and I hope she got fired at some point.",
            "Up vote because douchenozzle.",
            "Reminds me of this:\n\nhttps://www.youtube.com/watch?v=NisCkxU544c",
            "Sounds like your boss was Bill Lumbergh",
            "What did he get fired for?",
            "Passive aggression for the win! ",
            "Upvote for the evocative \"Italian mobster\" comment.  ",
            "He needs to learn how to be a leader, rather than just a \"boss.\"",
            "Italian mobster shoots a lobster...",
            "Sounds like your boss is a Dwight ",
            "Where the fuck do you work? The army? Does it matter what you wear?",
            "Can you demonstrate said puffed chest hair for science? ",
            "The story gets better if I imagine you're a woman.",
            "You need to tell us how and why he got fired.",
            "I quit working at Olive Garden as a Line Cook over the color of my green shoes. Rule book did say black. But they guy wanted me to go home that second and change them instead of hey next time can you wear black shoes. I wore them many of times before this incident and I was working in the kitchen where nobody saw me.  I was pissed over how he asked then the rule itself.",
            "lol an \"Italian mobster\" I like the reference.",
            "This story becomes funnier if you imagine OP is female.",
            "I, too, have a boar bristled brush on my chest\n\nIt's fucking annoying",
            "Frantically looking through the rulebook after the meeting?\n\nMore like consulting the owner's manual on how to control a boner.",
            "I kind of feel bad for your former boss. They seem mentally ill. ",
            "How do you get rid of the piece of shit?",
            "Usually if your boss enforcing rules that strict it's because *their* boss is holding them responsible for it. ",
            "Reminds me of the boss from fight club.",
            "This is definitely the best of work day(s) lol! Almost feels like a scene that should've been in something like 'Workaholics' or 'The Office'.",
            "You leave well enough alone. Or suffer the consequences.",
            "/r/pettyrevenge",
            "Wow, how petty.\n\nHow the hell did he even notice an undershirt.",
            "https://www.youtube.com/watch?v=LYcNa2w-HYI",
            "Why are some bosses like this?",
            "People working in places with dress code... lel",
            "this (ex)boss sounds bored. ",
            "Out of curiosity, which country do you work in, op?  India? ",
            "\"ass chest\"",
            "Light grey undershirt\n\nYou're a regular James Dean",
            "There are always exceptions to the rules, but exceptions are not the rule. ",
            "Not flaming just curious: what kind of work do you do / what kind of place do you work at that specifies the color of the undershirt, number of button that can be done or the tuck-state of your shirt? \n\nEDIT: just scrolled the thread and found the answer. Have a nice day OP",
            "Wtf kind of company was this?",
            "Stay strong, girl",
            "What he get fired for? Being charged for munching on minor dick?",
            "I read shirt as skirt and got extremely confused when I you said you're hairy. ",
            "Bravo OP",
            "This is beautiful.. I needed that.",
            "OP, need the story behind his firing",
            "I would have quit just based on the dress code. ",
            "Napa? ",
            "Huh I never thought I would relate to something like this so much. But I went through literally exactly the same situation, but I work in the *food industry*. Yes, that's right, the company would prefer me to handle food and serve customers with my mass of chest hair basking in fresh air than have me use the wrong color undershirt. ",
            "Wal-Mart?",
            "What a gay subreddit",
            "Have you ever considered laser hair removal?  I know it's expensive, but a woman shouldn't have so much hair on their chest that they look like an \"Italian mobster.\"  Laser hair removal is... What's that?  OP is not a woman?  Oh shit!  I'm so sorry!  My bad!  Well, that really changes how this story goes.  Anyhow, have you ever considered laser hair removal for men?",
            "My motto was always \"Take all of the blame, give all of the credit.\"",
            "It sounds to me like this boss actually followed the rule book precisely. So, in each of the two dress code instances OP described, the boss was technically correct. The best kind of correct.  \n\n\nHonestly, if I were a middle manager who had upper management harping on me about the risks associated with anything resembling workplace harassment, and I had workers potentially bickering about what other workers were wearing, I might just enforce the dress code exactly to the letter, too.  It's the easiest course of action at that point. \n\n\n"
        ]
    },
    {
        "post_id": "wnf0er",
        "author": "QuixiQuirk",
        "title": "No calls and I can't leave the floor? Okay!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wnf0er/no_calls_and_i_cant_leave_the_floor_okay/",
        "score": 18563,
        "num_comments": 757,
        "created_utc": 1660398676.0,
        "selftext": "TL;DR at bottom\n\nThis story harkens back to ye olden days when Blockbuster and Hollywood Video were the things to do on a family friendly Friday and cellphones were still something most people didn't really consider necessary aka the 90's.\n\nI took a job at a video store near my house. It was a small family owned store with three different branches in town. The job was wonderful! I loved movies and games. It was close to my residence and school. I even got free video rentals and a discount from the sub shop next door. The video store was located in a beautiful old building from the 1920's. It had marble stairs and a really amazing cage elevator that lead up to the storage and employee lounge.\n\nThe job was perfect for me. The hours were flexible, the pay was decent but the one draw back to this was my supervisor, let's call her Amanda... because that was her name. Seriously, screw Amanda.\n\nAmanda was on the older side and seemed to not be content with how her life had turned out. As a result, she took all of her frustrations out on anyone she could... especially those people who she worked with who happened to be younger. If you were a college student like myself, you earned a special extra helping of disdain from her. I mean really, how dare you decide to actually have aspirations of making more than $7.50 an hour?\n\nWhile I'm generally fairly tolerant of people like Amanda, she really went the extra mile to annoy me as much as humanly possible. She was bitter, mean, petty, and did anything and everything she could to just be plain unpleasant. She wasn't even nice to customers. The only upside to this attitude was that she didn't let Karen customers get away with their Karen-ness.\n\nI might have been able to take more if she happened to be particularly knowledgable or good at her job. She was neither and only appeared to have the job because of good old nepotism. She was the daughter-in-law of the owner. She knew nothing about movies, or games, or gaming systems, or anything we rented or sold. When a customer had a question, she would pawn them off on another employee. When she had a problem with the computers, who did she call to fix it? Me. When there was a delivery that needed to be checked into the system, who did she call?  Me. When stock needed to be dragged up to the stock room? That'd be me again. Any unpleasant task that came up, she would always try to give it to me. Generally, she hid in the back watching tv or talking on the phone (which did tie up the store's land line for literally hours), or doing anything and everything she could to avoid doing her actual job.\n\nWhen I brought up Amanda to Ken, the owner, he simply sighed and gave a pained look and asked me to just try to bare with it and stay out of her way if I could. I got the distinct impression that Ken didn't much care for her either but she was his daughter-in-law. He did his best to try to make sure I wasn't scheduled to work with her but at least once a week, I had to work with this paragon of kindness and light.\n\nOne day, I was on the phone with a customer discussing the late fees on their account when Amanda wanted to make a call. This resulted in Amanda ripping me a new one in front of an entire store of people, it was a Saturday and we were packed to the rafters. She was yelling so loudly that the woman on the phone asked me if we were being robbed and whether she should call the police. Before I could answer, Amanda yanked the phone out of my hand and slammed it into the cradle, \"You are never *ever* to be on that phone, you understand me?\"\n\nWhile I was desperately aching to head butt her, I bit my tongue, took a deep breath, counted to ten. When that didn't work, I counted to twenty, then fifty. Instead of telling her I hoped that she'd be ravaged by rabid wolverines, I simply smiled and said, \"Alright.\"\n\nThis seemed to annoy her even more than if I'd gotten angry. She stormed back to the office and I took a stream of customers, all of whom asked me if I was okay and one offered suggestions on how to dispose of a body. I appreciated the suggestions but I had plenty of my own ideas and while evisceration with a pair of rusty safety scissor's might be a fulfilling immediate solution, it probably wasn't good for my lifetime goals, unless those goals involved a jail cell and becoming overly acquainted by a thick woman with one eye-brow named Big Betty.\n\nInstead,  I checked it off in my big book of voodoo curses and hoped I would have a chance to pay Amanda back for her thoughtful gesture of embarrassing me in front of half of the metropolitan area.\n\nStill, there were a few more pieces to be laid out for my malicious compliance and Amanda wouldn't disappoint me.\n\nThe next piece came, perhaps a month later. I had been at work for about seven hours of my nine hour shift and had only seen Amanda once and that had been when she left the store. Considering I only had two hours left of my shift and hadn't yet taken a break, I really needed to go to the bathroom. I told my co-worker I was heading to the restroom. This was however, apparently, not in keeping with Amanda's view for the universe. She actually began to bang and kick the bathroom door demanding I come out. I took my time, washed my hands, adjusted my hair, and calmly walked out of the bathroom. While she began to scream, I ignored her and walked up to the front of the store and took the cart of movies to be reshelved.\n\nShe grabbed the front of the cart and swiped the movies off of the top. She then informed me of my questionable parentage, told me that I liked to passionately hug mothers, and that I was a female dog. Really, I had no idea about any of these things about myself. I thought all that time that I was just your regular everyday college student. I could have probably gotten on television if I had known how unique I was sooner. Amanda told me that under no uncertain terms was I to ever leave the floor while I was on the clock.\n\nAgain, I summoned an inner calm that would have made Gandhi proud. I forced a smile and nodded, \"Alright.\"\n\nWhile I seemed calm on the outside, I had made up my mind that I would have my chance. No matter how small, I would have my moment.\n\nThat shining moment came on a lazy and blissfully quiet morning. As it was a morning, it would just be me and Amanda, hopefully she would stay in the office and I wouldn't have to deal with her at all. When I came in, there were workmen in the back working on the elevator. One of the guys came up and told me that he needed a part and he would be back tomorrow to finish up the work. Annoying as I would now have to schlep armfuls of heavy tapes up the stairs but it wasn't the end of the world. The light of my life arrived a few hours later without a word to anyone.\n\nI stood at the front putting 'BE KIND REWIND' stickers on a batch of new arrivals when I noticed Amanda through the back door getting into the elevator. After the man told me that he needed a part, it didn't even occur to me that the elevator had the power on and I had a moment of amusement at thinking that Amanda was going to have to take the hated stairs. She was, above all, lazy.  However, it seemed the elevator did indeed have power *and* worked. At least it worked *just* enough to go half a floor and then stop. It was just close enough to the upper floor that climbing out onto that floor was impossible and just far enough from the lower floor that climbing out was impossible.\n\nI couldn't believe my eyes.\n\nMalicious Compliance Activated!\n\nI couldn't entirely see Amanda as she tried to open the door and get out but I could hear her. The sounds of frustration increased until I heard the most beautiful sound I ever heard.\n\nAmanda: OP!\n\nA slow smile, reminiscent of the Grinch, curved my lips. I walked to the very edge of the sales floor and called out. \"Yes?\"\n\nAmanda: The elevator is stuck, can you open the door from your side?\n\nMe: I don't know, I can't see it from here.\n\nAmanda huffed in annoyance.\n\nAmanda: Well get over here and try to open it.\n\nMe: I can't do that Amanda.\n\nAmanda: Why the <enter colourful verbiage here> not?\n\nMe: I'm not allowed to leave the floor while I'm on the clock under any circumstances.\n\nAmanda: Are you <enter another even naughtier word here> kidding me?!\n\nMe: You said it yourself. Since I value my job, I can't possibly go against orders.\n\nA stream of curses came from the locked and stuck elevator. I'm pretty sure I'm still not old enough for all of the things I heard that day.\n\nAmanda: Call maintenance, the number should be in the office.\n\nTrying to sound as innocent and sympathetic as I could possibly manage while also trying not to burst out laughing: I can't do that either, I'd have to leave the floor to go to the office.\n\nAmanda: You think you're real <So many naughty words> funny don't you?\n\nMe: I don't know what you mean.\n\nAmanda: Call Ken then. I know you know his number.\n\nMe: Well I would but I'm not allowed to use the phone, remember?\n\nAmazingly, there were no curses. There were no screams. There was not even one word telling me that my parents were never married. It was silent. I think for the first time she realized that she might actually be in a little trouble. She was stuck in a position entirely of her own making with no way out of it for the foreseeable future.\n\nAmanda: Op, please? Just get me out of here.\n\nMe: I'm sorry Amanda, I'm just following orders.\n\nAll pretence of niceness was dropped as she proceeded to inform me of all of my imagined faults and those of my parents, friends, and any other relations I might have or think to have in the future. Then she sealed her fate, she yelled at me that I was fired. In truth, I really only planned on letting her stew for a few minutes but after that? Nah.\n\nMe: I'm fired? Okay, then I guess I'll head home. Oh, I should also let you know that Bill called and said he'd be in at seven instead of five. He has to pick up his brother from the airport. So... I guess you'll be in there for a while yet. I hope you've got a book or some thing.\n\nAmanda: What?!?! You <bleeping> <bleep>! How the <bleep> do you <bleep> think you can <bleeping> do this to me? When I get out of here, I'm going come <bleep> you in your <bleeping> <bleep> you <bleep> <bleeping> <bleeping> <bleep>!!!\n\nMe: Wow. Okay, yeah. Have fun with that, have a good one. I'll leave my name tag and shirt on the front desk.\n\nAmanda: WAIT!\n\nMe: Bye.\n\nAmanda: WAIT!\n\nMe: Don't worry, I'll lock up on my way out and I'll put up a sign so people will know we're closed.\n\nAmanda: OP WAIT! I DIDN'T MEAN IT! COME BACK!\n\nI walked up front, wrote out a sign that we were closed until seven pm due to unforeseen circumstances.\n\nThe very last thing I heard from Amanda before I opened the door was, \"BUT I HAVE TO PEE!\"\n\nStill snickering to myself,  I locked the door and drove the forty-five minutes out to Ken's house to let him know the shop was closed. Could I have gone the five minutes to my house and called? Sure I could. Did I? Nope.\n\nKen seemed a bit surprised to see me there.\n\nKen: I thought you were working today.\n\nMe: Oh, I was but Amanda fired me.\n\nKen: She's not allowed to do that.  All hiring and firing goes through me, she knows that. Don't worry, I'll call her. I think maybe it's time to talk to my son about her. I can't keep her on with her acting like this.\n\nMe: I don't think she'll be able to answer the phone.\n\nKen gave me a long sharp look as I tried very hard not to smile. Then I gave up entirely and just smiled broadly back at him.\n\nKen: Op?\n\nMe: Yes?\n\nKen: What did you do?\n\nMe: Me? I didn't do a thing, I only followed her orders.\n\nKen leaned down to meet me eye to eye.\n\nKen: What happened?\n\nI gave him the full tale from her telling me that I couldn't use the phone under any circumstances to her telling me that I wasn't allowed to leave the sales floor when I was on the clock. Then I told him about her being stuck in the elevator.\n\nKen: You didn't tell her the elevator was broken?\n\nMe: I didn't even realize it had power.\n\nKen just stood there looking at me gobsmacked and then started laughing. \"I should really go let her out.\"\n\nHe paused for a minute and looked down at his dirty hands and clothes, then up at me.\n\nKen: But I really shouldn't leave those flowers half planted and then I should probably take a shower. I don't want to make that drive covered in dirt.\n\nMe: Oh of course not. You've got a really nice car and it'd be a lot of work to get that much dirt out of your seats and carpet. Do you need some help with the planting?\n\nKen nodded solemnly back at me and gave another chuckle. It took probably another hour to finish planting the flowers. Ken told me I'd be paid for the day and sent me home with assurances that I did indeed still have a job and that he would deal with Amanda. I fully enjoyed the rest of my half day off. I did hear from Bill that when he got there the elevator repair guy had just arrived and that Amanda ended up spending about five hours stuck in the elevator.\n\nAfter that day, I only ever saw her one more time. She glared daggers at me as I waved happily to her as she carried a bag of her things out to her car. Whenever I think about it, I still get a little smile on my face. Besides, I only did what she told me to.\n\nTL;DR Sucky manager suffered being trapped for five hours because of her poor life choices.\n\n&#x200B;",
        "permalink": "/r/MaliciousCompliance/comments/wnf0er/no_calls_and_i_cant_leave_the_floor_okay/",
        "comments": [
            "This is really putting the Malicious into MaliciousCompliance.  \nExcellent.",
            "I laughed, I cried… but I didn’t pee my pants cause I’m allowed to leave the floor. 😁",
            "Malicious Compliance served Cold and to the point. You've got amazing story telling skills too, keep it up.",
            "Ah! Malicious compliance at its finest!\n\nBravo!",
            "Funny, you literally left her hanging.",
            ">Amanda: What?!?! You <bleeping> <bleep>! How the <bleep> do you <bleep> think you can <bleeping> do this to me? When I get out of here, I'm going come <bleep> you in your <bleeping> <bleep> you <bleep> <bleeping> <bleeping> <bleep>!!!\n\nI love mad libs! Alright, curse words in the bleeps...\n\nWhat?!?! You fucking fuck! How the fuck do you fucking think you can fucking do this to me? When I get out of here, I'm going come fuck you in your fucking ass you fuckity fucking fuck fuck!!!",
            "That was *satisfying*.",
            "Damn, the moment you started talking about working at a video store, I knew this story was old AF.  LOL",
            "> She then informed me of my questionable parentage, told me that I liked to passionately hug mothers, and that I was a female dog. Really, I had no idea about any of these things about myself. I thought all that time that I was just your regular everyday college student. I could have probably gotten on television if I had known how unique I was sooner.\n\nBeautiful!",
            "Great story and writing. Journalism or English major by chance?",
            "That was riveting, especially the part where you introduce an entirely new character named Bill. It’s unexpected and mysterious. \n\nCan’t wait for part 2 when we learn Bill’s backstory in another episode of As the Malicious Comply…",
            "Good one! Happy to hear about your job environment I would have loved to work in a similar olden building (sand maintenance issues). Boo for Amanda. Nice story OP! Perfect malicious compliance.",
            "I had a supervisor like Amanda. every time he gave me a stupid rule that I knew he couldn't possibly enforce I just went above his head. \n\nafter the third time he started calling me on it and I said \"this isn't a matching of wills there's a clear hierarchy in employment\" he then cursed me out and I just held up the recorder on my phone that I always click on when talking to a higher up at any job. \n\nAfter that any time he told me to do something stupid I just told him \"Sure just give me that in writing!\"\n\nPS you have to get explicit permission to record a  private conversation in my state. I just deleted it.",
            "\"Me: I can't do that Amanda.\"\n\nRead this in Hal's voice from 2001 A Space Odyssey.",
            "This is deliciously malicious. :D",
            "So perfect it doesn't even seem like it can be real. But I don't care.\n\nI *choose* to believe.",
            "\"Open the elevator door OP\"\n\n\"I'm sorry Amanda, I'm afraid i can't do that\"\n\n\"What's the f¤#%ing problem?\"\n\n\"I think you know what the problem is, just as well as i do Amanda\"",
            "I love Ken's speedy reaction as well.\n\nWhen he picks his flower bed over his employed daughter-in-law, you know he was hoping to rub it in as much as he could without offending his son.",
            "This is the best story I have ever read, hope she was able to hold it in lol.",
            "Thank you OP. I was  having a bad morning until I read this. You go, girl.",
            "Was on a job and this one foreman got stuck in a cargo elevator for about forty minutes. It had clamshell doors, top came down, bottom rose up. This guy was always a real joker so it was open season payback time. People were prying the rubber open at the door joint and trying to poke him with sticks or throw things at him. In between fits of laughing he was threatening everyone with revenge . Good thing the elevator repairman showed before some guys got the water hose turned on. This became a legend that people laughed about for years.",
            "Loved the story telling! And Ken was perfect too!",
            "Very well told story. Sweetie, I do hope you are (did) take Journalism 401. You're a natural. Sophisticated, ironic sense of humor not usually found in the wilds of the Internet. \nYou'll go far in this coo-coo world. \nBest wishes. 💐",
            ">my supervisor, let's call her Amanda... because that was her name.\n\n😂",
            "The universe gave you a gift and you did not squander it. Bravo, OP! Bravo!",
            "MC is so much better when related by someone who clearly takes so much glee in the retelling.\n\nIt's like getting a share of the satisfaction the person telling the story felt.\n\nAlso, Ken seems pretty great for a boss.",
            "Oh, I  love stories like this... This is malicious most definitely! Also petty revenge.  Almost pro revenge,  but not quite!",
            "Officially my favourite story I have read on Reddit since I signed up a 3 months ago!!",
            "Great story. I however could not follow through with leaving someone trapped in a building alone.",
            "[deleted]",
            "I loved reading your story. Thank you",
            "This needs to be in MC hall of fame!!",
            "Take my free award. Such a nice story well written. I applaud to you.",
            "Great story telling",
            "YOU ARE THE GOD OF MALICIOUS COMPLIANCE\n\n*I bow to you and hope to one day get to this level of pettiness and get away with it!*",
            "I was working at my dads company and he told me to flip a few of the pieces that we were painting, I told him it wasn’t dry and the paint would run, he said to “do as I’m told” so I flipped them and went on doing the rest of my work for the day. After 2 hours he found me and started to yell, and yell, and yell about how I screwed up the pieces and how could I be so stupid to flip them. During this outburst I just sat and stared at him, not saying a word, not emoting in any way just looked at him. The fact he wasn’t getting a rise out of me set him off and he just started saying some of the most hateful things you could to your own son but I just stared, and after 5min of verbal abuse he said the magic words, “you’re fired”, that is when I made my only contribution to the argument “cool, see ya” and I got into my car and drove away.",
            "Combines three of my favorite genres: Karen stories, MC and revenge. Take a helpful award.",
            "First floor:  Pettiness, Maliciousness, Hostility, Spite, and Bitchiness.\n\nSecond floor:  Karma, Comeuppance, Just Desserts, Retributions, and Recompenses.",
            "Of all the stories I have read this one takes the cake. \n\nWay to go and hats off to you.",
            "The first take away from this story is I made LESS an hour working for my university in 2015 ($7.25) than you did in the 1990s ($7.50/hr)... Gotta love Texas’ refusal to raise the minimum wage.",
            "SLOW CLAP",
            "Beautiful story, beautifully told.  This is the kind of post that keeps me reading the sub.",
            "I lurk this sub daily and never comment but holy FUCK this is literally the definition of malicious compliance. Perfect. I applaud you dude",
            "This is gold",
            "Not sure if malicious compliance petty revenge or pro revenge.",
            "*sniff* that was beautiful",
            "Omfg this is pure gold and should be pinned at the top of the sub",
            "Top Three MC and today's my 10 year cake day, so that's saying a lot!!!!",
            "I think this just might be my favorite MC of all time 💖",
            "This is the best malicious compliance story I have ever read. You win Reddit that’s all 🤣",
            "I read this start to finish, powered through the fits of laughter and wiping tears from my eyes, occasionally spinning in my chair with hands raised... and I was satisfied. My joy was full.\n\nAnd then I came back because I suddenly realized... I can *see* this!\n\nIt's recounted so well that I can almost smell that weird \"you know this is a video rental store\" smell. I can see their faces! Different camera cuts... Outfits... Amanda on the floor of a questionably warm damp elevator... That moment when Ken looks over at his flowers and they're suddenly brought into focus... all of it!\n\nSOMEONE MAKE THIS!",
            "Did Ken though you broke her neck and put her in a freezer when you mentioned she can't go to the phone?\n\n It reads like he though you broke her neck and put her in a freezer.",
            "ROTLMAO!!!!!!  🤣  That was BEEEE-UUUUUUU-TEEEEEE-FULL!!!!!!!!!  🤣",
            "Lovely piece of creative writing. Maybe post it in a fiction sub?",
            "Congratulations.  This is officially the fakest post on the entire sub.",
            "That is great!",
            "This is possibly the BEST story I’ve ever read on here. Bravo!",
            "Brilliant!! A standing ovation for you!! \n\n👏🏼👏🏼👏🏼👏🏼👏🏼",
            "This is one of my favorites in a long time. ❤️",
            "Very well done and very well written.",
            "I usually skip the XL's, but this was beautiful.",
            "Karma is a bitch.",
            "Really well-written.  This was a fun read!",
            "Such a satisfying read, with an even more satisfying conclusion. You're a good writer!",
            "What a lovely malicious compliance. Kudos. Also, your style of writing is totally enjoyable.",
            "Oh my god this is perfect. Thank you for telling this story.",
            "This is the best MC I've ever read.",
            "Boss level",
            "This is one of the best things I've read on here.",
            "I was so afraid you helped her get off that elevator. Cheers and kudos. 🍻",
            "The story itself is awesome but your writing took it to another level, thank you! Literally made my day!",
            "This is an awesome story and you’re an incredible writer!",
            "You are the master.  Please teach classes in MC.",
            "I really enjoyed reading this, thanks OP",
            "That was life affirming!",
            "This is the best I’ve read in years, OP.",
            "Amanda may be the new name to replace Karen.",
            "Oh the justice boner in this one!!",
            "Great story and amazing storytelling skills, OP! 👏",
            "I strive for your level of petty, OP. You are goals.",
            "Love it!!!!!🤣🤣🤣🤣",
            "I wish I could give more upvotes. This was awesome to read.",
            "This was great to read.",
            "This is the most maliciously compliant tale of malicious compliance that ever maliciously complied! I love it!",
            "Well done Satan",
            "I can’t wait for your book to come out! Let us know about your book tour!",
            "You are a talented writer!",
            "Why bother climbing the corporate ladder? Using the elevator is so much more efficient?",
            "Best. MC. Ever!",
            "Doing exactly what your boss ordered you to do is sometimes extremely satisfying. But when she yelled she had to pee, I would have yelled \"go right ahead\".",
            "You are an excellent story teller.",
            "I want to be like you when I grow up… and I’m 33",
            "::standing goddam ovation:: \n\n::brushes tears::\n\nThat was a thing of beauty. Truly.",
            "Holy excrement, that was a good fornicating read :)",
            "As an elevator mechanic, crazy that the guy would leave a half working elevator running, but maybe he thought it worked enough to go for a few days. \nYou probably wouldn't have been able to help her out yourself as the doors are locked from the outside and inside when not standing at the floors. \nBut crazy well done OP, that the owner let her smore longer too was just the cherry on top. Muah",
            "Well done",
            "There's always just a little extra bit of joy in a MC story when it ends with the still-employed worker getting to watch the no-longer-employed manager leave for the last time.",
            "How did you know about Bill if you weren't allowed to use the phone?",
            "Hard to believe a mechanic would leave an elevator in functioning order during it's maintenance, it's like you're writing some slapstick comedy.",
            "OP you are a literary genius. You pluck the words from heaven and weave them into tales of pure gold for the entirety of mankind to enjoy. You must be a writer! Your skills here are above many that I’ve seen here!  Thank you for sharing this story. It made my day and I hope the universe smiles on you again like it did this day in the future! :D",
            "TL;DR - Mean manager. Cute employee. Great imagination.",
            "Teenage fan fiction ish",
            "Great writing.\n\nWhat a miserable human being",
            "HA WORTH THE READ. This isn’t just malicious compliance, just straight petty and I loved it.",
            "Idk, for me the constant embellishment kinda kills the realism. I’d rather feel like it really happened than feel like it was a perfect story from someone trying to get published.",
            "I can't believe everyone here is complimenting the writing... it feels like word vomit to me. It's hard to enjoy creative writing exercises like this when there is an aside of funny, MCU-like quips and comedy special style censorship on the bad language. I get that it's funny and cute, but it's just not how human being think or talk.",
            "Great story and great writing. I chuckled out loud!",
            "So, so good. This is one I want to have saved for re-reading purposes. XD",
            "Great writing!!",
            "Karma is indeed a bitch",
            "Inspired.",
            "Damn, I think I'm in love. That was great. Not sure which was best, writing style or revenge.",
            "Did she pee tho?",
            "This is probably the most beautiful malicious compliance I've ever read here. Thanks a lot for sharing!",
            "I'm not sure 'malicious' sufficiently conveys the level of delicious evilness you brought to your compliance. But she just definitely earned every time bit of it!",
            "This is truly beautiful. Thank you!",
            "That was some brilliantly malicious compliance! Take my poor person 🥇!",
            "One of the best I've ever read!",
            "This was a hilarious read. Thanks for sharing.",
            "Beautiful! Brava!!!",
            "That was a satisfying read.  Bravo!",
            "This was absolute gold!! I felt like this was something you'd see in a movie, LOL.",
            "Beautiful",
            "Ahhh! This was a fun read. Thank you!",
            "One of the best stories I’ve read here. Thank you for posting",
            "Best story ever!  😂😂😂",
            "I had a great laugh.  Thanks op for this gem",
            "Top notch right there!",
            "You're the hero I never knew I needed",
            "This is officially my favorite post on this sub. So satisfying!",
            "What a wonderfully opportune MC. Well played OP.",
            "Fantastic story!",
            "This is one of the most glorious things I've ever read here. \n\nAmanda was too busy swearing at you to rescind or override her orders?  Impressive.  And Ken had the perfect response.",
            "If true (and I am going to assume so regardless of facts to the contrary) then you are an absolute unit and your story made not just my day but year.",
            "This is the level of malicious compliance I live for",
            "Wow! This MC is one of my faves, ty OP",
            "Very fun to read, Very satisfying ending. 10/10",
            "Truly a delight to read!!",
            "GREAT story and well told!  Loved it!",
            "I would’ve left the store and found a new job rather than deal with her for so long.",
            "B E A U  T I F U L ! ! !",
            ">She then informed me of my questionable parentage, told me that I liked to passionately hug mothers, and that I was a female dog.\n\nI'm not sure which way to interpret that first part, but your euphemism for \"motherfucking (bitch)\" is ***amazing!***  Just as much a slow burn as the rest of your fantastic story.  Love your style!",
            "Holyshit man! Thats one of the best malicious compliance stories I have ever heard!",
            "She got her just desserts!! \n\nWith someone like that, I think it would've been better to sneak a venomous snake in Amanda's car.",
            "Holy shit, this is the best MC I've ever read!",
            "This was amazing! And you tell the story so well :) \n\nDid Amanda get fired or did she quit?",
            "You’re a great writer! I enjoyed this thoroughly. Screw Amanda!",
            "I’m sad I can’t upvote this post more than once",
            "This is one of the best!!  Hooray for you!!",
            "I hope you have many stories to tell. I found your writing style (and the story) entertaining.",
            "Roald Dahl short story, [*The Way Up to Heaven*](http://storage.cloversites.com/christianlifecollege/documents/The%20Way%20up%20to%20Heaven.pdf).",
            "You damn passionate mother hugger! Great story!",
            "I think this is the BEST malicious compliance story I have ever read. 100/10 OP 👏🏼👏🏼👏🏼",
            "THIS IS GOLD !",
            "Maliciously Compliant Malicious Compliance!",
            "Beautiful writing I was busting out laughing, rusty safety scissors indeed.  Oh my dad asked if the safety scissors would have been curved.\n\nShe got what she deserved and as someone who fears being in elevators for long periods that means something.  I bow to your greatness in prose, wit and ingenuity and all because she was stupid enough to give you orders that were without merit.  Maliciously compliant in the best of ways.",
            "I need a cigarette after that story",
            "beautiful storytelling. marvellously malicious story!",
            " This is glorious and exactly what I'm here for.",
            "S-tier post, glad I kept with it. *chef's kiss*",
            "This was beautiful and we can all only dream of having such a perfect moment to enact MC. My hat is off to you.",
            "That was goddamn epic.\n\nIf it were me, I'd have gone to track down a skunk and throw it in there with her.",
            "Good job and the best part was the owner was on your side. Amanda must have passed herself wet after five hours in a broken elevator.  😆 🤣 😂",
            "This should be pinned to the top of the sub. You accomplished the perfect malicious compliance",
            "Relatives and business usually do not mix well.",
            "This took so long to read and every bit was worth it. You are my hero 🙏🏼😂",
            "Damn, great story!",
            "Excellent! A long time coming, but it's worth it",
            "Did amanda pee herself?! Pls say yes, even if she didnt just lie 😆",
            "I aspire to be this petty someday. In your position, I'd have told her I couldn't get it open enough. And then slipped through paperwork, mismatched cases, anything, and told her she might as well work since she can't get on the floor.",
            "The owner adding his weight to the compliance made the story that much better.",
            "I've been on Reddit for a loooong time (at least in my eyes) and this is the best story I've read I think. I hope it's 100%. I choose to believe it is.",
            "More accurately, you did not do those things she had forbade you to do. Which is better.",
            "You should write a book…about anything…you have a wonderful way with words and narratives!",
            "Am I the only one that read “I’m sorry, Amanda, I can’t do that” in HAL 9000s voice?",
            "Oh Amanda must’ve been PISSED .",
            "That is absolutely awesome and must have felt amazing.",
            "You are an excellent story teller OP. You write very well indeed. \n\nA wonderful Malicious Compliance.",
            "Malicious compliance at its _finest!_ This whole tale was such a delight to read. Bravo, OP!",
            "The final twist was the best.",
            "This is amazing!",
            "That. Is. Awesome.\n\nPerfection",
            "THIS IS AMAZING",
            "I don’t believe a word of it but you are a wonderful story teller.",
            "You freakin' evil genius...I'm impressed...",
            "Thanks for the belly laughs. OMG that was hilarious!!!",
            "Glorious",
            "Amazing write up. So satisfying to read!",
            "Oh boy…this saved a literally shitty night for me! Thank you so much for sharing it!",
            "That was an absolute pleasure to read, just fantastic, if you ever write a book then let me know",
            "I often read this subreddit and this definitely one of my favorite posts, thank you OP",
            "This is one of the best things I have ever read in my entire life.",
            "That was by far the most well written, succinct and downright funny Malicious Compliance I’ve read yet.",
            "Absolutely superb OP.    You have a gift of making folks read Every. Delicious.  Detail.",
            "Straight out of the BOFH school of Compliance.",
            "This is *chef’s kiss* \n\nBravo.",
            "YOU’RE AN ICON",
            "This story perfectly encapsulates why I'd be nice to people even if I wasn't a generally amiable person by nature.",
            "Magnificent!!!!!!!!!!!!!!!!!!!!!!!",
            "r/JusticeServed lol",
            "\"What did you do?\" \n\nOnly & exactly what she ~~told~~ ordered me to do. \n\n.\n\nKen is marvelous!",
            "The Hilarious thing about this story is the fact that Amanda had to piss herself on high for five hours. I guess she will think next time she bangs on a bathroom door while she barks orders to not leave the floor.",
            "This would work in /antiwork too",
            "Well played! 👏",
            "Found out about this through an article on boredpanda. My day's barely even started and this story has already made it! Pure gold, haha",
            "Boredpanda arrival here as well. This may be the best malicious compliance I've ever read! I love that Ken was on your side and laughing about the whole thing too.",
            "I believe this may be the best post I've ever read on this sub.\n\nAlso, the architecture nerd in me is curious about the building you worked in. Is it still standing? If so, where is it located?",
            "I listened to this on YT tonight and was crying laughing. You are absolutely hilarious!! Take my silver sparkly!",
            "I love re-reading this",
            "If true, this is gold. However, if something has gone seriously wrong in that elevator, I can't help but wonder what OPs culpability would have been.",
            "Glorious malicious compliance at its finest!!!",
            "The grinch smile absolutely warmed the cockles of my two sizes too small  heart",
            "Oh my…this was like the gods or fate lining this up to make up for Amanda. It was like they perfectly set it all up! All of it was seriously so spontaneous of maliciousness!",
            "I'm amused by the MC and impressed by your creative writing skills. Nicely done!",
            "After the TLDR, I had to go back and read the whole thing. So worth it. Great story OP, love the compliant revenge you got.",
            "[deleted]",
            "I think more people should pay attention to the safety issue. One of the big rules of bondage is never put someone into bondage without having tools to get them out of it quickly if something goes wrong. Similarly here.\n\nFires can start, especially in an old building. Or a broken elevator can drop. There are other possibilities that I'm doubtless not thinking of.\n\nI think that this particular case is not a crime in the U.S. because reasons. But I think it's nasty.",
            "Your writing style is fantastic. \n\n>I appreciated the suggestions but I had plenty of my own ideas and while evisceration with a pair of rusty safety scissor's might be a fulfilling immediate solution, it probably wasn't good for my lifetime goals, unless those goals involved a jail cell and becoming overly acquainted by a thick woman with one eye-brow named Big Betty.\n\nIs where I was sold on your narrative. Bravo.",
            "🏅",
            "I hope you chose a career in writing because you are a great storyteller.",
            "What an uplifting story, without a single let down.",
            "That was extremely malicious and o am so proud of you op!",
            "Question. Did she pee herself?",
            "Fantastic tale, and I’m so glad you got to keep your job! I used to work at Hollywood, and I’d probably still be working there if it hadn’t gone out of business. Best job ever!",
            "One of the best that I've read!  Utterly brilliant!\n\nThank you for sharing, I laughed a bloody lot!",
            "Hey, One-Eyed Big Betty is actually a sweetheart!",
            "If you can't go to the bathroom every couple hours, LEAVE.  There's no excuse for that, even before laws come into it.  You can screw up your body.  (I mean you, not mean lady!)",
            "This may just be the greatest story of revenge I have ever read.",
            "For someone whose name means \"She who must be loved\", she certainly made certain no one wanted to! Good job. Unfortunately, the glare says she didn't learn any lesson.",
            "🤣🤣🤣🤣this is proper epic , brilliant 🤣🤣🤣",
            "Fuck Amanda 📢😀",
            "I initially said TL;DR, but now I've read the whole thing, and this is a treat. OP, your MC is something I've always wanted to do to a number of people, but never got the chance. I wish I could upvote this more than once. Thanks!",
            "Hands down the best MC I've read till now.",
            "Perfect! Full marks OP!",
            "This is art.",
            "You left a chance to make a ghost busters joke hanging so temptingly and you just, never looked at it. I feel so upset knowing what couldve been.",
            "This is the best story I’ve ever read on this sub. \nSlow, amazed clap for you OP.",
            "Well written and deliciously detailed. Bravo, op.",
            "Oh, please tell me that she pee'd herself in the elevator!\n\nI also feel like you've definitely read 'The Name of the Wind'.",
            "[deleted]",
            "And then everyone applauded",
            "I think this could be a crime.",
            "That...\nWas...\nExcellent!!!   Best MC story I've read on here so far!",
            "cool writing exercise i guess",
            "This is bordering on r/ProRevenge or at least r/RegularRevenge  BRAVO!!!\n\nThis was beyond satisfying.  Take my free award.",
            "Insanely well written.  Extra upvote for “liked to passionately hug mothers” and “female dog”. Thanks for the story.",
            "This is top tier writing. You can really tell that the auther enjoyed writing this one",
            "OP you’re super talented. This was such a fun read. I cried hard and roared with laughter when you arrived at Ken’s house and told him what went down. Bravo and I wish I could give you an award, but since I don’t have any, here’s a small compensation:\n\n🥇",
            "That was a beauty!",
            "Couldn't hope for a better ending. The wicked witch is dead!",
            "Marvelous 😍🤣🤣🤣",
            "this tale was absolutely delicious.   now I need to puff on a cuban cigar and sip on some brandy.",
            "Love this story, what a female dog she was! 🤣🤣👏🏼👏🏼",
            "This brought be so much joy. On behalf of all of us who had to go yes / alright, and all of us who don’t have broken down elevators to such joy… thank you",
            "So beautiful, and nicely written as well. Good thing you had a chill boss",
            "Fucking  sick!!!!!!! this is one of the best. **BRAVO!!!!!!!**",
            "Beautifully told, OP! Thank you for this satisfying story!",
            "Sometimes everything is just perfect.\nThis is a pretty good one, I love it!",
            "A lovely read! Well done!",
            "Wonderful writing, legendary MC!  And Ken, he's a good egg.",
            "I LIKE KEN. Is he hiring? Dudes a fucking legend right there.",
            "This is the best story I’ve read on here in QUITE some time. Bravo OP",
            "This was a great story!",
            "Bravisimo!",
            "Oh! Beautifully written malicious compliance. Chef's kiss!",
            "Beautifully written!",
            "This is fucking glorious, easily my favourite story I have ever read on this sub!",
            "I love this!",
            "This is top shelf. Reminds me why I subbed here in the first place. Bravo.",
            "Good story! I really enjoyed reading it",
            "Beautifully executed, beautifully told. Brava, OP 👏👏👏",
            "Oh, that was a DELICIOUS read.",
            "Glorious!",
            "This is by far my new favourite MC story.",
            "Malicious compliance served *with icing!!!* Wow OP! Thanks for sharing such an amazing story. Had me grinning throughout. Also, a wow to your way with words. Absolutely hilarious 😂",
            "This is a great story! I was laughing all the way!",
            "I think I love you.",
            "The writing, the epic compliance, and that ending!! Pure gold OP!!!",
            "This is the most beautiful post I have ever read. Bravo.",
            "This is beautiful. A chef’s kiss isn’t even close to describe how good this is.",
            "This is simply... Manifique. Easily my favorite story on this subreddit.",
            "That was a great story. It was well told and I was laughing all the way through it.  It’s so satisfying when you have the opportunity to see that happen to a hated colleague.",
            "This is my favorite MC story I've ever read. So extraordinarily satisfying. Thanks for sharing your tale with us.",
            " This was amazing",
            "Thank you OP, stories like this one always make my entire day.",
            "this is pro revenge to me if I ever saw it!",
            "Beautiful. Truly beautiful. I love you.",
            "Damn your writing skills are amazing. I mean the story itself is good but how uve written it down is just fantastic",
            "I used to work at a video store too! It was a lot of fun. I eventually was let go though cause a new manager and store drama. They all got theirs though. More of a karna thing instead of MC.",
            "That was beautiful. I shed a tear of joy at the end",
            "This…pure poetry.",
            "Great MC, and nicely written.",
            "Wow, I enjoyed every bit of that well written story! She got what was coming to her for sure! Love it 😀",
            "You are a gifted story teller. I greatly enjoyed this.",
            "Beautiful!",
            "By my stars and garters! That was absotively posilutely beauuuutiful 😂💕. BRA-FUCKING-VO! OP! Love it.",
            "Your writing style is reminiscent of Douglas adams"
        ]
    },
    {
        "post_id": "8zofco",
        "author": "OneCoolUsernameGuy",
        "title": "You want me to put a fake name on your order? Alright..",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8zofco/you_want_me_to_put_a_fake_name_on_your_order/",
        "score": 18545,
        "num_comments": 903,
        "created_utc": 1531856878.0,
        "selftext": "So this is about 3 years ago i was working at Papa Johns (in Canada) and was acting as the assistant manager.  When we had customers order within the store we would just take the customers name so that we can call out their order once it's ready and usually this isn't an issue. \n\nWell an older gentleman walks in 60-70 i'd say. He waits in line, approaches the counter places his order, but when I asked this customer for his name, I realized I had opened pandoras box.\n\nCus: \"What do you need my name for?\"\n\nMe:\"its so that when your order is prepared I can call it out for you sir. \"\n\nCus: \"You don't need my fucking name\" turns to customers in line and says \" Watch out! The fucking pizza guy wants your social security number.\" \n\nMe:\" Sir if it is an issue you can just use a fake name\"\nCus: \"just put Bob on it\"\n\nand so i did\n\n10 Minutes later his Pizza is hot and fresh from the oven, i walk to the counter and yell out to the store \"pizza for bob\". The guy doesnt budge. I realize now that this man has forgotten that he was ordering under an alias and doesn't know his order is ready. The other customers in the store however knew what was happening because they just watched and heard the misery unfold, they turn to \"bob\", they turn to me, they turn to \"bob\" and I can see it in their eyes, even the customers long for that malicious compliance. \nI continued to bring the other customers their orders, some who had been there before him, and once \"bob\" had noticed that i was serving food to those who ordered after him, he  approached the counter [ at this point the pizza is getting nice and dry under the heat lamp] it's been about 20 minutes since he's ordered. \n\nCus:\"Is my food going to be ready soon?\"\n\nMe:\"Sir, it's been out of the oven for about ten minutes now, i've called for the name you gave me several times but nobody came to the counter.\"\n\nAt this point the guy is aware that he is getting his food late at his own demise. \n\nI hand him the pizza and there is no more exchanging of words, he leaves and goes on his way, the customers who witnessed the misery unfold were all snickering as he left. \n\nNot a bad gig. \n\nJust deleted this by mistake, first time on the internet.",
        "permalink": "/r/MaliciousCompliance/comments/8zofco/you_want_me_to_put_a_fake_name_on_your_order/",
        "comments": [
            "I always use the same fake name wherever I go so I can avoid something like that. I use a fake name because my name is very uncommon so they always misspell it or can’t pronounce it properly. ",
            "That's funny, his food was late all because he wouldn't give you his name.\n\nWould've been better if you asked him to confirm his name before you gave him the pizza and he gave you his real name. Then he wouldn't get the pizza since there wouldn't be an order with that name.",
            "You guys just wanted a SSN? Last place i got pizza from took my first born. I am going to your place next time.",
            "Compliance is best served... from under a heat lamp ",
            "It would've been funnier if he paid for his order with a debit or credit card.",
            "Op deleted his text.  Here's what he had wrote:\n\n>So this is about 3 years ago i was working at Papa Johns (in Canada) and was acting as the assistant manager. When we had customers order within the store we would just take the customers name so that we can call out their order once it's ready and usually this isn't an issue. \n\n>Well an older gentleman walks in 60-70 i'd say. He waits in line, approaches the counter places his order, but when I asked this customer for his name, I realized I had opened pandoras box.\n\n>Cus: \"What do you need my name for?\"\n\n>Me:\"its so that when your order is prepared I can call it out for you sir. \"\n\n>Cus: \"You don't need my fucking name\" turns to customers in line and says \" Watch out! The fucking pizza guy wants your social security number.\" \n\n>Me:\" Sir if it is an issue you can just use a fake name\" Cus: \"just put Bob on it\"\n\n>and so i did\n\n>10 Minutes later his Pizza is hot and fresh from the oven, i walk to the counter and yell out to the store \"pizza for bob\". The guy doesnt budge. I realize now that this man has forgotten that he was ordering under an alias and doesn't know his order is ready. The other customers in the store however knew what was happening because they just watched and heard the misery unfold, they turn to \"bob\", they turn to me, they turn to \"bob\" and I can see it in their eyes, even the customers long for that malicious compliance. I continued to bring the other customers their orders, some who had been there before him, and once \"bob\" had noticed that i was serving food to those who ordered after him, he approached the counter [ at this point the pizza is getting nice and dry under the heat lamp] it's been about 20 minutes since he's ordered. \n\n>Cus:\"Is my food going to be ready soon?\"\n\n>Me:\"Sir, it's been out of the oven for about ten minutes now, i've called for the name you gave me several times but nobody came to the counter.\"\n\n>At this point the guy is aware that he is getting his food late at his own demise. \n\n>I hand him the pizza and there is no more exchanging of words, he leaves and goes on his way, the customers who witnessed the misery unfold were all snickering as he left. \n\n>Not a bad gig. \n\n",
            "Ahaha my story of this is similar. I was a customer already waiting for the food to come out. This place is super busy, very loud, everyone is just yelling constantly. \n\nSome customer comes up and orders their food. The cashier is a no-nonsense fellow. \"You're name?!\", he shouts.\n\n\"I don't have to give you my name!\", the customer responds.\n\n\"Your name is Dildo Baggins!\", the cashier asserts and aggressively points at the customer. He writes \"Dildo\" on the order in big black marker with an aggressive underline.\n\nThe food was ready very quickly (smaller order than mine). \"DILDO!\", the cashier shouts. \"DILDO!!\" he points the box of food at Dildo Baggins until Mr. Baggins went up and retrieved his food in silence.\n\nAfter he left, the cashier is just shouting a rant about he doesn't care if you want a name or not just don't waste my time with your bullshit.",
            "[deleted]",
            "They started doing this here at Wendy's . When I tell them my name is Maurice they look like they have been shot. So I tell them my name is Bob. It doesn't matter, they hand me my order anyway with no calling of names.",
            "My name is Andy and I always used Randy on the phone. One time a guy said \"RANDY?! My name is Randy too!\" He drove up to the store I worked at and told everyone Randy helped him so much and was excited we had the same name. I didn't have the heart to tell him I wasn't really a Randy like him. To this day he still doesn't know and now all my friends call me Uncle Randy.",
            "How has this guy lived to old age and not learned how food pickup works?",
            "Use to do this for carry outs at my restaurant. We also did phone orders so we had to verify that it was you but if you just said “pick up for X” it was generally enough verification. Well one asshole refused and have an alias so when he came to get his food we asked for id. Then turns out no food under his name. Too bad. ",
            "Wouldn't the customers who overheard the exchange already have their pizza and have left the store by the time his name was called? Or where these dine-in customers?",
            "Note I'm in the U.S.   I once had a German woman apply for a car loan where I worked. She had filled out a credit application. Had her full name, american social security number, address.... The whole 9.   She left \"occupation\" blank however.  So I brought her the application and figured she just didn't see it, or maybe she was retired or just not employed, so I asked what her to fill out her occupation and she went from pleasant to pissed instantly. \"all you damn Americans!, just give me my money\" she yelled. (paraphrase) \n\nSo I submitted the application and she was denied.  And I did the bare minimum try and get it approved in post. ",
            "Working for an isp call centre, had a lady call up to pay her bill by credit card then refuse to give me her credit card number. Went full blown 'stranger danger' on me.\n\nSome people... ",
            "[deleted]",
            "I thought it was gonna end with making him show ID to prove his name was Bob",
            "At least he took his lumps like a man.\n",
            "https://imgur.com/gallery/GhCFHHe\nHere is a mirror (thanks u/floppywanger)\nI deleted the post by accident, or just the text i guess? Its my first time on the internet, sorry. ",
            "I mean, you got prepaid pizza for Bob?\n\nI am Bob, and I’ll take my pizza now. ",
            "[deleted]",
            "Ugh. I don't have too many paranoid assholes like this but I have some annoying jokers. The Disney club who like to order with Disney names, the family who uses a different superhero name every time. Last week I had one moron who, when I asked his name, said, \"Put....Poophead!\" like some kind of damaged child rather than a grown man with wife and kids in tow. He was actually so excited when I (sighed) and typed it in, telling his kids \"Pennyintheair is so cool!\". Yeah no. We're not going to yell out fucking *Poophead* in a crowded restaurant after church. I had the expo get me when the order was done and we just ran the food out. I don't think his wife was aware thankfully...... How does she find that behavior sexually attractive?",
            "Had someone else picked it up would you have given it to them? ",
            "I say \"CARTWRIGHT\" and you no come get pizza. \n\nBut... I said my name was Costanza. \n\nThat's what I say. I yell, \"CARTWRIGHT!\" and you no come. ",
            "Served cold and delicious.",
            "After Malcolm in the Middle, I always use the name Pete Zahut",
            "I was at a tire shop once waiting for my car. The service guy comes out and says, \"I got a Dodge Neon,\" holding up some keys.\n\nLong beat while 3 customers all stare at him and look around at one another. \n\nWoman, \"I have a Plymouth Neon.\"\n\nWe all look at her. Service guy stares at her blankly. Looks down at keys and clipboard. Looks once more at woman. Shrugs and goes back to the desk.\n\nShe was still sitting there when I left. ",
            "Seriously might have been early stage dementia.   Sometimes it’s tough to tell whether someone’s being an asshole because of a shitty personality or because of a disease.",
            "This happened to me *all the time* at wendys.   \n \"Can I get a name?\"   \n   \"No\"   \nWell fine, I'll just call you \"bitch\".\n  ",
            "[removed], my favorite story.",
            "Is it unreasonable to bring a man his pizza who may be 60-70 years old? The name requirement is pretty arbitrary as well, an order number would have sufficed. ",
            "I told people once (when I worked at a papa johns rip off type place) that I had the ability to remember all the names and faces of people I ask to write down for their order, I wouldn't be working as glorified shift leader.",
            "This is funny but i can’t help but feel kinda bad bc I know how senior citizens need to look out for scams as they fall for them so often. He was probably a bit over paranoid.",
            " Older people are very commonly the target of confidence schemes, so his awareness could have been based on a recent class he had taken. But of course if he were not already used to using Bob as his fake name, he would be getting this obvious result. Also may have been starting to experience medical issues.",
            "This makes me sad more than anything. Dude had issues and wanted pizza. ",
            "> Is my food going to be ready soon?\n\nLet me check.  What name was it under?",
            "I feel kind of bad for him. He's messed up. He can't even get pizza without getting riled up, and then when he does, he has to wait longer because of the mistake he made.\n\nI don't know, I didn't feel good after reading this one. He's old and probably deserved it, but if I was one of the people also waiting, I would have told him house order was ready just to get him out of the place. It must be exhausting to have that kind of energy.",
            "As soon as I clicked on this it became removed...why u do dis to me?",
            "Mirror:\n\nhttp://imgur.com/gallery/GhCFHHe",
            "Yeah, I have a Starbucks name, cause the names that I have been called with them trying to figure out my real name is too much",
            "I really dislike this. Why do people get so upset? It's just a name.    \n\nI work for a health care organization scheduling for them. For HIPAA purposes we 3 key identifiers (usually name, DOB & address). One person asked if I needed their SO's social security or credit card numbers too. I explained I was following protocol and the law. They said screw HIPAA.     \n\nYeah, no thanks. I don't want to risk my job because you're an idiot and think laws don't apply to you. ",
            "I always tell people at restaurants that I only give out my middle name at restaurants.\n\nDanger!  Order ready for Danger!",
            "https://imgur.com/a/geW9IdE/ \n\nFor those who didn’t get a chance to read the story...\n\nIt ended with “not a bad gig” ",
            "It’s been deleted, so can someone fill me in with the gist of what happened?",
            "I always used Rumplestiltskin.  No one can spell it and if they tried to pronounce the misspelled version, it sounds gibberish.  Only Starbucks got it right every time... somehow.",
            "I always want to give a fake name (something slightly humourous, when I'm out with friends just for a chuckle) but I get worried I'm going to be like this guy and forget what name I give.\n\nAlso because I can't think of funny names. I need ideas please, anyone?!",
            "Sorry to be that asshole, but unless he literally dropped dead before he left, he didn't do anything \"at his own demise\".",
            "Our store takes the name of customers. This lets us look up their purchases.\n\nCan't tell you how many people refuse to give a name, lose their receipt, and then complain when we can't find them in the system when they need a warranty.",
            "Once I ordered at a burrito place where they take your name. It wasn't helpful when there were 5 Brian's all at the front trying to figure out which Brian the order was actually for. The next time I went in, I ordered, they asked for my name, I sure as hell wasn't going to say Brian, so I had to quickly come up with a fake name that was rare to avoid the same situation. I looked around for inspiration, looked down at my hand which was holding an umbrella and said, \"Umbrella.\" This confused the guy, so I explained, \"The last time I was in here I was one of five Brian's waiting for my order, just call me umbrella, nobody is going to share that name with me.\" He smiled and put the name in. \n\nFrom then on, every time I went in, the same guy who worked there was like, \"Hey, Umbrella!\" So I never needed to give a name again. ",
            "I never give my name because I’ve had a stalker, I always have them call my number ( there’s always a number on the recept) and I’ve never had a problem. People shouldn’t be forced to have their name broadcast aloud when they’re just trying to order food. ",
            "I used the name Voldemort once at a hamburger joint. When my order was ready, they called out “food for he who shall not be named.” Made my day.",
            "Ahh Reddit 10000 upvotes for being a dick to an elderly man who had probably memory issues or other signs of elderly mental decay . Never change",
            "> guy wants your social security number\n\nSo, not a social insurance number...?\n\nSorry... you mentioned Canada. Having a bit of a disconnect here.",
            "> at his own demise\n\nmaybe you could look up the definition of demise",
            "Why did it get removed?",
            "Though this was in Canada, that asshole customer sounds like an American, since he asked for a 'social security number' instead of a 'social insurance number'.",
            "I just tell them the name is Batman and it’s fun when they yell “Batman! Your order is ready!” My real names too long and complicated for people... Batman is so much better ",
            "*At this point the guy is aware that he is getting his food late at his own demise.\n\nYou kept it until he was fucking dead??? That seems a bit extreme. (demise=death)",
            "We don't have Social Security Numbers in Canada. We have Social Insurance Numbers.",
            "So we know his first name is 9 digits long.",
            "meh, I get it, I'm sick of being asked for my phone number, email, do I want to donate to the veterans/children/cancer victims/etc, do I want to sign up for their stupid barcode card so they know everything I buy ever...do I want to sign up for their store credit card at 35% APR. \n\nNo. FUCK OFF, all I want to do is complete the transaction where I hand you money and you hand me back my purchase and my change.",
            "I am bob's slightly dry pizza.",
            "I thought that one of the customers (who'd watched \"Bob's\" outburst and subsequent obliviousness) was gonna go up and say \"I'm Bob\" and walk out with the guy's pizza. \nThat would've been sweeeeeet. ",
            "I saw something like that once. It wasn't name it was just what pizza toppings u ordered.\n\nAs I'm waiting for mine the clerk calls out a pizza that's ready and nobody moves. No big they'll be back soon right? \n\nAs more orders come up, he keeps calling out the pizza nobody claims it.\n\nI notice this couple waiting and are just not listening like they expect him to remember what their pizza was and walk up and give to them.\n\nAnyways after close to 10mins since the pizza came out they get impatient and as about their order. He asked what they ordered turns out it was the one he had been trying to give away but No one claimed.\n\nShe was annoyed that he didn't tell her it was ready. And walked out in a huge.",
            "Had a similar situation, but he gave his name as Slartibartfast... Which was too long for our system to handle. Luckily I was the one handing out and new the reference. ",
            "I'm late but had to say this is so relatable working at a Starbucks. ",
            "Seinfeld, 4. ",
            "At least you didn't get his SS#, shifty pizza maker. ",
            "I think you mean Assistant TO the manager",
            "*Assistant to the Manager",
            "Assistant manager or assistant to the manager?",
            "*assistant to the manager",
            "Probably saved him from some pizza burn tho",
            "got this a lot asking for people's names, addresses and phone numbers when i worked at RadioShack... we'd enter people's obvious nonsense and then they'd have to own up to it if they came back to return something",
            "Assistant TO the manager",
            "When I was delivering, there was a guy who would frequent nearby hotel that placed online orders, but did not want to give us his real name or phone number. \n\nHe once placed an order for **\"Rumplestiltskin Jones,\"** we called to verify it was a real order, because that name either belongs to a pimp or the worlds greatest acoustic-folk-punk band. \n\nThe people on the other end had no clue there was a pizza ordered under their phone number, so we cancelled the order.\n\nHe called angry an hour later, but couldn't remember what name or phone number he gave the website. The CSR played dumb and said they couldn't find an order with just an address. Rumplestiltskin never did get his pizza.",
            "> At this point the guy is aware that he is getting his food late at his own demise. \n\n\"Demise\" means \"death\" just FYI.",
            "Why are people afraid of telling their name?",
            "I used to sell car insurance when I was younger. I had a guy call me for a quote but refused to give me any information. He felt I didn't need it. Fake name, fake address, fake birthday, everything. He didn't even want to tell me the car. \n\nEventually I just threw out a ridiculous number at him and he got upset with it. What were you expecting?! ",
            "I used to leave the name Beech for a Sunday brunch reservation. I would even spell it when I left it. Solely so that when they called for our group, they would announce \"Beech Party, table is ready\". It would make me giggle.",
            "I don't believe the part at the end where he was quiet and humble about his mistake.  It'd be more like \"You knew it was me!  I was sitting right there!\"",
            "I worked at Pizza Hut, and had the same issue a few times with delivery. They either didn't want to give out name or phone number. Once, the guy refused to give me his phone number (but was okay with giving me his address?) so I just pulled it off the caller ID. \n\n\"I'm not giving you my name.\"\n\n\"Okay Richard Smith, is 407-xxx-xxxx still an okay number to reach you?\"",
            "Ordered to nice and dry in 20 minutes, confirmed papa johns pos pizza.",
            "I always find it a bit odd that despite having one of the most common names, some workers who ask for my name manage to screw it up. Or maybe it was intentional to be funny?\n\nExample (not my name): joe is written as ju, joo, dew, jaw and something to that effect.... ",
            "Who kinda feels bad.",
            "Deleted? Seemed interesting ;-; Thanks Reddit",
            "For people trying to see this and are on mobile.... Click on the post, and then a random user's name to go to their account. Then go back to the story by just pressing the back button. Worked for me, not sure if this will work for everyone",
            "The guy not wanting to give his name over a pizza is stupid.  How anonymous does this guy need to be?  I bet he's got a pretty common name too like Steven or something.  What an idiot.",
            "Or you could have walked it out to the old senile man. \n\nDouchebag.",
            "Hate to break it to ya mate . But this is why you work at papa johns . If you were any good you’d walk your minimum wage ass across the room and tell the man here is your pizza sir hope you have a good day. \n\nEnjoy 4$ above min wage for the rest of your life :p",
            "Well played!!!! I swear, this is fast becoming my favorite subreddit! ",
            "Should’ve taken it a step further and checked his ID and refuse to give it to him because his name isn’t Bob.",
            "This could have been avoided had he just used his social security number. ",
            "poor guy just didn't understand. old people are really afraid of identity theft and wary of giving out personal information, as they should be, since they're so common a target. I agree his caution in this particular instance was stupid, but the guy was just old and confused. kind of a dick move bro",
            "Cus:\"Is my food going to be ready soon?\"  \nLet me just check for you. What is your ***NAME***, Sir?",
            "[deleted]",
            "Did someone say pizza for Bob?",
            "Fucking Bob. Always causing problems.",
            "I’d have probably asked him what name is on the order and pretended like I had no idea I had been calling for that order. Just so he says a totally different name from forgetting. “I’m sorry i don’t have an order for Sam. The only order not picked up is for a Bob. Is he with you? We’ve been calling that name for over 10 minutes now.”",
            "So did you ever get his social security number?",
            "Eh I kind of feel bad for the guy. He's old",
            "Lol. You should pretend you didn't know who he was and asked for the name on the pizza \\^_^",
            "Assistent to the manager..",
            "What an asshole thing to do to an elderly. You  knew exactly who the pizza was for , there was no need to be petty.  ",
            "That's why I always use a memorable fake name.\n-- Mr Fistula."
        ]
    },
    {
        "post_id": "f7dnlg",
        "author": "None",
        "title": "\"If a pregnant woman doesn't have light duty paperwork, she should be capable of doing the job as required without help\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f7dnlg/if_a_pregnant_woman_doesnt_have_light_duty/",
        "score": 18512,
        "num_comments": 886,
        "created_utc": 1582302916.0,
        "selftext": "I broke this scenario down over in AITA, and was told to bring it over here cause it would fit in just swimmingly. \n\nI am currently 31 weeks pregnant and I work as a water filtration operator. Every four weeks, me and the other operators rotate onto the maintenance shift where we work under this particular supervisor, we'll call him Randy. Randy likes to think he has more control that he does have, and honestly, the plant supervisor just lets him think that. \n\nAbout a month or so ago, I was working with him and he told me to pick up a 45 lb empty nitrogen cylinder. I politely reminded him that I was pregnant and shouldn't be doing that, to which he responded since I didn't have light duty paperwork, it shouldn't be a problem. I sucked it up and lifted the cylinder and carried it to the destination, but received a pulled muscle in the process. The next day, I informed the plant supervisor and an work injury report was filed. When my statement was taken, the verbiage I used that was corroborated with another coworker that was present caused Randy to get in trouble because he knew I was pregnant and essentially caused the injury to happen. They took me to a nurse to make sure that my baby was fine and that I was okay and was not experiencing any complications from the injury. I wasn't other than being in pain if I moved too much. They sent me back on my way and the plant supervisor put me on desk duty for the day.\n\nRandy was livid of course because he lost some of his manpower on the maintenance team. He made a fuss about me not having light duty paperwork saying that if I didn't have it then I should be capable of doing the work that is needed around the plant. I was capable, I just used common sense. Prior to this incident, I did my job to the fullest within the limitations of my body, which wasn't that much. I rested when I needed to, didn't lift more than my body would allow, and most importantly, I was the only female out of 7 employees so my other coworkers were more than willing to help me if I asked (which wasn't that often).\n\nSo the plant supervisor called me into his office and requested that I go get my light duty papers from the doctor ASAP. That's the only way he could protect me from getting further hurt at work. I told him I understood and made the call to the drs office and picked it up that afternoon. I got the paperwork that was supposed to keep Randy quiet and it restricted me as such:\n\n* No stooping more than 2 times an hour\n* No climbing ladders or poles at all\n* No climbing more than 3 flights of stairs a shift\n* No lifting more than 25 pounds\n* No standing more than 30 minutes out of each hour\n* And limited contact with chemicals\n\nThese orders of course make it very difficult for me to do my job fully as it basically limits me to either desk work, or general cleaning. Now Is know this list is bullshit, because I can definitely stoop more than two times in an hour. I may be out of breath coming back up, but I can do it. And the climbing more than three flights of stairs is ridiculous because that means I can't do all of my rounds. Someone else has to do the last set for me because you climb a set of stairs every time. \n\nUnder normal circumstances, I would be more than happy to bend the rules here to make everyone's lives easier, but honestly, since he's the one who bitched and moaned for me to get this paperwork, I plan to make full use of it. So far, since I've received this paperwork, I keep a checklist of all of the things I can't do and fill it like a bingo card. If I fill all of the things; to the office I go because that means I can't do anymore physical work on shift. And he has a bad habit of tossing a lot of work my way in the beginning of my shifts.",
        "permalink": "/r/MaliciousCompliance/comments/f7dnlg/if_a_pregnant_woman_doesnt_have_light_duty/",
        "comments": [
            "> '…this may well have been a case where chilly logic should have been replaced by the common sense of, perhaps, the average chicken.'\n\nLord Vetinari, *Making Money* by Terry Pratchett",
            "Heres an abstract question. If Randy thinks he has more control than he does. But his manager let's hin think that, dosent Randy have as much control as he thinks he does?",
            "[deleted]",
            "I will say that this list may be B.S. to you now at 31 weeks, BUT in 3rd trimester things get harder day by day cause baby growth is fast. So at 31 weeks it may seem silly, but at 35 or 36 it won't. Dr. is taking that into consideration.",
            "Randy is why we can't have nice things.",
            "When you said you were a \"water filtration operator\", I thought you were making a joke about being pregnant. Because of the constant peeing.",
            "IMO, you shouldn't rely on the company nurse to determine your injury.  You need a full evaluation by your own physician and ob/gyn.\n\nAnd, that should be paid for by the company.",
            "That part where you're out of breath from stooping? Your womb and its contents are compressing your abdominal aorta when you bend like that. You're short of breath because that cuts off the circulation to the lower half of your body, including said womb and contents. It prevents blood return, lowers you blood pressure, O2, and can make you lightheaded/pass out. Passing out and falling down is super bad for pregnant women. It is similarly bad for businesses where it happens due to supervisors ignoring  light duty paperwork.\n\nPlease don't bend excessively as defined by your profile.",
            "Randy sounds like a workplace injury lawsuit in the pipeline.",
            "FYI, meanwhile here in Germany:\n\nExpecting mothers do not have to work during the last 6 weeks of their projected pregnancy, but may do so as long as they formally state their intention to work during this period (paragraph 3).\n\nNew mothers are not allowed to return to work until 8 weeks have passed since the date of their child's birth (paragraph 5).\n\nFor premature, multiple and cesarean births, the return date to work is extended automatically to 12 weeks after birth (paragraph 5.1).\n\nOh and of course also:\n\nWomen are well protected from loss of employment due to dismissal - from the beginning of pregnancy until 4 months following childbirth (Schutzfrist) through a Kündigungsverbot, Dismissal Ban. Only in extremely rare exceptions are employers permitted to dismiss a pregnant employee during this time.",
            "Every European reading this wide eyed: \"wait why is she not on paid leave during pregnancy? Ooohhhh... It's in United States of Third World Standards\"",
            "I had a Randy when I was pregnant.   \n\nI was a soldier and assigned to a very laid back base.  We were more like a college town than an Army base.  \n\nI was eight months and HUGE.   I looked like I was carrying triplets.  My body made way too much fluid and I looked horrible.  It was comical.  \n\nBut, I felt fine.  I was just huge and carrying around an extra 75 lbs but I was good.  \n\nI was like you and just handled my shit.  Until, I got called to do police call.  Basically,  it was my turn to help pick up trash around the base.  My sergeant told me just to report for that duty and they will reassign me for after my delivery.  This was an unwritten rule that most folks followed.  Except for our Randy.\n\nNo, our Randy wanted a note.  But, I didn't have one and could got get one.  It would have taken about 30 minutes to get my doctor to give me a note.  \n\nInstead, he forced me to do \"my duty\" because \"The Army doesn't see female soilders.\"\n\nSo, I walked in the rain to do police call.  The other folks assigned helped me and understood why I couldn't do anything.   \n\nThe base commander sees me walking around , attempting to pick stuff up, and starts yelling at folks.  I get picked up in a nice car and taken to HER office.  \n\nOur Randy had zero clue what he was getting summoned for that morning.   I'm sure he wasn't expecting to see a drowned rat looking soldier being treated like freaking royalty.   \n\nOur base no longer put ANY pregnant soldier on pick up detail.  \n\nIt was glorious and it was epic.  And I did get pampered a bit more at my extremely flexible and easy desk job.  My sergeant made Randy's life horrible.   Randy had a really long two years there.",
            "Is Randy short a few apples? Who the fuck tries to make a pregnant woman do work like that?",
            "Honestly I get told this shit all the time as a manager. Do not give light duty to people without a doctor's note because of the ADA... It gets in  weird legal territory.\n\nThe difference is he should have said at the beginning \"don't do anything you think might hurt you, but please get your doctor to provide us with a list of restrictions so we can both be legally protected\"",
            "If he's smart then he's setting you up. He just got a doctor to say that you cant do your job. That keeps then from having to give reasonable accommodations because they literally can't accommodate you for your current job. Now, if they do have more than 50 employees and they dk have some strictly desk work positions you might get one of those, but at their standard rate of pay.",
            "[deleted]",
            "I'm not sure you would even put you and your baby in harm's way? If you knew you shouldn't or couldn't. This just makes you irresponsible just as \"randy\"",
            "Please follow your doctor's advice, even if you feel like you can do more.",
            "Oh fuck yes! Good for you. \n\nThe list seems a bit excessive if one is not experiencing problems during pregnancy, but pleaseeeee - stick it to him! :D With paperwork and all, and your previous injury I think it is really fair!\n\nGod luck with the birth :)",
            "Honestly you’re coworkers should be ok with you having desk duty. Paperwork or no paperwork.",
            "Outside medical attention is also an osha recordable injury, which should be a big deal for your plant.",
            "What industrial maintenance job doesn't expose you to HAZMAT or does not have you working in the vicinity of HAZMAT? Especially when one of the tasks you described was handling HAZMAT containers.\n\nPregnant women should not be around hazardous materials at all. It is far to hazardous to the development of the fetus, and not fair to impair them for life.\n\nThere are a *lot* of issues here...",
            "Makes you wonder how our rural forebears ever managed to propagate without the help of claims and liability departments.",
            "Why the fuck would you lift the cylinder? \"Yeah, it could endanger me and my baby, but Randy says so...\"\n\nI've seen this in multiple MaliciousCompliance stories. You say that you can't do something, they tell you to do it anyway and the malicious compliance is that you do it, injure yourself and get to say \"I told you so\" afterwards? Yeah, really showed 'em.",
            "I think you should just follow doctor's order, even if you can do something. My wife did light duty work and light lifting when she was pregnant. She just walked a lot. It caused her to have partially tear placenta, which caused her to go on bed rest for months.",
            ">**No climbing** ladders or **poles at all**\n\nAnd there goes the moonlighting job.",
            "So I know this is MC but as a occupational compliance person this could go the other way. Supervisor “Don’t do that task because you are pregnant.” Front line worker “Are you denying me work because of an undiagnosed/disclosed condition?” \n\nNot saying your would do this just saying how this could go to an unreasonable person.",
            "I feel this all too well. After my back surgery, I had to get up and walk around multiple times an hour. I was getting up every half hour or 45 minutes and taking a short couple minute lap around the office, then getting right back to work. Well, shortly an email went out about “excessive ‘breaks’” and that we should limit them. I went to my doctor and he gave me a note saying I had to get up and walk around for five minutes every 15. They were furious, but there wasn’t anything they could do.",
            "[deleted]",
            "If your job description has a phrase like \"lift up to 65 pounds by yourself\" then when you get pregnant you should of gotten restrictions from your Dr before shit like this happens. \n\nI totally agree you shouldn't of been required to lift it. But you should of been put on restrictions earlier. \n\nI had an elderly coworker at a care facility say she couldn't assist a client to walk because she can't lift that much, I asked if she has a Drs note stating the restriction she said no. I did not make her assist the client but I did call my supervisor that day and said I wont work alone with her again as she is physically incapable of doing the job.  It was of course forgotten about, till the next time I had to work with her. I asked if she was capable of lifting yet, she said no, so i called my supervisor and said either someone else works for her or you can replace me.  She got a third person for that shift, then got in trouble with her boss for overstaffing. \n\nSo what was their ultimate solution? They didnt schedule me and her together.  Sorry for rambling but if you can't do the job then you should get a different job, whether its just office work at the same job or applying to be a Wal-Mart greeter.\n\nLater on that elderly staffer got fired for repeatedly, REPEATEDLY lying about changing clients undergarments, leading to skin breakdown.",
            "Bingo card... you killed me with that one",
            "Awesome use of malicious compliance! And congratulations on your pregnancy! From the sound of it your job has helped you stay active throughout which is good for your and baby's health but I'm glad to know you can now take it as easy as possible until the baby arrives. Good luck with Randy!",
            "Well, to be fair you should have already had the paperwork.",
            "I'm sorry you went through this. When I was active duty I made sure my people were taken care of. I put one of my troops on night shift during Ramadan just so he wouldnt have to work all day while fasting. Also when one of my troops was pregnant I just had her do all the clerical work since we worked around RF radiation and repeatedly would climb stairs with equipment.  Treat people with decency and respect and they will be happy.",
            "First off above a 20kg lift, you need 2 people so hes already fucked you there",
            "I mean... he was right? Although instead of forcing you to do the work he should have forcibly made you leave for the day because you were unable to do your job without being a liability. And that the burden of proving you shouldn't be doing the work is on you to avoid further days missed.",
            "Stooping. I feel like I’ve heard that word used before but it honestly looks like a made up word now. The more I read it and say it the less it makes sense and the more confused I am.",
            "when i first started reading this i thought you were plotting to have a miscarriage out of spite but your idea was better",
            "Fuck Randy, I work with a fellow just like this and his name is fuckin Randy. Randy is the male equivalent of Karen.",
            "I worked at a hospital and a pregnant nurse,who was more than capable, was prevented from lifting patients and other manual labor by all her peers, we were not asked, we cared about this person. Sounds like Randy in the story resented you and wanted you to get hurt out of spite to make you disappear. Misogyny at its finest.",
            "Randy is an arsehole. Please don’t push yourself. I pushed myself when pregnant thanks to my own work Randy & regret it. Take it easy & look after yourself mumma.",
            "Sorted by controversial was not disappointed.",
            "I don't get it, he just asked for light duty paperwork which sounds reasonable to me. If there's restrictions they should be laid out in writing for both parties benefit specifically for instances like this.",
            "Randy sounds like a psychopath.",
            "“She’s like lighthouse duty.",
            "Question: Does being pregnant increase your chances of pulling a muscle?\n(My wife is prego and I know she isn’t supposed to lift heavy things, but I’ve never heard anything about pulling muscles)",
            "I was ready for a “my water broke” story, at a water filtration plant cause that would have been classic, but this was just as good 🤪",
            "What is stooping?",
            "I'm getting a strong Joe impression from this low life. The weirdo on Parks and Rec that works for the pawnee sewage department lmao",
            "I can just see the plant supervisor asking to look at it, then busting a gut laughing at how Randy can't do a damn thing to you because of the restrictions, and you can shove it in Randy's face, every time he demands you do something.",
            "Not a native English speaker ... so just now I learned that *\"light duty paperwork\"* does not mean that you now got lighter work duties, namely paperwork ...",
            "Fuck me...\n\nI work on Sewage Treatment (Bio Rescources to be specific)... not the same side of things as you but I could not imagine doing my job with a small human attached to me along with all the other aches and stresses associated with that.\n\nThe most important ruled that is drilled into us (aside from “take 20”) is “if you don’t feel safe doing something, don’t do it” and nobody can tell you any different.",
            "Shit like this makes me so mad.\n\nI work in EHS in a manufacturing facility for a company that takes EHS VERY seriously— this supervisor would have been yeeted out the door in a heartbeat for even suggesting she endanger herself. \n\nIt doesn’t help the company to have injured employees. At all. Not from a employee morale perspective, not from a labor retention perspective, and not from a productivity perspective. Keeping people safe and healthy is good business— and management that doesn’t understand that often see their careers stagnant sooner rather than later.",
            "I'm currently about 38 weeks pregnant, and a couple of weeks ago, my boss almost lit me up for picking up a (not quite full) 5-gallon bucket of automotive sealer. In my defense, I felt I could do it. 😅\n\nIt's a been a bit hard for me to step back and let others do the things I'm typically used to doing.",
            "Weren't you concerned for the baby when you lifted that thing? Seems a bit risky for a gotcha..\nThe 25 lbs limit is there for a reason.",
            "Randy did nothing wrong, and you aren’t being malicious by abiding your doctors written limitations.\n\nEmployees can not self impose work restrictions. If an employer abides them, then they place themselves at a higher risk of liability. \n\n\nAlso, if you were to violate the terms of your doctors note and got hurt, the company would not be liable for injury unless you could definitively prove you were acting on their direction to violate your limitations.\n\n\nJesus people, labor laws exist for literally this reason.\n\nRandy may be a dick, but he did nothing wrong.",
            "I don't see anything wrong with expecting a worker who's getting paid to do a job to pull their own weight. Your personal choices shouldn't affect your performance at work and the more pregnant you get the less work you'll be able to do. Yes, common sense says that someone who's pregnant shouldn't do heavy lifting. That is why there is a system is in place for things like that, and Randy was right to require the paperwork, otherwise you're just getting preferential treatment.\n\nEDIT - fixed typos.",
            "Fuck Randy. You seem to actually work and not take advantage like some of the folks I work with. Given what happened, You should take advantage of it.",
            "Way to go randy, you just made everyone else have to work more.",
            "Fuck randy. Ain't any two bit job worth losing a preganancy. If I was the supervisor I'd have you doing emails and making tea and doing half days on my dime. Not because you're a woman, cause I've been there and had that loss and no, fuck that.",
            "Hey so I've never been pregnant before(and never will be), so I might be missing something obvious, but what does being pregnant have to do with pulling a muscle?\n\nAlso shouldn't you be on leave at 31 weeks?\n\nEdit: nope, 34 weeks",
            "Did anyone else read this as \"I might endanger myself and my baby by ignoring my doctor?\"",
            "If you can’t perform all aspects of a physically demanding job because of a temporary medical condition, you should have a doctors note.  That protects you, protects the company, and makes sure that an unqualified person is to put into the position of deciding what you can and cannot do on the job based on your medical condition.  \n\nBut even outside of that, it sounds like you had issues with some parts of the job already. You wrote: \n\n> Prior to this incident, I did my job to the fullest within the limitations of my body, which wasn't that much. I rested when I needed to, didn't lift more than my body would allow, and most importantly, I was the only female out of 7 employees so my other coworkers were more than willing to help me if I asked\n\nIf anyone, male or female, can’t do the routine tasks required of the job it’s not fair to the rest of the team to put you on it.  That increases their workload unfairly as they have to do the parts of your job you can’t do.",
            "[deleted]",
            "Even though pregnancy is not cause for termination, if your duty restrictions don't allow you to do the job, you get to max your disability and then you are terminated. You may want the doctor to write something normal...",
            "But that would be against gender equality if a woman is given preferential treatment. I understand being pregnant is a different thing but the main point is , wont it be preferential treatment rather than equality",
            "Just from reading this i have somethings to say. When your pregnant and someone asks you to lift something tell them to shove it where the sun don’t shine. Also i hope randy never has a daughter or wife because their in for a treat with that DBAG",
            "I mean, technically he's not wrong, he's just a jerk. Most people would understand and help you or be accommodating. What he did is just shoot himself in the foot. I'd say enjoy the light work while you can because when you return to work normally, you'll be off of it.",
            "The men and women who investigate these vicious Power Trips are members of an elite squad known as the Special Memes Unit.\n\nThese are their stories",
            "Light duty during pregnancy should be a given, and removal from work if complications warrant such an action.",
            "This sounds so American, if you're pregnant here in Germany, you can just ask your Gynecologist for paperwork saying you cant do heavy lifting/manual labor, then youd get shorter hours or you dont need to come to work anymore. \nIn healthcare as soon as you have a positive PT you're pretty much on maternity leave already..",
            "[deleted]",
            "I think the real question is why you were lifting that cylinder in the first place.\n\nShouldn't it have been put on a hand truck and secured? Eliminating the need to lift the cylinder completely and avoiding the injury regardless of pregnancy status.",
            "Why don’t they just lay you off then?  A workplace has to provide reasonable accommodations, but you still have to be able to do your job.  If reasonable accommodations are not possible you can fall back on FMLA, but other than that should be laid off.",
            "Saw the title and thought this was /r/unpopularopinion for a minute.",
            "Yeah it would be Luke's light saber?",
            "I'm genuinely confused here at the title OP.  Are we saying a woman should always be expected to do the same job as her male co-workers unless she has paperwork to excuse her from those job responsibilities?",
            "While it would be funny",
            "Ugh idk if I should cop",
            "I love this and the way you have gone about it",
            "You should already have been on light duties since you cannot do your normal duties.",
            "Do you would you can do. Ask for help when you need it. Don’t do what you can’t do. This isn’t rocket science.",
            "This comment couldn’t have a job tomorrow.",
            "They're saving money putting you in light duty than being sued.\n\nThat's an easy win for you if you ever get injured since they know fully well that you're pregnant, doctor's order and all.",
            "MN",
            "see the problem is that places like this dont have the policies to match all workers. also, the people that work for those companies need to grasp the vast amount of possibilities that come along with hiring a diverse group of people.",
            "It’s always a Randy...",
            "You shouldn't be stooping anyway. If you can't squat and get back up properly then you shouldn't be picking anything up off the ground until after the baby is born.",
            "This made me sick to my stomach. Isn’t it possible to miscarry over carrying too much weight?",
            "I hate people like Randy who get upset because of sake one getting pregnant.  You know what happens when women stop having babies?  NO MORE PEOPLE!",
            "If one of the supervisors under me did this I'd bang his head off a fucking wall.\n\nPoor management all round at this place by the sound of it.",
            "I mean, at my last job a pregnant woman got a doctors note for some type of light duty because she had a high risk pregnancy. \n\nThe production manager said no and denied it. \n\nI don’t..... think that’s legal..... \n\nI never had anything like that happen to me there but stories like that made me get out and find a better job.",
            "Yes but thanks to documentation they would have to be very créative. All of my dealings with my employer and Randy are well documented with HR and if they fire me during my pregnancy or even after it, it will be an obvious connection and they will be up their ass in lawsuits as u/the0ldestimmortal above said. It will become similar to Randy's situation. It will be cheaper to keep me.",
            "I used to have a coworker that worked all the way until she gave birth. She wouldn't allow us to do most of the work and just stay on light duty. I told her please don't lift anything she still did it. I was worried about the baby getting hurt as well as her. But she was one tough cookie.",
            "Is the supervisor married? Does he have any kids? As a 26 weeks pregnant woman who constantly gets told to stop picking up heavy things by her husband, isn’t allowed to bend down anymore (my family and friends stop me) even though I’m totally capable, and has to rock back and forth like a turtle to get out of bed if I happen to roll on my back, I can assume he’s living an unfulfilled, loveless life and wants to take it out on someone rather than, you know, cut a girl some slack.",
            "Yesssss make full use of the note. Rub it in Randy's face.",
            "Don’t name the random guy after my dad :( he’s a nice guy op",
            "I love this. I’m currently 36 weeks pregnant and a few weeks ago my boss fully expected me to do a home visit alone to a family who openly smoke weed and had recently experienced a drive by shooting. So yeah, that’s a no from me",
            ".... is this a cross post? I’ve read this one. I swear I’ve read the exact title and exact story somewhere maybe a year ago already. \n\nWth\n\nEdit: Ooooh, OP explained it was from AITA. I wasn’t going crazy after all",
            "I wish you the best during labor. Should be about time. :)"
        ]
    },
    {
        "post_id": "oomz4t",
        "author": "brostentatious",
        "title": "Work starts at 9, not 9:15",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oomz4t/work_starts_at_9_not_915/",
        "score": 18514,
        "num_comments": 788,
        "created_utc": 1626862517.0,
        "selftext": "Many years ago I used to work as a web developer at a medical center where the types of people in that org were, let’s say, tenured. Many comfortable people who have been working there for 8+ years. Not the least of all was our manager who had been there for 20+ years and fancied herself a dictator.\n\nI was the youngest there followed by the other developer. Engineering was a team of 2 myself included. We had content creators, support people, designers, etc. But the engineering was just me and this other person, we’ll call her Lucy. \n\nLucy and I would show up around the same time every day between 9 and 9:30. Nbd, we thought, since we typically ate quick lunches at our desk and stayed long after 5 to actually get some focus time in and get stuff done. Our manager typically showed up early around 7:30 or 8 and would leave the office at 3:30 or 4 to “skip traffic”.\n\nNow, at some point, our manager was on some sort of power trip and decided it was necessary to call a full team meeting to inform us that “work starts at 9, not 9:15, not 9:30, but 9”. Me being a young smart ass decided to fight this tyranny and asked her “what time does work end?” , to which she very calmly stated 5. So I asked how come she leaves at 4. And she explained that she shows up early and therefore gets to leave early. I was on autopilot because the next thing I said was “But I thought work starts at 9 so how come you show up early?”. She explained that she’s made a special arrangements with the higher ups and therefore she is exempt from the rule.\n\nSo Lucy and I dropped it but we decided to show up exactly at 9 everyday, take a full hour for lunch, and leave exactly at 5. Meetings all day and work due tomorrow? Sorry but work ends at 5. Working on an issue where stopping halfway means it would take longer to pick it up tomorrow? Sorry but works ends at 5.\n\nAbout a month of this and our backlog is piling up, our clients are complaining, and my manager is fuming at our reduced output. She sits us down and asks us why this is happening. We calmly explain that with meetings, an hour lunch, and work starting at 9 and ending at 5, there’s just not enough time in the day to get stuff done.\n\nShe dropped the policy the next day and instead issued a “core hours” policy of 10-3 where everyone is expected to be in the office then.",
        "permalink": "/r/MaliciousCompliance/comments/oomz4t/work_starts_at_9_not_915/",
        "comments": [
            "The bonus of a “core hours” policy is that it cuts down on meetings outside the core hours.",
            "I used to tell my staff the core hours were 10 to 3, and they were expected to work 8 hours. Beyond that as long as they attend meetings and get their work done I wasn't going to micromanage their arrival and departure. Sometimes busses are late. Sometimes they sleep in.  Just leave 8 hours after you get here. I'll only start auditing  their time if they give me reason to.\n\nEdit: thank you for the awards and the kind and supportive comments. It really means a lot to me.\n\nEdit 2: Thanks again everyone, I'm blown away by this response. If you're interested in more of my writing, please visit my [blog](https://themusingsofmrtea.wordpress.com/).",
            "Essentially this is called 'Work-to-Rule'. In the UK there are a few places where you are not allowed to strike by law (Emergency Services mostly), so instead of striking, these guys follow every rule to the absolute letter and without fail, it makes everyone suffer (which is pretty much the point). I think it's a great way to make your employer truly know just how much extra you really get from your employees sometimes.",
            "Some of us don’t want to be miserable 9 to fivers. I’d rather work 9:30- 6:30 if it means someone wasn’t breathing down my neck and I’m at a comfortable place to stop. Even better if my boss understands that I work late some days of the week and doesn’t stress that I come in late because it all evens out in the end. Just trust me to get my work done.",
            "Having some agency over your work life leads to better job satisfaction and mental health.",
            "Stupid is as stupid does.\n\nWhen I was in those shoes, two things...\n\n* Core business hours: 10-3 so we had overlap with our customers, many of whom worked alternate work schedules (6-2:30 etc).\n\n* work gets done\n\nI had morning people,  night owls. Some folks did 4x10s with prior discussion. \n\nWork got done \n\nWin",
            "Work may start at 9, but I expect you herr 15 minutes earlier to start working for free.",
            "I had people in India, Morocco, Glasgow, London, New York, and Chicago. I regularly started my day at 3a. I could get SO MUCH done before people started showing up at 7a/8a.\n\nI would usually leave the office sometime after lunch. My bitch-boss once got all pissy because the CIO wanted an update on a project and because she was a useless PoS she didn't know and couldn't find me at 2p (cuz I was at home already). So she pulled that crap with me about working hours. So I started coming in at 8a (which is 2p in England and 7:30p in India), and had no direct contact with a large number of my people. That didn't last long.",
            "Perfect example of MC here. I see the comments stating that you are now working for free, but I understand the flexibility is more valuable here. Either way maybe the manger will use their brain more before putting forth silly rules.",
            "Oh wow, it's like if workers are given a little bit of flexibility in their schedules to get things done then they will (generally) happily adjust to make sure things got done and stay happy about it. What a novel idea.",
            "This seems more like they need to hire an additional person, if you are salaried and having to work additional hours to complete work all the time.  That is pretty much free labor hours for them.  Get you a raise at least, but issue is with staffing, or with their management of your time.",
            "My job is pretty laid back.\nOne thing really bothers me and I NEVER get an answer. \n\nOne of my job duties is to make sure the building is clean. Swept, moped, wiped down, etc.\nThere’s a LOT of down time when there’s no events or something going on. \n\nWe’re told “this is a lot, take your time, spread it out over a few days so you’ll have something to do”. \nThen we get chewed out for not cleaning and “not following orders” when we do try to save cleaning something for the next day. \n\nI then come in, clean the ENTIRE building top to bottom, only to be chewed out yet again for sitting around doing nothing because I’ve already done my duties and there’s literally nothing else to do for the rest of the week",
            "Reminds me of when my wife was working for a retail chain bookstore (remember those?) and her shift was nominally 7am to 3pm - She worked in the back office, and wasn't required for opening the store at 9. Routinely logged overtime hours (she did things like special orders, and other inventory and logistics functions), and then one day she gets called in to the store manager's office to discuss her \"persistent tardiness\". Turns out that when showing up *outside* at 7 to unlock the back door and the process of accessing the building and turning the lights on meant that she didn't get to the time clock (NOT conveniently located by the door, but rather in the break room) until 5-10 minutes past the hour, and that corporate considered this to be \"tardy\" and a performance issue (never mind that she was logging overtime almost every week, so obviously putting in her full shift and then some). \n\nClearly some bean counter in corporate HR couldn't see the forest for the trees. They never did put the clock by the door (because then people wouldn't clock out for lunch, they said). It wasn't long before my wife decided she was tired of that kind of micromanagement bullshit and quit for the much more reasonable bookstore across the street, and a few of her cow-orkers followed soon after. Within a year or so, her former employer was bankrupt and closed all their stores. It wasn't just Amazon that killed them off, it was a terminal case of micromanagement.",
            "i keep getting baffled with higher ups thats very strick with hours instead of looking at the results/outputs.\n\nin my previous workplace, they prefer workers who work very inefficient and slow that take days to complete a work, instead of people that complete the work in hours. they really didnt like when i completed the work fast.\n\ndespite the result is good and even better than required.\n\nother workers goes MC with this and gets overtime pay to basically just in the office till late night just playing games, watching movies, etc.",
            "I had to walk out 'on time' instead of the usual faffing about being asked on my lunch break or end of the day to start calling patients (I'm a dental nurse but sometimes work in reception).\n\nThere is a dentist who NEVER answers his messages and  choses on our lunch breaks to tell us what to do (including calling the first patient after lunch without delay) or after we have packed up when he runs late. \n\nHe is leaving the practice and only seeing his own patients with remains treatment to finish. I had 2 very important enquiries one day 1) patient wanted to pay but he had labwork made at special lab so we don't know what to bill them and lab won't talk to us and 2) Guy shouting at us about treatment he did that was still bothering him and did NOT like the temp dentist that covered an emergency appointment he had to see.\n\nI messaged him, I spoke to him when he came down for coffee and spoke to him again \"later.later\" until lunchtime. He snapped at me saying it was his break and not to disturb him. I said \" fine I understand but you have tasks set (pop ups on his pc every 10 mins if he does not complete) and messages about my inquiries and one dentist is happy to deal with one if you read and approved. Let me know before 4:30 as I'm not calling them after we close at 5pm\".\n\nHe finishes at 5:25 running late with his last patient so I'm lending his nurse keys to lock up (only reason I stayed back that and to take payment from his patient). He starts chatting happily about my enquiries to which I said it wasn't my problem, closed now till Monday (it was a Friday), have fun dealing with it especially angry bloke who said he would put in a complaint if it wasn't sorted. The guy just flubbered at me as I walked out",
            "Funny how work will yell, complain, and write you up for not punching in exactly at 9am. But don't give a shit what time you leave as long as you don't incur OT.",
            "I am at a work place with Core hours., and honestly, I love it.  I'm actually on an Alternate Work Schedule and M-Th I have 9 hours on the clock with an hour lunch. First Friday I'm off, and second Friday I work 8 hours. Still a 80 hour pay period, but a 3-day every other weekend (not including holidays).  It's a good deal.",
            "I worked an 8 to 5, but more like 8 to 8 and often later. Showed up for work a couple times 5-10 minutes late, got chewed out. I got a job with a direct competitor with 50% raise in pay, plus moved a bunch of business over to the new job The first company closed up a couple year later. I like to think I had something to do wit them closing.",
            "I had a new manager a couple years ago who asked me to take on additional tasks. Those translated to a full additional day per month.  I said, that’s fine. Put me back on hourly wages. I like being hourly. I make overtime if I work more, and no one can say anything if I need to leave early or take a long lunch. \n\nAnd I don’t work on my off hours. Call me after hours? It’s going on my time sheet. I don’t check email when I’m off because it just stresses me. I’m very upfront about this. I tell the newer staff not to do it either. It creates the expectation that you’re always available, which is bad for everyone.",
            "I used to have a worker who showed up any time between 9am and 1pm. Sometimes it would be because she just *had* to make cookies, sigh. But she always put in at least 8 hours, often more, so I let it slide. Also, her cookies were the best I’ve ever had in my life. \n\nWork hours were 8-5.",
            "“Core hours” of 10-3 is one of the best policies for office jobs. Had a place like that and loved that part of the job.",
            "I will never cease to be amazed at how *working the hours you're paid* is considered malicious behavior in America.",
            "It kind of bothers me how often malicious compliance involves cutting working hours back to a normal level",
            "I tell all my employees “our official hours are 9-5 with a 30min lunch however we are all adults here. Get your work done, don’t take advantage of us and I won’t micromanage you”",
            "Every. Single. Time.  When the company starts watching the clock on its employees, the employees start watching the clock on the company.  Nearly every single time, it results in chaos or catastrophe.  Then the company backtracks.",
            "Sorry I am not American. All I am getting from this is. You can't do your job during normal business hours. You have to work extra to get it done. \n\nI get that you want to do the extra on your schedule. But why the need to do extra at all? \n\nIf the job can't get done during normal hours, something is wrong. Need more people or something else. \n\nI really don't understand this.",
            "Ooooh...I get to work first, and I am the only one in my office (small office with about 7 people - part of a bigger organization/non-profit) who works the hours laid out in the handbook.  In my early years, at least one other person would be here with me at all times. When it became clear that I was the only one here at \"opening,\" I told them I wasn't comfortable being in a secluded office with an unlocked door.  No problem! I could lock the door. And to be clear, most of my job is handled through phone/email, as I have very few face-to-face customers.\n\nUntil recently...someone BANGED on my door and rattled the door handle incessantly one morning.  Yeah, no way I'm letting you in, and there is no way for me to check who it even is without being seen.  \n\nWhen I mentioned it to my boss, he said that I probably should not lock the door anymore since it technically is during published office hours.\n\nFine, let's talk about office hours and why I'm the only worker required to be here for the published office hours.\n\nOn top of my co-workers getting very antsy and worried they were going to have to stick to policy, my boss back-pedaled as fast as he could because he had no intention of enforcing that with anybody else (including himself).\n\nSo, while not technically malicious compliance, my end result was the same.",
            "I hope you continued to have a full lunch and leaving on time, if you can't perform your work in 8 hours a day, it means there aren't enough people employed, not that you need to work 10 hours.",
            "I had a great boss at my job.  He left because the GM was nuts.    \n\n\nAfter 8 months, they finally replaced him.  On Day 2, New Boss calls me into his office.    \nNew Boss: \"Listen, I need you in here at 9AM every day.\"    \nMe:  \"I try my best but my kids are 9 and 11 and don't get on the bus until 8:35.\"  \nNB: \"We need to start the day running, and that day starts at 9AM.\"   \nMe:  \"My wife goes into work EARLY so she can be home when the kids come home. That means I'm the one who has to make sure they make it on the bus.  Both my kids have ADHD, and I'm not comfortable leaving them alone in the house for 10-15 minutes and risk them missing the bus just so I can be here at 9AM sharp.\"  \n\nNB:  \"We need to start the day on the right foot.\"\n\nMe: \"I agree.  But I start my day on the right foot at 9:10.  I make every effort to be in by 9, and I can if the traffic is good.  I get all my work done on time, I don't miss deadlines, and I usually take a short lunch or work through lunch, so my work gets done.\"  \n\nNB:  \"Well, I really need you here at 9.\"  \n\nMe:  \"The first meeting of the day starts at 10. I'm always there.  If it seems like I'll be any later than 9:15, I'll call you.  I really do make every effort to be on time, but I'm not willing to risk my kids safety, or run the risk of having to go BACK home because they miss the bus, just so I can be 10 minutes earlier to work.\"  \n\nI pretty much walked out of his office then.  I still had the \"I've talked this over with HR, and corporate policy for working parents is on my side and I've been told this is ok\" in my back pocket if he wanted to push the issue.     \n\n\nThat guy was a dick.  The 3 of us who ran the department without a manager for 8+ months wall quit within 5 months.",
            "Flexi time exists for a reason, as does TOIL. Or, even better, goal oriented work rather than time based.\n\nHell, if I'm finished at 4 then I'm not going to hang around for an hour being the shitty little jobs officer",
            "I never understood the concept of clock watching for management. It makes everyone’s life hell.",
            "Normally these stories end in the employee quitting. Good on your manager for actually learning from their mistake, changing the policy, and being you on board.",
            "Why on Earth is work dependent on hours and not if you actually finished your job",
            ">She dropped the policy the next day and instead issued a “core hours” policy of 10-3 where everyone is expected to be in the office then.\n\nthat's what any reasonable office will do lol",
            "At least,  no matter how stupid the dictator was, she got smart enough when it counted.  I'm thinking about using a phrase I don't like much:  \"If it aint broke, don' try to fix it,\"  but I won't.",
            "I remember once it was time to finish work, as we were leaving the boss asked where we were going because there was still things to do.  We said yep, see you tomorrow and left.  Satisfying.",
            "I'm a union construction worker. My hours are 6-2:30. I get my ass there every morning by 6 and I never stay even a minute past 2. Doesn't matter where we are at by the end of day. Work ends according to the time not by the work. My wife is the exact opposite. Has a 9-5 non-union non-profit job and the whole set up there is just insane to me. She gets there by 8:30 everyday, eats lunch at her desk while working and regularly stays until 6. I don't get it at all and honestly it pisses me off a little. She says it's just part of the culture there. That culture can go suck a fart outta my ass. I don't lift a finger until that clock starts and I drop everything once it stops. I feel like she's just giving away so much of her day to her job for nothing in return. I don't get it at all",
            "I'd kill for work to start at 9 and not have lunch count against us. Work is 8 to 5.",
            "I used to get the likes of this crap when I worked in retail. If we were even half a minute over clock-in time we got docked a full hours wages. It was beyond a joke. Luckily I've landed a nice 7-3 where I'm left to work at my own pace at a nice desk. Our backlog is piling up as well and we're not allowed to rush as it incurs mistakes lol",
            "I worked at a tech company in Austin along time ago. In this company, our group was given projects and time goals. We were doing great and making bonuses and theVP who set goals was happy. It was mandated that we had to assume this middle manager from another division and he was placed with us. He was a micro managing a hole. Over the next nine months ppl left, goals were missed all the time. We went to the VP three times and he finally said enough. He went to head of HR and said that said middle manager was no longer over us, he was back to being over us. They asked what they do to the ineffective micromanaging a hole, he stated not my problem. Next three years until I left for another career field, we made goals and bonus.",
            "I tried that years ago when I worked in London and others left at 4 because they came in early and I was there after 6pm. It turned out on the occasions I came in real early, early time including reading the newspaper and going for breakfast.",
            "I always tell my team that I don’t care about your hours, as long as you can attend the correct meetings and get your work done.  Once we start missing goals or having to reschedule meetings to get stakeholders input, I’ll start worrying about hours.  \nMy team rarely missed goals and was regularly top assessed.",
            "If they want to get more work done than two can do in 8 hours then they need to hire another person. If it was important to them then they would make sure that there were enough people to get the work done.",
            "So now you get to work extra hours again. Nice.",
            "Good lord. The worst I was ever micromanaged was at a call center scheduling drs appointments & procedures. Obviously I was on the phone the whole time and they had a \"status\" for freaking everything!! Bathroom, active call, post call wrap up, post call wrap up escalation, escalation, lunch, scheduled break, unscheduled break, meeting/training. I think there were more too. \n\nThere were metrics for each type of call and for the specific drs & procedures. I actually enjoyed the job so I performed pretty well but.. I'll take a GD break when I feel like it. I'll stay on the call as long as it takes to get the job done and to the customer's satisfaction.",
            "Part of my team (I was QA manager back then) was half-time (4h) and had to work in some kind of shifts. One day of those on the weekend. Service level to uphold and such. I let them figure out who wants to work which days with the clear understanding I expect them to play fair with each other. My expectations were start earliest at 8 be finished latest at 4. On weekends what day they could do best, just be finished at 6. Finish times inly to have the chance to get a tech if they found any problems and they'd have reasonable time to fix it without going to late. Worked well. Never saw the need to be any stricter. They repaid it by dropping other stuff if occasionally I needed more hands on short notice. They always made it happen because they knew I wouldn't mess with their personal schedules without a damn good reason. Sometimes our CEO, my direct report, tried to interfere out of power tripping. And that's where I hope I was a good manager, protecting my team from that guy's whims.",
            "I never understood why bosses are so worried about butts in seats like this. Unless your job specifically requires you to be there by no later than x o'clock since you need to answer the phones, be physically present for a meeting, unlock the door for employees who don't have the key or relieve a shift worker, then your boss can suck eggplants. \n\nIf you're doing your job and you're being \"late\" isn't directly causing someone else's work to suffer, then what's the big deal? Good workers stay when they can balance their work with their life. Good workers leave when work hinders that for totalitarian reasons, like OP's case.",
            "I'm on call 24/7/365 including when I'm on \"vacation\" since I'm the only person who knows what I do. I have a new manager that doesn't know what I do, and doesn't trust me, and really hates that I *appear* to be screwing around. So now I have to report what I'm doing at the end of the day every day. I'm making sure that if I have to email a vendor at 8pm, it goes on the next days report from start of email chain to end rounded to the nearest 15 minutes, so if there are 2 emails that I need to respond to half an hour apart, 45 minutes is added since the time it takes to write a response is important.\n\nHe's going to love my time sheet the next time I work overnight.",
            "My rule is \"if I have to micromanage you, I won't\".",
            "I’ve seen and said it time and time again, using “time spent at desk” as a key performance indicator is only valuable if the metric you’re trying to raise is the average temperature of the seat cushions. Countless studies have shown that people only really do about 2 continuous hours of work in a day in an office (not disparaging your after-hours efforts, OP, just using average statistics), and others have recently demonstrated that a 4-day workweek can produce just as much productivity if not more.\n\nIf you have a business that produces a unit of labor, i.e. a tangible, measurable product, that should be your first and foremost KPI. If one of your employees figures out how to hit that target while only being in the office between noon and 1 PM, you don’t fire that employee; you make them a trainer and get them to teach everyone else how to do what they do.",
            "The mistake here was not leaving 10mins after your boss does",
            "I'm most alarmed that you/your team were assigned so much work that adhering to that \"standard\" workday caused a backlog. Yikes.",
            "My policy as a manager at a couple places where it was feasible was basically, 'here's how much work you are expected to get done. That might take 20 hours, 40 hours or 60 hours... But thats your call.'",
            "American workers are fed up. After having to survive over a year without benefits and living on unemployment, (or not as two of my friends were denied due to technicalities), workers are not anxious to go back to what OP has described. Malicious compliance is service workers requiring better conditions, pay, and treatment. This could conceivably alter the American way of working to help the labor forces.  Exciting, actually!",
            "> Working on an issue where stopping halfway means it would take longer to pick it up tomorrow? Sorry but works ends at 5.\n\nHad a similar situation once. I worked at a very big storage place, and walking from one side to the other could take 10 to 15 minutes. \nOn an 8 hour shift we typically got 3 breaks: 2 short 15 min breaks and half an hour for lunch, or dinner if you had evening shift. (I know that seems short but it's not uncommon here. Most people brought their own food or bought some at the cantina).\n\nAnyway: When I started working there it was clear I could be more efficient if I sometimes took breaks a bit earlier or a bit later than the appointed times, depending on what I was doing and where. E.g. being ~10 minutes away from the cafeteria and my break is in 10 minutes, but it would only take 5 minutes to finish things up here. At the end of a shift I would save the company 20-30 minutes of me uselessly walking around and I'd be more productive. Everyone happy right?\n\nNope. Me and some other new employees who thought the same were giving a talk that we have to follow the appointed times. Result: 15ish minutes before a break some people wouldn't do anything anymore, because it could be a larger waste of time to start a new order and having to go back half way through. Great policy guys. Instead of us saving you 20-30min you added 20-30 minutes of doing nothing. They basically threw away almost an hour of productivity per employee.",
            "I had a boss who did this power trip on me. Same situation. She was too stubborn to back down from it though so I stopped working each day at 5pm and didn’t respond to weekend emails or texts for the last year I was there 😎",
            "Stop working without getting paid for it",
            "What? So you fought to do unpaid overtime?",
            "These stories are funny. Especially since the \"core hours\" concept has been pretty standard for years now. It's always weird you find some.boomer who treats engineers like they are doing a shift at the local McDonald's.",
            "[deleted]",
            "bravo to you. my higher up is my boss who is too dumb to do anything. he started to curse out at chase representatives because they didn't explain to him how to make an authorized user for me for his new bank account.",
            "Nine to five always confused me. Either you're not working eight hours or you're not eating lunch. Clearly your dictator shot herself in the foot. She basically mandated a seven hour work day.\n\nThere are times I wish my management was similarly bad at math.",
            "I do 7:45 - 3:45 (no lunch) to avoid traffic as much as that’s possible in Los Angeles. I mean traffic still sucks donkey balls but doing the hours I do shaves a few minutes off each end. Still despise traffic daily.",
            "I honestly don't get what's so hard for businesses to wrap their around when it comes to this kind of thing. You see countless examples of where a flexible approach to working hours is more beneficial, and countless more where strict start/finish times are counter productive.",
            "Similar thing happened in my office a while back. We were all supposed to report by 9:45 and start the work at 10am sharp.\nAnd what time to do we leave? \n'After the work gets done.'\n\nNow it's been 3 years since I had that talk with my manager and I still haven't gone back home, typing this message in my dinner break.",
            "I worked for a place that didn't want to pay me as much... I was an engineer on salary, but didn't have a lot of work to do because of a local recession in like 2012.\n\nSo they switched me over to hourly, with a rate equivalent to my salary if you assumed I worked 44 hours a week (this is what they put in the employment contract, and it's the maximum normal hours of work you can ask from someone in my province.)\n\nThen a big project came in and I knew how to do it - it was just a copy of a previous one I had worked on. They needed it done two weeks ago because everything was scheduled poorly. I was directly asked to do overtime, and I didn't mind because I had the time. I ended up working a couple months of 55+ hour weeks. This, of course, put me way over what I was earning on salary because not only was I working 25% more, it was overtime thanks to being hourly...\n\nAfter accounting noticed this I got an awkward meeting with the people who switched me to hourly in the first place where I was able to point-blank ask them if they wanted me on salary or if they wanted me to keep working extra hours for this super-important job. They wouldn't budge on going back to salary, so I started doing the whole 'leave exactly at 4:30' thing. No one was particularly happy.",
            "Your boss is exactly like my old boss, even when we're working from home.\n\nWe were told we needed to be online at 8.30am until 5.30pm.\n\nI typically did 9am until 5pm where I'll pickup my child from daycare then work in the evenings to make sure things were done. My colleagues were similar with a flexible wfh schedule. \n\nAfter his powertrip, we stopped doing anything after 5.30. This caused a few issues with the quality of work from our team as we suddenly had less time to complete tasks.",
            "the only two engineers on the team? ya y’all had her by the short and curlies and she knew it.",
            "I had a boss who hired me to manage her Gelato shop in the mall. I had 3 years of management experience in the food industry but I made it clear I had none with frozen desserts. She wanted to start mass producing the popsicles we offered within my first 3 months. Cool, I can do that but I need to be trained on how to make them so I can teach the team. She never responded to my request for training at another store (there was another franchise making them where we had been purchasing them at the time to sell directly to mall patrons since we weren't making our own) and when an old employee came by asking what happened to the old team I explained that it was under new ownership and the old team left with the previous owner and managers. We talked and I mentioned that I wasn't sure how to work the machines and she said she knew from when she worked there and that she would be willing to come in and show me so we can meet her goal. I relayed the information to the owner explaining that she could do it in 2 days 4 hr shifts each day of training. She just emailed me back \"ok\" and never talked about it again. She had repair men come in to check the machines several times and each time they told her there wasn't enough ventilation in the tiny back room (dish sink, 4 popsicle making machines, all the dish storage and ingredient inventory was all kept in an area no bigger than a gas station bathroom) for the heat to escape and it was causing the machines to overheat during the freezing process. Well guess who still insisted that the technician who was trained by the italian manufacturer of the machines, had no idea what they were talking about. She insisted that we could produce them and I just needed to read the manual. I did and I followed each step as best I could (most of the manual was in italian or 2010 google translate english) but at the exact same point every single run, the machines would shut off and that would ruin the Popsicles and I would have to start over. But every day only allowed for one run of the machine so that the ice cream could come out before closing with enough time to wash everything. As my final weeks passed I did as she asked. I tried to run the machines, scrap the fucked up ice cream, log it as waste and go about the rest of the shift with nothing to give her. Well she wasn't having it. Since she couldn't come up with a legitimate reason to fire me (no need since California is an at will termination state where employers can fire you for no reason) she accused me of letting my ex sit behind the counter and eat her ice cream. I asked her to prove it and show me the video footage and she just said it would take too long because it was 2 weeks ago and I told her she should have brought it up then. When she realized she was caught in a lie she began saying I was wasting her time and money and that I dont do anything. Mind you, she had schedules set up for 3 weeks at a time on time every week because of me. Her stupid Koren fish waffle things were selling because I took the time after fucking up the ice cream to make myself fish shaped waffle cones. Why she was trying to sell Korean frozen dessert out of an Italian Gelato spot is beyond me. She was quick to pay for my Lolicup certification even tho we didn't sell boba or any of the items I was trained to make during my 4 hour training session. She also expected me to pick up items from a restaurant supply store 30 minutes in the opposite direction from work before I was on the clock (ex: shift starts at 1pm I have to be there at 1 pm with the items she asked for without paying me mileage or time taken to purchase the items and drive to work 45 minutes away before the start of my shift) I said fuck that to her and I started waiting for my shift to start before I even left my house. Idk how the place is still there 2 years later but that mall is expensive to even have a spot especially next to the new fashion district they added on the side the store is on. That was my last job in customer service. I currently own my own caregiving business and I make my own hours and make sure I have all the proper and necessary training and certifications and I get paid for every minute im not at home taking dabs and eating chipies.",
            "Why do more work than you have to? If you're not getting paid extra to do extra then why bother?",
            ">So Lucy and I dropped it but we decided to show up exactly at 9 everyday, take a full hour for lunch, and leave exactly at 5. \n\nThis is the way.",
            "Nothing fixes bad policies like exactly following them.",
            "She is the typical bitch but I like the idea of the \"core hours\". I have had coworkers ganing the system and showing up at 7:30, spending 1 hour breakfast, chatting, doing nothing and then leaving at 3:30 to skip traffic. Then we have the other, showing at 9 but leaving at 8Pm. \nWorkplace needs to be flexible now",
            "Kudos to her for listening to your explanation and pivoting quickly. not all managers would do that.",
            "See, I like this one because it actually resulted in a policy that’s better for everyone. Malicious compliance for a cause!",
            "I was given the allowance to do 10 hour workday, 4 days a week\nOr 9 hours daily with every other Friday off, or\nWork at home. Or\nWork 8 hour days with up to 12 hours comp time meaning if I worked overtime, I could book that time and use the hours later to do anything I wanted to like car maintenance, banking, shopping, etc.   I was a salaried employee.\n\nI found I got a lot more done working 8 hours, five days a week.  I found that working at home was not only lonely, it was hard to separate work from play.  Nearly everyone else I worked with preferred to work at home.  Also, I literally could not work a sustained ten hour shift…too tiring.",
            "This is why working from home throughout covid was the best thing to happen to some people and some companies.  \nYou need to be able to trust your employees to get their work done.",
            "It’s amazing how often this type of thing happens. \n\nEverything is working fine but the boss decides to flex a bit and things go downhill.",
            "I love the core hours idea. My job is pretty slow in the morning so it would almost be better to have some of us arrive a little later and leave a little later....",
            "Well played!\nI worked federal civil service for my career and loved it when the finally approved “flextime”, which is exactly what you finally got. It’s a godsend!",
            "The moment I received an email stating that we are expected to be in the office 8-5, was also the moment that I stopped putting in extra effort into my work. There's something that leaves a negative taste in my brain when we are dictated hours we should be in the office. And I know my boss looks poorly upon working strictly 8 hours because when I used to stay late, talking about other people's hours was not uncommon. My boss also commutes long distance every week for work (flys into the city for the week, and out for the weekend), so I know he has nothing else to do here and because of that gets into the office early everyday and leaves late everyday, and doesn't understand why everyone else doesn't do the same.",
            "One of the problems of being a mid-level manager is needing to pass on rules from those above you. I ran sales staffs and really didn't care when my reps were in the office as long as they were hitting goals and stopping in for a bit each day. But my bosses were insistent that people needed to make an appearance at 830-ish every day. I hated enforcing that rule, as I was a salesperson at heart.",
            "This is where I am thankful I have a great boss who goes by the, we hire you and pay you a salary to do a job, not for x hours. As long as my projects are going well (or at least my portion) his view is, if you are in the office for 6 hours, I assume you worked the other 2 from home.\n\nNow of you try to burn him, he is not a push over, but do your job and you get treated like an adult.\n\nOf course this also goes both ways, on the rare time I have to work overtime (maybe a few weeks a year) because customers are on site and the meeting is still going...also part of the job",
            "I've been informed that this style of compliance is specifically called \"work to rule.\"",
            "H",
            "I love this! Some people are early risers and are happy to to to work early if they get to leave early; others are night owls and are happy to work later if they get to start later in the morning. Way to cater to all kinds!",
            "I'm kinda feeling left out that I've never had a flexible hours job, I've always had set start and finish times.",
            "I have 100% autonomy in terms of when I can work during the week.  As long as I hit my hours and work gets done.. I can work anytime.  I feel like after COVID a lot more people will loosen up on the having to be in the office thing.",
            "Man, I show up whenever and leave whenever. I always get the job done and do it well, when mistakes happen occasionally I fix them and that's that.  I'm a higher up manager but the owners don't even look twice at me when I leave early.\n\nI can't believe my luck when reading through stuff like this.\n\nSystem analyst btw. Workers under me - both supervisors and ground level are given the same freedom as long as someone stays until 4 to field problems, phone calls, deliveries, etc.",
            "OMG.. my boss at the hospital sends out emails that work is between 8:30 and 5pm. We work in finance. So entire department works only 8:30-5pm. This makes me laugh",
            "What about lunch? Can you not leave for your hour lunch?\n\nVery well played!",
            "For the people saying you are working for free, I disagree. You put in some extra time to make your job easier. This is something I do as well.",
            "That this is reddit worthy tells me you americans are deeply deeply indoctrinated by the bourgeoisie. No one in their sane nonexempts lives in the rest of the world works for free after a shifts end.",
            "So, instead of working your standard hours, as opposed to the extra hours you were before...you are happy you get to go back to the extra hours?\n\nIs this right?\n\nWow, you sure showed them, going home on time.",
            "Unless you're getting paid for those extra hours that you're working, your boss won this one.",
            "Stories like this are one of the reasons I stay where I am.  It's hard to find qualified people in my field, so the bosses simply expect us to put in our eight hours and they don't really care what those eight hours are as long as we aren't playing games where we show up at 6:00 one day, 9:00 the next, 7:00 the day after that, etc.",
            "as far as i am concerned, work starts when i start driving to work and ends when I either: get home or stop at a store on the way home.",
            "So you forced her to let you work for free? Good job.",
            "See, I've ratted collegues who would show up on time during nightshift, leave for 5-6 hours to go sleep at their house, go to bars, go playing hockey with other collegues (off work) who knew full well they were working a shift at that time, or whatever else they would do, and those same workers would come back around 5:00-5:30 AM before the dayshift workers would start appearing, and pretend it was a very productive nightshift with nothing happening.\nSaid theft had been going on for years.\nWell shit...\n\nWhen I hear the 'trust me to get my work done, I won't abuse on my working time', it somehow sounds cringey to me to the deepest areas of my soul.\n\nI don't owe you any trust, in fact I owe you nothing. However, each and everyone of us owes our bosses the amount of time of work we are being paid, and our bosses certainly have the right justification to at least validate that our work schedule is being respected. That's simply how labor laws are. If you want to fight that argument, I don't give a flying fuck, go fight that in court for all I care. Until then, that's how it is.\n\nI still remember going to HR about those collegues just stealing time every day for months, and that work (not being done) was being pushed against me and the other (serious) worker since I was one of those 2 employees found at night during that time (out of 4 employees). The lady at the HR office (just a low desk worker), had the guts to ask me \"and how does they getting away with it manage to get you in such a raging state?\" Well shit lady, I'm getting paid the same amount they are but also filling in for their workload, whilr they're probably busy nailing their wife or a hooker all night and still getting our boss's paycheck. You'd like to ask that again?",
            "I hate stories like this. As a manager I didn't care if people came in late as long as they made up the time. However, there where those that took advantage of the situation by coming in late and saying they would stay late to make up the time bit didn't actually do it. It got to the point where co- workers would get upset because they had to take up the slack. We've all been in that situation, it's not fair. So as a result I had to enforce the work hours to ensure everyone worked their  hours. I hated doing it, but there's always some a-hole who ruins it for others. This malicious compliance is just as much a-hole move as those that ruin the flexible  hours.",
            "That sounds like a pretty okay manager. She didn't take offense at your questioning her, she replied calmly. And when you basically offered her a trade -- restored output for liberties -- she again did not feel the need to \"teach you who's the boss\" but simply agreed.",
            "Corporate America is trash. You will always be more qualified for your bosses job, than your boss!",
            "I work with people who are routinely late because they have kids (their explanation, not mine) and one of them argued that, because they text to say they're going to be late, that it's fine.",
            "My first boss told me this and I never forgot:\n\n“If you’re early, you’re on time.  If you’re on time, you’re late.  And if you’re late, you’re fired.”",
            "I get wanting to “stick it to the man”, but didn’t you create a shit ton of long days and nights by doing this?"
        ]
    },
    {
        "post_id": "is2zrk",
        "author": "Samae3l",
        "title": "Asked to quit on the spot? OK, I will take you up on that :)",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/is2zrk/asked_to_quit_on_the_spot_ok_i_will_take_you_up/",
        "score": 18490,
        "num_comments": 686,
        "created_utc": 1600019698.0,
        "selftext": "This happened 20 years ago after i had just turned 18 and during my first adult job as a cook in a franchise that has a very creepy clown as a mascot.\n\nAfter working there for 6 months, i decided that i preferred to work as a bartender so it was known that I was looking to find some other job in a bar. This is a bit relevant with what happened.\n\nSo, I was  supposed to clock out at 4 pm. As soon as my shift ended, I punched my card (yes, we used to punch cards back then) and I was on my way to change clothes so i can leave. As I was leaving the kitchen a big group of customers (like 10 or 12) walk in the store, so one of the managers, demanded me stay to help. Note, she did not ask me if i can help, she demanded that i help even though i had already clocked out. Being 18 and nice, i agreed to stay to help.\n\nAround 20 minutes later and i was still in the kitchen with several orders still to do, so i was complaining to the second manager who is also working the kitchen at the time that i really needed to go.\n\nFor some reason, the other manager (the one that demanded that i stayed to help) overheard my complaint and starts yelling at me that i am useless and that i should be grateful that i have a job and that i shouldn't say these things as she knows i am searching for another job and she could fire me on the spot. Mind you, she was not working the kitchen she just entered the kitchen to grab some stuff. So i told her that i had already finished my shift and i was not getting paid for the extra time i was there, and that I was already late for the plans i had. So she yelled to me:\n\n\"If you want to leave now, i might as well quit\"\n\nCue Malicious Compliance. I followed her instruction to the letter. I told her:\n\n\"Yes, I want to leave now, so i quit!\"\n\nI took off my shirt and pants (as they were company issued), and went to pick up my stuff wearing only my underwear. Even after picking up my clothes i didn't bother to get dressed just walked out of the front door in my underwear. My shoes were also mine so i was not barefoot. I walked to my car, where i put on the rest of my clothes.\n\nThis happened in full view of the customers as the kitchen is in direct view from the whole store. She was dumbfounded and some customers even clapped and cheered because they heard how nasty she was being with me.\n\nLater i found out that she was reprimanded by the owner (probably because everything happened in view of customers) and i even got a small bonus on my last paycheck.  Within the next couple of weeks found a bar tending job that i kept for a few years. So in the end everything was for the best.\n\n&#x200B;\n\nEdit: Because people are asking, I am not from the USA. In my country you can legally work in a bar at the age of 18.\n\nEdit 2: Because i see a lot of people hang up on the \"people cheered\" part. When i left the customers that were there told me that i did the right thing and clapped. I didn't say that i got a standing ovation and I never said \"everyone\". I just said some people. In my country people cheer and clap for all shorts of stupid things. Glasses fall down and break, people cheer. People get in a fight, people cheer. It  is more common than you would think.\n\nBut even if you do not believe me, that's ok :) I just wish that i was able to entertain you...\n\nEdit 3: Because people are asking, I am from Greece. Although from my understanding the same thing (cheering for things that break) is happening all around the world. I saw many people mentioning the UK and Australia.",
        "permalink": "/r/MaliciousCompliance/comments/is2zrk/asked_to_quit_on_the_spot_ok_i_will_take_you_up/",
        "comments": [
            "The “small bonus” was probably not a bonus at all, but compensation for time worked. because they didn’t want to face a lawsuit for not paying you for working.",
            "Bravo, going out like a boss in your chonies. That is masterful.",
            "I was thinking, \"man, 20 years ago was a long time ago and picturing the 60s.\" Then I realized I was 16 20 years  ago working fast food also using a punch out card 😂",
            "Takes balls of steel to walk with no pants around deep fryers.",
            "You literally and figurative showed balls with that display.\n\nI applaud you",
            "it's amazing how often people think \"you can't be 18 and work in a bar\" because they believe it's only America these things happen",
            "Reminds me of when I quit one of my bouncing jobs. The owner of the club kept letting his kid and his friends in through the back door. Thing is where I live I am liable if underage drinking happens as to get a license you have to jump through some hoops and go through courses. I told the owner I was going to walk with the entire security crew, he called us out on  a bluff and we all ripped off our shirts and jackets and threw them at the front door and walked to the 7/11 down the street to have some late night shitty hot dogs.\n\nThe club had to shut down for weeks because it was a small town and word got around fast so nobody would work there.",
            "\"Very creepy clown\".... Can I get another clue?   Having trouble with this reference.\n\nEdit... I get it.   Just forgot that place had a McMascot.",
            "*and i was not getting paid for the extra time i was there*\n\n&#x200B;\n\nWhy would you work if you were not getting paid?",
            "I hope you flexed to the customers on the way out. 😂😂😂",
            "countries exist outside the US guys",
            "I did a very similar thing.  I had started working at a job and had only been there for a couple of days.  I wasn't on the schedule yet.   I was cleaning the dining room when the manager came up and started talking to me.  I told him, \"I know you don't have me on the schedule yet and my friend's sister is getting married Saturday so I would like to have it off if possible.\"  I was expecting a no but what I didn't expect was for him to start yelling at me in front of everyone.  I immediately pulled off the shirt and the paper hat and threw them down and said, \"I asked you a yes or no question and I don't deserve to be treated like this\"  I walked out bare-chested and proud. Thankfully the pants were mine. : P",
            "The real question is was it boxers or briefs? If it was briefs, well that could've been much more entertaining!",
            "I suppose it is too much to hope that you were wearing He-Man boxers and yelled \"By the power of Greyskull!\" on the way out.",
            ">I even got a small bonus...\n\nI'm sure you know this, but for everyone else's benefit - unless your base pay reflected the extra 20-30 minutes you put in while not being clocked-in, that was at the very least payment for the time you worked. \n\nYour story made it up the chain, which means they found out that you were working while not being clocked in. Businesses can get in tons of trouble for wage theft. Do not tolerate employers who force you to work off the clock, or don't pay overtime when they should. If they refuse to pay you, or threaten to fire you, report their ass to the appropriate labor board/authority. \n\nI'm assuming the bonus was over and above what you were owed, which means it was probably a little bit \"for your trouble\" as well.",
            "Bravo, OP. I will never forget how much I hated middle management Karen's when I was cooking 20 years ago.  \n   These college failures like to forget I had dates requested off, concerts, self respect, and *a life* . \n  I'd put in for holidays off with family, for vacations, and I would just tell them to fire me.  No big loss.",
            "\"Because i see alot of people hang up on the \"people cheered\" part.\"\n\nPeople get suspicious when they hear this but it really does happen.\n\nWhen I was about 12 I was with my mum at an auction house. This place has a huge warehouse stacked full of stuff in piles...furniture, cupboards, tables, chairs, oscilloscopes, knives...everything. Mostly antique.\n\nI was bored and wandering around the stacks. Some guy had just won a bid and was now trying to carry his item out, edging his way between the stacks while carrying it high in front of him. As he did so he brushed a stack of chairs and the top one started falling..and heading straight for a large antique dressed with a full length mirror.\n\nI was right near there and grabbed it just before it hit the mirror.\n\nThe auctioneer saw it, and said \"everyone let's give a round of applause to this boy\" and they did.\n\nI've posted it to reddit once before and...people doubted it because I said people applauded. But sometimes they really do.\n\nIn this guy's case, I find it quite believable people would cheer him on for quitting when he's being abused. I would.",
            "[removed]",
            "Wow. She deserved that. I worked at one for a while, we had these older ladies who were constantly yelling at people and talking trash about them in another language, everyone just kind of dealt with it because they have been working there for so long. One time they yelled at this guy, im assuming he was having a bad day or something because he straight just cussed them out before giving them the finger and leaving. They were dumbfounded. Lost their only cook because they didn't know how to talk to people normally. It was honestly one of the greatest moments I've had in that place.",
            "You can legally work in a bar at 18 in the US too.",
            "hey, don't be so modest, I'm sure some people were clapping and cheering because you're quite a site in your underwear",
            "I had to quit my retail job so I could visit my family for Christmas. They told me no so I quit, then got my job back once I was back in town!",
            "As a former fellow employee of that chain; well played!",
            "I too have worked for a creepy clown franchise that treated me like literal dirt. I once called in sick because I had a fever and was not feeling well. Mind you, I was the cook, my manager legit said...\"But...we need you today, you're still coming in right?\" I ended up quitting on the phone right there. I swear, these franchise managers are literal pieces of shit.",
            "My son is 2 and cheered when I dropped a plate yesterday. A true British lad.",
            "[removed]",
            "Few years ago when I was still young and naive (pre-work life), I thought this kind of thing was exaggeration.\nBut after doing retail with management being harder to deal with than customers, I'm about to act up too LOL",
            "Lol the “small bonus” was probably the owner covering your unpaid labor so you couldn’t come back and sue them for unpaid wages.",
            "I feel like the crowd may or may not have been cheering because of the 18 year old walking out to their car in their underwear.",
            "Creepy clowns!",
            "[removed]",
            "~~Locking while I read through the comments.~~\n\nEven implying a poster is making up part of a story generally will result in a permanent ban.\n\nEdit: Unlocked now.",
            "[removed]",
            "You got a small bonus probably because the owner realized making you work off the clock was super illegal. NIce exit, by the way!",
            "Why didn't you clock back in first?  OK, at 18 maybe we don't think a out it, but either you were donating your time or they were illegally working you without payment.  I hope it wasn't a common occurence.",
            "Is your name by chance Steve? Because this sounds like a dude I worked with right down to the fuck you walk of underwear clad zero shame.",
            "you uh...probably got a bonus because making you work off the clock is EXTREMELY illegal, and they wanted to make sure that was covered.",
            "Walking out in you underwear was a nice touch. Well done",
            "The only part of the story that bothered me was the \"(yes, we used to use punch cards back then)\" as if saying kids these days don't know about punch cards. You didn't need to qualify that.",
            "This is my boyfriend's ultimate plan is he ever wins the lottery. He's a CO, so everything is issued to him. He told me he plans to work until they piss him off again, which is inevitable, and then help strip his uniform off and walk out in nothing but his boots and boxers.",
            "People telling you this story is fake because you were  18 and bartending are not only stupid, they’re wrong. It’s legal to bartend or bartend with restrictions in 27 US states.",
            "This was excellent. Good on you for standing up for yourself! \n\nAlso, cue not queue.",
            "[removed]",
            "> Because i see alot of people hang up  on the \"people cheered\" part.  \n \nSome people have led really boring lives, don't worry about it. It's never been for something I did, sadly, but I've seen spontaneous clapping break out in public before over situations where no one even got undressed. Some people just think /r/nothingeverhappens",
            "How did you keep your balls from dragging on the ground? Parking lots get hot.",
            "The small bonus was probably too keep you from reporting them for forcing you to work off the clock.",
            "It's true, I was the clothes",
            "She said: \"If you want to leave now, i might as well quit\"\n\nShe said SHE was going to quit... why didn't the story continue that way?",
            "> a franchise that has a very creepy clown as a mascot\n\nSo, **McDonalds**?\n\nThere's no reason to be so coy about it, people. Just post the fucking name of where you worked. It's OK, no one can do anything about it.",
            "In the US you can work at a bar as long as you're 18+. I've known several 18 yr old bartenders at my place of work",
            "I would have cheered. That's awesome.",
            "[removed]",
            "> first adult job as a cook in a franchise that has a very creepy clown as a mascot.\n\nKrusty Burger?",
            "There are many states in the USA you can bartend at 18. Idk why ppl think they know things",
            "You can legally work in a bar at 18 even in the US. \n\n&#x200B;\n\nSource: Started bartending at age 18 with like 2 weeks of high school left",
            "Bonus sounds like overtime. I’ve had managers try to keep me around a bit longer and all you have to do is say overtime and suddenly they don’t need you anymore. There are also managers that watch employees like a hawk to ensure overtime doesn’t happen.",
            ">Glasses fall down and break, people cheer. People get in a fight, people cheer\n\nDefinitely a commonwealth county",
            "I’m guessing UK where people definitely would cheer at that (if only for walking through in underwear - it would be mostly teenagers anyway) and wouldn’t have dreamt of suing for this esp 20 years ago. \n\nGlad you got the bar job you wanted - that is by far the better job for an 18 year old! I enjoyed my stint behind the bar as a teenager too.",
            "I have been in McDonalds seeing employees snap at managers and quit, I have seen people clap too.",
            "Hah! One time when I was doing restaurant work I was eating a meal at the bar before my shift. The phone rings. And rings. and rings. The manager storms out of the kitchen, answers, it, then says something snide to me about being lazy.\n\nI glared at her and said, \"I don't work for free.\"",
            "Opa!",
            "[removed]",
            "Typo in the only sentence that matters in the post....",
            "Lol, fuck these redditors and their hangups on your story, you don't owe them an explanation. Good for you, yo!",
            "[removed]",
            "[removed]",
            "The customers clapped? Until they realised their meals would be late.",
            "[removed]",
            "[removed]",
            "\\> n my country you can legally work in a bar at the age of 18. \n\nYou can do that in many parts of the US as well.",
            "Absolute madlad you are for just walking out in your underwear.",
            "Is this really a “everyone stood and clapped” story...",
            "I thought it derived \"Quilt\"... so i read on until i found out it said \"quit\" and i was disappointed.",
            "Why dont slap ur dick on the counter as well... could at least put you're clothes on",
            "I wonder if I’d catch a charge for that if I tried it today.",
            "Reminds me a bit when I left my job a couple weeks ago in a warehouse in the UK. I hated every second of it because of the manual labour and al the managers were dicks screaming at you to work harder while all they did was walk around with clipboards. So on my third day I decided to clock in and I left for four hours and I came back. I finished my shift for the remaining four hours and my manager was like “wtf did you go” I just blagged it and said “idk xD” Then he said “ok your fired” and I just said “ok XD” He was surprised I didn’t give a crap and being the old grey haired person he was, he was probably jealous that I was a young kid with freedom in my life and I wasn’t trapped that in that toxic workplace like he is",
            "Why the hell didn't you clock back in to help? Even if you're being nice by staying late, you should damn well not do it for free.",
            "Working for a friends family business, civil construction, I had spent about two days by myself (no biggy) on a site forming and setting up steel for a 15 cubic meter concrete pour (deep and not a big top square area. The week that it had taken to excavate there wasn’t a toilet on site but the site was an active raw sugar transfer station and I got with the staff and they gave me access to the staff toilets. \nAbout an hour my boss turns up and I am off site using the toilet, as I wasn’t standing on site waiting for him, he gets frantic. I coming walking up the path from the staff toilets and he goes off. I told him I needed to use the toilet and he says ‘just piss on site, like do’. I told him that I’m not a dog and just shit anywhere. Major argument ensures, I told him to stick his fuck up his arse and walked off. He had to close another site to get a concrete crew to the impending arrival off the first 5 cubes. \nThe next week when I picked up my wages his wife thanked me, laughed and said the concrete delivery company charged him a waiting fee.",
            "saw edit 1 and got kinda pissed",
            "I also started bartending at 18! Best job i’ve ever had :)",
            "There's a nice freedom when you're on you way out from a job, I remember my last job working in a kitchen at a restaurant knowing I was leaving in a months and I'd already given my notice, I just kept telling the managers what they're doing wrong and how people are upset with how things are run, from where I worked in the kitchen people always told me their problems so I'd tell the managers without disclosing the employees name what the problem was and call them out on their shit without any fear of repercussions, because what are you gunna do, fire me? I quit in a month anyway",
            "That's what I call going out with a bang",
            "Haha walking out in your underwear! I love you",
            "Just want to point out that you can work in bars at 18 in the USA",
            "Sounds like a good way to become a sex offender",
            "A Masterclass in Malicious Compliance, right there.\n\nTake notes, students.",
            "This story makes me grin from the inside out. Nicely played!",
            "Absolutely amazing good for you for sticking it to the  man",
            "You can be a bartender in America at 18, varies by state\n\nhttps://www.alcoholproblemsandsolutions.org/minimum-age-for-bartending-bartender-laws-by-state/",
            "I pictured the walk out in undies as female... then I read the comments. Oh well...\n\n🤷🏼‍♂️🤦🏽‍♀️",
            "Moral: Know the value of a having a job but, more importantly, know your own worth.\n\nWay to go, OP!",
            "[removed]",
            "OK. Thanks for making it.",
            "In the US (In NJ at least) you can work in a bar/bartend at 18",
            "as a former worked-for-retail stores, in the USA you can sell alcohol at 18. Not sure about working in a bar, however.",
            "I like the part where you had to explain that your pants were company issued",
            "Wait!  People don't clock in anymore?  What do they do?\n\nIt's been about 20 years since I worked an hourly job.",
            "If I walked out on my job I would lose my job and my licensing. But I also do a very serious job so.",
            "This might as well be a green text",
            "That cheering part was funny what other things do they cheer for?",
            ">> Glasses fall down and break, people cheer\n\nThis is Australia right? That’s a “TAXI” description if I ever heard one",
            "The moment after I’m off the clock, I refuse to do anything else.",
            "Creepy clown mascot? It was McDonalds wasn't it",
            "You can legally work at a bar at 18 in the USA as well.",
            "Are you in Australia?",
            "Glasses break and people cheer..... You must be in the UK! 😂",
            "Sounds like england, we cheer when someone drops something breakable.\n\nOur cheers are more \"weeeey!\" Lol",
            "“Glasses fall down and break, people cheer. People get in a fight, people cheer”\nSo you’re in the U.K. I see...",
            "Don't forget, many (most?) of the people in the queue probably work crappy jobs with shitty bosses too, so OP was doing what they've only dreamed about. Of course they would applaud their hero.",
            "You can server alcohol at the age of 18 in the US I thought, you just can't if you are under 18... at least thats how it was when I was in college.",
            "Which country are you from where people cheer when glasses break?!? Love that energy and you guys sound like a fun bunch of people to be around :D",
            "Some folks will believe NOTHING. Imagine how sour thier lives are at times. This link might makes you feel better about that:\n\nhttps://tanksgoodnews.com/2020/09/03/arnold-schwarzenegger-pipe/",
            "As much of a meme it has become with the whole \"and everyone clapped\", I do totally believe it in this story.\n\nIve watched friends walk out on shit managers with customers in view of said manager being a right cunt, and a few of them laugh and clap as they did it.",
            "Is this england by any chance? We'll cheer for anything, I think it's because we're so crap at sports we have to get our jollies where we can",
            "My favorite part is that you walked out in your underwear and shoes. Absolutely priceless 👏",
            "🧢",
            "As a person currently working part-time at McD, I feel you. Sometimes managers are the literal worst, expecting you to treat them like kings, and demanding everything :(",
            "> Edit: Because people are asking, I am not from the USA. In my country you can legally work in a bar at the age of 18. \n\nyanks can't handle their booze lul",
            "Great story .  You would likely get a standing ovation for that in USA.",
            "I believe you could work at at bar at 18 twenty years ago as well. I don't think the laws Changed until 2004.",
            "Ugh it annoys me that people want explanations and that they don't believe it happened blah blah, even if you don't believe them, who cares?? Its an entertaining story nonetheless! Lol and I absolutely love this, i was the same when i was 18, i was taken advantage of so much cos i was so timid and too nice. I wish i could've done this! Love it, whatabitch, glad she got reprimanded!",
            "I would have guessed Canadian.",
            "I'm from the US and started work as a bartender the week after I turned 18 (This was in '89).  Has that law changed?  The comment by the OP made it sound like that wasn't allowed in the US.",
            "I have a small suspicion I was one of the people clapping...",
            "Yeah, I thought Australia haha",
            "Clapped AND cheered? Wow"
        ]
    },
    {
        "post_id": "e9b2d6",
        "author": "HerbertRTarlekJr",
        "title": "Need more privacy at the ER? No problem",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/e9b2d6/need_more_privacy_at_the_er_no_problem/",
        "score": 18434,
        "num_comments": 1049,
        "created_utc": 1576089465.0,
        "selftext": "A relative of mine dates an ER doc.  It was a typical slammed evening, and a lady arrived with a non-urgent, non \"personal area\" problem.  All treatment rooms were full.  \n\nThe doc suggested that she have a seat in the hallway, and they could probably get her taken care of fairly soon.\n\nShe started complaining about being in the hallway, and used the term \"HIPAA.\"  That was all it took.\n\nThe doc said, \"No problem.  Have a seat in the (full) waiting room and we'll get you a room when we can.\"\n\nThe patient said, \"You know, Dr, I'm actually comfortable being seen in the hall.\"\n\nHe replied \"But now I'm not comfortable with it.\"\n\nShe was there for six hours before a room was available.",
        "permalink": "/r/MaliciousCompliance/comments/e9b2d6/need_more_privacy_at_the_er_no_problem/",
        "comments": [
            "It’s funny that I read this while sitting in the hallway of the ER with my son because they had no rooms. \n\nYou can treat him in the hallway and get us out of here faster than if we wait for a room? Be my guest.",
            "[deleted]",
            "Nice response!\n\nThe last time I was at the ER, there were some incredibly rude people, and more appalling stories from the nurses.\n\nApparently, some people just lack any compassion and sense of human decency, and the staff have to suffer from it while trying to save lives...",
            "As a HIPAA compliance investigator, I love this!!!",
            "LOL...that ER doc a staff physician or a resident?",
            "Once you scream law, lawyer you have put the other party on notice that you might cause a problem. I was returning something to home depot one time and the guy in front of me was complaining about a can of paint he bought. I think the manager was going to do the return but the customer got beligerant. He said something to the effect \"I'm going to get a lawyer\" and the manager said that he could no longer process the return since he threatened legal action. The guy changed his tune but the manager stayed firm. The customer was wrong and left with the paint he was trying to return.",
            "Where I work we got so tired of people threatening to sue us or to have their lawyer call us that we created a standard response in those sorts of situations.  As soon as a client or prospect says the word lawyer in a threatening, passive aggressive, or choosing beggar way, we break out our canned response. \n\n“I’m sorry, since you mentioned your attorney, we can no longer discuss this with you directly. We will be happy to wait until your attorney contacts us. At that point we can continue this conversation through our respective attorneys.“\n\nOf course we know that most people are bluffing, but it is nice how quickly it shuts down all of the bluster and drama. In fact, ee’ve gone so far as to not take phone calls from prospects after they trip the lawyer button. \n\nIT’S BEEN AWESOME!",
            "[deleted]",
            "I know it TV but for any of those that watched House M.D. its filled with malicious compliance. The one sticks out in my mind after reading this where a patient serves House with a lawsuit. House says great now I dont have to share your test results. Patient tries to take back the legal documents only to have House go no no no, these are mine now and walk away.",
            "That's one outstanding power move there.",
            "This makes me think of the people I always hear bitching about the wait time when I'm waiting in ER. If you have to wait and people get skipped ahead of you that's good. That just means you ain't hurt so bad as anyone else in the room.",
            "[deleted]",
            "Forgive my ignorance,  what does HIPAA mean and why did it change the docs tune?",
            "Had something similar happen that made me feel all warm and fuzzy.  Woman came into ER level 1 or 2 trauma, bucked off a horse or something.  Required urgent surgery that could have been done at our hospital.  The surgeon comes in to speak with the women of the procedure and the woman talks down to the surgeon for what we all obviously assumed we're racial reasons.  Woman says she won't let him operate on her want to talk to another surgeon.  \n\nUnlucky for her there are no other surgeon's, within 6 hours that can operate on her.  Only option is to get shipped out on a rotor to like Salt Lake.  The woman suddenly changes her mind about her previous issues with the surgeon and asks to have him do the procedure.  Surgeon at this point refuses to speak with the patient staying she needs higher level of care and he wasn't comfortable in taking her as a patient.\n\nHave fun on your $10000 heli ride out of state ya old bitch.",
            "Love this. As an ER nurse we know it isnt optimal to be in the hallway but it gets you back and seen. It is only going to get worse. I live in a large city we should have atleast 6 more major hospitals for the population size. That coupled with people living much longer and lack of insurance it means we are constantly pushed to the brink. Everyday is a shit show. I will always do my best to insure your privacy but it is what it is.",
            "Y'know, while I wouldn't necessarily ENJOY being seen by a doc in the hallway, simply because I'm very private and that would make me feel weird. However... in an ER, when it's not an issue with any \"personal areas\"? Hell yeah the hallway works. I'd agree to the parking lot or the roof. I don't like being in the waiting room for 6 hours while a host of deathly ill/sick/godknowswhat people parade past. \n\n(All empathy intended toward the sick people, don't get me wrong - just saying it's not the most.. pleasant? environment to hang out in all day.)",
            "TRIIIIAAAAAAAGE!",
            "This is a beautiful backfire.",
            "I have such a hipaa-fueled (lady) justice boner rn.",
            "See, that's some r/clevercomebacks shit right there. Also, did she need to be transferred to the burn ward after that?",
            "if it was non-urgent what was she doing in the ER?",
            "oh how the turntables... have turned",
            "I was on a sports team, and we had a physician caring for the team.\n\nThis one time I had an issue with an ingrown toe-nail, and at the sports-club he told me to check in to the  policlinic to get taken care of it. When I arrived they asked me for my reference and I dropped this guys name. And was seated for like half an hour. While sitting there, I talked to other patients who we waiting for like hours on end. And I was helped within 30 minutes, the guy just told one of his physicians to \"shuffle me in\".\n\nThat day I found out two things: 1: the guy that's supporting our team as a physician is the head of a policlinic. 2: The big divide in healthcare is whether you know a doctor or you don't.",
            "God, I couldn’t understand how everyone was so heartless until I read a comment implying it wasn’t a “personal area” problem. I misread the original post, I thought it was saying that it was a personal area problem, meaning her vagina, and everyone was shitting on her for having an issue with having her vagina examined in a hallway.",
            "[deleted]",
            "**HIPAA  -** Law to enforce privacy protection while dealing with healthcare.\n\n**TL;DR**\n\n>The Health Insurance Portability and Accountability Act (HIPAA) was created primarily to modernize the flow of healthcare information, stipulate how Personally Identifiable Information maintained by the healthcare and healthcare insurance industries should be protected from fraud and theft, and to address limitations on healthcare insurance coverage – such as portability and the coverage of individuals with pre-existing conditions. \n\nSource:  [https://www.hipaaguide.net/hipaa-for-dummies/](https://www.hipaaguide.net/hipaa-for-dummies/)",
            "The Doctor was right to do that. Don't fuck around with HIPAA",
            "I worked as a medical scribe in the ED and it is not uncommon for patients with non-emergent presentations to wait for this long or longer. I temporarily did shifts with the sole purpose of weeding them out: parents bringing in their kids for marijuana testing (sent home), drug seekers and people who need signatures to navigate our bureaucratic healthcare system trying to get placement in rehab/mental health programs.",
            "patient : I don't wanna be seen in the hallway\n\ndoctor : OK we won't do that then, we're gonna wait for a room to be free \n\npatient : surprised pikachu",
            "Short and sweet. This should win Best MC for 2019. As a person who works in the medical field and has to adhere to many rules and protocols, this put a big grin on my face",
            "My daughter is an ER nurse. A frequent flyer patient came in demanding his usual pain meds. He screamed at and threatened her for an hour. She calmly would tell him that he could get them just as soon as his results were back from radiology ( where I work). Finally be looked at her and said if he didn't get them right away,  he was going to kill himself.  She quickly left the room and came back with a set of plain OR scrubs and told him must change into them. When he wanted to know why, she informed him that she was afraid he might something in his clothing that he could use to harm himself.  She also informed him that he was now under one on one surveillance,  mental health professionals had been called in to take him under their care, and that they were not allowed to give pain medication to suicidal patients.  Poor fellow tried to retract his threat, but she held firm. I was so proud.",
            "In the US, I don’t know about other places, you can literally die waiting. A relative of mi e almost bled out in a chair waiting.",
            "This brings me so much joy. Exactly the way to handle it",
            "My toddler hurt his knee and couldn't put weight on it and husband took him to the ER. I dont think he ever even got a room because they were full. They just got him an xray after the triage stuff and then did a quick exam to make sure everything was okay.",
            "This is the best kind of Malicious Compliance.",
            "HIPAA - forgive my Brit ignorance, why is this significant?",
            "This reminds me of when I was a kid and having to get my finger stiched back on. Sitting in the hallway of the ER, dude basically pulled up a school desk with the small table and chair that are  connected and I just sat in a chair with my hand on the desk. I remember thinking it was weird but I didn't give a fuck.. I just wanted my finger fixed so I could go home.",
            "HIPAA: Acronym that stands for the Health Insurance Portability and Accountability Act, a US law designed to provide privacy standards to protect patients' medical records and other health information provided to health plans, doctors, hospitals and other health care providers",
            "I'd just go to another hospital.\n\nOh wait, certificate of need laws banned other hospitals in my state!",
            "As a non-american I didn’t really get this",
            "What's hipaa?",
            "BWAHAHAHAHAHA!",
            "Downloaded your local medical systems’ apps. More than likely they have wait times listed for all the facilities. Pick the one with the shortest wait combined with drive time instead of just the closest one.",
            "Because legal intimidation is always a good way to endear yourself to thers."
        ]
    },
    {
        "post_id": "qsm1ek",
        "author": "petey_b_311",
        "title": "You want me to wear a see-thru shirt? Gladly!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qsm1ek/you_want_me_to_wear_a_seethru_shirt_gladly/",
        "score": 18379,
        "num_comments": 355,
        "created_utc": 1636754558.0,
        "selftext": "When I was 15 I started working for a particular clown who owns a fast food restaurant.  When I first started working the manager assumed I was 16 and I was given a red polo shirt to wear during my shifts.  There was a hierarchy to the shirts at this restaurant, white was for anyone 15 and younger, you got a red shirt once you were 16 or over, black shirts were for crew trainers, and the full button down shirts were for managers.  All of the shirts were made of a decent fabric except for the white shirt, which was very thin and practically see thru.\n\nAbout a month after I started working there, the manager called me into her office and asked why I had lied to her about my age.  I told her I  had never once said to her that I was only 15 so I never really lied about it.  She told me I had to hand in my red shirt and exchange it for a white one, which I did.  I wore the white one for about a week and that's when I noticed after the first wash the fabric became even thinner and the shirt was practically see thru.  As a heavy set individual, if I were not wearing an undershirt, you would have seen all of my hairy manly glory underneath this sorry excuse for a shirt.  I asked since I had already been wearing a red shirt for a month, and the shirt colors really don't mean much, could I get my old red shirt back?  I was told that it was company policy to follow the shirt rules and I was denied my old red shirt.  \n\nCue the MC\n\nThere was a rule stating I had to wear my see thru company issued shirt for all my shifts, there was no rule stating what I had to wear underneath.  My dad had recently returned from Mexico, and had brought me the most touristy shirt from his trip.  There were four panels on this shirt, the first had a worm and a shot that said one tequila.  The second the same worm, second shot, much drunker and said two tequila.  The third, the same worm, third shot, very drunk and said three tequila.  And as I'm sure you have deduced the fourth is the worm passed out and it says floor.  I decided this was the perfect undershirt for a 15 year old register worker at the clown to wear underneath his see thru shirt.  I wore it for one shift before the manager came up to me.  She told me how much she didn't appreciate the fact that I wore such a vulgar shirt underneath my work uniform.  I politely told her nobody would know what I was wearing underneath my company issued work shirt if they weren't see thru.  When I went to clock out that day they had a brand new unused red polo shirt just waiting for me.  I was told to wear the red shirt from that point forward and to turn in my white shirts.",
        "permalink": "/r/MaliciousCompliance/comments/qsm1ek/you_want_me_to_wear_a_seethru_shirt_gladly/",
        "comments": [
            "I can shed some light on the different colours, though it doesn't excuse the shitty quality material of course.\n\nI used to work at a KFC and for a while we had a similar system. The reason being, 15 year old 's and younger couldn't use certain equipment and couldn't work after a certain time due to local child labour laws. \n\nWe used to get random audits (CER/ROC) and the auditors had no way of knowing who was underage until after they did all the paperwork auditing and shitty managers that had under 15's using equipment would have them work up until the paperwork auditing then send them home so they didn't get counted as staff on shift and picked up for doing the wrong thing. \n\nThe colour shirts were implemented in our area as a test and didn't end up working for a completely different reason (didn't match the corporate identity) but it was very effective for the audits and managers from other stores covering shifts, area manager visits, etc.",
            "Bravo. No one got harmed, no one got insulted, and an important point was made. Love to see it.",
            "I'll admit when I started reading I assumed the post was from a girl.\n\nWhich would of course gone in a completely different direction :)\n\nedit: Ok, I guess the same direction, but would have take a somewhat different path to get there.",
            "You gotta thank your dad for his excellent taste in shirts.",
            "Oh, souvenir T-shirts. \n\nMy parents made a habit of getting me the raunchiest ones they could when they went places, and it became a game to see how far I could push them at school... The black one with the glow-in-the-dark skeletons in a variety of sexual positions was a perennial favorite among my friends.",
            "Great story. Funny how 'rigid' company policy can suddenly become so flexible sometimes.",
            "It’s kinda sus that this place had a rule that children had to wear see through clothes\n\nLike, obviously *that* wasn’t the rule but who made the rule and who bought the shirts?",
            "I used to work some baking shifts at Tim Hortons and my manager tried to force me to change into the bakers’ whites one day, even though I hadn’t known I would be baking that day so I hadn’t worn an undershirt. She said it would be fine but I flat out refused. I’m surprised I didn’t get written up for my refusal because she was pissed, but I was not about to work a shift with my bright blue bra on display for everyone.",
            "I like this one",
            "Wait!  On Star Trek the crew member wearing the red shirt was always the first to die.",
            "I (large busted woman) wash cars. They gave us some white shirts once. I told them there was no way I was going to enact a wet t-shirt contest at work.\n\nThey let me go back to wearing the black shirts.",
            "Well played, well played.",
            "One tequila, two tequila, three tequila, more\n\nfive tequila, six tequila, seven tequila, floor.",
            "So I think your shirt choice was awesome, but a strong \"2nd Place\" would have been a shirt that had something like: \"Where all the MILFs at????\" with appropriate artwork...",
            "When I first saw the subject line, I assumed a male manager was coming on to a young female employee. Your story is much better.",
            ">  All of the shirts were made of a decent fabric except for the white shirt, which was very thin and practically see thru.\n\n> white was for anyone 15 and younger\n\nSeriously?",
            "\"my hairy manly glory\"   Wonderful :)",
            "[deleted]",
            "Reminds me when I showed up to work and every one else received work hoodies but me. So I show up with a custom hoodie that says \" shut up and pass the weed\" with a hand passing a joint. First hour into work my manager gives me a free work hoodie.",
            "Sorry but you never want to be the crew member wearing a red shirt. Only only outcome......",
            "Should have worn a shirt with the logo of a particular king who owns a fast food restaurant.\n\nThat said, well done!",
            "Note, if THIS didnt work, you could always try a BurgerKing tshirt underneath.",
            "Okay, can we talk about the fact that they force minors under 16 to wear see through clothes? This sounds very very fishy to me",
            "So back in my day when I worked for the clown, you would have been wearing a green polo. (I can’t remember where the age divide was for the green and red shirts back then)",
            "[deleted]",
            "Reads title: oh yeah 😏, weird but ok\n\nFirst sentence: 😲 woah! Ga, wtf!\n\nContinue reading: Its a dude 🤣",
            "Um, are 15 yea old girls also required to wear the white *see through* shirt?",
            "As a heavy set individual, if I were not wearing an undershirt, you   \nwould have seen all of my hairy manly glory underneath this sorry...\n\n&#x200B;\n\n*Hey!  I'm eating lunch at work here!*",
            "Well done.",
            "Well played.",
            "I wanna see the worm shirt",
            "Savage. You beat the manager at her own game!!",
            "Why on earth anyone would think that wearing white was a good idea for fast food anyway is beyond me. \nAnyway good for u I love this story.",
            "For a long second I thought you were female and sexual harassment charges are about to happen",
            "Should have insisted to play by the book and kept wearing the tequila shirt under the see through shirt.",
            "you smartass, i love it",
            "So Chick-fil-A huh?",
            "I love it.... but at that point I would feel insistent on following the rules they insisted  on the week prior....",
            "ok, now I need to this \"vulgar\" undershirt",
            "So was the clown Ronald McDonald or not?",
            "Congrats to you.  You sir are a genius!",
            "Definitely MC and well done!",
            "Long live the worm.",
            "Lol. At the start I thought the story was going elsewhere. Well played.\n\nI have a necropholia definition shit I wear occasionslly.",
            "What on earth would be the point of forcing 15 year olds to wear see through shirts other than something inappropriate? Would love to have them defend that policy. \nGood for you to make it so transparent ( pun partly intended)",
            "Isn't anyone else disturbed there was a set company policy of obvious sexism,  voyourism and borderline pedephile behavior? Just EWW. \n\nI applaud the MC but am now wondering what FF restaurant this was.",
            "What the hell is even the point of assigning shirt colors by age, in a fast food restaurant no less? Surely there can’t be many situations where you need to know an employee’s age faster than the time it takes to consult HR",
            "Can we talk about how you have to turn your old shirts back in. Are they going to redistribute them to other new employees?",
            "I went into this thinking someone was making a 15 year old girl wear a see through shirt and wondering how that could possibly fly...  Relieved that it wasn't that but it's still shitty.  Glad the MC sorted it.",
            "Good work!",
            "Lovely bit of MC there",
            "Well done",
            "And then the manager sent him away on a mission to take out the trash and a horrifying creature jumped out from behind the dumpster and killed him.",
            "Not the same one but it was probably like this shirt :\n\nhttps://gem.app/product/one-two-three-tequila-floor-t-shirt-drunk-57088\n\nOr\n\nhttps://www.ebay.co.uk/itm/1-2-3-Tequila-Floor-Key-West-Florida-Funny-Graphic-Design-T-Shirt-Size-XL-/113707752866 (lower res image)",
            "This was glorious 😅😅",
            "And here I was, fearing the worst and expecting a Star Trek red shirt story. I'm glad your still alive OP!",
            "America is so fucking weird. You guys work at 16 years old? And everyone here thinks it s normal? Fucking hell you guys are truly brainwashed and fucked. I am so happy I grew up in Europe.",
            "I got a reverse boner upon reading the hairy manly glory part",
            "What’s the difference between 15 and 16? I thought the rules were the same for anyone under 18",
            "I would have worn the white shirt and had your parents sue for sexually exploiting you. Easy justified money.",
            "I can’t help wonder why they wanted the old shirts back? Did they wash them and give them out to new employees?",
            "You actually do have to mark 14-15 year (sub minors)olds somehow.",
            "You know you work for a shitty place when they make you turn in your work shirt when you are done.",
            "I mean ... you can wear a white undershirt, no? Simple solution, really. I've had to wear a white uniform shirt to work before, and always wore a tank underneath. It was really no big deal.\n\nNot following company policy is a big deal.",
            "🎵 I smoked two joints, \n\n🎶 Before I smoked two joints, \n\n🎵 And then I smoked two more 🎶",
            "This is not a thing that happens with any national chain.",
            "Also loved how working there you had to launder your own shirts.  Wonder if they still do that???",
            "you should have waited 16. rules are rules",
            "Yeah but what is a heavy set",
            "Where the hell did they get the white shirt? The toilet roll holder?",
            "Dress shirts are see through get over it, you're the tool.... Honestly worked at a few places this was dress code and always had undershirt. Didn't complain cuz I wasn't to stupid to put one on or even think you can only wear that js that's on you not the company",
            "Wearing a white tank top was too much to ask. MC was the easier answer. Idiot teen.",
            "> and the shirt was practically see thru\n\nSo not see thru??",
            "[removed]",
            "Unfortunately most places have changed their uniform policies since then. I waited tables a Cracker Barrel about 10 years ago and we are specifically told that any shirt we wear under our uniforms have to be plain white. And yes, I did see people get sent home to change if they wore a colored shirt that was visible through their uniform.",
            "Kevin?",
            "[removed]",
            "I would have turned in my mostly white briefs (underbritches) and said I misread the sign.  The clown would laugh.",
            "Haha, I had that shirt!",
            "It's every man's right to have a name",
            "Passive assertion. I love it.",
            ">IMPOSSIBLE unless I want to live on bamboo?",
            "Boss: So you want a paper receipt.",
            "Okay, I need to see that tourist shirt",
            "What's so vulgar about the worm tequila?",
            "I used to work for a major supermarket chain at the turn of the century. We had to wear white shirts, black pants, and a company tie. At one store I worked at, the shirts were the same, almost see-through, so much so that one particular girl you could always tell what colour bra she was wearing. When someone finally made it aware to her that you could see what colour her bra was, someone suddenly provided her with some new thicker white shirts.",
            "My friend had that shirt in high school! The dean took one look at him, chuckled, and then made him wear it inside-out for the rest of the day.",
            "OP!  \nDo you still have that touristy t-shirt?  \nI'd love to see a pic of it!!!  \n\"...*floor*...\"",
            "This must be the same place where viva la dirt league on YouTube gets his shirt hierarchy from."
        ]
    },
    {
        "post_id": "11pnjes",
        "author": "plogan56",
        "title": "Comply with Bridezilla or leave, ok?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11pnjes/comply_with_bridezilla_or_leave_ok/",
        "score": 18364,
        "num_comments": 796,
        "created_utc": 1678649706.0,
        "selftext": "My friend(Jemma) tells me about how she and an entire group of Bridesmaids left a wedding after their friend dared them to.\n\nSo this all happened  a few weeks ago, a long time friend of jemma's group was getting married in another state but the day of the wedding she suddenly had a problem with one girl who wore glasses, which she didn't have an issue with beforehand; the glasses girl told her she wouldn't wear them during the vows and pictures but the bridezilla didn't want her wearing them at all and was screaming at her to not put them on for the rest of the day, obviously she couldn't do that since she needs to see.\n\nThe argument got more heated until bridezilla gave her the ultimatum to take them off & keep em off or leave. This is when jemma and the other bridesmaids stepped in, told bridezilla she was out of line, and that they would all leave if she forced the girl with glasses to leave; Bridezilla called their bluff and, being maids of honor, the bridesmaids left the wedding and decided to celebrate and eat at a restaurant before they head back home. Bridezilla called them several times after they left, telling them that she didn't care about the glasses anymore and begged them to come back to the venue, but they not only refused but also chose to end the friendship, with her, all together. Jemma said that the wedding proceeded as follows, just minus the bridesmaids and a few awkward stares because everyone heard the bridezilla's screaming from earlier.\n\nJemma told me that the bridezilla has always been like this, throwing a tantrum when she doesn't get her way, and that the meltdown at the wedding was just the last straw for them. Personally, i think she's got a monk's patience if she put up with her for that long.",
        "permalink": "/r/MaliciousCompliance/comments/11pnjes/comply_with_bridezilla_or_leave_ok/",
        "comments": [
            "I'm picturing a half dozen women in butt-ugly bridesmaid dresses sitting around a table at an Applebee's getting drunk and laughing their asses off at Bridezilla.\n\nHeartwarming.  lol   And well-deserved.",
            "RIP to the bloke marrying her.",
            "My sister had a massive meltdown less than a week before her wedding. She had also been an absolute monster the year prior to it, abusing people of their choices of clothing, hair, and even randomly becoming racist to a couple members of our family. It was a wild situation. So that day she lost her shit I called it, told her my husband and I weren't going, our brother and other sister also did the same thing. The only people who showed up were our parents and her now husband's parents. \n\nThe bridesmaids, groomsmen, and all guests didn't show up. But, in shock to everyone involved, she actually figured her self out. She's always been rude and bossy, so about a month after her wedding she contacted everyone that would have gone and profusely apologized. At first I didn't give it a thought, she's apologized before in the past but didn't change. Ironically this time it actually set her straight. Sometimes people need to be severely humbled and they realize they actually are the problem. We're very close now and she's fun at family gatherings. We had a great reception type party for her and everything is much better. I can't imagine being like that to the people who are at my wedding.",
            "When I wore glasses before my lasik I couldn’t see anything beyond maybe 3 inches. I couldn’t read, see a clock etc. I wore them EVERY WAKING HOUR. I got throw aways for my own wedding but it was miserable (bad astigmatism makes regular contacts really uncomfortable)\n\nThis is beyond bridezilla, I can’t even imagine. \n\nWonderful MC story!",
            "There's the idea in disability circles that one's devices (wheelchair, walker, cane) should be respected as part of someone's body. I kind of feel the same about my glasses.",
            "It seems that weddings for some women are not celebrations of the start of a life with someone they love, but a venue to just act ugly and often get away with it.  It is nice to hear when that backfires.",
            "Sometimes it takes a ridiculous event for people to see the writing on the wall.\n\nFrom the story I can only imagine the brides track record where ALL the bridesmaids has a belly full of her bullshit.",
            "As a glasses wearer with really, really bad eye sight, I guarantee forcing me to go glassesless would end in some sort of absolutely horrifying event. Either tripping up the aisle or walking into a grandma or smashing into the wedding cake, I would 100% do something ridiculously clumsy. Not a threat, I’m like a -9 in both eyes.",
            "Best girl-squad ever! I hope they gave bridesmaids' dresses a traditional Viking funeral.",
            "I’m always curious with cases like this, and sorry to make it gendered but it really, really is… why do so many women have friends like this, and continue these friendships to a point that they agree to be someone’s bridesmaid? I just don’t get it. How does someone let it get that far? And I can safely assume this wasn’t the bride having some kind of psychotic break and acting out of character, because then they all wouldn’t be so happy to just end the friendship just like that. I just don’t get it.",
            "For those who are wondering what the big deal is and why Glasses Girl couldn't just leave them off for the day: https://youtu.be/AaYIV59rmDI\n\nAs a severely myopic person who was unable to wear contacts, I would have flatly refused. More than 15 minutes of going without would have given me a migraine. (No longer applies. Intra-ocular lenses are great inventions!) Does Bridezilla expect Grandma to do without her cane, Uncle Fred to leave his wheelchair and stand?",
            "One thing I've seen, especially in r/antiwork and r/MaliciousCompliance is that if a situation presents the opportunity to call someone's bluff, they're usually not bluffing.",
            "My ex-girlfriend was a bridezilla. Cheated on me, lied about it, invited me to her wedding, and was genuinely upset I didn't show up and basically treated our mutual friends (who attended the wedding) like shit, being passive aggressive with them during the wedding, threw tantrums and blamed others for stuff she misplaced, got them to look for the missing things only to be told much later, and after a fair bit of effort, that those things had already been found much earlier but she didn't tell anyone.\n\nThey all stopped hanging out with her after the wedding, and I dodged one hell of a bullet...",
            "Delicious.",
            "Goddamn that is rough! I mean, it sounds like she deserved it, but imagine losing all your friends on a day where you life is already changing forever. Imagine the fiance, being like.. the fuck am I getting into?",
            "I remember reading a woman's experience of being a bridesmaid with the bride who was entitled, rude and a bridezilla like this. One of the things she said was during the lead up to the wedding, all of her bridesmaid group just kind of gave in on all of the demands. Because they thought she was so stressed out, because they were friends, because they were going to be the Bridesmaids and they felt that was their role. But once the wedding happened they all reverted back to just being a group of equals. But the bride didn't. The bride kept acting like she deserved all of the attention, that she should get everything she wanted her way, that she got to make all the decisions and everyone should just agree with her choices. And the bride just could not understand that that was not going to be the case. After I read that I have always wondered about the time after the wedding when you read about these kinds of stories.",
            "Wonder how could somebody marry a girl like this. Seems that a lot of 🚩 were ignored.",
            "Screamy, entitled people getting justice! Love this.",
            "Maids of **HONOR**",
            "As someone with severe myopia and astigmatism who can’t wear contacts you don’t want me walking (more like stumbling)around without my glasses on. I will hurt myself and others and will land myself in the ER. My glasses are a legit medical device that I need to function. If my options are not wear my very necessary glasses or leave. I’m Leavin.",
            "Thats like telling someone they cant use their wheelchair…folks dont get how debilitating it can be without glasses for glasses wearers. Id have to be guided around without mine and how hot is that???",
            "[deleted]",
            "I can't even fathom why glasses are so offensive. Sounds like an entitled bitch who got what at deserved.\n\nI guarantee she won't even own up to it, she'll make a narrative where all the brides maids were selfish monsters",
            "I just wish that they could have walked out while the guests were arriving for the ceremony.",
            "When a bride puts this much weight on another person’s appearance at a big party, imagine how she will be as a partner. This marriage won’t last.",
            "This is awesome! I was once in a wedding with a bridezilla. I swear she purposely chose the ugliest bridesmaids dresses she could find. Then to make it worse, she didn't like that they were v-neck and showed a little (I mean....very very little) cleavage. She said it would distract from HER. So she made us stand there on the day of the wedding and have lace panels sewn in to the entire V. \n\nAnyway, she was so awful on her wedding day that I never spoke with her again - and we'd been good friends since the 6th grade.",
            ">Jemma told me that the bridezilla has always been like this, throwing a tantrum when she doesn't get her way, and that the meltdown at the wedding was just the last straw for them.\n\nYeah, if you lose that many friends in unison, then it's usually because that person has a lengthy history of being a turd.",
            "I broke a pair of glasses and I was basically agoraphobic until I got my replacement a couple days later. I can’t imagine going through a wedding mostly blind. How you can tell people to take away their vision for *your* vanity is beyond me.",
            "upvoted for \"maids of their word\"",
            "New Husband: I just married the ultimate red flag.  What have I done???",
            "As a one-time wedding photographer who dealt with many Bridezillas, this story made my day. Thank you for posting! I just hope someone recorded this wonderful occasion for posterity.",
            "……. And I laughed and laughed and laughed 😂😂😂😂😂🤣🤣🤣🤣😂🤣😂🤣😂",
            "Remember if someone is making a comment like this about glasses just replace it with a wheelchair and see how it sounds.",
            "this is the epitome of fuck around and find out.",
            "What could that argument even sound like?  \"Don't wear your glasses!\"  \"I literally can't see without them...\"  ...???...",
            "My malicious compliance would’ve been to stumble blindly into the cake and fall on it, roll around then fall on the bride with a big glass of red wine. And be like, “I don’t know why all these tablecloths keep getting snagged on my hand and getting pulled off the loaded tables!”",
            "A significant chumk of my wife's business is altering wedding & bridesmaid dresses.\n\nUntil she started doing this, I thought 'Bridezilla' was just some jokey trope - not a real thing.\n\nHow wrong I was",
            "Congrats to that bride for finding the most unusual way to be ableist I've heard of yet! \n\nI wear glasses with a strong prescription & I I've developed a severe intolerance to contact lenses, so technically I have a disability, it's just an easy one to correct. People like me are helpless without glasses or another vision aid & get severe optical headaches, we wouldn't have survived in the past.",
            "> being maids of their word\n\nYou missed the obvious pun **being maids of honor**",
            ">Jemma told me that the bridezilla has always been like this, throwing a tantrum when she doesn't get her way, and that the meltdown at the wedding was just the last straw for them. Personally, i think she's got a monk's patience if she put up with her for that long.\n\nYeah, but what delicious timing to say \"fuck this, I'm out.\"",
            "I'd have left also.",
            "I adore this story. Sounds like bride got her just deserts. Play stupid games, win stupid prizes. Now what's supposed to be one of the happiest days of her life is also the day she lost all her friends at once.",
            "Is it me, or are there more bridezillas in the wild than there used to be?",
            "I love the solidarity among the bridesmaids.",
            "That doesn’t sound like a bridezilla, that sounds like a straight up bitch",
            "\"because they were maids of their word\" respect",
            ">Jemma told me that the bridezilla has always been like this, throwing a tantrum when she doesn't get her way, and that the meltdown at the wedding was just the last straw for them.\n\nI never understand why people have friends that they think this of... Why would there be a last straw and not a first (and only) straw when it comes to an adult who's known for throwing tantrums?",
            "I really would have loved to see the look of a deer in the headlights, when the bridezilla realized she fucked around and damn, did she really find out.",
            "I can’t even imagine how it gets into your head to tell someone not to wear their glasses. That’s insane.",
            "Imagining the guy getting into this commitment watching this as a clear sign of things to come.",
            "That was the grooms one last chance to avoid that nightmare. Poor guy.",
            "I never understood why it is considered normal to act trashy and mean to your friends because you are getting married. These ladies should have left this f(r)iendship long ago - good for them standing up to their friend when she got practically bullied.",
            "She got what she deserved. I have to wear my glasses every waking moment and if not I’ll be holding something inches from my face just to read. To demand someone not wear their seeing device at all is too much",
            "They should have stopped at CVS and bought cheater glasses for the rest of them, then do some great photo shoots at Applebees. Large photo dump on socials to follow",
            "This story is almost too good to me true. Man, I hope it's true. People like this should catch their comeuppance more often. Society as a whole would be much better off.",
            "The entitlement! Imagine telling someone they're not allowed to see for the entirety of a wedding. I get tired after half an hour without glasses, it's so exhausting trying to make sense of a world where everything is blurry, and you have to squint to see anything at all.",
            "I am legally blind without my glasses. I would have refused outright.",
            "Imagine the poor guy that is now married to that",
            "Good job, bridesmaids! \n\n I hope the husband sees all the red flags and leaves!",
            "My blind ass is over here having a fantasy about taking off my glasses and accidentally marching straight into the table with the wedding cake on it before making a grand exit.",
            "It's the avengers post-credit scene where they're all sitting around the table eating but with fancy dresses and hair",
            "A wise person learns to tame tantrums during childhood/adolescence and doesn’t bring that childish behavior into adulthood. For those who don’t,\nTHIS IS THE WAY.",
            "Wish I could buy those girls a round to celebrate",
            "Boom.\nShe deserved it.\nNow, for eternity, she was the bride with NO bridesmaid. For what? A maid with glasses?\nIt's 2023, if you're the kind of petty f**K who demands someone looks a certain way, you deserve it",
            "Good friend chick flick I wanna see",
            "I love this story.",
            "I hope i never get invited to another wedding.",
            "[deleted]",
            ">Bridezilla **tried calling** their bluff\n\nStill a perfect ending, thanks",
            "Maybe if someone had called her out on her BS \\*years\\* ago, she wouldn't have had to suffer down that road. Good on OP for standing her ground in solidarity!",
            "Picturing the end credits of \"The Avengers \" with all of them getting shawarma, but all bridesmaids.",
            "i wonder if she learned her lesson from this? It had to be quite a shock to her. Such an entitled brat.",
            "Play silly games, win silly prizes.. \n\nThe world is becoming less tolerant of grown adults having tantrums.",
            "For pity's sake, I've been a bridesmaid at a wedding and I'm completely blind (yes seriously).",
            "One of the worst things you can do to a friend is make them part of your wedding party.",
            "Thought I was on r/WeddingShaming for a moment lolol this would fit great there",
            "Prayers for the husband. He’s going to need them.",
            "r/bridezillas",
            "\"Bridezilla called their bluff \"\n\nIf they went through with it, then it was not a bluff.",
            "Why do you care if someone is wearing glasses?  I mean really?",
            "This is a thing of beauty to behold.",
            "Belongs in r/weddingshaming",
            "Well if all the Bridesmaids left who were the groomsmen supposed to sleep with ? That was pretty inconsiderate of them./ s",
            "Love this for the bridezilla.",
            "I’m giving these women a standing ovation. How tired of the Brides crap do you think they were to make her wedding the last straw?",
            "I was about to say, it seems a little harsh to do that at a wedding over someone freaking out during on of the most stressful and important days of their lives, but then that last paragraph clarified. To be honest, that day of \"fuck you, I quit\" should have come a lot sooner. Just think, now every single photo from that wedding is going to be a reminder of the day she lost not only her entire bridesmaid party, but that many friends as well.",
            "Every day I hear more stories about why weddings and marriage is just a horrible idea and no one needs it.",
            "That's not calling a bluff, because there was no bluffing involved.",
            "“Sure, I’ll take my glasses off for the day, then I will have to spend the day stumbling around since I won’t be able to see.”",
            "This must be one of those mysterious \"adults\" who make it to adulthood with this behaviour. I guess this was finally the world smacking them down a peg.",
            "Brilliant! The bridesmaids must have been a sight to behold. I hope they went to a dive bar, like a biker bar.🤣",
            "❤️❤️❤️💖💖💖\nGreat Story!  More bridesmaids should stand up like this to bullying brides.",
            "I'm betting this marriage doesn't last a year.",
            "If they made that into a movie, I’d go see it.",
            "Who marries these bad brides?",
            "Netflix script incoming.",
            "Well you could hardly be a pessimist when you're with someone like that.",
            "Kind of ironic considering tantrums are \"me, myself and I\" driven and then she gets ditched for it in the context of one of the best \"me, myself and I\" celebrations in human culture.",
            "Well she was worried about the pictures looking bad and now I can't imagine how bad they looked with X amount of Groomsmen and ZERO bridesmaids all because she wanted someone who NEEDS their glasses to not wear them.\n\nThe photos look worse and now you look like a total B because I'm a firm believer that when stuff like this happens either the entire group is malicious and did this on purpose or the one person who was 'targeted' finally pushed things too far and in this case it was the latter.",
            "I thoroughly enjoy reading & seeing bullies get their assed handed to them!!",
            "Wow! A story of actual growth! That’s quite rare!",
            "What the ableist fuck?",
            "“Bridezilla 2 the ultimatum” coming soon to a theatre near you!",
            "How did the wedding even happen after that? Don't you need the maid of honor as a witness?",
            "Woooow. Yeah, no...that wouldnt fly with me either. I literally need my glasses to function at all. Without them, I am basically blind. If anyone tried this with me, I would counter with \"are you going to be my eyes then? because I can't see anything clearly at all without them...think of Velma when she loses her glasses, thats me for sure\"",
            "How can you call a bluff that isn't a bluff? I don't quite understand.",
            "Those gals had spines of stainless steel!  Good for them!",
            "This is medium length",
            "*a NUN'S patience.",
            "> Jemma told me that the bridezilla has always been like this\n\nWell, yeah. If this story is even remotely true, that would have to be the case. It would take a lot to get an entire troupe of bridesmaids to abandon their friend on her wedding day. The most reasonable explanation is that the bride was already on thin ice.",
            "I wish these stories actually happened.",
            "And this is the kind of woman that men continue to marry.  Makes no fucking sense.",
            "I dont see how people put up with “friends” like that for all those years. Sounds like your friend and the other bridesmaids waited for the perfect moment to knock her down.",
            "Good story. \n\nA few little things:\nShe didn’t call their bluff - they weren’t bluffing. She called them on it, because she thought they were bluffing. \n\nWhen you write “ .. proceeded as follows”, your usually expected to follow that with how the wedding proceeded. “Proceeded as planned” would’ve been appropriate here. \n\nI hope that helps :)",
            "Thanks for alluding that last sentence about her always being like that. At first I was willing to  give her the benefit of doubt because she might have just been going through a highly stressful event and just couldn't take stress well. But instead she just sounds like a demanding whiner."
        ]
    },
    {
        "post_id": "huk4bz",
        "author": "BikerJedi",
        "title": "\"If your pay raise isn't enough, quit.\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/huk4bz/if_your_pay_raise_isnt_enough_quit/",
        "score": 18366,
        "num_comments": 555,
        "created_utc": 1595246967.0,
        "selftext": "EDIT: This took place in 1992-1993.\n\nI got a job as a security guard after leaving the Army. The company refused to pay very much so they had high turnover. Because of the turnover, they had very small raises built in at 90 days, six months and a year as an incentive to stay on.\n\nMy one year anniversary rolls around and I don't see my 50 cents an hour raise in my paycheck, but something more like 35 cents. So I called the boss.\n\nSupposedly they wanted to give all employees a raise, so they did. Furthermore, I wasn't going to get ~~a raise for one year~~ my one year raise because, \"You just got a raise. No one gets two raises at once. If your pay raise isn't enough, quit.\"\n\nI spent the next week calling in sick and showing up late while job hunting. Called my last day, at the end of my shift, and told them I was done and they could find someone else, giving them no notice at all. Panic mode ensued. Everyone else was at 40 hours for the week and they hated paying overtime. One of the salaried managers had to cover for me. \n\nI'm a teacher now, near retirement. My raises are still shit.\n\nANOTHER EDIT: The MC is the fact I quit since they told me to, and did it in such a way that they were screwed for covering the position. The fact a salaried manager had to cover my shift for a couple days was the icing. \n\nEDIT: There was a lot left out. I left that shitty job to become a computer network engineer after college. Did that for a bit under ten years. The 2001 tech bubble burst put a lot of us out of work. I started teaching to put food on the table. After that I felt a calling and decided to stick with it. I'm now just a few years from retirement.",
        "permalink": "/r/MaliciousCompliance/comments/huk4bz/if_your_pay_raise_isnt_enough_quit/",
        "comments": [
            "They lost an employee for $0.15 more cents an hour? So stupid.",
            "[deleted]",
            "When I worked retail, I started at 25 cents above minimum wage, which was $8.75 at the time, because the manager was a friend of a friend and knew I was a good worker.\n\nA year later I get promoted to supervisor, which came with a 50 cent raise. Except I didn't get that, I only got 45 cents.  I asked and apparently the regional manager (my boss's boss) saw that I started above minimum wage so he docked my raise **5 fucking cents** to \"be fair\"\n\nIt was some petty fucking bullshit.",
            "My personal experience is that you have to job hop anymore to get a pay raise, unless you are unionized. Sad times anymore, where it doesn't pay to be loyal to a company anymore.",
            "Employer: if you don't like it, quit.\n\nEmployee: ok i quit.\n\nEmployer: ShockedPikachu.jpg",
            "I’ve wanted to vent this out for a while now, but always thought it would sound pompous. I worked for an aerospace company for a few years that kept promising raises but never delivered...there was always an excuse from “well we are slow right now” to “you have a review coming and we’ll evaluate your pay then”. I decided to take another job and gave notice. They asked what the salary was for the new job and actually told me “we don’t think you’re worth that”. They had me “train” another employee to do my job for a total of 25 hours for the last week I was there. I’ve since heard from a friend still there that they had to have two other people to do what I did there and are having to use outside companies (including the one I now work for) to complete some of the projects they have bid. I have to admit it gives me a warm fuzzy feeling to know that it costs them almost 3 times the amount it did to get the same work accomplished, and an even fuzzier feeling when I got to work on projects I used to, but now for almost twice the pay. They could have kept me for a fair raise but chose to pay around 3 full salaries to let me go. Know what you’re worth everyone, and never let anyone tell you you’re not “worth that much”.",
            "u/bikerjedi on another sub?!\n\nLove your stories!",
            "That last sentence hurts my soul.",
            "Thank you for becoming a teacher.",
            "Seeing you out of r/MilitaryStories is like seeing your teacher at the supermarket.",
            "“The company refused to pay very much so they had high turnover”. \nGotta love companies’ inability to understand this correlation",
            "I started working as a janitor when I was 14 worked overnights cleaned buildings others didn't show up to clean, waxed floors etc all while going to school.\n\nWhen I got my drivers license I got alarm cards for all the major alarm companies in the city, the mangers at the company all ended up with DWI's in the same month so I had to drive them around so they could check their buildings as with the DWI's they also had their alarm cards taken away.\n\nOk so now I am 18 years old only two other people that have been working there have more seniority than me, so I ask for a raise and I am told that I am part-time temporary and they don't give temporary employees a raise.\n\nSo I quit walked out got another job making more money and they were calling me for over a month trying to get me to come in and clean buildings.",
            "Remember boys and girls, you don't 'owe' your employer a two weeks notice. That is a courtesy, a gift you can offer employers that you like.",
            "Coworker went from $15 to $17 after one year with out getting any additional certs.\nI went from $15 to $16.50 after getting two certs.  Asked why I got paid less, got told I was getting more than I deserved.  Went out and got a job at $20 a month later.",
            "This often happens to professors.  They are given a starting salary, teach for ten years and see brand new assistant profs. Starting well over what they are making.  I believe it is called IMPACTION.",
            "I did something similar at my previous job. I kept pushing them on compensation to bring it up equal to our sectors average for my role, but they just weren't willing to do it because the boss sucked and only looked out for himself. These conversations began about 1 year prior to my quitting and proceeded to go on for about 6 months.\n\n6 months before I \"quit\", I just stopped trying at all. No more weekend work, no more after hours work (I always just had an excuse, which were transparently unimportant/not true, but what can they do about it?). I would take long lunches every few days (like 1.5 hour, sit down lunches). I would do just the bare minimum quality of work so that I could not be fired for performance reasons. I took way more than the amount of vacation that I was supposed to, because I lived in a state that did not mandate paying out unused PTO.\n\nThe way the team was structured was that I reported to the SVP, but there were a couple Senior Directors that I worked with that I did not report to. I made very clear to them what I was doing, so that they would note feel like I was trying to fuck them over. To my surprise, both of them understood and accepted my rationale (\"if he won't pay me more, I will rationalize the workload for myself\").\n\nThe reason I wrote \"quit\" is because ultimately I got exactly what I wanted - for them to lay me off. 6 months severance, my full bonus paid out, and all of my stock vested. This was all just 1 month before I had planned to actually quit, anyways. I took a couple months off to just enjoy life for a bit then got a better job at a better company.",
            "Similarly, at my last job I was receiving a retention bonus of about 10% of my pay. They decided to take it away because they were arbitrarily eliminating them. Merit raises were also not a thing (just raises for how long you had been on the job, and I had maxed out on those). Despite being one of the top performers with years of “exceeds performance standards” they were suddenly and without reason cutting my pay. \n\nFound another job and left within 2 weeks. A retention bonus is to retain good employees. They were shocked I was leaving. (It was a horrible place to work, the money was the only reason I had stayed.). So satisfying to quit!",
            "A while back I was working fast food.  I'd been there for about a year, and let's say i was making $6 while minimum wage was $5 (because I sure as hell don't remember the exact amounts).\n\nMinimum wage went up to $6.25 around the same time we would get our raises, and raises were a quarter.  Guess who was now making minimum wage after a year on the job?  When I asked my boss, she told me that *that* was my raise, and wouldn't hear a word of why it was asinine to be making minimum wage after my time there.\n\nSo I quit and got hired at another restaurant - same chain, different franchise - at $7.25.\n\nFuck that.",
            "Security is the absolute worst for being compensated properly.",
            "Network engineers are paid very well. But it's good to see people who have a calling, follow that calling. I've had teachers tell me a lot of other teachers shouldn't be there.",
            "Awesome to hear you transitioned from tech to teaching. I really want to try that route, but two things are holding me back. \n\n1) $$\n2) I think I would hurt a student within the first couple weeks due to seeing current behavior, rudeness, and disrespect in schools.",
            "Bikerjedi in the wild?!?\n\nSeriously though, nice. Civies really underestimate military's commitment to statements like, \"If you don't like it, quit.\"",
            "I’ve been fantasizing about quitting because my boss is a controlling ass who won’t provide employees the ability to work from home DURING A FUCKING PANDEMIC.",
            "Oh it’s you. I love your writings in /r/militarystories.",
            "Oh shit, /u/bikerjedi telling a story that isn't on one of the military story subs?",
            "Assistant Manager: Shit, Kurts up for his 1 year raise we sold him on. Wtf are we gonna do. \n\nManager: I know, give everyone a smaller raise including him so we don’t have to give out that whole 50¢\n\nBoth managers: GENIUS!",
            "30 years ago I worked at a photo lab. That used to do finishing for several camera stores in town.\nSince one was on my way home I was asked to carry the day's work to the store and pick up tomorrow's load everyday. My compensation was a half hours pay. Sounds fair it's a half hour pay for a 5 minute stop.\nWell I had a couple of raises and I noticed I'm still getting 1/2 hour at my old rate for doing this.\nNow it might not seem like a big deal but I'm woefully underpaid and skirting the poverty line also it pisses me off to be lied too.\nSo I mention it to the bosses wife who was also a boss. Instead of saying I'm sorry that's what the job pays or something like that\nShe snapped out \" if you don't like it don't take it \" .\nSo I dropped the case on her desk and left without a word.\nI got great satisfaction in seeing them drive to that store every day ( 45 minutes out of their way) all for the sake of 50 cents a day.",
            "I had just gotten into IT when the bubble burst, and didn't have enough of a provable skillset to pick anything up since my work was exclusively at mom-and-pop shops that all went under, so my work history couldn't be verified.  I ended up taking jobs doing data entry until the industry started to recover and I picked up a job repairing computers for a major retailer, and climbed the latter while jumping between companies all the way up to six figures.",
            "Military (military flavored anyway...) MC is the best kinda MC. \n\nSome guy on another sub always says that. \n\nKinda threw me off to not see the green shield next to your name.\n\nEdit: it's funny seeing all the regular posters from r/MilitaryStories in this thread. Is this brigading?",
            "1$ an hour raise is an extra $2k a year if you work exactly 40hrs a week all year long with just 2 weeks off. No sick days no holidays nothing. Then subtract taxes and deductions. So you’re definitely getting less than 2k.  \n  \nAnd 2k is not life changing its barely covering inflation, rising cost of gas, food, rent, utilities. Businesses that give raises less than a dollar at a time are a fucking joke. Before I went union I only asked for raises in terms of several dollars an hr at a time. You state your case, your value make your demand and you have an exit strategy. This isn’t for OP, I know he’s almost retired. This is for you the reader. Know your worth",
            "I was like \"nearing retirement\" but 1992 wasn't.....\n\nwait....my God, I'm so old....",
            "That is literally as bad as the raises at McDonalds.",
            "50 cent raise\n\"Break out the red panties, baby\" *In Irish accent*",
            "I have yet to see one security company that wasn't a streaming pile of garbage due to poor management and shit pay",
            "I did the same thing out of the Army (1995)and had almost the same experience. I should have known that when they accepted me with a year's worth of beard and hair growth that it was a bad idea. I'd been there for a while and decided I needed more time for school, so gave them notice. The supervisor asks if I'll stay for a 50¢ raise now and another 50¢ raise in 5 months. Why not? That will put me 55¢ over minimum wage! And then I realized that 50¢raise was because minimum wage just got bumped up by 50¢. And that future raise? Nobody remembered it and they just gave me a Nickel. Screw Murray Guard.",
            "If a company has high turnover, it's usually because they don't treat their employees well",
            "you know this was the inverse for me.\n\nin late 90s i worked as onprem IT and walking a new teacher through my IT onboarding process.\n\nafter that 1st day, he immediately quit teaching and went back to school as IT lolz",
            "i did the same thing at McDonald's, they told me I'd get a raise, didn't give it to me for two months, then added more responsibilities after my raise, which according to my job structure meant i was entitled to another raise. they told me i couldn't get two raises in a month, i argued that this raise was supposed to be months ago, don't win and just quit",
            "It won't buy you a cup of coffee but thank you for teaching. It's not an easy job and as you know, the pay can be crap. I'm sure your students appreciated you, though.",
            "> My raises are still shit.\n\noof but also laughed",
            "I quit a job I loved in 91 because after being there a year, they gave me a NICKLE raise. I was entirely insulted. My best gf worked there to, they did the same to her and she left with me. They were screwed.",
            "Most people don't realize that the \"two-weeks' notice\", unless a clause in your contract, is merely a consideration, and not legally-binding. If you're not interested in the reference, you can quit on the spot and fuck 'em.",
            "[deleted]",
            "> I'm now just a few years from retirement.\n\nHope you survive them.",
            "Good malicious compliance would be reporting them to DoL for failing to pay overtime for the managers who don't qualify as exempt.",
            "That's interesting about your career path. One of my wife's relatives (who's now retired) was some sort of electrical engineer who lost his job when his company folded in an economic crisis time (not sure what year). He found work teching math at a community college - thinking it would only be for a year. He ended up finding the teaching quite fulfilling and stayed on until he reached retirement age.",
            "You can ask for a raise at any job and if they don’t give it to you BY LAW you can declare “economic strike” and leave the job and they legally HAVE to hire you back at your same wage or higher when the position is available. You may even be able to continue receiving benefits and even wages if you have a union or “bargaining representative”. You can work elsewhere but not make more money than the position for which you are on economic strike.",
            "Thank you for your service\n\nEDIT- why am i being downvoted for thanking a vet for his service?",
            "You didn't require a teaching degree?",
            "I have a feeling I know what security firm it was. That kind of bullshit is common at the shittier outfits.",
            "[deleted]",
            "I've been this twice and only had 3 different jobs.\n\nFirst was Sonic Drive in has a carhop, stayed 1.5 years and ending at $4.55/hr, offered a \"manger\" but it was only $9/HR with 20x the workload and noped out of there.\n\nSecond was Gas station worker for 2.5 years, ended at 7.55/HR and ended when I moved to Indiana from Mississippi.\n\nThird was a Kroger and making $13/HR because of my work experience, had to leave after 8 months cause of pregnancy.",
            ">\"You just got a raise. No one gets two raises at once. If your pay raise isn't enough, quit.\"\n\n>I spent the next week calling in sick and showing up late while job hunting. Called my last day, at the end of my shift, and told them I was done and they could find someone else, giving them no notice at all. Panic mode ensued. \n\nImagine an employee calling out sick for a week after telling them they should quit and still being surprised that they're quitting.",
            "I worked at a company that gave a five cents an hour raise about once a year.  1980, manufacturing, US.  I went to college after that.",
            "Are you sure you didn't get the full 50 as promised and lost the 15ish cents to taxes/witholding?  30% marginal seems like too much for taxes on a job that measures pay in cents, but maybe?",
            "I had this once, was working in a factory. 90 day raise was a dollar, six month raise was a dollar... One year came around and they gave me a quarter. I think I stayed a month after that.",
            "Sounds like a shitty company. They could’ve given everyone a 30 cent raise and still kept their promise to you for your 50 cent first year increase.",
            "[deleted]",
            "And  this explains the quality of hired security. the only ones who put up with this crap can't find another job. Anybody who can will bail out as soon as they get shafted.",
            "> Everyone else was at 40 hours for the week and they hated paying overtime.\n\nNon U.S. dude here. What's the big deal with paying overtime? It always sounds like the whole universe is collapsing...",
            "Apparently you and I lived through the same experience. I work a security job and right before I was due for a sizable raise they raised everybody up for part of that amount and told me that's what I was getting. This was in 2017. New day, same bullshit. I left shortly after that.\n\nSecurity work is notoriously crap like that. They all want to pay you minimum wage or as close to it as they can manage.",
            ">I'm now just a few years from retirement.\n\nOh shit, he ded.",
            "I had similar happen. I was working a job part time with built in raises as well. A couple weeks before raise time I was moved to full time. I was pretty stoked on the timing. Time passes and I get my next paystub, no raise. I think maybe it just hadn't hit yet so I wait. Next check comes and no raise. Wtf? So I talk to my supervisor and she says \"well going to full time is kind of like getting a raise.\" The job was cleaning a large  store, I was the only janitor for the entire place. Full time meant now cleaning two stores. So I got to clean both stores, twice the work, for the same pay. The promised raise was supposed to be $.50, a big deal when you're only making $8/hour.",
            "I didn’t realize my old security company was open back then. They pulled the same shit on me.",
            "My first job was with a security company. I was hired through a staffing agency. I worked as a radioman and security guard for a music festival. They were understaffed and worked us without questioning how much they assigned us. They worked me over 60 hours. I entered my hours correctly for the SA. The SecCo. had the audacity to cross out the 40 hrs regular pay and 20+ hrs overtime and writing 60 regular hrs. When I handed the timesheet to the staffing company, the lady looked at it and entered the correct numbers I had entered from the beginning. I was paid correctly in full for my time worked. I was in the company Facebook group. Shortly after the event, I started seeing posts about people saying they haven’t received a check yet. This went on for about two or so weeks. Eventually, it came out that the company manager had fled the state and disappeared without any contact with anyone. To this day, I still don’t know if everyone were paid. This is one of those rare occasions where working through the staffing agency was better for me than working directly through a company. \n\nTLDR: Security company sucked and didn’t pay their direct employees. Was paid in full because I went through a staffing agency.",
            "I’ve done this, minimal raise, no where near what was required to keep me and another huge project coming at me fast and after a meeting I requested to discuss/fix it. I sorted out an exit fast which led to doubling my pay after a year off studying, and promptly quit. Bosses face when he asked ‘what you going to we might be able to match it? with ‘full time unemployed student’ was priceless. I can still picture his shocked mug.",
            "reminds me of my last job.  the company announced an increase in base pay company wide, that was higher than what i was getting paid (i had recently left the 3 month probationary period).  i'd been there for about 4 months or so, when i was called in and informed i was getting a raise.  i noticed that they folded my $0.22 cent raise for being there for 6 months into that raise, but since i wasn't really in a position to find a new job at the time, i didn't really raise a stink about it, but i did remember it.  \n\nwhich caused a fuss with certain managers who already had a grudge against me when about 10 months later, my immediate supervisor, Vinnie, transferred somewhere else for a lower position, but higher pay.  and i stopped being willing to stay 1-3 hours late to help finish up.  which i did both because a lot of times Vinnie was my ride home (and his shift started an hour before mine and ended an hour after) or he asked me to.  given that i was already going to be there anyway in most cases, so i might as well get paid for it, and that Vinnie was my friend, who often asked me to help out, i didn't have a problem staying late to finish up.  \n\nwhich almost always had to be done due to our chronic fucking shortage of workers in our crew.  anyway, after Vinnie left, i stopped staying late, and that, combined with the new manager over us having a grudge against me for getting him in trouble when he first started about 4 months before that (and the manager over him being fired and not replaced while i still worked there, limiting the amount of oversight on him), he started harassing me and cutting my hours.  \n\nwhen i only had one four and a half hour shift in a three week period, i decided to tell the company to go fuck itself.  got a new job, in a completely different field, making slightly more money for less hours a week.",
            "Sounds like my old math teacher",
            "I think raises for most people at operational grades are shit these days. We have a fight every year just to get an inflation rate rise.",
            "🎼 I can’t quit!”",
            "I work at Walmart for a year and I got a raise of 15 cents it’s bs",
            "Unfortunately I’m of the opinion that quitting a job without notice hurts your former coworkers/peers more than it hurts the company. Especially in jobs like this where coverage (a warm body) is required basically all the time. A manager covered the first shift in this case, but then what? This is based on my experience.\nDo whatever you want, but be aware of the collateral damage you’re causing when you stick it to your bosses.",
            "Ah yes quit your job in the world!",
            "L l",
            "Wait you people are getting raises? Is this american?",
            "A job is still a job at the end of the day though. You’re going to be very disappointed year after year if you keep hoping that any job that you work at is going to constantly give you big raises each year.",
            "On desktop, go to old.reddit.com/all/ and put the subreddits into “filter subreddits.” This doesn’t work for viewing by popular",
            "If the raise isn't enough . First find another job . If you actually do, then quit",
            "Man I really wish I could become a teacher, I just can't get any funding so I can afford collage",
            "> I'm a teacher now, near retirement. My raises are still shit.\n\nI can't wait to just not exist anymore tbh",
            "[deleted]",
            "[removed]",
            "35 cents isn't a raise. It's an inflation adjustment.",
            "Good thing he said it isn't by design",
            "[deleted]",
            "Teaching is a noble and valuable calling. Good on you for literally making the world a better place. I'm sorry the pay is shit.",
            "I mean games don’t abuse your medicine.",
            "Lol",
            "The fact that you didn’t give them notice is sweet.  I don’t get people that give companies that treat them like shit 2 weeks notice.  Nah, drop that bombshell on them.  It’s not like they give you any notice before they fire you.",
            "Quitting a job with high turnover rate is not malicious compliance. It is what everybody does regularly.",
            "> 2001 tech bubble burst put a lot of us out of work?\n\nwait what?\n\nwouldn't that give you more work?",
            "Nothing more American than firing a worker asking for a dollar more to replace him for another minimum wage slave.",
            "I was the salaried supervisor at a security company who had to deal with this all the time. I know it felt good to 'stick it to the man' but the guy who had to cover your shift (in my experience) is not the guy who has any say over approving or denying a raise. I would push for my crew to get raises, the vacation days they wanted, extra shifts when times were hard to make sure the crew was happy. Giving a two week notice did not give any time for our terrible management and recruiting department to find a replacement so it still hurt the site (if thats what you wanted). It had the worst impact on the other workers or, in my case, the salaried guy who had to work extra for free at no fault of his own.\n\nPlease give notice when leaving a job. I can guarantee you most employers don't care about you anyway, and the guy you stick it to isn't someone who has control over your issue.\n\nIf your job sucks, leave (I left that job, mostly because of people who quit and weren't replaced), I encourage everyone to find a job at a company that takes care of them or at the least is something you enjoy.\n\nI'm glad OPs decision worked out well, just remember the guy that gets fu**ed may not have been able to help you in the first place.",
            "ITT: Teenagers who have never worked before giving horrible labor legal advice",
            "[deleted]",
            "And that now why you work at Walmart. Wouldnt be the first time Ive heard that. Ran into my kindergarten teacher at a check out line. It never seems to end well for teachers."
        ]
    }
]