[
    {
        "post_id": "xld3yf",
        "author": "Zavarakatranemi",
        "title": "You need to see my father in person? Zavara the Great Mystic of the Beyond shall grant your request.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/xld3yf/you_need_to_see_my_father_in_person_zavara_the/",
        "score": 18225,
        "num_comments": 724,
        "created_utc": 1663880247.0,
        "selftext": "My father died 20 years ago, and left me a tiny cabin house. He loved that place, built it himself and tended to it religiously. After he died, I couldn’t find it in my heart to visit, because every rock on the wall, every flower reminded me of him. My mother never cared for it even when my dad was alive, so within a few months I realized that it would be a while before either of us would be ready to spend time there again. As such, we called up the electricity, telephone, and water companies to shut off services to the cabin until further notice.\n\nWhile other companies complied without an issue, the water company decided this request could be made only by the person whose name was on the bill. Mind you, their fee (due to zoning and a well on our property) was less than €2/month. Repeatedly faxing the death certificates as well as next-of-kin transfer of the title got us nowhere. Dozens of calls per month, several emails, in-person applications, smoke signals, interpretive dances, telepathy etc. nothing made any difference. \n\nBoth me and my mother were entirely flabbergasted, so we asked around and found out that indeed the process is unsolvable and, albeit not technically legal, people stopped paying those fees and the water would get shut off anyway as a result. Getting any lawyers involved would not be worth the money, so we did just that, discontinued the connected bank account, and never gave it another thought.\n\n2 weeks ago while at my family house, I got a call from the water company. They were closing inactive accounts at the 20 year mark, and my father’s cabin was up. They did however tell me that 1) there was a pending sum of €11.93 to be paid for the account to be closed, and 2) the account owner themselves had to make the application to close the account. Once again I mention the whole “you know, he’s dead?” spiel and was passed over to a supervisor, but in a reminiscing demonstration of absolute absent-mindedness/stupidity, the response I got was “unfortunately they have to show up in person, as we need a paper copy for accounts older than X years, otherwise we can’t proceed”.\n\nNow. I don’t know how widely common this is, but in my country, you “rent” the burial site/grave in 3-5 year increments. My father's grave’s 20 years were up in August and my mother decided it was time to unearth his bones and surrender the site. As such, we had just been delivered a very respectful package with my father’s remains, cleaned and curated, only that week. Everyone that has ever gone through this process would recognize that box for what it was. And what it was, was great timing. \n\n2 days later, I went to the water company’s local office. I wore my most purple, silky, goth outfit, dark make-up, and “oh-so-heathen” jewelry, and carried a large bag with me. I asked to speak to the same supervisor, who luckily for me was in an open-space area with *their team’s director* and quite a few more desks. After confirming with her why I was there, she started telling me the whole “he needs to be here in person” thing again, but I interrupted her and told her “I know what you will say, so I brought him with me so he can tell you himself”. \n\nI plopped a Ouija board and the box with my father’s remains on the desk, and loudly shushed the area. Heads turned, her director looked up with a “what the fuck” expression, and the supervisor herself was frozen and wide eyed. I placed my hands on the Ouija board and just as loudly started asking my father’s spirit to communicate with me, show me a sign he was there with us, reach out to me from the grave. Everyone was silent, people walking by the door stopped and stared, I threw a few “Papa can you hear me?” in there as well, for dramatic effect. In comedic timing that happens only once in a lifetime, I think a pen?/something small fell down from someone’s desk behind me, which against the silence was quite startling. Excitedly I moved my hand to YES and proclaimed I needed his help in the form of his signature from the beyond, in order to close this account.\n\nFinally the director snapped out of it and came over with an “alright I can help you over here, I think this is enough” but hell no it wasn’t. I started gathering my things as I laid into him, how asking to speak in person with an indisputably dead man of over 20 years was beyond stupid and if I had to put up with their idiocy, they had to put up with the process required to get ahold of him. I also mentioned that denying someone’s legal title claim was lawsuit-worthy, so he immediately changed his tune that I could of course close the account. He tried to bring up the fee but I cut him off with a “don’t even think about it” and walked out.\n\nIt's still early but so far, there has been radio silence. My mother thanked me for handling it, but when I suggested she should write to someone higher up about this, she just said “meh, not worth it, it’s over now”. What a missed opportunity for a “water under the bridge” comment :P\n\nTL;DR Water company wants to speak to my long-deceased father in person. I go above and (contact the) beyond to grant their request.",
        "permalink": "/r/MaliciousCompliance/comments/xld3yf/you_need_to_see_my_father_in_person_zavara_the/",
        "comments": [
            "Nothing quite that dramatic, but closing accounts after my parents died was a pain in my ass.\n\nI remember calling one company and them saying that they would need to speak to the cardholder to cancel the account after I had told them my mom had passed away. I told them, \"That will be difficult.\" The silence I got as a response for a moment before they asked me to hold while they got a manager was somewhat satisfying.\n\nYou get a bit jaded after dealing with it for a while. I carried copies of my parents death certificates with me for about a year, just in case I found an account that got missed.",
            "My aunt got in trouble for doing something similar. The phone company pulled a similar stunt, insisting that only the account holder could close the account, otherwise the bills would continue. She mailed them an official copy of the death certificate, along with a baggie of ashes from the fireplace and a note that since they didn't believe the death certificate, or any of the legal documents naming her executor of his estate, perhaps they'd like to take it up with the account holder himself? (The \"cremains\" in the baggie) The bank freaked out and law enforcement got involved. So now my 68 year old hippie aunt has a FBI file.",
            "After my mom died, my dad tried to transfer the couple credit accounts only in her name to him. One company did exactly what OP's water company did, and after a lot of fighting my dad straight up said, \"I am not obligated to pay this card back, but im doing so because I feel morally obligated to and I can afford it. If you keep fighting me on this I'll give up and you'll never get your money back.\"\n\nThe company refused, saying that they'd get the money no matter what cause if the death certificate went through they'd be allowed to just pull the funds from the estate. But jokes on them cause there was no estate. My parents were married. My mom's \"estate\" was automatically transferred to my dad's name, or was already jointly owned. And the card company had just refused to put their account in his name as well.\n\nAs far as I know my dad never heard anything from them.",
            "I had a similar problem when my mother died. Finally got through to most of organizations, but one charity would not hear of it. After many phone calls I had a most dramatic fundraiser who just would not give it up. I listened to her wailing about it being for (cue dramatic quaver in the voice) DYING CHILDREN! They are going to HEAVEN! Finally snapped at that one and told her firmly Well, she beat them there. She's dead, and she's not going to be donating from there.  The organization finally left me alone after that.",
            "People die. How the fuck do they not have a procedure for it?",
            "And now that his unfinished business is completed, your father's spirit can finally move on.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n/s",
            "This is the greatest MC story I've ever read.\n\n>I started gathering my things as I laid into him, how asking to speak in person with a proven-beyond-a-doubt dead man of over 20 years was beyond stupid and if I had to put up with their idiocy, they had to put up with the process required to get ahold of him.\n\nTruly magnificent.",
            "for something that happens all the time and will eventually happen to literally everyone, businesses are spectacularly bad at handling the death of customers. probably because they can continue getting more money out of people too busy grieving to fight every company. literally every person i know who had to handle the estate of a loved one has had to fight multiple companies to get accounts paid off/closed. like even people with lawyers to help with the estate dealt with it.",
            "I kinda did the opposite of this. My brother went to a very prestigious university. Not cheap. And he paid for it himself. However, because the school is so pricy, everyone who handles money there assumes the student's parents are paying for it. So naturally, the donation solicitation office got my parents' number and started calling to ask for donations. Now, my whole family is generally of the opinion that most colleges and universities are already too good at extorting money from people, so we didn't have the time of day for the donations folks. And, I'm not sure why, but every time they called they asked to speak with my mom, and every time they called she'd ask to be taken off the call list and added to the do-not-call list. After about five months of daily calls, sometimes multiple times a day, we were pretty fed up with it. Didn't matter if we threatened harassment suits, begged, pleaded, or hung up on them, the calls kept coming. So one day, I try a different strategy:\n\nPhone rings. I answer \"Buddh13 residence, how can I help you?\"\n\nIn the brightest happiest scripted voice I've heard yet \"Hi, my name is Peggy from the Fancy School Donations office. Is Mrs. Buddha13 there?\"\n\nMe, putting a catch in my throat, \"unfortunately, no. Its been about two months since the accident, and we just got home from her grave. I'd really appreciate it if you'd stop calling and harassing us asking to speak to my deceased mother.\"\n\n\"....\" awkward silence. Stammering. Very softly \"I'm sorry.\" Hangs up. \n\nI feel a bit bad for Peggy. She sounded like she was new and still optimistic about people wanting to throw more money at the school. But it was effective. Never got a call again.",
            "I haven’t seen/spoken to my father in over a decade. No idea if he is alive or not. There have been a few occasions where people insist on having his name/address/phone number. So I took an old Twister spinner and redid it with the options “Alive / Dead / In prison / Gone fishing.” I pull it out on those people and tell them to spin the wheel to determine is fate because it would be as good of a guess as mine",
            "Corpse taken to Old Mutual office as proof of death. Insurance company refused to pay out a funeral claim\n\nhttps://www.youtube.com/watch?v=iqdbPHImTqg",
            "When my grandmother passed away, I kept getting calls about her oxygen tank.  Now,.that particular tank had been returned to the company when she went to live in a nursing home 3 years before she died.  Not only did the company insist she still had it, they insisted that they needed her new address as they needed to send her some paperwork.  No matter how many times I told them she was deceased and I was the executrix, they wouldn't listen.  So, the last time they called me.asking for her new address, I gave them the address of the cemetery and her plot number.  Haven't heard back since.",
            ">“Papa can you hear me?”\n\nI lost it all here.",
            "I hope this isn't a disrespectful  question but I'm interested in how renting a burial site works? Is this a thing due to lack of space for burying people? What do families do with the bones once they are returned?",
            "I’m a young widow who lost her husband very suddenly. I also moved to my hometown a week after the funeral. Most of the companies I had to deal with were understanding and professional. Especially when I waived the military death certificate in their face. But the electric company gave me a hard time. Actually just one of their employees. I went down in person to shut it off. My sister was waiting in the car with her little baby so I was anxious to get it over with fast. It’s a long line. Finally I go up to the counter and hand them the death certificate and tell them I want it shut off. The woman seems confused. Asked why I don’t need the electric for myself. I explained I’m leaving town and moving. Apartment is cleared out and keys handed over. No one’s there. So then she asks where does it say on the death certificate that I have the power to shut it off on his behalf. I point on the death certificate where it says so and in fact I had it highlighted. Then she looks at the account and says “I can’t let you shut off the electric, he was living with another woman!” I don’t know how I didn’t slap a bitch. She told me he was living with [my first name, maiden name]. I told her that’s me. That’s my maiden name. We were engaged when we moved in together. Then I replied, “it doesn’t matter who he was living with. I have the power to shut it off regardless.” She had the look of defeat on her face at that point and begrudgingly complied like she should have originally. Woman was acting like it would cost her personally if I shut off my electric",
            "This happened with my dad's American Express card. I spoke with a person, told me what to do\n I sent in his death cert and probate docs showing I was PR, then tried to close the account. Was told only the account holder vould close the account. Explained he was dead.  Got told again that account holder had to close it. I said again he was dead. Then spelled out d e a d. Still got the run around. I said fine. The card is still open. I am going to take it and charge it to the max and then not pay it off. They finally let me close the damn account",
            "\\-Papa can you hear me?\n\nI am on my knees, bowing to your majesty!! Thank you for this gem, made my day",
            "highest tier of pettiness. I love it.",
            "I was changing my car insurance about 10 years ago, and they were going to charge me a hefty amount due my car being in an accident seven years before. I told them that I would be glad to pay the extra when they were able to bring my daughter back to life. U see, the accident was a fatal one where she was driving. They changed their tune quickly!",
            "I can guarantee you are now a story told to new starters to freak them out.\n\n 10/10 handling",
            "After my mom passed away, we got a jury duty summons for her.  I called our local jury coordinator and told her that:\n\n1. My mother had been permanently removed from having to serve jury duty over 10 years ago, both by age and by doctors note\n\n2. That I didn't think I'd be able to get her urn past the metal detector at the front of the building\n\nThe coordinator thanked me for the call and assured me that she was being removed from the jury pool roster as we spoke.",
            "Netflix is giving one of my family members the same type of crap. They are trying to close the account but because the only the deceased knew the info like the password Netflix won't close it. Netflix has done this to other people we know.",
            "So this reminds me of when Bindi Irwin (daughter of the late Steve Irwin) went on Dancing With The Stars in 2015. Being a minor of foreign citizenship, she was required to have her parents sign off for her earnings to be released (it was like $350,000 I think). They wouldn't accept just her mom's sign off, they insisted she needed both parents to sign... 9 years after her famous father died.",
            "What the hell is it with water companies, When I got married again my new wife tried to close the water account at her old house, they wouldn't have it that this woman with a new name was the same person that owned the account. They needed a certificate, so she went back in with the marriage certificate from the wedding, \"no we need the original from the Births Deaths marriages\" .  We had to pay some ridiculous amount to BDM just to get a printed copy of the certificate that we had, it had a rubber stamp on it is the only difference.",
            "I had a conversation at least once a week with our credit union as to why I was unable to bring the car back to them. Because it is currently in a local police impound lot as it was the scene of the crime. Because I had helped my godson buy a car and before I was able to put him on the note and title, he was murdered in the car. So I can't turn it in. I can't sell it. I can't get it totaled, (he put it on comprehensive only). So I took the hit on my credit and I'm just waiting until they sell the debt so I can pay the balance.",
            "A magnificent performance! More companies with stupid rules need their faces rubbed in it.",
            "My goddess, I hope you have a lucrative writing career.\n\nWater under the bridge, indeed.  My tea hit the computer screen…",
            "Just call the company and say you’re the deceased person. As long as you know the correct account info and any passwords or keywords, you’re good.  \n\nMy mom handled the accounts, and after my dad died she ran into a few of these difficult cancellations over the phone. One time she cussed out the operator, slammed the phone out of frustration, then finally got the idea to call back and (in her normal voice) declare “THIS IS [DAD HUSBAND] AND I’M CANCELING MY ACCOUNT.”  It worked, and she repeated the method successfully a few more times.",
            "Oh my golly. Thank you for the best laugh I have had in a long time. That is amazing and I would have loved to have seen their faces. Bet they changed that policy after that.",
            "I got tired of the run around when my husband died and finally told the agent I would have to glue my husband back together. He had been cremated. Never heard from them again.",
            "You were very generous to leave the remains in the closed box.\n\nI was picturing walking in with a literal bag full of bones and dumping it on their desk.",
            "Cable company did that to my Mom's account.   I had complete Power of Attorney from when she was alive, I was the Executor of Estate, had multiple copies of her Death Certificate.\n\nWe had already inurned her cremains, so I couldn't do what you did.\n\nI did make one last call.   \"I'm closing out all her accounts. Tomorrow.  Please cancel her account.\"\n\nNope, account holder must do so in person.\n\n\"OK then, the cable box is in the office of the apartment complex.  You can pick it up anytime.\"\n\nFor over a year I'd answer any phone call from Florida that was not family with \"She's dead.  You are not getting paid.\" then hang up.   Any postal mail was returned \"addressee deceased.\"",
            "One of the best additions of MC. Thanks OP!",
            ">They were closing inactive accounts at the 20 year mark\n\n>the account owner themselves had to make the application to close the account\n\nWTF? The intention of these 2 policies are directly contradicting with each other. Given these 2 polices, millions of dead account will never be closed and the first policy is basically redundant",
            "For several years after my mother died, my father got tired of telling the same companies over and over that my mother had passed away. So he started telling them she doesn't live here anymore, and asked if they would like her new phone number. He gave them the office number of the cemetery where she was buried.",
            "Going above and “beyond” indeed! Winning at the MC game all the way, thank you for cracking me up!",
            "This was the most brilliant confrontation of mindless governmental practices I have ever encountered. I applaud you and your dad's ability to shove their idiotic policies in their faces. You are an inspiration. And thank you for sharing this.",
            "After my mom passed I as executor closed out all her accounts, paying off any balances and sending certified copies of her death certificate.  Contact info changed to my specifics.\n18 months go by and I received a collection notice from a credit card that had apparently been charged a service fee annually and was now in areas for non payment. After 11 months of late charges we were now talking well over 500$.\nCalled the collection agency first.  Nope they can't do anything. \nCalled the credit card customer service, and bumped up the line to be told again and again that they needed to speak to the cardholder.\nYes they see the pdf of the death certificate attached to the account.\nNo that doesn't change anything , let me get yo to x person ( next up the line,)\nFinally asked if I should send just a portion of her ashes or would they require the entire urn, and did they have a medium on staff to contact her?  Oh, yeah, and can I be there as I would love to chat with mom again..\nOh no they don't think that's necessary.\nFigured it was over.\n\nNope.\nNext month I contacted the lawyer for the estate and the filed predatory lender charges ( not sure if that's correct term)\nProblem solved.",
            "One of my aunts passed a few weeks ago, a very hardened woman who had lost a lot over the course of her life, her fucks among them\n\nWhen her husband passed she also got the \"in person\" blah blah only the guy worded it as \"I will need to speak to him myself\" so my aunt told him he'd have to kill himself for that\n\nNever heard from them again",
            "OP, I am currently sitting here going through the last paperwork to close my mother's estate. Thank you for bringing some humor to this day for me - my mom would have loved this story.",
            "I have my parents cremated remains and if ***anything*** like this happens, this will be my go to",
            "How did the cabin fare? I'd imagine a self built wooden structure doesn't do too well when abandoned?",
            "We need a category about idiots who don't grasp the concept of dead and how they were forced to realize how stupid they were being.  I  heard of one person who brought the ashes in because they wouldn't get it otherwise although they freak out and called the cops who probably annoyed that this had to go this far just to solve the problem.",
            "Most definitely the best MC I've read on Reddit! You deserve to win post of the year (is that even a thing? If not, it should be! )",
            "This by far, has been the best MC in the history of MC. You are an opponent worthy of British bureaucracy. ❤️🎊💯",
            "Closing accounts is a pain and you handled their ridiculous rules beautifully.\n\nI'm still trying to get an account closed that has a $0.02 balance from 2006. They have spent a fortune mailing statements every month for 12 years but no intelligent being has ever thought about this.",
            "Complete opposite story but when my dad died he apparently owed a cable company like a thousand dollars. We called them just to notify them he was dead and they were like \"oh! Ok! We'll just close this account and forget about it and move on then! Sorry for your loss and eh, whatevs.\" I was like... Ok? >.>",
            "You should have recorded the faces of these idiots",
            "I don't mean to be morbid...but what happens next?  I've never heard of digging up the remains.    Is there generations of ancestors hanging around?   Also, from an emotional standpoint...I don't think I could handle having a bag of my parents bones hanging out.",
            "You are now in the small and select list of my personal heroes.",
            "WAIT! Didn't you say goodbye? Because you might curse that place with a ghost of a homicidal maniac, a demon or a flying spaghetti monster!",
            "My grandpa had a similar problem after my grandma died. The phone contract she had subscribed to could only be managed on the internet, but she hadn't given her password to my grandpa, so he couldn't close the account himself. So he called the phone company and it went somewhat like this (summarized) :\n\n\"- Hello, this is xxx company. How can I help you.\n\n\\- Hello, my wife has passed away so I need to cancel her phone subscription.\n\n\\- Ok which type of contract ?\n\n\\- bgdnbrncfb (name of the online-only contract)\n\n\\- You have to cancel that online, sir.\n\n\\- But I don't know her password.\n\n\\- You have to ask the person for that.\n\n\\- But she's dead !\"\n\n&#x200B;\n\nIt took \\~3 months before they finally canceled her subscription.\n\nSurprisingly (/s), this phone company is famous for its terrible after-sale service, maybe the worse of the country. I'll never subscribe to anything with them.",
            "Being old-fashioned, all of my grandparents' accounts were in my grandfather's name, even after he died.  Further, my grandfather, James Robert, didn't believe in diminutives.  So, when there came a time that we began receiving unsolicited telemarketing callers who were feigning familiarity, we knew right away they were bunk.\n\nIt was when they began calling during suppertime that my grandmother became frustrated enough to let me begin harassing them right back:\n\n* Hello?\n* Hi!  Good evening, sonny!  Can I talk to [Jim/Bob/Jim-Bob/Jimmy-Bobby]?\n* Sure, one moment.  [hand over mouthpiece, yelling mildly]  Jim!  Phone!  [wait a few seconds]  Sir?  I'm sorry, Jim can't come to the phone right now; ʜᴇ's ᴅᴇᴀᴅ.  [hang-up]\n\nThe calls began petering out after a while.  I like to think I contributed to that.",
            "The pensions agency said my dead grandmother had to inform them herself of her \"change of circumstances\" when I called them to tell them she'd died. Then they overpaid her because she didn't think to tell them she was dead, and me and my mum had to deal with that on top of everything else you need to do when someone dies. I was on the phone to them like \"short of me conducting a seance, how exactly is a deceased person supposed to tell you that they're deceased?\" It was like the dead parrot sketch from Monty Python. The water company, however, were fabulous. Not only did they cancel the bill from the day she went into hospital rather than the day she died, they also left the water on for free until me and my mum had cleaned out the house and given the keys back to the landlord so we could make tea and use the bathroom.",
            "When my FiL died my MiL (who then moved in with my husband and I so I have a first hand account of it)  kept getting calls from the Dr's office stating my FiL had missed some appointments and when would she like to reschedule them for?  After a couple of weeks of this and repeatingly telling them he was deceased and that they had processed the death certificate for pity sake(!!) she told them fine she would bring him in next Tuesday.  \n\nSure enough that Tuesday she shows up to the doctors office, plops his urn up on the reception desk and almost gleefully announces that she's brought FiL for his appointment.  Receptionists were speechless.  \n\nMy MiL didn't get any calls about missed appointments after that though.",
            "What is it with water departments? When we bought our house from family, I sent in the paperwork to change the bills over, printed from their own website, and the lady that contacted me was straight up offended that a property owner dared try to do such a thing themselves and refused to process it. She kept telling me our real estate agent, which we didn't have, was supposed to handle that. I am sure I gave her everything she needed, all of the other utilities showed up the next month in our name. She was just a bitch.",
            "I don't understand how these companies have no processes in place to handle death. literally everyone does it at some point, you'd think it'd be constantly coming up",
            "Oh god this reminds me of when my father died. Everything but his bank account and his car insurance were in both his and my mum’s names so getting all the joint stuff sorted was easy as hell. I was put in charge of handling the bank, my sister his insurance.\n\nHis bank we (mum and I) went in with the death certificate, to close the account and pay any outstanding fees he may have had - later found out that as he was a pensioner they no longer charged him fees - the lady at the counter kept telling me that he would have to come in and close the account himself even though we had the death certificate. We went home with nothing sorted and mum was quite upset. \n\nApparently my sister had the same amount of luck with the insurance company.\n\nLuckily enough for me, the following week my sister got a call that Dad’s ashes were ready to be picked up. The plan was hatched and this time we didn’t take mum with us. \n\nWe both walked into the bank and then the insurance with my father’s ashes, put them on the counter and said “we’re here so our dad can close his account”. Never had I seen tellers and office staff move so quickly to get things done. We never told mum what we did, but dad would have found it hilarious. I did also make a written complaint about the policy that a deceased person had to be present to close their account.",
            "Wait, nobody else has questions about renting a burial spot and removing the remains???",
            "This was amazing OP good job",
            "Well death is unexpected, no wonder they struggle. /s",
            "I LOVE YOU.",
            "My grandad died in 2007. Mum as his executor tried to close all his accounts. One refused to accept it. So she just ignored every letter to him from them as he was dead. Eventually debt collection people tried to reach him and she was able to show them the death certificate. They went away after that.",
            "Omg great story! Are you by any chance Greek? I saw your reddit name and I figured so.",
            "This! This is malicious compliance! And if that wasn't enough, it's well written, and funny! Thank you.",
            "My father passed away early this year. His dad (my grandfather) had taken out a life policy on him in 1942, probably expecting dad's participation in WW2. Dad kept that little policy, and in 1962 he got a letter that the policy was paid up.\n\nSo about a month after dad passed, I started the process to file a claim on that policy. After some run-around they mailed the claim forms to DAD's home address --- the home he moved into in 1963 and sold in 2016 --- not to the address I gave them on the three different emails I sent when making the claim. To this day, I have no idea how they came up with that address.",
            "What country is this? I want to know more about the whole remains thing.",
            "I'm sorry but i don't believe you. I think you made this up.\nIf you want to have any credibility here, please ask your father to come and confirm it for us here.",
            "deadpool singing \"papa can you hear me?\" in my head as I read it, made it even more awesome. perfection!",
            "Had something kind of like this happen to my husband. His father passed and he was calling to cancel an upcoming appointment. They had been told that he died, but immediately followed, \"When would you like to reschedule that appointment for?\" Uhh..... he's dead. My husband joked about bringing his ashes into the appointment. Eventually they got it that he had died. Or so we thought. Got an appointment reminder card for him last month, almost two years after he died.",
            "Literally two weeks ago got a check from one of the bigger banks in the US. Check was made out to “the estate of” MIL at our address. My MIL has been deceased for 12 years. Wife tried to cash the check at said bank (we don’t bank there) only to be told that nope sorry your name isn’t on the check so we can’t cash it. It’s to the “estate of” at our address. ID showing that address didn’t matter. They started to list out the hoops required to jump thru and the wife just walked out. It’s only about $100 so she may just keep it uncashed.",
            "Had a similar issue shutting off the phones after my mother-in-law died. They wouldn’t shut them off without us jumping through a huge number of hoops, so I just quit paying the bill.\n\nEventually they shut off the phones, and sent the bill to collections. For years we’d get calls from people trying to collect the ~$40 bucks or whatever they decided she owed.",
            "Comcast did the same shit when my mom died, she was living with me and had cable tv (I was an early cord cutter and don’t watch tv), I called them to cancel service because she had died and they told me that she had to call and cancel. So I got 6 months of free tv till they shut it off, and ignored the bills. Bureaucracy is stupid.",
            "This was amazing, OP.\n\nWhen my mother passed away in 2010, I had to deal with a lot of idiots calling for her. Luckily most were deterred by a death cert but not all. The one I remember the most? LensCrafters! They would not inactivate her account because their system didn't have that capability so they kept calling to schedule her for an appointment. Multiple attempts! No one would listen!\n\nFinally, totally sick of it, I answered one last time and told them she wouldn't be needing glasses anymore. \"Oh, did she get laser eye treatment?\" No, she won't be needing them because she doesn't have eyes. \"...what? Was there an accident?\" Oh, no, she's just dead. I'd be happy to bring her urn for a check up but ashes don't have eyes. \"I'll...uh...put a note on the file not to call you further.\" Thanks, you do that.\n\nCalls stopped. When we do get the occasional call asking for her (like a political survey taker or something), we offer to put the phone next to her urn for them before they hang up. But it's been 12 years so those calls are pretty rare.",
            "This might just be the best thing I've ever read here on Reddit. Kudos to you for dealing with the worst bureaucracy  with humor.",
            "Best story ever, well done!  Really annoys me when companies treat families like this.",
            "Thank you so much for the laugh! It's been a while since I've laughed so much at something.\n\nI thought you would just plop the box and call it a day, but you went above and beyond with it, fully commited!\n\nThank your dad too for being dead and visiting in the form of a dropped pen. Perfect timing really.",
            "I lost it at “Papa, can you hear me?”. Well done!!!",
            "Lol!!! I loved this. I'm so sorry you and your Mother had to deal with this. I can't believe they did this but I'm glad the water is in the Styx now. (I suck at puns, sue me.)",
            "Any dad would be proud of you for brainstorming and executing that.",
            "im so glad i cancelled my planet fitness membership eons ago, bc i could totally see my fam having to bring my urn to the membership desk one more time to get them to cancel me when im dead.",
            "If I would be your father, looking down from heaven and see how you bring my bones to a water company, because they didn't closed my account, I would be so proud of you.",
            "Reminds me of that post where a person took their parents ashes to the bank to get the account closed 😂\n\nGood for you! This sounds hilarious, I wish I had seen it 😂😂",
            "Legally, any contracts cease to function the moment one party dies.  \n\nThis is why if you want something really long term, like to rent and remodel a shop, you ask the owner to establish a company that owns it (with him being 100% owner of that company) instead of renting it directly from him.",
            "My Dad passed in 98...my brother has spent years being him on the phone as we left Mom's utlities in Dad's name for safety. Mom passed in Dec 21, I am not her on the phone if need be but my brother is still my Dad on the phone and got it all turned over to my name. Sometimes you just have to lie to get shit done!",
            "As a person whose deceased father was called for jury duty twice after he died (in spite of us notifying them the first time that he couldn't make it due to being dead) I salute you.",
            "Any day I get to say “this was your idea you dumb motherfucker” is a good day",
            "I had to have a Karen fit for them to shut my moms cable off and take the equipment back when she died because of a similar issue. They repeatedly refused the death certificate and kept saying she had to come in person.\n\nI never had so many regrets that we buried instead of cremating her.",
            "When my mother passed I called sprint to cancel her cell phone,  it was under my name,  they kept giving me the run around and offering to upgrade my plan.  I finally snapped and said \"if you can bring her back from the dead then I'll gladly take the upgrade for her phone\" , they just ummmed and agreed to cancel the line",
            "I love stories where companies refuse to understand that dead people can't close their accounts on their own, but I think it's sad there's so many of them on this sub.",
            "AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA",
            "That cabin must be pretty decayed after being vacant for 20 years",
            "This WINS MC!",
            "Sounds like France or Italy. The stories must be true",
            "Magnificent!",
            "First of all you're an amazing writer. Second of all, did you bury cremated remains? Or was he just shrunken down to a pile of bones?\n\nI know personally my late dad would have been howling if I were in your position so I hope your dad is laughing, wherever he is :).",
            "I hold your account fulfilled. Go. Be at peace.",
            "If any company flunkies give me a problem while I'm handling my parents' estate, fuck it. I'll just let the PTSD take over and they'll get to hear the Army version of \"get fucked.\"\n\nI imagine it'll be pretty cathartic for me and traumatizing for them.",
            "This made me cackle out loud enough to scare the cat off me.",
            "This is the kind of content I come here for. Bravo!",
            "What a great story!! I absolutely loved how it ended for you!!!",
            "Thank you OP. I actually cryed at the \"papa can you hear me\" point. This is the funniest thing I've read in a long while!",
            "That was awesome!! Maybe I should buy a Ouija board too but I saw too many horror movies and I know it can end in a BIIIIG disaster",
            "Reading the comments it makes me so sad that there are so many of these mindless automatons that go through the motions of “working” while never applying any modicum of common sense. \n\nAnd thanks for the laugh, this was great",
            "I am absolutely SCREAMING with laughter right now oh my god. This is priceless gold.",
            "This genuinely made me LOL which is rare on reddit hahahahaha \"papa are you here?!\"  It just sounds like a wack episode of The Office",
            "When my mum passed I had all her information so I called her cable company and said I was her and I wanted to cancel my service. They asked a bunch of questions, I had all the right answers and it was canceled.",
            "[removed]",
            "My father, who died in 1995, was still on my mother’s electric bill when she died in 2018.  I’ve given them BOTH death certificates, and had the final bill paid, tried to open a new account, but they still have his name on it.",
            "Not gonna lie, for a moment, when you mentioned exhuming the body, i thought you were gonna dump the remains on their desk.",
            "This is by far and away my favorite MC story! You are a LEGEND!!",
            "Well told, OP! 🤣",
            "This is one of the best things I’ve ever read in my life",
            "Thanks for sharing 💕",
            "This is one of the best stories I’ve ever read on this sub. Well done!",
            "Absolutely loved reading this. I was visualizing as I read. What a great sense of humor to deal with a tough situation.",
            "\"My mother thanked me for handling it, but when I suggested she should write to someone higher up about this,\"\n\nLike... your Dad?",
            "This made me giggle do hard while laying in the dark my cat gave me a dirty look and got up and left. \n\nI really wish there were pics of the employees faces. You were awesome.",
            "Well told!",
            "You are my hero and idol. Teach me your ways!!!!",
            "I must say, you write really well! It was so much fun reading your post :)",
            "This might be my favorite of all time",
            "You’re my hero",
            "I sooooooo wish I was there to watch this unfold. I love it!",
            "The problem with government bureaucracy is 99% of the workers have no power to change any policy and when you've worked in government long enough to understand this, you stop giving a shit. I used to work in government and am glad I got out. The lack of motivation to cut costs because it just means a smaller budget next year if you don't spend it all and inability to make meaningful changes really kills the soul.",
            "I guy worked with somehow got his deceased mother's contact info changed to the cemetery, after having similar problems. I have no idea how, this was when snail mail was still a thing.",
            "Rotflmao! 😂🤣\nThank you so much for sharing this albeit horrific but hilarious story.",
            "This is hilarious and possibly the most malicious compliance story I’ve ever seen. I hope your father would have approved and if he were here, had a good laugh about it. Good work!",
            "If your name is Zavara, I absolutely love it!! It’s a beautiful name",
            "This. Was. Spectacular.",
            "Knew someone who had to go through this as well. Not sure how or if that was solved, though.",
            "I have never so loud in my house before!\nChefs kiss🤌🏾",
            "wanna have more fun?\n\nTry canceling HP instant ink for a deceased client and lost login info...",
            "makes me wonder if there are places where this sort of thing is _actually_ done \n\nyou know, mediums with that job, legal liaison to the dead",
            "Cherish the Cabin.",
            "When my father passed away 17 years ago we had him cremated. After cleaning out his apartment my younger brother asked me what I had in the trunk/boot of my car. I told him dad. Nice quick laugh during a painful time.",
            "Iconic, love you.",
            "The water department still has my husbands name on the account even though I’ve proved that he’s dead at least three times I’m now tempted to take the urn holding his ashes down to the water company to see if maybe I can finally get his name off the account.",
            "My wife passed away. I provided documentation to Compuserve to get stock certificates transferred to me. Compuserve screwed it up so much that I get a dividend check for $0.01 every quarter.",
            "Where in the world do you “rent” gravesites? That seems unnecessary and cruel. Are the gravesites run by used car salesmen?",
            "Try cancelling a 30 year old AOL account belonging to a deceased family member.   Yes, AOL is still around, though all their revenue is from accounts people forgot to, or cannot, cancel.",
            "This is by far the best story I’ve read in this thread. \n\nAlthough I’m curious about your father’s burial situation. I live in the USA and at least as far as I know that a cemetery plot cost X amount of dollars and once it’s paid for, that plot is owned by whoever is buried there/paid for it. Out of curiosity what country are you from and is this common around the world?",
            "That was satisfying read on my break. You made my day. Loved it. I'd give a reward but I'm broke",
            "Well played!  I'm gonna hire you for all my future malicious compliance needs!  Cheers!",
            "When my mother passed I knew from stories I'd heard from co-workers how hard it'd be & I was already paying them as we'd moved in to help her years prior. So I just kept them in her name & paid until a lady at electric company (who knew mom) said I must change account into my name. So called water & same. Same account numbers just switched names. Small towns 😒 everybody knows everybody. Now with autopay & online it's just sign in & pay, cancel or whatever.",
            "Interpretive dance 🤣🤣",
            "I saw this on a YouTube video and had to come over here to read the post myself. My dude, you are a GOD. I absolutely lost it at \"papa, can you hear me?\". I haven't laughed that long or hard in a while. I salute you! Your commitment to the bit was sublime and if I'd been in that office, I'd have been rolling on the floor with laughter. I aspire to your heights of malicious compliance!",
            "OP, I cackled.",
            "This is by far the best MC I have ever read!",
            "I work for a utility and there is a reason we have policies like this. Obviously, I am going to be rather lenient with customers who have a death in the family. However, on more than one occasion, we have had disgruntled roommates, girlfriends, and even spouses wanting to shut off service out of spite. We have to be really careful how we allow people to discontinue service.",
            "This belongs on a \"best of\" sub. It's a delightful story, well told.",
            "That... That was amazing! I bow to you. 😯"
        ]
    },
    {
        "post_id": "s1r0eg",
        "author": "PUNKeM0N",
        "title": "When someone asks you to write Your Name so they can report you to corporate, DO THIS",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/s1r0eg/when_someone_asks_you_to_write_your_name_so_they/",
        "score": 18231,
        "num_comments": 820,
        "created_utc": 1641943916.0,
        "selftext": "I used to work for a car rental company, I won't say which, but the name accurately describes the employees' daily experience working for them.\n\nDuring my time, the company continuously changed policies regarding debit cards for rentals because of the large amount of fraudulent transactions associated with them.\nThis caused much drama with customers, in particular with return customers who hadn't been in since the policy change.\n\nAround the end of each school year, many people rent minivans or SUVs to pick up their kid and a bunch of their stuff from college. I had one such customer who did not qualify for the rental vehicle she reserved. Per my training, I was not allowed to rent anything larger than a sedan because she did not have a credit card. When I informed her that I could only give her a Hyundai Elantra, she became enraged.\nShe stated that the previous year she was able to rent a minivan under a debit card, and I informed her that policy had changed since then. She refused to acknowledge that I was doing my job properly.\n\nI repeated company policy multiple times and did my best to inform her that I was doing the best I could with the current situation. She refused any attempt I made to placate her. My manager eventually stepped in, and he broke down and did the rental for a SUV, against company policy.\n\nThe entitled woman smirked at me and pushed a stack of Post-It notes that was on the counter in front of me.  She said \"You should not be in customer service and I'm going to report you to corporate. I want you to write your name on this paper.\"\nWithout missing a beat, I took the pad and wrote the words 'YOUR NAME' on the top sheet, ripped it off, and handed it to her. Apparently she didn't notice until she was in the parking lot with my manager and her husband to inspect the vehicle.\n\nWhen my manager came back in the office, he said \"Her husband (who stood silently behind his raging wife throughout the whole interaction) wants me to write you up because you didn't give them your real name\" then he started laughing and said \"but I'm not going to do shit because you followed the company policy and you did exactly what that bitch asked you to do!\"\n\nShe gave us a horrible survey and it tanked our bonus for that quarter but it was totally worth it to put that rude woman in her place.",
        "permalink": "/r/MaliciousCompliance/comments/s1r0eg/when_someone_asks_you_to_write_your_name_so_they/",
        "comments": [
            "Reminds me a bit about the time when I worked graveyards in a kiosk at a gas station.  This super drunk woman came walking up wanting to use the restroom.  So I buzzed her in.  A few minutes later she came out to tell me how messy the bathroom was, and that she wanted my name so she could call and complain to my manager.\n\nSo I took a sticky note and wrote \"Thanks for the great time, Dean\" on it.  So she walked away with it.\n\nThe next day I get to work and my manager comes in to talk to me.  He asks me if I know anything about a lady who was here the previous night and complained about the bathrooms.  I said yes, why?  He said she came back that day, and wanted to complain about Dean, and how unprofessional he was.  My manager's name was Dean.  I just started laughing and so did he.",
            "Those surveys are sooo fucking stupid.\n\nThey expect 5 stars on everything from everyone and blame any lost stars on the employees. The company policies are often the issue.",
            "ONE person has the power to tank a location's bonus for the quarter? Neat!",
            "Hurts lol",
            "Hertz, don't it?",
            "Managers who step in to give the customer what they want against company policies are the worst, they're just encouraging them to keep acting this way and abuse low-level employees.",
            "Companies fail to provide a service due to poor policy and low level employees eat the shit. This is not a customer problem (although many customers are fucking tools) but a corporation problem and the worst part is corporate don't give a flying fuck about neither the employee or the customer.",
            "Speaking as someone who has never owned a credit card, I completely understand her frustration. Is really is infuriating that the difference between a credit and debit is enough to throw off a plan, when I'm already handing over license and insurance details...\n\n**But** obviously it's not you who writes the company policy. She was way out of line. If she's gonna call up corporate then the policy should be the topic under discussion, not the poor bugger that has no choice but to enforce it.",
            "One survey tanked the bonus? 4 Positive surveys to counter a negative? Policy changes guaranteed to result in irate guests? \n\nSounds like a feature not a bug!",
            "We keep rewarding rude people and then are surprised that there are more of them.",
            "God. Fuck customers.",
            ">She gave us a horrible survey and it tanked our bonus for that quarter\n\nSo you followed company policy and company punished you for it. Just great.",
            "Sooo.....you gave her the upgrade and she still shit on you. \"This is America\"",
            "You poor thing that your manager shoved you under the buss in front of them before the high five behind the scenes. Typical shit manager. Protect his job at the cost of your humiliation and praise you behind closed doors.",
            "At our work any pain in the arse customers, cold callers etc are given the name “Cyril Horshank”.\n\nWhen anyone rings/emails etc in asking for “Cyril” we know it’s a nuisance call right from the start.\n\nUsed it for years & it works surprising well 😂",
            "Different story, also not name related. But it kind of fits the tone of doing exactly what the costumer demands.\n\nI was working at a gas station during University and one day a costumer walked in, wanting to pay his gas (over 100€) with twenty 5€ gift cards he got from his boss as a form of gratitude. I accepted the gift cards (they were new at the time) not knowing that our systems were programed to not accept more than ten gift cards at a time (even my boss didn't know). So I started scanning them in, confirming each one (which takes a lot of time) until my system suddenly told me that I have reached the maximum number of cards. Surprised I apologized and told the costumer what is going on and that he will have to pay the remaining amount with cash or a bank card.\n\nAs you can imagine he wasn't thrilled about that and started arguing. But the system literally prevented me from scanning in more cards and as \"gas\" is one transaction I wasn't able to split it up, especially as ten gift cards were already locked in. There was really no way out. \n\nSo we argued for a long time, everybody in the shop was annoyed, the line was getting longer etc... I stayed professional until I finally shouted: \"look, the system is preventing me. nothing I can do\".  While showing him the error message on my screen after scanning in another gift card for the xx time.\n\nThe costumer answered: \"I do not give a shit, circumvent the system.\"\n\nLike I am some kind of hackerman or like there is some kind of secret cheat line.\n\nSo I shrugged and walked around counter stood besides him for a second and walked back behind the counter and scanned in a gift card.\n\n\"Just did, still doesn't work.\"\n\nAt this point he started screaming and insulting me. All my colleagues were laughing and my boss had to take over. In the end the costumer paid the rest with his cc. \n\nWhile I understand that this wasn't his fault, it also wasn't mine. A bit of cooperation and understanding from his side would have gone a long way.",
            "It’s very poor service when a company keeps changing policy and a repeat customer has no idea what to expect when they show up for a service that no longer exists.",
            "Ah yes. I also worked for that company. And that reminded me of a customer of my own. I was definitely kind of a bitch but with how this ended I'm not even a little sorry. \n\nIn our location, we walked the customers out to their cars. It's an airport so it takes a few minutes there and back. \n\nI'm walking this guy out and I hold the door open for him. He insists I go through first because I'm a woman. I just smile and say, \"Oh no, please, after you.\"\n\nHe decides at this point that he isn't going to walk through a door held open by a woman. He tells me he can wait all day.\nHe gave up after about 20 seconds of silence and intense eye contact from me but that's where shit went downhill.\n\nWhen I'm on my way out with him, he reaches out and strokes my arm. I jerk my arm away mostly just stunned and I keep walking. So he does it again. I tell him, \"If you touch my arm again I'm going to rip it off and beat you with it.\"\n\nThe rest of the way he complains loudly about how feminism has ruined everything and men should be able to \"do wthat they want to women\". I don't even respond at this point because I'm feeling so unsafe. When we get to his car I step back but don't start walking to the desk because I don't want him behind me. He tells me that he's going to talk to corporate about how I threatened him.\n\nOh yeah sir, please. After the display in the office and the path with a dozen cameras, please do. I can't wait for how that goes for you.",
            "Jus to be clear, you are aware that your boss is a wormy piece of shit who made you look bad in front of a customer and could have cost you your job if he had actually reported you. \n\nYou followed protocol, your boss did not. You should have started automatically upgrading every rental to an SUV from that point forward on principle thanks to his shining example.",
            "I get that you have to cave with some situations / pick your battles... but I really hate it when staff do their best to follow policies put in place, then management goes around them making that staff member look bad.",
            "> I used to work for a car rental company, I won't say which, but the name accurately describes the employees' daily experience working for them.     \n\nTook me a second to figure out you meant Hertz, which is really fucking funny.",
            "Honestly in-store customer service jobs should have audio and video of the person you're dealing with that way you can submit that feedback back to corporate. Because honestly the way that woman was treating you was terrible and she should be blacklisted.",
            "You lost. She got what she wanted and you lost money.",
            ">She gave us a horrible survey and it tanked our bonus for that quarter\n\nThat should have not effected your pay. This makes the story more sad then anything. (In a way she \"won\")",
            "So basically she got what she wanted and you lost your bonus. Next time, just send customers like that out the door before you loose your bonus over a bad review.",
            ">She gave us a horrible survey and it tanked our bonus for that quarter\n\nSo you followed company policy and did everything and still you had been punished by that system.",
            "I dont think I could work in a place where someone had made it so miserable, only for some spineless-manager to come in and give her the W. I dont think Id have been able to stop myself writing \"Get a fucking grip you spoiled old bitch\"",
            "To be fair, she wasn't ever going to give you a good survey response so you didn't do anything wrong in my book.",
            "While i was still working at my old job a client wanted the name of one of my colleagues so he could make a complaint about him, i gave them my name instead since i had already given my two weeks notice. \nI'm sure there was a very bad review on me in a survey, which didnt make any sense since i didnt even work the same position as the actual guy they were complaining about.",
            "Having worked in customer service for many years, I’ve had several similar situations. I have found that when it gets to the point where the customer is as upset as the one in your story, the best thing to do is to not give in to their demands (even/especially from the manager). Since they’re already upset that it took so much time+effort to get what they “deserve,” they’re likely going to lodge a complaint anyway. Just refuse them altogether, forcing them to find other accommodations. They will be mad, but they won’t take the time to write a review until they get their immediate needs resolved. And there’s a decent chance that by the time they finally sort that out, they will be too tired to write a negative review. And if they do, they’re not even technically a customer because they never paid for anything.",
            "One frustrated customer doing a “horrible survey” for revenge could tank the bonuses for the entire office?",
            "Sounds to me like she won, got the car she wanted and tanked your bonus without needing your name. Win win for her.",
            "[deleted]",
            "Sounds like the manager undermining you made it look like you'd done an improper job. If they'd backed you and repeated policy she'd have had a consistent experience.\n\nAlso, don't do what OP said. It's opening you up to being a douche and passive aggressive and rude.",
            "Praxis Guide: when it comes to surveys, just give everyone a goddamn 10 okay? The company isn’t using these to improve shit. They only exist to suppress promised wages by depressing bonus payouts and giving management a reason to rate folks lower in annual reviews. They aren’t listening to you Karen.",
            "“It tanked our bonus but it was worth it!”\n\nBro she took money out of your pocket. She absolutely won and she will probably never think of you again. How was that worth it?",
            "On dear, dear ERAC...then again I work for the Golden cousin. Been there. Had a man tell me to give him my name, because I am \"obviously prejudiced against brown people!\" I happily wrote my FULL, EXTREMELY, OBVIOUSLY, ethnic 'brown' name, for him, smiled, and shoved it at him. The poor review is still on Google, and I read it every once in a while, just because I need a smile.\n\nEDIT: a misspelled word.",
            "If by “in her place” you mean the van that she wanted but shouldn’t get, then yes, you’ve put her in her place.",
            "Unreasonable Order? Check\n\nComplied with the Order? Check\n\nBad consequences for the one who gave the malicious Order? None. \n\nBad consequences for the one who followed the order: Yes\n\n>She gave us a horrible survey and it tanked our bonus for that quarter but it was totally worth it to put that rude woman in her place.\n\nNot sure your fellow employees would agree. Also, the \"place\" the woman was put was in a place of power to tank your bonus.",
            "I used to work at a clinic and my entire department answered the phones “Hi this is Ann in records can I help you”. There was no Ann in records",
            "It’s messed up that one survey can tank a bonus. I get it if it’s multiple surveys consistently saying the employees seemed high and is that weed I smell? But the fact that one unhinged person can tank a bonus basically means corporate set them out to fail.",
            "Years ago I was working at an event venue that was very strict about opening the bar early or keeping it open late for clients. Well, one night we were doing a charity gala and one of the chairs' husbands had already been over served and although the bars were closed and the event was over, he kept trying to get more drinks. He was using the typical \"Don't you know who I am?!\" stuff, but nobody cared.\n\nHe really started in on one of my best bartenders (named Ed) because he wouldn't serve him, and the resulting conversation was pure gold (remember, this guy was SUPER hammered).\n\nDrunk: What's your name?\nEd: *gesturing to his name tag that says Ed* Mark. \nDrunk: What's your last name Mark?\nEd: It's irrelevant.\nDrunk: I'm going to get you fired, Mark Irrelevant! *Stumbles off*",
            "This is exactly why bonuses shouldn’t rely on customer surveys/feedback the general public are completely unreasonable and cannot be trusted.",
            "She would have wrote the shitty survey anyways, that bonus was gone from the moment she walked in the door, so don’t feel bad about the post-it. You made comedy gold out of a shitty situation.",
            "I think this, \"give into the customer if they bitch and bully enough \" mentality is trash.  I own a business and have been in my industry 30 yrs and it's totally about people and people are now why I hate it. What's the point of  policy if you're just gonna throw it away the moment some heifer with a Karen complex decides she owns the business.  So the employee takes the abuse so the manager can roll over and then stand by why said heifer continues to throw her hateful attitude around and then the company penalizes everyone for a bad review???? I hate customer service.  I totally stick up for my employees btw. Someone recently tried to pull similar crap on us. Trying to force me to force my employee to do something against our professional advice. Look, if you come to us for the service you're coming to us for the expertise too, clients don't tell  us how to do our job. I just...wtf",
            "fuck your boss too, people like your boss are the reason people like that act the way they do. they know if they just stomp their feet and scream some, some pathetic, weak spined manager will give them exactly what they want.",
            "Your manager made a mistake. When a company will deviate from company policy to satisfy a customer, the message needs to come from the person who initially presented the hurdle. In that case, you. \n\nIn the eyes of the customer, you presented the company policy, they complain and you found a solution to them. \n\nYour manager was probably not trained on how to handle clients, unfortunately.",
            "Wow, fuck that manager. The correct response is \"My employee correctly followed the company policies. Please make a decision from the available options or leave.\"",
            "A healthy company shouldn’t tie bonuses on customer feedback. Good job tho!",
            "Did you put her in her place? Sounds like she got the SUV she wanted and you lost your bonus.",
            "What annoys me is places that don't even try processing it as a credit transaction, just a debit, even though many cards will do both, and then reject it for some reason related only to the debit transaction. It's like they're more interested in fucking with you than earning your custom.",
            "They give us write ups where i work but there is no printed name when they do it so I've been signing it Donald duck, Micky mouse or several other cartoon characters, they just seem to never notice.",
            "my favorite part about management is not reprimanding my employees when customers demand them too.",
            "Fucking hate this company. Worked their for 5 months before I decided enough is enough and I quit. The amount of verbal abuse you get from the customers for the bare minimum pay is just not worth it man.",
            "[deleted]",
            "Their name also describes renting from them",
            "Ugh, that is my pet peeve. If someone is literally trying to help you but stay within company policy, THAT'S THEIR JOB. Mind you, I have ranted about the policy to the person before, all the while apologizing for doing so. Still. NOT THEIR FAULT.",
            "Customer complains about you following company policy and it tanks your bonus. \nThere's so much wrong with that.",
            "Just one thing I'm curious about.\n\nHow is their more fraud on debit cards than CCs?\n\nIf the funds aren't in a debit card it just fails. But if there isn't enough in a CC it take a while for it to bounce.",
            "You don't have controls in your C-Sat to negate non-support related issues? In my job if a customer has issue with the policy or technology (I work in tech) then the survey is followed up and if the staff aren't at fault the score gets scratched",
            "The biggest issue with NPS isn't the concept itself.\nIt's when it's used at way to high a granularity in either time or scope.\n\nIt's useful for seeing how well the public's feeling about a company is tracking over time.\nAs soon as you start looking at a staff member or store level you just don't have enough data points to make any valid observations.\n\nBut management don't like looking at the big picture, and they especially don't like examining the results of their decisions, they like finding scapegoats.",
            "Americans really are obssessed with credit card debt instead of spending what they have",
            "It’s concerning that your bonus was directly tied to your disobeying the company policy.    Seems like hertz was incentivizing you to break the policy anytime someone throws a fit",
            "“We all lost our bonus but it was totally worth it”",
            "But your manager was fine for completely ignoring policy. Fuck all of them.",
            "One person with the power to tank your bonus? Yeah, fuck that place. Glad you left Hertz.",
            "> \"but I'm not going to do shit because you followed the company policy and you did exactly what that bitch asked you to do!\"\n\nHe talks a good game when he's back inside but at the counter he threw you under the bus, rewarded c*nty behavior, and got a horrible survey anyway.",
            "Always hated how a single survey can tank an entire month. Whoever came up with that terrible math to justify it needs to have continuous punches to the forehead applied until they convince people that it was a stupid idea.",
            "I always, always tell them my name. Then I call my supervisor and put him on speaker so we can all have a little chat. The looks I get when they realize I am not afraid of them and their only weapon has no power is priceless. The situation tends to resolve itself after that.",
            "These are the monsters that are created when managers constantly give them what they want to get them out of their hair. People honestly need to stop doing this.",
            "I worked for Budget in Canada in the late 80’s. Back then Sears Canada had credit cards that we would honour for rental vehicles. End of month rolls around and it’s always busy because people are renting moving vans. This lady come in, tells me she has this reserved blah blah. “Need your drivers license and credit card”. \nCheck the name against the card. Name doesn’t match. ”Who’s card is this”? “It’s my boyfriends aunts card” uh ya. You need to have your own card sorry. So she decides to lose her mind cause I won’t go any further. After a few minutes my manager comes out and decides to let it slide. Ok. \nAbout to progress and BANG! “Excuse me ma’am, this drivers license expired 5 years ago”\n“So?, it’s still a drivers license” but it’s not a valid one. So again she goes off on me. \nClearly she can’t understand what my problem is. \nManager again comes over. \nShow him the license, ya there’s nothing we can do about it ma’am. \nLater that day I get a call from regional about this incident. All I said was her license had expired 5 yrs prior, end of story. \nShortly after that I got out of dealing with the public. Some people are just as dumb as the day is long.",
            "Entitled people are ruining this world. Please stop! Or please be stopped!",
            "I would've pulled a Glengarry Glenross and fired back with \"You want my name? FUCK YOU, THAT'S MY NAME!\"",
            "My child's school district has sections like this in their online permission slips for activities.\n\nI've been annoyed enough that they put in things like, if your child is sent home it will be at their expense followed on the next page with it being the parent or guardian expense if the child is sent home.\n\nThen they rub in the fact that the \"contract\" has to be countersigned by an adult because it wouldn't be legal otherwise (without outright stating that fact).\n\nAs a result, when it gets to saying, \"By signing this slip, I agree to the following terms and conditions\" I type in the field marked \"Answer.\" Then in the section verifying the previous statement, it states, \"if you consent, type YOUR NAME\" (Emphasis in the original). So, I consent and type, \"YOUR NAME\" in the following field.\n\nI've never received a complaint from the school district.",
            "You reply that you cannot do that because it violates corporate guidelines on data privacy and refuse.  Simple stuff.\n\nBut that said, I do like your solution.",
            "When I worked at one of the big retail stores as a cashier, when a costumer would ask for my name for a slight that didn't happen, I would tell them my name was Simon Belmont. Both because it was an obscure name at the time, and I looked like a Simon if you didn't know the reference.\n\nThen Smash Bros. Ultimate came out. Had to retire it. Never did find a replacement.",
            "the name accurately describes the employees' daily experience working for them.\n\nSounds like it \"hurts\" to work for them",
            "LPT: Don't do this? wtf? Inform your manager that you won't be giving out your personal info, and they can speak to the manager who will refer the complaint to corporate. This LPT is absolute garbo.",
            "The fact that your boss caved & violated company policy is exactly why these people exist.",
            ">She gave us a horrible survey and it tanked our bonus for that quarter but it was totally worth it to put that rude woman in her place.\n\nAnd that place is the exact vehicle she demanded. Well done, spineless management.",
            "I absolutely hate it when my manager would override company policy and give a customer what they want.  When I do that, I get written up.  When he does that, the customer complains about me, and I get written up.",
            ">totally worth it to put that rude woman in her place.\n\nI totally missed the part of the story where you threw her in the dumpster.\n\nP.S.  And *shame* on your manager, for acquiescing.",
            "> bad review tanked bonus\n\nThat's when you get in touch with corporate and apologize for following their process that left the entitled customer feeling this way.  Let them know that next time you will make sure to break policy and let people rent whatever they want with whatever payment method they have.",
            "Manager should have given everyone the bonus.  It's their fault no one got bonus.",
            "one bad survey killed your bonus?\n\nwow, that’s really living on the edge.",
            "hilarious! but absolutely ridiculous your bonuses are affected by unreasonable karens",
            "Sounds like no one was checking their ego.",
            "my sister kinda did this...it was hertz in nj.....we called them  multipe times leading up to our trip and even visited their their site...it said you can use a credit card and that's it.....she asked for a credit score...we don't have credit scores where I'm from so they refused to rent to us...... we show her we have money....no luck....and we couldn't use debit cards because of some other reason idr ...so my sis make me ask for her name to file a complaint",
            "I would rather tell them I did nothing wrong and not give my name. Hell, I'd be honest and tell them my manager has violated company policy just to satisfy an unruly customer. What are they going to do, report me?",
            "I always just give my stores a 5 stars for everything. I know they’re all working their bums off and retail sucks.",
            "Hey, at least you had a great boss, this could have easily went even worse for you",
            "I get requests like that a lot. I happily oblige them... in my entirely illegible cursive. It's basically a squiqqly line.",
            "Half of me was expecting what you did. The other half was expecting you to get praised by corporate and your manager to get written up.",
            "Who the hell are all these people running around the world paying for things like car rentals w debit cards!? My god I don’t think I’ve ever even used mine outside of at an atm. Don’t they know you have so much more consumer protection by paying w a cc? And if the “debt” bothers you so much you can pay the charge immediately off. I am just blown away at the number of explanation signs in hotels and rental car counters for people paying with debit cards- explaining to them that a certain amount of money will be placed on hold, etc. you just know they get shit on all the time by these dinosaurs that want to use a debit card to pay but freak out if a deposit is withheld until a CAR they’ve rented is safely returned. I mean you might as well be writing checks at that point!",
            ">the name accurately describes the experience of the employees working for them\n\nIt hurttttsss",
            "Those people would be eaten alive in Europe. Unbelievable.",
            "\"the customer is always right\" mentality that businesses ran with decades ago has created an entire generation of Karen's that know if they make a scene they will get their way.",
            "Make sure you hold up company policy until the manager comes in and folds so we all look like fucking clowns. A+ management technique. I swear they must  teach this shit at stupid school.",
            "What a lousy manager. They didn’t back up an employee that was following corporate policy.",
            "> I used to work for a car rental company, I won't say which, but the name accurately describes the employees' daily experience working for them.\n\nhttps://getyarn.io/yarn-clip/c2bad557-07eb-4afd-8e94-a6cdf88aed96",
            ">She gave us a horrible survey and it tanked our bonus for that quarter but it was totally worth it to put that rude woman in her place\n\nAnd this is why bonuses based on those stupid fucking surveys are ridiculous. They marked you down for *following corporate policy* and you lost money because of it. So fucking stupid.",
            "Wow I was on the other side of the counter at ALAMO over the summer and got similar treatment, and it royally sucked ass.\n\nSpecifically, I was camping and picked out a large SUV because I was sleeping in the car during the trip. They say 1. They can't give me a large SUV because of the policy you were ranting about, OP and - here's the kicker - 2. They could *not* refund me the difference between the car they decided I was allowed to have and the one I had already paid for online. This downgrade accounted for about a one thousand dollar difference over the course of the trip.\n\nI don't know if you worked there specifically, but *fuck* Alamo. I rent at the Enterprise near my house now and I have never received *any* bullshit about my debit card. **Fuck** Alamo rental car.",
            "I love this story! It made me laugh out loud, so thank you for the giggles.",
            "Your bonus is vulnerable to Karen’s?  That’s completely out of your hands. \n\n/r/antiwork",
            "“I dealt with a bitch of a customer who insulted me, belittled my work, and ***literally made me lose potential money***, but it’s cool because I didn’t write my name on a piece of paper.”\n\nI hate this story…",
            "You didn't put her in her place tho.  Her Karen act got her exactly what she wanted and then her Karen review actually caused you consequences.  Props on you, boo on the limp dick manager.",
            "Why wouldn’t you be able to use a debit card? I don’t even own a credit card lol",
            "Customers hate this one weird trick!",
            "managers breaking company policy to appease karens is why they exist. same managers that would give you hell for breaking company policy too.",
            "Corporate policy causing you to lose a bonus? Sounds about right.",
            "She got the rental she wanted, dodged policy.\n\nHow exactly was she put in her place?",
            ">She gave us a horrible survey and it tanked our bonus for that quarter but it was totally worth it to put that rude woman in her place.\n\nWas it?  Fuck when customers start to fuck with my money because they suck, I no longer want them as customers.  Firing a customer is a thing.",
            "I love it when your company policy forces you to act in a way that sacrifices your bonus.",
            "> debit cards for rentals because of the large amount of fraudulent transactions associated with them\n\nWhat?  I know this is not the focus of your story, but isn't the whole point of a debit card to check the balance is present before making the transaction, so that there can't be fraud?????",
            "Where did we even get this idea that it's ok for people to know our real names? That's private information. If you have someone's name you can track them down easily these days and do things to them on a personal level. I'll give you my employee number and you can use that yo talk to my manager. You don't get my name.",
            "Weaponized Dad joke FTW!",
            "So... she got what she wanted despite company policy, and you and your staff got shafted on your bonuses.  I don't see a win here...",
            "I have had my own issues with that company.  I had rented a car while mine was being repaired. The garage got my car done earlier than expected.  There was a historic weather event going on close by and no rentals were available.  Since I no longer needed the car, even though I had it reserved for 2 more days, I decided to do the right thing and return it so others could use it and help out during the storms.  I got to the lot 15 minutes before the cut off time and stood in line 20 minutes waiting to be helped. There was only one couple in front of me. Since the 2 staff members saw me there waiting the whole time waiting, I figured they wouldn't charge me the next day but nope. They just told me the charges would be applied to the card on file, clocked the return after the cut off time, and charged me the extra 70 bucks for the next day even though they rented the car right back out due to high demand during the hurricane. \n\nI went as far as to try and file a BBB claim since they refused to refund me the extra day but hurtz/aviz are not members of the BBB in this area.",
            "Hertz!! Lololol…. Priceless OP",
            "Love that your bonus got tanked for essentially following policy. Fuck companies",
            "Your manager made the mistake of helping a piece of shot. You never help a piece of shit because you’ll always get shit on.",
            "Not that I don't appreciate what you did, but let's be honest: You didn't really put her in her place.  She suffered absolutely no consequences for her behavior.\n\nIn reality, people like her should be identified through social media and publicly shamed.  Something tells me your company wouldn't have liked that, though.",
            "How was she put in her place? She got the vehicle she wanted and by tanking your bonus managed to get petty vengeance for her Karen-esq sense of justice.... so what place putting occurred?",
            "Corporate constantly changing policies so that customers get mad and you all lose your bonus feels like this is all done by design?",
            "You lost your bonus over a bogus survey?!? Ouch, that Hertz.",
            "How does a debit card enable fraud anymore than a credit card?\n\nDebit requires funds to be available in the account it debits from, while credit cards don't and support chargebacks. I'm confused.",
            "That company needs to re assign you to marketing the way you named them was clever af",
            "Companies need to stop caving to these miserable entitled jerks. It just validates them and teaches them to continue with this behavior to get what they want. Being treated like garbage iby customers s a huge reason why people don't, and are no longer, choosing to work in the service industry. Then they want to whine that they can't get employees.",
            "People like your manager are why so many of these entitled a*holes exist in the USA.",
            "I once had a woman of color try to hand me sweaty paper money from under her boob.  \n\n\nShe complained that I must be a racist to my boss.  When he started to ask me, I just said it has nothing to do with that, but unless I can make change from my scrotum, I'm not taking that money.",
            "It hertz",
            "Wait. Debit cards are used for fraud a lot? How? Aren't credit cards a lot less safe?",
            "\"My name? Why, it's Geauxfa Kyusef.\"",
            "Hertz. Cause it hurts.",
            "Let me guess- it was HERTZ. Because it literally HERTZ you to have to deal with Karens like her!!",
            "Just give a Joke Name like Mike Oxlong or Patt Maheiney and tell her deadass it's your name, but you forgot your ID at home. If you rope a few coworkers into it, then she'll be greeted with a very awkward compliant to your bosses lmao.",
            "Your bonus tanked because, bottom line, you followed company policy? Hertz hurts.",
            "Put her in her place? How? She got the SUV after screaming at you and being rude AF.",
            "[deleted]",
            "Lol, boss gave her the SUV just because he couldn't be bothered.\n\nYou gave him a good laugh.",
            "I’m sorry you lost your bonus for following the procedures.  I’m also sorry that the procedures kept changing.  Sooo frustrating.",
            "It's hertz.",
            "[deleted]",
            "You should have asked, You want me to write Your Name? \n\nThen put her name on the paper.",
            "I never understand why American's love debit (as opposed to credit) cards so much.",
            "[deleted]",
            "The fact that her bad behavior cost you a bonus is infuriating to me.",
            "Still sounds like she won",
            "So she could rent the vehicle if she used a credit card, but not a debit card.....? And she can have one vehicle but not another? Are you sure you understood your training correctly? It sounds more like YOU might be mistaken. \n\nIf not, your company's policy is stupid and honestly I don't blame your manager for \"giving in\" when she had reserved a vehicle and was ready to pay for it but the company decided not to honor that reservation. People rely on this sort of service.\n\nShe's not \"entitled,\" I would have bitched until I received the vehicle I reserved too. She did nothing wrong as far as I can see. Why the hell would your company force people to have credit cards? I haven't owned one in many years."
        ]
    },
    {
        "post_id": "o7ph0i",
        "author": "AggravatingAccident2",
        "title": "Revenge is a Dish Best Served Small, Adhesive, and Impossible to Remove",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o7ph0i/revenge_is_a_dish_best_served_small_adhesive_and/",
        "score": 18221,
        "num_comments": 594,
        "created_utc": 1624633376.0,
        "selftext": "I just remembered something kind of funny from about 13 years ago. My sister was married to someone I shall call Major Dickhead. The guy was a mooch - he would brag about how much money he made, while hitting you up constantly for “small” loans (the one person I know who gave him a $25k loan never saw that cash again because they were (unfortunately) too nice to sue family). 😡 \n\nAnyway, Major Dickhead got pissed when I wouldn’t loan him $40k and had been punishing me by not letting me see my nephew and niece (Major D wasn’t my nephew’s father but he was my niece’s father, and both still lived in his house). When a truce was arranged by my apologizing as sincerely as John Cleese did in a Fish Called Wanda’s window scene, he allowed me to once again send gifts for birthdays and Christmas but they needed to be arts and crafts type stuff (no electronics). So for my then extremely active 4-year old nephew’s Christmas gift, I included a box of 1,000 stickers. I made sure they were all shapes and sizes, ugly as hell, and (most importantly) that had been down voted because reviewers reported them as being almost impossible to remove. \n\nI hope that fucker still finds those fucking things every so often to this day and thinks of me when he does.",
        "permalink": "/r/MaliciousCompliance/comments/o7ph0i/revenge_is_a_dish_best_served_small_adhesive_and/",
        "comments": [
            "My dad told me once that if you really didn’t like someone and they had kids, get the kids a package of those little green plastic army men.  Those were the original legos in the middle of the night.",
            "Stickers or a toddler's drum kit - 2 gifts for kids when you hate the parents.",
            "Asking any family for a loan that size is insane! Go to a bank!",
            "The first rule of lending to others is that you will never get paid back and you should never lend money that you might need in the future. \nSecond rule: Get everything in WRITING, amounts, interest, payment schedule. Have it signed and notarized.  \nIf you never want to see someone again lend them $100.",
            "Slime, putty, or matching card games with way too many little cards are also good. And 1k piece puzzles.",
            "Mentions 'small' loans then refers to 20k and 40k.\n\nYikes.",
            "I sent someone with triplet girls TWO of Frozen recorders... not only have to listen the the screech of those infernal instruments but also the arguments of who uses them 😂😂",
            "[deleted]",
            "In the 70s, someone gave my little brother giant Tinkertoys. They were made of PVC (or some similar hard plastic). The round connectors were at least 12\" across. The sticks were hollow, made a great whistling sound when swung with full force, and left a helluva welt on your sibling when you hit them with it (by accident or not).\n\nIt was all super fun until someone started screaming.",
            "Who has 40k to loan,hell who has 25k to loan?",
            "Orbees, those little rubber bands for making bracelets, and the plastic round beads that the kids are supposed to put on a peg grid and use an iron to fuse into a shape: essentially, anything with a billion tiny plastic pieces is a long term headache. My daughter is 13 and the house still occasionally coughs up some more of these horrid things.",
            "Next time send them something that involves glitter.  It is the herpes of the arts and crafts world.  Once you have glitter in your home in the hands of a child you will never, ever get rid of it.",
            "Bopit-Extreme was a great toy back in the day, to give to someone specifically to annoy the parents to the point of insanity",
            "Next time, send Legos and teach the kids to leave them everywhere on the floor!",
            "Stickers were a good choice.  I gave my 7 year old niece a megaphone for x-mas this year, lol.  I wasn't mad at my brother or sister-in-law, I just thought it was funny",
            "Slime is banned in most parents houses I know. It gets everywhere, stains and is horrible. \n\nWe often gift it!",
            "Jesus fucking christ a 40k loan?",
            "I will say kinetic sand is a brutal gift for parents, that stuff ends up all over the house",
            "Hahaha sucked in loser. That's what he gets for being a dick",
            "That. Is. Hilarious.",
            "Done this myself.  Glitter kits, nerf guns, water guns, paint, stickers etc...  Also hoping something as life destroying as what is currently happening to the father of these kids I gave the gifts to is happening/happened to this dude.  Sounds like a real grade A assclown...",
            "My mom and aunt took turns gifting us kids stickers, stamps, paint sets, and calligraphy kits. The only reason Mom took us to Toys-R-Us was so we could zero in on the noisiest or messiest gifts for our cousins.",
            "In the same spirit, I bought my seven year old niece a high quality Tama drum set. To be fair, when her father was seven, I bought him a three quarter scale Les Paul electric guitar.",
            "No one f#@ks you like family.",
            "Should've thrown in a container of super fine glitter",
            "Packets of wooden whistles work well too. Bought them for my friends 2 sons when we all went to a local show (probably a county fair in the US. Rides, side shows, animals etc). Their mother, who I've known 30yrs was just soooo happy",
            "$25k is a small loan?",
            "Who the fuck has that kind of money to “lend”? I can spot you a $20, but that’s about it.",
            "Wait wait...25k is a small loan?",
            "Who the hell doesn’t allow an uncle to send a gift to their niblings?\n\nAnd what kind of sister lets that stand?  \n\n#freethebirthdaypresents \n\nI’d fuck with him and put $100 into a educational trust for each kid, and send the certificates.",
            "Take the next opportunity to find and purchase the jumbo set of doll accessories. A thousand tiny high heel shoes, handbags and whatever. All over the house, car... Hours of fun! And the joy of stepping on them is about the same as stepping on Lego.",
            "The highest evil is toy weapons for siblings, especially ones that don't get along well.",
            "John Cleese window scene - so perfect. Thanks for a smile!",
            "How the hell do people feel comfortable asking for that much money??? My dad helped me buy a car when my son was born in 2018. He was willing to get me something modern but I felt awful taking that money so I got a 2007 lol.",
            "I accidentally did that to my best friend.  I didn't know what to get my first god child for her 3rd birthday.  BF said that she liked stickers/art supplies. I bought her the 5000 count sticker book. They found them on the tv, the dishes, in the dvd player, in the carpet...",
            "Take my upvote for a great title to this post",
            "I'm the weird parent that has bought my kids all the most hated by parents toys. Only occasionally do they go to the realm of mom has had enough for the day (aka top of the fridge). We just don't allow playdoh or slime. Even glitter is more welcome.",
            "Upvote for making me look up the John Cleese window apology.",
            "Now do glitter",
            "Who ask for that kinda Money? Is this a white suburban shit? I think if someone ever asked me for that kinda Money, I cuss them out and cut them out of my life. I'd only care if it was a medical emergency. But I'd probably still not give that kind of money away",
            "I offer a complete and utter retraction. The imputation was totally without basis in fact, and was in no way fair comment, and was motivated purely by malice, and I deeply regret any distress that my comments may have caused you, or your family, and I hereby undertake not to repeat any such slander at any time in the future.",
            "Stick it to-em!",
            "Major, you revenge is served.",
            "Play doh. Lots of Play doh.",
            "This comment section if hilarious",
            "OP forgot to send tin whistles!  (See: *Roughing It* by Mark Twain)",
            "Really want to annoy a parent? Give their child one of the newer style Disney character Barbies or similar dolls. They sing the same 1-3 catchphrases or hooks incessantly. \n\nYou will never forget the intro to Moana again.",
            "Whats it like having the potential to loan somebody 40k?",
            "That is just.... marvelous.  I am so proud of you OP",
            "For her 2nd birthday I gave my niece a toy \"microphone\" that played \"Let It Go\" when she pressed a button. She's 8 now and my sister and brother-in-law still haven't forgiven me. \\*chuckle\\*",
            "If that relative that loaned him 25k doesn’t expect to see it again, they should report that loan to the IRS so they come and tax it. That would be a good piece of revenge",
            "i've been wanting to get a mega pack of those temporary tattoos and cover my granddaughters with them. every inch of visible skin including the face and then tell the dad \"this is how they are gonna look in a few years if you keep up with this crappy parenting method you are using\"",
            "B-e-a-utiful. I cackled.",
            "I'm commenting before even reading because this title is EXCELLENT.  I don't even need to know the context, it's perfect.",
            "Got a link to those stickers?",
            "I love a fish called Wanda, great reference!",
            "Slime... Goo... Whatever that sticky slimy thing.. \nMy kids love them with a passion.\nI hate it with extreme passion.\nCant get it off that easily..",
            "My dad and his brother in-law (my uncle, his sister’s husband) don’t get along. One year for Christmas as a young child I received a set of blocks from my uncle & aunty.\n\nMy father being unimpressed with having to pick them up after me decided that he could top that and proceeded to put all the blocks through the bandsaw making the blocks much more and smaller and repaint them. \n\nMy dad then gave them to one of their kids the next Christmas. I recall him chuckling about how they would have been a bigger nuisance to my uncle than the original version of the gift.",
            "Accordion, drums, armonica, whistles, tamborine, etc... All good presents.",
            "Coworkers at a past job hated it when I got my hands on stickers at work, because I would place them *everywhere* (although it did help find a missing server at one point).\n\nTo retaliate, one coworker got a mini cat stamp and would stamp my papers, but discretely, so I would still find stamp prints months after he stopped.\n\nOf course, for us, it was harmless office pranks.",
            "Small loans you say?! 40k?!",
            "When my (then) kindergartener was invited to a birthday party *the day of the party* (and she could read so she knew exactly what the invitation said)... I bought a book of 1000 stickers for the birthday girl. \n\nNowadays I like to go with slime.",
            "Someone needs to receive a glitter bomb",
            "Instruments also make great gifts, especially saxophones and drum sets. Just saying.",
            "Goddamn I wish that 25k was a \"small\" amount of money to me.",
            "Paper backed stickers are a crime against humanity and should be banned worldwide.",
            "Best. Gift. Ever.",
            "Many years ago I gave my cousin’s (now 40 year old - then maybe five) daughter play doh as a gift. I didn’t know - I was a teenager. She (the mom) promised that she would enact revenge on me when I had my own kids and - she did! Play doh all over the house.",
            "Jester is cackling",
            "Only a thousand?",
            "40k? Geez do you have that much to lend? Can I borrow some money?",
            "omfg this title",
            "Are we using 'downvoted' to describe negative product reviews now?",
            "I once tossed 3 kazoos into the back seat of my cousin's minivan at a family gathering. Right before a 3 hour drive home. We still hear stories about it now and again 15 years later. He still doesn't know it was me. Lol",
            "Aka: murder",
            "Beads. You know, to make bracelets and such. The smaller the better.",
            "OP, might I offer a suggestion for your next gift: a 1990's Glitterator. We legitimately had to buy a new washing machine years later before things stopped having shiny specks on them.",
            "My brother in law would annoy the shit out my kids and make the cry all the time.  But he was the fun uncle so they would go back for more...  finally got even when his kid was 2 I got her a baby doll that she loved.  When you put it down it would cry.  Soooo had a tech buddy rewire it to make it louder added a lithium battery and permanently sealed the fucker ....  when they tried taking it from her she threw a tantrum worse than the doll.  Gotcha MF...",
            "You are genuinely evil and have my complete respect. This is diabolical.",
            "Good, drums might be better, whistles are reported to cause parental madness.",
            "Paint ball guns and cosmetic kits for my nieces and nephews,  sadly was stopped from buying rocket models with real engines.",
            "who the hell apologizes to someone when they get mad you won't lend them 40k??????",
            "If you need some more [revenge gifts ideas](https://www.giftideageek.com/sweet-revenge-gifts/). May I recommend the magnetic bumper stickers, never-ending Happy Birthday music card, or the Hot Men Pouring Milk On Themselves prank DVD? The more anonymous you can send these, the better.",
            "So how is this n s f w ? Cool story funny",
            "Did you ever get to see them?",
            "This is beautiful!",
            "You said this happened a while ago, did things get any better with the Major? Preferably with him getting kicked to the curb? Hope you get to have a relationship with your niece and nephew now",
            "I love the idea of this turd finding a random sticker now and again and thinking if you as he is scraping it off with a butter knife.  Very well played!",
            "Give xylophones, the gift that keeps on giving.  Drives parents crazy.",
            "daaaam",
            "I dream of being this petty. I salute you.",
            "MC is good, but I loved the Fish Called Wanda Reference! Great movie.",
            "Recorders",
            "Does anyone remember those shrill candy whistles? I think they even had a plunger to change the ear piercing tone? I can’t believe my mom used to buy those for us before any car ride. Lol",
            "Try musical instruments next.",
            "Bicycle horn for the noise  irritation and Lincoln logs to leave in floor for the early morning cold bare foot to step on in early morning hours- I grin just thinking about that instant pain to that jerk!",
            "IMO this sounds more like petty revenge and not malicious. That said stickers are a bitch to remove.",
            "I used to have problems with people borrowing money. Loaning money to people you know can be a big problem. They generally won't pay you back. If it's someone I'd like to not see again and it's a small amount, I'll \"loan\" it to them knowing full well that I'm just paying them to leave and not contact me again for years. If it's a large amount I've found a way to stop that shit cold. I'm always super happy to loan money. I ask them how much then I grab a notebook. I start talking about monthly payments, interest rate (which will be higher than the bank), and collateral. I've had no completed loans since I've started this policy. They just want free money. It's just nice to force them to admit it",
            "something really noisy and annoying would do the trick. even mechanical toys make a lot of noise.",
            "How is this malicious compliance? Did he ask you for a nice present for his is kid and you obliged?",
            "My aunt gifted us the play doh barber shop as children.  The next holiday my mother gave her five children the drum full of instruments.  Truce.\n\nMy husband's family gave my child glitter, I gave theirs a travel lite bright..  They gave us a massive set of tiny beads and strings, I gave them an airbrush tattoo set.  They gave their own child a Baby Alive.  I quit.  Those crazy bastards nuked themselves!"
        ]
    },
    {
        "post_id": "8vfesu",
        "author": "witwats",
        "title": "\"But you said I could...\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8vfesu/but_you_said_i_could/",
        "score": 18221,
        "num_comments": 415,
        "created_utc": 1530501009.0,
        "selftext": "Crosspost from r/prorevenge\n\nDoing collections that, occasionally involved speaking with businesses about past due accounts.\n\nTheir main tactic was postponment and delay, of any kind. Negotiations could drag on for months, even if you were speaking to the principal payee or their lawyer.\n\nI would fax important paperwork, receive a fax confirmation and yet, somehow, they \"didn't receive it\". \"Oh, gee, sorry. Can you refax?\"\n\nMy response was to apologise for the confusion, and ask them if it was ok for me to continue to re-fax the paperwork until they finally received a copy.\n\nI would always receive a smug \"Sure!\" from them because they had no intention of acknowledging receipt and planned on simply throwing the fax away.\n\nSo they thought...........\n\nI would make three copies of the bill, tape them end to end, feed the first copy into the fax and, as the top came out, quickly tape it to the bottom of the third copy, making an endless loop for faxing.\n\nWithin the hour, I would receive a call screaming obscenities about their jammed fax machine and how much trouble I was in.\n\nMy response was \"So you acknowledge receipt of my fax?\"\n\n\"But, but, but, but.......\"\n\n\"Sorry, you said I could.\"",
        "permalink": "/r/MaliciousCompliance/comments/8vfesu/but_you_said_i_could/",
        "comments": [
            "Fax of death.  Back in the day when actual faxes were a thing, I had a rig of five jet-black sheets that I could tape together and send. My machine had a high transmit buffer, 2000 pages equivalent, and if I got a spam fax, out goes that.",
            "This may be my favorite MC of all time",
            "I might steal this idea...",
            "There are email fax services now.  You just send an email to an address that contains the phone number, and it gets faxed to that number.  No paper loop needed.  Set up a script that does the same thing; your end will never get jammed.",
            "There is a special place in hell reserved for companies that use bullshit tactics like saying they “never received the invoice” to delay or not pay on time. And that place is right next to Adolf’s exposed anus as he is being force fed laxatives.\n\nIF YOU USE A SERVICE, PAY FOR THE GOD DAMN SERVICE.",
            "We would do the same thing but we would use all black sheets of paper on the fax numbers of companies that wouldn't take us off their 'advertise by fax' list. Quite effective. ",
            "Diabolical. I like it. Perhaps a bit too much.",
            "Hard to keep all the pro petty and malicious revenge straight these days.",
            "Holy shit this is pro as fuck. This story is def my fav MC right here.",
            "I knew someone that did this with invoices for problem clients! He would wait until Friday evening to start! So it would use up all of their fax supplies over the weekend.",
            "This is so, so, so deliciously evil. My God do I hate fax machines for this very reason, but you OP, have given me new hope.",
            "The old timey version of a DDoS.",
            "I want to print out \"meat spin\" frame by frame, tape it into a loop and fax it to someone for a week straight.",
            "Someone beat you to it and posted this an hour ago.",
            "HAHAHAHAHA That's exactly what my dad had told me to do back in 2002 when an insurance company that owed him money always claimed they never received his fax! So I do that, and few days later, whats that in the mail but a check from the insurance company.",
            "I don't understand how this would work.     The fax has to scan all the pages first, store it in memory, dial the phone number, transmit the data.    If the fax machine is continuously pulling in the looped paper when does it ever stop to send the data?   ",
            "2 words: Stack feed    \nWorked with one that could hold 4000 pages. \"Oh, its getting a bit low, time to top that shit up\"",
            "Gotta love it when some asshole runs into an even bigger asshole, in this case a justified one.",
            "[Beautiful](https://media1.tenor.com/images/30faf1f0732bec0c7bf4e911ecd364f5/tenor.gif?itemid=7639090)",
            "You could do that with black paper taped together, faxed after hours. printer ink will be wiped out in no time.",
            "[deleted]",
            "As someone who has to try and collect late payments, and also has to deal with faxing, this is so satisfying",
            "Wish I’d known this 20 years ago! I’d have f*cked up a few offices. Office supplies cost way up, lol.",
            "Genius!",
            "You're a genie with that machine.\n\nI approve.",
            "Modern day equivalent would be an email loop.  ",
            "Would give 10k upvotes if I could.  Pure vengeance.",
            "This is next level. :-D\n\nHow much did it cost you?",
            "that's fucking awesome ",
            "This is a thing of beauty",
            "Well shit. I wonder why we never thought of that?",
            "discovered this sub today, and this post is by far my favorite LMAO",
            "The original text bomb haha",
            "Yeah I'm gonna have to go ahead and call bullshit on this one. Unless someone can confirm that fax machines allow sending the fax before it's done copying.  ",
            "How long ago was this?",
            "It took me too long to get around the misuse of the commas. I physically could not understand the sentences because the commas were too distracting. Must be some kind of OCD thing, I should get my head checked.",
            "[deleted]",
            "[deleted]",
            "Great job."
        ]
    },
    {
        "post_id": "sni985",
        "author": "howmanyapples42",
        "title": "Refuse to pay me for piano lessons? Okay, I’ll count every minute and charge accordingly…",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/sni985/refuse_to_pay_me_for_piano_lessons_okay_ill_count/",
        "score": 18204,
        "num_comments": 293,
        "created_utc": 1644320595.0,
        "selftext": "When I was 14, I was qualified fully in my country in a piano-playing performance qualification. I had worked really hard for this and was so proud, my parents too. I was too young to join paid orchestras (and they didn’t exist near me) so instead I handed out business cards to residents nearby in a fairly wealthy area and thought I could make some money teaching after school. Teachers in the area were charging €20 per half-hour so I charged €17 because of my age (edit: and *lack of experience* since someone got their knickers in a twist) and got very lucky that a few mums caught on and switched to me instead.\n\nI quickly had 4-5 kids/adults to teach every single weeknight in an area I could bike around. This was roughly €400 every single week due to fluctuations of people cancelling and so on. An hour’s lesson was 50 min with a short water break and explanation of homework at the end. A half hour lesson was 25 min with explanation and homework at the end. I made all of this very clear and learned it was necessary through time to walk people carefully through homework and exam prep. \n\nThese parents paid 10 lessons in advance every time, and I kept a calendar and updated parents weekly on where they were at. One parent would always ask for a full summary of all 10 weeks for all 3 of her kids and I was happy to provide it.\n\nSuddenly one week she decided she didn’t owe me money for the next 10 lessons until I had “made up for lost time.” I was obviously very confused and asked her what she meant. She cited the reason that I cut 5 minutes off every 30 minutes and 10 minutes off every hour so I should teach that extra time before getting more money. \n\nHere’s the real kicker: her kids were horribly behaved. They were easily the most spoiled entitled kids I taught and often said things like “since we pay you, don’t YOU work for ME?” They were ages 6-11. She had also referred me to a lot of other parents so I was concerned about my jobs. Because her kids behaved badly and didn’t do homework I ALWAYS spent extra time on them, 5-10 min per week because they needed it. \n\nBut ok SURE, you want me to work that time? NO PROBLEM. So I decided to tell this mother from now on I would set a timer and charge every minute on that timer and show her when I clicked it on and off, and gave a huge apology.\n\nYou can imagine her shock at the end of the ten weeks when she saw that the kids combined 30 hours was actually more like 36-37 that she had to pay. She never bothered me about timing ever again and rushed through every homework or exam prep explanation getting me out of the door :D\n\nTL;DR - mum got what she deserved questioning the time I was teaching her kids when in fact I had been most generous with them. I made her pay all the hours with a timer.",
        "permalink": "/r/MaliciousCompliance/comments/sni985/refuse_to_pay_me_for_piano_lessons_okay_ill_count/",
        "comments": [
            "I can't imagine why her kids were so horrible.\n\nMonkey see, monkey do.",
            "Love that she thought you were responsible and intelligent enough to teach her children a skill, but not keep proper time 😂",
            "At age 14 amazing. How old are you now and do you still play piano?",
            "[deleted]",
            "You at 14: “so I ran a small teaching business well enough to maliciously comply somebody into submission”.\n\nMe at 29: “hey, let’s be 10 minutes late to an online rehearsal!”\n\nI’m impressed with your work ethic, as I’m sure it’s brought you much success and many blessings since then.",
            "I bill by the hour in my profession, too. I find it's always the clients who get the most who feel they get the least. Odd phenomenon.",
            "Glorious",
            "[fuck u spez] -- mass edited with redact.dev",
            "Mad props for being 14 and\n\n1) being good enough to teach piano\n\n2) being smart enough to hand out cards to the rich\n\n3) for the timer thing",
            "Love it! You are not merely a genius in the music department apparently.",
            "Well done on you. Nothing like young people putting entitled parents and brats in their places!",
            "We gotta cut the shit with extorting kids trying to make money. As an adult seeing it (and realized it was done to me when I was young), I hate it.",
            "It's always sunny when you have them by the balls and they think they have you over a barrel",
            "Very impressive that you were able to stand up for yourself in such a positive way at the age of 14!",
            "You already know how to deal with Karens at age 14? You’re gonna know how to carry yourself just fine. You’ll do great in life.",
            "HAppens pretty often. My customers don't understand the little stuff I do for them that I don't account for. I had one start saying stuff like \"We were only on the phone for 10 minutes!\" when I had 20 minutes of work to complete it after we hung up. He wasn't happy with my explanation. So I just woulnd't do any work for him unless he was currently on the phone. If he had to take another call I'd tell him we'd have to finish things when he was available again. I refuse to do any work for him after hours because he got shitty with my boss about the after-hours rate. \"I shouldn't have to pay more to not have my system down in the middle of the day!\". Fine, that's no longer an option.\n\nWish I could say that he learned his lesson, he apologized, people clapped. Instead nothing ever works anymore and dealing with him is still awful because every call starts out with an accusing \"THIS NEVER WORKS RIGHT!\". Sorry that paying me for 15 minutes of my time only gets you 15 minutes of my time.",
            "It’s people like this where you have to talk dumb and say “I charge 17 euro for 50 minutes”.",
            "I tutor on the side in one hour blocks.  I had one student that regularly took about 65-70 minutes, but I let it slide.  \n\nThen one day after 55 minutes I had nothing left to explain so I decided to end a bit early.   Parents decided to prorate my pay.    This was not huge savings for them, I don’t charge that much, so I’m not sure why they thought this was a good plan.  \n\nI never went a minute above 60 with that kid ever again.   If we were mid problem I would start wrapping up with two minutes left and tell them they could book another session if they were still in need of assistance.",
            "On another note, my kid’s piano teacher asked for 4 payments in advance then promptly ghosted us. (After she was our teacher for about a year) “ I have Covid. I have Covid a second time. My car can’t handle the 2 inches of snow. Someone I know has Covid and I was around them for one second”.  \nShe said she would pay us back in a couple of weeks but I have a sneaking suspicion I’m never going to see that money again. What’s your professional opinion?",
            "The irony of accusing a piano teacher of not keeping time…",
            "I need to live in a country where 14 year olds have so little homework that they can work for several hours on weeknights",
            "Damn, that's petty going after a 14 year old.",
            "Entitled b#÷!&* thought she could treat you that way because you were a kid/teen.\nGood for you on showing her some manners.",
            "A great life lesson for me was when I missed two separate lessons of a class I was taking in a music discipline. The teacher very nicely and calmly told me 'You no longer get to learn'. It is really easy to overlook teachers and the fact that learning is a privilege. So it is here; you should simply have taken the privilege away from them.",
            ">Here’s the real kicker: her kids were horribly behaved.\n\nShocked to hear that. /s",
            "Young I know, but when the people start to quibble about nickels and dimes (or the Euro equivalent) It is time to cut them loose and move on.  Misbehavior and entitlement in children is another red flag for having them find another teacher.",
            "I've totally done the same thing with a few students. I would always undercharge because I'm a nice guy and would account for bathroom breaks and extraneous conversations and stuff. Some of my coworkers would charge for absolutely every second the student was within 100 feet of them.\n\nThe few times students complained, (which I don't understand because I was obviously undercharging) I was more than happy to pull out the timer.",
            "That's a ridiculous amount of money to be earning at that age! Good job!",
            "Ah, entitlement karma......",
            "It’s this weird Karen like need to be confrontational because if they don’t, they feel like they’re being taken advantage of.  I can smell this kind of customer a mile away in my line of work, and like you I’m very upfront with them about what I’ll be doing and what they’ll be charged for.  99% of the time they’re fucking themselves over because I typically go above and beyond for the sake of reputation and tips.",
            "14 year old you is probably cooler than current you",
            "I gotta say, you were a bad ass 14 year old. Curious, what do you do now?",
            "Love it! Always fun how surprised people are by how much work goes into teaching.",
            "Wait how many people have pianos laying around without the ability to play them?",
            "It's usually the worst behaved that you have the most trouble getting money out of. 20 years of providing software services has taught me that. Sometimes it's better to just cut them off and work with the good ones.",
            "A pro musician that can’t keep time? \n\nYou were just on rubato time the whole way they thought.",
            "That was sharp",
            "Tbh I would have just walked out with two middle fingers in the air.\n\nBut I guess the money gutted her more. Gotta remember that if I ever came into a similar situation.",
            "Brilliant",
            "good for you",
            "Good earnings at 14! Very impressive.",
            "You're a really talented person. Wish you all the best",
            "How long ago was this? 17 Euros is more than what Canada DOJ is willing to pay fresh grad lawyers",
            "Holy shit",
            "Play stupid games, win stupid prizes.",
            "For anyone who needs to hear this, do NOT set your compensation based on your age, ever.\n\nSet it based on your skill and experience level.\n\nI learned it the hard way by not asking for what I deserved when I was younger.",
            "Haha brilliant! This is perfect Malicious Compliance.",
            "Something I learned from my sister who also tutors music students. When you're selling your time don't give a discount--if you can charge a little more than market do it.",
            "[removed]",
            "just like how Komi's mom and dad now.",
            "I’ve learned to fire those clients immediately.",
            "Sometimes clients need to be fired",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "I'm surprised you went on teaching them with thier attitude. Did you have a contract of some sort?",
            "so get paid for that extra time?",
            "I just want to say well done to you OP. You managed your business with respect for yourself and for your client. Excellent."
        ]
    },
    {
        "post_id": "d09jf0",
        "author": "zenetx",
        "title": "I don't care if you're sick, if you don't attend the final exam you'll fail the subject.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d09jf0/i_dont_care_if_youre_sick_if_you_dont_attend_the/",
        "score": 18185,
        "num_comments": 581,
        "created_utc": 1567731335.0,
        "selftext": " This story happened to me in my college days many years ago and to this day, whenever I remember it, I let out a smile.\n\n I graduated in a traditional and very strict engineering school.  At that time, there were not substitutive exams of any kind, no matter the reason. So it wasn't uncommon for people to fail subjects because they couldn't attend the test day.\n\nIn the end of my last year, I don't know how or why - since  I took the vaccine - I got chickenpox. Luckily for me I didn't suffer at all, maybe a day with mild fever and that's it.  All the itching was completely mitigated with medicine. Although externally I looked really bad.\n\nMore concerned about my appearance than anything, I called and asked If I could take my exam another day. The lady who answered it immediately denied my request, as expected. Then, being as patient and kind as possible, I tried to explain my situation, but she was very rude and cut my explanation short, not letting me even say what my illness was. As a last attempt I asked if at least I could take the exam in a separate classroom. Then she told me to wait on the line.. I heard some people talking in the backgroud and laughing, after she left me hanging for more than ten minutes, she comes back just to say that there is no way. So I thanked her and hung up.\n\nI don't really know what heck they expected, that I didn't come and failed my very last test? Hell no. So I went.. looking absolutely hideous, not a square inch of my skin didn't have a mad hash, including my face.\n\nIn the class, after the monitor arrives, he told me to remove my sunglasses and cap, as per regulations, and so I did, including my jacket and medical face mask. Oh boy, I'll never forget his facial expression. And then my fun begins, during the test I start to fake cough like a man about to die. Getting really good on my act, was really amusing seeing the monitor's reaction going from little apprehension to total panic, until he gave up and left, leaving the class unattended!\n\nBarely able to hold my bursting laugh at this point, my  colleague who got what was going on, look at me also holding his laugh and shaking his head.\n\nIn the end I did pretty well on the exam and had my fun, including paying a visit to the lady who left me haging. Later on, after graduation,  I found out through a friend that I became sort of a famous joke, like the guy who came back from the dead to attend his exam.",
        "permalink": "/r/MaliciousCompliance/comments/d09jf0/i_dont_care_if_youre_sick_if_you_dont_attend_the/",
        "comments": [
            "I had something similar to this but with a job back when I was 18/19\n\nI was working at an electronics store in the city centre and this place was what one would call a flagship store so it was extremely busy all the time all day long.\n\nAnyway so I suffer from asthma and every winter there's a high chance of me getting a broncular infection and one day im told to work on the shop floor by the door during last week of November and I tell my manager I can't do that cause I'll get sick as I have my stuff.\n\nObviously he doesn't believe me so I'm at the front of the store with doors open all day and finish my shift as per usual. Go off for the weekend and sure as expected I get my thing going.\n\nMonday morning i call in and explain I'm sick and that I have the infection I've been to the doctor and been prescribed antibiotics.\n\nMy manager of course the total wanker he is doesn't believe me and says that I have to come in now. So I say no problem I'll come in.\n\nNow lemme tell you this kind of illness is no joke you basically can't breath you're sweating constantly and coughing non stop it makes it look like you're suffering from the black plague.\n\nSo I get to the store go to the manager and say look I'm really sick are you sure you want me to do this, he still thinks I'm faking or exaggerating.\n\nSo I go out on my uniform head downstairs to the tech department and sure enough in a few mins I get a customer approach me to ask about setting up a baby camera above her crib that's wireless \n\nAs I started to reply to her I started to cough uncontrollable and you know how it is with phlegm and stuff I had to get rid of everything into a tissue well roll of tissues, she immediately calls the manager and asks what the fuck I'm doing st work in this state. She's a Dr and tells me to leave work immediately Infront of my manager \n\nHe of course has the most red face you can imagine and agreed, next day I went to my doctor and was told because of further stressing my system I need to be off work for at least 6 weeks and that's how I got a paid work vacation through that entire Christmas period.\n\nFelt bad for the co-workers but employers and people in charge need to not fuck around when people tell them they are ill. It's fucking reckless and dangerous tbh.\n\nExcuse formatting I'm on mobile",
            "back when i was studying for my Preschool teachers license , I was doing my internship at one of the city daycares. We had the kids out walking one day and i took a nose dive off a curb. Tore my hand up pretty good on the road to the point i had blood running down my arm. (try hiding blood from 20 five yr olds! lol)  I wanted to go to the dr and asked the supervising teachers if I could leave but was told flat no.  I had to stay or be written up which would have affected my grade. \n\nSo I stayed the rest of the day with my hand wrapped in a towel.  Got home and my brother took me to the town ER . It took them 2 HOURS to painstakingly pick all the gravel and grit out of my hand and scrub the dirt out. \n\nShowed up the next day with my hand in a soft cast and my supervising teacher snidely said - oh going for the dramatic effect are we? I glared at her and said no the ER dr wrapped my hand after spending hours there whilst he picked crap out of my hand! \n\nThe look on her face was priceless! and Yes! I went to the director and told her what happened. The teacher herself got written up!",
            "I got chickenpox while in college also. The looking hideous part is absolutely true. Unfortunately for me the school and my dorm master took notice and basically quarantined me in my room until at least the infectious phase was past. It took a while for all the spots and scars to disappear/heal. Sucky thing was no matter what appeal I made, my math lecturer wouldn't give me a pass on medical grounds so I entered engineering a year late. I seriously think it changed my career path drastically; I spent my catch up year taking physics and astronomy and math then later quit engineering and took astronomy. So much happier thanks to chicken pox.",
            "> including paying a visit to the lady who left me hanging\n\nHope you insisted on shaking her hand (or giving her a peck on both cheeks, if that's the custom where you live).",
            "[deleted]",
            "Nice! I once walked clear across campus to take a final when I had a fever of 105 and was hallucinating. But other than the sweating (in the middle of winter) I don’t think most people could tell. Visible signs would be way more fun I think!",
            "After about 15 years into my banking career, I took a step back from management to be home more with my young children.  \n\nI stepped into a job as a floater, and because of my experience I could be asked to be  Teller, a CSR or even a manger to cover vacations and such.\n\nImportant, due to the structure of supervising \"floaters\" my new supervisor waa pretty much my equal, meaning She had VERY little authority over me. She was the typical bitch manager. She would do anything to wield her \"power\" \n\nI had an a very clean attandace record, as well as other performance accolades.\n\nI got Pink eye from one of my kids and was supposed to work as a Teller that day. Eye weaping infection, exposing customers, touching their money and documents.  If you've ever had Pink eye, it's not only uncomfortable, but highly contagious! Especially when working with the public! \n\nI called and said \"I'd be happy to come to work, but don't think that it is prudent for me to be a Teller(she was also Teller trained, who could have easily switched responsibilities for the day) \n\nShe said she'd write me up if I didn't come in as  a Teller, so I did!\n\nEvery single customer looked at my seeping eyes and said, you shouldn't be here! Not only does it look like you are in pain, but you look contagious, which I was!\n\nShe got put in her place after being called out for her \"power\" move! \n\nIt sucked to go through, but she got her due!",
            "I would have pulled a zombie move, slowly slump to the teacher, hug them while wheezing cries for help, and puke all over them.",
            "I had to take a nursing exam while having a lung infection. No making up exams at all. \n\nSo I coughed so hard that I threw up all over the table. \n\nBefore I threw up, I was hacking probably every 30 seconds or so. Really loudly. Sucks for everyone else cause I’m sure it was impossible to concentrate with how loud it was but 🤷‍♀️",
            "These sorts of malicious compliance are among my favourite, i can see why you still find this funny",
            "\"Well you told me I couldn't reschedule, so if anyone else gets sick, you have no one to blame but yourselves.\" What a shitty policy.",
            "Sounds like the shit policies in place at the crap university I went to.  I don't actually remember finals week of spring semester my Junior year.  Or honestly much of the week before.  I had pinkeye in both eyes, laryngitis, an upper respiratory infection, and an ear infection in one ear.  The meds only really kicked in Wednesday evening/Thursday morning (thank god because I had a flight to China literally the friday of that week and I really didn't want to miss that trip). \n\nHell, I had GI problems that would flare up and make me extremely sick but I couldn't get documentation from the \"nurse\" on campus because she couldn't write sick notes.  Even when you were obviously not okay to go to class (hence me going to class with ever-compounding illnesses in the above paragraph, those started with a bad cold.)  I had to run out of more than one class to puke up my guts because I didn't want to have to disclose my medical history to profs who wouldn't let me make up work.  So I'd show up half dead.",
            "In college I got horribly sick for about 3 days and since I was one of 4 kids in the class the professor just pushed back the exam until I was healthy. Everyone else did great because they got to finish all their other exams then study exclusively for that one while I puked or tried not to puke for days. Even when I took the test my fever was so hot I was dripping sweat even in the cold basement dungeon we had to use as a classroom",
            "Happened to me with a dentist appointment for my then 5 year old. He was throwing up sick on the day of, but when I called to reschedule, I was told I would be changed a $100 no show fee. So I said we were coming. \n\nMy son threw up in the lobby trashcan, and we were asked to leave, free of charge.",
            "Not a physical illness, but definitely poor mental health. I had to take a test in my 200 level psych class the afternoon of Sept 11, 2001.   Anyone who didn't show up couldn't make it up.",
            "At least it wasn’t your parents. \n\nSo usually they’d send me to school when sick as I used to get a lot of sinus infections (wait I still do, currently have one...) but this time was different. \n\nMy chest felt full, I could barely sit up or move. They sent me anyway, so I went to the office each class and slept in the nurses’ office. They asked if I wanted to call home and I said yeah, but my folks won’t get me. \n\nThen after school I went to winter drum line practice and again slept in an office the whole time. \n\nFinally I get home and my parents must have took pity on me and took me to the ER, where we find out I have pneumonia. \n\nWorst part? It was my fuckin’ 16th birthday.",
            "Last semester, I got hit by a car on my bike three hours before a final. Tried to get out of it, prof ignored my email, and instead asked me in the middle of the exam if I was alright to take it and if I wanted to reschedule. I looked her dead in the eye and said \"you're going to make the makeup harder, so no, I don't.\" I failed the final but passed the class with a B, as in what a Bitch my prof was",
            "I have a similar story\n\nIn college there was one semester where I was sick for basically the entire semester (two different illnesses both hit at the same time, one with an obvious rash, the other made me white as a sheet and look like death)\n\nI had one class where we had 3 exams and a final, and we could drop one of the exams. My illness hit early on in the semester, but I had been to a few of the early classes so I got about a B on the first test. Second test, not so much. I scored a solid F. At this point I'm still holding out hope that I'll recover and that will be my worst grade and I'll drop that one.\n\nThird test rolls around and I'm in worse shape than ever. I emailed the professor to let him know my situation, that I've been sick since the first exam and see if I can take a make up exam. He says no make up exams allowed, but don't worry, you can just drop this one. I tell him I really can't drop this one because I need to drop the exam that I *already* failed, but he says sorry, only one drop, and no makeups.\n\nSo I figured I can't do worse than last time, right? Show up to the exam looking like absolute death. I'm ehausted because the pain and itchyness had been keeping me up so in addition to my extra-pale face and red rash I've got dark circles under my eyes.\n\nHe's handing out exams at the front of the lecture hall. Now, I had not spoken to him in person so I doubt he knew my name at that point, but the second he saw me I'm sure he knew that I was the one who had emailed him. His eyes got wide and he looked like he had seen a ghost.\n\nI take the exam, getting side-eye glances from the professor the entire time. Ended up scoring an even worse F than last time.\n\nShortly after that exam, I get on the right medications and start making up the work in all my classes. Studied my ass off for the final exam in this class since it's my only chance of even passing. I ended up with a 97 on the final. Calculated my grade and figured I'd end up with a B-/B in the class.\n\nGrades come out. I have an A-. Guess I made enough of an impression that he dropped both exams!",
            "I had a bad flu during an engineering exam and had a bloody nose. Accidentally let a drop of blood hit my exam (wiped it off but still an obvious red mark). Probably an OHS issue at that stage.",
            "*And that's when the dead men take exams again...*",
            "I grew up before there was a chicken pox vaccine. Anyway, my two brothers and I shared a bedroom. Three weeks before my bar mitzvah, my youngest brother came down with chicken pox. My mother groaned that this was going to be bad. \n\nSure enough, the week of my bar mitzvah, my other brother and I came down with chicken pox. That was also the week I learned what a  germaphobe my grandfather was (by time of the actual bar mitzvah the virus had passed, no matter).",
            "Mandatory attendance for strictly scheduled test dates **without exceptions** should be fucking criminal. If they're not willing to offer proctors (paid or volunteer, Idc) to give tests on alternate dates due to illness or emergencies, then they've failed as an institution of education and certification. They should be doing everything in their power to ensure you can take that test. And that you're prepared for it. They don't have to ensure you'll pass or ensure it'll be easy, but they should be *desperate* to get you into the chair. Every certified graduate is good for their record. Every failure is going to count against their record double. I can't comprehend what sort of idiocy goes into making testing this strict. They should be far more rigorous about managing and revising their curricula than about testing practices. I know it's probably an industry-wide standard. Doesn't matter who is to blame, somebody is putting nonsense first instead of the students and the material.",
            "Just a thing about the chicken pox, if you take the vaccine it immunizes you to about 98% so there is a very slight chance you can catch it even if you took the vaccine. It will only be a weak strain however which is probs why you found it to be light",
            "It still baffles me that you americans don't get up against this. Sick days, Not allowed to retake an exam because of sickness.....while I would not want to go to work sick, I definetly would not want a sick coworker or someone that works with people come in sick. That companies her away with forcing people to endanger their health or spread diseases is unbelievable.",
            "When you said facemask, instead of [this](https://i.imgur.com/DuaExk3.jpg) I for some reason imagined one of [these](https://i.imgur.com/yfZZU8t.jpg) or a variation of [this](https://i.imgur.com/AxnPHmUr.jpg)",
            "I hope the teacher and phone answerer both caught it.",
            "A kid at my highschool had this happen to him. It turned out that every kid in the class had already had chicken pox, but not the teacher. Shingles is apparently MUCH worse than chicken pox.",
            "Took an exam with a concussion. I hadn't asked for an alternative because I only did it the night before, and would've had to delay the exam by 2 months (after my lease ended so it would've put me further out of pocket).\n\nSomehow survived (and passed) despite going to throw up every 20 minutes and coming close to dozing off.",
            "This is where your colleagues sue the school for making them sick......",
            "I would have gone to the office where she worked afterwards and hung out there coughing and sneezing in front of her desk.",
            "I had a campus nurse refuse to let me withdraw from a class for a 'cough' that was actually straight up influenza. Just because I initially reported a cough that was bugging me didn't mean that was all it was. My local doc had to call in and have a chat with her about it.\n\nMeanwhile, I was so sick I couldn't read because I couldn't focus on the page, and the class was one that required me to read a novel a night (philosophy in literature, and I'm still bitter that I had to withdraw).",
            "This is why zero tolerance rules don't work.  Shit happens.  Life happens.  I can't imagine anyone going through life without learning that lesson and yet here we are.",
            "Oh man, for years, I was getting horrible bronchial infections every winter and figured it was just a normal thing. Last year I went to the allergist for the first time (different story) and during my exam, he asked about my general health and I responded with I was pretty much healthy with the exception of getting bronchitis a couple times a year.\n\nApparently, that is not normal at all and I got tested immediately for asthma. Surprise! Its honestly been the best thing because now I'm on medication and last year was the first winter in as long as I can remember where I didnt get a respiratory infection.",
            "When you stopped by to see that woman, did you touch alllllllllllllll of her shit and cough dramatically into your elbow dozens of times??\n\n&#x200B;\n\nI don't think I'd have been able to resist.",
            "So are you gonna tell us what happened when you visited the lady? Don't leave us hangin, man!",
            "Unfortunately the chickenpox vaccine wasn't released until after I had it by something like three years. I remember just how much it sucked though, and even have a few scars left over from it. They've mostly faded over the years, but there's one on my right cheek that stands out against my tan that kinda pisses me off.",
            "I got chicken pox when I was 3.\n\nThen I got it AGAIN in my late 20s. Not shingles. Chicken fucking pox.\n\nThat was the day that I learned the awful truth that yes, you can get it more than once. And now you know this too.\n\nLet's all live in fear! Fun!",
            "I was hoping the lady would then get infected by that contagious disease :(",
            "MMR vaccine doesn’t last forever in many people. I had the standard two shots as a kid and was recently tested for immunity and found out I’d need another.",
            "As a 22 year old who has never had chicken pox, boy am I glad I wasn’t in that room lol.",
            "Those sorts of policies are absolutely insane. They dont do anything useful and just hurt people. Good on you for sticking it through.",
            "Would have become funnier if that woman caught the chicken pox from you.",
            "I work at chewy.com and have a coworker who is pregnant, has epilepsy and depression and anxiety. She was just out of work due to pink eye in both eyes and of course had a doctors note for it. When she got back to work management informed her shes on probation for 30 DAYS and isnt allowed to bring in any more doctors notes during this time, no exceptions. Chewy treats their employees like shit.",
            "Somebody's school could get in big trouble if another of your classmates or one of the OLDER teachers got Shingles or a full blown case of Chicken Pox.",
            "My younger brother had a final exam in his Post Secondary College course on the same day he was taking an ACT test at his HS. The professor refused to let him test at a different time and he even went up to the Dean and they didn’t want to be involved.\n\nHe ended up failing the class he otherwise had an A in and now was ineligible for sports at his HS. Thankfully his HS does understand and let him compete in CrossCountry races but as an individual and not with the ‘Team’",
            "Your vaccine probably didn’t work for one reason or another. This happens rarely and is just another reason why herd immunity is so important to everyone.",
            "Came back from the dead? This I have to hear",
            ">like the guy who came back from the dead to attend his exam\n\nwhat",
            "🎶And that’s when the dead men are testing again...🎶",
            "I know the doctor note system gets abused nowadays but at least it prevents dudes with Chicken Pox from attending",
            "What a rude school. Don't donate to them when they ask for money.",
            "\"whenever I remember it, I let out a smile\"\n\nSmiles are not farts!",
            "God I had this with a different twist. When I was in college I was also working full time in a factory. We worked beside union guys but we were 'contractors'. Read that folks who do the same job for 1/4 the pay and no benefits to speak of. I was lucky as somehow this happened during the summer and not during school.\n\nI got a surprise raging case of chicken pox or measles who knows I had red blisters all over. Damn things were under my nails and in my hair. The bonus were the ones on the bottoms of my feet. It was the 3rd time too. Really sucked as I was an adult getting it. Now my job was not good to us. If I missed  days in a row I needed a doctors note to return or I was subject to different outcomes even including termination. So off to work I went. \n\nYou have never seen a place empty at the rate of speed it did. (7-11 was hilarious though) I sat down at my machine with a large coffee and danish. I couldnt get warm in the summer heat but I was sweating buckets. No one would even come in to see what was wrong they were grouped up  outside. I was clocked in. My shift manager was prodded into coming over and asking me to go home (He was the person who would write you up for being late to the time clock or not at your machine on time). I told him no, sorry I dont have a doctor's note as I know whats wrong and I am sick BUT if I miss 3 days I could lose my job per my handbook. So machine is started and Im watching it roll. Its the only one running.....\n\nOur contract manager strolls over. He tells me its ok to go home I am obviously ill and with my attendance he is sure that they can overlook the note. (I still rarely miss time) Now he had told the story when I was hired in about running into people who were supposedly ill out at bars and events.\n\n&#x200B;\n\nI went home and got better. I was stir crazy and my girlfriend who was immune it seems drove me to the movies. We were sitting chatting and guess who was DIRECTLY in front of me in the theater with his whole family? Yup, he stood up and laughed. \n\nI still owe that guy a huge debt. He took me off swing shifts so I could attend college and had it in the contract that I was on a 4 day night shift while I was in college. I run into him from time to time and he asks me what Im up to and we chat.",
            "Oh my gosh, if I had been in your class I would have gone off on the teachers. I still haven't had chickenpox and if I picked it up during a college exam due to some stupid rule you can bet the administration would be hearing about it from my mother. LOL!",
            ">like the guy who came back from the dead to attend his exam.\n\nHold up, OP, I wanna hear about this story now!",
            "[deleted]",
            "You gave them everything they wanted and got nothing in return.",
            "That’s what happens when you have a bunch of dicky people administering an exam.",
            "Every spring and fall I have a week my allergies act up (otherwise it is a cold and I can’t tell the difference). I have to be taking all my allergy meds during this, and have my inhalers on standby. I know it’s started when I get a sore throat. It’s awful. I’m sorry you have to go through that almost every winter.",
            "Idk if it was worth it though you must've really annoyed your classmates",
            "One of the great examples of why \"No exceptions\" is a pretty dumb hard line to make.",
            "If you dont mind me asking, where was the Universality at?",
            "Wait so you got the vaccine and still got sick maybe it was faulty",
            "What  did the lady do when you stopped by",
            "While vaccines greatly decrease your chance of getting it, they aren’t a 100% chance guarantee.",
            "So if the issue was \"Hey I have a tumor,\" would they have still made you come in?\n\nSeriously this rule sounds like a good way for someone to need an ambulance in the middle of a test.",
            "I had something similar happen to me a couple of years ago. My manager at the time was an absolute bitch when it came to employees calling in sick. She would always guilt trip them. So this one day I had a really bad cold and I mean bad, I felt like and looked like I had the flu. I went into work not even bothering to phone in sick. As soon as I got in my supervisor sent me up to see the manager, who refused to let me go home as there was apparently no cover. She would have made me stay  all day if it wasn't for my supervisor suggesting I stay until lunches are over.  Well she tried to get work out of me, but I kept making mistakes, my mind was just not with it.  So she sent me in the back to unpack stuff, I felt so weak apparently I was swaying while I unpacked stuff.",
            "Outstanding"
        ]
    },
    {
        "post_id": "ngsw66",
        "author": "luther_williams",
        "title": "Accuse my sales person of forgery? Awesome, your service is canceled",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ngsw66/accuse_my_sales_person_of_forgery_awesome_your/",
        "score": 18179,
        "num_comments": 489,
        "created_utc": 1621492484.0,
        "selftext": "I used to be a sales manager for a B2B Services company. We provided a service to business. Unlike a lot of companies we would not auto renew a clients service UNLESS they signed a new contract. The contracts were generally for 1-3 years.\n\nAll our contracts were signed on an Ipad, that recorded the GPS coordinates of where the document was signed AND we emailed the client a copy of the agreement instantly and in the email we basically said \"If you disagree with this contract or would like to make changes contact us within 5 business days, if you don't we will move forward and bill accordingly\" \n\nIn addition one of the cancelation terms in the contract was dishonesty. If the client could prove we were dishonest they had a right to cancel without penalty. If the client acted dishonestly, we had the right to cancel their contract with us.\n\nThere was a client, that was actually quite a small account but always proved to cause a lot of headache for my reps. I remember calling the rep and going over the common issues I've seen with this client and I stressed, get the signature on the ipad in his office. I also stressed that if the client wanted to cancel, let him cancel because he's been proven to be very difficult to work with.\n\nSales man went to the sales call, signature was signed, clients service was executed according to the terms of the contract.\n\n4 months later I get an email from a customer service rep, the client is claiming that my sales man forged the clients signature. I did my due diligence before calling the client.\n\n* I checked where the newest contract was signed, it was signed in the clients place of business via the ipad\n* I compared the signature on the newest contract to the many signatures on the numerous contracts we had on file with the same signer from the client they were all very close\n* I also looked at the email that we went to the client right after the contract was signed, the client opened the link to see his contract 65 minutes after the contract was signed and did nothing. Also the link was open for several minutes.\n* I looked up the clients current billing status, he was 45 days behind, he knew we didn't start charging late fees until 60 days behind and at 120 days we would began litigation/collection account status.\n\nI called up the client and this is how the call went\n\nMe: Hello this is Luther from ABC I was told you are accusing my sales rep of forging your signature on the renewal?\n\nClient: Yes I never agreed to pay that much I never would have, I told him to give me a discount and I wanted to see it in writing before I signed\n\nMe: And did he give you a discount and show it to you in writing?\n\nClient: No he said he had to go talk to his boss and I never heard back from him\n\nMe: Ok, and then what happened?\n\nClient: Well yall kept up the service and I noticed on my billing it hadn't gone down but up in cost and I looked back in my emails and saw the sales rep forged my signature, and that's illegal\n\nMe: Yes you are right, if the sales person did forge your signature that is illegal\n\nClient: Well good to see that we agree on that\n\nMe: After the contract was signed regardless if the signature was forged or not you would have gotten an email with a link to the contract asking you to verify that everything is correct, and if its not to let us know within 5 business days did you get the email? If you did get the email, did you review the contract?\n\nClient: Well yes, but I was pretty busy and didn't open the email until recently\n\nMe: I totally get it, we are busy now-a-days, so assuming he did forge the signature what would you consider an acceptable resolution to this? Would you want to end service with no penalty? Would you like a discount?\n\nClient: I would want a discount\n\nMe: And what would you consider an acceptable discount? \n\nClient: 3 months of free service\n\nMe: Got it, well Mr. Client I got several problems with your claim that my sales rep forged your signature and before I fire this sales person for forgery and offer you a discount I'd like to see if we can't address those problems.\n\nClient: Sounds fair\n\nMe: The signature was captured on our Ipads, which records the GPS coordinates of where the signature happened, per the GPS coordinates it happened inside your place of business.\n\nClient: Well he knows that right?\n\nMe: Yes he did\n\nClient: That just means he forged it inside my building\n\nMe: Ok, well the next issue is that the signature on the renewal contract looks exactly like the previous contracts\n\nClient: He just copied my signature, I know I didn't sign that\n\nMe: Could it be possible someone else in your company signed it?\n\nClient: No, everyone here knows I'm the only one that gets to sign those contracts\n\nMe: I understand, the next issue I have with your claim is that the link to the contract that was emailed to you was opened 65 minutes after the contract was signed\n\nClient: No it wasn't\n\nMe: Yes sir it was, the reason why we have you click a link to view the signed contract is so we know if you opened the link or not, not only that it appears like the link was opened for several minutes. Which to me would indicate the person who opened that link reviewed the contract. Also the fact that no one ever responded to the email would indicate to me the person who reviewed the contract was fine.\n\nClient: Are you accusing me of lying?\n\nMe: Yes, and because of that I will be canceling your service with us effective immediately how would you like to pay your current balance?\n\nClient: Your canceling my service and want me to pay?\n\nMe: Yes I want you to pay for the services we provided\n\nClient: I'm not going pay\n\nMe: If your not going pay for the services we provided I'm going refer you to our collections department, and they will add late fees and if you don't pay them they will refer you to our law firm for litigation.\n\nClient: We have a contract, you can't just cancel my service\n\nMe: Actually I can, since I have good reason to believe your lying about the accusation that my sales person forged your signature, everything I have says you signed it. Our contract states that we cancel your contract for being dishonest, and that's what we are going do\n\nClient: Fuck you *Hangs up*\n\nI referred the client to collections, he eventually paid them without us having to sue him (honestly we probably would have just sold his debt to a collection agency due to the dollar amount not being high enough to be worth it to sue) \n\nTL:DR Client accused my sales rep of forging a signature, I canceled his agreement with us for lying",
        "permalink": "/r/MaliciousCompliance/comments/ngsw66/accuse_my_sales_person_of_forgery_awesome_your/",
        "comments": [
            "It's so nice when you're able to catch them lying",
            "“Someone forged my signature on this contact.”\n\n“You can’t cancel my service, we have a contract.”\n\nYes, one you are claiming has your forged signature on it, which would mean it’s not legally binding. But you are lying about that, which means we can cancel your service. \n\nEither way...buh-bye, bitch.",
            "i've never understood why people do stuff like that. you're willing to risk an innocent man's job and probably send him to jail to get 3 months of free service?",
            "It’s nice when you have the ability to rid yourself of sucky customers.",
            "This bit ..... \n\nMe: Got it, well Mr. Client I got several problems with your claim that my sales rep forged your signature and before I fire this sales person for forgery and offer you a discount I'd like to see if we can't address those problems.  \nClient: Sounds fair\n\nREALLY annoys me! This guy was willing to have someone get fired just because he didn't want to pay! That sales person would have their own bills to pay and maybe kids to support. \n\nWhat an absolute scumbag!",
            "I love how you play along at first knowing you have an ace up your sleeve",
            "I think we have the same client. I had a call with a very angry little man. His part got shipped to the correct address with the wrong name. This is a very expensive part which requires a signature. The problem is that we sent him a quote with the shipping address on it. We asked him to review it and if all of the information is correct to sign and return it. He signed and returned. We used the shipping address on the quote. He got so angry because \"well thats my name and im 300 miles away!\". As if im supposed to know that. The real kicker was \"well i guess I'm just going to have to read every little thing you guys send me\"......like yeah you should probably read a quote before you sign it. Im not a freaking mind reader.",
            "Client was perfectly fine with getting another person fired and possibly ruining all their chances of future employment.",
            "I worked for a collections agency in the UK for a while and it was eye opening.\n\nI was put on a contract for a B2B utility company which shall herby be called PowerCo. where we were contracted to claim we were the \"PowerCo, other-city Office\" - rather than our usual \"hi were xyz credit solutions\" - all of their customers were business accounts. \n\nFun fact, we weren't allowed to tell people we were a debt collector, or even give out the full business name, before passing data protection questions because we weren't allowed to tell an unknown third party that \"Joe Bloggs\" was in debt. Thankfully we mostly dealt with inbound calls so people mostly knew they were calling us - but it amazed me the number of people who'd freely give out their name, address, DOB and a prior address to \"confirm data protection\", often without knowing who we actually were or why we contacted them.\n\nAnyway, one of the PowerCo accounts that I had to deal with was for a fast food place which we shall call \"BBQ Beef\" in Watford - it wasn't in Watford and it wasn't called BBQ beef.\n\nAnyway, dial the number, and we get an automated response message before the guy answers, here's how my final call with them went - \n\nAuto: \"Thank you for calling BBQ Beef, Watford - someone will take you call as soon as possible\"\n\nDebtor: hello\n\nMe: Hi there I'm calling today from PowerCo, OtherCity Office about BBQ Beef, Watford. Is there anyone in charge I can speak to, perhaps someone from the finance department, or accounts payable?\n\nDebtor: This isn't BBQ Beef mate.\n\nMe: well, your automated response says \"Thanks for calling BBQ Beef\", you say I've called the wrong number. Which is it?\n\nThe guy hung up.\n\nI got a verbal for basically calling him a liar.\n\nFun times.",
            ">Client: Are you accusing me of lying?  \n>  \n>Me: Yes\n\nPerfect!",
            "Like it. \n\nI worked in debt litigation in the UK and the amount of businesses that felt that their contract was THE contract that the client I was working for would be bothered about was very high. The amount of times the client would just say \"forget about it, leave them with debt collection it's too much hassle/cost to take them to court\". \n\nThey'd have this big head about it, then they'd try to get credit and find that the companies creditworthiness had mysteriously gone down over the last few months. \n\nI could never understand it myself. ^(/s)",
            "That’s an amazing signing service.",
            ">> Client: We have a contract…\n\nBut you just said we didn’t.",
            "You should program the software to capture a video on the front camera when a contract is being signed.along with GPS and the time.",
            "Its amazing how many people back down when someone says \"Are you accusing me of lying\".\n\nIf you have the facts behind you, then yea, darnit I am.",
            "A textbook use case of cover your ass, loved it !",
            "Are used to work at a firewall security company doing phone support. The second I suspected them of lying I would tell them I’m putting them on hold but would only put them on mute and listen to their conversation if I could. It was at least 50-50 that I would catch them lying.",
            "Good story, but for the love of god, learn the difference between your and you’re",
            "That is beautiful.  I love this.  \\*chef's kiss\\*",
            "Where is the malicious compliance??  Strike that--where is the *compliance*??",
            "I work in sales for a moving company. We keep getting calls from this gentleman who KEEPS WANTING TO MOVE WITH US, despite every time he moves he tries to get out of paying due to horrible service, missed arrival windows, bad communication--- all of which we have not done. \n\nHe has since been red flagged and I have had the joy of saying \" im sorry we will not be moving you in the future due to you harassing our employees, have a nice day!\"",
            "...so... this guy wanted to have someone lose their job just to get 3 months free service? What a nasty person.",
            "> Client: We have a contract, you can't just cancel my service\n\nWe do? Did you sign a contract with us or not?",
            "> quite a small account but always proved to cause a lot of headache\n\nIsn't that pretty much always how it goes? In my experience, the big accounts are used to the proportional relationship between the size of the ask and the time it takes to implement their request. It's the little guys that always seem to want a completely custom solution an they can't see why we couldn't have it ready for deployment by the end of the day, tomorrow morning at the latest.",
            "[deleted]",
            "“Are you calling me a liar?!”\n\n“Yes.”\n\n“......oh.”",
            "\"but we have a contract, you can't cancel my service!\"\n\nactually, according to YOU, no, we don't have a contract. ta-ta fuckstain.",
            "I'm disgusted that they were happy for someone to lose their job for a 3 month discount.",
            ">Client: We have a contract, you can't just cancel my service \n\nOh, we have a contract now? Then what the fuck was this entire fucking conversation about?",
            "\"We have a contract!\" \n\"Sir, you are claiming it was a forgery. If we have a contract, you are lying. If it was forged, then we don't have a contract.\"\n  Lol",
            "Then he went on to social media and made some rabid rant that was pure psychological projection.",
            "You're*",
            "Digital paper trails are SO useful and satisfying to have.\n\nI used to handle all orders and production planning for a dry ice plant. People would always try to call and make changes to orders and I'd make them send me an e-mail with the same changes. Then I would reply saying thanks for confirming your phone changes, received etc.\n\nThen the next day when they received their order but had some customers add on late or cancel, they would call us up saying we screwed up their order--in am attempt to get extra product without paying the exorbitant trucking fees. I'd just forward them the emails and they'd be forced to admit fault and pay the extra courier fees for more product.",
            "I absolutely love this! You handled it 1000% how a manager should, you had your reps back. They days of “customer is always right” are dying, and that’s a good thing IMO because those little shits let that go to their head. \n\nGood on you and I’m willing to bet that rep was beaming at the fact you backed them up.",
            "I’m pissed that they were perfectly fine with someone losing their job over a false claim, plus accused them of illegal activity, scumbag.",
            ">Client: Are you accusing me of lying?\n\n>Me: Yes\n\nGod that is beautiful.",
            "that app sounds awsome, only thing that could make it better is if it snapped a picture the moment someone submitted a signature, and saved that too.",
            "One if my favorite things to do when I was in management at a little Caesars was to lead the lying customers on through this whole process, then deny them a free pizza because they were lying.\n\nA few prime examples:\n1. (This one wasn't exactly a lie, but it was still nice to call them on their dumb claim)\n\"My pizza had ants in it!!\" \n\"Ants? That's certainly strange, given that we don't have ants inside. Did you eat the pizza immediately after purchase?\"\n\"No, it sat in my truck for an hour or so while we went driving through my field\"\n\"Ahh, well, it sounds like it's much more likely that you attracted the ants in your field by leaving a pizza in your open truck for an hour.\"\n\n2. \"You made my pizza wrong!\"\n\"I'm so sorry about that, would you like us to remake it?\"\n\"Yes please\"\n\"Ok, I'll need you to bring your receipt to the store, and we will remake it right away\"\n\"I don't have the receipt\"\n\"Ok, no problem! You can just bring the pizza in so that we can verify that you didn't get what you wanted\"\n\"I threw the pizza out into the yard! Atleast my dogs could enjoy it\"\n\nAt this point I asked them to describe who was working, when they came in, etc. They described someone that not only wasn't on shift when they claimed they came in, but also didn't work the entire week during which this person said they came in.\n\n\"Hmm, well, still, there is a proof of purchase on a perforated tab on the pizza box. Just bring that in and we can work with it\"\n\"I burned the box too!!\"\n\"Well, I'm sorry, I can't do anything for you then. You see, we need proof that you purchased a pizza to begin with. Believe it or not, some people like to actually *lie* to me, just to get a $5 pizza. Now, I'm not at *all* saying that you're that kind of person, because *surely* you wouldn't lie to me all for a fast food pizza, right?\" \n\n\"WELL I!!!!!\" *hangs up*",
            "Love how at first the client didn’t sign the contract and it was forged allegedly but then tries to fall back on it when the service is going to be canceled… some people.",
            "I honestly don't think anyone would do something so stupid as forge a signature especially with the amount of legal trouble you can get into but yet again entitle people do have such low braincells no wonder why they try to lie.",
            "We have a software called FormStack that we use on iPads to have people sign waivers, etc.  It can capture GPS but it can also capture a picture of the person as they sign.  Totally irrefutable solution to people claiming they didn't sign, although a bit pricey.",
            "I don't understand how this is malicious compliance. Can someone explain it to me?",
            "I feel sorry for the people who work at that other company",
            "I'm sad that the most shocking thing about this write up, is the fact that you supported your employees.",
            ">  actually quite a small account but always proved to cause a lot of headache\n\nThe ole 80/20 rule! Not always true but it's remarkable how often it is:\n\n* 80% of your headaches are from 20% of your clients\n\n* 80% of your revenue is a different 20% of your clients, \n\netc",
            "I dig it. I’ve never ever been the kind of business owner who believes the customer is always right. \n\nI don’t need every bit of business I can get. I only want to work with reasonable clients and I’m picky about them so when I get a Karen who thinks like this client thinks I love to slam dunk on them like this. \n\nGood work.",
            "\"It's not a good lie if both of us know you're lying.\" - The Gord.",
            "It sucks when you get to the point of needing to fire a customer. \n\nBut by the time you do, it feels SO good to do it.",
            "FFS!!! \n\n“Your” = something belonging to you\n\n“You’re” = you + are",
            "Gotta love when ppl try and bluff and you have the pleasure of knowing without a doubt that they’re lying through their teeth",
            "Please, I do hope you shared all of this with the rep that was accused. Often the back office staff has to deal with so much bullshit from the end clients, I bet it would've made their YEAR to hear that story. (Share the recording even, if you kept one.)",
            "Amazing due diligence. And great follow through. And standing behind your people.\n\nI'd work for you.",
            "Sometimes you have to fire customers. Having this metadata of GPS and click through email is a great idea for other businesses to avoid finger pointing.",
            "One of my all time favourites: Are you saying I'm lying? \"Yes, yes I am.\"",
            "I do B2B too and it's always the little guys that cause all the issues. Good on you for doing your due diligence and canning that dirt bag.",
            "It's always good to fire your worst client.  Removes any current and future headaches.",
            "I love when you agree with them, make them think you're on their side then just let them have it. They never see it coming and it's such a great feeling.",
            "Mmmmm.  The Katie Porter treatment.   All it's missing is a white board!",
            "It’s always the smallest accounts that are a pain in the ass. You bill them $5k and you spend an enormous amount of time chasing that money.",
            "This is how smart CS is done.",
            "You sir are a master strategist. Do you offer your services for hire? 😀",
            "I can’t imagine my current employer doing that. It’s all delusion here. They would look at the evidence, say “but what about the metrics” and find someway to gaslight the employee into signing some sort of disciplinary action.",
            "While a decent story, I fail to comprehend where any compliance exists malicious or not.",
            "*Accuses your sales rep of lying*\n\nDiscussion ensues\n\n*Then he is rightfully accused of lying*\n- Shocked Noises",
            "Hit him with the ol' razzle dazzle, ya love to see it.",
            "What's bad is he rather possibly get someone fired rather than just handle business accordingly.",
            "Last job was a lot like this. B2B in person sales. Big accounts were difficult to deal with sometimes, but they were worth the money. However, it was always the small accounts that were the biggest pain in the ass to deal with and weren't worth any of the trouble. \n\nThey were all ran by some old owner who should have retired years ago who thinks they are the smartest guy in the room. I can't tell you how many calls I had to field from some rinky dink company calling to complain about service or their contract pricing escalating and then threatening to leave. Ok, please do. Save me the headache. I don't miss that job at all. My favorite account was a small tow company that refused to pay their bills, so we had to repo their equipment. Kind of ironic.",
            "Were you a lawyer in your previous life?",
            "Clean, concise, and realistic. Great post, OP.",
            "Love to hear stories of companies taking care of their employees and having their backs first!",
            "I can’t believe that piece of shit was going to let someone get fired for a discount about a lie he made up.",
            "I'm not sure if you are a dude or chick, but regardless, you're hot af 😍",
            "Fun story but not malicious compliance",
            "Omfg, *you're",
            "King shit.",
            "Only thing that I'd say, is that with the Android Developer Option.  Settings, System, about phone/device, tap on build number about 9 times and you become a developer.  Which allows you to change your GPS location to anywhere.",
            "I hope you don’t use improper forms of “your” in professional correspondence...",
            "Not really saying it changes anything, but perhaps someone else had access to his email and read the contract? Like I said, it really doesn't change anything, but he could have actually been honest.",
            "Very Harvey Specter",
            "Even better if you have a 'complete' button underneath the signature that then takes a sneaky selfie photo of the signer lol",
            "Fuckin eh!",
            "[removed]",
            "*you're 😉",
            "[deleted]",
            "Micv3bnyemngngn5 mill",
            "I love the fact that you backup your employees that's awesome you rock.",
            "Must feel good",
            "Wow Would’ve allowed you to fire someone - not human.",
            "CYA is my motto in life. Good for you!",
            "I’m",
            "This was satisfying to read",
            "Brilliant.",
            "I read your lines in Giancarlo Esposito's voice because that was smooth af",
            "That was a great application of site analytics. Timestamp of visit, duration, etc. Perfectly employed.",
            "I want a boss like you.",
            "This is the most satisfying Malicious Compliance I've read. 😍",
            "Beer to beer?",
            "ISP?",
            "That whole 'client is always right' corporate policy was wrong from the get-go.",
            "TIL, you could sell a debt to a collection agency. Man that would have been a sweet rebuttal. Collecting agents on your doorsteps every morning demanding money. 😂",
            "This is so satisfying. It's always the smallest accounts that kick up the most fuss.",
            "I kind of hope that the service you provided would have been disruptive if cancelled like that. Like Telephone or Internet would be. Make him feel the pain of being a jerk.",
            "Next version of the iPad system should use the camera to record the signer. With a copy of the video playing in the corner with the word \"Recording\"  and a flashing red dot so the signer is fully aware.",
            "That sure would suck for him if his mailbox had malware service monitoring it.",
            "Should add a dishonesty cancelation fee to the story. Something crazy like 20% of the remaining contract due to contract termination.",
            "You set him up good OP! I hope the sales rep was listening to the call,they would have been elated.",
            "Mr. De La Garza, by any chance?",
            "And there is good in the world. I hate when people lie.",
            "Flash back to Yanfei’s quest in Genshin",
            "Glorious.",
            "That system is really nice",
            "If I could be that direct with customers and hold them accountable like you did, I would not have left the customer service call center industry.  But no.  The fuckin leadership won't let most CSRs say \"no\" flat out.",
            "I knew how satisfying this was going to be a read, I actually read the whole thing.",
            "I ABSOLUTELY loved the way you let him dig his own grave! You did not even have to touch that shovel - he did it all himself!  GREAT JOB!",
            "Nicely done.  :D",
            "Always satisfying to catch someone in the lie. Manage it pretty often where I work because people don't realize how much information I can pull up."
        ]
    },
    {
        "post_id": "nk5jzv",
        "author": "None",
        "title": "Karen gets a free ride but won't buckle up enjoys a nice taxi ride home",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nk5jzv/karen_gets_a_free_ride_but_wont_buckle_up_enjoys/",
        "score": 18184,
        "num_comments": 563,
        "created_utc": 1621883100.0,
        "selftext": "This a few years ago roughly 4.\n\nI worked at an office about a 45min drive from my house and I had a friend who worked in the office I would give a ride home to it was on my way I literally had to pass bye her house to go to and from work so it was no big deal.\n\nWell a woman who worked in my office lived really close to her and found out about the arrangement and wanted in she guilted my friend in to asking me since it was on my way I said ok.\n\nWell at the same time my late husband's car was in the shop so I would make a detour to pick him up and he's a giant of a man 6 foot 3 and could not physically fit in the back so to make things easier my friend would just sit in the back.\n\nWell the other woman known as Karen was a big woman not tall but big. So on the way home literally the first time she starts getting in the front I explain to her she has to sit In the back.\n\nWell we get to my husband's jobsite and I park and text she jumps out of the car and gets in to the front I tell her to go back and strait up says no because the seatbelt in the back is to tight it hurts her chest.\n\nI tell her it's to bad she can get out of she doesn't like it. Well she gets out and goes to the back seat..my husband gets there and climbs in I start the car and the seatbelt warning light is on and beeping. She has the seat belt off.\n\nI say you need to put the belt on..I am.met with a No I can't it's easier if she's in front.\n\nWell I say your in back were not going anywhere untill the belt is on she crossed her arms.like.a child and says I guess we're not going anywhere. \n\nI tell her if she doesn't put the belt on she can get out and walk home.\n\nWith a nice bit of snark she says well you better call me a taxi.... That pissed off and that's what I did I called a taxi.\n\nShe puts her belt back on but I say it's to late get out you have a taxi coming I say you can get out of my car now or the police.will be happy to remove you.\n\nShe gets out and her jaw almost hit the road as a drove away.\n\nOutside my friend I never let anyone from work in my car again.\n\nEdit: English is my second language I usally type on word but am mobile and was pooping",
        "permalink": "/r/MaliciousCompliance/comments/nk5jzv/karen_gets_a_free_ride_but_wont_buckle_up_enjoys/",
        "comments": [
            "Snark will get you anywhere you want to go…. by Taxi.",
            "Lol, the very first time I was supposed yo drive my in laws anywhere they got into the back seat and just... sat there. \n\nSo I just sat there. \n\nFinally my BF asks me why I'm not starting the car. Because your folks haven't put on their seat belts yet. \n\nThey then inform me that they don't wear seat belts if they're in the back. \n\nI tell them I don't drive with unrestrained passengers. \n\nMy *BF tries to tell me it's OK, I can just drive, it's fiiiine*.\n\nNo jts not. They can buckle up or find their own way. Everyone is now glaring at me, so I reach into my purse, pull out the book I'd been reading, and settle in. \n\nFINE!! Fiiiiine!!! They buckle up. I put the book away and get driving. But it was all too much for his dad, he starts power-muttering about pointless rules and safety stuff that doesn't even make sense and how the hell is he going to go through the windshield if he is in the back?? Don't I know that seatbelts are just to keep someone from going through a windshield?? Why the hell am I insisting he wear a seat belt when he couldn't possibly even end up hitting the windshield anyway??\n\nI didn't even address the part where a childhood friend undid her seat belt to get comfy in the back seat and was thrown through her mother's windshield and missed paralysis by millimeters, ie how fucking WRONG he was... \n\nI just said he was 250lbs if not a full 300, and my issue wasn't with him destroying my windshield, but what would happen to ME being hit by that sort of unrestrained dead weight.",
            "You did the right thing. But I hope everything is fine at your workplace",
            "[deleted]",
            "I had a coworker with a similar situation.  Her place was a few houses in down a street right off my route home.  So I did drive her, and she did give me some gas money for it (despite not being asked).\n\nSecond or third trip, she gets in and doesn't buckle.  I just stared at her.\n\nAsked her to buckle up, she responded by pointing out that she would get the seat belt ticket, not me.  (This is true here.)\n\nI just kept staring.  When she got uncomfortable I said \"if we got into a crash, I'd be the one to live with it.\"\n\nShe buckled up and we continued on our way. She never hesitated to buckle up in my car again, and I later overheard her using that line on someone else.",
            "Yeah back when I was in college and totally poor I bought a beater for like 800 bucks I needed it for work and school. Chick at work says she needs a ride home, totally out of my way, btw, I said ok, and all she did was say how embarrassed she was to be in my car, like walk then beotch",
            "The audacity of Karens never ceases to amaze me.  “Here, you’re doing me a huge favor, so let me order you around so you do this favor how *I* want.”",
            "Well done",
            ">  you better call me a taxi\n\n\"Okay, you're a taxi.\"",
            "My grandpa had a saying, I am paraphrasing but I can’t remember it. It was along the lines of, you are not aloud to audit a favor. When someone goes out of their way and helps you out, you say thank you, you don’t make further demands.",
            "One-sorry about your husband. \n2-you did great. Seatbelts are not for comfortability, they're for life and death type of safety.",
            "Just curious, what car was it and how big was she? Nice job on booting her out, though, too many misunderstand the word 'privilege' these days.",
            "Me: Get out and I will call you a taxi.\n\nHer: <Gets out.>\n\nMe: You are a taxi. <Drives off>",
            "it blows my mind that someone would pull this shit when being done a favor, by a stranger even. like wtf",
            "Other than a couple of years in my early 20's, I  have always had a car and always drove to and from work.\n\nI am happy to give anyone a lift home at the end of the day, as long as they are not going too far out of my way, but I have got into situations in the past where I have somehow ended up giving work colleagues a lift to and from work every day.\n\nIn all honesty, I paid a lot of money for my car and it costs a lot to keep it insured, taxed, maintained, fuelled, etc.  It is my little sanctuary, where I can play my music as loud as I want or sit in contemplative silence, depending on my mood, so I do not want to provide a recurring taxi service and make inane small talk or sit in awkward silence.  My wife also moans when she realises that someone has moved the passenger chair back, has adjusted the back or messed up the carpet in the passenger footwell!\n\nlt also adds another layer of communication hassle if either person decides to take a day off, are off sick, want to start or stay and work late for some reason or the car breaks down or can't be used for some reason.\n\nI had one guy ask me to give him a lift to and from work a while ago.  It was a bit out my way, but he never had a car and was not on a public transport route.  I didn't really want to give him a lift each day, but money was tight at the time, so I said I would give him a lift each day on the condition that he shared some of the fuel costs with me.  After a few months, he still never handed me any money, so I gave him an ultimatum - money by a certain date, which was a Friday after payday, or the lifts would stop the following Monday.  No ambiguity.  A simple condition.  He agreed.  Friday came and went and no fuel money was handed over, so I simply drove straight to work without picking him up the following Monday.\n\nHe arrived at work about an hour and a half late, having cycled there.  The workplace was at the top of a long steep hill, so the bike ride must have been tough.  He immediately approached me at my desk and asked why I didn't pick him up, and I simply reminded him of the fuel-money agreement.  Then the penny dropped and he shuffled away huffily.  He was a complete chancer and thought he was smarter than he was, so I didn't give him a second chance.  We never really spoke afterwards.\n\nAfter that, he continued to cycle to and from work, and  I really enjoyed the times when I drove past him on that long steep hill and the weather was inclement!  I don't know how I  resisted the urge to give him a friendly double-toot on the car horn!",
            "**English is my second language I usually type on word but am mobile and was pooping**\n\nThis is a beautiful mastery of our language. A+",
            "In Washington state the officer will ticket the individual who isn't buckled up, not the driver. (Unless of course they are a minor or something like that.)\n\nSo in that state you could have driven near a cop, flagged him down, and watched Karen get a ticket. Lol Would have been very satisfying.",
            "Well done",
            "\"I'm not getting out unless you call me a taxi!\"\n\n\"okay\"\n\n*woman gets out*\n\n\"You're a taxi.\" *Screeches tires and speeds off*",
            "“English is my second language I usually type on word but am mobile and was pooping”\n\nA TRUE REDDITOR",
            "Princess Diana was in the back seat of her limo, and was not wearing a seat belt. She would have survived that crash if she was belted in.",
            "Excellent poop post. \n\nHave an upvote.",
            ">Edit: English is my second language I usally type on word but am mobile and was pooping\n\nThis is the kind of honesty I come to Reddit for",
            "From the title, my first thought was of this:\n\n[https://youtu.be/Ne\\_Uqd-2GXg](https://youtu.be/Ne_Uqd-2GXg)\n\nI agree that you should never let this person back in your car(s) again.",
            "I transported a colleague in my car, and there was a small bit of damage that I had intended to have repaired.  It was a piece of trim inside the car.  It in no way impacted anybody, and required a little bit of work to fix.\n\nThis A-HOLE got in my car, and brutally ripped it off, damaging it even more than before.  He acted as though he was doing me a favor.  I was furious, and NEVER let him in my car again.",
            "I drove around with coworkers often in the old days. I never drove off without them all buckled up. If they refused, I just idled until they did.",
            "I never understand the whole, I'm not wearing a seat belt mentality. My dad was a leading firefighter and he drove the road rescue unit and has picked up bit if bodies from accidents. When we were young, before we left in the car, he'd always ask, all buckled up? And wouldn't leave till he got three choruses of \"yes dad\" from the back seat. Life is too precious for people to throw it away by not wearing a seat belt. It's there for a reason",
            "My car, my rules, and anyone in my car wears a safety belt. No smoking either; way back when, I had a colleague who lit up a cigarette in my car, and I did and emergency stop from from 160km/h to tell him to get out.",
            "That edit has cracked me up!!",
            "Upvotes for the edit!",
            "> and was pooping\n\nYour English is flawless. (I'm a native speaker; USA version.)\n\nYour typing ls flawless.\n\nYour details have one too many items.",
            "well done! As a shortie, the seatbelts in cars drive me crazy! In the front seat , they cut across my chin - yep - chin. So i hook it under my boob to hold it in place lol. In the back seat it is even worse - right across my throat! I do confess to putting the shoulder strap behind me in the back seat and doing up the lap belt. Being decapitated by a seatbelt in an accident really isnt something i am interested in lmao. \n\nBUT! i still wear them!",
            "How was your poop?",
            "Upvote for the poop admission. TMI in most cases but a damn funny way to end a post.",
            "I've seen posts by native speakers that are worse with the language than you",
            "I'm very proud of you for setting a hard limit and sticking to it. That person is infuriatingly entitled. \n\nWell done, and well written.",
            "[removed]",
            "I don’t give rides to people from work. I just say “sorry I can’t I have to pick up my kids.” I of course already know that my wife is getting the kids",
            "Pooping is awesome!!  I love that you utilized your time to write this post.  I respect that!!  Get your poop on!!!",
            "Upvote for the edit alone",
            "Ugh. I avoid the subject firmly if anyone at work starts talking about where they live and commutes. People feel entitled to your car, it’s pretty damn annoying. I also think very little of people who sign other people up for shit without asking and discussing in advance, and will outright refuse to do it. I simply do not understand this, it’s so rude.",
            "Back seats have sensors?!",
            "You were nicer than me. She would have been calling her own taxi in my world.",
            "The best  part of this story was that she was on her mobile and pooping!",
            "She sounds like a spoiled, petulant little child instead of a grown woman.",
            "🤣🤣🤣🤣🤣🤣 your car your rules this is funny af ty",
            "Did everything work out okay?\n\n  \nTalking about your poop.",
            "I love people who actually do the right thing and put people in their place! Good for you!!",
            "I read this while pooping. Reddit connects poopers.",
            "\\> I usally type on word but am mobile and was pooping\n\nAbsolutely not a problem, my friend",
            "\"you better call me a taxi then\"\n\n\"Ok, I called you a taxi\"\n\n*surprised pikachu*",
            "good for you - what did your hubby and passenger say?",
            "Hahahahahahahahahaahahaaa",
            "You are awesome! Thanks for the story.",
            "One of my friends asked me if I'd drive her friend to his house and he refused to put on a seat belt. I said fine and turned off the car and got out. No seat belt no ride. Easy.\n\nHe called me some names and I figured that was good because clearly he and I weren't going to be friends anyway so he could get lost.",
            ">and was pooping\n\nWell that excuses everything!\n\n(upvoted because poop)",
            "You had me at pooping.",
            "Upvote for ESL related human honesty in the last line.  Kudos!",
            "You did the right thing. She acted ungrateful and spoiled.",
            "The amount of entitlement in some people is literally breathtaking...",
            "Upvote for the pooping.",
            "I read this while pooping\nGood story op glad you stood up to her",
            "You did right. She was presumptive to think she could order you around about your own property.",
            ">Edit: English is my second language I usally type on word but am mobile and was pooping\n\nI too am on reddit while pooping 😌",
            "I never understood the audacity of people. Its your car, your rules , whats so hard to understand. You are doing her a huge favor. You would think on the first ride home she would be overly compliant as to not ruin a good future thing for her self of not having to drive.",
            "\"I was pooping\"\n\n&#x200B;\n\nThe real powermove",
            "She's lucky you even called a taxi, because I just would have called the police and notified our HR dept as well.",
            "We’re all pooping, it’s ok",
            "Well done !",
            "*and was pooping*\n\nTMI right there",
            "Your English was wonderful. I can’t believe that lady was such a jerk.",
            "Noble job with your in control attitude and your English.",
            "...omg, the edit! tmi, but thanks for the grin!",
            "YAAS!!! Love it!!! Don’t 👏🏻 ever 👏🏻 put 👏🏻 up 👏🏻 with 👏🏻 bullshit 👏🏻",
            "Hey man, for English not being your first language you did a good job! Nice story!",
            "Please tell me you called the taxi to go back to your work. Please. I need petty malicious compliance.",
            "Should have cancelled the taxi as you pulled away.",
            "A rear seatbelt warning light?",
            "This is what it's like being an Uber/Lyft driver.",
            "Upvote for the honesty 🤙🏼",
            "Bravo. People like this pull shit deliberately. My only change would be: Call your own damned taxi!! Drive off and leave her to it.",
            "Great story, tmi at the end lol",
            "NTA. Your control of the English language is fine. But TMI with the last 2 words. :D",
            "I'm sorry about your husband. Great story, and thank you for the finale with the language and poop explanation 💀 I had a nice chuckle",
            "That lady too. If she wasn’t pooping at the time, then she is pooping now, for sure",
            "'and was pooping' 😄",
            "I liked this story because it was written whyle pooping, which i find is hillarious.",
            "I’ve never owned a car that beeped when a rear seat belt wasn’t fastened. Must be a newer feature.",
            "If I was in your position I'd say \"okay then,\" drive with her seatbelt off, flag down a cop and show them. If you're over the age of 16 (in Ontario, at least) the passenger not wearing their seat belt gets the ticket, not the driver.",
            "the edit killed me",
            "wow, and to think she would get front seat priority over the husband.",
            "“And was pooping” 👏🏼👏🏼👏🏼👏🏼",
            "You get my upvoted for the honesty about you pooping.",
            "So a person asks for a favor but instead of appreciating the favor, acts like a royal pain in the arse.  Then the person wonders why people do not want to help her.",
            "Pooping is never an excuse unless you run out of TP.",
            "Lol wtf 😂 as a fat person we don’t usually like to draw *more* attention to the fact we’re fat!! I would’ve just sucked it up or buckled but put the top belt behind my head.",
            "What happened to commas?",
            "Twist ending with that edit.",
            "“Obligatory on mobile and pooping, please excuse any errors”",
            "Upvoted for the 'Edit' comment!\n\nPlus good for you kicking the Karen out of your car.",
            "[removed]",
            "+1 for pooping on mobile.",
            ">was pooping\n\nhahaha. yep. we all reddit and poop",
            "This is the best \"edit\" on a post I've seen so far",
            "I upvoted because you Reddit while pooping.",
            "Nice I was pooping while reading this, small world",
            "Upvoted only cause you were pooping",
            "I’m mobile and was pooping was the icing on the cake to this story.",
            "why do people do that?",
            "Americans still out there calling fat people \"big\" lol.",
            "NTA - You did right. Who is she to demand the rules in your car? Sheesh!",
            "I love this edit hahaha",
            "Don't keep us in suspense... How was the pooping?",
            "Mobile pooping sounds awesome. It would same so much time.",
            "Wait what? You’re on mobile and pooping ?",
            "“...and pooping”  that was the best edit ever.",
            "I often wonder how many posts are created whilst one poops. Amazing story too!",
            "I was gonna mention the spelling, grammer and total lack pf punctuation, but the edit explained it quite relatably",
            "O.o weird never really known anyone to require the seatbelt on in the back seat nor for a car to have a sensor for it. Usually the back seat passengers only put it on if they are kids or.. really don't trust your driving.\n\nAlso back seats generally have better seat belts for larger people. O.o",
            "Does nobody understand what \"malicious compliance\" means? You were the driver. You were the one setting the rules, and she was maliciously *non*-compliant. You didn't comply with a goddamn thing, maliciously or otherwise. This story was crap, even without the atrocious punctuation.",
            "No one needed to know you were pooping.",
            "I have claustrophobia and being belted in the back makes me not yet panicky but very uneasy. I'm small so in the back I stare at a wall made of seats and head rests higher than I am, while in front there's all that marvellous windshield to see through, add being tied down because those dratted belts have a system to tighten them... So I cheat. Either I pull the belt loosely across my chest and don't lock it or I do lock it but pull as much belt as I can so I don't feel any pressure and can move. Now you're telling me that the car will snitch on me if I don't lock it. :(",
            "What car has a seatbelt warning for the rear seats?",
            "Great edit",
            "Edit is best edit.",
            "NGL, that edit made me laugh SO HARD! I mean, literally LOL, which hardly ever happens on Reddit. If I had an award, I'd give it to you 🤣🤣",
            "I came looking for a TLDR, found the edit, updooted",
            "Your edit made me laugh out loud, I wasn’t expecting an “I was pooping“ 😂",
            " 6 foot 3\n\nhad to humblebrag lmao",
            "[removed]",
            "“too”, not “to” should be used sometimes. Other then that its great.",
            "[removed]",
            "This reads like the guy who pretended he didn’t know what potatoes were.",
            "2 very aggressive ppl will always lead to a disaster. Was going to say ESH but this is the wrong sub.",
            "I had to stop after about 1 and a half sentences disguised as paragraphs. Please use proper punctuation.",
            "You sound like a Karen yourself sweetheart",
            "This whole story made me HA! out loud, several times.  Thank you so much.",
            "I wish we could pool my award (15 coins) with someone else's so that we can give you another award.",
            "You chose wisely.",
            "Karens are the worst",
            "I love you, and I am sorry for the loss of your husband.\n\n\nAlso, you rock!",
            "Good for you!!!!!",
            "You should have taken the taxi yourself and left her there with your car and no keys",
            "Well done.  You did exactly what you should have.",
            "This was great!",
            "Here, it would be her fault if the police stopped you and gave her a ticket. I would have honestly done my best to get a cops attention, in a subtle manner of course, so she would get a ticket.",
            "Best edit ever.",
            "Well done!",
            "> \"You better call me a taxi'\n\nhttps://i.imgur.com/2jUQEUO.jpg",
            "LOL i love your edit remarks!",
            "Its nice that you let the watermark stay",
            "I use Word too. Also mobile, but not while pooping.",
            "It's nice to give a person a ride to work on occasion but it gets terrible over time",
            "That sucks, was there any consequence at work? Like was she in a position ofnpower to give you a hard time?",
            "How did your friend take this? Was she ashamed or did she think you were being rude?",
            "I would have paid the driver to drive like an hour in the opposite direction",
            "TMI",
            "I was also pooping, so I figured I'd be useful:\n\nThis a roughly 4 years a go.\n\nI worked at an office that was about a 45min drive from my house. I also had a friend who worked in the same office and we could carpool, as her home was on the way to mine (so it was no big deal).\n\nAs it happens, another co-worker (Karen) from our office lived really close to my friend. When she found out about our carpool arrangement she wanted in. She guilted my friend in to asking me and, since it was on my way anyway, I said ok.\n\nWell, around this time time my husband's car was in the shop, so I had been making detours to pick him up. My husband was a giant of a man (6'3\") and could not physically fit in the back; so to make things easier my friend would just sit in the back instead.\n\nKaren was a big woman, though not tall, so on the way home one day she got in the front. I explained to her she has to sit In the back, which she did.\n\nWe got to my husband's jobsite and, right after I park, Karen jumped out of the car and got the front seat. I told her to go to the back, and she strait-up said 'no', because the seatbelt in the back was too tight and hurt her chest.\n\nI told her it's to bad, and that she could get out of she doesn't like it. At this point, she got out and went to the back seat. My husband arrived and climbed in, and I started the car. Immediately the seatbelt warning light went off and started beeping; Karen had taken the seat belt off.\n\nI told her she needed put the belt on, and I was met with a 'No, I can't, It's easier if I sit in front.'\n\nI said to her we're not going anywhere until the belt is on. She crossed her arms like a child and said 'I guess we're not going anywhere'.\n\nI told her if she didn't put the belt on she could get out and walk home.\n\nWith a nice bit of snark she said 'well you better call me a taxi.' That pissed me off, so that's what I did, I called a taxi.\n\nShe then put her belt back on but I say it's to late, that she can either get out for the taxi, or I'd call the police.\n\nShe got out, then her jaw almost hit the road as we drove away.\n\nOutside of my friend, I never let anyone from work in my car again.\n\nEdit: English is my second language I usally type on word but am mobile and was pooping",
            "Was expecting a more slapstick MC where she'd get jostled around in the car during the journey because she wasn't wearing her seatbelt but this is hilarious as well.",
            "So would you say this was a very cathartic post to write?",
            ">I usally type on word but am mobile and was pooping \n\nDamn man no worries.",
            "Your English is fine, your attitude is better.",
            "Upvote for pooping",
            "Best Edit ever.",
            "I love your pragmatic approach.",
            "So entitled.",
            "First of all",
            "I notice she said to call you a Taxi, not that you would pay for it. Did she give any further issues once at work?",
            "When you gotta go, you gotta go.",
            "There is a sub you should cross post to, but I don't remember if it is choosybeggers or choosingbeggers.",
            "Hmmm. Where I am from you don’t actually need to where a seat belt in the back seats as long as you are an adult.",
            "Lmao ‘am mobile and pooping’ sounds like you’re pooping on the go",
            "Mobile and Pooping...good name for a band.",
            "One time when everyone in my office was going to lunch together I was one of the drivers as I could comfortably seat 8 people.  We had a young 19 year-old male intern working with us. I was 37 at the time. I had a techno CD in my car that I had burned.  This was 25 years ago and still love Trance and Techno music.  I forgot to turn my sound system off so I still had it going. This intern who didn't know my age said aren't you too old to listen to this type of music. Everybody else just looked at him funny. I wanted to put him out of my car.",
            "Commas and periods, please.",
            "Don't make ultimatum's when you're not prepared to deal with both options.",
            "\\> I usally type on word but am mobile and was pooping\n\nThanks for the info"
        ]
    },
    {
        "post_id": "bi9wx6",
        "author": "LovelessWolf221",
        "title": "You start at 7 you finish at 7.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bi9wx6/you_start_at_7_you_finish_at_7/",
        "score": 18156,
        "num_comments": 436,
        "created_utc": 1556447393.0,
        "selftext": "Not sure if this truly belongs here but here it goes.\n\nI used to work at a car company about 2-3 years ago as a telephonist on the night shift doing 12 hour shifts. It was pretty good 4 days working 3 days off and the pay was decent. \n\nHowever most people didn't take their job seriously, they would call in sick or just not show up for work at all and especially on nights when there were 4 only 4 of us. If one person didn't show up you felt it. \n\n\nI was a star employee. I showed up early logged in and started working usually from 6:30. I Never took a sick day. Changed my holidays to fit the companies needs and worked any overtime they needed me to work. I was so dedicated to the my role that I had worked on multiple occasions 18 - 24 hours as people wouldn't show up for shifts and they needed cover. It was my first REAL job and I believed in the company. \n\nI used the train system to get to and from work and always planned out my routes around as much as I could to avoid being late however on this particular day they were running a reduced service due to breakdowns alot of the trains had been repaired using less than stellar parts and the wheels kept sticking to the track when they hit the brakes causing wearing on the wheels in specific spots. So ALOT of trains were out of commission. On top of that the train I was on had been stopped due to a signal issue for 15 - 20 minutes this led me to being late. I had shown up about 10 minutes late to the start of my shift. \n\nBefore I had even sat down my manager was giving me grief. Apparently they were mad because I had stopped other telephonists going home as someone had to work 10 extra minutes to cover my shift as 2 people were ill and couldn't make it in. Now I hate being late. I was already pissed off that I was late but my manager giving me trouble as soon as I walked through the door just irritated me even more. \n\nMy reply to him was as follows \"Apologies I was late however how many times have I ever been late? I show up 30 minutes before my shift every day. I have stayed late to covers days before the train had an issue and it was out of my control. I was stuck underground with no signal to call or text to let you know.\" \n\nMy manager didn't give a fuck their reply to me was \"You start at 7 you finish at 7. You are in early on your own time. Those times you have stayed behind you have been paid and no one asked you to.\"\n\n\"Okay then\" was my reply. \n\nThe next day was EXTREMELY busy. my colleague had left and only one of the morning guys had shown up for his shift to take over. As he sat down I began to pack up. At 7am on the dot I left. As I usually helped out when this happened everyone was surpised and had asked me where I was going. My only reply was \"I start at 7 I finish at 7.\" \n\nThis was my final shift and so I was off for the next few days.\n\nOn my first shift back I get pulled into the office by my manager with HR. They ask me why I left a single telephonist on their own. I looked at my manager and repeated the EXACT same words that were said to me. \"My manager informed me I start at 7 I finish at 7\" The look on HR's face was priceless. She WAS pissed. She already had a staff issue to deal with and on top of that one of her most helpful staff members had been mugged off by a manager. She told me to go back to my desk and she needed to speak to the manager in question. \n\n20 minutes later the manager came back in looking absolutely defeated. He never EVER said anything to me again about being late.",
        "permalink": "/r/MaliciousCompliance/comments/bi9wx6/you_start_at_7_you_finish_at_7/",
        "comments": [
            "Manager deserved to get in trouble for that. That’s how they ruin good employees. It isn’t fair that that the bad employees always get away with everything, but the one time the reliable person does something they get in trouble.",
            "I'm the manager of a warehouse.\n\nI had an employee that was never late. He also stayed over and worked off days when asked. He was a great worker. One day, he was 1.5 hours late. I said nothing about it at all except to ask if everything was okay. Turns out he had a breakdown on the way to work, and had to Uber in the rest of the way, leaving his car on the side of the road. I had his car towed to his mechanic while he was at work, and personally gave him a ride there after his shift was done.\n\nGood employees should be treated well. He was never dinged for it, and when upper management asked why he clocked in so late, I told them it was approved by me.\n\nDid his lateness affect that day? Yes. A lot. Was he ever late before or again? No. If he had been late regularly, it would've been a different story.",
            "That manager should teach a 101 class: “How to Lose Good Employees”",
            "If companies would just notice hard work as much as they notice things going wrong, everything would be so much better.   It sounds like you always went above the call of duty with no recognition at all, but one small incident, and the guy rakes you over the coals.  He sounds like someone who should not be in management.\n\nI have always thought that no one should be allowed to supervise or manage front line staff without doing the front-line job themselves for at least a month, just so they can gain some perspective on what it’s like.   Anyone who thinks customer service and help desk jobs are easy has obviously never had one.",
            "[deleted]",
            "I WAS the manager. My best team member was sometimes late, but worked late almost every day. She did 25% of the work even though she was 1 of six team members. The owner’s sister would routinely complain that she is late, but I just refused to give her any type of warning or discipline. I knew what I had. Eventually I got the discipline....",
            ">20 minutes later the manager came back in looking absolutely defeated. He never EVER said anything to me again about being late. \n\nHe never apologized either, so fuck him.",
            "Manager: *Berates top employee*\n\nHR: *Gets mad*\n\nAlso Manager: *suprised pikachu face*",
            "never ever do anything for free to \"help\" a company. No company on this planet cares about the good deeds of any employee once they no longer need you or need to \"restructure\"",
            "It is unfortunate that a lot of managers fail to realize that it is their job to make sure employees conform to company policies as well as the performance of their duties. Whenever an employee operates beyond his duties, they better damn well be sure that it is voluntary. If HR finds out that it is involuntary, then it leads to problems, loss of qualified employees as well as the potential for lawsuits.",
            "i hope you get payed for your overtime. all the things you do which you might label as \"good work ethic\" i would describe as getting used. to help here and there isnt bad but it shouldnt be necessary more than once or twice a month. when its more often you just are understaffed.",
            "good on your HR - a lot of call center jobs have a stupid setup where there's no leeway for good employees - every phone rep is viewed as the same by the higher ups.  I know a lot of places where the manager would have been chewed out for *not* reprimanding you for being late, even if you were the best phone rep on the planet.",
            "I said it before and I'll say it again, people will suffer through a bad job if they are otherwise treated fairly, but no one will suffer through a bad manager for long even if they are otherwise treated fairly.",
            "Awesome HR personnel. At my company, we are supposed to be at the office at 7. I show up at 6am to help open up, eat breakfast, do paperwork, and bullshit with the supervisors. I am also attending college at night pursuing a BSME. On one occasion, I stayed up late studying for an exam the next day and slept straight through 3 alarms. I woke up with the sun shining in my window and had the \"fuck fuck fuck\" moment. I texted my boss and hauled ass to work. As I was getting my work orders together for the day, I was scarfing down breakfast. One of the other employees was bitching about how I showed up late and still got to eat my breakfast with no repercussions. Before I could say anything, the owner of the company stepped in and said \"because he shows up every morning an hour before he is supposed to, does whatever we ask him to, is on call every weekend, drops whatever he is doing to go to work if I call him, and doesn't ever complain about anything. He is allowed to have an off morning. Go to the fuck to work\". I almost shot eggs out of my nose.",
            "I am a manager of 34 people.\n\nIf someone is so dedicated like you described and showed up late and flustered.... I would pull them aside and ask them if everything was ok and if there was anything I could do to help. I would also mention this is out of character and thank them for all of their effort and contributions to the company. Do not sweat about it at all and carry on with your day. \n\nI would never give them a hard time about that. So sorry you had such a shitty manager.",
            "I wonder if this jerk of a manager burned out all the other employees and that's why they all acted like they did. I've seen it time and time again, the greatest employees gets dumped on at the first slip up while the other lazy employees get away with everything, while management claims they don't play favorites.",
            "And this, my friends, is how good employees become employees that do the absolute minimum required. When you treat a human like an object you own, and not a person, this is what you get.",
            "Maybe we should just do away with manager titles. Somehow, as soon as they get the title, the Satan in their heads wake up and they start power tripping.",
            "Holy fuck 12 hour shifts? Thats already a no no for me. And then this manager.. What a bitch! I dont think she pulls off as many hours as you do.",
            "[deleted]",
            "Man this makes me appreciate my boss. I had a couple of crazy weeks last month (strung together a few 70 hour weeks) and once the project was out the door he called me into his office. I was sort of nervous I was in trouble but he told me \"I know this isn't company policy. But I am giving you direction as your boss to put 8 hours on your timesheet for this Friday and next Monday and I want you to stay at home and not think about this place once.\" Crazy how small gestures can go such a long way, positive or negative!",
            "Because this thread is full of employees that work for a company where the managers don't see their effort, or let the lackluster performance of bad employees slide, I want you to know that the opposite situation does exist in the world.\n\n\nI hired three new employees that started within a few weeks of each other (two the same week). Two of the three are flat out amazing and I've already given one of them a raise *while they were on probation*. The third took time off sick during their second week on the job, and took even more time off sick a few weeks later. Since we only provide sick time after probation has completed, we were under no obligation to pay for any missed time. Instead, I worked out an arrangement with the employee where they could make about a quarter of the time up over the following three weeks, take some of the time as a mix of as yet unearned vacation and sick time, and only have a few days unpaid.\n\n\nTo thank me for working out this arrangement, the employee over the following weeks: showed up late on five different days (once as late as 3 hours past the start of their shift, claiming that they had witnessed a car accident and were required to stick around as a witness. It was a lie. When we looked into it, the pictures they sent us were from two different accidents, and taken on a completely different day at a completely different time); left early, unexcused on three separate occasions, not only failing to work the scheduled makeup hours for that day, but also failing to work their full shift; leaving early, or working so few hours that by the end of the period they were supposed to have made up only a small portion of the time owed, they actually owed the company even more time.\n\n\nTo prevent this employee's toxic behavior from infecting the rest of the staff, I fired this terrible employee less than two months into their probation. The weirdest thing about letting them go was that in the termination meeting they actually asked why they were being fired. Like it was baffling why we wouldn't tolerate this behavior and were letting them go.\n\n\nThere are companies/managers out there that will recognize good effort and punish bad. If the company you work for isn't one of them, spend time and effort seeing if you can change managers or companies. It's not worth working somewhere you're disrespected or unappreciated.",
            "It always baffles me when managers over manage there hard working employees. Seems easy to caution against but happens all to often.",
            "TLDR: good employee gets chewed out for being late, leaves exactly on the hour, leaves one employee, manager gets chewed out by hr.",
            "One of the most frustrating aspects of a bad manager. I find that often being a hard worker puts extra pressure on you, as the people around you begin to build expectations. And then that first time that you make a small mistake, it’s obvious and apparent and everyone knows. Which really sucks, because you’d think people would just understand that we’re all human and even the best are prone to mistakes and life events.",
            "> It was my first REAL job and I believed in the company.\n\nSounds like your first lesson that as much as you might believe in the company, the company doesn't care anything about you. If the company *did* care about you they wouldn't let your other co-workers get away with screwing over your shifts. Your hard work is allowing them to get away with not doing their job.",
            "Sounds like a GREAT first job experience. You learned how to tell a manager to go fuck themself in the most professional way possible. I hope you're working some place better now.",
            "Congratulations, you learned a valuable lesson that day: don't bust your ass to an insane degree for a company, because they don't actually give a fuck about you until it hurts them somehow.",
            "Same thing happened to me once. I always stayed late and worked overtime. One time I was like 15 minutes late to work and my manager starts giving me crap. I told him “if you’re going to start being super concerned with what time I clock in, I’m going to start to being super concerned with what time I clock out”. Then for about a week I worked exactly 8 hours. Leaving on the dot with whatever wasn’t done unfinished. He pulled me into his office and apologized. “As long as you get the work done, I don’t care.” We were good from that point on.",
            "The best first responses to someone being late is \"are you okay?\"  \nEven when they are regularly tardy, even when you are 99% sure they are slacking off. This shows you care about them as a person first, then about their responsibility. It also incites a totally different emotional response. Think of the difference: \"Why are you late?\" > defensiveness vs. \"are you okay?\" leads to empathy/guilt.",
            "I’ve learnt that in ANY industry, your good deeds are never remembered, your bad deeds haunt you FOREVER.",
            "Great story OP, and delicious MC. but I wanted to point out the following item:\n\n>I Never took a sick day. \n\nThis is not something anyone should ever be proud of. I'm not saying DON'T be proud of it (OP should be very happy they don't get sick often if at all) but no one should ever parade \"I don't take sick days\" as a plus point.",
            "I used to work extra all the time for my job. We do line work, and my job is to fill in for missing people or help the line(\"floater/utility\")\n\nAt least 3 or 4 times a week id volunteer to delay my break to keep working, or come in a weekend to help an entirely different department, or skip breaks entirely- all so the line would run smoothly.\n\nThen minimum wage went up, so they had to restructure their pay system. Previously i was at around 25% above the starting wage- but since the minimum went up, and they didnt want to keep that level, they dropped me down to around 8%. After 10 years. Several people who were hired 3 months prior made the same as me.\n\nDuring the \"assessment\", the plant manager brought up, unprompted, my extra work. I believe his exact words were \" we know you work extra alot but\"(shrugs)\n\nSo extra work was off the table. They went around begging people to work over the legal limit they could demand from us (48 hours)- and every time i laughed in their face. I warned my coworkers to not work extra- that its not appreciated in the least",
            "Keep it up and you’ll be the manager one day.",
            "[deleted]",
            "I never understood managers that would rather have new faces constantly coming in than keep old ones, even if they require some training. \n\nI don't understand why upper management doesn't replace or investigate middle management when the staff is constantly changing.",
            "Good for you. The day I get a boss that tries to micromanage me like that I the day I’ll decide to find a new job. I can deal with a lot of BS from a boss, but being absolutely thankless and choosing to be petty about things that don’t matter? I don’t need that and I won’t put up with it.",
            "I just don't understand why managers sabotage model employees. Are they stupid?? Do they not see the extra work/effort and think \"okay, maybe they deserve a pass\"\n\nThat person doesn't belong anywhere near management. That's front line worker thinking",
            "I was always the guy who picked up extra shifts, did whatever was needed, highest sales and tip % in the restaurant, etc. Never called out sick.\n\nWorked with a bunch of women who were just lazy as hell, did no-call no-shows often, etc. We couldn't fire them, since they'd claim racism and all rally together to try to get a manager fired or a lawsuit. It happened in the past and new management was scared of it, so was corporate.\n\nI had to call out sick once and got reprimanded and shifts taken away. Made no logical sense. \n\nThe big group of them decided to go on vacation together, I told management I was OK picking up extra shifts and working 60-70 hours that week. We only had 6-7 front of house staff on at a time. Another 2 servers and bartender, who were also fed up with that place, decided to pick up tons of extra shifts as well. We were also the \"strong staff\" who could handle 1.5x the workload easily, so they short-staffed it as well.\n\nInstead, we started new jobs at a restaurant down the street that week. Corporate had to shut down the franchise for 2 days after the absolute shitshow on Monday morning.",
            "Man the hours and days are just the same as when I worked as an oil field dispatch. \n\nThe problem with people fucking off and being forced to work stupid overtime is the same as well. At least I made shit tons of cash on the holidays, but it lead to some really retarded hours and thinking I was gonna die after pulling 39 or so hours starting from Christmas Eve at 7 one time. The hilarious thing was even though my asshole coworkers promised it wouldn't happen again, it immediately happened on new years eve, though I suppose I should be happy it was only for like 27 or so hours that time.\n\nGot a raise though, and holiday pay was double standard which got bumped another 50% after 8 hours. I ended up developing a phobia for the standard iPhone ring tone during those shifts since I was laying on the couch in the break room with the phone plastered to my ear waiting to hear any texts or rings to reply to. \n\nIt's gone now, but for a good 2 years after it my heart would lurch in my chest and the skin on my back would prickle up painfully when I heard it.",
            "That manager who got angry at you for being late once is one of those people who can instantly kill the morale in a split second. Moron deserved whatever punishment he got.",
            "You learned a valuable lesson why no one else gave a shit about their jobs.",
            "Something similar happened to me and I learned that I owe management the same loyalty they owe me: none.",
            "Been there done that.\n\nI used to be a spray painter, 9-5 job.\nHowever the nature of drying paint means its best to try and do shit before you go home so it’s “dry” in the morning.\n\nWell long story short I ended up staying till 10 pm to get the job done. As far as I saw it I went way above what was needed of me.\n\nSlept in the next day and didn’t get there till 9.30, when I got in the boss tried to have a go at me, I just laughed and walked away told him “ don’t like it sack me”(I was at the end of my fucks to give at this point as this had been an ongoing thing).\n\nGuess what? boss didn’t sack me or say anything as he knew ain’t nobody else gonna stay till 10 painting a car.\n\nManagers will try to be cunts, however if your good at what you do tho, there’s no reason to put up with it and plenty of places to go and hard workers are hard to replace.\n\nHelps if your a single guy with savings to.",
            "Yep 100% don't treat your hard workers like garbage. People are human and shit happens. 10 mins late once is a no-brainer. I'd be happy to see them in every day.",
            "I get this. My Company doesn't have an amazing payroll system but it works well enough. Thing is, if your shift starts at say 930, it doesn't matter if you punch in any time between 923 and 937.\n\nSo I came in usually on time or a few minutes early, and also usually stayed 5-6 minutes late. Every day.\n\nBoss pulls me aside the one day I was late at 931 and proceeded to berate me in front of the whole region as an example. So... my lunches started being exactly 1 hour, not 56 minutes. My punch in? 930. My punch out? 630.\n\nWas then pulled in for being \"too punctual\" so I asked, \"what times are my shift?\"\n\n\"Well, 930-630 but you clock out exactly at those times every day and have been for the last few months. We need you to stay late to fix issues if they come up.\"\n\nI politely let them know that if I was \"late\" and written up and made an example of showing up a minute late to their time they absolutely would not get a minute of my time. Promptly walked out of the bully meeting, went back to work.\n\nIm on a new team now and the boss gives me the autonomy I seek. I can just do my job and do it the way I see fit without worrying about time punches being 61 seconds late- but I show up 5 minutes early again for this new guy. :)",
            "\\>\"You start at 7 you finish at 7. You are in early on your own time. Those times you have stayed behind you have been paid and no one asked you to.\"    \n\n\n\nI would never usually say this, but your manager is right. NEVER care more about a job than they would care about you. NEVER go out of your way for a job unless it's your career and you really want to move up. No matter how nice and friendly your manager might be usually, the moment you become more expensive than you're worth, you are gone. They do not give a fuck about you. Don't give a fuck about them. I hope you've learned a valuable lesson.",
            "We have a saying at our work:\n\n\"If you want to make money, do the job right.  If you want to make *lots* of money, do what your told.\"\n\n&#x200B;\n\nKinda this sub in a shell though ain't it.",
            "If these dummies need to rely on you working extra hours then they have a staffing problem. You SHOULD be working 7-7 and they SHOULD be finding coverage for their business.",
            "This hits home. Having rotating supervisors in my job I've felt backlash on minimal mistakes aka showing up 5 min late for the first time in 9 months. As a manager, you assess the situation and make a decision. What I wouldnt do is make a power move on one of my most reliable employees. Ok nice ok it happens. Twice? I get it. Three times? Probably a rare fluke. More consistent issues past that I'll have an informal meeting off the books. Hard workers who sacrifice are the ones you pray for. At the end of the day we are all human.",
            "I was that way about my first adult job after I sobered up from an extended party phase. You got away relatively unscathed and learned a lesson about trusting the petty dictators who so often squat in supervisory positions.",
            "Only thing I can say is FUCK YEA! take that!!!",
            "Bro, I’m feeling your pain on this one. I work as a custodian for a high school. Since I started working there, I show up a half hour early, cover anyone else’s work plus my own if they’re out, come in early and work doubles if one of the day shift guys is out, and just bust my ass for the school. I got a letter a couple days ago that my contract wasn’t being renewed. The reasoning; I was 20 minutes late for work when my trucks radiator blew on my way into work and I had to have my mom drive me the rest of the way(she lives close to the school. I usually go and have dinner at her house on my dinner break.) Since that letter, I haven’t been doing a single thing extra at my job and showing up 5 minutes before I start my shift.",
            "Just had the same type of problem, I work in IT so we're always pretty flexible as things come up towards the end of the day and need to fixed so you stay late if needed.  Sometimes you work through lunch because something is going on, no big deal you just leave an hour early (if nothing is going on).\n\nGot a new supervisor in, things seem fine at first.  It's easter, I come in a bit earlier than normal so I can get out a little early (not much, like 20 minutes).  I work through lunch, had an issue and wanted to leave a little early anyway.  Direct decided to give everyone an hour off early, but I was in the middle of something so didn't leave as early as I could have.  I end up leaving after being there for 8 hours (when I could have left an hour earlier).\n\nNext day I get called into the office and verbally repremanded for leaving early, new supervisor waited for 20 minutes in the parking lot to see what time people (or maybe just me) left.  I explained that I did not leave early, I worked through lunch and took no breaks, AND we were given leave to take off an hour early... I was there an hour more than I had to be.  Nope, skipping lunch doesn't mean you get to leave early, and I will keep the 8 hours.  Ok, no problem.\n\nI take every minute of my authorized breaks, and if I bring lunch (at least half the week) I'll just go eat in my car.  Friday we had a problem, external email is down, I find the problem minutes before my 8 hours is up and I'm the last IT guy in the shop.  Oh well, I'll deal with it on Monday, have to keep those 8 hours.  Yes, we have people that work over the weekend (but IT is only on-call for emergencies).  Came in Monday to find multiple tickets about email, who would have guessed.",
            "Not for nothing but it's pretty silly to slight people for calling in sick. That is how you spread illness and get everyone else sick. It's one thing if you were never sick but you're not a star employee for coming into work sick, you're an asshole. As is any manager who promotes this work style.",
            "All I can say to you is Well done!",
            "FUCK IT UP!!!! Your manager shouldn't have squashed enthusiasm",
            "You know you messed up when you pissed of HR.",
            "[deleted]",
            "left a place last year for similar reasons, cunts on powertrips are a lot more annoying than any other setback you encounter,,",
            "What does 'mugged off' mean?",
            "Piccadilly line?",
            "The real lesson here is you're a cog, IMHO.",
            "I wish that could happen to me because the traffic here is bad",
            "Advice from my current boss; if you have someone under you who is good and responsible, treat them well. It's a give and take and if all you do is take, they may very well decide to stop giving.",
            "Clearly your excellence was not appreciated by your manager. Not sure it was even noticed. The lesson is to document and advocate for yourself to make sure you are being rewarded, otherwise you should leave.",
            "Where do you live?\nHere, it is illegal for an employee to work 24 hrs straight. Even the employee could get in trouble",
            "Just because someone is in a Manager’s position doesn’t mean they deserve to be in that position or are intelligent enough to fill that role.",
            "Weird that HR would be the one to talk to a manager about it though. It should be his boss. HR isn't there to punish people.",
            "That entire place only works because of you. Time to get paid by your actual worth.",
            "I've left jobs from shit like this.",
            "You could legitimately threaten them with quitting.",
            "Kind of reminds me of the time I thought I was going to get over time pay but didn't. We got payed every 2 weeks and I had 10 hours of \"over time\" during the first 2 weeks that month. Though, I only worked half days on sundays, so I technically didn't go over the 96 hours. Over that was over time, I had like 93 hours worked or something lol. Still a better paycheck than usual and a month later I got a small raise. The manager felt kind of bad for me :(",
            "To be fair to the manager you really SHOULDN'T be working past your shift as legally they HAVE to pay you for it (if you're in the US). \n\nIt is stupid though to make a mountain out of a molehill with good workers though. Like my boss cuts me a lot of slack with being late because he knows I have a long commute and I'm high performing so the trade off is I don't get my ass ridden about 10 minutes here or there",
            "It's commendable that you feel that way about your job, but be assured, your job does not feel the same way about you. the HR rep wasn't mad that you were told Start at 7, finish at 7, she was made that they didn't have enough people to cover a shift. You're giving them far more than they deserve and you're not giving yourself enough.",
            "[deleted]",
            "Man. Ur manager is crazy. I had my manager request me to pick up someone else shift on multiple weekends because someone else from my team won't be able to.  During a meeting then these guys were complaining that I don't do their job. Well I'm part with of multiple teams and i do multiple work and im pissed because of this. Told my manager from now on i won't pick up their emergency leaves. Now told tge other teams managers that I'll add my team in every mail coz my team thinks that i don't do anything. Now these guys are spammed with 500 pkus mails everyday coz they think i don't work on anything. Plus I refuse to pick yp their leaves for future.",
            "> I Never took a sick day. Changed my holidays to fit the companies needs and worked any overtime they needed me to work.\n\nAnd you're proud of this fact? Way to have no respect for yourself. I'll never understand this ideology in the US we have about work.",
            "Get back to work.  \nNo. Not until I have a formal apology from the asshat.",
            "You really need to learn how not to be the companies bitch.",
            ">20 minutes later the manager came back in looking absolutely defeated. He never EVER said anything to me again about being late.\n\nOkay, but did he apologize to you?Or at least got a punishment?",
            "Never give your all for an employer. Out of all the jobs I've had and all the companies I've worked for, none of them have ever deserved a lick of respect",
            "Just reading your story feels so satisfying, thank you",
            "I hate managers like this. When i managed a call center team if that was me when you arrived at 710 i would have been too busy taking calls myself to talk to you about being 10 minutes late. And then i would have thanked you for getting there ASAP and encouraged you to have a great day.",
            "finally a believable story\n\nnice",
            "Good of you to do that. You just followed the instructions of your manager. I hate it when good employees get shit when they are late for once. Like can't you go have a nice conversation with the people who always come late?!",
            "Happens entirely too often, In My -- very experienced (20 years in the industry, of which about half was on contract for whomever wanted to pay me that week) -- Opinion.",
            "A telephonist at night? What exactly does a telephonist do? If you make phone calls then what’s the point of a night shift?",
            "Bringing the heat!!",
            "Your hr person is the shit. That is exactly what they're there for.",
            "wish the management at my store was more like your HR.",
            "You know what I've realized over time with 4 years working in call centers, 2 years in software and generally just odd jobs here and there?\n\nAny job where there is that much pressure on punctuality is a job that is either\n\na) horribly inefficient and understaffed\n\nb) a job that is there to tick some productivity or PR box at a corporate level (eg call centers)\n\nAny manager or company that is gonna nitpick you for 30 minutes isn't worth working for. Back when people were working in factories to make munitions to win the war I can understand it but in 2019 the idea that 10 minutes is a big deal is just a power play.\n\nBe a barber, be a waiter at a local restaurant, there are local IT stores, look at trades. There are usually vastly better options open to people now than working in what amounts to a factory environment where you are just a faceless drone to your employer. Those days are over. Even the infamous Amazon has proved that a significant portion of manual labor can be done by robotics.",
            "That’s how you get treated when your the star of the show. When the place falls apart because your not there then they point fingers at you. If I’m out my office falls apart.",
            "You did 12hour shifts on the phone?     \n\nMan, how did you survive?    \n\nI remember back when I worked a Helldesk(Tier 1 phone support) and 2 or 3 had full(7.5hour) days of phone support every week. At the end of those two or 3 days I was mentally... Not there.    \n\n(We have an insane amount of apps, locations and whatever to support, and the more you can keep in memory and not have to search up the quicker you can help a user.  So any 'free' time between calls were spent reading documentation)     \n\nRight before I moved to Tier 2, we instituted 4Hour phone shifts. We had to work the phone more days, but for shorter shifts, and the difference was staggering. Sick leave dropped nearly 50% almost instantly. Resolution time dropped like a stone.",
            "I always love when people think they’re going to climb the ranks at random no skill required jobs because they show up early.\n\nCompanies don’t give a single fuck about non skilled employees.",
            "[deleted]",
            "Wtf is a Telephonist? I am assuming this is some failure of translation from the original language to English...",
            "Was explaining hiw trains work really necessary?",
            "This is a pretty poor attitude by the OP:    \n\n> they would call in sick   \n\nPeople get sick. It happens.         \n\n>  I Never took a sick day.    \n\nSo you came into work sick and risks getting others sick, or you just got lucky and never got sick? People are allowed to be sick, thinking otherwise is messed up. It is up to the **business** to build in enough slack to allow a sick employee to be sick, if the business cannot handle a single sick employee then they're under-staffing the position.    \n\nFar too many employees have these kind of unhealthy attitudes, which boil down to siding with their employer over their colleagues. Unless you're an owner of this business, this attitude is irrational. And I feel like this whole story is part of OP's journey but they still haven't realized their attitude towards their colleagues was wrong, they're blaming their colleague's for the business's failings.",
            "I like the story. Don't you think it would be better if you emphasized PISSED instead of WAS though?",
            "These malicious compliance and pro revenge things a lot of them are interesting because if the OPs had better people skills or were just overall better at manipulating others then these situations would never come up because they wouldn't rub people the wrong way or they would make these scrooge bosses too uncomfortable to ask them to work for free and stuff. You shouldn't have to walk on eggshells to stop your boss from being a bad boss of course, but still just makes me realise how the ultimate revenge is tricking your boss into thinking that they aren't allowed to push you around so much, manipulate your interactions with them so that they don't comfortable chewing you out over nothing or bringing up your negatives while your positives still outweigh those negatives. It's not nice to manipulate people but for things like this it's easier in the long run, and besides it's not \"real you\" manipulating them to make your own life easier, it's \"work you\".",
            "[deleted]"
        ]
    },
    {
        "post_id": "c5qmee",
        "author": "darkenedgy",
        "title": "You want straight As? Okay, mom, I'll get straight As.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c5qmee/you_want_straight_as_okay_mom_ill_get_straight_as/",
        "score": 18147,
        "num_comments": 787,
        "created_utc": 1561560018.0,
        "selftext": "This particular incident was back in 8th grade, but my mom's always been competitive about scholastic achievement. I wasn't bad at academics, but saved my competitive streak for more important things like kicking my friends' asses at Street Fighter.\n\n\nAnyway, the morning of the math test, I felt absolutely unwell. The conversation went something like this:\n\n\n\"Mom, I don't feel good. I need to stay home.\"\n\n\"No.\"\n\n\n(She's from India, they straight up don't accommodate sick days. Hopefully it's changed since. I tried to explain America is more chill about these things, but somehow it didn't work.)\n\n\nSo I sped through the test, handed it in, ran out the door - with permission - and vomited in the first toilet I got to. Yeah, definitely going home for the day.\n\n\nAs a result of subpar performance on said test, my grade for the quarter was an A-.\n\n\nCue mom: \"An A- is the same as a B+! You need to do better!\"\n\n\nI was pretty salty about the situation with the test, so like any 11yo with cable and my own room, I binge watched Toonami instead of paying attention to my math homework* for the rest of that semester.\n\n\nShockingly at the end of it, I had a B+.\n\n\nMom wasn't pleased.\n\n\nSome kind of generic yelling later, I came back with: \"It's the same as an A-.\"\n\n\nWelcome to the commutative property, mom.\n\n\n\nTl;dr: mom tries to get me to do better at school, but phrases it in a way that justifies doing worse\n\n*Edit - I still did my homework, I'm not a maniac.",
        "permalink": "/r/MaliciousCompliance/comments/c5qmee/you_want_straight_as_okay_mom_ill_get_straight_as/",
        "comments": [
            "Nah, things haven't really changed here in India.\n\nJust last semester a friend of mine had her leg broken so couldn't attend college lectures. When she confronted the prof regarding this, how shes lagging behind and everything (unable to do assignments and all), he,  with  a straight face, said \"You can always do this again next year\"",
            "There's nothing I hate more than parents who send their sick kids to school, or adults that come to work sick as fuck.\n\nI don't want your damn illness.  Stay home, rest up, then come back into work when you're functional.\n\n[EDIT] The number of people excusing shitty behavior from their employers is nuts.\n\n1. If they demand a doctor's note, go after them to cover the cost.  They're the ones needing it.  They are a business.  They can afford it \n\n2. Businesses should be giving paid sick leave.  Sick workers destroyed efficiency and productivity.  Letting one person stay home sick with pay is likely going to cost less than an entire office trying to concentrate while they're sick as fuck.  7-10 paid sick days a year should be a standard minimum.",
            "Am brown. Can confirm that I went to school with high fever several times.",
            "Indian tiger mom's yeah mate take it easy your never gonna get past ,get better grades the indians have it ingrained in their head about how important it is to excell in education",
            "Kind of reminds me of my mom, she wanted me to not get anything below a B, ok done, AB honor roll.\n\nWhen I proved I could do that she switched it to nothing below an A, ok, k would check with my teachers and if I had assignments missing (marked as a 0) but still managed to have an A average I just didn't turn those in. Well apparently my mom checked my grades through her parent Portal and saw the Zeros, found out I wasn't turning them in by choice, and changed it to absolutely no 0's in my grade book.\n\nNow because I had to do every, single, assignment, instead of only the heavy weight ones, I started falling behind in my grades because I was trying to keep up with all of them. Ended up graduating with a mix of A's, B's, and C's instead of an AB honor roll. Mom was pissed, but I still got accepted into my college of choice and have gotten a few decent scholarships",
            "Lmao good one. \n\nDid she hit you with the classic, \"Oh God, my son has started talking back to me. What am I gonna do\" ?",
            "See my parents don't care about school or grades and then magically the last week of the semester comes around and they start caring about shit. Now I keep up my grades because I know that moment is coming but throughout the semester they're like \"oh grades don't matter, just try your best\" and then it's a complete 180 later.",
            "That's not commutative, that's ~~reflexivity~~ symmetry in an equivalence relation. Commutative means AB-BA=0",
            ">She's from India, they straight up don't accommodate sick days. Hopefully it's changed since. I tried to explain America is more chill about these things, but somehow it didn't work.  \n\nI've never understood his - especially when someone is contagious and a simple way of not spreading it is for the person to stay home and rest.",
            "My father wasn't happy when I got grades A or higher. Always said I needed to work harder and that I was wasting too much time on games. He couldn't do shit when I eventually burned out and got Ds and Es.",
            "When I was a freshman in high school, I had a geology teacher who was so tough that in her 30ish years of teaching she had only ever given one A, and she had the nickname of \"Dr B\\*\\*ch\" from the students.\n\nI worked my *ass* off to try to get a B. I got a C+. My father went nuts, I literally got screamed at for 4 hours. \n\nAfter that, I realized that no matter what I did, no matter how hard I worked, I'd never succeed in her class, my father would go nuts, and I didn't need that class to graduate. So I did *nothing*. Not one damned thing. I didn't do the studying. I didn't do the homework. When she handed out a test, I signed my name at the top and turned it in blank. I didn't answer any questions in class. I put all the mental energy that would have gone into that class into doing well in my other classes. (And indeed, I got As in all my other classes.) \n\nThat second quarter, I got a D+. My father went nuts and screamed at me for 4 hours. I couldn't get a word in edgewise to explain that the fact that I got a D+ proved that grades were arbitrary because I should have gotten an F-, he just wanted to scream at me. \n\nThe next quarter I continued to do nothing. I figured, I was going to get screamed at for 4 hours either way, so why bother? I got an F+. My father completely lost his mind at me and literally spit in my face. (At that I walked out of the house for a few hours and we didn't speak to each other for several days.)\n\nThe next quarter (the fourth) I continued to do nothing. I got a D+. My father screamed at me for a couple hours before I finally got through to him that the fact that my grades went up and down while I did *nothing at all* proved that the grades were arbitrary. When he finally realized what I was saying to him, he went sheet white and shut up. He didn't apologize, he just left the room. The next day he went into the school and yelled at the principal. It did nothing, but at least he wasn't screaming at *me* any more. \n\nI don't know if he ever realized that this is what he gets for incentivizing me badly.",
            "My friend I grew up with would insist on getting a's in every class, all through highschool and college. She was super stressed out and always working. She says she wished shed relaxed a little because straight a's didnt change anything in her life. She works as a patient services rep at a drs clinic, that doesnt require a degree.",
            "You were 11 in 8th grade?\n\nYou skip a couple grades?",
            "My mom put her foot in her mouth once with this too. I wanted to get my belly button pierced FOREVER so when I was a sophomore in high school she said “fine you make straight A’s and you can.” Well, I did. It gave me so much respect for her though because I knew she didn’t want to take me and she said, “I’d rather you have something I don’t like than for you to think I’m a liar” and that gave me a whole new understanding of parenting and how amazing my mom is.",
            "mom: it's almost 10 oclock\n\nme: it's 9:04, what are you talking about.\n\nmom: ya, almost 10 oclock\n\nme:  ????????",
            "I almost flunked 11th grade math because I despised (and still do 12 years later) the teacher. When they called my mom about it I told her I wanted a new teacher or I'm failing it and just taking care of it over the summer.",
            "My mother was like this.  But worse.\n\nAny letter grade below A+ was a month's grounding. So an A was one month, A- was two, B+ was three, and so on.",
            "Parent: uses poor reasoning\n\nTheir child: uses same poor reasoning in return\n\nParent: surprised pikachu",
            "Which is why I prefer number-based grading, so I can know how much % of smart I am (or, depending on the subject, how much I am not).",
            "In New Zealand, we have an expression \"sweet as\"\n\nWhen I read this title I thought \"straight as\" was used as \"as\" instead of A grades.\n\nI'll make you bloody straight as, said the homophobic mum to her gay child.",
            "> Welcome to the commutative property, mom.\n\nIf A- = B+, then B+ = A- is actually the reflexive property. (A=B implies B=A)\n\nThe commutative property is (A+B = B+A).\n\nNo wonder you got a B+ on your math grade.  :)",
            "As a math teacher I absolutely **LOVE** your use of the *commutative property* here.",
            "So how long did it take your face to get back to normal after she slapped the smart ass off it?",
            "11 years old in 8th grade? What the hell",
            "Ooo! That’s fucking killer - love how you used a math theory to prove you got an “A”",
            "Desi parents be like that",
            "Did anyone else read this title in an Australian accent at first and get confused?",
            "So did you get your ass beat after the come back like what happens to most Desi kids?",
            "Well I had to appear for my exams with my injuries from an attempted suicide because my mum and dad wouldn't let me stay home.",
            "the simple fact that you remember the name of a property other than the distributive means you worked harder than me in maths so good job there",
            "\"An A- is the same as a B+\" might be the dumbest \"because I said so\" type of parenting comment I've ever heard, and my parents set the bar pretty fucking high.",
            "I'm brown too, I feel your pain.",
            "I choked my abusive father unconscious in middle school.",
            "The more I hear about india, the more I worry about the people there. like, are yall okay?",
            "Have chinese parents, can confirm. I fucking went with 40°C. Culture and traditions are bullshit.",
            "This feels less like 'malicious compliance' and more like what my mom called \"cutting off your nose to spite your face\".",
            "If you could’ve gotten an A and you didn’t, that sort of self-sabotage hurts you the most",
            "Lol brilliant, when was this?",
            "So are u a doctor now, or a rebel barista?",
            "( ͡° ͜ʖ ͡°)",
            "Your school performance is ultimately for you, not your parents. Do well because you will benefit, not for someone else",
            "First reaction at the start from post title and first few lines- \"Sounds familiar\". Reads on... \"Indian mom\". I have seen a lot of moms(atleast one parent in every house) like this in every neighborhood I was in and moms of almost every friend I had. I definitely lucked out with my mom, dad is still quite like this. This definitely is an Indian parent thing to do",
            "I spent way more time than nessisary wondering what a straight as was",
            "[deleted]",
            "> I binge watched Toonami \n\nNice. That's some good taste, OP.",
            "You just roasted a bunch of people I know because they didn't do their homework",
            "That would have gotten me grounded.",
            "Four months ago I had pneumonia and was out for 10 days. I had gone to the ER to get diagnosed,  then to my GP and a pulmonologist. Had 2 other sick days as well. I have colitis and have it pretty much under control except for the 2 days mentioned.  Fast forward to last week. My performance evaluation dinged me for being sick. Said I placed undo hardship on co workers.",
            "commutative property LMAO",
            "r/monkeyspaw",
            "Shout to my man and all of us who have skated through life doing close to nothing but getting that B+ without any of the effort.",
            "How much Street Fighter ass did you kick and how many times did you, \"Hadouken\" your way to victory?",
            "From India, it hasn't changed. School still sucks.",
            "My daughter had a friend that gets grounded for Bs. My daughter (15) is taking honors and AP classes by choice. No way I'm going to steal her thunder by punishing for an adequate grade.",
            "Oof, also desi here, in 8th grade I remember going to school but I was so sick that I barely had the energy to move. My teacher forced me to go to the office, but I had to wait a few hours doing nothing except feel miserable while my parents finished their work and then picked me up. I was thankful that they were more accepting of it (probably because it wasn't my choice) and actually picked me up.",
            "I love when parents let out their need for perfection on their kids. And then aren't even reasonable about it or doing their best to actually support a good performance in school.\nGo educate yourselves first parents, before trying to raise kids.",
            "Dang that blew up in her face faster than a Cheetah on crack during mating season",
            "Great read kinda r/wholesomecompliance in a way, they may enjoy a crosspost :)",
            "Can a new sub be created for teenagers being bratty? \"I didn't do my homework\" is not malicious or compliance",
            "Dunno where you are in life today, but it's more important to learn and practice doing difficult things than to do everything perfect. In that regard, your use of the (property of symmetry, I re-learned in this thread) is a perfect example ;) Most successful entrepeneurs didn't get all As in their education, for instance. \n\nThey were smart enough to, but spent their time optimizing other things. Getting straight As is mostly about behaving nicely and doing what's expected of you while being quite smart and very hard-working. The greatest professional success is often about being smart while _not_ doing what's expected of you. Although you'd likely get a fair amount of success doing the latter as well. (Source: Got more good grades than I ever needed to, which was nice but not an instant ticket to millionairehood).",
            "As a former math teacher I'm totally impressed.",
            "Ah yes the old Asian \"Perfect Student\" routine and how nothing is ever going to be good enough for them. Asians really don't care about their kids and care more about how their kid can make them feel good about themselves hence why lots of Asian parents make their kids take orchestral instrument lessons, forego relationships of any kind be it romantic or other, and generally turn their kids into sociopaths where the kids start thinking and acting like those Asian tourists people always complain about. \n\nIt's not about \"a better future\" it's all about the twisted sense of pride, feeling elite and treating others who are not \"as good as you\" as trash.",
            "Ah yes, parents using their children to work on their own complexes.",
            "Tank your own grades. Way to show your mom. Got her.",
            "“Mom, I’m not feeling so good”",
            "I wonder how many other kids got sick after you being forced to go to school with the flu.",
            "[deleted]",
            "Damn.. She is so asking",
            "I know how you feel, This happens to me a lot and has happened before, it sucks being proud of your grades and then having your parents punish you for them",
            "Yeah someone should tell her that A- and B+ are actually different in America. \n\nWe’re talking a few percentage points, but they literally are not the same. \n\nAt my high school: \n\n93% is A-\n\n92% is B+\n\nCollege:\n\n90% is A-\n\n89% is B-",
            "With the sole exception of your senior year of high school and applying for colleges, nobody is ever... *EVER* going to give even a fraction of a shit what kind of grades you got. No human resources department anywhere in the world is going to waste time even considering asking you about your middle school social studies test scores. They're not even gonna ask about your test scores on relevant college classes: if you passed, you passed.",
            "...I'm really confused.  Your mom said you need to do better than a B+/A- - how is it malicious compliance to stay on that grade?  (I know they're not literally the same, but for the purposes of the argument made in the story, they are).",
            ">(She's from India, they straight up don't accommodate sick days\n\n She lied to you, I finished highschool 7 years ago and they accommodated my sick days even when I was in 1st grade, same for my sibling who finished highschool 15 years ago. You don't even need a doctor's note for a single day.",
            "Whoops, accidental post.  Sorry",
            "I'm so glad I grew up with the polar opposite of your parents.",
            "What did your mom say to that?",
            "You were 11 years old in 8th grade?",
            "You're not a maniac, you're just mad",
            "Pretty sure this belongs on r/madlads.\n\nOn a more serious note, OP, I get that this shit is tough, but don't tank your own grades just to prove a point to a bitch.\n\nTry your best, fight back when you can/need to, but do the best you possibly can so you can get the hell out of there, else you'll have to deal with this for the rest of your life. Complaints about grades will turn into choice of degree will turn into grades will turn into choice of career will turn into pay grade will turn into \"you'd have a better career and more money if you'd done exactly as I said, when I said it, because I said it\"  will turn into choice of partner will turn into how many kids you're gonna have will turn into raising your kids will turn into pay grade will turn into \"how dare you not look after your mother enough after all I've done for you\".\n\nIt NEVER ends. Prepare now, to get out when you can.",
            "You were 11 years old in 8th grade? Did you skip a grade or two?",
            "I approve of this life decision, Sir. Education be damned. Ruining peoples lives via Vega is much more useful.",
            "We are not allowed to send kids to school with a fever or if they have thrown up within 24 hrs.  It is in the policy that parents have to sign.\n\n&#x200B;\n\n\"vomited in the first toilet I got to \" would have a call to the parent reminding the policy and giving a warning.",
            "You’re mom sounds like a real piece of work..."
        ]
    }
]