[
    {
        "post_id": "vz7y0w",
        "author": "plogan56",
        "title": "my friend's cousin complied with his \"cool\" family's demands",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vz7y0w/my_friends_cousin_complied_with_his_cool_familys/",
        "score": 18148,
        "num_comments": 622,
        "created_utc": 1657836770.0,
        "selftext": "This happened a while back, maybe 3-4 years, my college friend told me about how his cousin basically screwed over his family by moving out when they told him to.\n\nNote: to make it easier to follow i'm gonna use fake names cousin(jack), cousin sister(tina), cousin's parents( bob & mary)\n\nSo jack is roughly 28 and still living with his parents, but he pays their bills (elec, water, internet, etc.) and this is a big 2-story house so the bill is big too; his sister ,24, had left the house by then and gotten married to a guy that makes good money. She had taken credit for paying the bills and convinced bob and mary to kick him out because he's a \"shut-in loser\" because none of them understood his job.\n\nA bit of backstory on their parents, my friend tells me they're like those steryotypical teens in those cliche highschool movies, basically they look down on nerds and think people who study hard are 'uncool' that type of thing. Anyway they kept that mentality even after growing up and having kids, so they always looked down on jack for being nerdy and favortised tina because she was pretty and popular in highschool, but apparantly jack didn't really care because his personal life had friends he cared about and he connected more with his relatives.\n\nSo they all confront him and after badmouthing him about how he stays in his room mostly and how his sister, her husband & child need the space, told him he has till the end of the month to leave, this was done close to the first week; jack didn't say a word he just nodded and left by the end of that week and moved 3 cities away to a city closer to his other relatives.\n\n2 months go by and his sister calls him aaking why this month's bills weren't paid, as their lights and water had been shut off, he tells her that she should've paid them since she was \"allegedly\" paying them before. Abouut a week goes by and he gets a call from his parents explaing how his sister confessed to everything and how he can come back and have his old room back so long as he kept helping them pay the bills. He refused saying he's enjoying living by himself now and how he can focus on his work more because he's away from them; afterwards he blocked their numbers and now they have to pay for it themselves, he dooesn't know what happened after because they're no longer invited to family gatherings.",
        "permalink": "/r/MaliciousCompliance/comments/vz7y0w/my_friends_cousin_complied_with_his_cool_familys/",
        "comments": [
            "How can anyone, especially if the are the parents, live in a household and not know how much it costs and where the money is coming from?! Amazing.",
            "Kick out the golden goose and complain about the missing eggs.",
            "If Tina's husband makes good money and they just moved in with the parents why can't they pay the electric bill? I mean it can't be that much especially compared to rent or a mortgage somewhere else...",
            "> he gets a call from his parents explaing how his sister confessed to everything and how he can come back and have his old room back so long as he kept helping them pay the bills.     \n\nSo the shitheads couldn't even muster an apology and instead tried to put on airs like he's allowed back in the kingdom?",
            "A friend of mine works an remote IT Job, and moved to his wife's hometown when his mil got sick. \nAll well and good except the MIL doesn't accept that he's really working, dispute him being the soul breadwinner in the house, constantly interrupts him or wakes him up when he's sleeping after covering night shifts.",
            "They sound like they went to school to be pretty and popular and not to learn. Being pretty and popular is not a crime, but focusing only on that aspect is definitely one.\nJack did well, now Jack can be free AND happy with his financial security. Be like Jack.",
            "Obviously, the parents and sister didn't know Jack.",
            "Some people never grow up, even after they have kids. The fact the parents are still like this means both kids did the right thing by leaving, although both should have left in their early 20s.",
            "Out of curiosity, what did he do for his job?",
            "Isn’t your friend’s cousin’s sister also your friend’s cousin?",
            "As satisfying as it is, I am pretty sure there are a combination of other things that merit this reaction. But drastic changes seem to be the best opportunities sometimes.",
            "[removed]",
            "Ive read this story before but there is less detail this time around",
            "Good for him. Sister's chickens have come home to roost, LOL!",
            "Does this feel like a repost to anyone else?",
            "Wait i thought tina moved out. She is back living with em?",
            "I'm Jack's complete lack of surprise.",
            "\"I am Jack's unpaid utility bills.\"",
            "The funny thing to me is that \"Tina\" convinces Bob & Mary to kick out Jack so she can move back home with her husband and child... but expects Jack to keep paying the utilities after getting kicked out.  And, apparently, she convinced her well-paid husband of the same - that they could move in with her parents and live there *for free*.  I'm guessing he refused to pay the bills once he found out it wasn't true.\n\nTruly entitled thinking there... if true.",
            "I guess they didn’t realize they were living in The House That Jack Built, eh?",
            "Someone’s mad at their parents and writing short stories lol",
            "I don’t get why she assumed he’d keep paying after doing that to him. That’s wild.",
            "why the fuck did they expect him to pay bills for the place he no longer lives in? What a bunch of idiots.",
            "So...the parents didn't even know how the bills for their house were being paid!?\n\nThat's insane!",
            "With this quality of writing, are we supposed to believe this is real?",
            "r/EntitledParents  would like a read.",
            "You are jack aren’t you?",
            "Did she really think he was going to move out and just keep paying the bills? LMAO",
            "This reads like a wattpad novel",
            "I have my doubts on the authenticity of this post. Where I live they won’t shut off utilities after only a month or two of unpaid bills. In the winter time it is even illegal for companies to cut power at all, they can only limit the power. Also, for someone to pack up all of their belongings, find a place in a city three cities over, and move everything there within a week is a questionable timeline.",
            "That was a cool story.",
            "LOL. We had neighbors who gave their daughter control of all their money and finances. She spent all the $ n everything but the house, utilities, etc. They don’t live there anymore. Bankruptcy and all that.",
            "Sad that he had to do that to escape from a toxic environment and relationships but good for him for getting away. Wishing him a most wonderful life XXXXOOOO",
            "This is a fairy tale written by a child.",
            "The Entitled Asshats learned the hard way, \"Be careful what you wish for; you just might get it!\"  Sucks to be them!  🤣",
            "apparently, the parents didn't know jack....shit",
            "\"Favortised\" hahah",
            "GOOD FOR HIM!",
            "UGHHHH THAT ENDING. *Chefs kiss*\n\nI'm so happy for him.",
            "Old story, posted here several months ago.  What was left out in this version is that jack was making money at home with his computer somehow.  That is how he could afford to pay all the bills.",
            "I smell Billy BS",
            "Bollocks.",
            "It takes at least a month after a missed payment for utilities to be shut off.",
            "They sound like shit people and even worse parents. Buying Gucci but can’t be bothered to pay their own utilities? Fuck them. Glad he left. Better late then never.",
            "I'm really happy about Jack though, somehow I feel this was a wholesome ending for him, although it's sad to see families messed up like this.",
            "Why would you \"change the names\" and not use them except for the main character?",
            "How are people so mean AND dumb?",
            "Sounds like a darman episode",
            "It sounds like things worked out for Jack, and looking at how he blocked them all after moving out, things were bad enough he just wanted them all out of his life and chose to accomplish just that.\n\nI may be missing something, but part of me thinks he could've just said \"I won't be paying your bills anymore\" and revealed how much he had been contributing the whole time to try to salvage something from their relationship rather than burn everything down. Still, glad he got the win in the end.",
            "[removed]",
            "That last sentence tells me this probably isn’t a true — the fib in the last few lines really gives it away. \n\nHe would invariably find out what happened to them. \n\nJack blocked them but he moved nearby extended relatives he connected with. It would literally be impossible to not know how they fared.",
            "What did the sister confess to? To claiming she was the one paying the utility bills? Who was she telling it to friend and family, etc? Like the parents didn’t know who was paying it the lights stayed on so never bothered to ask?",
            "This is the way.",
            "Am I the only one curious what Jack did for a living?",
            "How did Tina badmouth him and why? What did she confess to?",
            "Man.... with family like that who needs enemies....",
            "The names make it harder because now I have to keep scrolling back to the top to figure out who the hell someone is",
            "When the trash takes you out you still come out on top because you're away from the trash.",
            "This society has to get out of the mentality that having a kid somehow makes you a smart, good and caring person. Parents are wrong and/or abusive a LOT and anyone who claims they aren’t are morons. The number one problem in the US is the utter lack of empathy to fathom the situation of another person. If it doesn’t directly affect them it doesn’t exist. OP’s parents made their own bed by not bothering to actually understand their own situation, much less their son’s and they got what they deserved. And will likely now be better off for it because they will now be forced to deal with all the stuff their son was paying for.",
            "God. As a person who hates his family this was delicious. Take my thumbs up",
            "I am Jack's smirking revenge.",
            "I just saw the dad's name is Biff in my head.",
            "[Jack is Happy now! ](https://youtu.be/52cQeFBU2Kw)",
            "I believe this story. It was mine, I worked multiple jobs to pay my families bills, just to be called a worthless bum by them. Leaving was the best thing for me as well. Wtg Jack",
            "Honestly props to the parents for raising a normal human whilst being mentally challenged. Who the fuck owns a house, lives in it and doesn't know who pays the bills??",
            "Sister, husband and child need space so instead of suggesting they get their own place, the parents evict the billpayer? And sister expected bills to still be paid? What a bunch of idiots.",
            "This guy must have clicked through one of those adverts about making 2k a month from his bedroom",
            "Is this good for r/ProRevenge or something lighter?",
            "I don’t believe this story at all, and I’m leaving this comment as a show of solidarity with all the other readers who don’t believe it either.",
            "What goes around comes around. Serves them right. \n\nAnd the audacity from your sister to think you'd still pay all the bills even when you were told to move out... \n\nThey got the reality check they deserved for sure.",
            "Long, but worth it?",
            "Nerds run the world",
            "your keeyboarrd is chhattering",
            "Why the fuck would he want to live at home at 28??",
            "This story made me smile, because Karma actually worked.",
            "Jack complied with their request for him to move out.  However, they made no request for him to stop paying their bills.  As you described, they suffered as a result of him ceasing doing something they weren't aware he was doing.  In my opinion, this is not malicious compliance, because moving out doesn't necessarily mean the one leaving will also stop paying bills.  They suffered not as a consequence of him doing what they asked him to do.",
            "[deleted]",
            "Love it!! I hope he is doing great!!",
            "Well one gets what one deserves. If the bills weren't being either the Sister (Tina) or husband should have begun paying the bills.",
            "Play stupid games....",
            "I want to know what his job is.",
            "Jack needs to get therapy if he hasn't already. His family is made up of jerks.",
            "*satisfied smile*",
            "Damn, good on him but I can't imagine people so fucked up and act like that towards their kids.",
            "Thank you for using names and not those fucking stupid acronyms.",
            "Jack deserve a good family.",
            "Have you ever watched the genius TV series \"The Royle Family\"? The cast of characters sounds the same.",
            "Justice is so sweet. Treat someone like trash. Gets some of there own medicine. And comes crawling back but gets a hard nop.",
            ">because none of them understood his job.\n\nI'd be interested in knowing what his job is. Freelance IT worker, I'm guessing.",
            "Good for Jack! This was probably the best thing for everybody",
            "Revenge of the NERDS part two....",
            "lololololol!!!!",
            "The Cut Off. I love it.",
            "This smacks of neck beard fantasy. You sure you're not just having a laugh?"
        ]
    },
    {
        "post_id": "15a74f4",
        "author": "Fan387",
        "title": "Over 100 trans men enter Miss Italy pageant after organiser says only “women from birth” allowed",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15a74f4/over_100_trans_men_enter_miss_italy_pageant_after/",
        "score": 18139,
        "num_comments": 1713,
        "created_utc": 1690381122.0,
        "selftext": "https://uk.news.yahoo.com/over-100-trans-men-enter-132230515.html?guce_referrer=aHR0cHM6Ly90LmNvLw&guce_referrer_sig=AQAAAIbFGDhEPR-FpLocBi5DELbUlZhGgQJ6T6bl_v4R-GUzdYi6y11q3G90Dbwl0WSetRbquxu1WrQEnirrRGuDD6oYqza9BYbuaRvkqAyvERavJu5JVuCIQ9hBZln4M55MPFeOXkBnIcVoo0BRmBBoVnA113HTjTskC9YdNzdO2wQI",
        "permalink": "/r/MaliciousCompliance/comments/15a74f4/over_100_trans_men_enter_miss_italy_pageant_after/",
        "comments": [
            "We encourage you all to continue to engage with each other in the comments in good faith. However, it's critically important to maintain a constructive environment. Comments consisting of only personal attacks or prejudices will not be allowed. These behaviors are against the rules and guidelines of our subreddit. As such, violators should note that the moderators may take appropriate actions and issue bans without warning.\n\n**Treat each other with respect.**",
            "De-Eviled link:\n\n[https://uk.news.yahoo.com/over-100-trans-men-enter-132230515.html](https://uk.news.yahoo.com/over-100-trans-men-enter-132230515.html)",
            "The article incorrectly says they boycotted the pageant by registering but the proper term would be either protested or disrupted the pageant. Boycotting (refusing to purchase/us goods or services from a specific company or industry until it changes it's practices) is one form of protest, but not all protests are boycotts.",
            "Here's the text from the article without having to bother with all their ads and nonsense.\n \n\"After the organiser of the Miss Italy beauty pageant declared that trans women are excluded from the competition because contestants should be “women from birth”, over a hundred trans men decided to boycott by entering the contest.\n\nSpeaking to Radio Cusano earlier this month, Miss Italy’s organiser Patrizia Mirigliani said that she is not going to update the beauty pageant’s entry regulations, which currently exclude trans women. Mirigliani stated that Miss Italy contestants should be “women from birth”, adding that she had no intention of jumping on the “glittery bandwagon of trans activism”.\n \nHer remarks came after 22-year-old Rikkie Valerie Kollé made history on July 8 when she became the first trans woman to be crowned Miss Netherlands. Commenting on the news, Mirigliani said: “Lately, beauty pageants have been trying to make headlines by also using strategies that I think are a bit absurd.”\n\nAfter Mirigliani’s comments emerged, trans men in Italy started a boycott of the beauty pageant and applied to enter the competition. Since the process to have one’s preferred gender and name legally recognised in Italy is a lengthy one – and not based on self-declaration, as it is in Ireland – these men technically fit all the criteria to enter the competition: they are of Italian nationality or citizenship, over 18 years old, are still registered as “female” on their identity documents and were assigned female at birth.\n \nThe campaign was first launched by trans activist Federico Barbarossa, who spoke to Italian newspaper La Repubblica saying that the goal was “to trigger, through a joke, a reflection on the absurdity of some logics out of time and out of the world.\n\n“Someone imagines us as three-headed monsters who could never aspire to win a beauty contest, because even the media representation often brings forward narratives that fetishize our bodies,” Barbarossa added. “With this campaign, we are giving visibility to the truth of trans people”.\n \nHis move was then followed by many other trans men in Italy, among whom is trans activist Elia Bonci who, in another interview with La Repubblica, said: “I took courage, used my deadname and signed up for Miss Italy. Because fighting transphobia is intersectional and even though I’m not a trans woman, I’ve decided to fight for their rights.”\n\nBonci continued by saying, “Miss Italy is not just a beauty contest, but it is part of the country’s cultural history. And excluding trans women automatically means excluding them from history. Pretend they don’t exist.”\n\nThe post Over 100 trans men enter Miss Italy pageant after organiser says only “women from birth” allowed appeared first on GCN.\"",
            "Actually, this is pretty funny. They're technically correct, which is the best kind of correct.",
            "Commenting on the news, Mirigliani said: “Lately, beauty pageants have been trying to make headlines by also using strategies that I think are a bit absurd.”\n\nOh no, they're making an absurdity of the otherwise so normal concept of beauty pageants",
            "[deleted]",
            "Honest Opinion:\n\nBeauty pageants should end. This could be a good opportunity to End Miss Italia, and everything alike.",
            "God forbid women are allowed their own spaces and events...",
            "Oh dear god, Reddit is more of a cesspool than I thought.",
            "It's almost like beauty pageants are fucking stupid...",
            "It's the same idea with DeSantis' law. My oldest is trans and I have a good friend that's also trans (F-M). Both have facial hair and basically look like men.\n\nImagine seeing either of them in a woman's facility and wait for the complaints. Heck, a 'from-birth' guy could now enter a woman's facility and how would you make sure? It's not like he's going to let you physically examine him and if they've had bottom surgery, even that isn't going to prove anything.\n\nI think this opens up women and girls to more possible issues. And of course, we have to protect the women in the country. It's not like men are complaining about trans people in their facilities.",
            "I think this is a really nice way for trans men to support trans women. Bravo.",
            "I don't think the writer knows what boycott means.",
            "KINGS !!!!",
            "Holy shit all the scumbags are coming out of the walls with this one",
            "This is a level of petty that most people only aspire to. \n\nI love it!",
            "So many people in this comment thread not understanding what a “trans man” is. Probably a lot of trabsphobes misusing terms deliberately, but also probably some people genuinely trying to understand. Here’s some terminology in case you are confused:\n\n“Trans man” refers to people assigned female at birth (AFAB) who are actually men, and have transitioned (which can mean different things for different people - transition does not necessarily imply any type of surgery.)\n\nSame goes for trans women, they are AMAB (assigned male at birth) but are actually women.\n\n“Trans” is a modifying adjective to the noun man/woman. Just like blonde woman, tall man, etc.",
            "Well, it's what they asked for",
            "Absolute mad lads! Love it!",
            "[deleted]",
            "Yaaaassss!!! I love seeing men supporting women!",
            "I love a clever protest",
            "Saw my ex liked the original story (the trans women getting excluded). The final ounce of nostalgia vanished as i realized she’s a transphobe",
            "Good. Fucking good.\n\nI can understand when they want to argue about trans women not participating in sports with cis women. That I see the point because sometimes they will have an advantage. But there was no reason for them not to be allowed in a fucking pageant. If they win, they win. If they lose, they lose. Them being trans had nothing to do with how well they might potentially do in a pageant. I saw all the transphobes crawling out of their holes when this news first came out and it was disgusting to see.",
            "Unpopular Opinion: Just let the women have their own pageant why does men need to interject themselves in everything, first sports now pageants?",
            "Ok but this just reinforces the viewpoint of the organisers, the trans men enter the conpetition as women, they will be judged as women, therefore they are accepting the judgment of the pre-election commission,  who will say \"this is a woman, and she is too ugly to participate \" , \nIt does not affect the competition at all , and in a way , it can be seen as those transmen admitting that they really are \"just ugly women\" , i would call this very cou terproductive for their cause",
            "God this is MC at it's absolute finest.\n\nI for one gleefully support our... brothers?... in arms, and cannot wait to see how this falls out!",
            "[deleted]",
            "Well that’s a pretty fun way to make your opinion know. For sure\n\nI’d say that yeah they can apply and then most of them would be rejected because they look like men right?",
            "This is why we can’t have nice things",
            "All they had to do was say the pageant was only for \"cis-women\". My understanding is that just means actual women. \n\nAlso, pageants are so fucking stupid I can't believe they still exist.",
            "What a bunch of dicks",
            "I’m confused on how this is an effective protest. The people judging are gonna kick them out on the grounds that they aren’t very attractive women and send them home. Am I missing something?",
            "Hello? Based department☎️? We got somethin based",
            "Thing of beauty, no pun intended. Thank you for posting this!",
            "Like it or not, everyone in the world doesn’t have to cater to someone’s self image.",
            "pretty fucking based",
            "Well, they should certainly be allowed to compete. Just don’t be upset if you dont win",
            "[removed]",
            "Only people who “nature randomly handed a vagina”. FTFY",
            "I see no issue here. Why can't an organization decide who they want to compete in their contest? As for the men signing up, that's fine too. I just don't think they're likely to win lol.",
            "Okay so they are admitting they actually are women and not men",
            "All these people are really boring",
            "❤️🏳️‍⚧️",
            "That's fine. Idk how pageants work but i assume they have some way to narrow down the amount of participants. Odds are if they enter, they won't make it very far looking like some dude",
            "and now if they hate THAT we will see if they care about safe space for AFAB or just hate trans.",
            "people don’t want to watch trans people cosplay as Italian models….",
            "That’s just compliance.",
            "So, what you are saying is that everyone followed the rules for entry?",
            "[removed]",
            "Ok but what's the problem, if they want to enter the contest and follow it's rules, they're perfectly allowed to do that. Not sure what do they want to prove by doing that though... Regardless of if any of them wins, the winner of the contest of Miss Italy will be a woman from birth, exactly as organisers intended. So how is that a protest? What is it supposed to prove?",
            "If you’re not a woman, the pageant isn’t for you. Very simple!",
            "God I fucking hate the human race.",
            "[removed]",
            "This isn’t the own you think it is lol.",
            "Don’t they realize the real point they have made? No matter how masculine a woman appears, no matter how altered her body is, she’s still a woman. I hope one of the trans identified contestants wins so that more people can see that. Women don’t need to be feminine to be beautiful. Or to be women.",
            "I think this is hilarious. I do not understand why beauty pageants are a thing. I understand the argument of not allowing trans women to compete in women’s sports due to a competitive advantage of having had higher levels of male hormones during puberty. That being said, I would LOVE to see a trans woman win a Miss America pageant. There is no competitive advantage there.",
            "No thanks",
            "This will turn out the be a massive self-own as I believe one of the requirements is appearing in an evening or ball gown....",
            "Well, okay. People who don't believe in transitioning say these are women so there you are.",
            "No one is a woman from birth. They are infant females, girls, and then once puberty comes, women! So NO ONE is a WOMAN FROM BIRTH. :P",
            "Men invading women spaces again……",
            "That’s definitely a case of mental illness they should’ve said specific parts from birth only.",
            "I love every thing about this.🏳️‍⚧️",
            "Easy fix,cancel the whole thing.",
            "Oh. They gave them money? \n\nThem - Oh noooo. Anyway.",
            "What would the problem be with trans people have to own competitions?",
            "Another victory for misogyny, those men really are putting in the work",
            "Gud.\n\nDem wimmen wuz startn teh git to comfeh with jinder eekwalitee. Men shood tayk the pryzez n wards all away.",
            "[removed]",
            "Love it!  I hope some of them make it to the finals!",
            "That's fine. It doesn't actually matter. They'll lose, and life will move on. This is not a big deal.",
            "Hell yeah",
            "Good for them!",
            "Here kings, you dropped these. \n\n*Gestures at the over 100 crowns laying around*",
            "I love it! <3 Malicious Compliance at its best!",
            "Sounds like they should have a pageant of their own.",
            "[removed]",
            "We don't deserve trans-men, they're too good for us😂🏳️‍⚧️❤️",
            "It's not fair that they get praise for doing this. These trans women were men who struggled with gender dysphoria and decided they wanted to change their sex, which is fine no one cares. But the fact remains trans women are trans women and women are women. Why can't someone start a pageant for trans women or have a portion of the beauty pageant dedicated to trans women and their views? To say that they are all women and should be allowed to use the same bathrooms( especially when they still have a penis ) or are invited to chime in on a natural born woman's conversation is bizarre to me. There are some things that no amount of hormones or surgery they get that will allow them to experience. They will never have a womb or bare children, know what its like to have issues with their ovaries, never know what it's like to have a period or anything like this. Just like there's things that I will just never experience or understand about being a man. Yet we are forced to accept the insanity of gender fluidity and made to feel bad for not being okay with stunts like this.",
            "Fair enough",
            "Childish",
            "So did one of them win the pageant? Otherwise it's a big L for the trans community",
            "Heh...I already forgot the organizer's name, but she can eat it 🤪\n\n-\n\nYes, I'm posting this comment a second time, in the hopes that THIS time, everyone will realize I'm against the transphobic organizer (because who the f*ck else would I be insulting here) and rooting for the trans men.\n\nLet's try again and see if people get it now, rather than downvoting me into oblivion for supporting LGBT.",
            "This is awesome 🤣"
        ]
    },
    {
        "post_id": "74dhnu",
        "author": "LieutenantCuppycake",
        "title": "Got asked to \"step down\" from a position",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/74dhnu/got_asked_to_step_down_from_a_position/",
        "score": 18134,
        "num_comments": 685,
        "created_utc": 1507175096.0,
        "selftext": "Years ago, I taught Sunday school on a voluntary basis at a megachurch in my town. There were so many children in this church that classrooms were made available to group children with Sunday school teachers for every year of their life until middle school and high school, at which point they attended a larger group with similarly aged peers in separate wings of the building. I taught two-year-olds, and loved every moment of it.\n\nMy classroom boasted a huge number of children, at about 20-25 per service. I was supposed to have an adult co-teacher, but all the other adult volunteers were sent to other classrooms with a \"higher need\". I had two high-school-aged volunteers, best friends, who often spent service time playing together, despite repeated approaches to asking them to play with the children (one of my volunteers was the director's son, who I couldn't replace because of his mother, and who clearly did not want to be volunteering).\n\nDespite this, and despite inheriting a huge classroom full of several special needs children, my children played calmly throughout service, and enjoyed a routine and simple rules I set to run the classroom efficiently. Children arrived, played calmly, sang songs, ate snack, and went home.\n\nEven in the face of this obvious evidence that my classroom was running efficiently, I was repeatedly asked by church leaders to adopt certain mannerisms around children I found inauthentic and frankly patronizing. I don't and won't speak in a high-pitched voice to anyone, child or adult. I don't and won't use words like \"upsie daisy\". These requests were persistent. It was the opinion of the church that I was not \"warm and welcoming\" enough. It was modeled again and again that the church would prefer I was overanimated in a HUGE SMILE HUG \"I'M SO GLAD YOU'RE HERE\" kind of greeting. \n\nOne summer day we were all called (some 50+ room leaders and volunteers) into a mandatory meeting. You know those meetings where you instantly know they're talking about you? The policies on words like \"upsie daisy\" were now set in writing, and I was shortly asked to step down for not using these phrases. I was not allowed to prepare my children for the transition to a new Sunday teacher. I was immediately replaced (by a friend, actually) and was fairly crushed about the sudden break from little people I liked spending time with. And furthermore, it made me question my abilities to work with children, an endeavor I had already devoted my life to.\n\nUnbeknownst to my church, I had long been working at a career in early childhood intervention, teaching a classroom full of two-year-old child victims of trauma and abuse with a heavy case load of special needs children. My coworker called me over one Monday, as I was the twos teacher, asking what I made of this email she had just received concerning a church with an out-of-control twos room requesting that someone come consult with their new staff and help implement some new classroom techniques to \"manage difficult behaviors\".\n\nNaturally, I agreed to do the consult in person as soon as possible, and asked my coworker to let them know I would meet with them on a completely voluntary basis at their next Sunday service.\n\nIt was absolutely my pleasure to greet my church leaders and friend as their specialist consultant, to their confused surprise.\n\nI walked them through all sorts of interventions and strategies I had previously used to create a calm classroom environment and strongly advised against the use of overly excited greetings and phrases like \"upsie daisy\" in place of direct redirective requests (e.g. \"Please put your feet back on the floor.\") It was my strong written recommendation that the written policies on these strategies be amended and for staff to be immediately retrained in accordance with actual therapeutic practices.\n\nIt was my last time stepping foot in that church, and will forever remain my most deliciously cherished memories of vindication.",
        "permalink": "/r/MaliciousCompliance/comments/74dhnu/got_asked_to_step_down_from_a_position/",
        "comments": [
            "LOVE this!! Children know when you're talking down to them. Funny that the church leaders didn't. ",
            "Your story is very satisfying. I teach elementary school music and all of my fellow teachers and I speak to our students with a professional tone. I'm the only teacher without a credential, and was never told to teach this way, but it just seems natural. Kids know when you're patronizing them. I realize your kids were even younger, but to anyone who had to work with kids, expect them to behave like they're a couple years older than they are and they will. Something about expecting a person to be responsible for his or herself makes them strive to be that way. ",
            "Isnt talking to babies in a baby voice actually bad for them?",
            "Good on you! \n\nSilly sods, I suppose it's not surprising that people who didn't work with the children would not understand how it was actually going :) ",
            ">And furthermore, it made me question my abilities to work with children, an endeavor I had already devoted my life to.\n\nMaybe I'm stating the obvious here, but this story proves that there's nothing wrong with your abilities to work with children. Some parents can't even handle one, and you managed to handle 20-25. If everything goes right the way you do it and everything goes to hell any other way, it means that your way is better, no matter what anyone says.",
            "THANK YOU!!!  As a child I abhorred and looked down on ANY adult that spoke to me as if I was an infant.  Every single time an adult spoke to me like that I felt shitty and \"less\" than what I was.\n\nI really dislike other adults doing that shit to any child over the age of 1 or 2, and I refuse to do that shit to children.  We've never done that with our child even.\n\nI was always much more open and honest with adults that spoke normally to me, I always felt like I needed to hide something from adults that spoke to me like I was an infant because they were clearly \"lying\" and trying to manipulate me with their altered voice.",
            "this isn't /maliciouscompliance this is /r/JusticePorn/",
            "I literally applauded.\n\nI remember being a child, and I sure as hell didn't respect adults who spoke like children. And as an adult, I'm viscerally disgusted by the idea of mandatory baby talk.",
            "I have attended mega churches. The children’s programs are often a mess behind a facade. The volunteers and staff overworked and stressed out. Churches are built on pretenses. It is enticing to new guests to see this lovely children’s program that is a slice of heaven every Sunday. In reality behind the scenes it is fucking chaos. \n\nOne church I attended where my wife volunteered the church had the same schedule every service. The pastor would get everyone to bow their heads about 7 minutes before the end of service so that he could ask for people that are newly receiving Jesus to raise their hands.\n\nHe would speak out “I see you”, “theres another one”, I see the both of you”, “I see your hand in the back”. This would go on until you think man there are dozens of people accepting Jesus today. What a victory!\n\nYeah nope....I am a rebel and don’t bow my head instead I look around and watch. One hand would go up if any at all...it was lies all lies. This church had four services every Sunday with 3-4 thousand people at each service.\n\nAnyways....a monitor would come through the children’s area shouting “HEADS ARE DOWN”. This was the signal to rush and get the kids ready. The kids were given treats to stop crying, dirty diapers were quickly changed, bottles were poured down the sink, faces were wiped to remove boogers and filth, and fun little quick games played to get the kids smiling and having a good time.\n\nThen came the herd of satisfied parents that picked up their angels from the perfect heavenly time at church.\n\nMegachurches are a show.",
            "My wife and I had a similar experience with Jr. High students at the church we attended at the time. We adopted several strategies like collecting their phones to keep them engaged with the group, some teaching strategies that were very different than had been tried before. We had great success and while we were initially told \"good luck getting them to talk\" essentially, we had them totally engaged, disappointed when our group time was over, and we had multiple parents who happened to see us at the grocery store or wherever come up and thank us for how well we were doing making them feel like they belonged and getting them to actually enjoy it and learn at the same time. \n\nWe did that for a year, and when the new school year came the church leaders gave us our new group of Jr. High students. Half of the students (it was a larger group than before so they split it), but they gave us all the tough kids, saying they trusted us to handle it. A kid with bi-polar disorder known to have violent outbursts, one with severe ADHD, one with fetal alcohol syndrome... \n\nBut the kicker was they told us that we could no longer use any of the strategies we'd adopted. No more gathering phones, no more hosting occasional groups at our home (with other volunteers present), no more trips out for fun activities like mini-golf, and most importantly no more using our own intuition and discernment to develop a curriculum amd teaching style. They forced us to teach a specific curriculum, cut our group time down, and cut the number of meetings in half. There was no way to teach the curriculum in the allotted time and half our students didnt even understand what was being talked about. \n\nThey literally congratulated us on doing what no one expected us to be able to do and then some, gave us the toughest kids they had saying it was because they trusted us, then took away every single tool and strategy we'd successfully adopted, cut our time with the students by half, and expected us to do it again. ",
            "> Unbeknownst to my church, I had long been working at a career in early childhood intervention...\n\nWhat kind of madness is this? Your church family didn't know you well enough to know what your occupation was? That place sounds toxic!",
            "People are constantly complimenting us on how our 3 year old speaks in full sentences using proper grammar and a near-adult vocabulary, yet they chafe when we ask them not to talk to him like a brain-damaged puppy. There's a correlation between the two, assholes.\n\nIt also grinds my gears when adults answer questions like, \"why is the sky blue\" or \"where do clouds come from\" with bullshit responses like \"Jesus\" or \"it just is.\" I work in a school and hear this from teachers all of the time. The kid asked a factual question, give a factual answer! Just this morning, my toddler asked, \"how much longer until the Earth rotates to face the sun? It's passed the equinox now so there's less sunlight.\" He has a basic understanding of gravity, the seasons, the water cycle, the economy, water treatment, engines, bouyancy, electricity, the criminal justice system, and multiculturalism because when he asks a question he gets a real fucking answer. If we can't quite find the words to explain, we look it up, or if a visual works better, there's image search and YouTube. With an Internet-connected computer in every adult's pocket or purse, there's no reason for a child to be ignorant.",
            "Oh boy, I'm glad I read all the way through this. Even I felt vindicated reading the ending. \n\nBut, I've always said 'Oopsie-Daisey', am I living a lie? ",
            ">It was modeled again and again that the church would prefer I was overanimated in a HUGE SMILE HUG \"I'M SO GLAD YOU'RE HERE\" kind of greeting.\n\nAs a Christian, this is the sort of inauthenticity and falsehood that gives us a bad name.  This is infuriating.",
            "So basically they want you to talk like Dolores Umbridge?",
            "In total agreement with you about not using condescending language with children. Not sure why the people in your former church were so hell-bent on overly effusive and obviously insincere language, but my guess is they were concerned with getting people in the seats and money in the collection plate than actually managing groups of children. ",
            "Maybe not so much Malicious compliance as... something like /r/justiceServed but I liked it nonetheless.\n\nSounds like they wanted to turn you into one of those horrible cartoon caricatures of a teacher. Ewwwwwwwwww...",
            ">refused to use words like upsie daisy\n\n\n>LieutenantCuppycake\n\n\nSomething's not adding up here!",
            "[removed]",
            "i've had to deal with this in previous jobs and it's annoying. i'm not the type of person that will warmly greet you in what i consider an exaggerated fashion. at the same time, i'm not an asshole. i'll treat you with respect and try to help you out as much as i can, but i won't be smiling or prancing around like a clown. it's usually one thing employers specify in job posts and whenever i see that, i just don't bother to look into that job. ",
            "I was 14 when my younger sister was born, i had never been around a baby before (I was previously the baby). My parents got mad at me for talking to my sister with an adult sentence structure, using adult words, and explaining things to her, instead of just \"no, no! No touch!\" I would read to her all the time, not just kids books but sometimes my school books (usually she would fall asleep but the \"want\" to read like the \"big girls\" was instilled early.) Guess whose little sister ended up with a huge vocab at two or three and started reading books  in preschool? Now she's graduating a year early from high school with an associates degree from the local community college that the High school paid for because she's so advanced... I'd like to say it was all me but my sister is sharp as a tack and I'm glad I at least attempted to help her develop that so young instead of talking to her like a baby. She just got accepted to U kansas for occupational therapy. :) only the second in our family to go to a university, and will be the 2nd to get a bachelor's degree (besides me). ",
            "Omg I know someone who goes to a cult church who acts like this. It is so weird when they have a fake persona to bring people in and ever so often their real vicious persona comes shining through the cracks.  ",
            "<Long, professional dissertation on early childhood intervention and remedies for the classroom delivered in a high pitched, patronizong voice for idiots> ",
            "This should also be on /r/justiceporn. I can't even imagine the look on their faces when you walked in. So good.",
            "I work with kids on a daily basis and people often ask how I get along so well with them. The short answer is \"treat them like people not like kids\".",
            "Upsie daisy!",
            "i can't fucking stand when people use baby-talk.  i hate when my family does it to my nieces and nephews.  ",
            "I'll never understand why it is assumed that everyone values greeters. Although I have done the job myself, I hate them.  ",
            "I hope you find another church, not all of them are like that. Before I moved to where I am now I was a member of an awesome Methodist church that accepted you as family no matter what life situation you were in. Great churches are out there, unfortunately they seem to be getting fewer and further in between these days.",
            "Yessss.",
            "I'm going to play devil's advocate here. \n\nDid you communicate why you didn't do the things they asked, like use high-pitched voices? Did you explain your credentials? \n\nWhen you say \"I'm not going to do what ya'll do\", you are signaling that you aren't in the same tribe/group as them. This makes people aggressive. When you say \"I don't like to do this because, through my career in early childhood intervention, ......\", you've shown that you've heard their concern, but that you're an expert. They'll switch over from \"is she in my tribe?\" mode to learning mode. \n\nWhy would you keep your career as an expert in children a secret with your church job working with children? That seems like a really strange thing to do. Seems like everything you wrote could have been avoided by a 2 minute conversation a long time ago. ",
            "I never knew churches had so much staff. ",
            "I love this! You can be warm and attentive without being song-songy. Children thrive off of direction and clear requests- not made up words and skirting around issues! ",
            "Oh my goodness, this was freaking de-li-cious to read! When you got the the request I was saying, “No... No way she’s going... oh shit, she’s going!” Whew! \n\nGood on you for not letting their BS intimidate you and I hope you take this as a lesson learned to *not* doubt your own knowledge and experience in the future. I hope they sat there completely mortified in the realization that they had lost someone extremely valuable. Good on you!",
            "You work for a brainwashing facility and are surprised when they don't meet modern psychological standards and practices?",
            "Fucking mega-churches...",
            "wow!! ",
            "[deleted]",
            "Wow. I could never have managed what you did with so much poise. You sound awesome. ",
            "> Unbeknownst to my church, I had long been working at a career in early childhood intervention, teaching a classroom full of two-year-old child victims of trauma and abuse with a heavy case load of special needs children.\n\nI'm confused - why didn't you tell the church, plain and simple, that you were an expert in aspects of child-rearing and that they were just bloody **wrong?** Would that not have been in anyone's interests, i.e. Yours, the kids', and the church's?",
            "So you realized that religion is a money making scam. Congratulations!",
            "God  has your back. ",
            "This is beautiful.",
            "I have to add, it's horrible to be baby-talking children like that. Not only does it not help reinforce good behavior, but it does not help them develop their speech. My brother had to go to speech therapy as a little kid, because there were sp many words he could not pronounce properly. Why? My mother did nothing but baby-talk him. She wasn't speaking English to him, and didn't stop when the speech therapist told her to. He's now in his 20s, and she STILL baby talks him.",
            "Ugh, appalling that you were let go for such arbitrary reasons.",
            "Delicious.",
            "This is what I imagined playing in your head as you walked out for the last time.\n\nhttps://www.youtube.com/watch?v=6IJCFc_qkHw",
            "Man! That was the BEST!!!!!!!! I also volunteered in a similar setting and I didn't last long. The fake cheer wasn't just extended to the children but it was extended to adults as well. Made my skin crawl a bit. Good for you!",
            "/r/prorevenge",
            "Glorious.",
            "My parents talked to me like a god damn adult. Baby talk annoys the shit out of me. My fiance does it to our pets, but thankfully not to actual babies.",
            "Coming from a equivalent to a high schooler (I'm in the uk) I can tell you that we absolutely hate the one teacher in my school who does the kind of high pitched requests. Most of the other teachers have respect from the students for taking no shit, or for being a good teacher or something but there is a unversal hate of this one teacher",
            "Want to know what I hated the most about my childhood? Being patronised and talked down on due to my age",
            "My wife was a youth leader, a rare paid position. She had the Jr. High and a man had the Sr. High kids as the youth pastor. Neither worked with the younger kids. She had the Jr. High group organized and working well. No issues at all. Great reviews from the head guy.\n\nSr guy left for a position in another state. My wife was told she was not qualified for the position of youth pastor (she had a fully accredited bachelors degree in it!). They wanted a man as the leader.\n\nThe church ended up imploding a year later when the Elders fired the pastor for a stupid reason without the required vote of the church members.",
            "\"I will never become a Christian, I don't have any problems with Jesus, my problems is with the christians\" - Gandhi (after he was refused to enter a white people church)",
            "Good for you. Children should be spoken to as people if you want them to act like people. ",
            "This. I was never of the speak”cutsie\" to kids. I raised my own kids without the cutie pie language.i spoke in plain English to my kids from the day they were born. The way they would hear adults speak to each other.\n\nThey have grown up to be highly intelligent and have better vocabulary than most of their peers. My daughter is in 6th grade and has the reading vocabulary and comprehension of a 12 the grader. My son speaks like he is in college and is only in 7th grade. \n\nI can actually have coherent and adult conversations with my own children which is so fascinating as they each have their own ways of tackling arguments and definitely gives them a sense of humor that I never had at their age.",
            "Thanks for not speaking down to kids.  When I was little I remember some adults acting that way and it was really confusing for me.  I thought they were strange and it made me feel uncomfortable.\n\nKids may be small but they're not stupid and I always appreciated adults who treated me like a person.",
            "When a story starts with blah blah megachurch, not a whole lot good can follow.",
            "Bringing science into the heart of the church. God bless ya.",
            "To paraphrase: While indoctrinating children into a cult worshipping an imaginary friend, I fell afoul of the unscientific behaviour of the people who ran this cult location. After being asked to leave due to not being saccharine enough in my approach towards brainwashing, I was asked back to provide consultation to this mind washing location in regards as to how to brainwash better. I was able to apply scientific techniques, based on reality, making me feel warm and fuzzy for  creating a more efficient cult brainwashing location.",
            "Wow, memories. Reminds me of the time I was stopped by a stranger in a grocery store parking lot about 2 seconds after I started walking again. Stranger thanked me for talking to my niece about the moon in a normal voice. Niece and I had just had a 12 second moment to look at the full moon despite the glaring parking lot lights.\n\nAlso remember and deeply miss interacting with the  18-36 month children in my parent's ward each Sunday. (was Mormon, so \"ward\" = \"parish\" I think...). Almost compelte autonomy. Just me, my wife, and 5 to 10 kids for 2 hours. It was about 40 minutes of toys, then pick up, then 40 minutes of tortilla shells and fruit leathers for snacks with a brief lesson, then cleanup, then 40 minutes self-led singing time with visual aids, then quiet play with a ball until parents picked them up.\n\nEventualy moved into another ward, their nursery was a mess, had restrictions on types of snacks because of \"budget\", which essentially meant cheap cheesy poofs. Messy as hell. Know what isn't messy? Tortilla and fruit leathers. Fruit can be sticky, but guess what?, we brought a small basin/tub so that we could pour a small amount of water on hands to be wiped off. NOPE, they can't have none of that, because why? Because the other teachers wouldn't do that if we weren't there. Oh, and I offered to handle singing time using materials and skills picked up all my life singing in community choirs; but no again.\n\nFucking hell I hated that ward.",
            "Reading this is what I imagine doing heroine is like ",
            "I was a baby sitter in my teens and an art teacher for several years now. Kids have always seemed to like me more than other adults and I didn't realize it was because I treated them like actual people until a few years ago. \n\nI've never baby talked to kids and when I teach anything I say it in a 'matter of fact' kind of voice, instead of that irritating condescending voice many other teachers tend to use.   \n\nThey may be kids, but they're still people and deserve some respect. That's where the golden rule comes from right? 'Do unto others what you wish to done unto you.'",
            "Good for you, if I had a teacher like you just up and leave, I'd cry and scream every day",
            "TL;DR?",
            "Shocker, church people acting ignorant and illogical, who ever would have saw that coming? 😂",
            "or you know, dont enter an institution that is corrupt and brain washes kids with bible bashing religion crap.",
            "AH... this made my heart so happy to read. delicious vindication indeed.  ",
            "That was a sweet read.",
            "Well, that was nicely told.",
            "I greatly appreciate this.\n\nCurrently work in a call center and despite having glowing surveys and quality scores, one upper lady in charge of some kind of bullshit has told my manager I should be getting auto-fails because I'm not extremely bubbly, babying people along.\n\nI yearn for this kind of vindication (also another job).",
            "Fuck that shit, you should've taken their money to tell them how to do what you were already doing for free.  THEN take that money and give it to another worthwhile charity if you feel bad about taking money from a church.",
            "Absolutely outstanding\n ",
            "Great story OP. Reminds me of a beautiful piece of writing in The Once and Future King:\n\n> The Wart did not know what Merlyn was talking about, but he liked him to talk. He did not like the grown-ups who talked down to him, but the ones who went on talking in their usual way, leaving him to leap along in their wake, jumping at meanings, guessing, clutching at known words, and chuckling at complicated jokes as they suddenly dawned. He had the glee of the porpoise then, pouring and leaping through strange seas. ",
            "Thank you. Church teachers are often the most underappreciated and overworked. I'm an agnostic now, but still remember the Bible lessons from one good teacher. ",
            "This is good",
            "Perfect.",
            "I was going to say, being weak like that is exactly why my brother was having trouble in school this year. He had to be moved to another class. Kids NeED structure. ",
            "I love that you got revenge, but wouldn't it have been better for the kids if you'd shared your background with the church leaders in the first place instead of ignoring them? \n\nThey may not have listened either way, but it doesn't sound like you gave them a chance and the kids would have one of the standard teachers eventually. ",
            "> phrases like \"upsie daisy\" in place of direct redirective requests (e.g. \"Please put your feet back on the floor.\")\n\nOkay, that just sounds confusing. Why would they use a cutesy form of \"up\" if they wanted the kid to put their feet down? Everything else just sounds like ignorance and stubbornness, and it was glorious to see that you got to explain how to do it correctly, but this particular bit is just bizarre.",
            "Oh man this is goood",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestof] [Redditor gets asked to step down from a volunteer church position, church solicits advice from outside party, outside party sends Redditor as the consultant.](https://np.reddit.com/r/bestof/comments/74iahw/redditor_gets_asked_to_step_down_from_a_volunteer/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)",
            "Beautiful :)",
            "That was quite possibly the best post I have ever read on this sub. \n\nBravo! Bravo!  \n\n",
            "I bet that felt fucking great!!!",
            "I want to hug you. ",
            "Upsie daisy.",
            "oh man.. i was a sunday school teacher at my church. i was also studying early childhood education at the time and was the most qualified person on staff, even though i was not paid.\n\ni was working hard and was leading sessions when P.K. came in (P.K. stands for pastors kid)\n\nPK's have this deserved reputation that they can be little so-and-so's.\n\nanyway PK comes in and refuses to do anything. all he wants to do is play air hockey. doesn't want to sit for the teaching time or do any worship. he was distracting other kids quite badly as well.\n\nthis frustrated me no end to the point where i said to PK (after asking nicely a few times to participate) that if he is not going to participate with the other kids he can leave. his parents were called and he was picked up - exactly the same thing i would do for other kids.\n\nat this point the head of kids came in and basicly told me that PK has to stay and if i have any further issues with him and feel i need to disipline him i need to get the head of kids church to do it.\n\nthis did not sit with me. I do not treat any kids different to others in these circumstances. i did not appreciate the neutering of my disipline so i finished the day and in the car on the way home i sent an email resigning from kids. \n\nbest thing i did as it cut my stress down a huge amount\n\n",
            "Religious guy here. Sometimes, church people are the worst. ",
            "While being straightforward with children as you seemed to be saying you do is good, a high pitched voice like the kind we use for children actually gets their attention more. We learned about this in my college courses on child development for a somewhat source. I don't think you need to do this all the time of course, but there's a difference between using a different voice with children than you do with adults and setting boundaries. You can give children rules with an inflection they're shown to pay more attention to, it's not one or the other.",
            "I'm really interested in picking your brain about how to manage such a large group of children so calmly and in such an efficient fashion. Would you mind sharing your knowledge with those of us who might have to work with children in the future? I'd love to have the skills you have. ",
            "This is how I raised my kids. It works. I am glad you never went back. ",
            "The best part is the vindication, combined with knowing you still did the best for the children in the end (i.e.: coming to upskill your replacement) :) Delicious.",
            "Cuppycake, huh? 😉\n\nGreat read!",
            "Be well LieutenantCuppycake\nYou sound like a truly remarkable person. \nP.S.  I love your reddit name\n",
            "This will probably get lost but can you point to some resources on communication styles similar to those you described?",
            "The only sad part is that the 2s there won't have you around anymore!",
            "O",
            ">I don't and won't speak in a high-pitched voice to anyone, child or adult. I don't and won't use words like \"upsie daisy\". These requests were persistent. It was the opinion of the church that I was not \"warm and welcoming\" enough. \n\nThis is so bizarre. Is this normal in churches these days? I've been out of them for a long time.",
            "> I taught Sunday school on a voluntary basis\n\nWait, there are churches that *pay* people to teach Sunday school? What is this world coming to?!?",
            "I had a similar thing happen at my church. \n\nI’m glad it worked out for you in the end. ",
            "Exquisite",
            "I work with middle schoolers, and let me start off by saying that they are blood sucking vampires and love to destroy beautiful things. But our administration has totally changed this year, so for 75 kids only 3 consistent youth leaders are not new.\nWell, it looks like I'm one of the few that actually involves himself with the kids and the current Youth Admin is expecting them to act totally behaved 24/7. The change is killing all of the newbies and I cant imagine how rough it was for 2-4yr olds",
            "Thank you!!! I can't stand when people baby their children. How can you help a child develop into an INDEPENDENT human being if you do everything for them? I appreciate your refusal to succumb to those ridiculous requests. You obviously know what you're doing. Hooray for you!"
        ]
    },
    {
        "post_id": "nnchvr",
        "author": "Internal-Car8922",
        "title": "Tired Flight Attendant is ordered to get an in-flight movie that is \"interesting\" enough and maliciously complies.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nnchvr/tired_flight_attendant_is_ordered_to_get_an/",
        "score": 18120,
        "num_comments": 795,
        "created_utc": 1622251592.0,
        "selftext": "# Updated: New Information and Clarifications\n\nThis Malicious Compliance belongs to my Beautiful Wife, but since it is from many decades ago, from a time before we knew each other, we will call her Classy Flight Attendant here.\n\nFirst the usual disclaimers: I am on a computer, so completely responsible for the formatting. English is both my 1st and 3rd language, and my mother was a school teacher, so I am also completely responsible for my use of grammar and spelling. Although I do not care to hear about it if the spelling tends to vacillate between British and American standards. Or the punctuation for that matter. Dialog is translated from the original language and is given as reported to me.\n\n**The Setup:**\n\nAt the time of this event, Classy Flight Attendant is one of the top tier flight attendants for her country's National Airline. Strictly speaking, any of their flights that do not involve ports in the USA or its territories, are not required to follow all FAA rules. However, whenever they fly to ports regulated by the FAA, they are expected to follow those rules to the tee. Of course, it doesn't always work out that way in practice.\n\nOn this occasion, Classy Flight Attendant has just landed from Europe at her home airport in South America, only to learn that she is being turned around for a roundtrip to New York City. She protests. By the time she lands in New York, she will be well outside FAA rest period rules with all the consequences that could follow. Her supervisors don't care. They need her on that flight RIGHT NOW. And away she goes.\n\nBut she knows the flight to New York isn't the real problem; it's the return trip that will be pure misery. Her compatriots flying home from New York tend to be extremely entitled. They are coming from New York. That makes them \"somebody\" now. They will refuse drink service when offered, and then when the flight attendant is three or four rows further along push the call button and order a drink. They will keep an attendant hoping back and forth the whole flight for stupid little things, many of them things they could actually do for themselves. Classy Flight Attendant is tired, and knows that dealing with this entitled crowd on the return trip is going to be the worst.\n\nAs they get into New York, she is told to go check out an in-flight movie for the return trip. The suggestion is made to make it interesting enough to keep the passengers too busy to order the flight crew around that much. Cue the Malicious Compliance.\n\n**The Malicious Compliance:**\n\nAs she looks over the options and finds the perfect film. It will keep the passengers riveted to their seats. Frankly, given the nature of the film, she isn't even sure why it exists in the cartridge format used on planes at this time. Perhaps because the format is also used on some yachts and cruise ships? She orders it.\n\nOnce on board she keeps it secret. She knows that once she pops it in and it starts to play, the systems in use at that time cannot be stopped. But any time before that, she could be thwarted. Mid-flight, as the plane is well out over the ocean on its way south, she pops it in: Airport '77. For those who don't know, this film is about an airplane crashing in the ocean and passengers and crew trying to escape with their lives from 100 feet under water.\n\nThe results are immediate and absolute. While there are many white knuckles, no one seems inclined to press their call buttons. And Classy Flight Attendant has a very quiet, uninterrupted rest for the remainder of the flight home.\n\n**The Aftermath:**\n\nAs she is deboarding, one old lady is heard to say that she will NEVER fly National Airline again. When called on the carpet for her movie choice, Classy Flight Attendant feigns ignorance, claiming to have thought it was the much more comical Airplane! and that the name was lost in translation. She is given a 3 day suspension - which is for her a much-needed rest. Oh, and she will never be allowed to pick the in-flight movie ever again.\n\n&#x200B;\n\n# UPDATES and CLARIFICATIONS:\n\n**Acknowledgments:**\n\nFirst, let me give a very warm thank you to this community for your interest in me (the least interesting part of this story really) and my Beautiful Wife. For your support and also for your heartfelt, honestly expressed concerns about possible collateral damage from her actions. Even for those who have outright doubted the possibility that this could ever happen - even though it is strictly speaking contrary to this subreddit's rules to pursue such inquiries, I personally don't mind them and find them useful. To all who gave awards, if I failed to thank you any of you personally - at some points things were moving so fast I fear I may have - please accept here and publicly my sincere regards for your absolutely unexpected generosity and appreciation. This community is filled with genuinely awesome humans and I thank you all from the bottom of my heart (and on behalf of my Beautiful Wife) for all that you do.\n\n**Clarifications:**\n\nThe least first, just to get it out of the way: My first language is American English and my third is British English. For those who argue they are the same language, have it your way. It was meant as a throw away line and a bit of humor. It did generate a lot more questions than I would have expected. My fifth language is also English, in a way, but many consider ASL (American Sign Language) to be a different language from English while still insisting that British English and American English are the same thing. This perplexes me somewhat, but again, not a hill I am prepared to die on.\n\nFor those who challenge my writing style by asking \"Who talks that way?\" Well, I do. Not your cup of tea? I understand. But thank you for visiting. For those who love it: Thank you. Sincerely.\n\nAnd for those handful of eagle eyes who caught me in a misspelling (which I won't correct here - the Original Post remains untouched): Well done you! I did mean \"hopping\" not \"hoping\".\n\nIn an attempt to keep the story brief and leave out unnecessary details, I left out a few very pertinent ones. Many have been confused as to how Airport '77 would even be an option available on the airplane in the first place. The answer is simple: It wasn't. At the time this event took place, there were services that provided cartridges of movies in a format that was used exclusively on planes and boats. The airlines or cruiselines would pay a handling and licensing fee and the cartridge itself, I'm lead to believe, would track the number of uses so that proper charges could be made. This is why the movie could not be stopped once started. So it was rather akin to a member of the flight crew going to a specialized Blockbusters and picking a movie from their selections. Since they also served boats, it would include options that were perhaps not intended for use on planes. Consistent with public exhibition rules of the day, these were specialized versions of the movies that excluded foul language and nudity.\n\nI also appear to have not made it clear enough in the Original Post that it was illegal for Classy Flight Attendant to fly into New York City without having been provided her mandatory rest period, and this not only risked the airline being penalized if they had been audited, it placed in jeopardy her FAA certifications, without which she would be unable to continue working in her profession. \n\n**Update:**\n\nFor this to make sense, a little context is needed. \n\nI first learned of this event from others who were around at the time it happened and not from Beautiful Wife herself. She is actually not particularly proud of this Malicious Compliance and doesn't like to talk about it much. However, for her coworkers on that flight and others in her company who heard about it, as well as her sisters; for them she is a legend for this as well as other events she doesn't like to talk about much. One involving an intended petty revenge that almost crash landed a 747 will likely be the topic of another post in another subreddit when I get the time to pin down the details and write it up. \n\nSo it is that while I have gotten Beautiful Wife to tell me her version of the event, as well as to read and approve the Original Post, there was additional information to uncover.\n\nWhile we were on a long drive to a family event a few towns away, I expressed some of the honest concerns from this community about collateral damage: the potential of traumatizing innocents and children, for example. In the past, she has expressed that her main immediate regret while the movie was playing was a legitimate concern she may actually cause a heart attack during the flight. Fortunately, there were no medical incidents forthcoming. \n\nMe: \"But what about the children?\"\n\nBeautiful Wife: \"Oh, there were no children on that flight. If there had been, I wouldn't have done it.\"\n\nMe: \"Wasn't it your usual 747? How is it possible there were no children?\"\n\nBeautiful Wife: \"No. It was only a 200 passenger Jet. It was a special. That's why they wanted me on it.\"\n\nThe context there being that Classy Flight Attendant was in fact very classy and normally requested for any flights involving dignitaries, famous singers or actors or other specials.\n\nIt turns out the flight from New York that day was a special with two opposing sports teams, their management staffs and many rich promoters and others from the entitled compatriots living in New York City who had enough money to go to the exhibition game they were involved in. In other words, they weren't just the entitled, they were the uber-rich uber-entitled. There was in fact much less potential for collateral damage than I had always believed existed.\n\nAlso, because of the nature of this flight, her Malicious Compliance directly impacted the airline that didn't honor her mandatory rest period requirements, as the group on that special decided to use an American airline to return back to New York and never contracted such a flight again with National Airline.\n\nIf it were not for the prominent position her father held in her country at that time, I do not doubt for a minute that she would have been fired outright. She still really enjoyed the rest provided by the three day suspension. And the money lost didn't matter. She didn't actually need to work at all.\n\nSo, I hope you all find that additional detail as interesting as I did. Thank you all for being awesome!",
        "permalink": "/r/MaliciousCompliance/comments/nnchvr/tired_flight_attendant_is_ordered_to_get_an/",
        "comments": [
            "Somehow it hadn’t occurred to me that a movie needed to be selected by the flight crew at one point lol\n\nVery fun story!",
            "Classy Flight Attendant is a boss. Now she is your wife, don't cross her.",
            "I'd like to know if the airline got into trouble for making her go over the FAA limit.",
            "Haha when I read Airport 77, I thought it was the comedy too! I've never watched either one (was too young when they came out and had no interest when I got older). Awesome MC!",
            "Love it. Once I read through the disclaimer I knew this would be a gem! \n\nDepending on when this was, she may have not even had the punishment long of not picking the inflight movie once airlines switched from communal in-flight movies to personal/ on demand style! Thank goodness for that change!",
            "Classy flight attendant is awesome!",
            "I don't think I've seen Airport '77, but I have seen a couple \"airport\" films from that era, and they are hysterically bad. I grew up watching Airplane! which is amazing on its own, but even more incredible once you see the schlock it's parodying.\n\ngood on your wife. I'd like to think there were at least a few people on board who had a righteous laugh.",
            "I have a question unrelated to the story - how can a language be your 1st and 3rd at the same time? Genuinely curious.",
            "Don't ever mess with Classy Flight Attendant!",
            "They were lucky, I would have chosen, \"Eraserhead\".",
            "This explains why when I flew to Cuba the plane was showing a movie about the child soldiers and genocide in Africa, I was like 10 years old and absolutely distraught by the first 10 minutes (watching an entire village be burned and slaughtered). My mom called them to ask them to change it because it was WAY too scary for a child, but they weren't able to! All they could do was give me a coloring book.... now I wonder if I just so happened to be the victim of a similar act of malicious compliance.",
            "[deleted]",
            "Hahahaha! I love it! Reminds me of the scene in Airplane! When June Cleaver asks \"when will we land?\" and then goes back to watching the movie about planes crashing.",
            "A 3 day suspension? Why was it in the damn catalog at all?",
            "Can you elaborate on how the movie cannot be stopped once started? It's baffling that there would be no eject button or anything to use.",
            "As a boy scout we used to take the busses with tvs in them to camp, and b/c of this, I can say i watched the film Speed on a bus.",
            "Perfect",
            "When I read the movie title I laughed out loud.\n\nI also appreciated your disclaimer. I should copy parts of it and put it on a keyboard macro for future use.",
            "She sounds amazing something I would definitely do. But I have horrible anxiety so I would never watch the movie",
            "I've gotta say, though, the fact that was even available is amazing.\n\nUnless you're 50+, chances are you haven't seen it. And even if you have, you need to be at least 60 to know who in the hell any of the people are in the film to even appreciate it. \n\nThat was like Avengers: Endgame back in the day. Except less believable than Endgame LOL. Just fantastically cheesy filmmaking. I can't believe people actually got freaked out by it. In no way does it stand up to any kind of suspension of disbelief in 2021.",
            "Haha love it. I used to be a Loadmaster in the Air Force. Whenever I had a soldier ask what the in-flight movie was I would tell them Alive. For those that don't know Alive is a movie based off a true story about a soccer team whose plane crash lands in the Andes and they resorted to cannibalism to survive.",
            "Would it not ultimately be the airline’s fault for having this as a choice? It’s not like she was carrying this around in her flight bag awaiting an opportunity.",
            "Perfectly malicious. Love it",
            "[removed]",
            "That was a great story!",
            "I was expecting this to go in a Snakes On a Plane direction. This was much funnier! She needed promoted, not suspended.",
            "Wait English is both your 1st and 3rd language? Please elaborate a little more as I'm confused.",
            "I generally do not bug flight attendants unless I have to. I think they really do appreciate the quiet easy customers, however if someone played that during my flight over Western Canada I'd lose my shit.\n\nI was flying back with my family from Western Canada, I don't remember where we were but it was maybe 2 hours outside of Toronto for a connecting flight. While we were up in the air, the captain comes on the intercom to let us know we'll be experiencing some turbulence in the next few minutes and to remain seated with our belts on. What transpired the next 30 seconds was the WORST turbulence I've ever experienced, if you've ever seen videos of people going high up into the atmosphere to experience no gravity with the use of sudden descent towards the ground, it was exactly like that! For maybe half a second I swear I saw everyone floating up in the air and then we crashed back into our seats.\n\nCaptain comes back onto the intercom to let us know we've cleared the turbulence in last 2 seconds we've dropped 1000 feet. I nearly shit my pants.",
            ">she will never be allowed to pick the in-flight movie ever again.\n\nIf they didn't want them picking this movie, why was it even an option?",
            "You had me at the first and usual disclaimers. Well done. Gold star.",
            ">claiming to have thought it was the much more comical Airplane!\n\n\nSurely, you can't be serious",
            "I sort of expected her to put on porn, but she's classier than that.",
            "\"You will never get to pick the in-flight movie ever again!\"\n\n\"Promise?\"",
            "[deleted]",
            "[deleted]",
            "Uff... entitled jerks flying from NYC to EZE by any chance?",
            "So none of these passengers actually did anything annoying or wrong? She just assumed they would because they were flying from New York? And she was mad at her bosses so she intentionally terrified every single passenger? Why are people applauding her? She sucks and your story sucks.",
            "[deleted]",
            "Love this!! Classy flight attendant is my hero!!",
            "All I am getting from this story is that she was forced to work long and she took her frustration out on passengers. Think of someone scared of flying.  Calling her classy doesn't make it so. \n\nI think this is childish temper tantrum more than her fighting back with her supervisor. Imagine if an overworked cook spits in your food because they don't want to serve a certain set of people. Or a doctor who thinks all people of a certain type are dicks so he gives them bad medicine. Is that classy? Sounds more like racially biased towards your people and plain tired and unwilling to work. \n\nBut I suppose if you write classy 20 times you believe it too.",
            "Why does this title read like something out of OutragePornHub?",
            "You had me at Classy Flight Attendant.",
            ">[...] Completely responsible for [...]\n\nJust theses spins on the usual disclaimers already made me laugh! Take an upvote",
            "I'm seeing so many posts on Reddit lately that feature \"my beautiful wife\" am I missing something?",
            "What’s even funnier is the movie “Airplane!” has a scene in it where they’re watching an in-flight movie depicting a plane crash.",
            "I'm guessing... Argentina?",
            "When I fly domestically, I watch air crash investigations on my laptop. I used to watch other things but got sick of people looking over my shoulder",
            "I was hoping the movie would be riveting and longer than the flight.",
            "I can imagine your wife during her suspension the fluffiest bathrobe, flute filled with champagne and feet up on the ottoman, well done madam, well done.",
            "Meanwhile I loaded up documentaries on airplane crashes while flying for holidays. One time we even encountered extremely heavy turbulence, and my friend was scared shitless. She noticed that I was nonchalantly continuing my documentary, and realized what it was about and became extremely flabbergasted.",
            "If I was to watch a movie while flying id possibly make a Playlist consisting of \"airplane\"  \"airforce one\" and \"con air\"",
            "I thought any films remotely hinting at flight dangers were excluded from the options but guess not back then\n\nLove it",
            "There's that great scene in *Airplane!* where they're showing various plane crashes.",
            "I use british spellings as a midwestern bum fuck. I think the \"our\" makes a lot more sense. You cats can get fucked on aluminum though. American english pronunciation beats that all day lol.",
            "Your wifes a badass",
            "I'm sorry, but I don't think this was malice, I'd call it pure evil.\nEvoking unavoidable fear of death on your customers is a bad thing to do. They didn't do anything to deserve it. This could have triggered serious anxieties, panic attacks, phobias.\nWhy didn't she walk the aisle waving guns?\nI'd bet this would've been classy and compliant as well.",
            "No offense, but I don't think this reflects on the FA well at all, and was certainly not \"classy.\"\n\nThe tl;dr is basically that the FA had a disagreement with Crew Scheduling about a trip (oh, the horror!), intentionally provided suboptimal service to the pax, and also made her employer look bad in the process. This is more like r/UnnecessaryMaliciousCompliance.",
            "Stay classy, Flight Attendant!",
            "this story could have been told in like four sentences.",
            "Congratulations translating the dialogue, of which there wasn't any, from your second language",
            "Why isn't airline 77 allowed? Also I thought you were going to say she put on an adult film",
            "English is both my 1st and 3rd language\n\nWTF?",
            "[Film selection curated by the Upright Citizen's Brigade](https://i.imgur.com/NFVkF0z.png)",
            "I remember watching this movie as a child. It was terrifying. Good choice! 👍",
            "On a night flight from NYC to London the movie of choice was \"Twister\". It got really scary when we flew through some massive turbulence!    \n  I don't particularly like flying, but that movie had me clawing on to my seat for dear life!",
            "Upvoted just by reading the disclaimer!",
            "I love your writing style here and hoped you had more posts. Lo and behold, your profile is full of stories! I just wanted to say thank you for sharing all of them.",
            "*pushes call button*\n\nDo y'all have popcorn?",
            "while that sounds like a horrible choice i guarantee i would watch the whole thing. it’s like watching plane crash videos before a flight which i do all the time despite knowing i shouldn’t.",
            "Oh bitch please I was flying comfortably when Denzel Washington and Flight came out everywhere.",
            "Fun story...but I'm more interested to hear how English is your 1st AND 3rd language lol",
            "If showing that film was a suspension-worthy offense, the why was it provided as an available option in the first place?",
            "Why is “Airport ‘77” in Airplane format if it isn’t meant to be played on an airline? I assume an airplane has a special, unusual way to stream the video? It’s not a typical dvd or vhs? So why was a plane crash movie in airplane format? Lmao\n\nIt’s honestly funny.",
            "Excellent, story...my sister is a FA.  Now imagine everyone in coach is the same...cause you are now.",
            "Forgive my ignorance, but what do you mean by saying English is your first AND third language?",
            "Fuck anyone who thinks that they’re a ‘big shot’ just because they traveled to New York.",
            "How the fuck are you going to SUSPEND someone for showing something APPROVED BY YOU, and in your 'drawer'??",
            "Where is your wife from? People feeling entitled after going to the USA sounds like a Colombian thing to do.\n\nSource: Am Colombian.",
            "I always figured the inflight film was one that the crew probably wanted to see themselves, and they were inviting us to watch with them.",
            "She should have put on the strange thing about the Johnson’s",
            "St Louis to London 1996 on a high school soccer trip, in flight movies was Outbreak. I discovered the drink cart has tiny wine bottles on the bottom and my young drink ass wander up the magic stair and passed out",
            ">As she is deboarding, one old lady is heard to say that she will NEVER fly National Airline again.\n\nLmao",
            "So did they ever let her pick another movie?\n\nI would have opted for [The Ghost of Flight 401](https://www.imdb.com/title/tt0077610/), which is based on true events (the crash) and what say are true events (the ghosts that popped up on other planes using parts from the crashed plane). \n\nThere is even a [song about it](https://www.youtube.com/watch?v=ETtKRI80U2Y)",
            "US Flight Attendant. The stuff scheduling pulls is insane. The entitled pax are insane too. Smile and keep it moving.",
            "Absolutely unrelated, but I think you just answered a personal mystery that I've had since about age 4-5. At that age, I had a terrible babysitter make me watch a movie where a plane crashes in the ocean. I was left with vague memories of the film, including attempts to refloat the plane and ocean water rushing into the plane while people tried to escape. (I was also left with a terrible fear of flying on an airplane for about a decade...)\n\nI've tried to find out what the movie was ever since then, for my own curiosity. The little tidbits I could remember weren't much help in looking it up. But the plot synopsis of Airport '77 sounds very, very much like it could the film that mentally scarred my childhood and made my parents DREAD taking me on trips that involved airplanes.",
            "Look, as a person who does not like to fly (I also don't like to be a passenger in a car), picking Airport '77 is hilarious.  Your wife sounds awesome.",
            "Classy Flight Attendant made my day. We’d make good friends.",
            "Let's be clear here: American Sign Language is a separate language from English. It's dramatically different in a number of important ways, and the fact that it's signed instead of spoken is far from the only attribute that makes it different. \n\nAmerican English and British English being different languages is... from an objective standpoint false (objectively speaking, the standard is whether monodialectal speakers of each variety can understand the other variety without training or writing anything down, but learning a non-native dialect of a native language is still a non-zero amount of language learning), but much less of a stretch than the idea that ASL is just another form of English. ASL is a separate language from English and the idea that it's not is a toxic falsehood that needs to die immediately.",
            "I lost my virginity to this movie. I only saw the first 20 minutes or so... and the last hour and a half.",
            "Bwahahahahaha!\n\nI have all four Airport series movies on DVD, ergo I have them ripped down to video files for my computer. The last time I flew, I was sitting in the terminal with my 17\" laptop watching Airport '79. Had numerous people stop and look and ask what I was watching. When I told them it was an airline disaster movie they gave me a weird look and walked away.\n\nAs I was sitting down by the gate, I had finished '79 and started watching the original \"Airport\". A Jet Blue pilot walked by and stopped, looked over my shoulder and said \"Airport.... classic movie.\" and continued on.",
            "Too bad snakes on a plane didn't exist",
            "This was so thorough and well written! I would read anything you write. Also, English is my 1st and 4th language, I get it!",
            "Oh, this is fucken brilliant! Good on your missus!",
            "Although I enjoyed the story, my favorite part was the opening paragraphs. I needed this satire this morning! Thanks.\n\nOh, and somehow I expected to see her referred to as CFA throughout rather than tediously having to read every word but I managed to gut it out.",
            "Ya na. I don't buy it. Films have to be modified to be shown in planes, either early on as 1 reels or later resized to fit the screens. And, they are usually decided by the airlines what to show on a flight, not the stewies. Don't buy it.",
            "This isn’t funny. It’s downright cruel. What if it’s your first time flying a plane? What if you are trying to get over a fear of flying?",
            "bro its just picking a movie y u gota make it such a big deal and write a giant reddit esay from a story 50 yrs ago lol",
            "Since you made the disclaimer, and since this is the maliciouscompliance group, I feel obliged to point out... \n\n\"They will keep an attendant HOPING back and forth\" may not be what you had meant lol \ngood times and thank you, you are now free to move about the sub lists!",
            "Fucking genius. She got a chill ride home, fucked with the entitled passengers, and a 3 day vacation.",
            ">vacillate \n\nThat was a nice flex",
            "This is hilarious! People are too damn soft. I'd have probably liked the movie.\n\nSitting there, laughing as the characters in the movie are drowning, and leaning over to the other passenger and saying \"Look! That's **us**!\"",
            "[deleted]",
            "[removed]",
            "> First the usual disclaimers: I am on a computer, so completely responsible for the formatting. \n\nYou all know that you’re just as responsible for formatting if you were on a mobile, right? You get that the formatting is based on your keyboard input no matter the platform, right? Why do you all do this? I want to read the MC, not pretend I stumbled onto a recipe blog.",
            "Cracks me up. I was an airline dependent.",
            "I also frequentl TFTS and had to do a double check on the sub name. Another  awesome story!",
            "Holy shit ... a bit rough on those passengers! I enjoyed the story though.",
            "[deleted]",
            "OP, you write well and when I die you should write my obituary lol. But good story",
            "> English is both my 1st and 3rd language\n\nPlease explain how that works",
            "One of my favourite shows to watch, back when the planes had live tv, was Mayday. I love the show normally, but watching my seat mates squirm the whole time makes it even better!",
            "I get why some people would have been scared, but honestly from the description alone (haven't watched the movie, or the trailer) it sounds like an exciting movie. Watching something exciting would be much more fun than listening to the usual noise/ getting bored, etc 🤔",
            "OMFG I am dying. 😂 Your wife is amazing. I love that instead of being bitchy and whiny about having to do the NY trip, she turned it into something hilarious!!",
            "[deleted]",
            "The happenings with your wife and her sass are always the best, I loved the salad sass incident you posted about in that retail subreddit. I aspire to be her.",
            "> her home airport in South America\n\n> Her compatriots flying home from New York tend to be extremely entitled.\n\n\nOh my God, she's Brazilian isn't she? I bet she's Brazilian.\n\nEntitled upper middle class Brazilians Karens are the worst. \n\n(I'm Brazilian myself)"
        ]
    },
    {
        "post_id": "zgytrl",
        "author": "Longjumping_Bad9555",
        "title": "Left murder scene because my manager complained about overtime",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zgytrl/left_murder_scene_because_my_manager_complained/",
        "score": 18103,
        "num_comments": 414,
        "created_utc": 1670596308.0,
        "selftext": "In a past work life I worked at a small newspaper where corporate insisted on paying me hourly, despite the job not being capable of being done in 40 hours.  \n\nThat and anyone who knows the news industry knows that news happens more than just 9-5. \n\nIt was implied that you just work when needed and don’t miss deadlines.  I did that for years. \n\nOne week I ended up working over 100 hours.  Lots of huge breaking news stories and I was the only person working at that newspaper.\n\nI asked for 20 hours overtime pay (having worked 60 hours of overtime that week) and my regional manager refused because it hadn’t been priorly authorized. \n\nSo I told him from then on I work exactly 40 hours.  And I didn’t care what news happened after.  I’d cover it my next work day. \n\nAbout 6 months go by.  No major news missed. But a few things were later than they should be. \n\nThen another hell week hits.  Several major car crashes, a school bomb threat and Friday about 4 pm a murder. \n\nI head out to the murder scene. Get photos, talk to an officer and am told an update is coming at 630 pm.  \n\nSo I write up a very short piece with the info I had by 430, and at 5 pm I go home for the weekend. \n\nReaders, and bosses reached out several times over the weekend.  Readers I told we’d have an update on Monday, and that no one was scheduled to work the weekend. Bosses I ignored until Monday. \n\nHe tried to yell.  I pointed out it would have been unpaid overtime and it wasn’t approved.  \n\nBy Wednesday they offered me a raise, and put me on salary.  I accepted. But left the job a few months later.",
        "permalink": "/r/MaliciousCompliance/comments/zgytrl/left_murder_scene_because_my_manager_complained/",
        "comments": [
            ">By Wednesday they offered me a raise, and put me on salary. I accepted. But left the job a few months later\n\nSounds about right",
            "Whether authorized or not, in the United States your employer is required by the Fair Labor Standards Act to pay you for all overtime you worked. \n\nOP worked a 100 hour week and was only paid for 40 hours? They owe OP 60 hours of pay at the 1.5x rate. \n\nContact your state labor board or a private attorney. You’re allowed to sue for damages plus attorneys fees. \n\nOP’s boss violated federal law. Don’t work for free. It hurts every other worker out there.",
            "Wage theft totals more money stolen than all other forms of theft put together.",
            "Typical corporate.  Not their problem until it bites them in the ass.",
            "[deleted]",
            "So many of these malicious compliance posts are about bosses not paying for overtime. It almost seems like expecting extra work for no money can come back to bite them!",
            ">By Wednesday they offered me a raise, and put me on salary.\n\nSalary...the employer's way of saying, \"You might work a 90 hour week, but you're only getting paid 40.\"",
            "When I worked at a local paper on salary, we were supposed to get \"comp\" time but of course never did. Finally someone turned them in to the labor board who sent us all questionnaires asking us about our overtime. We were asked to estimate number of overtime hours worked. The newspaper management had not kept any records, so the board went with whatever we turned in. They had to pay a substantial amount to all of us in back pay and interest. Then we were changed to hourly workers.",
            "I really do want to smack whomever spread the false idea that being made salary automatically exempts you from overtime and the company can work you whenever they want for however long they want. \n\nAt least here in the US the number of salaried jobs that are exempt from overtime are actually few and far between. Many of them are the sea level executives who control the direction and focus of the entire business like CEO CTO CFO etc etc  The rest are upper managers that have control over hiring and firing. You absolutely can be a manager that has no control of hiring a firing and that aspect in and of itself means that you're eligible for overtime pay according to labor law. \n\nI know this cuz my wife worked as an assistant manager for a craft store for quite some time working 60 plus hours a week. Her boss was a control freak and wouldn't let anyone else be involved in the hiring and firing process. Eventually we heard about a similar lawsuit where a manager sued for overtime under similar circumstances than one. Long story short it was actually correct and we won as well for lost overtime back pay because the manager never involved her in the hiring or firing process.\n\nI implore everyone who is salary or thinking of transitioning to a salary job to research the relevant labor law for overtime exempt policies. If you're a programmer that spends most of your time writing code then you can be exempt from overtime... But if you're a basic IT help desk monkey who dabbles in programming for the company you should be getting paid overtime. I run into multiple stories every month where people talk about being salary and working tons of overtime but the description of their job title job duties and responsibilities don't fit my understanding of what is and isn't overtime exempt.\n\nSo many people should be getting paid overtime but assume that salary doesn't get overtime... Go look it up yourself and you'll be surprised how many people are supposed to be getting overtime.",
            "My immediately thought on reading the headline was “shit, murderers are getting overtime pay?”",
            "Never miss an opportunity to tell them you did exactly as they told you to do.",
            "Salary literally exists only to benefit a company and to fuck a worker out of fair compensation. The more hours you work, the less hourly pay you're receiving.",
            "YAS, let’s talk newspapers! My people!",
            "Call your state labor industry, report then sue company",
            "Happens across other industries. At a previous job, we were told no overtime, period. But, performance standards dictated that a shitload of activity HAD to occur in a time-frame that was often not possible in 40 hours. So staff secretly worked longer hours to meet performance standards. They wondered why they couldn't keep good employees. 🙄",
            "I feel your pain.  I worked for years in the news business.  They try and get you to overlook how little you're getting paid because you're a prestigious journalist!  LOL.",
            "once trust is lost is hard to stay",
            "I worked in the newspaper business for 23 years. NEVER take a job on salary. I did it once for 8 months when I was young and didn't know any better, and my life was a living hell. I left that place for a new one and was offered several promotions to a salaried position. I turned them all down. An extra $10,000 a year is not worth doubling my hours worked.",
            "Are you me? I literally have this arguement quarterly with corporate, then we miss big news, I explain it to them, they tell me me to get on it. Repeat cycle over and over.\n\nThen I just stopped caring and doing everthing the next day. I only work a set schedule now.",
            "A bad manager will destroy every ounce of incentive in a good employee…",
            "I know you're no longer there, but never work for free. You are selling your time, knowledge, and skills to your employer. Get paid for that.\n\nFor a comparison, try walking into a grocery store, filling up your cart and then telling them that you're paying for everything but the brisket - they're giving you that for free.",
            "Similar situation in my position. When I took over, the previous person had left 2 months ago but the paperwork was in total about 9 months behind (not all the last persons fault mind you, just the demands of the position and specifics allowed it to happen.)\n\nI was very rapidly adding 10 to 15 hours of OT a week desperately trying to get things caught up and shortened the backlog to about 5 months over the next couple of months. My supervisor did okay the ot and never said a word for about half a year then finally did during a performance review that she was getting heat from above that I can't be building up so much OT without just picking up open shifts, shifts that would demand my attention elsewhere and not get to focus on the backlog. \n\nSurprise suprise when I comply and the backlog stagnated and even started to fall behind, although I at least could keep it at bay better than my predecessor. Took a bit longer for self preservation to kick in and stop doing double the work when I did pick up ot shifts and tried to cram both duties in and didn't get any appreciation for the effort, just criticism if I made a mistake trying to rush.\n\nI still love the position as it's description should be, but I have also lost the love for what it actually is because it is impossible to keep up. Just bidding my time for a better ran site to open so I can get proper support from positions beneath mine and above so I don't have backlog.",
            "Can confirm. Former local weekly reporter here, still catching up on sleep 10 years later. But I'll never catch up on my student loans. I wish somebody would have told me 30 years ago that my dream job would result in a lifetime of financial and emotional nightmares.",
            "For some reason (maybe because it is 5.30 here), I thought you left a murder party organized as a seminar and left them hanging... Good for you to have stood your ground",
            "Was the salary worth it? Did you get paid more than you would have gotten paid on hourly + overtime?",
            "I'm a retired IT guy.  I personally have always been surprised that \"newspapers\" didn't figure out and implement a micropayment system.  \n\nImagine if you were asked for 0.0001 of something (i.e., a dollar; a bitcoin; a ruble; a yen) for an article.  Not some number of dollars for a year, or month, or such.  \n\nWhen you get on internet scale, it's not hard to imagine getting 50k readers each paying say a penny for an article.  That translates to 500$ for that one article. \n\nThe current payment technology doesn't pay to scale that price point.  \n\nBut now, a paper could collect a fraction of a bitcoin from someone's public key and encrypt the article so that only the person's private key could decrypt it.  At that level, it wouldn't be worth pirating it or sharing you private key to deprive the sender of the revenue.\n\nI think that would be the way to save the \"local\" paper with digital distribution of content.\n\nFWIW YMMV",
            ">left the job a few months later\n\nFrom the sounds of it, a wise move.",
            "They should have included prior years overtime as an \"I'm sorry, you were right\" option.",
            "Sounds about right. (I work for a paper). You shouldn’t have taken salary though. Are you still in the business?",
            "Having a salary at a job like that is just another way to screw you over for free overtime. Talk about thieves. 🤑",
            "If I didn't know this was malicious compliance, that would be a really weird headline.",
            "Corporate journalism will be the death of democracy. Sorry about your experience OP, good that you left!",
            "> By Wednesday they offered me a raise, and put me on salary. I accepted.\n\nFuture job advice, don't do this unless the raise is actually significant.",
            "Hold your good work hostage and that's when they care about your needs. Everyone can learn from this",
            "Salary is just an excuse to avoid paying you overtime.",
            "I'm just glad OP wasn't the murderer. (Right?)",
            "I think you can be fired for taking unapproved overtime, but they still have to pay it. May vary by state I guess.",
            "Bunch of bastards. They shoulda gave you a fat bonus and fat raise. Working 100s of hours OT without pay is downright disgusting.",
            "This is perfection.",
            "🤣Greatest",
            "Somebody finally learned their lesson.",
            "What a crap company",
            "I am not certain , but I don't think they can decide to not pay you for service rendered. In the US, it is illegal to work for free and most states have a definitive definition of what constitutes overtime. You should be able to report that to the labor board. There are plenty of class action suits for what should've been paid time.",
            "Fellow newsie here and I have a story of my own. Now I will say I can be very efficient, I can do what would take others 60 hours in my 40. That being said yes we work nights and weekends, and I worked at a company that had me hourly, 40 hours a week and also had a prior approval for OT policy. So I stopped at 40. If I knew I had a weekend event to shoot and it would take about 4 hours, I stopped at 36 hours Friday. I worked 12-14 hours Monday and Tuesday and a normal 8 on Wednesday. So Thursday and Friday I usually worked 9 to 1 cause we had DAILY all hands reporter staff meetings in the morning even though we were weekly.\n\nWell my boss, let's call her Rylee, took issue with the fact I was not working 9 to 5. Rylee was salaried, but I was hourly remember. So I told Rylee I would be HAPPY to quit my afternoon PT job and be there. All that was needed would for her to pre-approve me for 8 hours OT.... every week. I crunched the numbers and let her know this would amount to about $10,000 in a year and get back to me with her decision. Rylee said no dice, so I firmly told her I would not \"volunteer\" my time and she had no authority to tell me what I could do when I was off the clock. \n\nI left about 6 months later, and the rest of the staff left within 6 months of me. Rylee was gone about a year later, 2 of the 8 papers have closed shop and honestly a 3rd is a few years away. The company is circling the drain. \n\nI run my own paper now, and oddly enough, staff stay on and circulation is up! Newspapers are dying, but it is largely because the people running them are awful. Every paper I have left has had SERIOUS upper management problems that are usually coupled with overly inflated egos.",
            "> I asked for 20 hours overtime pay (having worked 60 hours of overtime that week)  \n  \n...",
            "Your reaction was completely justified, but wouldn't readers have gotten the details through other channels? Television - either or not local - and/or competing newspapers?",
            "Good show!",
            "[removed]",
            "That's not malicious at all.  No overtime means no overtime, period.",
            "[deleted]",
            "So if you're in the South, this was either Boone or CNHI.",
            ",,.",
            "how does hourly vs salary works? isn't overtime paid in both cases?",
            "B; 8",
            "Sorry, still reading, but how do you get \"prior authorization\" working in NEWS of all things? That's almost comical had you not worked 100 hours (props, btw! That's some dedication).",
            "👏🏼 \n\n👏🏼 \n\n👏🏼",
            "I still would have asked for my 60 hrs overtime."
        ]
    },
    {
        "post_id": "enk1fl",
        "author": "TerrificMoose",
        "title": "You want me to **** off? Ok, I guess the lab just wasted $4000",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/enk1fl/you_want_me_to_off_ok_i_guess_the_lab_just_wasted/",
        "score": 18073,
        "num_comments": 383,
        "created_utc": 1578810328.0,
        "selftext": "So I recently started posting to reddit, and I have a lot of stories. This one happened during my first career, when I worked as a scientist in a diagnostic lab. I had been working for about 2 years at this point and had just been promoted to senior scientist.\n\nI had two supervisors in my section, each assigned to oversee half of the tests being done in our small corner of the lab, Rory and Tanya. Tanya was the senior most supervisor of the two, and secondary to my department head she had the most authority over me on any given day. She also hated me. Never did figure out why, but she hated about 3/4 of the people working in the lab so I never took it personally. I just don't think she liked people (the lab tends to attract people like that, funnily enough. We always used to joke about being the rejects stuffed in a hole at the bottom of a hospital to be kept away from the general public). As for Rory, it's important to note that he had a very good reputation in the lab of never lying. He was never once caught in even a half truth, and he'd been working there for over 30 years. He was well liked and well trusted. This will be important later.\n\nOne day I was doing one of the more technically challenging tests that our department performs. It's long, fiddly, expensive, and easy to screw up. Only senior scientists are allowed to do it unsupervised, and this was maybe the second time I've done it alone. We are talking two days just to get it set up. It was a nightmare. While I was measuring out some gelatin powder into a beaker, I accidentally elbowed Tanya (our work stations were right on top of each other, this happened at least 4-5 times a day with everyone). I apologized and go back to what I was doing, but she flips out. Like full on rage screaming in my face kind of angry. After a couple of minutes of her tirade, she says \"Just fuck off TerrificMoose, no one wants you here!\" and then she storms off to her office to cool off.\n\nRory comes up to me, having seen and heard to whole thing and asks if I'm alright. I say I'm a little shaken, but nothing too bad and get ready to continue my work. But Rory had HEARD the whole thing, and he saw what test I was doing. He Whispers to me \"Your supervisor told you to go. Best you do what she says, and if she causes a fuss about it, I'll be sure to tell the boss EXACTLY what she said to you.\" Now, I knew Rory's reputation, so I knew I'd be safe. I also know that being told to leave early by a supervisor meant that I was still paid out for the rest of the day, provided I had worked at least 4 hours of my shift (The lab was actually pretty generous with time off, even if the pay and working conditions were shit).\n\nSo I did exactly what Tanya had said. I fucked off home.\n\nNow at the stage I was at with that particular test, I had spent about $4000 worth of reagents. Normally batches of 20 samples are run to try and keep the cost down, but it was still an expensive test when you include the nearly 3 days of work from a single scientist. This was one of Tanya's tests, and therefore Rory was not required to ensure it was done. No one in my section was very happy with Tanya, and she had gone off to her office and so couldn't see me leave, so no one went to tell her that the test was left unsupervised. Apparently she didn't come back for over an hour, and by then the test was ruined and had to be started over again. My boss was PISSED. Tanya of course tried to throw me under the bus, saying I had left without informing anyone and that it was all my fault, but good old trustworthy Rory told the boss exactly what Tanya had said. I love Rory. I couldn't be punished for doing exactly what my supervisor had told me to do, so I got away with it completely.\n\nUnfortunately nothing overly terrible happened to Tanya. She got formally reprimanded and had to take an anger management course that the hospital runs, but otherwise she got no real punishment. She never yelled at me again, and was always careful to word things just right around me after that though so that was something. As for what I did on my half day off, I went to the beach to enjoy the sunshine I almost never got to see working in the deep dark dungeon that is the average hospital lab. I made sure to bring in the pictures the next day.\n\nUPDATE: I was teaching a class with Rory today and showed him some of your replies. He's genuinely touched by it all. He does recommend not naming your children after him though, as his name was changed for the story.\n\nAlso to all of you saying that 4 grand is too much waste for a lab, in the grand scheme of things $4000 is nothing. Diagnostic labs will waste that daily just through simple errors. The boss was annoyed, but not disproportionately so. It's factored into the budget.",
        "permalink": "/r/MaliciousCompliance/comments/enk1fl/you_want_me_to_off_ok_i_guess_the_lab_just_wasted/",
        "comments": [
            "Rory sounds like an absolute gem, I love coworkers like him",
            "> I made sure to bring in the pictures the next day. \n\nInsult to injury. Perfection.",
            "I think the hospital handled Tanya just right.\n\nReprimand and anger management. So a mild punishment and steps taken to ensure it wouldn't happen again. Which worked.",
            "Holy moly, what test uses $4k reagents? I'm going on a limb here and assume it's not the typical high volume tests?",
            "[deleted]",
            "Oh man. I'm going back to college after taking a sabbatical for being sick and the degree I'm after is medical lab tech. It fascinates me, but is this *really* what working in a lab is like? I'm highly social and in general a people person, but being yelled at like that would result in me either yelling right back or crying...maybe I need to think of another medical field use for an associate's in applied science degree...",
            "Do you still talk to Rory ?",
            ">We always used to joke about being the rejects stuffed in a hole at the bottom of a hospital to be kept away from the general public \n\nThat's how a lot of IT workers feel. Yea Work Basement Dwellers!",
            "Nothing happened to her is not actually correct, with the reprimand and anger management course, the organization can now fire her if she cuts loose again. The anger management course is not the reason that she is keeping her composure.\n\nIt is also completely documented.\n\nWithout getting into it. My manager sent me home for 2.5 days. I had done nothing wrong. I was notified that I could take it as PTO or  dock in pay. I verified with HR that they had been notified so I went home.\n\nSince I was salaried, no one can dock my pay. When my manager tried to mark it as PTO, I was able to prove that I did nothing wrong and upper management informed my boss (and his boss) that they pretty much gave me an additional couple of days vacation and it would not come from my balance.",
            "Could you please share a link detailing that test? I am curious what it was.",
            "She must've been pissed to take that anger management course :)",
            "> Unfortunately nothing overly terrible happened to Tanya.\n\nAre you sure? She was told to go to anger management, and was mindful of wording going forward. Thats a pretty big hit to the ego..",
            ">(the lab tends to attract people like that, funnily enough. We always used to joke about being the rejects stuffed in a hole at the bottom of a hospital to be kept away from the general public)\n\nI did a month in a big hospital pharmacy and it was exactly like you described. Bunch of angry weirdos hidden in the dungeons lol. Hated every second of it.",
            "Damn, you were really lucky that you have someone to back you up. One thing I learned was to have everything in writing because people will always thrown you under the bus.",
            ">  but otherwise she got no real punishment. She never yelled at me again \n\nSure, no real punishment, but suddenly she held off on yelling at you for the rest of your time there.  I imagine she got in a bit of trouble, typically workplaces don't announce HR action.",
            "A formal reprimand may not seem like a punishment, but if documented, it’s one step along the road to termination. If it made a difference in her behavior, trust me it was punishment. Think how much she must hate keeping her opinion to herself every day.",
            "anger management classes are no joke as a punishment, *especially* if you have anger problems. \n\nI had a borderline alcoholic supervisor who got sent to one and he kept failing it and having to retake it. The only thing that got him to finish it was the promise from his boss that he would be let go if he didn't pass it that last time. \n\nYou brought up the class forever after that and he just shut down and walked away. I think that class broke him.",
            "Hope that patient didn't absolutely need those results ASAP, bro.",
            "The best ending!",
            "How often did your coworkers lie that Rory developed a reputation of not lying lol?",
            "As a lab tech this rings a special bell with me. On behalf of us all, bravo. wish i could do that to show up my labs 'tanya'.",
            "Im so happy that you fucked right off and got to see the beach.",
            "If you haven't posted this to r/labrats, you should",
            "wow, what a bully. I guess this is what happens when High School Mean girls grow up and join the work force",
            "Can we make Rory into like, Chad but for amazingly genuine people? I feel like thats the proper respect we can give him as the reddit hive mind.",
            "Great story, and you also did a great job of explaining the something that often times get lost in minutia when people explain.",
            ">she never yelled at me again\n\nThere's the victory right there",
            "\"I don't need anger management! I don't need anger management!\" LOL!\n\nDid you buy Rory a steak dinner? It's great when someone like that has your back!",
            "Serious question: Why do people like that exist? The \"I hate almost everyone, for no reason\" ? What exactly is going on through their mind, and how did it get that way?",
            "[deleted]",
            "Going to name my first born Rory now",
            "Having worked in the glamorous world of clinical engineering in the basements of a few hospitals: good on ya!!",
            "I am also a lab tech for health care, and you should definitely cross-post this to r/medlabprofessionals!  I think they would enjoy it, too!",
            "Your name is actually TerrificMoose? Well that's rare.",
            ">She got formally reprimanded and had to take an anger management course  that the hospital runs, but otherwise she got no real punishment.\n\nWhat did you want?  Her 6 liters of blood?  She got formally reprimanded AND had to take an anger management course and you think she deserved more punishment?   I haven't taken one, but I hear they can be life-changing.  Sounds like the reprimand led her to take the course seriously - she never yelled at you again AND was civil around you evermore!  \n\nYou may changed her whole life for the better.",
            "Don't hurt me! I'm with the science team!",
            "I hope Tanya actually called you terrificmoose...",
            "Hi fellow lab scientist! 👋",
            "r/medlabprofessionals",
            "Just wanted to say, as someone who works in a lab too, lab jobs absolutely attract people like Tanya. It sucks. My first lab manager was the same way. Always pissy.",
            "saga of tanya the evil",
            "We have the same job! So cool finding us out in the wild! The hospital rejects part had me rolling.\n\nAs for the test, I’m curious what it was! The gelatin has me thinking some kind of PCR with a gel at the end.",
            "Sort of off topic, but I've been thinking about a career change and thought working in a lab sounded cool. What sort of degrees do they want for being in a lab in a hospital?",
            "nice!",
            "Theres always one toxic supercunt at every job.",
            "[deleted]",
            "Why would you want something bad to happen to Tanya? It sounds like she learned something about anger management and improved herself.  That sounds reasonable, in the end.",
            "Fuck",
            "HA!",
            "Oh, i used to work for a lab co, I think i know what test u were running. The one that has 314,869,862 steps to run?",
            "How is Rory not promoted yet",
            "So you stopped performing the test and ruined the patient samples because of your pissing contest?\n\nAnd the well-trusted and well-liked supervisor allowed this supposed $4,000 diagnostic test for at least 20 patients to get ruined, delaying results and causing resampling from patients who now have to wait even longer?\n\nYeah, it's either bullshit or people like you shouldn't be in the medical field. How selfish of all of you to cause patient harm.",
            "Wait?  She **learned** from what happened?\n\nit's a miracle!",
            "What kind of workplace has \"very good reputation... for never lying\" as a thing? Do most people lie there? That seems like a pretty low bar for continued employment. \n\nI have often been in a position to introduce new co-workers around and never once would say \"this is Matt, he never lies.\" That is just odd, isn't it?",
            "Very childish and unprofessional response. If I were the boss I’d have expected a greater understanding of this from you. You don’t come out of this looking good.",
            "This is actually pretty fucked for the patient...",
            "You know, I read that in his voice.",
            "I do the same thing, different day.",
            "Most of them don’t give me hope",
            "What do you want, not the asspounder 4000",
            "I'm so glad I made the move to molecular. So many grumps in Core.\n\nNow I just have expensive reagents to waste from my own mistakes.",
            "A great explanation of why health care costs are so high. People like the jerk of an OP are happy to go to the beach and waste $4 thousand dollars instead of finishing their work like an adult, and then reporting their supervisor to the boss after the fact.",
            "I poop faster than I can read this, could we possibly get a TL;DR?",
            "That is... this is one of the best stories of Malicious Compliance I've ever heard. Well done Rory!",
            "TLDR please?",
            "> He was never once caught in even a half truth, and he'd been working there for over 30 years. He was well liked and well trusted. This will be important later.\n\nOh, will it? Will it be important later? Is it important because you took the time to explain how tight this guy's integrity was? I'm so glad you decided to hold our hands through this convoluted and extremely difficult-to-follow narrative. I don't think I would have made the connection if you hadn't explained how it became relevant a mere two paragraphs later.\n\nSeriously. You people don't need to spoon-feed us minor details. You're not writing the next *Lucky Number Slevin* here. We can follow a story without being coddled.",
            "Can we get a TLDR please?",
            "Where ever your dad is should have some support  group help.  Please please seek it out",
            "TLDR"
        ]
    },
    {
        "post_id": "br17rw",
        "author": "UPMCThrowAway",
        "title": "You’re not paid to be on call because you’re not on call",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/br17rw/youre_not_paid_to_be_on_call_because_youre_not_on/",
        "score": 18030,
        "num_comments": 682,
        "created_utc": 1558385759.0,
        "selftext": "Throwaway and vague details as there are work rules about posting on social media, also mobile so apologies for formatting etc.\n\nI work in a support role for a global insurance/investment company. Over the last 6 months I’ve lost many an evening and weekend to unexpected work problems, with not even a thank you, let alone any financial compensation. As an example, being called at 21:30 and asked if you can log on, when you’ve met friends for a drink.\n\nWhere a job needs to provide out of hours support, a supplement is meant to be paid for being on call, with additional payment if you‘re required to actually work. \n\nMy contract is based on annual salary, where additional work might be required for no extra pay/overtime if it’s considered business as usual(BAU) or known in advance (this bit is important). However, the work I’ve been asked to do on weekends/evenings is not BAU. BAU assumes processes work. If something goes wrong, someone needs to step in to fix it and it’s no longer BAU. Hope that makes sense.\n\nA couple of months ago, I had the conversation with my manager about being paid for being on call. I was told the work I was covering actually fell under BAU, and as I was always given advance notice (I wasn’t) I wouldn’t be paid for being on call. Manager wouldn’t budge on this, so I made it clear I would not be taking my laptop home/available unless I was given advance notice I might be required to log on, to which my manager agreed.\n\nOn this glorious day I received a call from my manager asking me to log on as some critical data was missing from a file, causing significant problems with several admin systems. Trying to sound as sincere as I could, I apologised and said as I was not made aware in advance, and I’m not on call, my laptop was left at the office. \n\nThis was met by an “Ah”.  To which I responded, “Good luck, and I’ll see you tomorrow.”\n\nExpecting it to be a shit-show in the morning for muggins here to clean up, but it’ll be worth it.\n\nEdit1: Wow, was cathartic to write this last night, did not expect this. Thank you for all for the upvotes and the silver and gold. I’m on my way to work now and will look to update once the fan has been cleaned of shit.\n\nEdit2: So last night after the call to me, my manager rang around and finally got hold of a manager from P Team (Team I provide support to). Over several hours, between them they figured out that somehow a group in the system had not been run for the day (controls are in place so this shouldn’t be possible). To fix it they had to run the missed group, validate the movements, and then rerun processes to send the data to the admin systems. \n\nAfter looking into it this morning, this is for Team P to look into how they’ve managed to done goof on such a scale, a ‘near miss’ recorded with governance, who they’ll need to explain it to. This caused several issues with admin systems and a lot of verifying everything is as it should be this morning.\n\nFollowing this, a group email has been sent around, to remind people that laptops should be taken home, as in the event of the building been unavailable/inaccessible, recovery plans are for people to use their laptops to work from home/alternate site. It seems the manager had trouble contacting someone with a laptop able to log on. \n\nI’m positive they’ll have no issues finding someone to drop everything at a moments notice going forward . . .\n\nI fear that should I receive a similar call in future, I’ll not be in a position to access my laptop. Work\\life balance is important, and I’m going to enforce those boundaries. The trouble is, it starts as a one off here and there, and you do it to be nice with the best of intentions, but give an inch and they’ll take a mile if you’re not careful. \n\nFor some of those asking, I‘m already looking at other jobs. Although there’s definitely issues with the management in my current area, and employees being taken for granted (not just me), the company as a whole does have a good ethos.\n\nHope this provides at least a little amusement, and is only giving back a tiny amount of what you’ve all given me. I’m not planning on anymore updates, so this it from me. Thank you all, and don’t let the bastards grind you down!",
        "permalink": "/r/MaliciousCompliance/comments/br17rw/youre_not_paid_to_be_on_call_because_youre_not_on/",
        "comments": [
            "Lol definitely gonna need an update on this when you go in.",
            "[deleted]",
            "\"yeaaaaaah we're going to need to come in on the weekend.....\"\n\nyou are here by obligated to update us!",
            "[deleted]",
            "Around here, we use the \"two hour callout\" rule.  Which means, if I can fix it over the phone, then I ~~don't get paid any extra~~ only get paid hours worked, but if I have to travel anywhere in my personal conveyance, then I get paid a minimum of two hours.",
            "[deleted]",
            "There will be a shit show. A lot of people do not understand the concept of what exempt means. Companies will skirt around it etc... They will try to staff a 24/7 operation by covering 16 hours with on-call. It is only works as long as the employee \"voluntarily\" complies. This tactic quickly falls apart if the on-call employee is working 50 hours a week. documented controlled on-call and disciplinary actions occur if they timelines are not met.\n\nA few, \"don't have my laptop with me\" or \"I am not available this weekend\" forces the company to re-evaluate the on-call requirements. It gets even better when they realize that the escalation path does not include people who have the skills to address the issue. Even worse, they realize that they have jeopardized their standing with the employee who has the ability to address these issues on a 24/7 basis.\n\nI know several companies that pay extra for on-call rotations worked by the IT staff. Especially if it is a controlled on-call and has a response time requirement  (No alcohol and must respond in 15 minutes) etc. This usually softens the blow but it is nowhere near compensation of what would be considered overtime.\n\nAlso \"exempt\" is not based on the job title,  but based on things like tasks, authority to defer work. I believe a famous coffee company got in trouble a few years back when they tagged a large number of employees as exempt and stopped paying them overtime. The class action suit was swift and just.\n\nAnother issue is that \"Exempt\" employees are not required to work a full 40 hours to get their weekly salary. An employee can work 48 hours one week and only 32 hours the next. There are problems if a company tries to withhold wages for a salaried position.  If they dock your salary for hours not worked, it may justify an assessment of the exempt status of this position and possible all similar exempt positions in the organization. This means that if they say they can dock your salary based on your job title. They better be docking everyone with the same job title... blah blah blah\n\nAn acceptable bargain is that you get back hours that you work overtime. Each 4 hours overtime = 8 hours pto. These hours are availible the following business week. Watch a company of several 100 people try operating with that flexibility on the books.\n\n&#x200B;\n\nedited because of \"words\" and basic laws of the English language.",
            "Some wise men once said,\n\n>You gotta fight!  For your right!  To paaaaaaaaaaartaaay!",
            "You’re somewhat correct - It doesn’t have to be extra monetary compensation - My team receives comp time when we’re asked to work off hours. \n\nCorporate HR won’t approve additional pay, but “understand that individual roles may require flexibility with working hours”, so we use that to arrange leaving early, coming in late, additional vacation days (or a combination).\n\nYou don’t keep good people in these situations unless you provide compensation for this kind of work (money or time).  What shocks me is the “not even a thank you” part of your story.  Even with the comp time I thank each of my devs any time they work extra.  Seems like such a small cost (some oxygen) to not give it.",
            "1. Are you in the US?\n2. If so, are you salaried exempt?\n3. If not, then the law distinguishes between \"engaged to wait\" and \"waiting to be engaged\" for people on call. [More here.](https://webapps.dol.gov/elaws/whd/flsa/hoursworked/screenER78.asp)\n\nThat's for the US. I'm assuming you're not US due to British/Canadian/Australian spelling, but just checking.",
            "Updoot and please update.",
            "I hope nothing happens to you because you have done nothing wrong here. \n\n&#x200B;\n\nMy job requires me to be on call (once every 5 weeks or so it rotates between my peers) and we get paid a really small amount for being on c all per hour but if we actually get a call and have to work we get paid a lot to log in (something like 3x our normal hourly rate). We get a minimum of one hours pay even if it takes 1 minute. \n\n&#x200B;\n\nThere is no way I would be carrying my laptop around whilst not being paid. The on call pay is there to compensate you for not being able to do certain things like going out drinking or to the movies etc.",
            "Next time, just don't answer.  Because since it's not scheduled in advance, why would you need to answer...",
            "I've never understood the mentality of actually working OT without getting payed.\n\nI would never ever, work for free, let alone without extra pay, unless I was volunteering. At the very least I want compensatory days off.",
            "I'm in live entertainment. Regularly that means 80hr weeks followed by weeks with nothing at all. I was salary for 7 years for a non-profit. As a department head I was an on call resource any time the building was open. \n\nNew boss scheduled a meeting with me and HR to talk about paternity leave since my wife was due with number 2 and old boss had badly bungled the paternity leave convo when I was taking time for baby 1. HR was brand new to the company and the first legit trained HR head the company had employed. \n\nAt the end of the meeting my boss ambushed me with a \"I want to make some changes, when you get back from leave I want you in the office during the down weeks instead of working from home\". That meant 80+ he weeks with no weekend would count for nothing flexible. \n\nI calmly laid out the hours I'd been working for the company over the last 7 years mentioning that all we're well documented. Then explained how and when each part of my agreement to flex time and just be on call from home had been reached and with which previous boss etc. Current boss said that he wanted to start clean and not be bound by promises made by old bosses. I said \"great, here's a number that you can pay me for this level of service.\" \n\nHR, realizing how big the shit hole they were in and how actionable they had become over the years shut the meeting down. A week later I got a very well worded email from current boss that all my flexibility agreements would be honored and that we would work together to reduce hours both on site and on call moving forward.\n\nI took my 12 weeks paid paternity leave (banked sick leave) and then turned in my notice immediately upon my return. \n\nWhen asked why I was leaving after he'd agreed to all my conditions I said \"you shouldn't have made me look at what I'm worth on the open market. You'll never be able to afford me now\". \n\nYou can drive a nail, and pull it out, but it's still going to leave a hole.",
            "!Remind me 32 hours",
            "Please post a follow up...I would have loved to be a fly on the wall for you manager's ah moment...that little moment when it becomes clear to his/her pea brain that he/she fucked up",
            "Of course it's UPMC",
            "Today’s malicious compliance is tomorrow’s TIFU",
            "[deleted]",
            "Make sure to leave a paper trail!",
            "Can’t wait for tmmrws update",
            "I can 100% agree with this title. I work as a nurse in a hospital and several times people call out and we get called in, but we are not obligated to come because we are \"not on call\". Speaking to a friend at one point, who is a nurse in the surgery unit, they are on call and actually paid for being on call. Thus they are legally and contractually obligated to come in and work. There were shortages on the critical care floor of the hospital and managers placed several nurses \"on call\" in case they needed help due to admissions and patient load. These nurses were not paid for being on call. For a few weeks it went on and tensions rose due to terrible work hours and lack of sleep. Eventually, all on call ciritcal care nurses simply turned off their phones when they were off to avoid being called in. Somehow they learned that they were not legally obligated to be on call if they were not paid accordingly. The situation has since resolved but I did hear that several lawsuits were placed and the hospital finally dropped everything cause they were gonna lose severly if it went to court.",
            "I have had this fight with managers before. Americans need to push back on that \"the only good employee is one that constantly works for free.\" \n\n\nI did research on it. If you have to actively stay near a phone or device  to answer it for on call and it restricts your movement, you should get paid.",
            "Yeah, that update will be fun.",
            "Are there specific laws that reference being on call if you’re salaried?",
            "Beautiful.",
            "There is something called the \"Right to Disconnect.\"  It is already in France.  Canada is considering it.  It essentially puts strict rules around exactly this type of issue.\n\nFor Canada:\n\n [https://www.cbc.ca/news/canada/ottawa/right-to-disconnect-ottawa-labour-lawyers-1.4810088](https://www.cbc.ca/news/canada/ottawa/right-to-disconnect-ottawa-labour-lawyers-1.4810088)",
            "IT workers need to fucking unionise. They keep the world running as much as teamsters do, but allow themselves to get fucked in the arse at every turn.\n\nThe shit that an IT person might be doing *for free* at 10pm on a Friday night could literally be saving/making (same thing at the bottom line) several thousands of your human currency.",
            "Fight that good fight. Good, innocent, working people literally died so we could have paid overtime and a 40 hour work week. You're honouring their  sacrifice by pushing back.",
            "I feel you OP, I have been in a similar situation in the past. The only real solution is to find a better workplace that either appreciates your out of office time more (financially or personally), and/or find a place where all the details of after-hours are written out very clearly.\n\n&#x200B;\n\nStepping back for a second to make another comment, I for 5 years, have been trying to find a way to advocate for better rights for I.T. workers. Our cell-phones today have become more an extension of work than a personal device, and I would really like there to be some kind of legislation that forces employers to A - pay for the mobile device service of any phone that even requires something like checking email. B - pay for any after-hours work. C - limit after-hours work / prevent employers from rage-firing you for not being available 3am bc they've got shitty infrastructure/tight-budgets/always-broken-down-servers, etc.\n\n&#x200B;\n\nI'm not very politically connected so I've given up, but I really really STRONGLY believe there needs to be some new wage/employment laws that protect a person's family/home time more, especially in the wake of all this new communicative/connected technology (phones, vpn, cloud, email, etc).\n\n&#x200B;\n\nSorry for the rant, and not to take away from your original post. I completely agree, it just makes my balls boil knowing companies are so casually doing this kind of shit.",
            ">Following this, a group email has been sent around, to remind people that laptops should be taken home, **as in the event of the building been unavailable/inaccessible,** recovery plans are for people to use their laptops to work from home/alternate site. It seems the manager had trouble contacting someone with a laptop able to log on. \n\n*OP, we're having an issue with x, and need you to logon and fix it.*\n\nOP: *Is the building unavailable/inaccessible, and are all of the teams now in recovery mode?  Was there a fire or terrorist threat?*\n\nBecause, I'm pretty sure that \"recovery mode\" could not be considered BAU.  It's their BS mode, more like.\n\nIf they want 24/7 tech support, they need to pay for it.  On call is on call, not a freebie *on demand*.",
            "I'd probably start being out. \"Sorry boss, no can do, didn't have advance notice that I might be needed, so I'm at least an hour away. Since everyone has their laptops, maybe someone else is home. Or whomever was given advance notice should be available.\"   *Click*",
            "Simple solution to this is to not answer the phone call.\n\nYou can always say the next day \"Sorry I left my phone in a random excuse.\".\n\nI do it all the time with my work and the calls slowly tailor off, then stop.",
            "\"Sorry, I don't have internet available right now. I can't remote in and I've just finished a beer/glass of wine/whisky/alcohol and can't drive to somewhere with internet. Had I known ahead of time to be available, I would have abstained from drinking tonight.\"",
            "OP HOW YOU DOIN",
            "reminds me when, after many many years, management wanted to save money and on-call was changed from all night to end at 11.30 and restart at 04:30. On call money was saved and the engineers would available the next day instead of having the day off if called out( as had previously been agreed to).\n\nNot a week later my phone rang at 11:40. never got answered\n\nSo the call center had a bright idea to then do a call-out first thing in the morning at 04:30. But they had forgotten that due to the changes, the morning call-out was covered by a different engineer.\n\nthe call never got answered :)",
            "If you go up a level in what is being described, something needs to be fixed - the system itself, the training provided, source data, something. At a minimum, provide support in the timezone being worked.",
            "Looking forward to seeing an update if possible.",
            "!Remind me 32 hours",
            "[deleted]",
            "I have an on-call allowance. (1 week me, 1 week the boss)\n$250/week that is to cover fuel/time/etc. I haven't been called out in about 12 months. Good times 😁",
            "This is just regular compliance.",
            "ITT: people realizing they need to read workers rights and labor laws.",
            "Your username makes me want to know more. That company sucks.",
            "Need update",
            "So many jobs like this where it's almost expected to take your work home when you barely get paid for the work in the first place. Way to practice good boundaries. You did the right thing. You're trying to follow your bosses orders and your boss should soon see the error of their ways",
            "Definitely need an update on this tomorrow",
            "I think you're going to need the luck. Bold move, if you're very good at your job, it could pay off big. I try not to make those moves unless I've already got another position lined up.",
            "Sounds like he had been on autopilot and taking your work for granted. Bringing it to his attention how regularly he *did* have you \"on call\" hopefully gave him a little wakeup call and shouldn't reflect poorly on you in the future.\n\nHopefully.",
            "I was looking for all the \"find another job\" posts, couldn't find any seemed very strange. Did r/sysadmin completely reset? Ohhh it's r/maliciouscompliance you magnificent bastards!",
            "This sounds like a shit show, you did good.",
            "“I’m sorry sir but I’ve been drinking and can not in good conscience remote connect to work right now.”",
            "Well that's embarrassing. For the company.",
            "My husband is in IT and they call him every day when we go on vacation, evening, weekends. He have had to pull over many times for him to get his laptop out and fix whatever. It’s so frustrating, he’s salary to and on call 24/7. Many cancelled hiking trips and dinners.",
            "I worked in California for a company in software support and they had our team on-call. They paid everyone salary believing that they could play by TX rules, which is where the HQ was based. After a few years, someone had reported them to the Labor Board. They then switched things up and we found that we weren't salary exempt, but non-exempt, meaning we were due over-time. Previously they had been giving those On-call like $50 a day for the on-call \"bonus\". On-call actually means you're working 24/7 because you could be expected to receive a call at any time and you'd have to be ready. After the switch, they found that they would have to pay all this overtime for those on-call. They changed gears again and said on-call would only be for a few hours during the week and only 6 hours each day on the weekend. They also deemed that since they were paying you for the whole time, they actually want you to do work the whole time by creating KB articles or doing some kind of work. Really shitty of them to think that in the past they were taking advantage of us, but now that they have to pay, they want work out of it. I quit shortly after this final change. Company tanked about a year and a half later.",
            "UPMC homie? I’m in Pitt :/",
            "He said good luck because he knows you caught him. Unfortunately it sounds like he thinks he covered his own ass. I hope that you covered yours better as you're clearly better at this than him.",
            "I hate when people post their stories without an ending. You really couldn’t wait one day to post the story?",
            "Yes update us",
            "!Remind me 3 days",
            "!Remind me 20 hours",
            "!Remind me 20 hours",
            "!Remind me 32 hours",
            "!Remind me 32 hours",
            "!Remind me 1 day",
            "Benintenth",
            "!Remind me 1 day",
            "[removed]",
            "!Remind me 48 hours",
            "!Remind me 48 hours",
            "!Remind me 1 day",
            " !Remind me 1 day",
            "!Remind me 1 day",
            "!Remind me 1 day",
            "!Remind me 19 hours",
            "Good luck, OP.  If I don't see your update here tomorrow, I'll be sure to check /r/tifu",
            "!Remind me 1 day",
            "!Remind me 1 day",
            "!Remind me 1 day",
            "Lurking this with interest",
            "Remind Me! Tomorrow",
            "!Remind me 1 day",
            "!Remind me 1 day",
            "Remind me! 1 day",
            "Remind me :)",
            "!Remind me 1 day",
            "Remind me! 24 hours",
            "Give us an update tomorrow!!",
            "!Remind me 48 hours",
            "!Remind me 48 hours",
            "Muggins, you little rascal you",
            "!Remind me 72 hours",
            "!Remind me 20 hours",
            "!Remind me 1 day",
            "I work in IT too and I NEVER ever take my laptop inside, it stays in my car for this exact reason. We get paid 500€ a month to be on call but it’s not worth it, I used to work 80 hour weeks and had nightmares about that phone ringing. \n\nNever again!",
            "Well done, OP, I only wish more people would do the same thing.",
            "!Remind me tomorrow",
            "Remind me! 1 day",
            "Saving for the update. Good luck!",
            "Your boss' response sounds like they expected this outcome but have to follow their own procedure. Fingers crossed here, but given your role I bet you get notified of on-call pay or at least some additional compensation.",
            "That's not going to look good on your TPS report.",
            "Remind me! 24 hours",
            "Take the day off ! Call in sick",
            "Oh, please update!!",
            "Remind me! 24 hours.",
            "Remind me! One day",
            "Send an email documenting this",
            "In this economy just get a new job for more money. It's the lay of the land.",
            " Remind me! 24 hours",
            "I hope that works out for you. I would start brushing off your resume. Not necessarily because they will fire you, but you work for a shit company. Shit companies can only pretend to get better. Find a better company to work for - Or you can be like all the other sorry assholes I know who complain about the same shit for years on end.",
            "Your mistake is answering the phone when you aren’t “on call” or given advanced notice. Just stop responding. Wait till the next day before work and call back and say “ just saw I missed a call from you, what’s up!?”",
            "Remind me! 1 day",
            "Please post a follow up! I’m assuming your username is indicative of your employer. Ive heard many things about them. Hang in there bro!!",
            "I’m gonna need an update lmao.",
            "Remind Me! 1 day.",
            "!remind me 32 hours",
            "Remind Me!",
            "Can’t wait for this update",
            "Good luck tomorrow.",
            "!remind me 12 hours",
            "!Remind me 48 hours",
            "Need an update",
            "!Remind me 24 hours",
            "B-e-A-UUUUtiful...",
            "!remind me 32 hours",
            "!remind me 24 hours",
            "Remind Me! 2 days",
            "!remind me 1 day",
            "R/updateme! Tomorrow",
            "This could be interesting",
            "R/updateme! Tomorrow",
            "This was so satisfying to read, thank you and please update.",
            "!remind me 20 hours",
            "!Remind me 20 hours",
            "Remind me! Two days",
            "r/updateme! Tomorrow",
            "You need to get this shit in email",
            "Remind me tomorrow",
            "Does the \"remind me\" bot work in this sub?",
            "op is well within his rights to refuse to log in after hours but given how corporate america is run by assholes, what he did was almost certainly a career-limiting move",
            "!Remind me 1 day",
            "!Remind me 24 hours",
            "!Remind me 24 hours",
            "Where is updaterino :<",
            "Remind Me! Tomorrow Check this thread",
            "I see you edited 1m ago, goodluck man",
            "Good catharting. You catharted the shit out of your boss.",
            "Update update update!",
            "!remind me 1 day",
            "!remind me 12 hours",
            "Update please.",
            "Please update",
            "\"wait, you guys are getting paid?\"\n\n&#x200B;\n\n i work in transport and usually something goes wrong during the evenings, it's just how this business works, i knew it coming in so i dont like but can't complain",
            "Looks like they paid the /r/clipsthatendtoosoon",
            "!Remind me 24 hours",
            "Just commenting so I remember to look for the update",
            " Remind Me! Tomorrow Check this thread",
            "Ah, the typical \"Work for free\"....that's cute. Glad to hear that you stood up for yourself and refused to work for free any longer.",
            "Remind Me! Tomorrow check this thread",
            "!Remind me 1 day",
            "!remind me 24 hours",
            "!remind me in 24h",
            "!remind me in 24h",
            "De",
            "!Remind me 24 hours",
            "Hahaha bet the boss got chewed out by his boss.",
            "I sympathize with you.  However I predict the bosses next move is to have an automated email tell you to take your laptop every day.  And you'll probably be the one to implement it.",
            "!Remind me 24hrs",
            " !Remind me 1 day",
            "I can’t wait for the update",
            "!remind me 24 hours",
            "Updated yet?",
            "Remind me! 1 Day",
            "!Remind me 12 hours",
            "!Remind Me 12 hours",
            "!remind me 1 day",
            "!Remind me 1 day",
            "Updaaaaaaaate",
            "Jobs that doesn't pay you for your work: Get out of there.",
            "Remind me! 8 hours",
            "!Remind me 1 day",
            "Big business, big religion, and big government have us by the balls, and I absolutely fucking hate it.",
            "You know for anyone who knows what UPMC is it would not be hard to figure out which part of which state you live in, also if your boss ever comes on here you could easily be found out all thanks to your username.",
            "I work in advertising, which, as anyone who works in a client based business, means that you are basically always on call to do whatever x y or z the client asked for last second.  This write up made me feel a lot better about expectations and my own work/life balance, so thank you.",
            "You could just claim that you’ve been drinking since you didn’t receive notice of work, and you’re not in a condition to work, let alone drive home to get your laptop.",
            "Good luck. I’ve been in a salaried position that operated similarly. Always on call can be draining.",
            "Heh, if your username alludes to a “not-for-profit” health care organization I have a hard time being surprised. Largest employer in the state be damned, the only time I’ve ever applied to work there is when the job I had was so bad that I was considering walking out.",
            "In future just say you are out with friends, and you don't have your laptop with you because you weren't made aware of it in advance.",
            "I have a salaried team that does support. We talk to that team's manager to make sure it equals out. No way can you be expecting 8-5 hours from someone you're regularly nailing with evening / weekend problems.\n\nWe also establish firm agreements on response times for various issues and then match that to staffing levels.",
            "Remind Me! Four hours",
            "Personally I would take up stuff like rock climbing or kayaking. \"Sorry i was 30 feet up when you called me... Sorry I was 2 hours down river\" Or binge drinking. No one will want your help if you are plastered when they call. Perfectly find since you are not on call.",
            "If only we stopped accepting this as the norm and lobbied for stricter labor laws.",
            "*a group email has been sent around, to remind people that laptops should be taken home, as in the event of the building been unavailable/inaccessible, recovery plans are for people to use their laptops to work from home/alternate site.*\n\nI was once called into my boss's office because apparently ~~some people complained~~ he thought, that me not taking my laptop home with me showed that I didn't do any work from home. Now bare in mind that the company had a very loose policy that you could slack off as much as you wanted as long as your work was done at the end of the week so a lot of people could goof around a little during the day but finished their work at home. IT nerds with little social life so it wasn't really a problem. I tried to explain to my boss that while I was working with the IT Gurus making 2x and 3x my salary, I was only a kind of junior tech in charge of orders so my workload was a lot different from theirs and I had intermitent downtime so yes I had time to goof around but my work was done so I wasn't taking my laptop. Also there was absolutely no on-call responsibilities attached to my job since I was pushing POs and invoices only. Long story short, he wouldn't drop it. So starting that day, I took my laptop home every day, where it stayed confortably inside my backpack until I left for work the next morning.",
            "I rarely work outside hours, but one time I did and received no recognition and was disappointed.\n\nI took a day off to play video games. I rarely take days off. It was nice. While in the matchmaking lobby I looked at the google news tab on my phone. One of the top stories was Amazon S3 goes down. Shit. We use Amazon S3. I decide to check my work email, fearing the worst. Sure enough, I have an email from customer support. A customer desperately needed their data that day. Shit. It had been a long time since I took a day to relax. I drove in to the office, fixed the problem, and went back home.\n\nI was kind of hoping for some recognition. My manager saw me in the office, I half expected him to ask why I was there on my day off. I thought maybe the customer service guy would put in a good word for me. I didn’t expect much, just a “thanks for helping out on your day off”.\n\nI cursed my bad luck. What are the odds that checking the news would lead to me discovering that the office needed me?"
        ]
    },
    {
        "post_id": "u06alf",
        "author": "wino12312",
        "title": "My husband paid for his own funeral",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/u06alf/my_husband_paid_for_his_own_funeral/",
        "score": 18019,
        "num_comments": 571,
        "created_utc": 1649551144.0,
        "selftext": "I used a local funeral home for his cremation and funeral. They didn’t take life insurance, it had to be paid upfront. So, I used, what I thought was our credit card.  I called to have his name removed. I was told that I was just a user and he was the owner. I asked to have the card in my name. She told me I was just a user and couldn’t own the card. This isn’t true, any credit card will let you assume ownership and be responsible for the bill in the US. So, not one to argue, I just let it go. I never got a bill, letter, anything. So, that’s how my late husband paid for his own funeral.\nEdit: I tried to take ownership. The bank wouldn’t let me. The attorney told me not to pay it. The bank could have sued the estate. But they would’ve had to establish an estate and then sue it. \nAlso, this is a huge multi-national bank. They have never bothered to collect any of the money.",
        "permalink": "/r/MaliciousCompliance/comments/u06alf/my_husband_paid_for_his_own_funeral/",
        "comments": [
            "My dad had paid in full for his plot in the family cemetery. Had paid the funeral home in full, we couldn't find the receipts ,the funeral home had changed hands and denied that he had paid. Guess who ended up paying?",
            "If they start bothering you for payment, tell them that you are just a user and not the owner.\n\nThat they need to contact the owner for payment and any further contact from them will be considered harassment.\n\nThey will have to bill the estate for their payment. And if they wait until the estate clears probate, they will have to write it all off.",
            "[deleted]",
            "I work for PNC and basically if you aren’t a primary or secondary, you get nothing. It’s actually a rule in place meant to protect against DV or other abuse. It can be frustrating when a daughter calls to pay their moms bill just to find out that they can’t; but when the ex calls to figure out where a recent purchase was, despite having all the correct information, they get nothing.\n\nEdit: whoa. \n\nSome of you asked and figured I’d put it here: \nWe have a probate department to handle the “if someone dies” question. \nPeople have the option to put on their account that someone is “authorized to talk to” or POA. It’s just like going to the Dr and authorizing who can have information. \nChecking accounts are easier, but when it comes to credit cards, that’s where it gets complicated.",
            "Thanks for the life tip",
            "Check your credit report! My spouse passed 15 years ago within a few days of her cc charging her annual fee. I was just a user. Jumped through their hoops to prove she passed and I was promised the annual fee was removed. It was the only balance.  They closed the account. A year later I was denied a new card elsewhere. Seems the charge was NOT removed and the debt was reported on my credit even though it was her account. Got it cleared from my credit and I'll never do business with citibank again.",
            "Hopefully you never get a bill. Funerals are too damn expensive. My family had to pound pavement for two weeks to moms funeral going and we didn't have enough to bury her like she wanted. Raised like $4k in two weeks!",
            "When I die. Throw me in the trash",
            "I contacted a company to let them know my father had died and to cancel the account and pay any outstanding bills.  I didn't even get as far as presenting his death certificate because they said \"we can only speak to the account holder\".  Well, OK then if that is how you want to play it.\n\nThey kept sending increasingly frantic letters to his house, and for each letter I wrote back as the executor asking them to put in a claim off the estate.\n\nFinally they decided to send me a letter where they now decided I was *personally* responsible for his debt and threated court, balliffs, credit ratings etc.  \n\nI don't take kindly to threats, so I had great pleasure informing them they were now beyond the time limit to make a claim (6 months in the UK) and basically told them to go pound sand.",
            "My grandfather was friends with the funeral home owner in his town and they set it all up ahead of time.  Arranged to sell his house upon his death too.  Really saved us a lot of trouble, he was a thoughtful man.",
            "I went through something similar when my husband died. I was the executor of his estate and wanted to use reward points toward the bill. The credit card company had set the account up in  their own way with me as an authorized user not as co-owner as we had requested. They got to write off over $3000.00. And the company would not even discuss anything with me, rather I was transferred to an outside company which closed the account.\n\nMy husband had one other credit card where I was an authorized user and this company had a totally different attitude. They expressed sympathy and asked if I would like the account transferred to my name and has that all done in under 5 minutes.\n\nI still have an account with credit card company #2 (really they are a great company) and after receiving bimonthly requests from the first company to get a credit card through them I had to threaten them with reporting them to authorities for harassment since I had sent them written notice to never contact me again. That took almost two years to get them to stop.",
            "Credit Card companies are full of shit with stuff like this. After my mother died I called her Credit Card company and informed them, sent them a copy of her death certificate and proof that they would be paid once her house was sold. A few months later I got a call on my mobile asking to speak to my mother. I told them that she had passed away and that they had already been informed and given proof etc and they told me they had absolutely no record of that. I asked them how, if they had no record, did they happen to have my phone number as the point of contact instead of hers.",
            "My mom: “When I die, don’t make a fuss. Just dig a hole and put me in the ground.”\n\nMe: “Wait a sec… dig a hole?! I thought you said don’t make a fuss?!”",
            "After my husband died I went and made my final arrangements with the Neptune Society.They will pick you up wherever you died, cremate you and put you in an urn already delivered and waiting in my garage. I also did a will, power of attorney and advanced directives and put them in an envelope and gave it to my son. I have lost 2 husbands and I wish I had those thing available when I could barely think.",
            "My Mum organised what she wanted, I had a term deposit that we called her planting money, she knew what songs, etc she wanted. She was to be buried in a family plat 60 miles away, for months she was asking me if I'd organised a mini bus to take every one there. She was on to it for months, in the end I told her I couldn't organise it until she gave me a date! That kept her quite, we did end up organising a stretch Hummer with catering, she would have enjoyed it. My husband and I have prepaid our funerals, we are having a \"bare cremation\" a company in Australia that does that for not a lot of money. and our family knows just to have a party on us",
            ">any credit card will let you assume ownership and be responsible for the bill in the US.\n\nThis statement is definitely not true at all banks, maybe some.",
            "I am going to pre-pay for a cremation (from a cremation company and not a funeral home) and a simple urn.  (about 1,000 to 1,200.00 currently) Then no service but simply a party to celebrate my life.  No speeches, no memorials, no flowers.  Just toasts, good food and drink.  Give the urn to the Veterans cemetery to bury me there with no service.",
            "The funeral\nParlor guys in a community always set themselves up as wonderful pillars of the community. They are worst vultures your will ever run into. The entire funeral industry in the USA is the greediest pack of low life thieves there is. check them out.",
            "You can't transfer credit cards from one person to another. You can be an authorized user but even AU's can't do the same thing as account owners.\n\nI don't understand where people get this idea.\n\nYou CAN report that the cardholder as deceased and then at that point the account is closed and the liability will eventually be written off if there is no payment. Since he was the only person on the account as an account owner no one else can be held liable for the previous balance.\n\nSource: Worked in credit card banking for 4 years.",
            "It's actually not true that a credit card will just let you take over as a user. It's a credit application and the debt is legally bound to the one who owes it. Condolences on the passing of your husband.",
            "I’m gonna need a citation on what would allow an Additional User on my credit cards fully take over my account and then remove me from it. \n\nBecause no, an account holder and an additional user are totally things.",
            "That is not true. If you were just a user when your husband died, they would not shift ownership to you. They could’ve potentially sued you for the amount you put on his card after he died though, but that’s kind of a hassle that most banks won’t get into because it’s expensive and suing grieving widows looks terrible. \n\nSource: I spent five years chasing down folks that used dead peoples credit cards.",
            "Hi OP, I work in banking.\n\nWe will not allow a joint signer, let alone an authorized user, to take ownership of a line of credit. That's not out of the ordinary, it's standard practice. Typically you'd have to re-apply because they'd need to make sure that you're creditworthy on your own.\n\nI'd also call them back and ask to be removed as an authorized user. While you are not legally liable for the card, it does still show on your credit report.\n\nEdit: Also, as others have pointed out, there is potential for the credit card company to call fraud on this. They'll likely request a death certificate to cease contact, and will be able to see activity after his date of death. If you are an authorized user on a card, that authorization is revoked when the person who granted it passes away. I don't know if it'd be easy to prove or worth their time, but they could theoretically take you to court for fraud. Either way, expect that you're burning a bridge with this company so if you also bank with them or if you want to have a card in the future that's something to think about.",
            "Hey op. I'm sorry for your loss and this probably is not the best time but I used to work for a credit card company here in the US. They are correct. You cannot just take over the card. I used to have this conversation multiple times a day. There are procedures that need to be followed. They should have sent you over to the probate or deceased account services.as long as you pay it back you should be in the clear but don't try to claim the charges as fraud.",
            "After my dad passed, mom was able to get all their cc debt written off.",
            "If your policy has a “freedom of choice” option, they pay out in as little as 72hrs, with options to just pay the funeral place directly. \n\nAverage cost of a burial: $15,000USD\nAverage cost of a cremation: $7500USD\n\nIf you have loved ones, you need to plan for this. A shocking amount of people go into debt just trying to bury/cremate a family member.",
            "I hate to break it to you, but that's not really how it works. Your dead husband has an estate with both assets and liabilities. Any money in joint accounts, any property in his name, are all assets. Any debt in his name, including that credit card, are chargeable against his estate. To close the account you'll almost certainly have to provide a death certificate to the issuer of the card, and they are going to come after his estate for the debt. It's certainly possible that you can just ignore it long enough that the issuer misses the chance to collect from the estate, but I wouldn't count on that.",
            "Is nobody mentioning the fact that OP couldn't pay for a funeral with life insurance. Isn't that precisely what life insurance is for?",
            "Hi. Worked for a bank & credit card company in the US. You cannot assume ownership of an account unless you’re a co-owner on the account when the primary passes. Being an authorized user is completely different, however, authorized users can still be held responsible for payments. Your best course of action is to take yourself off the account completely so they can’t come after you. They’ll eventually close the account and write off the loss.",
            "This may or may not be good MC, it’s an unsecured debt not always worth the effort of securing payment from the estate (or is something that they have a different process for).\n\nI’m not sure where you got the idea that anyone can assume ownership of an account, I think you’ve mixed that up with assuming ownership of a debt. The account can and will be closed with the primary borrower deceased. The credit was extended to them only and will not be transferred over to another user. Accounts who had two co-borrowers can have one removed though.\n\nThe thing to remember with credit cards is that it’s the opposite of a checking account - they own the money, you’re borrowing it charge by charge. Of course they will let anyone assume the debt in the instance the primary account holder is deceased, this is not the same as them granting you their credit.\n\nEdit: to clarify, it might not be good MC as the estate may still find the bank asking to pay the debt. So don’t write it off just yet. On the human side, if you talked to a department set up for estates, don’t worry about how they’ll take your complaints, they’ve heard worse. Whatever misunderstanding happens, you sound like you’re still approaching it from a logical perspective and just missing pieces of how it works. That’s expected in this situation and hopefully with time this resolves with a lot less frustration.",
            "Credit cards in the US don’t allow you to take over if you are an authorized user. They just wait for the death certificate and go after the estate.\n\nI know because I worked for a global credit card company for 15 years.",
            ">any credit card will let you assume ownership and be responsible for the bill in the US.\n\nVery not true. Spouses can request ownership be transferred, but there is no obligation in the U.S to allow it. It's purely the bank's descretion, especially because authorized users don't need to sign any paperwork assuming financial responsibility to be added as a user. \nJoint account holders are financially responsible, but there is a difference between the two types of users.\n\nSource: 8+ years credit card authorization/fraud work",
            "So sorry for your loss, but happy for your gain! ♡♡♡ also that's ridiculous they didn't accept life insurance... that's kind of why people get life insurance?",
            "Go on a vacation to ease your mind. I am sure your late husband would be supportive of it",
            "Did the same thing when my mother passed unexpectedly. She had me on her credit card from when she could to help build my credit and then kept me there so I had an \"in case of emergencies\" out. Paid the cremation and the cost of 25 certificates with the card since I could direct pay from her bank account and then close everything. \n\nWent to clear accounts and they refused to work with me because I was still considered a minor in their system. They closed the account and refused to let me do anything but the funeral home never called saying they needed money. I am still waiting to this day for a surprise bill from a collections agent.",
            "I'm so sorry for your loss.",
            "I paid my dad's funeral in November with a money transfer from his bank account. I've been in charge of his stuff for years already, I've never thought there was a malicious thing in this, but technically I pretended I was him when I ordered the transfer.",
            "In my state, if a debt isn’t collected within 6 months after death, it doesn’t have to be paid. This came up because I asked a lawyer about a $50 ambulance bill I got for my Dad… a year and a half after he died.",
            "There are credit card owners and authorized signers in the US.\n\nThe owner is responsible for the card and all positive or negative activity impacts their credit.\n\nThe authorized signer is a person who is allowed to use the card but has no obligation to paying it back.\n\nNow while some companies may have a process for an authorized signer to become an owner, it's not at the snap of a person's fingers. The owner would have to initiate the request and there would be a similar process to the application of the original card to assess eligibility.\n\nI'm not familiar with that process for most card companies and fully acknowledge that it may vary to appear easier or not accessible to the applicants. But I'm not surprised that it wouldn't be a quick or ready phone conversation. One reason a company would not want to do something like this is a person with good credit gets a card, adds someone with bad credit who would never qualify, and then removes themself from the card. That person with bad credit could wrack up s debt and tell the company to kick rocks and then repeat the process again.\n\nI'd hazard the phone rep, had they been guided verbally couldn't gotten you to the right team assuming the company allows the transfer of credit cards... But in the end, you benefit from their mediocre trained service.\n\nAlso, I'm sorry for your loss.",
            "When my mother died, I was executor of her estate and had to cancel all of her credit cards.  Part of doing so involved sending a copy of the death certificate.\n\nWhen they see the date he died, and that his credit card account was used AFTER THE DATE HE DIED, that charge can be considered fraud.\n\nAccounts of the deceased cannot be used after they die.  I could not access my mom's savings, checking, etc.  We had to go to court for all of that, which why my mother's attorney said we should close them all before she died.  But my mom was in a bit of denial about her prognosis until the last week of her life - and my then, her bank accounts were not what I was thinking about - so I just didn't feel right about doing it.",
            "There is a difference between an authorized user and a Co owner of the card. If you are an authorized user, you have no ownership of the card or the debt. If you are a co owner, you do. So yes, if you are an authorized user, they won't bother you for the money, it'll just get written off usually",
            "No you cannot assume someone else’s credit line.  That’s called fraud.  I’m sorry for your loss.  But the credit card company was right.",
            "Just drive my corpse to the nearest national park and leave me for the scavengers, that way I can get my meat eaten one last time",
            "When my brother died, my father gave the bill collectors the address of the cemetery as his new address.",
            "Sounds like the customer service rep did you a solid. She had probably seen things like this happen before and was thinking “nah let’s let this huge corporation eat that cost instead of this poor grieving lady”.",
            "Prepare to be fucked when the bank passes the debt onto you and expects you to pay it back with interest.",
            "This is legit, same thing happened with my mom, I believe my step dad knew what he was doing and appreciate the hell out of the guy for the way he set my mom up when he passed everything was covered snd taken care of so she got all of his retirement pension and has health insurance and her home paid for snd got a nice chunk of cash and all of the expenses and debt basically passed with him in all sorts of clever manors that she would have had no way of knowing ad he took care of everything and passed very unexpectedly.",
            "I may or may not have a family member that died and was in the hospital for a week before passing. He may or may not have given out all his credit cards when he knew it was coming, and they may or may not have been completely maxed out on computers, school supplies, and other needs by the time he passed. He had no estate and all the debt died with him.",
            "What's weird about that is that banks/card companies have a department to deal with this specific situation. There's a whole process surrounding it. While a garden variety customer service rep can't make changes like that (imagine the shenanigans people would get up to!), they should have sent you over to the specialists that handle winding down accounts when the primary is deceased.",
            "I have everything for my funeral paid for except for the cremation. Don't need a casket if you're dust. Ive even told my kids. Put me in a fedex box and ship me back home to be buried.",
            "pays for his own funeral.. what a mad lad lol\n\nRespect",
            "It’s very common for the deceased person remaining estate to pay for their own funeral, where I come from.",
            "This is fraud and you can have legal repercussions for this, just a FYI...",
            "Maybe I’m wrong but being a user on someone’s credit card affects your credit as well. So unless she closes the card with a death certificate her credit will get negatively affected if no one pays it or closes it",
            "My parents created a trust years ago and put everything in it. When my mom dies, my oldest sister automatically takes over as trustee and will distribute the assets after paying any outstanding debts. \n\nThe good thing is that she (my sister) has been working at a bank for the past year, so she won't have a nervous breakdown and dump it all on me!\n\nMy father died recently and, before he died, they gave joint ownership of all their accounts (as trustee).  When he died, there was nothing to do except take his death certificate and remove his name from the accounts.",
            "Sounds like a life hack.",
            "I'm sorry for your loss. Also, well played.",
            "Holy shit she found the infinite money glitch",
            "Actually the bank payed for it. Sorry for your loss, op.",
            "My BIL passed away and had no heirs other than his siblings. He had me on one account to handle things so I was executor. One bank wouldn’t let me close the account even with the death certificate. I used that bank’s credit card to pay for the cremation and service, made an online account (he never did online stuff), transferring the money to pay off the card and then the money was so low I didn’t care about it anymore.",
            "It is true that you are just an authorized user. Not the owner. No credit card companies don't just let anyone assume the debt. They'll take a payment but they won't change the name on the account. You have 2 options 1. Continue as usual. Use your authorized user card and pay the bill that comes in his name or 2. Send them a certificate of death and they will close the account permanently. If you wish a credit card in your own name, you'll have to apply for your own , with your own credit. They are not obligated by any law to simply switch the card over to you. Source: worked for a credit card company for 2 years as a customer service rep. The general belief of the public is like yours, but it isn't the way it's done.",
            "I don't get what kinda funeral house won't work with life insurance",
            "[deleted]",
            "Commits fraud on accident. Tried to change ownership instead of making payment to rectify situation. Ignores crime. Nice",
            "Sorry for your loss but glad you didn't get saddled with the debt.",
            "Isn't this normal? Funeral costs come out of the estate and most places treat funeral costs differently to other things that need to go through full probate first (which might take months).",
            "This can end up being fraud. Not a smart move.",
            "Sounds to me like the bank graciously paid for your husbands funeral, not your husband. Lucky",
            "Sounds like credit card fraud if I am being honest",
            "Honestly fuck banks and fuck funeral companies. Leaches both.",
            "How is this relevant to this sub?",
            "Using a dead person’s credit card is fraud. That’s what you did.",
            "My funerals are you paid for what’s the big argument.",
            "Until 10 years from now you’re hit with the bill with 5% apr",
            "Are you speaking ill of the dead? In this case your husband. And you want to be smug about it on reddit? \n\nSounds like your husband did right not to trust you with that ownership.",
            "One of the best (worst) times a Mrs. didn't pay for shit",
            "Bravo!",
            "If this us Canada then you need to apply for the survivor benefits. Funeral benefits and maybe spousal.",
            "Some states, like new mexico, allows the survivor to have ownership of an account. Otherwise, your screwed.",
            "They’re just gonna get the money out of his estate. His bill doesn’t just go away",
            "I get the feeling that she was winking through the phone...",
            "Pretty sure your late husband wanted you to take a cruise, too! He did like to pamper his princess... 😏😉☺️",
            "I definitely foresee this causing you problems down the line.",
            "Get it in writing and you’re set.",
            "Must not be in the United States, they ask for life insurance info up front & take the money off the top from that source before anything else.\n\nIt simplifies a lot of things, since there are usually multiple siblings, a spouse, etc.  Take the money off the top & then  what's left gets split evenly between the beneficiaries.",
            "I had to do similar things for \\*three\\* estates in 2019 and 2020.\n\nMom had all of her accounts with Chase, and we got them all closed very quickly after she passed.\n\nBut Chase and AMEX continue to send \"You're preapproved for a card!\" letters to all three of the deceased. I've given up trying to stop it, since I've already closed probate on all of them as of 2021, and any further hijinks are no longer my problem.",
            "If it will cost them more in attorney fees to recover it they will let it go.  Good info to know in a lot of cases; for instance- smaller purchases from large corporations that the customer gets the card issuer to do a chargeback.  If the amount is under a threshold the company just lets it slide.  It’s not worth their time or effort to fight the card company.",
            "My mom used my grandmas card to pay for her cremation. Same with my grandpa.",
            "Sorry for your loss",
            "Jesus, cool, not cool",
            "Bureaucracy! Facepalm.",
            "I'm a funeral pre-planner and I get asked A LOT if this works.  All I'll say here is I'm sorry for your loss and all my best.",
            "📝📝📝",
            "Good for you! There was a post like yesterday, OP said as soon as thier dad died(I think it was the dad) they took his CC ran down to the funeral home and paid for everything in full. Lmao",
            "I’m sorry for your loss, glad you got this paid for though, awesome",
            "This is why I've left my body to a medical school. When they're through with it, they'll do a cremation and send my family the ashes."
        ]
    },
    {
        "post_id": "m28qkh",
        "author": "BraveField",
        "title": "Send it EXACTLY like this",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m28qkh/send_it_exactly_like_this/",
        "score": 17962,
        "num_comments": 442,
        "created_utc": 1615410858.0,
        "selftext": "As part of my job working in complaints I write letters to customers. We don’t use templates and each letter is tailored to the individual. Sometimes customers raise multiple complaint points and each point is carefully addressed in the letter we send. We outline everything the customer is unhappy with, our full investigation and what we are doing to put this right. Or alternatively explaining carefully why their complaint is not justified.\n\nA new manager “Steve” was hired a few months ago and he decided that we were wasting too much time writing letters and he was going to come up with a template for us to use as we were obviously too “simple” to understand how letters are meant to work.\n\nSo he goes off and drafts a template and proudly shares it with us all. It was shit, to put it bluntly. It was full of typos and grammatical errors. But it also did not contain details of what the complaint was about or how we had resolved it. \nOf course this was pointed out to him in full why this was not appropriate and why it would lead to more complaints and it’s basically terrible customer service. \nHe lost his temper screamed and yelled until 3 separate people cried and 2 logged out of the virtual meeting. \n\nAfterwards he sent an email saying he wants his letter used EXACTLY as he has attached it.\nWho am I to argue? I sent the letters exactly as he had written them. Copied and pasted to ensure nothing was changed EXACTLY as he asked. Right down to his signature and contact details at the bottom of the letter. \n\nI told the rest of the team and they all are sending letters with Steve’s details too. Within the first week he had 40 customers call him and email complaining about the letter we had sent.\nThe week after 50 irate customers.\n\nSteve hasn’t looked into the complaint so he doesn’t know how to address any of the customers or understand their issues. \nSo I get phone calls day in and day out “this man is livid what was his complaint about”\nEach time I reply “oh it should all be explained in the letter I sent. You know the one detailing all complaint points, my investigation and resolution in full. I would just check that. Bye” \n\nThe whole department is now under investigation as customer satisfaction has tanked. Best bit is each and every dissatisfaction is scored against Steve. Every other member of staff has 100% satisfaction as nothing is logged against us- our name isn’t on the letter. \nSteve is on zero%. It’s a terrible shame\n\n\nEdit: goodness me this blew up. Thank you. \nHopefully Steve will get fired soon. We work in complaints we’re pretty thick skinned. To make 3 staff actually cry takes some serious work. He’s vile.\nI will provide an update if management ever get their act together enough to listen to our concerns.\n\nI do feel bad for the customers involved though. \nThe customers that are complaining about the letter don’t know that their complaint is upheld and that I’ve sent them compensation or flowers. They would normally get a letter apologizing deeply explaining what went wrong and how we will resolve it going forward. Those customers are normally absolute dreams the only time they come back to us is to thank us. I have never in all my days sent someone a cheque and a nice letter and had them phoning to yell at me. Poor deluded Steve",
        "permalink": "/r/MaliciousCompliance/comments/m28qkh/send_it_exactly_like_this/",
        "comments": [
            "Write us when Steve gets fired so we can laugh.",
            "[deleted]",
            "> he sent an email saying he wants his letter used EXACTLY as he has attached it\n\n\nI'm so glad it's in writing, as otherwise he might try to throw you under the bus.",
            "If you are using MS Outlook and are in a similar position, make sure you set the reply-to address correctly.\n\nIn the top menu pick `Options` => `Direct Replies To`. This will show a dialog box with a checkmark next to \"Have replies sent to\". Fill in the correct name here.\n\nWhen the customer hits \"Reply\" in their email program, it will then send the reply to the person you designated instead of yourself. (Your name will still be in the orignal \"from\" line.)",
            "I literally laughed out loud. I want to hear how this plays out for Steve",
            "[deleted]",
            "This post makes my heart soar. I was a Technical Writing professor and I spent weeks on letters--especially complaint letters, resolution letters, and assorted bad news letters. By the time I was done, my students understood that letters are incredibly powerful when crafted with skill.  Letters are a lot like magic wands.\n\nSteve is getting what he deserves. He should have paid attention in his tw class!",
            "That's some mighty good karma right there",
            "Another idiot manager showing how he knows more than the people who were actually doing the job.",
            "> Of course this was pointed out to him in full why this was not appropriate and why it would lead to more complaints and it’s basically terrible customer service. He lost his temper screamed and yelled until 3 separate people cried and 2 logged out of the virtual meeting. \n\nThat's standard narcissist behavior right there. Cannot handle being wrong or being challenged, or a threat to their authority.  Comes in, seriously overestimates his own ability, refuses to listen to advice, makes a horrible decision, abuses his team, etc.\n\nNarcissists are the worst, and easy to spot when you know the signs.",
            "Oooh this is a tasty one",
            "Oh do I feel this one. \n\nI used to work in banking operations for a top 20 US Bank. \n\nI mostly dealt with lawyers but people under me had to do this job frequently for really fucked up things the bank did to customers. \n\nI gave free reign for how my people wrote their letters, but I required a double check for QC. That means at least one manager and one other employee had to review and sign off on each letter sent to a customer. \n\nWell, someone thought I was taking too much time and like you, created a template, one size fits all, and took my mandatory double QC down to one other employee. \n\nHonestly, it made the metrics look good for a month or so, until Mr.Fuckster(sic) called in furious at the double misspelling of his name.",
            "Please, oh please, let me know the fallout!",
            "Absolutely brilliant. This is the malicious compliance I live for",
            "What sort of company gets that many complaints, that you can't write the letters quick enough!?",
            "I know Amazon gets a lot of shit but the reason I order from them for almost everything is their amazing customer service. There are far too many Steves in the customer service world.",
            "Thank you for your post.  \nWe are sorry to hear that your STEVE has not performed to your Satisfaction.    \nEvery STEVE is dispatched to our customers with the utmost in care and quality in mind at all times.   \nIf this STEVE continues to dissatisfy you, please click the provided link and fill out the survey.   \nAlso, include the lot number of your STEVE and when your STEVE was first installed at your location.     \nSurvey : wwww.survey,akami.lipservice.lol    \nYour STEVE lot number can be found on the mounting surface of your STEVE.    \nThank you,    \n-The Team.",
            "So since his satisfaction tanked, can we call him Scuba Steve?",
            "I have an online shop and field messages from customers all throughout the day. Some questions, some complaints.  \n\n\nSince I was answering the same questions or addressing the same types of complaints I made about a dozen generic templates.  \n\n\nFor example - Q - Why hasn't my order shipped \n\nA - Detailed explanation of our production process, estimated shipping window, the fact that they already received all this information in their order confirmation, etc.  \n\n\nHowever each template is drafted so that I can easily modify it to answer their specific questions or complaint and it looks like a personalized message instead of a generic response. This saves me time typing the same information and I use that time to investigate and address their issue/question personally.  \n\n\nHowever it is incredibly naïve from a customer service standpoint to think you could draft one set response and send it to everyone, regardless of what they were contacting you about. Templates should be tools and a starting point, not the actual response verbatim!  \n\n\nY'all have my sympathy and I hope Steve is justly rewarded for his contributions to your department. Hang in there!",
            "Good on you. Hopefully you update with the fallout if there is any",
            "As someone who takes complaint calls all the time, this warms my cold, dead heart.",
            "[deleted]",
            "Beautiful. Absolutely beautiful. This is malicious compliance at its finest. Good work.",
            "Agreed 100% Blizzard did not think this through.",
            "Please share this letter with us. Sanitized to protect identities. Please. Please. Can we please see it?",
            "OMG, if i had a free award to give. Lady your customer service skills are AMAZING.",
            "It's kind of ironic and beautiful that Steve, the manager of the complaints dept, has all the complaints against him.",
            "Love it!",
            "Damn. This made my nipples tingle.",
            "This is Gold man! Dug his own grave!",
            "Goodness gracious! Reading a teamwork solution post like this gives me a bon.. wait. What's the female equivalent of a justice boner?",
            "As someone that works in complaints and also has to write letters with the complaint points, bravo.\n\nWe have a template that we amend. There are also grammatical errors so that’s universal apparently.",
            "Ah but if his TPS reports are on point he won’t get fired",
            "The thought occurs to me with all this working from home if recording your virtual meetings might be advisable. Not necessarily long time or anything. Just long enough to save it if something like this happens. \n\nI'm sure there are legal considerations but maybe...",
            "\"3 separate people cried and two logged out\" ...lmao, seems legit, I mean wouldn't that warrant a big ass complaint to HIS boss alone, I'd probably fire a guy whose first meeting goes like that but idk ...",
            "Wait you said you work in the complaints department and Steve said you were spending too much time working on complaints???",
            "Is it bad that I want you to write me a letter when I'm not even a customer? I miss mail. I bet y'all write nice letters.",
            "> Hopefully Steve will get fired soon.\n\nI'd fire Steve simply for deciding that excellent customer service isn't something we needed.\n\nWhile I can see adding some templates for addressing common issues (if there are any) even those ideally are customized...tactically working with ya'll to improve efficiency, while not lowering the service level...etc.  As ya'lls way of handling issues and actually addressing them is rare and very much noticed these days.\n\nWell and for screaming at their team on a call like that.  I don't have use for those jerks.  (I hope some folks field grievances for him being an abusive manager as well.)",
            "Remind Me! 7 days",
            "You had me at “right down to his signature.” Made me smile an evil smile. Good on you!",
            "This is BEAUTIFUL!",
            "I want to know if he can go into the negative ratings.",
            "A bit off topic, but your job sounds exhausting.",
            "Quelle Dumas.",
            "Can I mention how much I adore the \"It's a terrible shame\" at the end there?\n\nJust perfect.",
            "The schadenfreude is strong with this one",
            "I love dudes like Steve. 99.99% of my customer complaints I can fix instantly or nearly instantly, something like this would be terrible for us all.",
            "Seriously epic customer service prior to the Steving. Must be a high end store and I’m guessing it’s not in the US",
            "I feel sorry for the customers sure but this? This is glorious.",
            "I am a teacher, who has to teach efl students how they are supposed to write their business letters. Could I use your malicious compliance to give them an example of what not to do?",
            "I'm the Director of Customer Support for a software company. The first thing I learned about management is to always hire people that are smarter than me. Well done.",
            "Mark's Rules of Customer Service.\n\n  \n\nThe second most expensive in the world is a first-rate customer service experience.\n\nThe MOST expensive thing in the world is a second-rate customer experience.",
            "I’m just in shock that any organization takes the time to develop a well thought out letter addressing complaints in detail. This must take an enormous amount of time and the customers must be famous, rich or highly sought after to warrant this approach. Makes me wonder what the product/service is that OP works in that caters to this level of clientele.",
            "Mutiny on the Bounty",
            "Fuck Steve.",
            "What kind of industry is so rife with complaints? Also whoever hired Steve and was in charge of him should be punished",
            "Yes.  Let us know when Steve gets fired.",
            "My question is what do you guys fuck up constantly that you have to send apology flowers?",
            "Please be true please be true please be true please be...",
            "Remind Me! 7 days",
            "I’ve done these exact letters working as a complaints manager. They do take a while as they need to be appropriately detailed and professional as it outlines everything for the customer to go to the financial body that governs our company and can dish out massive fines.\n\nThe only template I would send out was an initial complaint acknowledgment saying I’ll be in touch. \n\nIf I had a Steve tell me to all my letters by template then I wouldn’t want my name against it either. Good customer service is something to take pride in even if you hate your job.",
            "Oh yeah this kind of guy.. well done from your side. Feed him to the wolves!",
            "I hope, once Steve is shit-canned, that your team is allowed to go back and write a new letter to all the customers who received the form letter. Both to respond to their initial complaint, and to explain the circumstances of the terrible form letter.",
            "Sounds like you work in UK Financial Services complaints where Steve's approach is standard.",
            "“Don’t you worry about Planet Express. Let *me* worry about blank.”",
            "Thank you for writing those personal letters. I did CS for awhile and always knew customers were at least feeling better knowing I was listening when addressing their issues even if i couldn’t do anything about the problem. Those letters are sorely needed in a generic form letter world. It really helps deescalate the aggression.",
            "I actually love you. I hate Steve.",
            "Beautiful. I want to know when he gets fired!",
            "Staggering. This is a typical case of a manager pushing his authority rather than being a leader. He should be proud to have a team that tailors for individuals. Sure it costs X amount of time longer, but customer satisfaction should be a priority.   \n\n\nYou can save time sure, but if every staff member and customer is pissed off, then he's fucking failed.",
            "Eat that, Steve!  LOL",
            "I contacted subway once after the cashier was extremely loud and demeaning. The store owner contacted me and told me he’ll give me a free coupon. I said sure, that’s not why I emailed but I’ll take it. Just ghosted me after that, no coupon even though I reached out once more after that ..",
            "Out of curiosity why your previous manager was replaced ?",
            "[removed]",
            "Would I be correct in assuming \"Steve\" is so young that they didn't go through the \"how to write a letter\" lesson in school? Do they still teach that, now that I think about it? Damn I feel old now.",
            "Somehow it seems to me that if we knew the industry or focus of the business we're talking about here, things would be found to be hugely worse than OP's portrayal.\n\nPlease, a hint: what does your company do?\n\nI mean, what if it were a mortuary? A suicide hot line? A women's clinic?",
            "As much as personalized letters are more impactful the idea of working that way is not only irresponsible but assinine. Make better templates and save yourself a lot of time.",
            "Imagine crying because of work lmao",
            "Steve gone yet?",
            "Please be sure to give us an update!",
            "That's EXACTLY where this is a death machine.",
            "Please do make an update on this. That would be hilarious",
            "Holy shit, what a massive own goal.",
            "I hope Steve learns the right lesson from this. I doubt it, but I hope anyway.",
            "Which company do you work for? Looks like the sweetest company out there.",
            "Yep that’s EXACTLY what it is like",
            "Getting irate calls from customers you've sent a cheque to to compensate them must take some real talent!",
            "Oh I love working with an asshat manager, giving you stuff to do you know is wrong, but you do it exactly as they say and watch it blow up in their face after. I don't know what happened sir, I did exactly as XY told me to do.",
            "Steve has apparently managed to rise to his ultimate level of incompetence. So who is he related to?",
            "Hi Mom, I made it into real renaissance.",
            "Having been involved in our second cms deploy now... this post was triggering... \"snippets\" aren't templates, you're not meant to cram the entire email in there to be sent at a moments notice you're meant to use them as shortcut boiler plate and fill in the rest... but no... they make me cram the entire email in there, half a meg of html - btw there's a 20k character limit so I had to find a way to automatically prune the html back to the bare essentials without breaking the template...",
            "STEVE SUCKS ASS",
            "Omg, this was great!\n\nPoor Steve! \n\nStupid is, as stupid does. \n🤣🤣",
            "Fuck you Steve!",
            ">The customers that are complaining about the letter don’t know that their complaint is upheld and that I’ve sent them compensation or flowers\n\nAm I the only one wondering which company is sending out flowers to customers as way of an apology for complaints?",
            "Belongs on this sub: r/todaystevefuckedup",
            "When new managers try to 'fix' what isn't broken, lol\n\nLove to hear what happens to Steve",
            "How do I get notified once OP edits steve’s firing ?",
            "Might be the best malicious compliance I’ve ever seen.",
            "What kind of business or field is getting 40-50 Complaints a week? I guess some kind of big entity but what area? That seems like a lot.",
            "!remind me in 30 days",
            "What a POS! Little man, little dick syndrome I think!",
            "Gotta burn a fuckin candle to make it smell good",
            "!remind me in 14 days",
            "Masterful. Devious. Punching up.\n\nI love it.",
            "E-mail audit trails are the best.  If I worked for a dodgy company, I'd keep regular .pst backups too.  Great post OP, thanks.",
            "Is Steve the male version of Karen?",
            "Is he fired yet?"
        ]
    },
    {
        "post_id": "ln73gb",
        "author": "Blewyouremyboy",
        "title": "Work a double and get written up...or",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ln73gb/work_a_double_and_get_written_upor/",
        "score": 17907,
        "num_comments": 450,
        "created_utc": 1613710191.0,
        "selftext": "In high school a few friends and myself worked at a local chain restaurant.  We were fully able to run the day shift but had never really broken down the equipment and closed up for the evening. One particular night, a few of the night shift had called in sick, we were asked to pull a double and close the restaurant, which we did. Essentially worked from 10a.m. until after  midnight. Myself and my three friends and a manager. We were really tired but felt that we had done the right thing and helped out the company. \n\nThe next day the four of us come into work another day shift. The day manager pulls us into her office, one by one, and informs us that she would need to write us up because we hadn't properly cleaned and filtered the fry grease. Regardless of our leaning in for a double, having never closed or been trained on closing procedures,  and having been given permission by the night manager to leave (meaning all closing work had been completed). After a quick chat with my friends, it was aligned that I was going to push back on the write up, and if the day manager insisted on writing up us, we would quit. I informed the manager that we were collectively not going to sign the write up slips. Her alternative, threat, was that we would be fired, to which I informed her that if she insisted on writing us up for helping out, pulling a double, not being trained,  and having been released by the night manager....then we would quit. Collectively.  Immediately. She responded with \"If you don't sign the write up, then you will be  fired.\"  A staring contest follows, I eventually break in with an, \" Ok. I guess we are fired then.\" We turned in our hats, quit symbolically and left. It was really really amazing,  my friend quit mid-burger prep,  my other friend simply walked off the cash register in the middle of taking an order. We clocked out and walked out the back, leaving only the day manager in the restaurant. Customers in line, customers at the drive thru.\n\nLater that same day, we decided return to our place of prior employment. To have dinner. The night shift must have still been sick as the entire restaurant was staffed with managers from nearby restaurants (same chain), including our day manager, who was now pulling her own double, and the night manager that had released us the prior evening. There was nothing better than eating our burgers and watching the management staff fail at every station and knowing that their pride, lack of rational flexibility, and threats had resulted in one of the most righteous meals we ever ate together. \n\nNeedless to say we were all employed at the next chain restaurant down the street in a matter of days. It's been nearly thirty years and I remember that stand off, her ultimatum, and our walk out like it was last week.",
        "permalink": "/r/MaliciousCompliance/comments/ln73gb/work_a_double_and_get_written_upor/",
        "comments": [
            "If you took a moment to tell one of the managers from a different store why you all quit that manager probably would have ended up getting fired. 100% the area manager didn’t get the true story.",
            "\"Don't forget to filter that fry grease tonight!\" as you saunter out the door.",
            "I hope you sent your food back for not being prepared correctly.  Then again, not sure it was safe to eat it.  They were probably pissed enough to mess with it.",
            "\"We will leave!\"\n\n\"If you leave, I will fire you!\"\n\n\"I guess we are fired.\"\n\n-surprised face-",
            "Always remember: The boss needs us more than we need the boss! Good job!",
            "I just don't get it, these types of responses from managers.\n\nHow about this? \"Thank you for your collective sacrifice, I know it wasn't easy, and we all appreciate it. Just in case any of you need to close again, let me show you all how to properly clean and filter the fry oil. And by the way, all your lunches are on me today, thank you again.\"\n\nThe fuck is so hard about that?",
            "I've had shit like this happen at almost every restaurant I've ever worked. Somehow going the extra mile is just an invitation for people to try to make your life harder or find some nitpicky thing to complain about.\n\nOne of my favorites was when I was asked to stay and work a double because on of the prep cooks didn't make enough. I come in the next morning and the guy tried to start giving me the business about how I needed to clean his station despite the fact that I had to work a double due to his incompetence. This escalated into him trying to start a fist fight with me, which I declined because I'm not stupid enough to get fired by punching someone over a tiny bit of flour left on a fryer.",
            "This story is far more delicious than any burger. Thank you for sharing!",
            "I LOVE this!! Omg...so friggin’ *perfect*! I sincerely hope the day manager got a proper reaming from *her* boss! She sure as hell deserved it. I thought you were going to say she did something unexpectedly nice (wasn’t paying attention to the sub). She got pissy with you after working an unexpected 14 hr shift? Without being trained how to close? She shoulda been singing your praises. She had to have been a pretty bitter and unhappy woman to have responded that way.😒Lol! I’ll bet your dinner that night was the best tasting burger in the history of burgers! Way to stand up for yourself! Most excellent.👍🏻Are you still friends with the guys who walked out with you?",
            "I applaud you. \n\nI too left a taco place for such a write up worked a 16 hr day (new years day, Las Vegas) barely15 min break. I ate at my station (drive-thru). The next day I get a write up for being short, same drawer the whole day. No thanks for working when half the crew called out. Just yelled at. That was my last day I quit on the spot found a better job in a week.",
            "I hope you sent something back and said it doesn't taste right, sorta like someone forgot to filter the fry grease",
            "You can't see me rn but I'm doing the chef-kissing-hand-at-a-thing-of-true-beauty gesture.\n\nLove the fact you all went back in later too!",
            "You don't ever have to sign a write up.",
            "This reminds me of a time I worked at a super busy Tim Horton's where me and my two friends did about 90% of the work throughout the day. After months of complaints of the other staff hiding in the back, taking an hour to do a 5 minute task, or straight up disappearing at times going ignored, we decided to no-call-no-show together and FORCE the other employees to work.\n\nApparently it turned into a complete shit show. While they had to write us up for the no-show, they apologized to us for realizing that the other workers are awful at their job. I'd like to say that things improved but they didn't and the three of us found better jobs shortly after. I never worked in the food industry again.",
            "What terrible management.\n\n\"Yes I'm going to punish you for not doing something you weren't trained to do that the night manager knew had to be done\"\n\nMakes perfect sense!",
            "hopefully the leaving remark was \"make sure you properly clean and filter the fry grease\"",
            "Being OP and their friends had never been trained I would have let corporate know about this. Hopefully someone in management would take a closer look into this situation.",
            "I’ve heard some version of this story at nearly every restaurant I’ve worked at and their all true. I don’t know why but kitchen managers are some of the most ungrateful entitled people I know. They are like real life sitcom characters.",
            "That is amazing.\n\nAnd an awesome example of why workers need unions.",
            "Did the night manager back you up? If I was the night manager I would be hopping mad",
            "I know you're older now, but I really enjoy hearing how younger people have the fortitude ti stand up for what it right. \n\n\nSide note: The end where all the managers were failing at all the stations. That's why I have a huge problem with supervisors/managers being in a position because \"they're only there to manage the personnel\". This is exactly why.  How can you supervise ME if YOU don't know my job.",
            "That is a story where some Wood Guthrie is playing in the background and increasingly getting louder.",
            "This is like a dream scenario for everyone who ever worked at a fast food restaurant.",
            "... so anyway, JOIN YOUR FUCKING UNION.\n\nThey literally exist to do the good bits of this story.",
            "I wouldn't order anything fried. I hear they don't clean the fryers",
            "Hell yeah!!! This is amazing.  I once made a big show of walking out but mine was my GM response that sent me walking.  Told GM of the sexual harassment by the day chef. It stopped for about a week but then he was back at it. Told GM again and this time sexual harassment stopped for a few days.  \n\nFinally, talked to GM again and his response was “that’s just how he is.”  I walked out of his office, threw my apron, grabbed my stuff and walked out.  The lunch rush had just started, line was out the door and I was the shift manager.",
            "Myself and a couple friends did much the same to an incompetent manager at a fast food joint in our tiny town (seriously tiny, next closest loation for the franchise was 30+ miles away).  I was up front on the register, one friend was on the fry station, and the final friend was on the line, making burgers. Things got slow, so the manager assigned us all some basic maintenance tasks (clean the drains out, sweep/mop the coolers, and rotate ALL the inventory, IIRC). A bus came in, creating a large rush. With the manager on the register, and the maintenance guy (her SO) on the grill and line, they were very quickly getting overwhelmed, so I suggested that my friends and I stop doing maintenance and help out. Well...I got told that \"she knows best, and if we had a problem with it, we could quit\", so we quit. grabbed our bags from the break room, changed out of the uniform shirts in the bathroom, walked up to her at the counter, threw the uniforms in her face and walked out. The next day, we all had jobs at another fast food place next door.",
            "BRAVO BRAVISIMO ENCORE",
            "Now this is an excellent example of malicious compliance. 10/10. Well done!",
            "holy fuck.  I loved reading this.  Thank you for your contribution.  I would have personally got a karen haircut and asked for the manager",
            "That's a great story, and I commend your camaraderie, though maybe things have changed or it varies in different businesses: I've refused to sign a write up and was told my signature wasn't necessary, that it was going on file anyway. Fuck management and double standards!",
            "I worked at a 50’s themed diner when I was in high school as a busser. It was five cent burger night (buy a burger and two drinks at regular price, get a second burger of equal or lesser value for 5 cents) and the store manager had forgotten to order more rags for cleaning tables. We were slammed and had a single towel for the entire restaurant! I had gone to another busser to get the towel to clean off my section and the manager slammed his hands on the table, got in my face and screamed “QUIT FUCKING FLIRTING AND GET BACK TO FUCKING WORK!” - all in full view and hearing of the packed restaurant. \n\nI went in the back, grabbed my stuff, called my dad for a ride, and left. The other busser and the dishwasher told me at school the next day that they and all the kitchen staff walked out shortly after I did leaving only the manager and a handful of servers to run the whole restaurant. Within the week that manager and the store manager had been let go for being so understaffed. \n\nIt felt really good.",
            "I worked at an amusement park with an attached water park. I was one of the most experienced janitors they had. One night there were some severe storms that were to hit the area at the time of the waterpark's closing (the main park closed two hours later).\n\nThose of us closing the water park restrooms decided to collectively cut some corners because we wanted to be in shelter before it got too bad. We made sure to get the trash, mop, and clean any obvious messes, but otherwise we didn't do the full closing procedures.\n\nGuess what, they didn't get mad. Could we have done the full list? Yes. Would it have endangered our lives, yes. Safety is a huge priority at an amusement park. I was a hard worker who had very high standards. If I made the call to cut corners to keep us safe, it was for good reason.",
            "Draining and filtering fry grease is extremely dangerous. Worked with a guy named Woody. Went from dish jockey, to fry guy. Hey had to filter the oil for one fryer mid-shift. He was totally in the weeds. He knelt down to open the drain, it was stuck. He put his hand on the fryer to steady him self as he stood up. Hand  slipped and his arm went right into the fryer to the middle of his bicep.  The sound of his flesh frying and his screams were brutal, but the thing I’ll never forget was the smell of deep fried human skin.",
            "Where I live if you got fired for that you could DEFINITELY sue for unfair dismissal. Are there not laws that protect against this?!",
            "🎶Sooolidarity foreeeveerr, Sooolidarity foreeeveeer...🎶",
            "Love this. Collective bargaining and workers who know the company needs them more than they need the company - minimum wage jobs are so much less shitty when you know you can afford to lose said job!",
            "Quitting a shitty job with a shitty manager is one of life's little pleasures. Along with getting fired for doing the right thing, I recommend it at least once, preferably when you're young and it doesn't matter.",
            "Yeah no...\n\nNot fully training you... Their fault\nNight manager clearing you... Their fault\nNot to mention possible child labor law violations.... Their fault\n\nSorry when I was in the restaurant I was always trained on all tasks, just for this type of situation.  When I was a manager in the pizzarias, my drivers always learned every part of the store before taking a delivery.  All of my employees were fully trained and capable of doing anything in that store at any time needed.",
            "do you have diamond balls? first time i pushed back against a write  up the first time in my life when I was 36. I won, i crushed it and my boss.  I walk tall like rambo down the hallways in my company.\n\n&#x200B;\n\nbut your doing that at what...18?  17?  leave some women for the rest of us dude.",
            "Ah yes the classic “I’d rather win the power play than actually be a competent manager” chess move. This was very satisfying to read. Thank you. Good on you.",
            "For anyone thinking of quitting like this. If they give you an ultimatum to do something or be fired, and your thoughts are \"if they make me I'll quit\" don't mention quitting at all. If you're fired you have a stronger case to receive unemployment.",
            "A zillion years ago, my manager made me fire a coworker (whom I loved like my own.) I tried to argue my way out of it, but \"I'll fire you for cause if you won't follow a direct instruction.\" I wasn't even thar colleague's supervisor. \n\nI knew at that point that my colleague was going to lose his job, regardless of my actions, and that neither of us would collect UI.\n\nSo I cried and told Kyle that he was fired. And then I took my keys to the boss's office and quit. \n\nAnd the boss - who had no idea how to do my job or Kyle's- had to do our jobs for a while. I had a comparable new job the next day. And the boss's boss called me a few months later to offer me a promotion, with the promise that I'd never directly report to that guy. I honestly loved my job. But I walked out again when that turned out to be a lie.",
            "You, my friend, formed a union at 17. Excellent work! I bet that burger was the best you'd ever had there. Manager tears always make things taste better.",
            "hahaah she no doubt remembers it too! in her nightmares . when she wakes up screaming and reaching for that half empty bottle of tequila. love it!",
            "Let em fire you, collect unemployment insurance for a week.",
            "The power of solidarity.",
            "Shot in the dark this was a mcd's. Their management are unnecessarily entitled for being a fast food manager.",
            "Fast food is filled with people who do things like this.",
            "It amazes me how managers of minimum wage employees don't realize that they usually need the employees more than the employees need that specific job.",
            "You learned early on, it doesn't pay to bend over backwards for a company that will discard you at the drop of a hat.",
            "When was in high school 30+ years ago, the state had very strict rules about  the hours that employees under 18 were allowed to work. No work during school hours, no more than 4 hours on school nights, no working after midnight, no shifts longer than 8 hours and no more than 20 hours in a week. \n\nAlso, I couldn't operate the slicer, but the deep fryer? I spent so many hours running that thing with little more training than \"Don't touch the oil, it's hot\" and \"Don't spill water in there.\"",
            "So instead of taking the time to properly advise on how to perform that procedure, they wasted time intimidating you and writing you up. Instead of, \"Hey, I noticed you did this incorrectly so let's show you how so you're prepared next time\" they wasted valuable time in pointless meetings.",
            "“It’s been nearly thirty years...” in the final line really got to me. Story could have happened yesterday in any fast food joint in the world.\n\nWork. Work never changes.",
            "Going back as customers was the coup d'état. Bravo.",
            "Dude, this is awesome. My similar story isn't as righteous. I worked at a grocery store and started working shifts in price control after I had been working as a cashier at the front end. I was scheduled alone on Sunday morning (the first day of the new pricing week) without having been completely trained. I did my normal rounds, changing signs over on end caps and tables and scanning product. I returned to the office to print labels & signs for the product scanned. While they were printing, the bakery manager came into the office. She was at a 10 immediately and yelled at me that her signs were wrong. The people who worked price control on Saturday were responsible for making the big signs for all the departments. I hung tags on Saturday night and had never been trained to make the big signs. I was all alone for another few hours. She told me that's unacceptable and called me stupid for not being trained. She told the manager on duty and I explained to him that I hadn't been trained. I returned to my rounds, very upset. My co-worker came in a few hours later and made the signs. She defended me to the manager on duty. The next day I got written up by my own department manager. She told me I should have known how to fix the signs, even though she trained me and never trained me to use the computer that made big signs. I refused to sign the write-up and put in my 2 weeks. It didn't feel as righteous or triumphant. It felt miserable bc I was alone in taking my stand and everyone but my co-worker was against me. My co-worker quit shortly thereafter.",
            "Man I Gotta say after that, the special taste in the burger wasn’t the taste of victory lol",
            "This is fantastic",
            "> had resulted in one of the most righteous meals we ever ate together. \n\nThis is a rare sentence indeed. \"Righteous meal\" indeed.\n\nTalk about grinding the wound with salt.",
            "You should have told the managers from other stores what happened, so they understood that the reason they had to come in and pull double shifts is because your old manager is incompetent.",
            "Does life ever change? \n\nThere's always someone hoping you won't realize your options.",
            "[deleted]",
            "Glorious!",
            "When your in high school, especially in the early 90's, you can collectively walk out on a job like that.",
            "Fuck that manager and all managers that manage in that stupidass way. I like this story",
            "I love this story so much!!!! You have my respect!!!",
            "This is the power of organized labor.",
            "I was a newspaper selling teen (with 4 friends) who were going door to door in dangerous neighborhoods selling papers. It was crap work, but the bonuses were okay. Minimum wage plus you would sometimes get movie tickets.\n\nThe “crew chief” who drove us around in the company van was really rude and unappreciative - he was always condescending and telling us we needed to sell more. And his van was just...gross.\n\nOne day, while in my own neighborhood area, I flat out told him that if he didn’t say at least a “thank you” next time we delivered a check/form to him - all 5 of us would quit on the spot.\n\n“Well, if you quit, I’m not driving you home.”\n\nSo I go out and sell my butt off and come back with 3 subscriptions to the paper. I give it to him from his rolled down window while he’s reading a book and he says “go get more”\n\nI said “nope, I quit” and walked home with my friends, who also quit (and had their own reasons...but mostly it was because this dude was rude.)\n\nLearned *years* later from someone who worked at the paper that crew chief/driver was given a desk job that he hated for a while because no one would work with him.",
            "As highschool students, you could have REALLY fucked them over...There's a very strong chance that the double you pulled broke employment of minor laws.",
            "And this is why unions are effective, and how a general strike could force changes like an increase in minimum wage and greater worker protections.",
            "I have read several stories of manager conduct towards employees at fast food places.   I do not understand how managers at minimum wage fast food places pull such attitudes.  Getting fired or quitting is not that big a deal.  Do they think that there are not literally thousands of fast food places that pay minimum wages?  As described in this post, do these managers think people can't find other minimum wage fast food jobs pretty quickly?",
            "Going in for dinner that night? *chef kiss*",
            "I’m waiting for the manager to post their petty revenge story detailing how they spit in your food after you orchestrated a ‘mutiny’.",
            "I would have gone in there and been the biggest pain in the dick customer ever. Having worked fast food I would have Informed them that you need unsalted fries, and then added salt right in front of them after forcing them to run a new batch of fries for you.",
            "That was beautiful",
            "I think you win reddit today.",
            "Take the writeup and make the next month hell.",
            "\"you can't fire me, i quit!\"",
            "You went back to *that* restaurant *that* night? Damn. That is such a wizard move. Well done!",
            "This is amazing,  I wish more employees would get together like this.",
            "Solidarity forever!",
            "I hope you filed for unemployment 🥲",
            "I really want to start an organization to educate young adults about this sort of thing. It’s amazing how common this all is.",
            "I worked at a burger King once. I'm surprised nine of your managers know the job. At my place, all of the managers literally had to know how to work closing shift. As in, how to do all of the work, cooking cleaning and whatever. Now, they didn't really have to use that knowledge often, but they still had to know it\n\nThis is how it should be everywhere. Managers should be required to know, and to have the experience, on every job that they oversee.\n\nAnd most importantly, the higher up company owners. How dare they complain about stuff not being done when they literally refuse to hire more than 2 people for a shift but they want 4 people worth of work done. And they won't even think about raising the pay and asking for more work. Just demand more work or get in trouble, end of discussion on their end",
            "The only thing that would have made this better would have been collectively filing for unemployment.",
            "Quit more over less. Walked out on a few restaurants in my old career",
            "As the adage goes, never mess with the people who make your food. This includes from a management perspective.",
            "Like a boss!",
            "Sounds like Red Robin based on my employment at Red Robin ~15 years ago. Probably broadly applicable to chain restaurants. I didn’t work in chains after that.",
            "This is the power workers don't use often enough.  I understand why you still get a thrill out of this!",
            "You there. Yes, the OP! You are what I call a legend.",
            "I can picture her now. Middle aged white woman with rock-hard, short, and curly hair that you know she put a lot of time into but it still doesn’t look good. More bump in the front than the back and multiple rings that look like they are trying to choke her fingers off. Huge hexagonal bifocals that are all lens with a pinkish hue at the corners. Makeup that is way to dramatic for anyone not doing a Ziggy Stardust cosplay. Yep. I’m pretty sure she was my boss at Blockbuster Video too...",
            "I’m so proud of all three of you. I hate idiots and their empty threats. I’ll bet she remembers you forever. I’m thrilled that you went back for a meal and a smirk. I can only imagine your satisfaction.",
            "What a great story. Write it down for posterity.",
            "Best damn story! Good for you guys for sticking to your guns",
            "Nice!",
            "That was a very enjoyable read, thank you.",
            "It’s a pity you lost the staring contest. I wonder what would have come of it if you won.",
            "Epic!  I wonder if they learned anything from the incident.",
            "Bravo dude",
            "This is so cool! I love that you guys left mid doing whatever, and they struggled because of it! So badass!",
            "Always call corporate on their stupid fucking bullshit. Corporate is nothing, they should be sucking all our dicks for the pleasure of managing us.",
            "I would revisit that memory often just to relive it. That is Champagne level Malicious Compliance.",
            "When you and your friends got employed at a nearby chain restaurant... did you mean Bennigan’s, or Flingers?",
            "Then notify corporate too of the multiple screw ups by management - or should I say manglement? Then add that they had to pay mucho dollars for managers from adjacent franchises to work at said restaurant.",
            "Some people are so fucked it hurts my brain",
            "Your a brave person eating that meal, very brave",
            "I can just _taste_ your collective triumph!",
            "That’s truly legendary. You all have gained my highest form of respect",
            "Please let the terribly managed chain be chik fil-a",
            "we are ultimately all PIN numbers  (personal identification numbers)",
            "This is not malicious compliance. This is simply refusing.\n\nAlso you NEVER have to sign a write up. Legally you cannot be made to sign anything you don't want to. There may be repercussions including termination. But you never have to sign anything. \n\nI refused once at a factory (luckily I was union) and my supervisor told me \"well you can refuse to sign but it'll still go into your file as a write up.\" \n\nI didn't sign. Because it was some BS. Someone who kissed the supervisor claimed I violated safety when I hadn't. She hated me and the supervisor was looking for a reason to write me up.",
            "In NJ p",
            "This is more petty revenge than MC.",
            "How did she react as you all were walking out?",
            "Lol there is nothing stupider than when managers get shitty towards high school aged minimum wage employees. These jobs are constantly hired just walking off the street and they are probably the least dependent on employment of anyone in the labor force. Most of the time they are just there for, effectively, beer and weed money",
            "Did you make sure to remind them to filter the fry grease when they close?",
            "Customer: ...and a large fry. \n\nCash register person: I'm afraid i no longer work here. I'm sure my old associates will take your order. *walks away*",
            "this is so nice to read. wish you the best",
            ".",
            "This is awesome. I wish I had friends to do some legendary shit like this.",
            "I would not have eaten anything they had prepared, especially if they knew it was for you guys.",
            "This fills me with glee.",
            "It has been my experience that there is no one more full of themselves and their little bit of power than a fast food supervisor.",
            "That’s amazing as someone who’s worked in the food service industry that’s always been a dream of mine lol.",
            "Man, I have an epic walk out story but it pales in comparison to this one. Damn.",
            "The power of collective bargaining.  Great job starting a union.",
            "So it’s illegal to have a minor work more than a certain # of hours, it’s more lenient when school isn’t in session, but I believe it’s minors can’t work past midnight regardless. Could have reported them to the department of labor too!",
            "Pretty sure you guys all ate some loogies that night...",
            "Making a kid work double shift is likely illegal."
        ]
    }
]