[
    {
        "post_id": "eebpdf",
        "author": "editproofreadfix",
        "title": "Two-Week Notices Not Accepted.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/eebpdf/twoweek_notices_not_accepted/",
        "score": 17891,
        "num_comments": 672,
        "created_utc": 1577055436.0,
        "selftext": "It's 1993, and my first day of work as a secretary for a high-powered attorney in my hometown. He brags that, when people give a two-week notice, he immediately takes their office key, has them clean out their desk, and hands them a final paycheck. \n\nAfter 8 months of working for him, I call in \"needing extra rest\" one morning (I was at a job interview), then go in at 1 p.m. and tell him \"I quit.\" He asks me to finish out the day's work, which I do. \n\nAt the end of the day, he comes to my desk and asks me to at least finish out the week, stating I put them in a hard spot for not giving a two-week notice. \n\nI remind him that on my first day of employment he told me he did not accept two-week notices and that is why I did not give a two-week notice. \n\nI received my final paycheck and walked out with a smile on my face!",
        "permalink": "/r/MaliciousCompliance/comments/eebpdf/twoweek_notices_not_accepted/",
        "comments": [
            "I had the opposite happen. I was made redundant as the business was failing and they couldn’t afford to keep me. It was a family owned business and being one of three non-family members working there, I knew it was coming. They had treated me very well and I asked if they wanted me to finish off the week, say goodbye to clients, finish or handover my tasks and shortcuts, etc. \n\nThe boss, normally a very stoic and unemotional man, teared up and said no employee had ever offered that before. I had seen a few storm out in the past myself. I only ended up needing to stay an extra day but I’ve always had glowing reviews and references from that business from everyone since. It was a nice way to finish working somewhere.\n\nEdit: My first ever silver AND gold awards! Thank you!",
            "I had an employer who was a complete dick. One guy was getting ready to go off to college and put in his two weeks. Right there on the work floor he said “I don’t need you, you may as well just leave now”. That employer lost a lot of respect points from me that day.",
            "My wife was the only one at her company who had her job title, she gave 60 day notice. They asked her to stay 120 and then gave her a bonus for staying the extra two months. We had to delay some plans, but it was well worth it. The next person to turn in her notice was told don’t think you’re getting an extra two months you’re gone today. The remaining workers started mailing out resumes that week.",
            "I was working support supervisor for a rinkydink WISP and had one under my wing that was performing pretty good.\n\nOne day he put in his two weeks due to him going off to college. OK, fine, the holiday weekend was coming up and I really needed him to cover for it was going to be a crazy one.\n\nI come in the next day, only to find out upper level mgmt cut his two weeks short and put him out the door that same day.  I hit the roof!  I dragged both bosses in on the deck and lit into them that we needed that tech to cover the weekend as scheduled. \n\nThey tried to make excuses, but they left that emergency meeting with black and blue ears. I was HOT because of that stupid decision! I was forced to pull doubles despite their best floundering for excuses, saying they would help cover phones. Har har.  I left two months later, they didn't last long after that.",
            "I have an old friend who runs a political consulting firm. When he has employees give their two weeks notice he... Pays them their unused vacation, their discretionary bonus for the year, as well as their accrued sick leave, even though he has no obligation to pay out the bonus or the sick leave. \n\nNo only does he have very little turnover, but good employees often return to him later.",
            "Playing the long game, I see",
            "My sister recently changed law firms because they treated her badly and pulled all kinds of unethical shenanigans. Well it turned out that instead of informing her clients that my sister had changed firms and giving them an opportunity to move with her they told everyone that she had died. My sister didn't realize this was what  had happened until she ran into one of her more familiar clients at the grocery store.",
            "I had a boss who had shit benefits. One of them was not moving holidays to the nearest friday or monday. We just lost it. I told them that means we lose 15% of our holidays. Did not care.\n\nWhen i turned in my 2 weeks notice, (after burning up all my sick time and holiday pay). So after getting back from vacation, i turned in my 2 weeks.\n\n\"its not a 2 week notice because there is a holiday on next monday\"\n\n\"you dont honor holidays on the weekend. I dont honor holidays during the week. So will you say i am eligible for rehire if they call for a reference?\"\n\nNo\n\nOh well i guess today is my last day since you have nothing to offer me. Cya.",
            "Gave my two weeks after 6 years at Target many years ago, the manager looked at me and said I don't want your two weeks just leave then wrote it like a termination so I couldn't use as a reference or be rehired there.",
            "I was once working for a IT firm that focused on Healthcare Providers. It was a good gig for the most part...... until they started making cuts, making bad judgement calls on policies, and demanding way more work out of us rather than hiring more people. They wanted me to do 8 hours a day(plus a one hour lunch) during normal business hours, and then do server updates after hours. The main reason they wanted me on that role is because “Updates are absolutely critical”. I was salary, so I asked if I work over 40 hours, can I get those excess hours comp’d to me as out of office time? They said sure. But what they didn’t tell me at first, is that they’d calculate the time after the end of the month. First month, I clocked in at average 65 hours a week because they wanted me to work the 8+maintenance hours. They didn’t give me any hours as comp time. \n\nI began to hate working there from the long hours and then ignoring my pleas for more support since I was the only guy doing updates at night for all of the client’s servers. It got to the point where I felt ostracized from the team as I was always tired and getting scrutinized for “under performing” and not closing out as many tickets as the rest of the team. Which in it own way sucked since my tickets were a product of automation and were never closed out by me, but by the system once the servers were verified as updated. The system was then against me and I couldn’t prove them wrong. I was put on a PIP. I tried to fight it by proving that the number of tickets that I close are actually greater than what the other team members are closing by counting the tickets that are automatically closed by the automation system, but they didn’t want to hear it and things got heated. I was verbally bashed by the manager for “half-ass’ing” and that was it. Breaking point reached. I found another job that was going to pay me more, put me in a role that I wanted to be in, and be on a team that I would personally manage and help make better. \n\nI put my two weeks notice in and they really showed their true colors. I sent a nice email to my team for being awesome and enjoying the time I had with them. After I sent the email I was pulled aside and said they didn’t need my position any longer since “it’s only updates”. Really put me on the spot since I wasn’t slated to start work for three weeks. \n\nFuck that place.",
            "My last job, they forced my boss to resign, fired my peer and everybody else switched to different departments. That's when I said fuck it and turned in my resignation. They begged me to stay on part time to help retrain a brand new staff who had never done the job before, so I agreed. It was amazing. I would show up whenever I wanted (or not show up) in sweatpants and a hoodie and answer all their frantic questions for as long as I felt like it. I hope they fucking learned their lesson, but probably not.",
            "I put in my 2 weeks notice at a minimum wage job to go to work for a job that paid about $2 more and was much closer. For the next 2 weeks, the manager called me things like \"Loser\" and \"traitor\" completely seriously. I stuck it out because I needed the money. On the last day, he offered me a 10 cent raise if I stayed. The new job, I ended up working at for 8 years.",
            "Funny, 1993 was the year that I packed my belongings and summarily walked out the door of a similar attorney after not having been paid for two months. So this resonates with me. Oh, btw, I collected those for two months after the hearing before the labor commissioner. Let’s clink glasses.",
            "I worked for a real estate agency as a property manager for a little under 6 months. One afternoon, the office manager lost her cool and shouted me down right in the middle of the office. It was very unprofessional and upsetting for me, especially as I wasn't the employee who caused the problem. I handed in my two weeks to the director that afternoon and she begged me to stay, said we were like a family, promised that the manager would be reprimanded etc. \n\nA month later I was called in to the directors office and fired on the spot for not \"fitting in with the company culture\". It was a Friday, I was told to clear my desk and hand back the key and not bother coming in on Monday. I figured out later that she'd been interviewing for my replacement since the incident with the manager, and had only begged me to stay so she wouldn't have to deal with the extra workload if I'd quit. I was 20 and naive and too trusting 😔",
            "Had a boss who did something similar. He never said it, but when everyone saw he was sending people home the same day they stopped putting in two week notices. We got a company memo about how it’s unprofessional not to put a 2 week notice and he stopped sending people home the same day. Least he figured it out. At least that one thing...",
            "[deleted]",
            "Employers these days think the leaving employees will do as much damage on the way out or that they won't actually do their job, so the just fire them.",
            "Have always done a 2 weeks.  Left 2 days before one ended, as they just wouldn't apparently accept I was leaving (they were talking about me taking on a new project, on a Wednesday.  I started a new job Monday...)\n\nSecond place I put in notice as I was stuck away from home, in a shit hotel for 17 weeks, on a project I wasn't allowed to make progress on (long story).  Got fed up, and was looking for new jobs.  Put in notice, they recalled me, had me work at the shop for 2 days, and I was home at 10:30a Thursday.  Not quite one week after notice.\n\nAll other jobs have accepted, and had me work out the notice.  A few tried to get me to stay, but most realized I was leaving for better.  (The place I ended my notice early for actually offered me my old job back a couple times since...)",
            "I absolutely love when at-will employment cuts the other way",
            "Worked at an independent auto repair shop. Was a weird hybrid of family and shop owner. I knew one of the guys from high school he got me the job. His father was the manager. After a while things got pretty shitty. The whole “ my dad is the boss” bullshit act was happening. This fuck was so lazy didn’t help with the ridiculous amount of cars coming in. And good ol daddy never scolded him but if we the other workers fucked up or we’re not being productive got a lecture. Long story short one of the mechanics who I became good friends with, after a whole string of bs just quit. And then after finalizing a new place of employment 1 week after him quitting I put in my two weeks. He wasn’t mad or anything but maybe surprised? Not even 24 hours had gone by and my boss sends me a text. A fucking text. Doesn’t even have the balls to call me. That said “we don’t need you to finish your two weeks I’ll let you know when your check is here.” Went in got my check moved my shit out and started working at a real shop.",
            "I see the malicious compliance. Was it that bad a work environment that it warranted that kind of response?",
            "One of my managers (restaurant) was notorious for doing the same. You would give him your two weeks notice and he would fire you on the spot or significantly cut your days on the schedule. I took it upon myself to tell every new employee to not give two weeks notice.\n\nWhen I quit I gave them one week’s notice, only because I had another job lined up, and because I respected the other two managers.",
            "Shit my last job I put my two weeks in and my boss didn’t talk to me for 10 days.",
            "I was working industrial IT. Pay wasn't great, but I was getting enough overtime to keep me happy.\n\nNew plant manager came in and he was very vocal about how overtime was reducing his personal bonus and eliminated OT across the board, no exceptions. I asked if they could do something to keep me happy - IT should have been coming out of a different cost center, but they sneered and told me I was out of luck, just deal with it.\n\nA month or so later I found a new job, coincidentally they asked for a volunteer to go TDY to another state for two weeks, which I happily accepted. Late in the day on the Friday before I was leaving for the TDY I said \"by the way, here's my two weeks, I'm not coming back\".\n\nA few days into the next week they called me up and said \"if we can get your OT back will you stay?\"\n\nNo.",
            "[deleted]",
            "Lol, this reminded me of a time I went to put in my two weeks notice with my first Job out of college. It was outbound sales calls and I was only there for like 6 months. But a buddy of mine offered me a job at the company he was at which paid more and was inbound sales. No Brainer to take it.\n\nSo I got to put in my two weeks and they basically say well thanks but we won't need you for the rest of the time, you can leave after lunch. I was fine with it as I could start with my buddies' place on Monday. This was on a Thursday, so that gave me Friday free. Figured I'd hit up the golf course. \n\nGet a call from place that just let me go asking if I could come in for a meeting as they had one for a campaign only I was running and knew anything about. I laughed and said sorry I'm on the golf course already. I felt bad for guy who called me as we became friends in short time I was there and I knew he must have hated to eat that shit and ask me to come in.",
            "Good. Giving two weeks notice is old school. Walk out and tell them that today was your last day. In case you're wondering: corporations don't give a shit about you.",
            "Man, I'm lucky with my boss. I'm currently in the middle of transitioning to a new job. Waiting on the background check to go through and then I'll start January 21st. I let my current boss know about what I'm planning after I received my offer letter a few weeks back. My boss works directly next to me on an eye to eye level and has been for the last couple years. I'm his main go to guy. He said he's upset because he's going to have to start over with someone new and he doubts anyone will take care and gain the knowledge base I currently have, but he's also really happy for me. He decided to wait until I get the background results back and wait until 2 weeks out of me leaving to inform his boss and that way when they get a new hire I can keep my hours as training hours to get the new guy on a good path. \n\nMy boss has always had my back against his boss and his bosses boss. So I had no issue talking to him about me possibly leaving the company. He made sure he was a reference so he can give a good review of my performance. \n\nI hate knowing people try to do the right thing by giving notice and their boss just fires them right there. I don't know if the boss puts it in the system as a fire or employee quit.",
            "I had something similar happen to me back in college:\n\nI was working IT for a data processing company. They handle database conversions for banks, hospitals, and even local and state governments. While trying to set up a server for them (not related to their processing), I discovered that it was gray market and the manufacturer wouldn't service it. Worse yet, it was probably black market, since it didn't actually have a serial number on the chassis or in BIOS.\n\nAfter I told the owner about that, I was quickly moved into a \"do nothing assignment.\" I found another job later that week, gave two weeks notice and they wrote me a check on the spot saying, \"here, now you don't have to wait two weeks.\"\n\nI'm hindsight, I probably should have gone to the authorities.",
            " Damn it feels good to be a gangsta",
            "I gave three weeks and a few days notice to my boss, along with assurance that I’d wrap up all outstanding projects before I left. I had been on good terms with my employer, but was moving to a competitor. \n\nA few days later, I was handed a check for my unearned wages and escorted out of the building within an hour. \n\nIt’s always left me wondering. I wasn’t in an executive position. I didn’t get to say goodbye to my coworkers, and leaving unfinished projects I’d worked on for so long was very unsatisfying.",
            "Two weeks notices are bullshit anyway. Employers never give employees a 2 weeks notice if a layoff of when they fire them. 2 weeks without an employee the business will manage, 2 weeks without a paycheck and an employee gets evicted.\n\nFuck capitalism.",
            "Ahhh...it’s 1993",
            "What an odd policy. I know at my work we’d love to have as much notice as possible, because the hiring process takes approximately a century.",
            "I’ve got about a month left at my current job.  My boss, who is a good friend, specifically told me not to give notice.  We’ve lost so many good employees in the last year as the company has turned to shit, that our management chain has figured out a simple solution.  If you give notice or any indication you’re looking elsewhere, they immediately write you up and suspend you.  That way they never lose a “good employee”.",
            "You out-lawyered a lawyer. Best revenge: Become a lawyer.",
            "Good. Giving two weeks notice is old school. Walk out and tell them that today was your last day. I'm case you're wondering: corporations don't give a shit about you.",
            "This is amazing!!!",
            "I used to work for a low voltage cabling job as a pseudo foreman (all the responsibility, none of the pay or title). Put in my two week notice at 7am via email (was on the road and couldn’t do it in person), by lunch at 11am I had a response that basically told me that I was fired.",
            "I've had folks at my current job give a month+ notice so they could train their replacement. Too bad management never hired anyone so all that extra work just gets dumped on existing employees. Thanks capitalism!",
            "I was put in a union as a waitress.  I was not wholly opposed at first, having learned about the struggles, the murders, the seemingly inherent tendency of many business to justify exploitation of workers for the ever increasing quest of profits, more profits...  however, this restaurant was family-owned, and the union steward was the sister of one of the owners. We were apparently entitled to free uniforms, never happened. That was my only union complaint, minor, to be sure.  To my knowledge, few claims were ever initiated. The other factor that perturbed me more was when I was told to 'take very good care of the people at table #5'. The assumption, for several reasons, was that the gentleman was 'connected'. I was insulted that the maitre d' felt he had to tell me to give someone extra consideration, since I gave every table my best. Additionally, my father being an FBI agent, I was not impressed by mob connections. You might think I showed the brazen ignorance of youth, though Mob actions had become much less overtly violent by the late '70's, and really, what could a waitress do to incense a mob retaliation? Take good care, my ass!",
            "I once put in my two week notice, got told to hand in my keys and they would pay me for the two weeks. They'd rather do that than risk an injury in the final two weeks, I guess.",
            "Best time i had quitting a job was when i left my last job for the one I have now. Last job was a city job that paid shit. Current job gave me an almost $9/hr raise. The day i started my new job, i finished my first run, went home, packed up all my uniforms in a garbage bag. Took them to my old job and asked the supervisor where he wanted me to put them.",
            "I’ll play devils advocate here a little. Employees on the way out will sometimes commit fraud. And so having them out of the office immediately can be a good way to prevent that.\n\nThat said, a lot of companies will still pay you for the last two weeks, even if they don’t make you work those weeks.",
            "８　ｍｏｎｔｈｓ？？\n\nimpressive memory",
            "Not likely to see them laugh",
            "Put in 2 weeks at my last job. They accepted my resignation, \"effective immediately\". lol",
            "To be fair, for a salaried position this sort of thing is perfectly fair, they pay the last two weeks and tell them to shoo to avoid any potential trust issues, contagious motivation problems, last day of work pranks or the like. A law firm seems like the sort of place that would be especially likely to have those problems, so the boss might have been talking about that.\n\nOn the other hand, for an hourly employee that's unacceptable.",
            "I walked into my shop on Monday and told my supervisor (who had no power over hiring) that I was leaning towards putting my two weeks in at the end of the week.  I knew that he himself had taken two half-days to go to interviews.  Tuesday, our boss comes in and asks Supervisor to watch the phone while Boss and I go up to HQ.  I was downsized (as were 28 others) and given a month's pay in severance- plus 6 months of unemployment.\n\n  Supervisor put his notice in on that Friday.",
            "You should post this in r/youarefired!",
            "Aa"
        ]
    },
    {
        "post_id": "lep0za",
        "author": "USPO-222",
        "title": "Don't piss off your farmer neighbor, you may have to pay for it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lep0za/dont_piss_off_your_farmer_neighbor_you_may_have/",
        "score": 17883,
        "num_comments": 1346,
        "created_utc": 1612713279.0,
        "selftext": "So this didn't happen to me, but an attorney that I work with regularly as part of my job.  He moved from a very high COL area to our rural community.  Sold his $2,000,000 house, paid off and inherited from his grandparents, and bought 50+ acres with a huge house in a bedroom community that has a lot of dairy farms.  He always used to say how it was much better living up here, both in terms of the lifestyle and monetarily, as his urban $2,000,000 house had property taxes in excess of $40,000 / year.\n\nNow, in addition to the huge house, the property was mostly fields, 40ish acres, and had a 10-acre or so large woodlot.  After he moved into his new house, the attorney was approached by his neighbor, one of the area dairy farmers.  The farmer told the attorney how he had a handshake agreement with the former owner of the attorney's home/property.  The farmer would mow the fields for hay 2-3 times per year and would harvest a sustainable amount of trees out of the woodlot.  In exchange, the former property owner got 10% of the chopped wood, which was more than enough to heat the house all year long without having to run the oil boiler for anything more than hot water.\n\nThe farmer wanted to keep this arrangement going, as it had worked out well for both parties for over a decade.  The attorney thought the former owner was being taken advantage of and refused to do a handshake agreement, but told the farmer to give him a week to draw up a proper contract.  The farmer was not overjoyed with making this out to be more than a gentlemen's agreement, but agreed to come back the following week.  The attorney decided that what would be \"fair\" was that the farmer should pay him $1,000 each time he mowed the fields for hay, since the farmer would feed the hay to his cows for \"free\" otherwise (completely ignoring that the farmer was using his own equipment and time to do the haying) and that the lawyer deserved 50% of the chopped wood, not 10%, or at least the 50% of the revenue the farmer got from selling the excess chopped wood (again ignoring the equipment and time investment of the farmer).  As you can guess, the farmer refused.\n\nThis all happened in late 2019, when the fields were rather bare and the supply of chopped wood for the house was full.  Well here comes 2020 and now the fields start looking like garbage, because none of the other farmers will pay to hay the fields.  In fact, after speaking with the first farmer, all of the other area farmers are unwilling to mow the fields unless the attorney pays **them** $1,000 per mowing.  And, of course, come wintertime the attorney's woodpile is depleted and he has to use the oil boiler to heat his entire home, costing well over $300 / month in winter heating costs.\n\nNow we come to early 2021, tax prep season.  The farmer, being a good a dutiful community minded citizen, informs the town that he did not cultivate any of the attorney's land for the entirety of 2020, nor did he know of any other farmers who did.  Well, as it turns out this is a big deal, because in our state farmland is assessed at a much lower value than residential property and additionally has a seperate and lower tax rate.  The attorney's land had previously been entirely zoned as farmland, except for the house and a few acres of lawn around it.  Now, the town sent out an assessor and rezoned the entire 50+ acres as residential, which more than tripled the taxable property value and imposed the residential tax rate rather than the much lower farm tax rate.  The attorney was quite surprised and furiously told me, and everyone else we work with, all this past  week how he's going to sue the town because they now expect him to pay $50,000 / year in property taxes.\n\n\n\ntl;dr - City attorney buys huge farm estate in rural community.  Refuses to work with farmer neighbor who used to maintain the property.  Property now looks like shit, attorney has extra bills, and the entire estate got rezoned costing the attorney $50,000 / year in property taxes.",
        "permalink": "/r/MaliciousCompliance/comments/lep0za/dont_piss_off_your_farmer_neighbor_you_may_have/",
        "comments": [
            "Not quite the same but my friends have been on the same farm for 200+years. Some city folk came to the grandfather and said how much they liked the country life. Would he sell them some land for 4 houses. He did. The next spring they took him to court because his dairy farm smelled. They lost. The following winter the barn collapsed. Spring they built a new barn. Right next to the 4 new houses. It was closer to the road after all.",
            "What kind of idiot turns down free maintenance of his property and no-labor restocking of his wood pile??? Did he plan to mow all 50 acres himself? Unless he has a way to harvest, bale, and sell the grass it’s yard waste he’d have to deal with.",
            "We own a house with 20+ acres of farmland on the Eastern Shore of Virginia. We rarely use the house, but a local farmer farms the land.\nHe is supposed to pay us a rental fee for being allowed to use our land. \n\nIn twenty years, we have never collected any money from him. Why? Because he watches the house for us. He would probably pay us and watch the house, because he’s a nice, honest man. But we don’t need the money, so we don’t collect. Why spoil a good thing?",
            "Grew up on a hog farm.  Luckily, wasn't much inflow from the cities yet, so no real issues with \"new neighbors\"\n\nWhat is always fun (at least in my state) is fencing laws.  Getting a neighbor to pay up for their half of the fence on the property line usually ends up in court.  Even more fun when the neighbor is \"The Railroad\".  \n\n\nMy dad is currently suing his neighbor for cattle rustling.  Dad's cattle went through fence to neighbors land, and he went over to neighbors to receive his cattle and pay for any damages incurred.  Neighbor kept giving him the run around (\"Not right now\") for a few months and then we find out he sold them right before Christmas.  Says he contacted my dad but nobody was ever home (which was a lie because my mom was going through chemo) so he sold them.  Didn't go well in mediation so now it's going to court.",
            "This could become a very costly move for our attorney friend here.  Not sure where this is, but in Texas, it takes 5 years of agricultural production to get a property recognized as agricultural property.",
            "[deleted]",
            "I started to grin as soon as you got to the tax part and I realized where this was going. A knowledge of tax law from the start would have well served this attorney.",
            "I live in a city that has a cardboard recycling factory. It used to be in an industrial zone. Now they have built shopping and condos all around it. \n\nCardboard recycling often involves lots of wet paper and steam.\n\nIt also smells like someone vomited in a sewer and then boiled it.\n\nPeople complain and I always ask them if they didn’t notice the factory when they were viewing their shiny new condo a few blocks away spewing steam hundreds of metres into the air.",
            "You can’t just walk into a community and expect them to adjust to you. When you join a new community it’s you that must adjust to them. Especially in more traditionalist communities like rural farming areas.",
            "What is the attorney going the sue the town for - that he is a poor attorney that failed to do his homework for his house and property so he got screwed in the end?  If the laws and tax rates were in place before he moved there, they are applying them fairly as they should.  The area farmers should raise the $1000 price and wood percentages for mowing now - just to irritate him.",
            "Yeah, He should have continued the handshake deal for a year while he got oriented and figured out the economics.\n\nwhen I moved to the Midwest, one day I noticed some spanish dudes mowing my backyard. I came out to ask them what's up and they said \"We mowed this yard for the previous owner and figured you would want to continue the deal\". I asked how much, they quoted me the typical 'per mow' and i said \"Okay\" and went in got some cash. Oftentimes I would come home find the yard mowed and an invoice sitting in the mail box.  I would send a check and I never had to do lawn stuff.",
            "Another case of \"penny wise, pound foolish.\"  Good on the farmers!",
            "God I swear I know exactly which property and neighborhood this is. It isn't in Georgetown TX is it? My BFF sold a property EXACTLY like what you're describing the lawyer's place! Sold it for a STUPID amount of money and fucked off to 100 acres in the mountains with tons of leftover money in the bank.",
            "Lol what \"yeah I basically do a shitload of work for essentially free, you cool with that?\"\n\n\"The *nerve!* The *audacity!* *You* should pay *me* to do all that maintenance of my property!\"\n\nHaha buddy got what he deserved",
            "A modern day parable! Great read. Thanks for sharing",
            "Shake a hand, do as the Romans do for a couple of years, to understand Rome.\n\nOr, immediately serve as your own attorney, zero research a bonus, because you're so much smarter than *country bumpkins*.",
            "I mean I could see that trouble from a mile away. Some guy wants to mow my lawn and take care of my forest free of charge? Deal good day sir how about we get some drinks.",
            "Yep, pretty much anywhere, farmed acreage is taxed at a lot lower rate than if that 100 acres turns into your back yard instead.",
            ">all of the other area farmers are unwilling to mow the fields unless the attorney pays them $1,000 per mowing\n\nMy parents have a 40 acre lot themselves. As with the guy in your story, most of the property is zoned as agricultural, save for a relatively small area around the house and the house itself.\n\nMy parents pay to have someone come cut the grass and bale it for cow feed. So do several of their neighbors. I was _very_ surprised to see the lawyer demand\n\n> the farmer should pay him $1,000 each time he mowed the fields for hay\n\nI don't know how much my parents pay for the hay cutting, but they _do_ pay, rather than get paid. It's not really all that different from paying a kid to mow the lawn at your 1/4 acre suburban house.",
            "As a person who owns a few measly acres of land I'd be overjoyed if someone wanted to cut it all for me for free...and cut up my fallen deadwood. \n\nFucking overjoyed. \n\nCause mowing acres of any. fucking. thing. is a huge pain in the ass.",
            "My wife worked for a landscape engineer with a rule regarding clients:\n\nNO FUCKING LAWYERS",
            "Interesting...\n\nI moved to a little farming town (pop >300) met a few locals, had a beer or two, joined the local volunteer fire/first responder unit, helped where I could but mostly we keep to ourselves\n\nNice place, quiet, no dramas\n\nAbout the same time another couple moved in not far away to a wee hobby farm and got kinda hostile to the \"nosey bastards\" (small town, new people are interesting for a little while)\n\nThey have had the same problems as us or anyone else when in a new area, yet we had advice and assistance?\n\nDon't shit in your nest.",
            "If you drive through Orange County in southern California, you would occasionally see between the upscale businesses small fields of strawberries. I knew strawberries were sold locally as fresh fruit, but I could not fathom how they made anywhere near what the cost of the property was.\n\nWell, a friend in the business said that if it is farmland, it has a much lower property tax (John Bon Jovi farms most of his property in New Jersey because of this). The owners of these lots are just holding on to them until they become valuable enough to sell for homes and business development, to the tune of millions of dollars. \n\nIn the meantime, the tiny profits from the starwberries pay the property tax owed every year.",
            "Typical hay rate is 2/3-3/4 of the hay to the leasee. Farmer was getting a steal but 60 bucks an acre is a little steep.",
            "That lawyer shouldn't have rocked the boat, at least not until he had left things as they were for a year and done some research. Sure, maybe he could have found a better deal, but he didn't know all of the details involved yet. It's also quite possible that the farmer didn't have the kind of cashflow that would have allowed him to accept such a counter-offer, since he wasn't necessarily selling the firewood (probably using some and bartering the rest). Oh well, live and learn.",
            "In law school one thing my negotiations prof told us was that civility, professionalism, and negotiation in good faith usually costs little to nothing. Kindness is always free. Making enemies for no reason doesn't pay.",
            "I've lived most of ny life next to poultry farm<cages>. For decades, there as my family's business and those farm in the neighbourhood, alas, as civilization crawled closer, so did new neighbours. And so, a really fancy house arose on the other side of the road, with owner being very smug about getting that plot of land very cheaply and oh how prime estate it was.\nCrucial point, he moved in in winter.\nCome spring, the already forseable scenario happened. We, our neighbours were sued for the smell, noise and animal cruelty. Again, forseable outcome ensued, our new fancy friend moved two hamlets over into new, posh, extremely expensive suburb.\nRiiight next to and encircled from three sides by about 120 hectares of corn field.\nRiiight as summer was ending.",
            "When a degree doesn’t equal common sense...",
            "The absolute worst farm animal to live next to is hogs/pigs.  Especially if your living next to an industrial type production of them.  Ghastly smell.  If you move to farm land, you need to check who farms what and in what heading from your house for a several mile radius.  Pig farm to the west, oh hell no.",
            "We call them cityits. Idiots from the city that think that living in the rural areas has the same rules as city life.",
            "That dude screwed himself even worse than he realizes because in a lot of jurisdictions land has to used agriculturally for a number of years before it can be deemed agricultural land and taxed as such. In the instance that I had to deal with it, it was 5 years and it was a big deal because my parents were scrambling to find someone to harvest the wood before the year was out because if not the land would resort back to residential land and be tax accordingly for a minimum of 5 years.",
            "Enormous farmland cut up and made into mini ranch properties. People buy forty acre tracts literally adjacent (common fence line) with a 75 year old, working rock and gravel pit. They complain to the county about the blasting, the noise of the machines and the truck traffic in and out of the rock yard. Of course, to no avail. Edit: How anyone could buy land next door to a 150 acres (or so) of gravel pit, with blasting signs on the gates and then complain about it, is beyond my comprehension. Especially since there were literally thousands of acres of land to be bought in a five mile area around it. I live about 1.5 miles away and it has never bothered me once.",
            "By making a complete ass of himself by thinking he’s smarter than everyone else, pretty much nobody is willing to work with him. I can only imagine what is said behind his back at the local coffee shop at 5am.",
            "Otoh, depending on the area, the re-zoning to residential may now make this attractive land for developers. With the lawyer making a killing on re-selling the land. Furthermore, that development made lead to further rezoning and issues and injunctions where the new housing development residents want an end to the dairy farming. \n\nSo this whole thing may continue to escalate.",
            "That's so dumb. I'd consider it a huge value to not have to personally maintain a few acres of a large property lol",
            "For an attorney he does not have the smarts.",
            "doesn't zoning farmland into residential one multiplies the land price by tenfold?",
            "And this is why a college education isn't worth jack if you lack some common sense. I'd have jumped at not having to take care of all that land and cheap heating.",
            "Lawyer's a fuckin' idiot *but*\n\nThat's a raw deal that the neighbor offered him. All the hay and 90% of the firewood? Nobody who knows anything about rural living would take that deal. When you're doing shares on stuff like that, the negotiation starts at 50/50",
            "Beautiful, succinct, and shoves it to a lawyer",
            "I would let the farmer have the hay for free, though I’d question the wood situation. What does he determine is sustainable, and what is he doing with his 90% of the wood?",
            "Your lawyer friend should be happy. Rezoned he can sub-divide and sell to a real estate developer. He'd make a fortune on tract housing. Of course he wouldn't be out in the countryside anymore.",
            "Get some chickens. File as a Free-range egg farm. Sell some eggs. Boom. Back to agricultural.",
            "After reading the title I was pleasantly surprised that this didn't turn out to be another pig farm revenge story",
            "Sounds about right. My mom has a home almost exactly like what was described here and she makes sure to stay reasonably well liked in the area. \n\nIf your neighbors like you, they'll look out for you. One neighbour had a wild fire threaten their home. And the fire department wasn't going to be much use, as there were massive wildfires elsewhere. My mom organized a troop of people with water trucks and sprayed down their home, saving it.",
            "Lesson, dont be greedy.",
            "Same thing in Nebraska. Much less acreage (6) but as long as you keep mowing the 5 acres of grass and bailing it for feed those are critical to keep the tax bill down.",
            "THE FARMERS UNIONIZED",
            "My Mama always said \n\n\"Be careful, because the toes you step on today might be connected to the ass you have to kiss tomorrow.\"",
            "Why would anyone buy a farm (with that much area) without the intent to maintain/ mow the said farm...In my opinion , getting a token money for the hay might seem fair but the deal with 50% wood was BS",
            "Does that mean the 50 acres was already zoned residential but took advantage of tax relief? Or does the law require all agricultural land to be cultivated every year?",
            "You forgot the twist where the town assessor is the original farmer's brother-in-law. That's how things work in my small town. And the company who delivers heating oil is owned by the farmer's best buddy from high school and starts charging an extra surcharge because the oil fill pipe is more than 75 ft from the driveway.\n\nIf you think you can waltz into a small town and start calling the shots, you're gonna have a bad time.",
            "What’s a bedroom community?",
            "The farmer was ripping him off. A common deal is 50/50 for the cutter & owner. If the owner doesn't want it the cutter buys for going rates. 40 acres of hay could produce 20,000 worth of hay. \n  Enough to heat a house us roughly 3 cords of wood.\nAbout 600 dollars. Ten times that is 6,000 dollars.\n   If the fancy pants lawyer or whatever didn't know about property taxes, he is just dumb. But the farmer for sure was ripping him off also. \n\nIf he was doing it for 10 years, he got a quarter million dollars worth of materials for labor.",
            "COL = Cost of Living",
            "Lmao.\n\nPls keep us updated.",
            "that's the longest lawyer joke I have had the pleasure to read.",
            "Hahaha. Due diligence, bitch.",
            "\"Now having heard that, would it change the story at all if I told you ... that the farmer was a rapist?\" - Norm McDonald",
            "TLDR: No farming done = not farming land.",
            "Around here you pay the operator for their time AND they take a portion of the hay. I hope idiot lawyer has to pay lots more money over the years because of his arrogance.",
            "Easy way to keep agriculture status for taxes is get a couple bee hives. Extremely easy maintenance and all but 1 acre remains in AG status vs. residential. The wood being taken was absolutely not fair to the new owner. Hire an arborist from out of county to do it for you once every 5 years. Depending on what they’re being hired to do many will work out of state. Let them keep a couple good trees as payment. Now I don’t know what kind of timber was on the property but a single good black walnut tree can fetch upwards of $10,000. As far as leasing the land out to be farmed, farmers are generally very greedy. Offer a lease low enough and someone will come do it. If they really couldn’t find someone he must have really been a pompous prick. Easy solution regardless is to back burn the fields every 3 years. Prairie grass will grow back like weeds after a good burn.",
            "I love this. The farmer was asking to continue a mutually beneficial agreement and the attorney gets screwed. Yep. This is how the world needs to work.",
            "In NC they build houses near the airport a and then people complain about noise. One developer built a subdivision next to a motocross track. Within a year the neighborhood was suing the racetrack for excessive noise. It's like the track was hiding when they were house shopping",
            "Yup saw where this one was going a mile away.  So many people around my hometown have similar arrangements.  Hay and lumber harvest are some if the best ways to have ‘farmland’ tax exemptions.",
            "I find this to be a weird story. The attorney would not care one fuk about a $300 heating bill and also the $50k  tax will be reduced because he knows how to play the system. Worst case scenario the attorney will find a way to write off the $50k expense and bury it within his $900k+ income.",
            "It takes a lot more effort than that, and usually a huge fuck load of money to get 50 acres zoned from agricultural to residential. \n\nTypically the property's neighbors have to agree to the re-zoning. 50 acres means a perimeter about a mile - which even in rural areas is a lot of fucking neighbors. Additionally having a year where the land isn't used for agricultural doesn't remotely grant a city cause to rezone the land. Fields are left fallow all the time.\n\nSo anyway after it gets zoned residential our antagonist attorney can easily get it sliced up into lots, and sell it for 10x what he paid for it per acre - Especially if its serviced by City power, and water - which from the story, it sounds like it is.",
            "Although changing 50 acres of land to residential land could be significantly increasing it’s value as now it can be subdivided and turned into a large housing development. Developers will work for YEARS to get a large chunk of farmland re-zoned as residential.",
            "My family has a small hay farm. From what I read here that farmer was taking advantage of the previous owner and what the new owner asked for at least as far as the hay goes was not unreasonable whatsoever.  Just because it’s grass doesn’t mean it doesn’t have value.",
            "This sounds like racketeering and corruption.  Never mind the “gentleman’s agreement.”  \n\nNew owner refuses to continue previous owner’s agreement.  In retaliation, other farmers band together to extort new owner and enlist local government to help.",
            "It sounds like that guy should have hired an attorney that understood property taxes.",
            "TL DR: Don't fuck with farmers.",
            "Nobody would cut and split firewood and give over 50% to the landowner. 10% is even high. \n\nA standing tree has almost zero value in firewood, the cost of firewood is almost 100% labor cost",
            "Play dumb games. Win shitty prizes.",
            "That was good to read. Capitalist pig had it coming",
            "some people HAVE to win in every interaction with others....no matter what it costs them....hope he liked his \"winning\".",
            "This shit sounds made up. No lawyer selling a $2M house is just gonna ignore and lose property tax exemptions that keep their new property cheap. Fucking poor and uneducated rural people fight for them tooth and nail. As if someone with experience is gonna just herderr their way through that blunder?",
            "  Mmm",
            "\"I am altering the deal. Pray I don't alter it further.\"",
            "Wholesome:)",
            "try living near a paper mill.",
            "This is basically the plot of Green Acres.",
            "Point accepted.",
            "At first I thought this might be a story from Green Acres.",
            "I cannot print my opinion of most attorneys here due to my consideration of the attorneys who are actually still real people.",
            "But now that the land is zoned residential, couldn't the lawyer just decide to sell the land to a promoter? Which would suck for the surrounding farms...",
            "did he end up suing the whole town??",
            "City folk!",
            "Or he could sell it as residential and take the kids but make a huge profit. ESH",
            "Problem was not that the attorney wanted it as a contract in writing, but the problem was he got greedy and drafted the contract so it went his way every time it could.\n\nLesson 1: Contracts need to be fair. \n\nLesson 2: What is fair may change with curcumstance.",
            "not quite the stardew valley farming experience i was expecting when i walked in, but was left pleasantly surprised",
            "omfg this is the BEST MC story that i’ve read in a minute"
        ]
    },
    {
        "post_id": "ylp872",
        "author": "the_anecdotist135",
        "title": "Boss says I should quit because I like spending time on 'Hobbies' so I did.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ylp872/boss_says_i_should_quit_because_i_like_spending/",
        "score": 17857,
        "num_comments": 462,
        "created_utc": 1667537568.0,
        "selftext": "I was working for a startup engineering firm working as a Piping Design engineer. But since it was a start up firm, we didn't have a lot of man power and the ones we had weren't as qualified either. I was one of the very few qualified enough to handle a team of my own. The boss trusted me with almost everything. I was like the second in command after the boss only because I was managing a lot of things on the side as a volunteery basis. Things like paycheck balancing, client meetings, quality assurance, documentation, and other stuff which he should had hired someone else to do. I was good at it and he took full advantage of it by giving me things to do that never was under my job description.\n\nOne day he had this bright idea that we should revamp our website to attract more clients. And he gave this project to his nephew who just graduated from college as a developer of sorts. After a week or so the nephew came up with the first draft of the website and the boss was fairly disappointed as it didn't look anywhere near to what he expected. He then called me in and asked me if I knew anything about website design.\n\nAt that time I was very much interested on UI/UX and was doing an online course to learn about it more. So I told him that I'll see what I can do.\n\nI spent the next week full making a proper information architure, wireframes and colour guidelines that the nephew could pick up and build the website from scratch. In the end the website looked futuristic and the boss was pretty happy.\n\nBut during the week my other 'responsibilities' were put in a backlog and it just kept piling on. I knew I would be able to cover it once am done with the website and didn't pay too much attention to it.\n\nThe next week my boss caught up with backlog and called me in to his cabin. He started yelling at me for all the 'responsibilities' that I didn't attend to. I calmly told him that I was working on the website and its not a big deal. Told him that I would clear it out as soon as possible. But he wasn't happy. He asked me why I spent so much time doing something that isn't even my responsibility. I told him that I was learning about UI/UX and was pretty much interested to learn more. ( I obviously never thought about perusing it as a career because frankly I was a mechanical engineer by qualification and didn't think jumping to IT would be easy)\n\nThe boss snapped and told me that I should quit and peraue my 'hobby' as a living. He said that only then I will understand how lucky I am to have a job that pays.\n\nI kind of got offended because 1. He doesn't even pay me the worth of things i do for the company and 2. He knew I could cover and yet took this as a opportunity to 'discipline' me.\n\nI stepped out of this cabin, went to my desk and put in my resignation and went home.\nHe called me a couple of times asked me to revoke my resignation and then made other people from the organization call me to convince me to come back. I wasnt having it at all.\n\nIt's been 2 years now, I decided to persue UI/UX as a career now and am working as a product designer in one of the biggest organisations in the country with a pay that's almost 300% more than what I was getting as a mechanical engineer.\n\nUpdate 1: To all the people who wanted to know the company status today, the company was shut down because they had to pay a huge penalty for not being able to deliver the last project I was handling. Then covid hit and they had to reduce pay for all the other staff which lead to people leaving. Eventually the company went bankrupt for not being able to keep up financially after covid. \n\nUpdate 2: for all the people who want to know the steps I persued to have a career in UI/UX, I did the online certification course from googIe and spent a lot of time solving whiteboard challenges preparing myself to be a problem solver. Then I got the opportunity to intern for a service based agency for a few months where I dedicated my time to learn as much as possible and then when I though I was ready, I applied to all the openings I found on LinkedIn and other job portals until I finally landed a job with this tech unicorn startup. While I was working as an intern I also invested in a Bootcamp certificate course from an organization called designboat in India and also some certificate course from Interaction design Foundation. \n\nHope I was helpful, but if you still need to talk, hit me up on chat I will surely help you.",
        "permalink": "/r/MaliciousCompliance/comments/ylp872/boss_says_i_should_quit_because_i_like_spending/",
        "comments": [
            "I see no logic in the boss thinking process and action",
            "When you have an employee that does way more than they were hired to because why pay someone else to do it when you can get an employee to do the extra work for no extra pay, you don’t challenge them to quit.",
            "\"Hey Op, can you do this for me?\"\n\n\n\"Sure this even relates to a hobby of mine!\"\n\n\n\"OP, your other work is slipping because of that thing i asked you to do! Maybe you shouldn't be spending so much time on hobbies!\"\n\n\nLike how many times did his parents drop him as a baby...",
            "Thank you all for a great response. To all the people asking about the company's whereabouts : the last project I was working on had to be pulled back and the organization had to pay a huge penalty for not being able to deliver as promised. Which wasn't enough because then covid hit and they to reduce pay for all the employees which then lead to all the staff leaving gradually. They company went bankrupt last year due to not being able to keep up financially during covid",
            "I hope you emailed him a thank you letter.\n\n“Hey man, I really want to thank you for your advice to quit and spend time on my hobbies.  I am now make triple the pay you were giving me, and 1/3 the work you piled on me with no regard of my job description, or even if I was being paid fairly for doing the work of five people!”",
            "Funny how things like that work out. Kudos to you for not being bullied and sticking to your guns.\n\nIn 2009 I was fired from a job for laughing at the owner of a 50M / year company because he told me I was lucky to have a job at his company. Just a few years later I was making 120% more with another company that was happy to have my skill set.",
            "sounds like a win to me - well, for OP\n\nold boss... not so much",
            "A guy I worked with always said, “The worst thing I ever did for my career was learn how to do anything.”",
            "Very nice!!\n\nI also recently took my Manager's advice. She had called us (a group of Technical Writers) back to the office recently. We ran all sorts of stats that showed we had been more efficient at home and presented them to our Supervisor. Our Supervisor had us present the info to our Manager during a meeting. Our Manager said if we didn't like it, we should find a position that better suits our life.\n\nI applied for another job during the meeting, interviewed, and got an offer (I was the second most senior writer on the team). We had a team meeting yesterday and I announced I was leaving. My Supervisor asked why and I said \"Our Manager was very clear about our options, so I took her advice.\"",
            "Beatings will continue until staff moral improves.",
            "I love these:\n\n1. Get mad and give \"discipline\" with \"tips\" of career choices.\n2. Get dumbfounded that the worker does just that.\n3. Unprofit from not getting profit, because that worker was the main person of important stuff.",
            "Know your worth.",
            "'The boss snapped and told me that I should quit and peraue my 'hobby' as a living. He said that only then I will understand how lucky I am to have a job that pays.'  \n\n\nElectrical engineer for well over a decade here...  \n\n\nYou DO NOT piss off the talent.  Ever.  They have options and will walk.",
            "My boss told me I’d been over paid since the day I walked in. Told me to step up or find a different job. I resigned and found another job. He messaged for months afterwards asking for my help. Ironic, the over paid employee was the only one that could help him. He can kiss my a$$. \n\nGood for you. They dig their own holes.",
            "\"You aren't supposed to react that way to abuse! Get back here and take more!\"\n\n\\- Far too many bosses",
            "Glad to hear that you knew you worth and for choosing to chase your dreams! Way to go!",
            "I was a manager of a mom and pop store that grew into a state wide franchise - I was a similar right hand man of the owner, doing a little bit of everything and vastly underpaid. I was changing from an unlimited mileage lease to a fairly low one and asked him to talk about my coverage of all store locations - wanting to stick to 2 or 3 on site, to limit the thousands of miles I put on my car (for no extra comp) for the business. \n\nHis words, once I explained my lease changing, were “That doesn’t sound like my problem. You figure it out.”\n\nI put in my resignation by the end of the month. I sure as hell figured it out.",
            "Your boss played a stupid game and won a stupid prize. Congratulations on your new job.",
            "Revoke your resignation? uh huh......",
            "You deleted all the UX design stuff you made for him before you left, right?",
            "If he wanted you back so badly, he might have offered you a raise and a promotion perhaps.",
            "> The boss snapped and told me that I should quit and peraue my 'hobby' as a living. He said that only then I will understand how lucky I am to have a job that pays.\n\nOhhh, I've had wayyyyyyyyy too many bosses say similar things to me over the years. Just keep adding things to the pile of what I'm responsible for at my job, then lose their minds because I can't do it all at once.\n\nSo many bosses are convinced that deep down no matter what an employee *says* they've got them by the balls. The employee obviously needs the money from working the job, so *no matter what* will always come back the next day and keep working. So they can just abuse the heck out of the employee, and nothing will go wrong, it's perfect!\n\nWait. **You can't quit!**\n\nI *loathe* this kind of boss, I've run into them too many times.",
            "I love this! I had a similar kick in the ass that caused me to leave a career and get into IT (and now make several times my previous pay also :p) \n\nWorked in a hospital - supervisor job opened up. Of all the applicants, they only interviewed me (been there ~2 years) and one other person who'd been there nearly 20 years. They gave it to her, but then she was so bad at it that she needed an assistant. Interviewed me and one other person - ended up giving it to the person who was leaving for grad school a few months later. \n\nJoke is on them - the department disintegrated a few years after I left. All the grunts stayed but all the higher-ups that messed up by stringing me along got booted. :) (also joke is on me because I would have been miserable stuck in that field long-term)",
            "Good for you. Bosses need to learn to respect, and properly compensate, their golden geese. You catch more flies with honey than vinegar. Sour bastard.",
            "classic",
            "It's funny. \n\nEverywhere a group of friends and I have worked at, particularly with small companies and startups, mechanical engineers leave feeling undervalued and overworked and the company scrambles to try to keep them on... making me rethink my career choice. \n\nFunny part is a big part of my position is handling our device performance data and I'm learning python for it, might try to make the same jump you did.",
            "Wow, your ex-boss really set himself up for failure did he?",
            "See..\n\nHes was a fool. And he gave you the motivation without knowing it.\n\nI had work piled on by my boss and when i said it was too much i was told the job wasnt for me. After being told this 3 times over a few weeks. I quit for a job with the same pay and fewer hours. Then a year later ended up at another job paying 25% more. \n\nI did stay in contact after that with coworkers who said once i left things fell apart. Once i got my current job i heard the dept was so short staffed it had to be closed. I dont think it was my leaving but the rapid succession of people leaving and them not having the staff to keep up.",
            "I still remember my first mechanical engineering job out of college was at an MEP (mechanical, electrical, plumbing) design firm where a director once told me he was so glad his family understood that work was the number 1 most important thing in life. I also had a bunch of coworkers ask when I would quit djing so I could focus on being an engineer. \n\nIt’s been a decade since they let me go when they started to downsize the firm (I’ve been told it led to almost 50% of the staff being cut), and now not only have I continued to dj and grow a side hustle from it, I’ve also learned that it’s better to be at an MEP engineer within an architecture firm, as they seem to have way more diverse people in terms of interests, hobbies, and a better work like balance mindset. Loving my job now and it’s awesome to be able to point out all the buildings where I’ve worked on things.\n\nGlad to see you were able to thrive after that experience as well!",
            "I did similar recently. Was working a job with insane hours (often 8am-10pm or later). I mentioned how I really do not like working nights, he told me, the *only* employee that would go above and beyond and work those hours “if you want a 9-5 job then find one”. So I did, day later, when I handed in my notice.",
            "Cause he wants to control you he thinks he owns you , newsflash he doesn't. Someone else is always willing to pay you for work without the disrespect. His loss not yours",
            "Moral of the story:  Don't do stuff you aren't being paid to do.  Just do the job you were hired for.  If they want an engineer to also do payroll, the engineer needs to be paid the salary of a payroll clerk.",
            ">I obviously never thought about perusing it as a career because frankly I was a mechanical engineer by qualification and didn't think jumping to IT would be easy\n\nThe pre-requisites for working in programming or IT are the abilities to think analytically, and the ability to learn new things. The majority of what I learned in university is already outdated, and the most useful skills I have are ones I learned on the job.",
            "When you give people options, don't get mad when they take you up on them",
            "Welcome to the good side fellow UXer. 🤓",
            "Op, I dare you to copy the link to this post and send it to him.",
            "I want to know what happened to the company...",
            "So the boss was right in the end...",
            "The worst kind of leaders are the ones that think things are getting done because of them and not because of their workers. The best leaders are the ones who know their workers are the important ones and do everything in their power to reward/acknowledge good work and empower their workers to better themselves. The best leaders are ones that genuinely care. Unfortunately we have a societal system the rewards those that take credit for their workers' work (**see richest man in the world**).",
            "I bet the boss tells that story like he did you a favor.",
            "To me it seems like it's a classic case of the boss chewing out not the person he \\*should\\*, but the person he \\*can\\*. Firing his nephew sounds like it might have opened a can of worms — you, meanwhile, were obviously able to handle a lot of things (including the nephew's job) without complaint, so why not this? I've heard it referred to as \"kicking the dog\" — and it's great that you stopped being the dog!",
            "Does your former boss know how successful you are at your hobby now?",
            "Would love to know the company you joined.  Any hints?",
            "I love when petty bosses think you won't call their bluff. It backfires and they look like surprised Pikachu.",
            "He fucked around, and found out 🤣🙆🏾‍♂️🤣",
            "Nice!\n\nI was a drummer for a bunch of years, even as a degreed professional.  I started going back to school for software development, and got a job in tech support.  I made more in my first year in IT than I did in all of my professional career as a drummer.\n\nI have NOT looked back.",
            "Hell yeah.",
            "Good for you. Now send that jerk a short \"thank you\" note and tell him the good news.",
            "He's a narcaccist, he has to use you and colleagues to prop his self esteem and ego up to cover his incompetence, guarantee he knows nothing about what and how you do your job",
            "I think I would be petty enough to send a thank you card to the former boss every year of my day of resignation.",
            "Yay! You successfully escaped!",
            "I wonder how long that company survived after that debacle.",
            "OP should send a thank you card to old boss every Christmas.",
            "Good for you, hats off",
            "Slightly related: a friend got a PhD in Mechanical Engineering but couldn't find a decent job. Went back and got a DDS so he could make some money.",
            "you working on the website made it to where the boss couldn’t coast off of your hard work anymore. When he finally noticed he wasn’t happy his life on easy street was starting to pickup again.",
            "So when he called you, did he apologize? Did he acknowledge the stupidity of what he said?",
            "Ugh another piping guy, lol. I have mad respect of pipe designers, as a structural guy I hate doing pipe. Making my things fit pipe designs makes my job very interesting sometimes.",
            "Oh my God are you ME?! I loved reading this, I totally could see myself in your shoes.\n\nUX/UI is such a such a rewarding career when *you're good at it*\n\nI too landed a unicorn position at a company and was learning UI/UX as a side hobby, learning as much as I can online, getting certificates for those online courses. Then I slipped into the UX role and now I'm making full blown income just working 3 days a week. The fact that you paired so many speciality niches into your one discipline is incredibly desirable. Good job. I don't see much about UX/UI talk on reddit, so this was cool to see.",
            "Nothing better than sticking to your principles and respect yourself.",
            "In my 20+ years of experience as an embedded systems engineer doing both HW and FW, almost no business person has any knowledge of their business or their own products.",
            "That’s great that you did that! But what the heck is UI/UX?? TIA",
            "Congratulations 🎉🎊 I guess your boss didn’t realize that you were doing other duties that were NOT a part of your job before reprimanding you. \n\nI am happy you maliciously complied and got rewarded handsomely for it. \n\nSorry for the people that lost their jobs.",
            "/chef kiss",
            "I used to be an analytical method development r&d chemist. Always regretted not pursuing mechanical engineering as my hobbies are very much diy machining and fabrication. Had a site I was building for a nonprofiti volunteered for using it as an opportunity to self learn coding. Its now my full time gig. Kind of crazy how different the past scales are, huh? Also like that challenges are daily thing rather than doing a couple new products a year.",
            "Protip: when a company suggests you quit, don't.\n\nWait to get fired. Stop working. Stare off into space. Just blame \"bad management\" over and over again why you can't seem to open a email. \n\nHell, find another job, and work there and wait for the old job to fire you. And if they don't and still pay you, looks like you're still coming on top.",
            "Why were you doing all this free work/not in your job description in the first place?",
            "Hot take here... I don't think the boss was in the wrong for addressing the backlog of work. \n\nHe addressed it wrong; by being combative and slightly egotistical. If your work was failing because of an added workload requested by him, he's at fault for that.\n\nIn many lines of work, any work added would fall under the lines of \"Extra Responsibilities\" not a Responsibilities Switch persay. \n\nUltimately, he handled it poorly, but you handled it exceptionally. \n\nAlso, good on you for finding a more enjoyable career!",
            "Read it as spending time on ‘Hobbes’ instead of Hobbies. Couldn’t figure out the post, in the first read.",
            "At \"peruse\" I thought you used the wrong word. Peraue I thought was a typo. But by the time you spelled it incorrectly the third time and the third different way, I'm confident that the word doesn't exist in your vocabulary.",
            "> perusing ... peraue ... persue \n\n**Pursue**.\n\nJust gonna help you out there with the alley-oop, cuz you're fumbling around worse than 15-year-old me trying to unfasten a girl's bra.",
            "Piss on his grave",
            "Did you nuke the website on your way out?",
            "I am heavily considering taking a course in UX/UI...all of the signs seem to point towards it",
            "What a great make believe tale",
            "Please put the updates AFTER the story, not before it. The vast majority of your readers weren't the early ones.",
            "You shouldnt have told him you were spending so much time on it because you were interested in learning more about it.  That honestly does make it somewhat look like youre shirking your work to do something else.   Im sure if you spent time going back between the website and your actual assigned projects that he wouldnt have reacted that way.   \n\n\nEveryones upvoting you, but do they even realize you stopped doing your actual work and instead just focused on the sideproject while everything else fell behind?   Thats not good work-time management, you shirked your responsibilities for a week and then got called out for it. \n\n\nGood on you for getting a job in that field you were learning and ended up liking, but its still messed up that you just straight up ignored your actual work responsibilities for a week instead of going between them and the side project.",
            "1.  Stepped out of his cabin \n2. Pay me the worth of things \n\nBot posting. Please downvote",
            "Title of this does not match the story imo",
            "Plot twist, your boss actually loved your work on the website so much that he knew you would succeed if you pushed ahead on your passion, so forced your hand.",
            "I aggressively fist pumped reading that last sentence.",
            ">”volunteery basis”\n\nI can’t. That’s painful.",
            "Take a pick AutoPIPE or Caesar",
            "Good for you made him eat his words",
            "Fuck yeah dude!!!! ✊🏼❤️",
            "👍 can't be mad at that",
            "five stars!!",
            "He should be glad you're just learning new skills and you're not a U.S. agent with a non-official cover *pretending* to be a piping engineer in order to prevent Iran from having nuclear weapons.",
            "If the \"aight imma head out\" spongebob meme had a back story",
            "One of my acquaintances got a degree in Biology and is now a software programmer.",
            ">Lucky to have a job that pays\n\nLol! If you're a mechanical engineer with any worth you'll spend maybe 2 months between jobs but only because it takes a little bit to negotiate your $75,000 to $150,000 wage at your next job and you don't want to take the first thing that comes along.",
            "Hello ! I am interested in UI/UX too, what would you advise as online course to learn more about it ? Thanks in avance !",
            "Just what even is UI/UX?? Computer stuff?",
            "Beautiful",
            "Bleh, I know I'm not getting 300% if I leave...",
            "￼",
            "That additional responsibility is called… \nQuite Promotions",
            "Beautiful.\n\n(It frustrates me to see \"pursue\" spelt differently three times, none of them correct.)",
            "Im also a mechanical  engineer, can i dm you for some mentoring?",
            "The boss has a cabin?",
            "Dam lol, I remember leaving my systems control job winning a public bid. I said hey we won a 300k bid...oh and here is my 2 weeks  I was actually returning to IT....long story short he still calls me to handle their IT as he don't trust anyone else like he does with me.",
            "👍🏼🙏🏼",
            "How'd you conquer, THE CODING INTERVIEW???",
            "Pursue. Pursuing.",
            "> pursue\n\nFTFY",
            "Good Job! I just started a server on hobbies! [https://www.reddit.com/r/potatopowered/](https://www.reddit.com/r/potatopowered/)",
            "Great story could of used more of the boss trying to get you back because that's the stuff that just makes me feel better about the world.",
            "This reads like Tolstoy writing a LinkedIn post"
        ]
    },
    {
        "post_id": "16ocrgl",
        "author": "irritatingfarquar",
        "title": "So you are claiming I defrauded the company by booking an extra 3 minutes, No problem",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/16ocrgl/so_you_are_claiming_i_defrauded_the_company_by/",
        "score": 17831,
        "num_comments": 607,
        "created_utc": 1695293690.0,
        "selftext": "I worked for a water company for 25 years and was one of their most productive repair crews, that is until The new manager Let's call him Mr Numbnuts started.\n\nWe had a monthly rota where you are on call for one week in 4, for emergency repairs out of hours.\n\nOn the day in question I started work at 7.30 am on a Friday and finished work at at 3.15 am Saturday morning, so a pretty long arsed shift.\nI get to work Tuesday morning and get called into the office by Mr Numbnuts and informed that according to my vehicle tracker I'd left the yard at 3.12 am and not 3.15 am, which is an attempt to defraud the company, As you can imagine I was absolutely fuming at this level of bullshit, I told him that at the time I was covered in mud and sweat and just wanted to get home after completing a monster shift for the company and was he genuinely making a shit storm over 3 minutes.\n He said he was making me aware that I could be fired for it.\n\nCue malicious compliance.\n\nI said that if we're going to be this petty you can take me off the emergency contact list for extra coverage and I won't be starting 20 minutes early each day either, I'll now be clocking in at exactly 7.30 am and I shall be heading out at exactly 5.30 pm, no deviation whatsoever and you can explain to your bosses why productivity is down and you are struggling to get coverage for emergencies. We'll then see how important your 3 minutes are when they are costing the company money.\n\nLittle did I realise at the time but the guys job was bonus related and linked to our productivity, which tanked after that because all the other gangs followed my lead, except the brown nose gangs obviously.\nThree weeks go by with an absolute shit show in customer service complaints about their work not being carried out in a timely manner \nMy productivity dropped from 7 jobs per day down to 4.\n\nAnd Mr Numbnuts gets called in by his bosses to try and explain wtf is going on, \nHe tried to spin some bs story that I'd turned all the guys against him for no reason and that this was the result.\n\nLittle did he know that I'd actually trained his boss when he first started with the company 15 years before and wanted to come out and find out what we do and experience how hard the job is, he surprised me by working a full month on the repair crews before going back to the office.\n Anyhow the boss calls me in to find out what is really going on, so I explained how he'd used the tracker to monitor what time I'd left the yard and that I'd guesstimated my finish time and over estimated by 3 minutes because I was absolutely knackered after working a shift from hell on-call .\nConclusion, manager was let go for misuse of the tracking system, as it's only supposed to be used for emergencies and not monitoring and we had our on-call system reviewed to cut the hours we were having to work.\n\nEdit apologies for it being so long arsed\n\nEdit 2 NO apologies for format or spelling and grammar, that's just me.\n\n This isn't an English exam it's the freaking internet, get a grip.\n\nHoly shit, this blew up quickly.",
        "permalink": "/r/MaliciousCompliance/comments/16ocrgl/so_you_are_claiming_i_defrauded_the_company_by/",
        "comments": [
            "When will new managers learn not to screw with veteran employees? Probably never.",
            "I like that. \n\nHis bosses actually sound like the kind of people that you want to run a company. How many times have we heard that \"if only my boss knew what was actually going on here\"? His bosses actually did, and gave you the respect that you deserved.",
            "Good on you OP, We are paid based on a 1/4 hour system.   So essentially 6:53 am - 7:07 am = 7:00am.    Had a boss like yours that was trying to hold people \"accountable\".   \n\nSuddenly:\n\n\n- people that showed up a few mins early waited until EXACTLY 7:00am to start working,\n\n\n-people would leave EXACTLY at quitting time, no matter if their work was done or not.\n\n-people that would give a couple mins at the end of shift waited until the next 1/4 hour to punch out to ensure they were paid for all time \"worked\"\n\n-breaks were taken EXACTLY per the contract\n\nProductivity way down and costs way up...",
            "Calling him Mr Numbnuts is too kind.",
            "That power move turned into an out-of-power move for your boss.",
            "I have to admit - you do not often hear about bosses KNOWING what the work is for having actually done that themselves.\n\nYou got a good one there..",
            "Play stupid games, win stupid prizes.",
            "Good stuff, this is the kind of story I read this sub for.  I hope your next boss is more reasonable",
            "[removed]",
            "> NO apologies for format or spelling and grammar, that's just me.\n\n> This isn't an English exam it's the freaking internet, get a grip.\n\nThis was my favorite part of this post! haha You seem like a good guy, a hard worker, and this was a great story!",
            "This is incredible. The guy actually lost his job. Normally stories like this. The guy gets promoted for doing something so stupid and assholery.",
            "An old place I worked for came at us all hard for clocking in 2-3 minutes late. They even switched to (and spent a lot of money on, I'm sure) a new time keeping company where everyone had to call in on a landline phone to clock in/out. We only had 2 phones for an entire crew of 48 employees,  so there'd be these long lines to clock in, causing people's time to post later than their actual arrival. They became so strict about these few late minutes that they began handing out write ups left and right (mind you, all over less than 5 minute differences.  They let it be known: \"Just because you stay late doesn't mean you can come in a little late..,etc.\" So we all started sticking to our clock in/out times to the letter. Clocking in and out exactly on time, and if you were last in line and missed the exact 60-second window to clock in, you went home for the day! You received more of a punishment for clocking in late than going home and calling out sick or whatever ( you only got written up after 3 absences in a row). So we basically took turns \"taking off,\" and most of us were only working 2 - 3 days a week! The icing on the cake was that we were all repeatedly staying late - off the clock - to get stuff we really needed done before our next shift. So they also ended up missing out on free work, and duties started piling up! Several people were let go after \"excessive absences\" after using up all their sick/personal days, but prior to that, hardly anyone ever took a day off. We had a really demanding job and knew if we didn't show up, someone else would have to pull our weight. However, once we all collectively decided to stick ot to them, we didn't mind the staff shortage thing. We were having so much fun watching the whole system crumble. After about 6 months of no one working and massive amounts of work not getting done, they caved and went back to the old honor system.  It's funny, I think most workers go above and beyond for their employers,  but they're so shady themselves that they always think others are trying to screw them, and instead, they end up screwing themselves.",
            "I LOVE when idiot manager try to fuck up skilled workers...",
            "Working to contract is so underated by employees. Great work in knowing your value.",
            "Side note: voluntarily working with the repair crews for a full month to get the full experience is a marker of good leadership. Glad that you experienced working with someone that has that quality. Wish more managers and executives had that mindset.",
            "When a company cares about 3 minutes you know its a company that needs the reality check. They really need to stop hiring MBA's. Actually having an MBA should be a great indicator to not hire someone.\n\nAlso I love knowing when someone is from the UK because they spell out arse and say rota. (two things I adore)",
            "They micro-manage because they have zero idea what they are doing or how to do it. Possibly falls into the Dunning–Kruger effect category with a bit of over-inflated ego.",
            "And a priceless upvote, not for the story, although it was fine, but for the last two sentences!",
            "Are people really complaining about your writing? Fuck em. You have better grammar and sentence structure than most post I've read in this fucking app. \n\nAt the very least, you use commas, paragraphs, and punctuation in general.",
            "My experience as a manager suggests that any manager who wants to micromanage time down to that level is majorly pissing off time himself and thinks that everyone else is doing likewise.  You did the company a major good thing by highlighting what a jerk he was.",
            "\\> This isn't an English exam it's the freaking internet, get a grip.\n\n&#x200B;\n\nLovin the entire vibe",
            "If the truck pulled in at 3:12, that would mean you just jump out and go straight home?\n\nWhat if you had to clean the truck? Go to the office to drop something off? All work related… \n\nI can’t imagine being that petty as a manager",
            "You had a manager that came and did the job he was in charge of running to learn how it *actually* functioned? And did it for an entire month? What alternate reality do you live in because that doesn't happen where I live. The closest we get to that is if our manager got promoted from our ranks into running the job.",
            "[deleted]",
            "I shall endeavor to use knackered somehow in the next staff meeting.",
            "I think it says a lot for the upper management to work in the field for a month.",
            "> manager was let go for misuse of the tracking system, as it's only supposed to be used for emergencies and not monitoring \n\nokay, *that* was pleasantly unexpected! like, i imagined he would be fired due to the drop in productivity, but not that the company would have an actual policy against that sort of monitoring.",
            "Great stuff.",
            "The real story here imo is how his boss’s boss is actually a good boss who tries to understand what the crew does and actually checks with the other employees instead of taking bullshit from his direct underling as gospel.",
            "snow upbeat bells narrow smoggy offend adjoining sable tan melodic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "\"This isn't an English exam it's the freaking internet, get a grip.\"\n\nI think I fell in love with you for a quick minute.",
            ">Edit 2 NO apologies for format or spelling and grammar, that's just me.  \n>  \n>This isn't an English exam it's the freaking internet, get a grip.\n\nIs this a repost, with all the edits? No one has commented anything to that effect, and your post is only 7 minutes old!??",
            "Really like edit nr. 2",
            "That's a good one.  \n\nI love how work hours are flexible in only one direction.",
            "you get my like just for Edit #2",
            "Most payrolls pay in 10 or 15 min blocks. Where I work if you work any part of that 15 mins, it's considered the whole 15 mins. So in your case, having worked  12 minutes out of 15, you would get 15 minutes",
            "Don’t apologize for the length. I loved your story! (And, I’m a tech writer with degrees in English and Communications and understood every word you wrote).",
            "Oy ten hour shifts. F that.  Absolutely awesome story, loved how u trained his boss lol",
            "Sounds like Numbnuts was a new manager trying to \"establish dominance\" the worst way possible",
            "love that the manager had actually worked in the field\n\nmy first non-car sales job, I had to work in the plant for a month, and then work on the truck making deliveries\n\nabsolutely helped me answer just about any question, gave me an edge over competitors\n\nsome of my favorite people started \"in the trenches\"",
            "Good managers manage people.  Bad managers manage the clock. I read that here on reddit a long time ago and it has held pretty true in my experience.",
            "I once got a warning for being 1 minute late 3 times in a 6 week period. “Late is late” they said (the time I start is absolutely meaningless, nothing is waiting on me), so now every time I wake up late or think I’ll be 1-2 minutes late I just chill at home for a while and come in 15 or 30 minutes late since there is no difference",
            "Got flown out of an oil field 2 months early due to contract conflicts.  I asked to stay one week to wrap up some loose ends. Nope, fly out in one hour….ooookay!  I still get paid out but whatever.\n\nSix months later I see a trouble sheet come up for the project I was on.  Still not complete, not in production and serious regulation fines are now imminent due to on site company workers not completing task.  I was asked to fuck my life up to go help.  Sure, 12 months pay for (remember 2 months from before??) 6 weeks on site.  Got there, all the monitor equipment was still boxed up sitting in a dusty corner when the environmental inspector had shown up.  From what I could gather the loss per day was about $250,000 Cad. We weren’t expensive until we were.\n\nI realized the money is a drop in the bucket to a big oil company but that contract set the company I was working for in good financial straights for a couple years",
            "For too long, too many in the trades have been abused by managers who have no fucking clue what the objective on-the-ground reality is with their crews. Glad to see one of them getting a comeuppance richly deserved, but sorry you had to go through so much bullshit first.",
            "You had me at “Mr Numbnuts”",
            "A 3 minute discrepancy for a 45-hour shift.  Just assuming that it's fraud, then making threats. \n\nAn astounding level of nastiness.  The problem is, he'll keep jumping around as an \"experienced manager.\"",
            ">Edit 2 NO apologies for format or spelling and grammar, that's just me.\n\n> This isn't an English exam it's the freaking internet, get a grip.\n\nAs an aside, As someone who uses shorthand a lot and grammars in odd ways at times, i entirely love everythin said here",
            ">This isn't an English exam it's the freaking internet, get a grip.\n\n👍",
            "I can top that story.  I worked IT for a company with wall clocks centrally controlled in facilities.  Facilities could adjust all the clocks back and forward.  I had noticed my watch and computer were accurate and not the clocks.  An executive dragged me on the carpet to make all the PCs match the wall clocks.  The compliance, I set up a time server on a domain controller and automaticly update everyday.    The one PC I could not setup to the time server was facilities.  All the PCs except facilities would then update upon login from the domain controller.  Now what facilities was doing, in the morning before most employees arrived, the clocks were turn forward and before most quiting times, turn the clocks back.  The company wanted extra minutes in the morning and extra minutes working in the afternoon.  Now I did show the PCs time as deadly accurate and the clocks were being tampered with.  I was so loud being dragged on the carpet again, the entire business and HR heard me.  Now HR knew what was coming, the labor board, and back pay.  Now the executive who chewed me out was also above facilities and I had him dead to right.  Write Ups for the year for late or leaving early had to be reversed, pay raises not given do attendance required retro active pay.  Now me, I was not on the clock, just had to put in my 8 hours 5 days a week.  Later, the wall clocks were replaced with battery operated clocks, they say for power savings, but facilities had to manually adjust the clocks for daylight savings twice a week.  Justice and the American Way.",
            "> Edit apologies for it being so long arsed\n\nYou call this long-arsed? This was barely a bite to ~~eat~~ read. Anyone tries to take you to task for this being long art, they're a fucking wanker and should be told as such, because they're as useless as Numbnuts was.\n\nGood on BigBoss.",
            "Some people know the cost of everything and the value of nothing",
            "Fucking love this!! As a middle manager, I used to run interference for idiots in the C suite for bullshit like this.",
            "Sorry people criticized your grammar etc. I didn’t have any trouble reading the story in spite of whatever minor mistakes might have been in it that I’ve already long since forgotten.\n\nGlad to hear you have decent bosses. It don’t get no better than that when you work a difficult job like yours.",
            "He will always tell the story about how some worker turned everyone against him, but I imagine the people in his life already know he's an a-hole and likely the cause of the problems.",
            "One of my best bosses  I only seen once or twice a month. He said if everything is going good why would he change any thing.",
            "Good job. Work slowdowns are one of the most powerful tools that workers have against bosses, whether they're unionized or not. This dummy manager managed to get the shaft by workers who weren't even disgruntled before he opened his big mouth.",
            "Do those 3 minutes even matter? In my experience working hourly, it's broken down into quarter hours, and any clocking in or out rounds to the nearest quarter hour anyway.",
            "Mad respect for your boss's boss working a whole month in the field just to learn it.",
            "Your boss boss is dope. I work service industry. We get so many gung ho morons with their management degrees ready to “fix” things that never had to eat the shit to work up. The difference of managers that have done the job and the ones that are managers because of a degree is wild.",
            "> working a full month on the repair crews before going back to the office\n\nwow!",
            "I was 29 years in to my retail career just months to go to hitting 30 years and getting some shitty bonus when I was lumbered with a brand new manager to the company, four months in to listening to his new manager bull shit (which I’d heard so many times before) I left him my notice on his desk whilst I had my day off. My phone blew up first thing in the morning was I fuck answering that. Got out of retail and never looked back.",
            "That is how it is done. Good job. \nIt is also huge that your coworkers joined you. \n\nGood will goes both ways. \n\nManagers turn favors into expectations then try to gaslight employees into believing it is their job to do the extra work since they were doing it before the disagreement. \n\nThis nonsense goes out the window when managers don’t expect the shitty employees to do the same amount of work. \n\nSo when the good employee is on that shift it’s busy and they are accountable if the work doesn’t get done but the shitty employee can hide for the entire shift and no questions are asked. \n\nCompanies that need production rely on goodwill and morale. \n\nManagers can’t talk the work into getting done.",
            "I had a manager who told me not to make any decisions without him. Then he went on vacation for a week. I did exactly what I was told. People came into my office many times a day and I told them to go talk to my boss. After he got back, I continued to do nothing. He actually told me things were going much better a few weeks later. I quit.",
            "This is what I'm currently doing at my job. I am a salaried employee, I don't get OT or flex time or any additional time of for putting in more than my 8 hours. I typically work 10+ hours a day. \nBoss calls me in tells me I'm no longer the supervisor of my dpt, that my former subordinate (his wife) and I are now co-workers and equals. \n\nI no longer work a second past my stop time, I don't answer calls in the evenings or weekends and I don't use my personal devices for work purposes. It's pissing everyone off but I don't care.",
            "You had me at \"...let's call him Mr. Numbnuts...\"! Priceless. 😂",
            ">This isn't an English exam it's the freaking internet. \n\nWelcome to the internet, where every day is an English exam. You get a test. And you get a test. You too, you get a test!",
            "Change is a 4 letter word. Real leaders adapt",
            "I'm not even sure you defrauded by 15 mins. Most pay tracking systems do 15 minute intervals so if you work 1 minutes into the 15 min period you charge for that.\nSo if I clock out at 2:16 then it's the same as clocking out at 2:30.",
            "Great MC on a twat. \nWe aren’t talking about South Staffs are we by any chance?",
            "Great story but this is the bit that gets my vote:  'This isn't an English exam it's the freaking internet, get a grip.'",
            "THAT is a good boss. :) \n\nHappy for you.",
            "Your story was awesome, but edit 2 was amazing. Lol \n\nYour great personality shines through your storytelling.",
            "currently have a new hire in management trying to worm her way into making everyone change up their roles and positions for her comfort, and since im in a different budget/department, i just get to laugh while she burns her bridges behind her. shes gonna get to the other side of the moat and find a nice pink slip waiting for her if i had to bet haha",
            "Someone gave up a good laugh for my one upper story.",
            "This is magnificent!! Chefs kiss",
            "How the fuck do you get into a manager position and not learn the rule: \"don't make enemies\"?",
            "What’s funny is that most of the places I work have a a clock in system that works on a timer that will kick you to that 3:15 mark if you clock out at 3:12 just to make it easier on payroll to do your payroll. Most clock in systems do this as far as I’m aware",
            "There's an alternate reality of malicious compliance where people sit in their truck for an extra 5 minutes so that they would be getting paid to sit but it's fine because now the tracker is accurate.",
            "My time sheet only lets us input 15 min blocks.",
            "This is an English exam. 10/10. Also I’m not an English teacher so what the fuck do I know.",
            "Slack Time is important.",
            "That was a good one. Thanks for posting. God’s justice was done lol.",
            "Wow, what a rollercoaster of a story! Your malicious compliance definitely had some unintended consequences.",
            "I'm guessing a little karma was involved as well.",
            "Mr. Numbnuts 😂😂😂",
            "When I started my job in the management development program and got my new team, the first thing I said to them was this: I am not here to micro-manage and make changes. I am new to the industry but not new to leadership. There will be a lot of learning curves for all of us. I can promise if I don't know the answer, we will learn it together. Period. I gained so much respect from them because I was true to my word.",
            "This blew up cuz it was so refreshing seeing this! True Malicious Compliance with consequences for the villain\n\nLately these subs have been “idk what happened to then after that” or “so i did something they wont know is me” or even better “so i paid for their shipping and handling but i added more to it to make it more expensive… they said they would reimburse me”\n\nAwesome post!",
            ">Edit apologies for it being so long arsed\n\nNo apologies needed. You tell the story well, and anyone that wants to complain about the length because they can't be arsed to read something well written can go kiss their own arses.",
            "People just eat up with their own authority can be absolute morons.  The only people that approach these idiots are accountants when they get put in charge of operations.  I say this as an accountant - we should NEVER be in charge of operations.  Why?  Because we get tunnel-vision on the books and make stupid decisions and policies based solely on the books and not how it affects people and operations in other non-financial ways.  Stupid to save a buck and blow your productivity all to hell.",
            ">This isn't an English exam it's the freaking internet, get a grip.\n\nThis is Reddit.  I'm not sure we're allowed to get a grip.\n\nGreat story, by the way.",
            "No apologies needed for grammar f em",
            "As a grammar snob I really appreciate your disclaimer. You do you, I’ll do me.",
            "Am I wrong that companies have to pay you in increments of 15m anyway?\n\nSo 3:12 clock out means they have to pay you for 3:15 anyway?",
            "Good ending! 👏",
            "I’m so glad this went well for you!!!! I feel a swell of pride.",
            "This was not a long post . Good for you !!",
            ">  by working a full month on the repair crews \n\nDamn, that's some serious dedication. I could see a day, maybe a week from someone who was really into learning the ropes, but a full month of not doing the job they were hired to, I've never heard of anything like that before.",
            "Fuck I love this! All credit to you brother!",
            "Beautiful. Karma is a bitch, Numbnuts!",
            "That must have felt so fucking satisfying :)",
            "Did the big boss also tell you to call him next time instead of this?",
            "Manager have any words for you on the way out? His salty attitude would’ve been delicious!",
            "Sometimes you gotta let things fail for management to see",
            "Wow fantastic",
            "More often than not, for me anyway, a person this petty about expenses and documentation and whom makes a huge deal over these types of issues is usually stealing from the company. \n\nAt best you should have been asked to be more careful...",
            "Looks like it was fair and never worried about spelling or the like\n\ntend to do timesheets to every 15 mins and round up or down, so not worried if I finish work at 17:21 as will call it 17:15 and some days I might start late as have gotten to the van and the tummy rumbles suggest another session in the bathroom.  \nIn a similar but different field, some of the guys work all day and are on call once a month and so get a night call out someplace nowhere near home after heading home only to be asked to turn around and do a tangent....",
            "Wow. Good ownership? In this economy? Good for you OP!",
            "I bet it took you longer than 3 minutes to clean all the mud and shit off of you.",
            "This was not too long. Great story without the unneeded BS. Good Job",
            "That right there is exactly how a manager who understands how the job operates and actually has the back of his senior staff. Super rare in this world.",
            "Good! Love it. And screw those brown nosed gangs!",
            "What a legend. Well done good sir!!!",
            "I mean, if I’m bugging out over three minutes from an employee, it’s not because of the three minutes…",
            "Classic \"Work-to-Rule\"",
            "It depends on a few different factors, but in some situations you're actually supposed to round to the nearest 5/10/15 min, so it's entirely plausible that even if you overguesstimated, you did nothing legally wrong.",
            "How to fire yourself 101. This should be taught in school..",
            "Bloody marvelous, mate.",
            "is your name Aiden?  are you from Londonderry?\n\nif not, i know a guy with your exact same story.",
            "This isn’t an English exam, love it",
            "Long-arsed?! Couldn't be long enough! Thanks for sharing!",
            "Honestly don’t care about the story (which is good).  But loved Edit 2.",
            "I love meeting another Brit in the wild here on Reddit. \n\nAlso, I adore tales of 3 minutes devolving into a P45. \n\nTop bloke",
            "Sorry, what's a \"brown nose gang\" ? Ass lickers ?",
            ">This isn't an English exam it's the freaking internet, get a grip.\n\n5 points off for not using perchance.\n\nPerchance.",
            "I am honored that so many people on this subreddit are in the top echelon of their jobs. I dont think ive ever seen a post where OP goes \"I work as X and im absolutely horrible at it, here is a story about how i applied malicious compliance\".",
            "OP you should know Upworthy.com has picked up this story. You might get some more inquiries. (Good for you on this MC)",
            "MALICIOUS COMPlANCETALITY!!!",
            "What does a bad manager and a silent-e have in common? They can make you go from \"quit?\" to \"quite\" in no time\nAlso turn that grip you had into a gripe.",
            "[deleted]",
            ">it's the freaking internet\n\nWhich means there are always going to be people whingeing about grammar for funsies. Incorporate this knowledge and deal with it, instead of pouting like a teenager. You don't prove how little you care about something by letting it affect you.",
            ">This isn't an English exam it's the freaking internet, get a grip.\n\nPeople with this mindset are the problem. Everyone's so fucking stupid these days. \"Ah doesn't matter if it's not academic or professional, I can just write and speak like shit\".",
            "Strange how all the stories start with “I was their best worker”.",
            "I read this and now I have cancer.",
            "So what happened? What was the fallout? We love these stories for the payoff, did he get written up, yelled at... fired? Good story, needs a proper ending letting us know the consequences."
        ]
    },
    {
        "post_id": "ncm1co",
        "author": "ProfileElectronic",
        "title": "Manager tries to make life difficult for me, doesn't know as per my contract it benefits me.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ncm1co/manager_tries_to_make_life_difficult_for_me/",
        "score": 17816,
        "num_comments": 421,
        "created_utc": 1621035513.0,
        "selftext": "This happened a couple of years ago. I was working on a part time basis in a small firm owned by friends. Pay was not very good, but the atmosphere was and I was allowed to set my own timings. So life was good overall.\n\nThen a friend whom I knew only through social media approached me for a job in her company. Even though they were offering good money I turned down the offer as I knew I could not get the benefits I was getting in my current job. Plus the commute to the new office was very long. I would have to travel 2 hrs one way and change 3 trains just to reach office.\n\nA month later the HR of the new firm approached me again. They offered me almost four times the money I was making and I could set my own work hours. There was also extra pay for working overtime and on weekends. This was important. I joined the new company.\n\nMy friend did not know the terms of the new agreement I had with HR. She used to act like I owed her big time for the opportunity I got. So one day I corrected her. I told her that I had turned down the offer she had been part of and one month later I had had my own negotiations and I got much more favorable terms. So I was here because her company really needed me and not because of her.\n\nI didn't share the details of my agreement with her, but we both realized that she was making significantly lesser than me. This totally changed her attitude towards me.\n\nNow she wanted me out and I was determined to stick through for at least a year. So she decided that she would make it very difficult for me to work so that I quit on my own.\n\nThere are a lot of stories I have about how she tried every trick in the book to make me quit. I'm sharing some of them here.\n\nShe was my manager and was in charge of allocating work.\n\n**Malicious Compliance - 1**\n\nShe started piling on more work on me than any other member of the team. I was happy to comply - she did not know that as part of my contract I would be paid 1.5 times the hourly rate for every hour I worked OT and 2 times the hourly rate if any work was allocated to me over weekends or holidays.\n\nEvery time she tried to ruin my weekend by calling me to office unnecessarily, I happily complied. This continued till the time I left the organization and told her how much extra money she had helped me make.\n\n**Malicious Compliance - 2**\n\nAfter the long commute to work, I used to be hungry so I developed the habit of stopping at the food court to pick up a glass of fresh fruit  juice and carry it with me to work.\n\nMy manager thought that this way she could harass me without actually seeming to do so. So she sent a notice that bringing liquids to office was a hazard.\n\nIronically she used to have coffee delivered to get desk 3 times a day. Well, I pointed out that the rule applied to her as well and if I couldn't have my juice, she couldn't have her coffee. She had to literally spend an extra unpaid hour at work every time she wanted her special coffee.\n\nMeanwhile I was happy to leisurely sit in the food court - have my glass of fresh fruit juice with some snacks and then begin my work day half hour later than usual.\n\n**Edit -1**\n\nWhoa!! This blew up and how. I didn't expect that this post would receive so much response. These two were the least of the incidents of my work life with this woman.There are a lot of comments and messages about this post and while I would love to answer all of them individually, since they more or less relate to the same subject I'll add the clarifications here below.\n\n1. A common question people have posted is why my manager did not know my **pay structure**. I work in India and here salary structure is kept strictly confidential. It can be grounds for firing to reveal or ask for someone's salary. Basically the way the system works is that every new hire negotiates their salary on the basis of last drawn pay, experience and qualifications. It is very common for two people working on same level to have vastly different pay structures.\n2. **Overtime:** Usually people in Management level do not get overtime. I had a 7 year gap in my career and when I started working again I chose to work in a different field, so even though I was drawing a high salary I didn't belong to the Management level. My manager was not aware of it. When she assigned e work she assumed I would be working without pay.\n3. **I owed her.** NO. No organization hires anyone on the basis of recommendation. They hire people on the basis of what they bring to the table, how they seem to fit into the organization's growth plans and culture. I was able to prove that I was worthwhile investment for the company.This goes out to all. If someone tells you that they did you a favor by recommending you - don't feel overly obligated. Yes they did you a good turn. But you got the job on your own merit. Be professional at work and do not go out of your way to return perceived favors.\n4. **Was she a \"friend\"** \\- No, not towards the end. Initially I knew her only through social media. As we worked together I developed a friendly working relationship with her. When she began harassing me, the dynamics changed. Though I made sure that nothing in my attitude, behavior or demeanor would give any indication of hostility from my end.\n5. **Negotiations** \\- How was I able to get such a beneficial pay structure? I was working part time before. The first offer I had was double my salary - but it actually worked out to the same salary structure since I would have to work full time. I took a calculator to my meeting with the HR and showed them how with my increased travel cost and time spent on commute I would be more out of pocket taking their job. This is how I was offered OT, flexible timings and a high base salary.\n\n**Edit - 2**\n\nLink to my other story about this manager. I have a lot of stories about her. As I keep posting them, I'll update the links here for those who are interested in following the saga.   \n\n\nThe Uber ride that didnt turn out to be a freebie like she expected:  \n[https://www.reddit.com/r/EntitledPeople/comments/ndos8b/manager\\_tries\\_to\\_scam\\_me\\_into\\_paying\\_for\\_her/gyekio6/?context=3](https://www.reddit.com/r/EntitledPeople/comments/ndos8b/manager_tries_to_scam_me_into_paying_for_her/gyekio6/?context=3)",
        "permalink": "/r/MaliciousCompliance/comments/ncm1co/manager_tries_to_make_life_difficult_for_me/",
        "comments": [
            "Your friend does not seem very friendly.",
            "Got to love it when the manager's petty bullshit ends up helping you at the end, and no mater how much they harass you, you just grin at her and say \"Thanks!\" That always pisses them off even more! Kil them with kindness!",
            "What was her reaction when you told her about all that extra money she had helped you earn with all the overtime, weekends, and holidays?",
            "Friend? What friend? That's not how friends should act smh",
            "I don't get why friends can't be happy for friends. It sounds like she's very unhappy about everything and that makes me very satisfied",
            "She's not your friend, pal.",
            "Do you have any more stories about her you can tell us?",
            "Pretty sad she took it out on you when you were making more instead of looking to the company or at herself.\n\nObviously either she was being undervalued by her current company OR she just plainly wasn't as valuable. You getting more money was not you wronging her in any way.\n\nPetty shit, my dude. Glad you turned it into a positive not a negative.",
            "[deleted]",
            "Haha more stories please! And what was her reaction when you told her how much extra you made?",
            "\"Oh, well that was just a coincidence. Take this!\"\n\n*shoots laser*\n\n\"... You fixed my shoulder.\"",
            "Reminds me of a friend who set me up with her \"best guy friend\" only to turn into a megabitchosaurus when we hit it off.",
            "How in the world are you making four times your previous salary? Like assuming you had a somewhat livable wage before and four times that? Crazy pay for what i assume is a standard office job or am I just reading this wrong?",
            "The idea of her dedicating herself to ruining your life and at the end of it you cheerfully thanking her for all the extra overtime she helped you get is golden. Sounds like her anger was misplaced. If your manager is earning less than you that's a serious issue, but one for the company, not you.",
            "When my friend decided to get employed in the same company as me in a similar position as me, I told him, how much I earn and told him that because of his knowledge / skills he can try to negotiate higher. He did and succeeded.\n\nAnother friend works at some other company where he makes less for more tedious work, so I bother him to try and get a raise or at least acknowledgement from the management, that he might be gone because of the money.\n\nI don't care about money, I care about friends and our relationship. I want them to have at least equally good life as me, if not better.\n\nA person who just seeks ways to compare to others and ways to be owed to, should not be considered as friend by anyone.",
            "9 times out of 10 getting a job through or working for family or friends ends this way . It’s always an owed favour  you can never repay , the fact that you work your ass off to make that money and keep said job seems to not matter . It’s almost like they are handing you a paycheck out of pity .",
            "Why did coffee add an hour to her day?",
            "How was she your friend again?",
            "I don’t understand how a manager could not know the ins and outs of their direct report’s contract. And did I understand correctly that it was a law firm as well?",
            "I feel like you're deriving more enjoyment from complying in this job than the atmosphere of your prior job. I'm proud of you for not letting her get satisfaction in her pettiness.",
            ">So she decided that she would make it very difficult for me to work so that I quit on my own. \n\nI'm not sure where you're based but where I am this would fall under constructive dismissal and you'd likely be able to take legal action. If an employer makes life so difficult for an employee that they have to resign its essentially seen the same as unfair dismissal.",
            "Although you rejected the first offer, the friend still did help you get the job because they came back with a better offer. Not saying her actions were excusable, but just saying that she did help you land the job.",
            "A coffee drinker should have known better.  What a blinded fool.  Good story.",
            "I saved this for future references",
            "How did react when being told she ended up making so much extra money?",
            "Why do you refer to this woman as your friend?",
            "Honestly this is one of the best stories I've read on here!",
            "I wouldn't call that person a friend",
            "What country was this? nm, india.",
            "Op really knows how to job. People need to know that they don’t have to just settle for crap first offers. Good on you OP.",
            "If she had been smart, instead of vindictive, she should have renegotiated her terms of employment.",
            "I've worked in many different pay awareness structures.  One place I worked everybody knew what you were paid, because it was a grade system.  For example:\n\n* Level 1 = $20 / hr\n* Level 2 = $25 / hr\n* Level 3 = $30 / hr, etc\n\nYour grade was written on the roster (Kartoffeln, I.M. | Shitkicker Lvl 1).  The job title was pure frippery, only your level mattered.  The posted overtime records were updated daily next to the roster (a transparency measure as a result of dodgy dealings years earlier).\n\nAnybody could work out anybody else's pay from this information, and knowing what the income tax rates were.  Net result: nobody cared what anybody else earned.\n\n&#x200B;\n\nAnother (smaller) place there were 3 people who knew what I earned: me, the owner, and payroll.  Mind you, that list was nearly half of the company.",
            "I’m sorry to hear that your friend turned on you instead of supporting you when you were doing well. And that she actively tried to hurt you instead of using that energy to get her self better pay and respect at work. It’s really sad when your friends can’t be happy for you and you can’t be happy for them.",
            "Tell us more please",
            "Doesn’t that create a problem where the manager tries to get rid of someone that the workplace needs? Wouldn’t she get in a lot of trouble?",
            "How did she react when you told her about this etc?",
            "Need a new friend. This is hilarious what a db",
            "Who needs enemies when you have friends like this",
            "Yup. They need to make headlines for something",
            "Perhaps it’s that for impermissible benefits\n\n\n^^^/s",
            "Been looking at many posts on this subreddit for a while now but, this one was very enjoyable to read. Also struggle to understand most posts but this one was very clear and easy to understand. Thank you for posting.",
            ">I would be paid 1.5 times the hourly rate for every hour I worked OT and 2 times the hourly rate if any work was allocated to me over weekends or holidays. \n\nIs this not how OT is paid by default in your country? It is in mine. And we have other nice things regqrding OT and shift durations.",
            "I don’t understand how she can be your manager but not be aware of the hiring process you went through, and at the very least not be aware of your pay.",
            "You gotta post more stories about what she did and her reaction to finding out your base pay",
            "Sounds like they have a problem with their own pay and are taking it out on the wrong person. Never understood people getting jealous.",
            "Ya I don't think this person is your friend",
            "Whoa whoa whoa! We get OT pay in India? Since when? Just curious, do let me know what industry you're in? I'd like to switch careers.\n\nAgreed on the part about people drawing different salaries at the same level based on their last drawn salary. In India, it's all about how good at negotiating you are!",
            "Extra pay for working overtime, isn't that standard? 1.5 multiplier for evenings and 2 for holidays is pretty standard in Sweden AFAIK. Seems odd to not have that.",
            "She still ur friend?",
            "You were getting paid more than your manager...?",
            "[removed]",
            "Why did you turn her against you? You could have just thanked her for the opportunity and left it at that. She didn't need to know you renegotiated the terms. And your defiant statement was obviously meant to irritate her. Sure she was full of herself... but you wouldn't have known the job was there if she didn't try to get you in. As they say \"a spoonful of honey is way easier to get someone to swallow than a dose of medicine.\"",
            "This just seems like compliance.",
            "good for you\n\nI would love to have seen your horrible so-called-friend's face when she found out how much better the company was treating you  \n\n\nUnfortunately this is a RARE work story\n\nmost managers I hear about from friends or have been under myself have been horrible in every way as part of some messed up power game that seems to enhance their fragile sense of self  \n\n\nAt least that's how it is in the UK\n\nthe workplace is incredibly exploitative and demeaning here",
            "This sounds odd to me and if I was in her case I might be upset with the company. You give the impression that you make more than her before the OT and she is your manager. In all honesty, it sounds like a gender, pay gap to me. I mean she is your manager and according to you, she makes way less. If I were her I would be going to HR for a pay raise. She probably tried to and was turned down. I could understand where she is coming from.",
            ">A month later the HR of the new firm approached me again. They offered me almost four times the money I was making and I could set my own work hours. There was also extra pay for working overtime and on weekends. This was important. I joined the new company.\n\n>My friend did not know the terms of the new agreement I had with HR. She used to act like I owed her big time for the opportunity I got.\n\nThis happened to me as well, but I did not bother correcting him. Not worth my time.",
            "Where is the ending to the story?",
            "Nice friend btw",
            "[deleted]",
            "I call bullshit, managers know what the people under them make",
            "So she wouldn't give you good reference or was she forced to and complied as well for future jobs?",
            "Are you, by chance, from the Philippines?",
            "Bravo! I loved all of this!",
            "Honestly though I hate working overtime. The amount of taxes that get taken out are just not worth it.",
            "[removed]",
            "Can I ask of your a guy or a girl?",
            "But....without her you would have never even known about that job. So although you renegotiated for higher wage, she still hooked you up with that job contact.",
            "Ummm you got time and a half for overtime that's pretty much standard the double time is usually just on holidays though I love how you are trying to brag but like you didn't get that sweet a deal or else you would have stayed there and put up with the BS I call idiocy or shennagians on this this one actually more like you are really young",
            ".",
            "4 times the wage. Atleast be realistic when you lie on the internet.\n\nAlso, i was hungry, so I got a glass of fruit juice. Very strange.",
            "I just came here to say that 'as per' is overused, and usually just 'per' would suffice.",
            "[deleted]",
            "I think your friend is in fact a crab, living in a basket.",
            "Oh, you're good!",
            "U know she'd be an ally",
            "i'm curious, what was her reaction when you told her how much she helped you make?",
            "Me thinks? Hmmm Karen.",
            "“Friend”",
            "Gah, \"Friend\" seems quite  a piece of work. Low grade empire builder. Hope you found something good after leaving her trash behind.",
            "I have worked with so many malicious women. Usually their name is Stacy.",
            "I'd honestly love this kinda job. Sounds fairly relaxed and gets you extra goodies when it's not.",
            "Percentage wise how much extra did she help you earn?",
            "What's honestly ridiculous is that if she had just turned to you for help from the beginning you could have probably helped her negotiate a higher salary.",
            "Why wouldn't you be happy someone else is making more money than you? What you should do is be friends with them and learn their skills so you can also make the same amount of money. People think it's a zero sum game, but you csn actually create more value than previously existed.",
            "Why did you leave at the end? Was the workload she gave you actually too much or did you have another reason?",
            "With friends like this, who needs enemies.",
            "And this is why I use the word friend sparingly.",
            "Fuck, toxicity all around. Glad to hear you got out of there, no matter the money.",
            "Epic",
            "Wait, she's your manager but didn't know your salary or terms? Where is this as most every place I've worked if they're a direct report I have access to their salary and terms or had to approve it prior to hiring.",
            "Im curious, how much extra did u make?",
            "This is the best!",
            "wow what a dirtbag of a so call friend.  Did you ever break the news to her of how she messed up the company with her stupidity?",
            "Odd that she was the manager but didn't know about your arrangement with HR.  Sounds like a bad setup as a manager.",
            "You reeled in more money than a senior attorney/partner as an associate.   I didn’t know that was possible in a firm setting.  I had never wondered about that but now I’m really curious how their pay structure works. Usually, the problems I usually see are that there isn’t enough work assigned to the associates to meet their yearly hour requirements. Or there’s too much work and they run themselves ragged in hopes of a bonus or promoted. My role is usually the billing/accounting department in law firms - I stay out of management roles because I don’t want to be salaried.  I think in some scenarios, I make on par with my managers when overtime is applied.",
            "With friends like that, who needs friends?",
            "What an awful, negative, story",
            ">I work in India and here salary structure is kept strictly confidential. It can be grounds for firing to reveal or ask for someone's salary. Basically the way the system works is that every new hire negotiates their salary on the basis of last drawn pay, experience and qualifications. It is very common for two people working on same level to have vastly different pay structures.\n\nThat's some world class corporate slavery right there.  That sucks, man.",
            "With friends like these, who needs enemies?",
            "The only bad thing about this is that your command of the English language is far better than that of most people who were born in the US.\n\nMaybe I'm making an incorrect assumption that you were raised in India, though.",
            "I quit my last job after finding out I was the most highly educated and lowest paid. There was a lot of nepotism going on as well as other employees having either worked with or gone to school with the owner. Also after having earned raises over 3 years they were hiring people at the same rate I had gotten up to. And I was really good at my job. I even created a training manual without being asked. I took it with me as well as everything else I did on my own.",
            "Should’ve called her an acquaintance but nice story."
        ]
    },
    {
        "post_id": "il70e3",
        "author": "BissoumaTequila",
        "title": "Grandma’s rules? Okay, you can leave then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/il70e3/grandmas_rules_okay_you_can_leave_then/",
        "score": 17819,
        "num_comments": 303,
        "created_utc": 1599054162.0,
        "selftext": "This happened about 6 years ago when I worked at my local pub.\n\nNow for context the landlord operated on a “Grandma’s Rules” in the pub. Meaning anything you said or done that would offend my Grandma or yours then you’re out. You don’t offend Grandma. Simple. \n\nI used to supervise the bar while my landlord dealt with the office stuff to help balance the workload. It was a great job overall - decent wage, was right on my doorstep and the regulars were class. Except one. We shall call her Karen.\n\nKaren was getting married to one of the regulars and was a complete bitch. She was this horrible morbidly obese woman who would complain about the size of the stools and how it doesn’t fit her. What’s worse is she doesn’t acknowledge you. She would just huff and puff until she gets a new drink - I HATED that and so did every member of staff.\n\nOne day I got fed up and ignored her because she snapped at me for saying hello. The situation went as follows:\n\nKaren: “well aren’t you going to serve me?!”\n\nMe: “Why?”\n\nK: “Err, Grandma’s rules?! My grandma would be offended if I sat here with an empty glass for too long!”\n\nI immediately had a lightbulb moment and waited my moment to strike. I served her as normal and spoke to my landlord about her in the office. I explained what I wanted to do and he gave me the go ahead.\n\nI went back to the bar where she was spitting fire at the new bar girl I was training. I just calmly told the bar girl to ignore her, serve the customers. I then took her drinks, poured them down the sink and asked her to leave.\n\nKaren: “WHAT ARE YOU DOING?!”\n\nMe: “Sorry, Grandma’s Rules. She thinks you’re a bitch and wants you to leave.”\n\nSpoiler: the landlord is actually a landlady and my Grandma.\n\nEDIT: Woah this blew up - thank you kind strangers for your awards, karma and comments. My Grandma is an awesome human being!",
        "permalink": "/r/MaliciousCompliance/comments/il70e3/grandmas_rules_okay_you_can_leave_then/",
        "comments": [
            "Love the spoiler at the end. Perfect end of the story.",
            "Never heard of Grandma’s Rules before... I like Grandma’s Rules",
            "I follow Grandma's Rules when it comes to social media. Would my grandma be offended by it, or would I be ashamed to have her see it? If yes, I don't post it.",
            "What about the Rogers Rules?\n\nIf what you're doing would offend Steve Rogers, Will Rogers, and Fred Rogers, you need to stop.",
            "I feel like \"Grandma's rules\" are rather... variable, lol. My grandma is a racist homophobe.",
            "Was she banned for the day or banned for good?\n\nThis could be an existential crisis in the making: what do you do when you are forced to choose between your regular pub and your fiancee?",
            "Well done! And good for grandma, too.",
            "Perfect MC. Thanks for the laugh grandma",
            "So... did she leave?",
            " “Sorry, Grandma’s Rules. She thinks you’re a bitch and wants you to leave.” \n\nBrilliant!",
            "Tell your Grandma that this old Grammy admires her! I love a spitfire!",
            "Wow, for once i actually enjoyed one of these stories.\n\nGood job OP.",
            "Change all pronouns to an ambiguous 'they' in the story maybe? You refer to your landlord as a 'he' a couple of times. Just a suggestion.",
            "Quick question, if the landlord (landlady) is your grandmother, why did you refer to her as \"he\"?  I realize that you wanted to have the plot twist at the end, but gender doesn't matter.\n\nI generally hear the term \"landlord\" being used regardless of gender and rather just to indicate relationship.",
            "The twist at the end had me howling",
            "Well that was surprisingly wholesome",
            "Your grandma kicks ASS! I LOVE HER, and I don't even know her.",
            "Ouch! What a great grandma! Mine wouldn't ever do that kind of thing, but she also wouldn't own a bar. On the other hand, her late husband (my grandpa) wouldn't have tolerated that kind of behavior for a minute... and he was a Marine!",
            "My grandma would too. Only, she’d of done the kicking out herself. She’s a real spitfire.",
            "Grandma things you're a bitch is the best fucking comeback ever",
            "Well I'll be damned, great twist at the end 😂👍🏽",
            "Lmao",
            "I need to save this as an image",
            "Should have made her say please lol that is what grandma would want",
            "Grandma ain't playing today.\n\nSeriously these stories remind me of my own grammar (may she be happy in her next life). Sweeter than rasgollas but piss her off and you'll wish you were drinking black coffee with salt.",
            "Your grandma is amazing.",
            "This made me SO happy! I’ve never been a server or bartender, but I work in customer service. It’s completely unnecessary to treat humans like that. \nI always feel embarrassed when I’m with group and there’s someone behaving that way, or even trashing the “slow service” when you can take one look around and see how busy it is. \nI love your grandma and wish more employees would be able to take action like you did without the repercussions of firing. These people need to taught proper manners.",
            "One of the best story’s of malicious compliance! Brilliant",
            "This was magnificent.",
            "I never knew either of my grandmas, they were both gone by the time I was 5. My mother—my daughters grandma—likely would have slapped her off the stool then called the cops and told them she started a fight. I’m good with that.",
            "My grandma threw a full bedpan at an orderly in the hospital.\n\nI wanna go to her pub. It’d be like a GG Allin show!",
            "Omg, that’s hilarious. Also, “we shall call her Karen” cracked me up.",
            "That spoiler made it perfect.",
            ">and **he** gave me the go ahead.\n\n?????????",
            "Never happend",
            "Love this! Especially the twist at the end. Your grandma rocks!",
            "I would really love it if I can manage to incorporate this with my family members (my gran and gramp are gone so just parents, sisters and nephews + a niece)",
            "Sounds like someone I know...  What state is this in? 😏",
            "Fuck that bitch lol",
            "Excellent",
            "I always love a good story about a grandma kicking ass.",
            "Starting to apply \"Grandma's rules\" to..... well to... everything, from know on! \n\nAwesome spoiler btw! You and grandma are awesome!",
            "I don't think you can put a spoiler at the end.  It's more like a punchline.  But it's a good story!",
            "Did she ever try to come back? The regular she was going to marry, what did he or she think?",
            "This is the BEST and a really good business model!",
            "Karma! Grandma Rocks!",
            "That spoiler at the end made it all the much better. Nice one.",
            "I like it!",
            "Ending really turned that around.",
            "Likely one of the best stories I’ve read on this sub for a long time. \n\nIt’s short, straight to the point, funny, actually fits the sub, and is immaculately well written and easy to read.",
            "That is brilliant!!",
            "Jokes on you bitch my grandma is chill as fuck.",
            "If it's at the end, is it really a spoiler? Sounds more like a twist!",
            "Love your grandma!",
            "Lolol shes your grandma I did not see that coming",
            "This is glorious.",
            "The spoiler at the end was great lol. Grandma sounds like a cool lady.",
            "Omg that plot twist at the end🤣🤣🤣🤣🤣🤣🤣 I’m wheezing 🤣🤣🤣🤣🤣🤣",
            "Fat shaming has nothing to do with the story. Shame on you.",
            "I'm glad you did what you did, but you could've left out the detail of her weight.",
            "Well i would have given her a drink as per her say put make it spicier!",
            "A perfect twist at the end, loved it! Good health to you and Grandma!",
            "Lol no! That’s kinda facts",
            "Very well told! And your grandma sounds awesome!",
            "Amazing. 😂",
            "Tell grandma we all love her! great story op!",
            "I don’t know what Gollywogs are, but pickaninnies are Black children.  The bad thing about it, of course, is how horrible the statement is compared to how non racist she was trying to be.  She really wasn’t racist.",
            "Honestly you went 0 - 100 there. An complete overreaction. Had you asked her to be nicer and she continued, that would have been fair."
        ]
    },
    {
        "post_id": "vg23jd",
        "author": "UncleCoyote",
        "title": "Father’s Day Compliance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vg23jd/fathers_day_compliance/",
        "score": 17739,
        "num_comments": 594,
        "created_utc": 1655665416.0,
        "selftext": "18 years ago (Not about, trust me, I know this one to the date) I was over Dad's house and I needed a wrench, and coming from a long line of mechanics, I knew he's have one available as I didn't have my kit in my car, so I asked to borrow one.\n\nDad of course said yes, handed me the mechanic's tool box, and just out of habit, I opened it and immediately noticed that a Craftman's 7/16, ratchet-end wrench was missing.\n\nAgain, I come from a LONG line of mechanics; every tool has its place, be it in a drawer, box or outlined on a peg board, and I thought it was weird that Dad lost a wrench out of the spare / house tool kit.\n\n\"You're missing a 7/16.\" I pointed out, showing him the missing slot.\n\nNow Dad, being Dad, just had to bust on me a bit, so looking me dead in the eyes and beaming a huge smile he responded: \"It was there when I gave it to you.\"\n\nMind you, I hadn't left the kitchen. I hadn't so much as shifted my FEET. I knew he was lying, he knew he was lying, but it had been ingrained in me since childhood that losing a tool is a death sentence.\n\nNow, I knew he was busting my balls and I let it go; but from that day forward, anytime we needed something, he'd make a comment like \"Sure wish I had that 7/16th wrench that Coyote lost.\" or \"You know what would fix it? That missing 7/16th wrench.\" \n\nThis went on for MONTHS. So one day, he made the usual \"tease me for losing a tool\" comment and I warned him. I looked him in the eyes and said:\n\n\"Say it ONE more time old man, and you're going to get that wrench every Birthday, Father's Day and Christmas for the rest of your natural life.\"\n\nFew hours passed, I asked him to hand me a tool and he said: \"I can't you lost it, remember?\" \n\nI laughed, and played it off -but it was on...and that was 18 years ago.\n\nToday, being Father's day, he just received his 52nd craftsman's ratchet-end, 7/16th wrench.\n\nSince that day, he's tried telling me that he knows that I didn't lose it, (I knew that already) that I don't need to buy it (Oh, I fucking DO.), and he's occasionally tried to say it was a different size or item to get a different present, but we both know that's not happening.\n\nThey're everywhere. Every coffee can, junk drawer, cabinet, tool box, peg board or spare nail in the house and garage contains a Craftsman's 7/16 ratchet end wrench. You know how they say you're never more than 8 feet from a spider? Well in Dad's world, you're never more the 7 feet from a Craftsman's 7/16 ratchet end wrench, because there are at least two in his truck at this point as well.\n\nWhen will it end? When the old bastard dies. The last wrench will go in his cold, dead hand so he can tighten bolts in hell, because I warned him.\n\nGoddamnit. I warned him.\n\nHappy Father's Day to all of you with weird traditions, jokes and relationships with the man who made you who you are today. And if you need a wrench, hit me up - I know a guy.\n\nTL:DR - Dad teased me about losing a tool that he lost, and I've replaced it as of today, 52 times.\n\n** Update #53: https://imgur.com/a/4qOGTbv  **",
        "permalink": "/r/MaliciousCompliance/comments/vg23jd/fathers_day_compliance/",
        "comments": [
            "Gee. I wonder what he's leaving you in his will.",
            "Reminds me of when my brother and sister both realized they were getting my dad spatulas for Christmas. Both of them were getting these nice looking ones that were on the expensive side for spatulas. So my sister was like “make sure you get him something else.” Well fuck that, I understand my dad. AND the Walmart I worked at at the time was selling these metal spatulas for 25 CENTS each on clearance, left over from the summer grilling stuff that they ordered WAY too much of. Spent like $50 on these fucking spatulas, and then I started having fun. I know my dad enjoys the act of unwrapping something, so I found different boxes and containers to put them in. Also threw in some books to make it more interesting, he doesn’t know if it’s a book or a spatula. Christmas came around and he got to my gifts to him and went “I like seeing all these gifts, but I swear if there’s one more spatula in this I’m gonna lose it.” Had to hide my shit eating grin as I handed him the big box of all the spatulas I couldn’t get into other containers. He kept most of them but I actually ended up with the box, not entirely sure how",
            "For Christmas put one inside a clear epoxy cube for him, then on his birthday have a set of  cuff links made from them.\n\n\nThis will carry the joke on but put a bit of effort in too.",
            "This is the most wholesome and loving MC I've read here.",
            "My dad’s a contractor. One year his garage door needed replaced, and he thought “Meh, standard opening.” and ordered the replacement without measurements. \n\nIt was way, way, way, way, way, too small. \n\nDid we all get him tape measures for years afterward? You’re goddamn right.",
            ">The last wrench will go in his cold, dead hand so he can tighten bolts in hell, because I warned him.\n\nBrilliant.",
            "Sorry to do this, but the disingeuous dealings, lies, overall greed etc. of leadership on this website made me decide to edit all but my most informative comments to this.\n\nCome join us in the fediverse! (beehaw for a safe space, kbin for access to lots of communities)",
            "Too bad Father's Day isn't in July. Though I think you should just start to get him one on 7/16 as well. Ramp it up after 18 years, it's matured.",
            "My dad died three years ago and I was having some feels this week about the fact that I’d never get him another Father’s Day gift. This wonderfully written story was exactly what I needed today. Thank you, internet stranger, and may the tradition of that 7/16 wrench live on for many more years.",
            "I borrowed a Halfords (UK) socket set from a friend - 1/2\" drive, combination metric & imperial sizes.\n\nWhen I got round to opening & using it the next day, lo & behold, the 11/16ths socket was missing.\n\nAsked my mate if he had it at his house, but naturally he didn't.\n\nBeing a conscientious pal, I nipped onto ebay &, thankfully found a Halfords 1/2\" drive 11/16ths socket there... bought it for a few quid.\n\nWhile I knew it would never affect our friendship, I was damned if that set wasn't going back with every space filled!",
            "I replaced my dad's garage door opener last fall. This spring he asked me about the remote. I told him I remember giving it to him in the garage when I was finishing up on the door, but I wasn't sure after 7-8 months. He gave me a ration of crap about it, saying he looked all over and he claimed I never gave it to him. I didn't argue, but he told me to buy a new remote and get it connected and he would pay me, so I did. He still gave me a bit of crap about it from time to time.\n\nThis late spring I was at his house looking for something and open the junk drawer in the kitchen. I was digging around and what the heck, there was the remote. Obviously I did give it to him and he just dropped it in the junk drawer and forgot about it. (He is in his 90's so I guess it is forgivable. Any way I knew he was outside so I walked outside. He was in the yard in view of the garage door. I walked up and said, \"Look what I found!\" and opened the garage door with the remote. He looked at me and asked what I had and I pointed to the door and closed it while he was looking that way and then I handed him the remote. I told him where I found it and he didn't say much. I gave him a bit of crap that I had not been certain I gave it to him, but was about 75% sure I had. He mentioned that my memory was obviously better than his!",
            "Someone's got a loose nut, but your dedication to this is admirable even in the most wrenching of stories. Happy Father's day to you, u/UncleCoyote",
            "I love everything about this.",
            "You could even buy one of these to put your 7/16 in \n\n\n\nhttps://www.etsy.com/uk/listing/526642100/in-case-of-emergency-break-glass?gpla=1&gao=1&",
            "Every one of those wrenches was an \"I love you, dad.\"",
            "A little family has rented a room from me for the past couple of years; they stay because they can't afford their own place.        Since times are tough, the father does odd jobs around the house, in exchange for low rent.\n\nThis year they welcomed a new baby to the family, right around Mother's Day, so we didn't have a party or social gathering while mom was recovering.       Come Father's Day, and dad wants to rebuild a fence- I'm all for it, so gift him with a Dewalt cordless circular saw.       \n\nNaturally, I felt a little guilty that I'd gotten the father an expensive present, but hadn't done much for the mother.       So, I told them; the saw was a 'Welcome' gift to the new baby girl!         If they were good, maybe the baby would let them borrow it.",
            "Also, for his next birthday make the present the shape of a hammer, only for him to open it up to….another wrench!",
            "Bury him with all the 7/16 wrenches.  Archaeologists in 1000 years will wonder WTF.",
            "This is one of those things that'll inadvertently prevent a blackout on the eastern seabord or save the Space Station or something. Like the Kodak Film Nuclear Scandal.\n\nSome scientist somewhere will be like, \"All the plankton in the ocean will die unless we can compare steel variants in consumer products going back 20 years. But who would have a collection of the same item, manufactured in the same way, in sufficient quantity so as to--\"\n\n\"Let me stop you there. I know a guy with a wrench collection.\"\n\n\"That wrench collection is about to save the World.\"\n\nEdit: Link below.",
            ">You know how they say you're never more than 8 feet from a spider?\n\nNo, I did not, and fuck you very much.",
            "Give him my address.  I was just looking for a 7/16th...",
            "\"he can tighten bolts in hell\"\n\nFucking hilarious!",
            "\"...coming from a long line of mechanics, I knew he's have one available as I didn't have my kit in my car...\"\n\nDude, ya broke the first rule of coming from a long line of mechanics.",
            "Get him an adjustable wrench next time to switch it up and make him think he got something else.  Set it to 7/16th and lock it in place with  J.B. Weld.  I'm sure he'll laugh when he goes to adjust it.",
            "The story, the compliance, the perseverance (52!!!!), the plan to have one in his hands when he passes. Love it all!",
            "This is the kind of Compliance only a good son can deliver.",
            "I don't remember how it started, but I give my dad duct tape every birthday and holiday. But not just any duct tape. My goal is to give him duct tape that he absolutely will not use. Lol. It's been at least a decade and he has yet to not use the duct tape I've given him.",
            "I appreciate this level of commitment. The best love language is one brought on by spite",
            "Get a pair of 7/16 wrenches and connect them with a chain so he can hang them from his mirror like fuzzy dice.",
            "OMG, this is brilliant. Every bit of this is a love letter to your dad, and I wish you both long, healthy and happy lives. Happy Father's Day!",
            "So....did you get point across yet? Lol",
            "Back when I was a teenager one of my friends had a father who hated shopping.  He would traditionally only go Christmas shopping on Dec 24, starting at 6 PM.  As such he was always in a mad rush, and would just sweep up whatever random stuff he could find.\n\nOne year in January she complained to us, in a quite indignant tone, that on Christmas morning she rushed down the stairs and the first thing that she saw was a spatula sticking out of her stocking.  She went on and on about how terrible it was that her father thought that a spatula would make a great Christmas gift for a 16 year old girl.\n\nAnd that's when a plan was hatched.\n\nYou see her birthday was in February, and we all made a vow together.  On her birthday every one of us presented her with a spatula.  She had all kinds of spatulas, wrapped in every conceivable manner.  Every present that she opened was another spatula.\n\nOf course she vowed revenge.  Every birthday from then on she would gift each one of us with a spatula.\n\nAnd that's how a tradition was born.\n\nSoon the spatulas were flying back and forth between our entire group.  Birthday?  You get a spatula.  Christmas?  Spatula time.  And who can forget the traditional graduation spatula.\n\nIt was glorious.\n\nAnd guys, I have so many spatulas now.  I have them in every colour.  I have them in every size.  Comically oversized spatulas?  I have 3.  Comically undersized spatulas, probably  intended for doll houses?  They're more of a foot hazard than legos are.  Ever hear of the [Malaysian Battle Spatula](https://www.questionablecontent.net/view.php?comic=540)?  I have one.  How about a [Hydro-Dynamic Spatula](https://spongebob.fandom.com/wiki/Hydro-dynamic_spatula) with port and starboard attachments and turbo drive?  Well, I haven't actually received on of those yet, but I just know that it's a matter of time.\n\nThe tradition has spread to my kids.  Every Christmas they get a spatula in their stockings.  every Christmas I get three.\n\nYou've probably heard of rick-rolling?  Around my house we \"[Spatula City](https://www.youtube.com/watch?v=DpsMGpMIqNk)\" roll each other.  By the way, if you haven't already seen the movie UHF featuring Weird Al Yankovic, you should.\n\nNow if only I could get a slotted spoon.",
            "This story hits different. It’s a heart wrenching tale.",
            "My uncle put my grandfsthers favorite tool in his hand right before the casket was closed, you need to take a 7/16 wrench to the funeral and make sure its in your dad's hand before they close his so you can get the last laugh.",
            "Nana in the hospital and his son shows up with a bouquet of ribbon wrapped wrenches.  \n\nI love this so much.  My grandpa would be delighted call me a pain in the ass and probably toss a wrench my way.",
            "As the wife of a mechanic who as lost more tools than I ever will, I approve of this. TFF.\n\n\nETA: typo---last to lost. Oops.",
            "Not to be morbid, but when he does go to the big garage in the sky (hopefully many years from now), you’re gonna cry every time you see a 7/16ths wrench.",
            "When I was about 14 my dad misplaced a 7/16” wrench. We joked about it for years but moved on. A replacement was bought and life went on. About 15 years later he bought a truck from the estate of a friend. We had done a bit of work to the truck over the years. While stripping it for parts we pulled the motor. Stuck in the oil and dirt on the front suspension crossmember was that very 7/16” wrench. Apparently we, not sure which of us, had let it fall down under the engine while working on it. But it came back and is still in my dad’s toolbox. It is a little rusty but works fine.",
            "Put them all in his coffin, lol. or watch him leave you all of them in his will.",
            "Laughed out loud at \"Tighten bolts in hell\" - I had that relationship with my dad  (A quality control engineer) - great story.",
            "What gets me is that it sounds like he KEPT ALL 52",
            "You should drill a hole in a handle and run a chain through it for a necklace for him.",
            "Wasn't expecting to cry over a Malicious Compliance,  but here we are...",
            "Solid 5 of 7/16.",
            "I know a guy. lol",
            "Thank you you beautiful bastard.",
            "At least your father knows that your are a stand-up man who fulfills his promises.",
            "Make sure you have someplace to gift those wrenches to, because at some point you know you're going to be inheriting them. Also, time to take it up a notch, as at this point there's no way he's keeping tabs on all of them. Start regifting him the ones you've already given. See how long until he catches on that his collection isn't growing any more.",
            "My old man was a policemen for 5yrs and a truck driver for 25yrs. He wouldn’t let me drive truck because “it was to hard on a family” so I did the next best thing and became a truck and heavy equipment mechanic, well he always tinkered and “fixed on stuff” and had a toolbox that had everything you needed but was mostly disorganized and sure enough it was always “us kids” that lost his un-organized tools. Well being a professional diesel mechanic my $15k toolbox and $50k worth of tools was ORGANIZED so one Christmas I decided that once and for all I was going to buy racks and organizers and find or buy every tool “we” ever lost. I get thru organizing and replacing lost tools and made the deadline of surprising him for Christmas… He gave me a simple “Thanks Jr.” 🤦‍♂️ … \nOne week later at New Years he complains that I messed up his toolbox and he can’t find a thing!!! Sure enough all the racks and organizers are in a neat pile next to his box!! I’m PISSED!!  I go to confront him and he says “ the good thing Jr. is that I found a few tools you had lost 😁😁😁😁 \nGod damnit Dad !!! I love you and miss you Pops RIP.",
            "I linked my wife to this and she immediately was like \"He's clearly at the point where he could take one from his dad,  regift it, and his dad wouldn't know\"\n\nSince you're presumably single-handedly driving up the eBay cost on these, I'm inclined to agree with her! :)",
            "You realize that when he dies, this will be the only thing he will leave you in his will. All those 7/16 ratchet ends.",
            "Sounds like when my father said, \"A man can always use another hammer.\" Every holiday for the next ten years. There is an entire wall of hammers in his garage now.",
            "Great story and I have two things I’d like to share with you:\n\n1. Hell exclusively uses 1/2 bolts so the 7/16 will make it that much more Hellish for him. \n\n2. I still have my Dad’s 50+ year old wrenches and it’s nice to think of him every time I use one since he’s no longer with us. There are multiple of every size, but not a damn 7/16 (or 10mm) so if y’all want to bequest one in his memory that’d be great.",
            "Guess what he’s leaving you in his will? 😝",
            "Great story!!",
            "I got a giggle out of this. :)",
            "This is amazing MC. Nicely done! The only sad part is having a tangible timeline of the reduction of quality of craftsman tools.",
            "Had to award you a silver for a story that brought tears to my eyes.\n\nMy dad, my best friend,  still miss him soo much",
            "Nice. I've been blamed more times then I can remember by my dad for things that had no logical sense. On his death bed he apologized and said he should have spent more time together.",
            "This is the best story on Reddit.",
            "When his father dies, instead of dropping flowers, they'll drop 7/16 wrenches. It's what he'd want.",
            "In case no one's said it, you are a hero. Thank you.",
            "This literally made me laugh out loud 🤣😂 I LOVE IT!!!!",
            "Another story about a 7/16\" wrench. On a job in Toledo in 1979, my partner & I (apprentices) lost the last 7/16\". We could not find one anywhere on the job. Inventive & industrious we thought we were so we made one from a sheet of iron & an oxy/acetylene torch. We finished our task & showed the GF our pride & joy.  He took it in his hands, felt it, admired it, smiled, said, \"Wow, that sure is an expensive wrench!\"  Lesson learned..  At least we never had to pay!",
            "Thank you for sharing this. I laughed until I cried. My dad passed in October 2019 and I really miss this kind of goofy, dad-thrmed interactions.",
            "When we were getting my late son's old car back on the road, I kept having to buy 7/16th line wrenches because we kept misplacing them.  As soon as I'd buy one and get it home, we'd find the one we couldn't find and it would stay in the packaging.  I have like 3 still on the backer board.  \n\nThanks for reminding me of this.\n\nI hope your father takes his wrenches with love.",
            ">if you need a wrench, hit me up - I know a guy.\n\nI went from all smiles to a hearty laugh there at the end, well played",
            "At this point I'd say you should mix it up and get him one in different mediums. Crochet one and chocolate one come to mind 😂",
            "You should have a carving of the wrench on the top of his tombstone.",
            "All the bolts in hell are going to be 1/2\".",
            "Stop please think of the supplier's sales statistics. How are they ever going to explain the black hole you created?",
            "I am still laughing at \"The last wrench will go in his cold, dead hand so he can tighten bolts in hell\".  Well done sir! You have my utmost respect.",
            "If he outlived you: make a trust that sends him a wrench at your funeral, his birthdays/holidays…",
            "This is the best post in this thread since I joined.",
            "OP - add variety. A crescent wrench welded at 7/16. A wrench+socket.  Even a ratchet set that has a box of interchangeable, all 7/16 sockets.",
            ">The last wrench will go in his cold, dead hand so he can tighten bolts in hell, because I warned him.\n\nThis is epic.",
            "This is just excellent.",
            "Fuck it take my up vote! Happy Father's Day",
            "This was AMAZING",
            "Has he ever thought about returning a few for something else?",
            "This is good. I approve.",
            "This was an awesome story",
            "You should wrap them in different shaped packages so he thinks it’s something else each time.",
            "I also love how you described a father as:\n> the man who made you who you are today.",
            "My Dad and his sister had the same birthday (different years), and sent the same birthday card back and forth every other year for over three decades.",
            "You may have just explained a personal mystery of mine.\n\nI bought out an old mechanics rolling tool cart with all the tools. He had put the cart in storage and the moving company didn't want to deal with the weight so they just dumped all the tools, sockets, box end wrenches, screw drivers, etc into many 5 gal buckets. I trusted most of the tools were there so made an offer on it all without sorting and loaded up. As I found time back at home I went through those buckets and started to piece the sets back together. Mostly snap on which I knew but also dozens and dozens of 5/8 wrenches, sockets, and hex screw drivers. Yes most of the sets were complete, but with many extra 5/8ths. \n\nSo, wanna trade a few 7/16 for some 5/8?",
            "LOL. My brother did the same thing, but with batteries.",
            "This is the most wholesome and funny MC I’ve seen in a while. I loved every paragraph about it.",
            "Not only is this a lovely story, you have created a group of wrenches uniquely qualified to test Craftman’s batch to batch consistency and change in quality over time.",
            "Now listen here you little shit... I like the cut of your jib.",
            "This is so good. My dad passed away last August, so yesterday was my first Father’s Day without him. But he would have loved this story!!!!\n\nHug your dads.",
            "This is worst than when my brother, my ex, and father deciding they were going to be \"creative\" with wrapping gifts. I forget who but one of them ducked taped (my dad loved his duck tape) then did zip ties- and not like one- but even 1/2 inch was a zip tip... going across and up and down. I think it was also in a box of a box- and both boxes were duck taped. I forget who did it to who but it took over and hour to open and pliers.",
            "I've pointlessly deduced that your father's birthday is yet to come…",
            "I had this with a friend after she dragged my wife and I to see \"John Tucker Must Die\" (uggh), she got that movie for every bday and christmas for years.  It took until about the 3rd time I gave it to her to realize what was hapenning.....",
            "This will be the most delightful thing I think about today. Thank you!",
            "This reminds me of the on going in joke my mom and I have. (I'm 32F this happened when I was like 15)  \n\n\nWhen I was a teenager she came up to me and asked me if I had seen her purple foot massager. I said no. She said it was in the junk drawer the last time she saw it. My mom had a drawer in her room that was a \"junk drawer\" but that actually useful stuff in it, like nail clippers, that we all got into now and again. This is important later.  \n\n\nI told \"Still nope mom. Haven't seen it.\" So she launches into a description of what her purple foot massager looks like. She explains it's a remote with a wire leading from it and a little ball on the end that vibrates and that you use the ball on your feet. I'm sure some of you already recognize this for what it actually is but my brain back then did not. I tell her again I haven't seen it.  \n\n\nWeeks go by of my mom occasionally asking me if I have seen her purple foot massager with me constantly telling her no. She finally stops one day and tells me she found it. I think nothing of it. Then I go to the junk drawer in her room for a pair of nail clippers. What do I see? The \"purple foot massager\" and upon actually seeing it I realize what it was.  \n\n\nI storm out of my moms room to the kitchen and just yell at her, \"You thought I stole your fucking vibrator mom??? Seriously??? Why would I EVER use YOUR vibrator???\" If I remember right it was because she had recently found my small porn stash in my room and just assumed I took it lol. But like.... ew mom no.  \n\n\nEver since it has been an on going joke for over 15 years now where, whenever possible, I buy her a purple massager of some kind. Christmas time? I buy her one of those vibrating back massagers in the color purple. That kind of thing. There was even one year when I got her one and she had it on her coffee table. My teenage sister came home with a friend and that friend....THOUGHT IT WAS A VIBRATOR! I bout died laughing when my mom told me that in a twist of irony she had to explain that a literal massager was in fact not a sex toy. That she did not just casually leave her vibrator on her coffee table for guests to see.  \n\n\nHowever... I had never been able to find an actual foot massager that was purple. This year for mothers day I FINALLY found a foot roller that was purple. The look of disappointment/exasperation when I gave it to her was hilarious XD. I found out the other day that she seems to begrudgingly actually like it though lol.",
            "This is next level excellent",
            "I love this so much. Read it to my husband, and he can't stop laughing!!!",
            "OP, I love this! Happy Father's day from Canada 🤣🇨🇦",
            "Fabulous",
            "OK, that's funny.\n\nMy family had a tradition for several years of giving people gifts involving parrots, but yours is funnier.",
            "This is the best story",
            "Love this!",
            "I love my Dad too♥️",
            "This is great",
            "Just curious,  how much do you think you have spent so far?",
            "What a cute story, I love it!",
            "This made me happy. Thank you",
            "This is truly glorious.  Happy Father's Day!",
            "🤣🤣🤣🤣",
            "*slow clap*",
            "I hope your kid keeps this up.",
            "This is truly majestic, the commitment",
            "I love this.",
            "Acorn didn’t fall too far the tree.",
            "Not sure why the extras weren't sold at a yard sale or given to Goodwill.",
            "Absolutely beautiful. A perfect revenge.",
            "lmao good one\n\n&#x200B;\n\nhave him buried with a bouquet of wrenches maybe?",
            "If anyone in your family is or knows a rower, 7/16 is the size for almost all boat rigging nuts and they walk off all the time. So if he wants to unload a few, that'll make some crew very happy!",
            "That wretched wrench",
            "Well played. Very well played.",
            "Lovely tribute to your dad. I just read it to my husband, who said, \"I think that's the smallest that doesn't need an adapter.\"",
            "Too bad it wasn’t a 10mm. Probably would’ve been delighted to have 52 extras on hand.",
            "You need to start putting them in desserts and casseroles to spice up the timing!",
            "That's amazing.  I wish someone would give me a 10mm every year ;)",
            "Make sure you date them so you know which of the quality-era Craftsman ones to keep and which of the crap-era ones to toss.",
            "Make sure you bury him with one when he dies. Wouldn'want him to be without one in the afterlife.",
            "I am giggling in bed. That’s the most hilarious, wonderful, wholesome malicious compliance I’ve ever seen.",
            "LMAO   Best damn story.  Laughed all the way through",
            "This is fabulous. Just nasty enough, but not actually damaging. You rock!",
            "This is the most heartwarming petty revenge I've ever read.",
            "You said what you meant, you meant what you said. It's his own fault for not paying attention to you when you warned him.",
            "I love running jokes.  It took me me this whole last month but I finally convinced my friend I didn't know what nickels are.  I had absolutely no reason to do it but I saw a nickel on my desk and I guess I just wanted to mess with him",
            ">You know how they say you're never more than 8 feet from a spider? Well in Dad's world, you're never more the 7 feet from a Craftsman's 7/16 ratchet end wrench\n\n&#x200B;\n\nI laughed so damn hard at this. Tears I tell you. Tears.",
            "I so want 7/16 to be equal to 10mm.",
            "Magnificent and unrelentless. You are the kind of people who keep the country running. Good job!",
            "Glorious. Do you ever wrap them in different containers so it looks like something new and then *BOOM* here's your wrench Dad!",
            "Heartwarming malicious compliance",
            "You were raised right!! Maybe start looking online to look for miniature wrench’s to gift with the 7/16? They can make babies…. Like tribbles.",
            "I'm happy this turned out to be a long-time joke with your father in the end, but I'm really struggling to understand what he was trying to achieve at first. Just unfairly pinning it on you like that and not letting the joke drop after weeks? I don't get it.",
            "Too Bad it wasn't a 10mm",
            "This is my favorite r/maliciousCompliance ever.",
            "/r/tools would absolutely love this... Op, post it there",
            "Why I'm laughing so hard 🤣 🤣🤣🤣",
            "Thank you for this story.  Made me laugh so hard I scared my dogs.",
            "As a das I look be what you did d as wish my son would do the same",
            "Glorious. The mention of Cyote I found interesting. That's a Native American thing isn't it?",
            "you sound like a fucking idiot.....and I laughed my ass off; altogether brilliant!!!!!!!",
            "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣\nThis was amazing. Had me over here wheezing trying not to wake my toddler up from his nap lol",
            "Hero",
            "Do you buy them in bulk?",
            "My family has a similar tradition haha I'm not 100% positive of the exact origin because I try to stay out of it, but it's remotes in my family. I know it started with my aunt (moms sister) and if I remember correctly she first got a shadow box containing the remote that started it all. Since then the collection has grown exponentially. This started when they were teenagers and they're both over 50 now. Every single remote no longer in use has been collected. They have networked to collect remotes. And they hide them around each others houses when they visit one another. I don't know what the last count was, but my mom got the last strike. My grandparents were still finding remotes a year after her visit a few years back. To this day I don't know if they've found them all. There's also a couple of decorative plates that somehow ended up involved. Its crazy how competitive they get with it though. Hence why I try to stay as far out of it as humanly possible.",
            "This is one of the best MCs I've heard.",
            "So he’s never returned them for store credit…",
            "LOVE this. You could make one into a grill flipper...",
            "So that's where all of the 7/16\" wrenches disappear to...",
            "Thats incredible, great story!",
            "I love your story. My Dad and I have something similar with Screws vs Nails. He made some smart ass comment about nails being inferior... and 10 years later he gets a box of nails for Christmas every year.",
            "I’m in legit tears from laughing reading this. We may have the same father.",
            "As you pass by his open casket someday make sure you drop one in…quietly",
            "Fool around and find out. (Happy Dad's Day, dad.)",
            "You seem to be a great guy! Love your humor.",
            "I love this!!!",
            "This is fantasticly malicious and yet kind and fun. You win!",
            "Absolutely magnificent!",
            "And one day you’ll recognize you Did lost it, the previous time you borrowed it.",
            "If you bury him, have one literally placed in his cold dead hands.",
            "Omgosh I love this",
            "AWESOME!  You gotta know where to make your stand.",
            "Is this like… all you get him? lol",
            "This is amazing!!!",
            "This is so fucking wholesome and cute I want to die. Good on you and your dad!",
            "My old man phoned me up saying I had stolen his 1/2 drive ratchet that my brother had given him - except I had not stolen it and it was ME that had given it to him - the rot started from there.",
            "My favorite kind of tradition. Thanks for the story!",
            "[deleted]",
            "I *literally* laughed so hard I chocked on my own spit. This was a marvelous read, well done!",
            "Hahahahahahahahahah nice",
            "Its fucking bizarre that that happens to be the *one wrench* (out of two complete sets, metric and Imperial) that I'm missing, too.",
            "One day when you inherit them all, find some rowers and/or rowing clubs to donate them to, they’ll love you for it. 😉",
            "I love this, and if your dad were to read it I'm sure he would too.",
            "This is awesome. It reminds of of the kind of thing me and my dad would joke about. Thank you for sharing.",
            "you're traumatized.  you wont be dead if you give him anything else.",
            "I'm crying, most excellent malicious compliance!",
            "That’s just about the best thing I’ve ever read",
            "LMFAO!!!!!",
            "Is there at least one in the toolbox now",
            "I didn’t know they have been making ratchet end wrenches 🔧 for 52 years ?",
            "Hilarious! This made my day. Thanks for sharing",
            "God I loved this!!",
            "This is cold, cruel and utterly heartless. I FREAKING LOVE IT!!!",
            "Oh this fantastic lmao",
            "lol",
            "Great post and story! Well done!",
            "This is wonderful. Well played man. Well played.",
            "This reminds me of how we used to always get my dad a screwdriver for his birthday and Father’s Day and Christmas because he always loses his tools lol",
            "So If I were to buy one from Lowe's today, it would cost $16.98. \n\nI wonder if you remember the first time you bought it, how much it was and than how the prices just steadily increased over the years.",
            "Holy hell, are you me? With the exception of being mechanics (the men of my family are all amateur mechanics, never professional), that sounds exactly like the way my dad and I would handle that, down to buying the same wrench for years",
            "Wrong sub, should be in r/wholesomecompliance",
            "Lol. Amazing. Wholesome.",
            "This is awesome. Just truly great.",
            "Now what you do is you move ALL the 7/16 pieces to different spots next time!",
            "The year my husband and I moved in together we found the most perfect gift for my mother in law for Christmas.  It was a fireplace length ornament depicting something very special to her. It came in a long thin box and we dropped it off wrapped about two weeks before Christmas. \n\nThat same year she'd decided she no longer needed a Christmas tree. My husband had been mildly disappointed because she was famous for her Christmas decor. Anyway, she was convinced the whole two weeks that we'd got her a Christmas tree and she was FUMING. She demanded we exchange it, we had daily calls from family members telling us how disrespectful we were being. \n\nShe loved the present. But for every Christmas, birthday and mother's day for 20 years after that she received at least one small Christmas tree (we got her another gift as well).",
            "Some part of me was like “whoa OPs name is Coyote? That’s badass..” then I go “oh wait. That’s their user. Oof”",
            "\"I know a guy.\"",
            "You are a legend.",
            "INFO - do you also give other presents to your father ?\n\nIf yes, NTA \n\nIf no, also NTA",
            "If he does Christmas trees in the winter, you should track down as many of them as you can, and hang them all with bows on the tree. Maybe even buy a second tree so you can sneakily do this for the Christmas day reveal.",
            "Jeezus. Even Paul Rudd is like, \"rein it in, chief\".",
            "> and he's occasionally tried to say it was a different size or item to get a different present, but we both know that's not happening.\n\n...why can't he just return them?",
            "Maybe you could go more softer way and buy him t-shirt with wrench on it or chocolate wrench etc.:?",
            "Give it up, you won already.",
            "God damn. Stone cold."
        ]
    },
    {
        "post_id": "jtke94",
        "author": "TandyAngie",
        "title": "You want to loose $100? Alright, sign here.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jtke94/you_want_to_loose_100_alright_sign_here/",
        "score": 17712,
        "num_comments": 926,
        "created_utc": 1605289585.0,
        "selftext": "I work in accounting and my assistant is out on this particular day so I’m working on invoicing. While doing invoicing, I come across a work order that has a higher expense amount than invoice amount. Realizing we will be losing $100 on the job instead of at least breaking even, I decide to question the project manager (Chad) about it.\n\nMe- hey, I noticed this job has an anomaly. Can you explain it to me?\n\nChad- What are you talking about?\n\nMe- See the expenses? They reach a higher total than the amount you want me to bill for. I want to see if that was a mistake or\n\nChad- No! It’s right.\n\nMe- if that’s right, we’re going to lose money on this job. You won’t get commission and \n\nChad- I’m telling you it’s right. (Chad then rips the papers from my hand.) See, we charge a 20% markup right here. (He points to the wrong spot and has the audacity to look smug.) See, it’s fine.\n\nMe- (I calmly take the papers back and show him to two amounts side by side) I see that, but you didn’t account for that over here for the billing amount. The total billing amount is less than that. \n\nChad- Look, it’s right and I don’t have time to explain it to you. Just do it and stop bothering me.\n\nMe- no problem, can you just initial here so when our boss asks me why this job is invoiced so low, I can\n\nChad- sure fine, whatever. (Signs his name next the billing amount) now get out of my space\n\nI go back to my office and invoice the too low amount. I sent it off, fully knowing this was going to backfire, and kept all backups and copies handy for when it did.\n\nNext Monday, I have the boss in my office. The invoice in question is in his hand.\n\nBoss- hey, you did this invoice wrong. (Shows me the invoice)\n\nMe- actually, if you’ll look at the backup, Chad told me that was the invoice amount. (I show him where Chad signed off)\n\nBoss- I’ll be right back\n\nHe left my office. Roughly an hour later, I get called in to the boss’ office. Chad is there, looking uncomfortable, and my boss is on the phone. He waved me inside and I sat down.\n\nBoss- alright. We’re all here. Now, TandyAngie, please explain this to me.\n\nMe- I noticed that the expenses on this invoice were higher than the billing amount. Chad told me that the numbers were fine, and to just do the invoice.\n\nBoss- hear that Tex? (Tex is the sub contractor we used on this job)\n\nTex- yup. So what are we gonna do?\n\nBoss- only thing to do is fire them. They’re either incompetent or cheating us. Either way, it’s bad for business \n\nI am now very concerned for my job, but I sit silently. I know I don’t have the whole story yet. \n\nTex- I recon you’re right. Good luck. And don’t worry about the park job. I got an opening up tomorrow I can squeeze in.\n\nBoss- thanks Tex. \n\nHe hangs up the phone and turns to Chad. Chad has gone from nervous to mad.\n\nChad- it’s not my fault she can’t do her job!\n\nBoss- you signed your name right next to the wrong amount. Now you’re either working with someone in accounting over in Tex’s company to steal from me, or you’re too stupid to work here. Which is it?\n\nChad stands, as does my boss. I stood as well,  not liking being the only person sitting. Chad says nothing.\n\nBoss- you’re fired. Get your computer and leave. (Boss turns to me) Go ahead and fill out the paperwork for his leave. Make sure to add that he attempted to embezzle money.\n\nI nod and leave. Chad stays there. As soon as I leave, the office explodes in screaming. I stayed in my office, doing the paperwork my boss asked me to fill out. I saw Chad leave later with his stuff thrown haphazardly into his bag. That was the last time I saw Chad. A friend saw him working at a cash register at a buffet place about a month later.\n\nTurns out, both my boss and Tex had agreed to lower their markups for the job so the invoice number was STILL too high (not too low), but I didn’t know that until after the fact when my boss had me redo the paperwork for the entire job. Someone from accounting in Tex’s company had altered the invoice sent to Chad, and they were planning on splitting the difference after we paid the altered bill.\n\nTLDR: Chad attempts to embezzle money for the first time and doesn’t pay close enough attention to his numbers. Got caught and fired.",
        "permalink": "/r/MaliciousCompliance/comments/jtke94/you_want_to_loose_100_alright_sign_here/",
        "comments": [
            "Amazing the risks people are willing to take for such a minor payout",
            "I had a person get his whole department busted over $0.23. I was auditing compliance with internal documentation policies. This guy put in a ticket that his paycheck was 23 cents short. Some boneheaded just automatically reversed the direct deposit and reissued with the additional .23. \n\nThis was at the end of May. When I looked up his history I saw over 1,000 hours of overtime paid at time and a half so far for the year. Well there’s only 2,080 regular hours in a year. That would have meant that he was working over 80 hours every week. \n\nTheir boss had left and they hadn’t been moved under a new boss. Turns out this resulted in their timesheets auto approving because the approval chain was broken. His group found that bug and at first just added a few hours a week. They ramped that up to over 100 hours a week when they didn’t get caught. \n\nThey would have been able to continue, if it wasn’t for that .23 cents. We reversed as many direct deposits as we could. Then sent the whole mess to the fraud department.",
            "So, this guy attempted to embezzle money from his employer, by striking a deal with a contractor - which is a crime, and his total payout for risking his job and getting arrested is... $50?\n\nI swear to god I'm going to become a criminal, because if this is the average intelligence of people who do this stuff, I should be able to totally rake in the bucks.",
            "When someone asks you \"Are you *sure*?\" multiple times, maybe, just maybe, you ought to take a step back and think about it for a minute ;)",
            "“I stood as well, not liking being the only person sitting.”\n\nThank you for a much needed laugh today!!",
            "As an accountant, I can't imagine how he thought this wouldn't be spotted...\n\nThen I remember 90% of people I work with. They wouldn't even look at the number longer than it takes to type it in.\n\nGood job on you. You deserve the praise, and I am quite sure you got none. Because...\n\nIt's accrual world out there.\n\n*I'll show myself out*",
            "Your job was still secure, though...right?",
            "We were a Mom & Pop outfit that got a little bit bigger and we had a trusted friend handling accounting, both Payable and Receivables. Got an unsolicited tip from one of her disgruntled friends that she was stealing from us, and eventually found out that she had embezzled over 100 K in the course of about a year and a half.\n\nReported the incident to the police, they sent a guy over about a week later who told us white collar crimes were so backed up that they wouldn’t get to the case for 24 to 30 months. We should get a forensic accountant to go through everything, back up all the paperwork and they be in touch. We hired a forensic accountant and paid him about $10,000 to document the $100K embezzlement.\n\nCops came back to us 33 months later and said the case was only about $100K, so they didn’t think it was worthwhile pursuing. If there are no consequences for people’s actions, what stops them from doing it?",
            "He had to have beentrying to steal or cut a bigger discount for maybe friend who was the client or something. He was nervous either way cuz his job in jeopardy, so his reaction can say a lot. if he is dumb he just gets fired, but if he was stealing, he gets fired and charged, the fact he doesnt deny the theft and just act stupid means he really was stealing and trying to be defensive to the point he was distracted which admission would be better.",
            "[deleted]",
            "I was a manager of a liquor store. The shop next door was a TAB (betting agency in Australia)\n\nI got a promotion to head office. When I was advised I was getting promoted, I tried very hard to get my 2IC promoted to manager. He'd already worked there for years and had just gotten married. He was not the brightest spark, but honest, hard working and never took a day off. I pitched him hard to the area manager. They declined and brought in a new guy. I worked with him for a week to help him learn the ropes and he constantly complained about everything. He also thought he was smarter than everyone - very egocentric and cocksure. \n\nA few months later I was in a meeting with the same area manager when he got an urgent message - he had to go to the store NOW. \n\nTurns out the new guy had a gambling addiction. Instead of putting money in the safe, he put it on a \"sure thing\" on the TAB next door. When the sure thing failed, he took double the money to get it back. That failed too, and then the next one, and suddenly it was time for the armoured car guys to be collecting money form the safe...but the safe was empty. Maybe 15K money missing.\n\nYeah, he was fired. May have gone to jail too, never heard of him again after that.\n\nOh, and guess who they picked for new manager? My old 2IC. And he did very well, and was there for years.",
            "What is ACCOUNTING's job? To be sure that numbers not only add up, but also are made up of just the right combination of cost and profit.\n\nWhen someone from ACCOUNTING questions the numbers on paperwork you submit, it's my humble opinion that you'd better explain it all to them and that they'd better agree with you.\n\nI've had arguments with ACCOUNTING people, but it's been because I was right. Chad was, indeed, too stupid to work there... because he was trying to steal and because he thought he could get away with it.\n\nSomeone else here says \"when someone asks 'are you sure?'\"... reminding me of a post somewhere on this site to the effect that when the driver of a concrete truck pulls out a blank contract for you to sign because you insist on having him do something that he advises against... you are about to be in BIG TROUBLE!",
            "Good story, thanks for sharing! I have one I think you will appreciate. I work for the government executing contracts. One of my tasks is to ensure we receive products and approve payment for those products. I noticed a contractor wasn’t billing enough and it would be a bigger accounting issue the longer it went on. So, I reached out to him and finally he answered after several attempts. I explained the issue several times but he wasn’t listening so he wasn’t going to fix the billing. Finally, I said, “Ok, I’ll call the person who signed your contract and ask her to modify it for $5,000 less, per this discussion.” He said, “Wait, WHAT?!” Finally, I had gotten his attention. As a bonus, after that incident, every time I called, he took my call and we had a productive conversation. I even had to call him again for under billing, haha.\n\nEdit: Spelling and grammar",
            "Having him sign the invoice was a smart move called \"CYA\" Cover Your Ass",
            "Isn't like the number 1 rule of embezzlement to make sure someone else's name is on the paperwork so they take the fall instead of you?\n\nBrilliant strategy for him to sign it.",
            "Lost his job over a lowly $100..actually over a lowly $50 since he was splitting it with someone else.  That's pretty stupid, too",
            "Our CFO paid for her wedding on the company credit card. Around 30K. \nWe fired her but never tried to prosecute her.",
            "Once worked at a plant that made snack foods. Saw a fellow get fired for throwing two cases of product over the back fence , in plain view of the security camera he knew was there, to pick up after work. So he lost his job, threw away over 15 years of seniority, and no reference over about $25.00 of snacks. Could not believe the stupidity.",
            "[deleted]",
            "[removed]",
            "Ah fellow CMA bureaucrat/accountant. Never approve or push through something you feel is wrong, always ask the question and make sure those that approve of the error sign off on it. That way our ass is covered. \n\nProject managers, in my experience at the place I do financials, hardly glance at their paperwork before sending it to us. We send it right back and make them do it right. If they don't, they damn well better sign off on it.",
            ">I stood as well, not liking to be the only one sitting\n\nI like you",
            "I replaced a girl who worked for her boss for 25 years as her Assistant.  The boss started going blind and the assistant took advantage of that and wrote cheque’s for herself that the boss signed, trusting the assistant.  The boss couldn’t see the cheque’s clearly.  When the boss hired an outside accountant, and auditor, it was discovered that over $30,000 was stolen.  I was hired to replace the girl and I instituted an online accounting system that the accountant could log into and the boss could to with her large type monitor to get reports and view cheque’s before they were printed.",
            "[removed]",
            "When i worked fast food there was a manager who got promoted to 2nd assistant to the bm which was surprisingly well paid. He got sacked a few months later for skimming the tills every week or so. In total he got like 2--3k or something. Criminal record and losing a decent job for less than 10% of his salary lmao. Its crazy the risks people take for such a small prize",
            "[deleted]",
            "When someone complies after repeatedly asking \"Are you sure?\" followed up with a \"Can you sign this?\" and/or \"Can I get that in writing?\", they're not helping you.  They're providing rope.",
            "I worked at a fast food restaurant with big arches. The night manager was doing cash refunds & pocketing the cash. Got caught cuz he got greedy & was doing more returns than sales. Greed makes people stupid",
            "When you say fire them are you referring to Chad and the other guy at Tex? (not yourself as it sounds over the phone)",
            "Read a story once about a juvenile justice kitchen worker stealing $1.2 million dollars worth of fajita meat. The food service delivery called the department kitchen to say they were delivering an 800-pound order of fajita meat but were told they didn’t serve fajita meat there. \n\nAfter confirming that they had in fact been delivering fajita meat there for the last 9 years, they fired the kitchen worker and searched his place to find evidence that he had been bringing the meat home and reselling it the whole time.\n\nHe got caught because he had taken the day off on the same day the delivery was due to come in. He received a 50 year prison sentence. \n\nHe got caught slipping. He said it started small and it just got out of control. Got to be more careful, but being honest is even better then you won’t have to worry about your trail of lies.",
            "I hope you missed a bunch of zeros in the \"100$\", otherwise this looks so bad.",
            "I feel dumb that I’m having trouble understanding – but what was his intention to reduce the amount that you guys were charging, and then split the money that Tex’s company saved, but it was just stupid carelessness that he tried to bill a negative invoice? Or was the negative invoice intentional?",
            "Did your boss go to the police with this crime?",
            "Fascinating. I thought it was just a mistake. \n\n&#x200B;\n\nI always say: \"never overlook garden variety incompetence.\"",
            "How did the boss correctly conclude Chad was embezzling money with the assistance of Tex's accountants?",
            "I used to work at Subway and my manager was really shady. She used to do little stuff like leave herself clocked in for 2-5 hours a day and have someone else clock her out to make her hours. But then it got really sketchy when I started witnessing her take the cash pouch in the bathroom to “count” the cash every week. It was obvious she was stealing, so my coworkers started stealing from the cash register during every shift too. Probably around $50-$100 per shift which added up. I eventually went to the district manager and reported my general manager but nothing my came of it (and warned my coworkers beforehand). Sure enough, it turns out both my general manager and the district manager were embezzling money from a few subway locations owned by the same owner. They ended up embezzling well over 30K.",
            "— Please, sign your name in this piece of evidence that you're trying to steal money from the company.\n\n— Sure.",
            "Former CFO of my company used company funds to pay his house electric bill. We're in Texas,  and he had a big house, so it was probably fairly hefty - $200+. But when he was caught, which of course eventually happened, he lost a 6 figure job, stock options, and all his other perks so he could save 2-3 grand a year on electricity. What a maroon.",
            "I’ve never let anyone talk to me that way in the work place. What is that all about ? I wish a man would tell me to get out of his space. How are you able to allow that?",
            "Biggest twist is that this wasnt incompetence",
            "There will always be people who are desperate\nOr just think they can get away with stealing\nThat is why there is separation of duties in most companies. The person who reconciles the checking account is not in Accounts receivable.\nNo matter how good your accounting and finance areas are, there will always be some one or a Group of people who will try to steal. Most corporate thefts come from employees.",
            "I also would have stood up so as to avoid being the only person sitting. Made me laugh",
            "Are you sure it was the first time? Sound like he just got sloppy.\n\nA first timer would have spooked when they got caught, but someone who was doing it regularly would have already spent the money and be more scared of having to abort.",
            "If he knew what he was doing was illegal why did he initial the evidence?",
            "Worked for a large US manufacturer of printers desktop and laptop computers. I worked the graveyard shift supporting our commercial printers. One morning as I was leaving several police strolled past me into the laptop devision and arrested four customer support reps. Seems they had a bright idea to ship a pile of replacements all to a vacant house and split the proffit.",
            "I usually don't nitpick at stuff like this, but you mistook \"loose\" for \"lose\" multiple times and this particular mistake happens to be a pet peeve of mine, so apologies if this comes across as insensitive.\n\n\"This cap is too loose. Can you please tighten it?\"\n\nvs\n\n\"I'm going to lose this game if my luck doesn't change.\"\n\nHe was going to lose money, not set the money loose.",
            "Nice",
            "It's always Chad.",
            "*lose\n\nI miss the old reddit that would crucify your ass for that.",
            ">Chad stands, as does my boss. I stood as well,  not liking being the only person sitting.\n\nIt would be a boss move to remain seated and calm though.",
            "So, speaking from painful personal experience, Chad is lucky to have been caught and fired.  If you do it \"right\" it goes on for a few years until a random invoice inquiry while you're away on vacation catches you. At this point you have embezzled over $250k and get to spend significant quiet time as a guest of the state.",
            "Chad's a  douche not doubt. What I don't get is how the Chadster thought it would be a good idea to jeopardize his job for a whopping $50.",
            "For $100? That much was wasted just trying to figure this out.",
            "At least chad got a free computer.",
            "Wait, all this for $100??",
            ">Boss- you’re fired. Get your computer and leave.\n\nThis job has people using their own personal computers???",
            "[removed]",
            "I made the whole movie in my head. Loved this!. I can picture Chad too, backwards hat and all.",
            "Whoops!",
            "[deleted]",
            "Family legend says my father got a tattoo that read “born to loose” and had no idea it was wrong until my mother laughed.\n\n\nGood times.",
            "I actually would like to tight $100.",
            "They already suspected something, hence why they were running it thru at low numbers because it would be easy to hide a overage and still look right. It was a trap. Chad jumped in ass first.",
            "Leaving a nuclear power plant you have to exit through a radiation monitor portal. Usually stand there for a five count and you’re on your merry way.  They’re right next to the security office. \n\nSecurity officer hears one go off. Looks out and the person is doing a recount, like they’re supposed to, but they’re also hanging their backpack outside the portal. They pass the scan. \n\nSecurity officer goes out and tells them they need to rescan with the backpack inside the monitor. Guys starts getting nervous. \n\nTurns out he had lifted a bunch of tungsten welding supplies. Very low radioactivity, not required to be controlled (you can buy the same stuff at the hardware store), but enough to set off the portal monitors when you have a mess of them. \n\nBanned from ever working in nuclear again, anywhere. Adverse entry on file. \n\nHad him come pick up his last check the next week. Had local law enforcement waiting for him.",
            "Very wise of you to wait until he was finished speaking.",
            "How the hell did he get a job with a cash register after trying to embezzle?"
        ]
    },
    {
        "post_id": "unfxu2",
        "author": "None",
        "title": "Panera pays for over $120 of food instead of just an orange juice",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/unfxu2/panera_pays_for_over_120_of_food_instead_of_just/",
        "score": 17709,
        "num_comments": 349,
        "created_utc": 1652292184.0,
        "selftext": "Back in 2019, I was meeting up with a bunch of my extended family who were all attending the same wedding.  \n\nAs a nice gesture, I decided to pick up lunch from Panera Bread (think soups and sandwiches) for everyone.  So I take orders from about 15 people, pick up the order from Panera and make my way to the hotel where we will eat.\n\nAfter we arrive and start eating I notice that I am missing an orange juice for my nephew.  I call the Panera and explain that hey I never got my juice, could I get just the juice refunded?  Mind you this is an over ~$120 meal and I'm just trying to get a few dollars back for the orange juice I didn't get.\n\nThey say they are not allowed and give me another number to call.  So I call the corporate number and explain the situation.\nThey say they aren't allowed to do partial refunds, only full refunds.  So to clarify I say \"you won't refund the missing orange juice but they can refund the whole order?\". Yes that's correct.  So I requested a full refund (two phone calls plus the waiting) and it was granted immediately.\n\nThanks Panera corporate!",
        "permalink": "/r/MaliciousCompliance/comments/unfxu2/panera_pays_for_over_120_of_food_instead_of_just/",
        "comments": [
            "Nice now you can get a whole bathtub of orange juice",
            "As someone who was a manager at Panera in 2019, I can confirm those policies. Did they not offer you vouchers?",
            "I work with resturant point of sale. Partial refunds can get very tricky. Because it's a whole seperate credit. You are making a new transaction rather than just telling the bank to reverse a bad transaction. It is a whole layer more of work to set up and manage. \n\nThere are also banks and credit unions that don't allow partial refunds without some extra hoops, or without having the card present, for example. \n\nIt is really silly. But some times it is easier and cheaper to give a customer a $120 order than spend a bunch of time effort and money, for the luxury of being able to find their card info, store it securely, then make an entirely new transaction without the card present just to give them back $4. \n\nIn fact, the ability to do partial refunds is a huge selling point for the software my company provides. I have seen store owners' mouths water at the mention that you can, with a button press, give someone $5 back on their $100, without being able to also give them $5,000 back as well.",
            "A few times I’ve been at a fast food place where they made a mistake and had to give me a partial refund. Each time I paid with credit, but they refunded me with cash. The issue with partial refunds explains why. Thanks.",
            "I once bought an expensive goose down duvet at a department store. When I got home I realised that they had somehow processed the transaction *as a refund*. So I had the duvet and several hundred euros. I emailed them to explain and ask them how to sort it out but they could not figure out how it happened or how to reverse it so they just told me to keep it 🤷‍♂️",
            "The most incredible part of this post was that you were able to feed 15 people a decent meal at Panera for only $120. I considered getting some mac and cheese from the one on my university campus for lunch today only to realize a small cup would cost me $7+ AND I would still need to pay for a drink.",
            "I went to a gas station and had to pay inside, in advance. I asked for $50 but the tank only took $45-46. A few days later the pre-auth went through for the full amount, $50. I emailed and explained the situation, said I was owed somewhere between $4-5, not even expecting a reply really - and got the full $50 refunded!",
            "$120 for 15 at Panera? Did everyone share just the one sandwich?",
            "And now you can afford an actual LARGE SIZE glass of OJ.",
            "What kind of PoS can’t do partial refunds the day of? Usually a system can’t do that if the order is week(s) old. Weird",
            "I've been eating at St. Louis Bread Company/Panera for 30 years and that place has had some of the most fucked up policies over the years. They went for a decade at least not being willing to make a fucking sandwich without onions. The refund thing is just nuts because they always mess up your order, every time! Sorry I just needed to vent.",
            "I’ve gotten plenty of partial refunds in the past. But now I’m bummed I never got my full order refunded. I guess I gotta start eating at Panera.",
            "In retail if you haven't settled the batch of charges for the day you can just delete the charge as it hasn't processed until then. Maybe it's just part of their system that makes partial refunds difficult- could be on purpose for some reason. I don't have a restaurant but if someone returns something that they charged to a card, I just hand them cash. Not worth the processing expense of a credit on a card.",
            "An order for 15 people only costs a 120?! I spend half that every time I go there for my family of four lol. I’m pretty sure I blacked out and spent 73 at Taco Bell. Maybe I should calm it down a bit",
            "When Panera first opened, their quality was great, customer service was great, and they had a line out the door where I lived at the time.\n\nOh how the mighty have fallen.",
            "This isn't malicious compliance. This is just following the company's policy that they told you to do.",
            "Same thing happened to me. They missed one soup on an $80 order so they refunded me the whole amount….in expirable store credit. So I had to buy a hell of a lot of bread.",
            "Orange you glad you called corporate?",
            "Not a bad outcome. Usually they just tell me they'll put me in \"the book\" and I can get whatever drink I want next time I go in, they say to just ask for the manager.",
            "That’s petty and stupid.",
            "Nice try stealth Panera, trying to get people to pull this then giving them the partial refund, sticking them with the $120 of food they didn’t really want.",
            "I paid like $3.45 for a regular sized sprite soft drink when $1 larges were right up the road @ mcdonalds. I still think about that day.",
            "As a previous F&M Manager for Panera, the store should have just given you the OJ/Voucher.  There’s no way I would have refunded an entire order over an OJ.  Hell, my catering team wasn’t busy, I may have even offered to send one of them your way with the OJ.",
            "Orange you glad you called them?",
            "Sounds like Skip.  Their HD will refund you right away without asking questions",
            "I get missing thing from Panera all the time due to the people coming and going, and the frequency of my orders (never the same thing). They are happy enough to give me a credit on my Panera account. I actually really like the way they handle things too. I'm happy you had a greater experience with them than I did.",
            "As a former employee, this is hilarious!",
            "That's not even malicious...you just followed their rules.",
            "Huh. I almost died from eating a Panera sandwich that was cross contaminated, and all I got was $30 worth of coupons",
            "There was a maliciously complaint employee there for sure.",
            "[deleted]",
            "Panera has gone SO downhill in the past decade. \n\nI remember when their French Onion soup in a sourdough bread bowl seemed like quite a special, indulgent lunch.....and yes, I would be happy to take a German Chocolate pastry for breakfast tomorrow!\n\nI would rather eat stale Rally's than visit a Panera now. My last experience there was so disappointingly underwhelming, especially for the price, that I swore I would never again darken their door. \n\nPeople, please take this newfound full refund knowledge and run this company into the ground. Maybe someone who actually knows how to maintain a successful business can pick it up at a discount and turn it around before it's too late.\n\nYou can't take an upper-tier quick service chain eatery and squeeze every possible penny out of food quality and expect to keep standing and reputation.\n\nYeah I'm salty. I miss how good it used to be.",
            "They've fixed this since because I got a partial refund last week on a BTB without the T.",
            "Has a lot to do with the way they are set up with their credit card processor.",
            "More like /r/deliciouscompliance",
            "I stopped reading when I realized this wasn't about Pantera.",
            "The only thing unbelievable about this story is the pricing. Panera is so expensive and just a half salad/sandwich combo is like $15 without a drink (this was is 2020)",
            "I worked at Panera for a long time, if you did a large Rapid-Pickup or Catering order online then yes it is only possible for that online order to be fully refunded and it wasn’t possible for them to do partial refunds on it.\n\nWhat we would do in situations like that was either include the item for free the next time the person who paid came in (or notified us they were putting in an online order), or if they were willing to come back then we could do a partial refund separately at the register. I’m surprised to hear you got a full refund on an order that big, but Panera corporate will bend over backwards for customers so it’s not that crazy I suppose.",
            "Ordered from Applebee's, drove the 20 mins home. Yes this is also my fault for not checking but half of my order was missing. I was exhausted and NOT driving all the way back so I ask they refund the missing items. They said they can't do that, they can only refund the entire check. I said ok then I guess refund it all. She didn't like that answer. I got the money back.",
            "Whoa, we got a badass on our hands.",
            "Panera is actually really good about taking care of customers. They always go above and beyond in my experiences.\n\nI don't know anything about what it's like to be an employee though.",
            "I'm sorry to say this but that doesn't seem true unless you got lucky. I ordered food from Panera for delivery and I had one of my food items missing(Paneras fault not the delivery drivers fault). I called the store and they couldn't do refunds so they had me call another number for corporate. They refunded me just for the missing sandwich.",
            "[deleted]",
            "Now I want OJ…..",
            "Panera fucks up so often that they even fuck up the refund.",
            "Haha used to work there, fuck em all.",
            "My daughter's 1st job was with Panera and & I was so happy to learn that any leftover bread was dropped at a local food bank every night.  Yay!",
            "Honestly? Good. I worked at Panera ages ago and it was the worst job I had ever worked. The only job that had me come home and just cry because of how cruel upper management treated us. I don’t know if it’s still like that today and I hope not but I still detest Panera for making my life hell for those 1.5 years I worked there.",
            "This is why I just paid $12 for a quarter of a grilled cheese sandwich, a cup of tomato soup, some dry baguette, and a bland muffin?",
            "I just had this happen with Little Caesar's. I ordered a stuffed crust pizza and found it was normal, called and asked for them to refund the $4.00 and they said only full refunds or replacement. So they put my name on a list and the next time I call that location they will remake that one for free.",
            "The craziest part of this story is that for 15 people, you were able to buy them meals totaling at only $120 and change. The last time I went to Panera Bread (oddly enough, last week), the only thing priced decently was coffee (though half the coffee thermoses were cold) while sandwiches are approaching $10 a pop unless you’d rather eat a slice of cheese on toast and ware egg tomatoe soup.",
            "the guy on the phone knew exactly what he was doing",
            "Not malicious lol but they told you to do it so why not?",
            "I cannot eat Panera after seeing the conditions of their kitchens.",
            "They're banking on nice people letting them keep the orange juice money so they're not \"stealing\".  I'll bet it works often enough.",
            "Customer service means more to them than 2 bucks. They likelihood of you returning is now guaranteed, plus your family too. Great businesses understand this",
            "[deleted]",
            "The refund of one orange juice is a completely manual process, with almost no paper trail and will usually not be accepted nor allowed by any SOP.  \n\n\nThe refund of the entire order has proper paper trail, and is classified as an \"incorrect order\" and written off. As odd as it is for you, there's no way their internal process will let people randomly refund that $2 without massive amount of work. To them, giving you $120 of free food is easier and costs less than allowing random $2 refunds.  \n\n\nAnd now you freely gave them advertising.",
            "This is a good story, but it's not really Malicious Compliance\n\n> Malicious compliance is the act of intentionally inflicting harm by strictly following orders or rules, knowing that compliance with the orders or rules will not have the intended result. The term usually implies the following of an order in such a way that ignores the order or rules's intent but follows its letter.",
            "oh this is beautiful. \n\nNice job.",
            "Wow that is beyond stupid. Awesome for you though! Well done.",
            "[deleted]",
            "this is kind of in line with a trip I had to IHOP with 5 or 6 co-workers/friends. \n\nWe waited to be seated for more than an hour cuz of a large group squatting the whole time. We saw a group of 3 come in, sit, order, eat, and leave before we ever got sat.\n\nEventually a bus boy sits us in an unopened section and his girlfriend waits on us. get food and everything. everything was great. she was great. \n\ncome bill time i ask if i can get a discount for the hour long wait and she says she'll ask the manager. she comes back and said he said no and that we shouldn't even have been sat where we were. i asked if she could get him to come to the table. he's pissed. I just wanted a small discount for having to wait an hour. He tells us don't worry about it, in a very rude tone. so we got $100 worth of food for free. i just wanted like, the drinks for free (like, $24 or so). Talked to the one that sat us and his girlfriend and they said everyone hates him (manager). \n\nWe tipped her $50 between all of us.",
            "How does the missing OJ go unnoticed all that time? Unless it's the bottled type and assumed to be in one of the bags.",
            "Damn, Panera's customer service is pretty great then",
            "Ubereats. Complain about one thing and you get your whole order refunded. Just throwing that out there.",
            "As someone who used to work at a Panera, I'm begging you please please please don't eat there. Their food is disgusting.",
            "Yes, assuming you paid with a cc/debit card. They cannot just cancel the oj portion of the bill. They would need to void the entire bill and re-ring up the entire thing - the oj again. \n\nI won't have just mailed you some coupons or something.",
            "I doubt that hits the bottom line of the particular outlet you used, but I'd be interested to know if somehow they were notified.",
            "#you now have a fresh squeezed future",
            "I would not have told my family and taken them out again like “yeah i’m a baller, shot caller!”",
            "All while your nephew starved.\n\nHe's still waiting for some juice, poor guy...",
            "And this moronic bureaucracy is why large corporations go under.",
            "It's okay...bread and soup there costs them only $0.35 a serving. The drink actually costs them the most.",
            "I got a Starbucks drink and  asked for an extra topping but never received. Only realised by the time I was halfway home on the bus so i emailed support and they refunded me the whole drink drrather than just the extra topping as I had requested",
            "Same with Dunkin really, franchises can't do shit after the payment goes through. They don't have it in stock oh well but contact the 1-800 and they usually credit you",
            "Perfection.",
            "A dumb policy that could help destroy a business",
            "Wow. I’ve recently become obsessed with their broccoli cheddar soup so it’s like you’ve struck gold lol",
            "Same thing happened with me and DoorDash. Almost felt bad for taking the refund",
            "i’m surprised they didn’t give you a coupon or gift card with maybe like $10 for the inconvenience",
            "And then you went and posted your good experience with their customer service on Reddit. Not sure this is MC but it is definitely the positive word of mouth their policy hoped to generate",
            "If their business model sucks, that is on them, not you. If your common sense sucked they would exploit that, so go for it.",
            "Best forgotten orange juice ever!!",
            "Can confirm... Panera gives partial refunds. I left a shitty review and survey last week and they refunded half of my order. Now, the story doesn't say when, perhaps there were some limitations in the past b",
            "Knowing myself, I would of just take the L and forget about it.",
            "They probably won't feel that, but you def feel it right back in your pocket.\n\nBeautiful!",
            "Not really malicious compliance, but once I got a wrong delivery through DoorDash. I ordered one menu, but received food for a whole family. I messaged them about it just to let them know, because someone will be missing it so they could start another order a bit ahead of time hopefully.\n\nThey asked for proof, I send them a picture of the receipt on the bag, and they said thanks and refunded my entire order without me even asking them to do so.",
            "Nice!\n\nAnd that is crazy!",
            "What kind of absolute lunatic Karen calls, not one,but two different numbers to get a refund for a dollar out of a 120 dollar order. \n\nThat’s absolutely mind boggling to me",
            "Way better than my experience of “oh your order was messed up, I’ll get some vouchers in the mail for you, what’s your address?”  And never seeing those vouchers 😂",
            "Yeah ran into something similar recently. They forgot a beverage in our order when it was delivered and wanted me to drive to the fucking store for a refund. \n\nA refund for a delivery order, placed directly through their website. That we didn't place in store. \n\nI think I settled for a bad review somewhere, but I'm still pissed at Panera's policy, I mean seriously, is it that big of a deal to refund a fucking beverage that they forgot to provide? I can't imagine that they could have missed the fact that it was probably still sitting on the counter in the store getting warm. SMDH.",
            "For 15 people that order shoulda been well over 200"
        ]
    },
    {
        "post_id": "g4umd5",
        "author": "EDUSTA",
        "title": "You want to kick me out of my hospital workstation room that I prepped for the day?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/g4umd5/you_want_to_kick_me_out_of_my_hospital/",
        "score": 17693,
        "num_comments": 303,
        "created_utc": 1587395746.0,
        "selftext": "I am a radiology resident and luckily the facility I am working at allows for each resident to be separated in individual workstation rooms for reading imaging. This morning I grabbed one of the rooms, spent awhile cleaning it all up to make it safe for me to spend the day in. Another resident, who showed up late, came in the door and demanded that I leave the room because it was “assigned to him.” I chose the room because I knew the dictation microphone didn’t work so all reports would have to be typed and I was on a rotation that was light on volume, so it wasn’t a big deal to type the reports for me.\n\nHe started to squeeze his way in/box me out and because of his persistence I let him. I packed all of my things to head to a different room, got up and headed out the door. Right before shutting the door I told him, “oh by the way, the dictaphone doesn’t work in this room.” \n\nAs I sit here typing this I am watching him read case after case (which he has to individually type), meanwhile, I have spent the day studying and relaxing in my new (cleaned) room.\n\nEdit: No, the room was not assigned to him.",
        "permalink": "/r/MaliciousCompliance/comments/g4umd5/you_want_to_kick_me_out_of_my_hospital/",
        "comments": [
            "The perfect malicious compliance.  He should have already learned that you don't treat your co-residents that way.\n\n&#x200B;\n\nYou reap what you sow;  when he needs last-minute coverage, nobody will be jumping in to cover him.",
            "I think that resident might be a bit of a wanker.",
            "As a Tech in a hospital, this makes me smile. He sounds like the type of person that would demand a new mic, but we don't have spares because Dragon mics are expensive! Side note: We have a few for nice providers :)",
            "And after his little hissy fit, I bet he's too darned stubborn to get a different room, right?",
            "I’m surprised you aren’t working from home. Of all the specialties Radiology is the easiest to do remotely assuming you have the capabilities to remote log in.",
            "Cool, now you can let everyone else know that he said that is his assigned room and make sure that he gets that room every day. I mean if it’s assigned to him he should have it then maybe he can enjoy his broken Dictaphone for a while longer.",
            "A perfect malicious compliance, thank you for not inflating it with back story nobody needs and two paragraphs assigning people aliases that are only mentioned in one line anyway.",
            "Nice one!!",
            "For these situations I go with overly helpful confusion. \n\n“Oh sorry, I didn’t get the assignment sheet. Could you send it over to me? What? You don’t have the sheet? Is it on one of our chats?” \n\n“Well, I would move to another room but that would be silly without knowing where to move to. You saw the room assignments, where can I find it? It really should be available to everyone, don’t you think? It *does* affect everyone after all. Look at us I cleaned the *wrong* room and now you will have to clean it from my germs, and I might go off and clean another room assigned to someone else. Not to mention the time we are wasting right now discussing it. No really, something .................. about.......... We should ............ and then .......” \n\nEventually the person usually figures out it just wasn’t worth it to keep going.",
            "You should’ve ripped a huge nasty fart in it before you left",
            "He squeezed his way in?!  That seems very aggressive!  Are there possible repercussions for this?  Nice move on the dictaphone.",
            "That guy is a douche and corporate America will promote the shit out of him.   People like that thrive on shitting on coworkers, and bosses love that shit.",
            "You acted professionally. Most people make the rookie mistake of trying to convince them to give you the room cuz the mic doesnt work. You let him settle in and take the room before letting him know. I would have not told him at all about the mic and let him figure it out himself.",
            "That's a good one.",
            "[deleted]",
            "He's a definite jerk wad.  Love that you told him as you left that the dictaphone didn't work.   Hope you did a little finger wave at him periodically during the day.",
            "Love it!  I would have let them figure it out for themselves, but then they could have accused you of sabotaging them.",
            "Powerscribe mic 3? Those are breaking a lot lately because rads are wiping everything down and getting hand sanitizer in the mic. The mics can be used if you put them in a glove.",
            "You’re a special kind of evil. I fricken love it hahahah",
            "I would go to HR about the intimidation.",
            "Be wary of ever trading call with him. Is he the sort of person who'd have you take his call and then come up with 101 excuses why it is never convenient for him to repay the favor?",
            "I used to work in an electronics store. We used to have people coming in asking for a dictaphone all the time, so I gave them your colleague’s number",
            "Ya'll need an upgrade! Dictaphone?! Holy mackerel you're dating the gear ;).",
            "You sir, or madam, are a trooper!",
            "Holy... I just can't figure out why 🤔",
            "Thanks for you service",
            "This is making me weirdly emotional",
            "The guy that took the room is the dictaphone for the room. With a capital DICK.",
            "Oh that must have felt so satisfying.",
            "He probably had something hidden in there. Why else would he want that one specifically",
            "The headache that guy must've had at the ever if his shift must've been horrible and he deserved it. What a dick.",
            "Hospital staffed by people this petty about whose room is whose, with broken equipment to add",
            "Ha",
            "We need a followup!",
            "happy cake day! Enjoy some Lo-Fi :)",
            "Her husband sounds like a waste of hospital beds",
            "I would have farted before I left the room.",
            "OP I'm a young M2 and I love your evilness.",
            "They not tell him to pound sand?",
            "feels like shit man just want him back",
            "Hahaha he did it to himself!",
            "Good to see you darkroom kids are dicks to each other and not just to is surgeons",
            "I wouldn't have told him. Let him get settled and find out the hard way. After all, if he didn't know, maybe you didn't either.",
            "What's a dictaphone?",
            "Get your hospital to get on the PowerMic Mobile app for dictations - allows you to use Dragon from your cell.",
            "Sometimes the Good Lord just smiles upon you.",
            "Great and all but............you're still a pushover",
            "Was the room really assigned to him?",
            "Sounds like a typical resident to me. You, however, might have issues. 😄",
            "Damn I thought this said underwear for a moment",
            "Where is “all of the magazines.",
            "Bravo! What is the male equivalent of a Karen? lol",
            "ME GUSTA EDUSTA",
            "People who don't respect room assignments are the worst.",
            "Was it assigned to him, though? If so, you should have done your due diligence in making sure you didn't commandeer and clean a room that was already assigned to someone else.",
            "What annoys me the most, is that you let him push you out.",
            "I unsubscribed from /r/Instagramreality",
            "Well, was it assigned to him?",
            "Not that the other person wasn't a douche canoe but if there are assigned rooms then why are you just picking the room you want? Didn't you have an assigned room too?",
            "What part of this is malicious? All you did was comply."
        ]
    }
]