[
    {
        "post_id": "j5kwxn",
        "author": "Khromez",
        "title": "Lock the door if we arrive 5 minutes late? Ok!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/j5kwxn/lock_the_door_if_we_arrive_5_minutes_late_ok/",
        "score": 17691,
        "num_comments": 515,
        "created_utc": 1601909987.0,
        "selftext": "So this story is going to be very short, as it didn’t happen to me, but to a fellow professor last year.\n\nLast year, the university I teach wasn’t particularly strict on attendance. The only thing not attending would get you was a call asking if you want to keep paying for the class if you’re not using them at all. (there are no refunds, but they could sign you out midway through so you didn’t pay extra).\n\nAside from that, it was up to the teacher to control how they wanted attendance to affect their class. This one professor decided to be incredibly strict about it and the students hated him for it.\n\nHe would physically lock the door once 5 minutes passed, and would not open it again for any reason whatsoever. If you were 5 minutes late, you lost that lesson. Some students started sitting on the hallway and talking notes while looking through the glass doors when that was an option.\n\nOne day I arrived to teach my lesson and all the students are gigly and happy. It just so happened that the professor himself arrived five minutes late that day, and the students locked him out of the classroom.\n\nFor an entire hour.\n\nI suspect he was too embarassed to ask for a key and in the process having to admit why he was locked out.\n\nNeedless to say he never locked the doors again.\n\nEdit: I guess I should have mentioned it in my post, but I was reminded of this story after reading another post in this sub. This happened around may of 2019 and at the time it was very minor so I forgot about it until today.\n\nEdit 2: english corrections lol\n\nEdit 3: More english typos. I didn’t mention in the post that it wasn’t my first lenguage. I teach calculus in spanish, and portuguese is my mother tongue so english is a distant third lenguage. Sorry if anyone got confused by that!",
        "permalink": "/r/MaliciousCompliance/comments/j5kwxn/lock_the_door_if_we_arrive_5_minutes_late_ok/",
        "comments": [
            "That was my speech professor’s policy too. He coupled this one with a strict attendance policy. We couldn’t miss more than three classes, but we were considered absent once he locked the door.",
            "Brilliant!",
            "[removed]",
            "Reminds me of a stats professor I used to have as a sophomore in college. The class was split into lecture and \"lab\" sections.\n\nLab was basically 80 minutes of doing lots of arithmetic by hand, designed to be long enough that most people wouldn't be able to finish in class and the rest had to be done at home and handed in next lab if needed.\n\nI happened to be extremely fast at simple arithmetic due to some natural proclivity, and having going to an elementary school where we were drilled hard and often on it.\n\nSo it took me about 30 minutes to complete. I handed it in and walked out silently.\n\nHe stopped me and asked me where I thought I was going.  \n\n\"I'm done, so I'm leaving\".\n\n\"Lab time isn't over though, do the work again\"\n\n\"No, I did the work, I get the material, and I'm leaving\"\n\n\"You need to redo the work\"\n\n\"No, I don't. I did it. The syllabus doesn't require that I sit in here for 80 minutes, just that I complete the labs. I'm paying for this class, and there is no value in me redoing simple arithmetic that I clearly know how to do.\" And I left.\n\nNext lab he gave me the paper with something like a 98%, and told me I probably would have gotten 100 if I redid the work.\n\n\"What was the top score?\" \n\n\"98\"\n\n\"Good enough for me\"\n\n\"That's a terrible attitude, what if this were real life and real people depended on these?\"\n\n\"Then we'd be using doing this on spreadsheets or something?\"\n\n...\n\nProfessor Tucker (though we didn't call him that) and I did not get along at all.\n\nHe even tried the same garbage on my final...  3 hours to do an hour of mostly rote arithmetic. Yes, I double checked my work, twice, that's why it took so much longer than normal.\n\nWhat if you missed something because you were in a hurry?\n\nDude, I could get a 0 on this and still walk out of here with a B, before the curve. I'm fine with the results.",
            "I turned up 5 minutes late for a new class when I was at college. As I walked in the lecturer looked at me, looked stunned and bellowed \"YOU! IT WAS YOU WHO GOT MY DAUGHTER PREGNANT AND RAN OFF!\"\n\nThen a moment later, calmly, \"oh no, my mistake, he was much taller. Welcome to the class.\"\n\nHe turned out to be one of those awesome teachers who would go out if his way for you and give us really unusual and interesting lessons including afternoons out around town teaching us some local history. Just don't mess him around, it was his way or the highway.",
            "When I started uni I had my economics professor who used to lock the door even If we were a minute late, once she made me in charge for making sure that all students had received the study material for her class. Guess what I was 3 minutes late for class and she locked the door, I kept banging at the door but she wouldn’t open it. So I took the original notes she had, and bunked her class for the entire semester(my college didn’t monitor attendance that much). She had to remake 1000 pages worth of new notes for the entire class. Moral of the story - don’t be a bitch to someone who has the original copy of your notes that are gonna be used for an entire semester.",
            "I also had a professor that did this only we didn’t have the 5 minutes. His class was required to obtain my degree area. He taught it at 7 am 5 days a week and you needed to be there by 7 or were locked out. One accepted absence only. \n\nI remember trudging across campus in the dark and snow watching my friends headed home doing the obligatory walk of shame, lol. \n\nThis professor also ran a consulting business in my degree area, and our projects were all on copyrighted forms owned by him. He maintained the right to utilize any of our submissions/final project in his own business. That always chapped my hide, personally.",
            "Attendance grades in college shouldn’t exist in the first place. The punishment for missing class should be me not receiving the lecture, which in turn should effect my grade. If I can get an A in your class without even attending then why am I even paying you?",
            "Used to teach organic chemistry. In general, attendance isn't really a thing for regular lectures and seminars at our university. Lab work is different, you get your lab hours and either you're there or you fail the lab course, but that's just because we have limited lab space.\n\n\nI only ever cared about people understanding the material. The lectures, seminars, problem sessions, office hours, worksheets and the book are all just opportunities to get to that point, and I think someone who has graduated highschool ought to be trusted to be able to decide themselves what works best for them. Attend everything and take vigorous notes, but never open the book? OK! Go only to the exam and the labs, but read at home? OK! As long as you learn it, I don't care how. And I don't understand teachers who do.",
            "I had a professor who would ask people to leave if they showed up even a minute late. \n\nThe first time it happened to me when I walked in like 30 seconds late, I gave her an “are you fucking kidding me” look and walked out. \n\nThe next time, she said “HomemadeBananas, you’re late!” And I said “I know,” and sat down. She talked to me after class, and I explained my bike had a flat tire causing me to be late, still only slightly, and she still tried to argue, but I don’t remember her ever doing that again to anyone.\n\nI don’t get it. It’s like they’ve never had someone stick up to this ridiculousness, and they cave at the first resistance to their power trip?",
            "This teacher must have never had a student as petty as them.\n    \n    \nWanna lock the door? Guess what? Since I can't get into the class I'm gonna stand there and keep knocking loudly on the door for the whole class period. Enjoy lecturing over someone knocking on the door in various patterns all class period.\n     \n     \nLets get some University security involved in this. I paid for the class, I'm gonna be there. The department head is going to for sure hear about this shenanigan's.",
            "Mine doesn't have a happy ending, but I had this one absolutely ridiculous professor... He made it clear at the beginning of the class and in the syllabus that if you missed three classes, you were dropped from the class regardless of excuses. I had a friend who emailed the prof before the semester started letting him know that he would have to miss the first two weeks (4 classes) and asking if that was okay - professor refused him. The reason my friend was late? They delayed his return trip from Iraq. Fuck that teacher.",
            "Jfc, it's college, you're not 12. What if someone had to use the bathroom?",
            "Isn’t that kind of dangerous, though? Like what if there’s a fire?",
            "Yeah, I took a stress management class where the instructor did the same thing.\n\nFor a 9 AM class.\n\nOn weekdays.\n\nAnd most students lived off campus. \n\nSeriously, my 1rst level accounting course was more relaxing, and strictly from a content perspective, it was the most difficult class I had my first semester.",
            "I had a prof like This, first day of class a kid asked to go to the bathroom , the prof said “sure! Just bring your stuff and don’t come back” kid left and dropped the class .",
            "I had one class first year where I either always showed up a bit early or not at all. \n\nOne day in the middle of class I got a nosebleed and had to go to the bathroom to deal with it. I took my phone because I guess it’s a habit to take my phone with me. \n\nSo I fixed up my bloody nose and went to go back to class and the doors were locked. I texted my friend who was also in the class but she didn’t see the text.\n\nI was terrified of disrupting the class even though the prof was super nice and probably wouldn’t have been mad. I ended up tugging the door a few times to clink it against the lock and the person sitting near the door heard and opened it for me. \n\nAnd that was the only time I’ve ever encountered a locked door at uni. I think the door locked automatically when it was closed.",
            ">\tIf you were 5 minutes late, you lost that lesson. Some students started sitting on the hallway and talking notes while looking through the glass doors when that was an option.\n\nFuck that. I had a professor in college who was a real dick, and he tried that shit with me, and I just banged on the door until he opened it. When he started to lecture me about how he wasn’t going to let me in, I cut him off and said, “I’m paying to be here, I pay to be taught, you don’t get to lock me out. I’m not late on purpose. If anyone can get from <my previous class location at the extreme other end of a very large campus> to here in less than 7 minutes during lunch rush hour, then they should be in the Olympics.” He started blabbering something but I just shoved past him and sat down.\n\nI remember this pretty clearly because I’m not typically confrontational but the injustice of being locked of a class that I was paying for just pissed me off to no end.",
            "OMG I did the same thing to one of my teachers. Not for an hour, maybe for like 15 minutes after they finally arrived, but still felt good to give them a taste of their own medicine",
            "I once had a professor lock me out of a classroom because I had an allergy attack and went to the bathroom to blow my nose. When I got back I had no idea why the door was locked -- no other professor at my university had ever had problem with somebody stepping out to go to the bathroom -- so I assumed it must have been some kind of mistake. As a graduate assistant, I had a key that would open all of the classrooms in the building, so instead of knocking on the door I simply let myself back in. I was a bit shocked when the professor interrupted his lecture to ask where I'd gone. When I explained, he told me I was rude and disrespectful and not to do it again, so the next time I had an allergy attack, I stayed in the classroom, sneezing loudly and wiping my nose with my hands.\n\nI knew other students that he chewed out for alleged rudeness, including one that interrupted a social conversation to alert the building manager to a potentially dangerous situation in one of the labs -- apparently politeness was more important to him than lives. As high strung as he was, I don't think anybody was shocked when he died of a heart attack a couple of years later. I don't think he was even 50 years old.",
            "Fuck teachers/professors like that. God forbid people have other stuff to do besides be to class at an exact time. I have a job that sometimes runs late, but pays for that fucking class. (Sorry I almost failed a course because of a teacher like this)",
            "A teacher of mine would leave the bin at an angle, so when somebody was late they would knock rubbish all over the floor.\nThen you'd have to pick it up with everyone looking at you.",
            "Heh, as a former professor, I would have bitten the bullet and given the lecture in the hallway. Then again, I'd never have made such a silly rule in the first place.",
            "This story reminded me of the time our prof in uni used to lock the doors... from the OUTSIDE. He'd literally ask the security guys to lock the door after 5 minutes. Admittedly a fair number of students would sneak out after attendance, but pretty much everyone found this too extreme, apparently including the HR, and after a few classes the practice stopped. \n\nHe left the university a few months later for different reasons, and again tried re-joining it like 7-8 months back. There were some students in his interview presentation (or whatever it's called). Unsurprisingly, he wasn't re-hired.",
            "There was a story from my university in the 60's about a professor who would tape record his lectures. He would show up, start the tape playing and then leave, coming back at the end of the allotted time.   \nOne day he came into the classroom to find no students. Just tape recorders on each desk set to Record.",
            "My partner had to drop out of college due to these policies. He relied on paratransit to get to class and they would never commit to getting him there on time. The professors all had mandatory attendance and wouldn’t compromise.",
            "My school had a policy that you could miss 6 lessons in a semester without a medical note. After six you instantly failed the class for that semester.\n\nThe first semester we were forced to take a few certain classes before we could choose what classes we wanted for our majors and minors. Needless to say i was not super excited to be forced into a science class when i had no intention of studying in a science field.\n\nThe teacher did NOT like me and my friend for this reason and decided to refuse us entry to the class until we \"wanted to be there\".\n\nHowever, it was clear she had no intention of letting us back in, even when we asked to return, clearly trying to run out the clock and fail us for the semester after missing six lessons.\n\nWe took our grievances to the principle and once he knew this was not our elective, and that we were being refused entry he went off!\n\nHe called the teacher into his office while we were there and chastised her right in front of us with a line i still remember today.\n\n\"You are a teacher, your job is to teach! You do NOT get to choose who learns.\"  He laid into my friend and i as well for wasting our schooling and told us to buckle down and maybe we would find a love for science.\n\nTeacher let us back into the class again and never confronted us publicly again...we did however get suspiciously low scored on all assignments, but that very well could have just been our quality and not a bias.\n\nWe didn't gain a love for science education, but we both graduated with double majors in different fields.",
            "I hate this. I'm an adult and im paying to be there. If im there a few mins late because im coming from work, cut me some slack.",
            "That’s nothing, my General Psych teacher would stand at the door and slam it shut at 1 second past start time, even if he was slamming it in someone’s face as they were walking in. I thought it was horrible as we were all paying to be there and therefore should be able to walk in a few seconds “late” and still be taught.",
            "Excellent way of handling it on the students' part.\n\nI'm chronically early (absurdly punctual parents), and I have a habit of staring & making eye contact whether I intend to or not. So I'm just imagining being the sole student allowed in and making the teacher regret his policy as I gaze deep into his soul.",
            "Haha, in middle school I had a teacher who did the same thing. Grades 6 through 8 called her 'The Witch.' She locked about ten or eleven students out of class once for being late by about three minutes. She, however, was late more often than not, and we all got tired of her bullshit. The next time she was late, we blocked the door with all the furniture we could get our hands on in the class (it required a key for both inside and out) and she ended up forcing her way through, but it was fun while it lasted.",
            "Gotta watch for those kind of lecturers though. I can see them putting a whole bunch of stuff you hadn’t learned during the semester on the exam and claiming it was the material you covered that day.\n\nWe had a similar lecturer once for a math class. If you arrived late, you got sent out. We had someone once come in the bottom door, get turned away, then try a second door, get turned away again, then try a third door at the back of the lecture theatre and the lecturer ran up the stairs and yelled in the guy’s face to get out.",
            "I had a government/politics teacher in college who used to lock the doors like this. You weren't allowed in. One of the older students (30s) climbed in through the f-ing window one day (second floor) and told the teacher he hadn't survived being overseas and shot at just to have some stuck up teacher without a doctorate tell him he can't attend classes he's paid for simply because traffic was bad that day. Student unlocked the door, let the other students in, and sat RIIIGHT in the front row making death glares while taking notes. Teacher did not lock the door again.",
            "Had a professor who didn't mind if you should up late. He realized that life happens. However, leaving early infuriated him (with prior notification, just let him know you had an appointment).\n\nOne day, ~5 people left early. He was not happy. Said to pass around a piece of paper and put our name on it. +5 points to everyone still in class on the next test.",
            "I think it’s bullshit to grade on attendance in college.\n\nIf I was a professor, I would tell the class ahead of time that there is neither a grade for attendance nor a requirement to sit in the class, other than not being disruptive. \n\nHowever, I would take attendance and gladly assist any students that needed help and attended my classes. I would provide no assistance to those who didn’t regularly attend. \n\n\nI had a friend who took calculus in high school. When he got to college, they made him take algebra 1 for his degree path. They wouldn’t let him test out of it. \n\nHe showed up for tests and had someone else turn in his homework. He almost failed the class because the professor graded on attendance.",
            "That’s pretty much theft given that you’re paying for the class.",
            "What happens if you have to go to the bathroom during class? I would be writing the saltiest email to the dean if I got locked out of a lecture (with my stuff ostensibly still in the lecture hall) for needing to use the bathroom.",
            "I don't understand why anyone would make this a policy in a university setting. The adults(!) often have a distance to go between classes, parking or public transit problems, etc. It's just a power play. \n\nIn a closed campus setting, such as high school, especially where staff are responsible for minors, it's an entirely different ballgame.",
            "My criminal law professor had a policy that if you were late for class you had to wait outside the classroom until the break to re-join the class.\n\nHis reasoning behind this was, if your gonna practice law you have to be on time. You can't show up late to a court hearing, its up to you to manage your time well enough to show up on time.",
            "Back in engineering college in India, we did this to one of our professors as well. The end result wasn't quite the same, with a few suspensions being doled out quite liberally.",
            "University professors tend to forget that they are hired by the students, who pay their salary!",
            "Your English is amazing. I’m truly impressed by anyone who can speak English when it isn’t their native tongue. 10/10",
            "I was in third year Latin and I was one of those students who was NEVER late. I was the only one in that class who was always on time without fail and never skipped. I normally got there an hour early to review my homework before a 10AM class.\n\nThen one day in winter I couldn't bring myself to get up early in freezing weather. So i caught the bus that should've got me there ten minutes early, but it was raining and we got stuck in a mile of single lane traffic. I got to class five minutes late and the professor called me out in front of everyone asking why I didn't leave early to anticipate the traffic, or walk for half an hour in the rain.",
            "That is great.",
            "Rules only work if they apply to everyone.",
            "Look at Mr polyglot here with the languages! /s\n\nGood story. Had teachers that strict. Never was lucky enough to see the comeuppance.",
            "Can I just point out that on average the posts I see with someone apologizing for their English have better spelling and grammar than a lot of people who only know English. The apology was the first thought I had about OP not being a native speaker.",
            "When my mom was a girl in Catholic school (50s), there was a nun who would do that. And the day she was late and got locked out. No one in the class would admit to locking the door or ratted anyone out. She still laughs when she tells that story!",
            "Lol I had teachers like that at highschool however they didn't last long because my year didn't care ,if they did it to us, we did it to them.\n\nHowever we had a couple of cool teacher who had thier own ones like my teacher miss P.\nMan she gave us options if we was late to her class usually after the 2end time though . Either we take detention x2 the amount of minutes we was late or choose between 5 burpies, 10 press up, 20 sit up, crunches or star jumps for every 2 minutes we was late.\nWe got her at 15mins late to class and man she took the burpies so about 27 she had to do. We respected her hard thou. She was always fair.\n\nBut she understood if you was late because of the principle (he was a prick) and let us off for that.hey he was a prick towards her too.",
            "I had a teach who explained to us that his strict attendance policy was because his thought process was too fragile. If someone came in late he forgot what he was talking about. So he'd ask someone in the front row \"what the fuck was I talking about\" (most polite usage of the word fuck i ever experienced in my life by the way). We'd get him back on track. It was amusing, and people felt bad about putting him in that position because he was a really nice guy and excellent teacher.\n\nThe last half of the semester zero people came in late.",
            "Missed opportunity. Teacher guy could have done the lessons through the glass door, like he made his students do.",
            "In my college, if you were late, weren't in clean uniform, or missed a day of class, your letter grade for that entire class automatically went down a grade. 3 strikes and you automatically fail with no refund.  It definitely taught me discipline but I like being early to everything anyway so It didn't really bother me.",
            "I had an 8 am chemistry class with a professor who locked the door after 5 minutes. I was commuting an hour and a half across a time zone for the class and my schedule had over an hour break before my next class. I’d leave my house at 5:30 in the morning after waiting tables until midnight+ the previous evening and miss the lecture if it took too long to find a parking spot. Then I’d have three hours to kill before my next class.",
            "I never understood this type of mentality. My teacher was the type where if you're late, don't be disruptive and attendence isn't mandatory because you're paying for the classes and the one who needs to pass",
            "How is this even allowed in terms of fire safety? Or would the doors still open from inside?",
            "If I was a teacher I wouldn’t give a fuckkkkk. I would be like “oh you were running late ? I feel that, so where’s my coffee ?” Lol like teachers do too much. It’s one thing for high school but when you are paying for the class yourself then professors shouldn’t give 2 fucks. My college didn’t.",
            "Absolutely brilliant!",
            "We had a teacher in uni did this, the solution was excatly the same. locked the door and let him sit outside while we read the textbook and chatted idely. Never did lock it after that either.",
            "I had a professor like this too. He taught jazz history and made a subject that could be so fun insanely boring. Even worse, he didn’t allow student to go to the bathroom unless you had a medical condition. A few students learned the hard way and when they went to the bathroom had to sit outside the rest of the lecture.",
            "We had a lecturer who had this rule but didn't lock the doors, she'd just ask you to leave if you turned up more than 5 minutes late. The lecture hall had two doors and there ended up being an ongoing competition for getting in late and sitting down without her realising, obviously not the intended outcome and definitely caused her more hassle than just being chill.",
            "I would have never known English was not your first language had you not told me.",
            "Wouldn't this be illegal, as this would be locking a fire exit? Unless there was some other way out or the door was unlocked from the inside?",
            "My prof once took attendance by calling names on a pop quiz and if the student was absent, the quiz was dramatically ripped in two and thrown over his shoulder. \n\nThe reason for this particular day’s attendance issue was because limited tickets for a presidential debate were being issued. \n\nThe Dean severely reprimanded the prof for penalizing students who were trying to further their minds by attending a presidential debate. \n\n*Dean of School tosses out prof who tosses out pop quizzes.",
            "Had a teacher try to tell me I was going to fail due to my attendance (I had lost my grandmother and it was my final semester). After I stood in her office for 45mins getting berated about my work ethic and how she didn't think I would pass (all the while classmates were dropping off their final exams and papers), I snapped. \n\n\"Wait, you told me that you think that I won't pass your c lass, and yet I was the first done with the final paper and first done with the exam... You have already graded me before looking at my work, how about you do your fucking job then talk to me.\" I stormed out after that while she was trying to call after me... I ended up passing with a low B (this was a modern literature course and a breeze for me)",
            "Two words:\n\nFIRE CODE.",
            "Fantastic. All of the students could have left the class that day because he wants to set such strict rules, versus waiting for the customary 15 minutes.",
            "My college yoga teacher had this policy and I ended up dropping the class because 16 year old me wqs incapable of being on time",
            "Ahh, one of the more desirable properties there.",
            "Fire safety be damned.",
            "When I was in college, if the teacher wasn't there after 5 minutes we all left.",
            "For English as your third language, I couldn’t even tell.",
            "Brasileiro ou Português?  ; )",
            "Sorry but I worked and put myself through school and am a punctual person. It used to drive me crazy when people would walk in late with a Starbucks.",
            "This is a common teaching tool but only really used in university education. For some reason students don't understand how insulting it is to the rest of the class if they turn up late and the start of the class is delayed. I used to use this but it only required one demonstration to \"educate\" late comers and always let them in but they had to knock. After that they would send me a text to explain that they would be late so I could accommodate them.",
            "This reminds me of my old physics teacher. She always wanted us to be in class 5 minutes before the lesson and if anyone arrives late they get noted not only for the time late, but she even put those 5 minutes on top. \n\nAnd if you had collected 25 minutes in that year you will get written up as missing for an hour, because she also doubled that time that we came late (an hour was 45 minutes)",
            "I had a professor like this, who did not let people in at all after 15 minutes. But he also told us we were free to leave if he didn't show up in 15 minutes because it was only fair.",
            "I don’t think any teacher would have the balls to do this at my school. Locking a student out of the class that they paid good money for would quickly go bad.",
            "I hate attendance policies in college. As I said when I was a junior (it’s become a meme in my house as I still live with the same roommate): “I’m grown and you’re going to get paid either way.”\n\nLike we’re paying to be here and we’re also adults with other things going on and if nothing else I, for one, definitely have more than 3 migraine days a year. It makes way more sense to say “absent mitigating factors, if you miss x number of days you’re not eligible for such and such extra credit/grade boosts/grade help/exam skips etc.” but if I do all my work to a satisfactory level it’s garbage that I can be brought from a B to a C because you didn’t see my face.",
            "That was perfect! Five minutes is all it took for him to see the error of his ways haha.\n\nI work for a site called Not Always Right, and we LOVE stories like this. Would you be okay if we published your story over there? We can link the story back to you here if you like!",
            "Sounds like a fire hazard",
            "I think i can get why the strict policy : students entering the classroom during the lesson can be bothering.",
            "[removed]",
            "[deleted]",
            "Ok but what about me?!",
            "[**https://tvtropes.org/pmwiki/pmwiki.php/Main/ATasteOfHisOwnMedicine**](https://tvtropes.org/pmwiki/pmwiki.php/Main/ATasteOfHisOwnMedicine)",
            "Not the original. It was supposed to arrive!",
            "A perfect example of \"enforced karma\"!",
            "I think a lot of people forget that university and education is very different in other places.",
            "What university was that?:)",
            "Ay que birn q lo hicieron! Me encanta compliancia como este cuando las reglas son forzados por los que son disenhado a restringir. Los estudiantes son leyendas; espero que estān haciendo bien!\n\n(Lo siento para mi Espanhol pobre; es mi segundo idioma. El ortografīa q uso no es regular; lo disenhē para uso en el tecleo hawaiano asī lo siento para todo confundiendo por eso. Eu trato tambem para aprender a Português mas é tão dificil pra mim!)",
            "I love when teacher get locked out, the look on their faces.",
            "Do an edit 4 to correct lenguage in edit 3. \n\nLol sorry, just wanted to share the irony.",
            "Good story. Thank you for keeping it short",
            "Why would the professor not already have a key to his own classroom?",
            "I love this post.  I wish I could have been there.  On a different note, allow me to help you out a little in your understanding of English:\n\nYou spelled \"language\" wrong.\n\nKeep at it buddy.  Your english skills are still better than some native speakers I know. ;)",
            "Hahahaha love this!",
            "A+ for that proff for firesafety",
            "But.. that’s a fire hazard?",
            "[deleted]",
            "Just frickin’ leave earlier and get there on time.  It’s rude to your classmates.  In military, it’s a potential UCMJ offense (federal crime).  Just get there on time, big boy.",
            "I had a professor that licked the door at the exact time the class started. If you were 20 SECONDS late, you couldn’t get it and it was counted as an absence. 3 absences and you failed the class. This class caused me so much stress!! I always got there 30 minutes early just in case traffic was bad, so I had enough time. But the stress it caused was pointless."
        ]
    },
    {
        "post_id": "hq7it5",
        "author": "halljustin91",
        "title": "Ex father in law threatens me with court. Fine, we can go to court",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hq7it5/ex_father_in_law_threatens_me_with_court_fine_we/",
        "score": 17684,
        "num_comments": 424,
        "created_utc": 1594609032.0,
        "selftext": "out a year back, my ex father in law took me to court for an incident that had happened 5 years previously. While still married, I got into a door dinger with his jeep. At the time I offered to buy a new door and help install it ( he is a self proclaimed mechanic and had the know how) the project fell to the way side, the door was never purchased and never brought up again. \nThat is, until his duaghter and I had a falling out and we divorced 5 years later. So I got served and taken to court for $2,000. A made up number that he felt was adequate. During mediation, I offered him $1,500 and to never contact me again. At which he scoffed. So I told the mediator I'd like to go before the judge. I informed the judge of the original deal, and found a matching door from a scrap yard for $400. The judge took my side and granted my father in law $400. It was incredibly gratifying  hearing him throw a fit in front of the judge to \"go ahead and file an appeal now\" and have the judge tell him that wasnt his job. And  walking out if the court room as he angrily yelled at me that \" he would be seeing me again.\" Still havnt heard back :)",
        "permalink": "/r/MaliciousCompliance/comments/hq7it5/ex_father_in_law_threatens_me_with_court_fine_we/",
        "comments": [
            "I had a lady back her car into mine...in a parking lot...while we were both in a lane of travel. She said she didn’t want to get police involved and just took my phone number. I was only about 16 or 17 at the time, so I didn’t know any better. \n\nIt was where my dad worked, so I went in and casually mentioned it. He was upset I didn’t get a report, because she could easily lie now or worse. Come that evening, the woman’s husband actually calls me and profusely apologizes for his wife. He is clearly pissed at her for the same thing since, frankly, she was in the wrong and would be liable for any claims I might make up afterwards. It was funny. \n\nNo joke. A few months later, the exact same thing happened in the same parking lot just a few feet away. An older man backs into me, gets out to look, then gets back in his truck and drives off before I can say anything.",
            "We had a little door bumper on the freeway. We pulled off; turns out this was a 17-year-old kid with a driver's license on which the ink was barely dry. \n\nThere was a tiny scratch on her car. I gave her my insurance information and told her that if she wants to have it checked out, let me know how much it's going to cost before she calls the insurance company and if it's not outrageous I would just pay for the damages. \n\nI explained to her that the odds of filing a claim for something so minor would not do her insurance rates any favors. \n\nI also was extremely careful to tell her to check with her parents first, and if they disagreed I would happily go through the insurance company, and that I was not trying to take advantage of her.\n\nI never heard from her.",
            "Jeep owner here, those of us who actually off road, dont worry about a ding here or there. It's expected. And a \"pick and pull\" is our auto parts store. It's cheaper.",
            "Don't know why you got down voted.  Most crimes have a statute of limitations and this wasn't even a crime.  Backing up in November I accidentally hit a neighbors bumper.  Only slight damage (mine looked worse).  She didn't want to get insurance involved.  I told her that if the repair was a few hundred dollars I'd pay for it; if it was a few thousand then insurance will be involved.  Haven't heard back about it though have talked to her and even sat on a chair on her lawn and had some wine.  I didn't bring it up since it is up to her to provide me the estimate.  Once we reach November again I won't feel obligated to fix it (but will if the cost is reasonable).",
            "If he had been a remotely reasonable person, he could have asked for market rate for a mechanic’s wage for the length of time needed to do the replacement as well to cover his time and probably gotten it. Not acting like a total dick can get you far in life.",
            "I pulled out from a side street and the guy in his old Mercedes was driving really slow, so I braked and our cars touched, hardly any impact damage, but a bit of some loose trim came away from his. I picked it up, wiped it on my shirt and pressed it back in place. I asked him what he wanted to do, and he said, give me £20 for the can of paint and my time. I agreed, he pulled over, I drove to the cash point and he was there when I got back, took the money, thanked me and drove off. We can be civil about these things.",
            "You should have made the case that the debt was half your exes debt, and only give him $200.",
            "One November evening 30 years ago I stopped at a light with a slight downhill on a very slippery night( sudden black ice is a bitch) .\nWhile I'm waiting for it to change I see a 4x4 behind me coming around a turn towards the light . He's going too fast I said. \nI had no time to start up again so I released the brake pedal and reached over and held my 6 year olds head back against his seat.\nTo his credit he almost got stopped so he only just booped the bumper enough to send me 5 feet or so ( would have been less if it wasn't so slippery) the kids fine I'm fine so I get out to check it out.\nThe kids driving the 4x4 is upset as it's the first time his dad let him drive the truck.\nI look over the damage aaaand there's a tiny scratch on my shitty bumper( was an old k car beater) and a tiny rub of black paint on his bumper.\nI reached down and rubbed off the paint spot and saw no scratches under it so I said to him\" didn't happen drive slower next time\" then I drove off.",
            "What an amazing story. Cheers for sharing, very nice.",
            "Statute of limitations is only 2 years on stuff like this.  You should have told him to pound sand, and asked the judge to dismiss the case.",
            "Need to be careful, you never know where door dings are going to lead\n\nA friend of mine opened his door onto the car next to him in his work car park, there was no actual damage but it did leave a bit of a scuff mark that he offered to spend his lunchtime trying to clean up which the other driver agreed to\n\nThat was about 8 years ago, he's now living with her and has 2 children with her :)",
            "Here in England & Wales a party can make what's called a \"Part 36 offer to settle\".\n\nBasically, when you win a case the normal rule is that the loser pays the winner's **reasonable** costs. The judge has absolute discretion on the costs to award, and these are either assessed on the \"standard basis\" or the \"indemnity basis\".\n\nCoats can be high and are one of the main barriers to people pursuing or defending litigation - and a big weapon to use to pursuade people to drop shitty claims. \n\nStandard basis means that if there's uncertainty over whether or not an incurred cost (say, paying an expert witness) was \"reasonable\", the judge will decide in favour of the paying party (the loser) i.e. they won't have to pay for that thing.\n\nIndemnity basis however means the other way round - the decision goes in favour of the receiving party (the winner). This overall means the loser has to pay *more* costs and is saved for where the loser has after unreasonably etc.\n\nSettlement offers can be made by either side to the other, and is made \"without prejudice save as to costs\" which means genuine offers/attempts to negotiate a settlement can't be presented to the judge to say \"LOOK THEY OFFERED SETTLEMENT THEY MUST ADMIT FAULT.\" The offers are only shown to the judge *after* judgment has been made, *if* costs are disputed.\n\nAnyway, a Part 36 Offer is a specific mechanism where one party offers a settlement, specifically says it's a Part 36 offer, and the other side has a fixed amount of time to accept that offer.\n\nOf they accept it then fine, settlement is paid and it doesn't go any further in Court.\n\nHowever, if the winner declines the offer but the Court awards them a similar amount to, or less than, the offer (or, if the winner made the offer - like, 'pay us or losses of £10,000 and we'll drop things' - and the loser declines the offer and judgment is for a similar amount or more) then **the party who declines the offer has to pay all the legal costs on the indemnity basis**.\n\nThis is beautiful because it forces the party to actually consider the offer and the likelihood of getting more or less, rather than just barrelling on on whatever chance of getting more.\n\nSo here, if there were lawyers involved, even though your ex-father-in-law \"won\", because he was awarded less than you offered then he would have to pay all his own legal costs plus yours, incurred after the offer, which would likely be more than the award 😁",
            "Guy sounds a little...... unhinged",
            "[deleted]",
            "How were you not past the statute of limitations for property damage?",
            "Is the case brought to small claims court?",
            "You should have just not offered anything and pointed out that the statute of limitations ran out three years ago...",
            "You paid 400 dollars too much. 5 years is likely beyond the statute of limitations to bring a claim like this",
            "I had a car go into the back of mine a few years back. He thought I had turned when I hadn't. \n\n\nHe got out and kept apologising - I saw red and was freaking out as I was checking my mother's car (no one scarier than my mother). \n\nHe didn't want to call the police, just swap details, but I called a mutual friend who was a cop who said to always get a report. The officer came out, the guy went quiet and you could feel the tension over my decision. The officer didn't care. \nI came home and handed the info over to my father - he knew better than I and would sort it. He chased the man and his family for months who kept saying they were away and would get back to him on their return, then get a second quote and even 'it's not really damage'. The only way we got them to pay was to say our next step was to send the police report and insurance claim to their insurance company - sure enough they paid. If we didn't have that report it would've been so much harder.",
            "I still feel the judge didn't get it right.  Since the incident happen when OP was married to ex-fil's daughter, then she should be held to half.  OP should've only had to pay $200, and ex-fil can go after his daughter for the other $200.  That's my opinion.",
            "Should've just moved to dismiss. That claim would've been barred by the statute of limitations",
            "To think, if he wasn't such a shithead, he would've gotten far more than that door was worth. I bet the look on his face was SOOOO satisfying lol.",
            "Years ago I backed into my roommates gf's car. There was a very slight scratch. I went to get touch up paint and painted it. That wasnt good enough and she got kinda snobby and requested a new bumper. I complied and put it on. The whole time, she just had a bad attitude about it.\n\nSo after I finish, she drives the car somewhere and gets into an accident on that first drive, she was fine, but the car was totalled.\n\nI slept well that night.",
            "A door dinger sounds like someone who habitually rings door bells and runs off. Lol.",
            "Most likely your father in law’s claim was time barred by the statute of limitations anyway depending on where you are, so if you had presented that as an affirmative defense you might not have had to pay a single cent.",
            "The statute of limitations had run on this case. You lost by paying $400.",
            "\"Go ahead and file an appeal!\" - classic. You know the judge is telling his friends that one.",
            "You must be in one of those states with crazy long statute of limitations. Five years? That man sure can hold a grudge. Over a ding. He must be a miserable old bastard.",
            "There are statutes of limitations that would apply for property damage liability.  5 years seems like a long time past",
            "I have have people hit me 2 times.  \n\nOne the guy was backing up in a toll lane to use another, backed into me, there was a car behind me so no where for me to go.  My car had no damage but his did.  i gave him my info and insurance.  His insurance called me, and after a talk, said yup no fault for me.  It is on him.  Did I have any damage  I wanted to claim (no) and that was it.\n\nSecond one, I was in the exit to a road from a parking lot at work.  It is on a steep hill.  I was waiting, not moving at all as there was traffic. Guy be hind me hits the gas and rear ends me.  He gets out all angry.  There are some scratches and a crack in my bumper.  It is an old car, I dont really care. He had a new car, his bumper half fell off.  He was not upset at me, again we traded info, his insurance never called me, but the next monday he found me at work and emailed me an apology and said it all his fault.  His damage was around 1000.  and if i wanted to he will have the insurance call me to get mine fix. I was like nah,  but his insurance insisted.  So I got a new bumper, and a rental for 3 days that it took the shop to fix.",
            "Property damage has a statute of limitations to file suit, normally far shorter than 5 years. Seems like BS to me.",
            "How was this not outside of the statute of limitations for civil cases? Isn’t it like 2 years in most states?",
            "Dude must really like you to give up $1,100 just so he could see you again.",
            "Dang dude....what did you do to his daughter? /s",
            "I like how you were actually happy to take some responsibility and not just deny it and pay nothing. I respect that mate, great stuff.",
            "What is the statute of limitations in your area? It's two years for many contract disputes, so you likely could have raised statute of limitations and gotten it dismissed.",
            "It's funny how almost all of the comments have to do with vehicle accidents when my first thought was about going to court.\n\nMy Brother-in-Laws ex-wife was a piece of work.  When they were married she would get mad at him for no good reason and start smacking him around and then call the police.  The police would show up and then ask the older children what happened.  They would truthfully say that mom was beating up dad.  She would get arrested.  She did it multiple times and never learned.  After the divorce, she would always want to talk to the judge instead of working things out amicably and always ended up in a worse situation.  Like he wanted to pay her X% in child support when he changed jobs but she wanted more so they went to the judge and the judge went with what he was legally required to pay, which was less than he originally offered.  He loves his kids so he paid her what he offered anyway so they were taken care of.\n\nAnother time, she said she was moving to our state so he went through all the trouble to buy a house here so that he could be closer to his kids but then she changed her mind so they had to sell that house and buy a big one back in his home state so his kids could visit easier.  Then she got pregnant and decided to move again because she wasn't married and didn't want people asking questions.  He complained so she took him to see the judge and sure enough, the judge sided with him and gave him more visitation rights including ALL holidays.\n\nAt least now they are all old enough that they can choose for themselves.",
            "My Dad used to work with proper villains again",
            "Super deep voice “Next time, Gadget!”",
            "Why did he need a whole new door because of a small dent?",
            "most civil claims uncollected, unacted on for 2 years go stale and are uncollectable",
            "I'm surprised they let him mediate at all. Statute of limitations in my state is 2 years for property damage claims",
            "Good for you for getting back at him like that!",
            "What?  This was 5 years after the incident, the statutes of limitations in most places would have passed.  Not sure where you are, but I mostly handle California and it’s 3 years here.",
            "I would've been very tempted to tell him that his daughter loves anal. Regardless of whether it's true or not, nobody wants the mental image of their baby getting cornholed.",
            "Her father was killed in front of everyone.",
            "You were beyond the limitations of liability. You could've asked to dismiss the case. Mighty white of you to give him anything!",
            "I like puppies",
            "So you dinged up his door and he was gracious about it, then you did something so terrible to his daughter that he tried to sue you for a bunch of money. This MC story doesn't have that same underdog vibe as the other ones...\n\n\nYou only lost $400, so I guess that's something.",
            "Lol one time I saw a car with a blue lives matter bumper sticker. I accidentally bumped into the side of it, put a nice little dent behind the passenger rear door. Left a note telling them Whoops but as bad as the dent was at least they werent being hunted in the streets by armed thugs! I wish I could have seen the look on their face as they read it"
        ]
    },
    {
        "post_id": "15l88jw",
        "author": "A-Wise-Cobbler",
        "title": "Director told me I had to prove myself for a promotion. So I proved myself to another company for a 25% base pay increase and double the bonus %",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15l88jw/director_told_me_i_had_to_prove_myself_for_a/",
        "score": 17665,
        "num_comments": 313,
        "created_utc": 1691471225.0,
        "selftext": "So 8+ years ago I used to work as a business analyst for a large multinational construction materials company. \n\nI was a good employee. They were a great employer. I had been given two promotions in my time there and been moved to several domains in the IT department. I learned a lot. \n\nA role came up to be a Sr. Business Analyst within a new domain and for various reasons I was denied the promotion. Not a big deal. I understood the reasons. I really did. I wasn’t bitter. A more deserving external candidate 100% got the position. I was still given the opportunity to work in that domain. Great learning opportunity. \n\nA few successful projects later in the new domain I asked if I could organically be promoted to a Sr. Business Analyst. And by successful delivery I mean my business partner going to another director in IT, who had a stake in that domain “Where has he been all of my life” so I had definitely done good if not great. \n\nMy manager spoke with my Director and the response was “well he needs to prove himself” \n\nI had to laugh. Don’t get me wrong again. My director was a great guy. He after all did promote me twice and gave me the opportunity to learn all these various new domains of the business. Nothing against him. \n\nThe explanation just pissed me off. \n\nI would’ve been satisfied with “there’s no budget this year” or “I don’t think I’ll get approval for an in place promotion”. HR was one of the domains I supported so I know how things go. \n\nSo I kept learning the new domain and started applying for various jobs outside the company. Took a few months but one role finally clicked. \n\nCurrent Job: $88k + 15% bonus paid annually \n\nNew Job: $110k + 30% bonus paid quarterly \n\nDirector wanted me to prove myself. I just proved my worth to another company. Got a $22k raise on my base and doubled my bonus percentage. \n\nMy manager then comes and asks me “so was there anything we could’ve done to keep you like make you a Sr.?”\n\n“Well I only started looking because they said no to being promoted. Otherwise I was and still am happy here. The money is hard to turn down though.” \n\nIn hindsight I am glad they denied me the promotion. I would’ve never left that company otherwise and not been on my current career trajectory.",
        "permalink": "/r/MaliciousCompliance/comments/15l88jw/director_told_me_i_had_to_prove_myself_for_a/",
        "comments": [
            "Sometimes a small push like this can be all we need to help us with our next move.  Your manager must have quickly realised that they screwed up!",
            "Employers love complaining that employees are no longer loyal - well of course not. Because Employers no longer treat us well. All it would have taken to keep you would have been a title change and a small raise - now they need to find a Sr. Business Analyst (since that was the work you were doing, title or not) while paying 25%+ more than they were paying you if they want to hire anyone.",
            "I did this recently. \n\nWas made a Project Manager and told that as a new PM, I would have to learn all the budgeting and progress tracking tools. I would then be given a raise up to the Management rate of $40/hr.\n\nThey also made me Salary removing my ability to get OT, and bumped me up $0.50/hr. \n\nI learned everything, had several flawless projects under my belt and they refused to honor their side of the bargain. I was told by the owners that I was an incredible asset and they valued my work and opinions, only to find out through back channels that the OPS manager was purposely keeping my team and I from being successful. “If we promote you… who will do the work?” \n\nSo I asked about the deal they made me, and was told that I needed to prove myself to her.  So I did. \n\nI took a position making $40,000 more a year in a beautiful part of the country doing consulting for the industry I have worked in for 14 years.",
            "A similar scenario happened to me. I was very good at my job and I really liked it. However, everytime I would ask about raises, promotions, or cross training, there was some excuse as to why they couldn’t. So after 5 years there I started looking. After a month I found something better. 39k to 63k. I succeeded at the new job but they kept up with the same excuses. 3 years later I decided to look for the greener pastures. It also helped motivate me that over the 3 years I was there, the place became pretty toxic. Found a new gig and went from that 63k to 89k. Decided I would always be looking, at least passively. Companies are no longer loyal why should I? 9 months later I found a work from home job for 105k. Here we are now two years later and I just accepted a position for 145k. Between Apr 2018 and today I have had 4 job changes and increased my salary 106k. Job hopping is the only way to truly increase you income.",
            "Many companies and HR people have the nindset that anyone they get in from outside is better than the people they already have.  \nWhat follows is that they can pay a new hire more than the people they already have. ie the budget to hire is more than the budget to keep.  \nIf you ever get a yearly review that pays less than inflation, or your pay has been static for a few years. (or worse no pay rises at all and you have flatlined), then the company is actually saying; \"You might as well start looking to leave, because we don't value you here\"\".",
            "Had a similar experience last year. I was comfortable in my previous job but I am glad they denied my in-house promotion request. Applied outside and got the scrum master job with a 25% pay hike. Before I left, they were ready to match the offer and give me the promotion that I was waiting for last 3 years.",
            "Yup. At some point in the MBA process they should really start teaching that if an employee asks for a raise/promotion and you turn them down, then you should really expect their resignation soon after. And if you can't afford their resignation, you can't afford to turn down their promotion.",
            "I love my current job but I’m in a similar position to your original position. Just had an annual review. “Model employee”, “you’re the kind of employee every company wants” yadda yadda. “Here’s a 3% raise, good job!”\n\nFollowing Monday I get an email confirming the raise but stating no future raises would be forthcoming until I increase my output to X. I cannot increase my output because I’m bottlenecked by other people—both our own staff and other companies. Thus I have no control over my potential for a raise, just a firm future denial. \n\nSo I’ll be looking for other employment opportunities.",
            "I love stories like this. I was hired for a job where I quickly learned that the actual responsibilities went well beyond what was advertised, which included doing nearly all of the functions of multiple people at a higher pay grade for approximately 1/3 of the year while they travelled. My boss, correctly, flagged this for review by HR and wrote a proposal asking for a pay bump for me and noted that “we are going to continue losing good people to our competitors if we don’t pay them fairly”. \n\nFast forward three months. HR turned down the pay bump request and they did, in fact, lose me to a competitor who paid me 40% more to do a comparable job. Turns out that the extra responsibilities that were dumped on me gave me the more specialized experience I needed to get my new job. \n\nFast forward another month. They also lost my manager who wrote about losing good people to competitors. He went to work for the same company as I did 😂 He took a non-management position that was lateral to mine and still got a huge pay raise from what he had been making.\n\nWe’re both still at the same place years later and make about 2.5x what our original salaries were at our old jobs and I think we’d both agree that our respective jobs are not only better, but easier.",
            "I'm running into this right now.   \n\n\nI was hired on at a new company almost five years ago. For three years, I was the only one in my department. Eventually, we hired someone else, at my level. He got promoted to Lead after a few months and... I didn't mind, not too much. He's better at management than I am, but I'm more technically skilled, more of a problem solver.\n\nA year later, we hired another guy. He's my level of experience. Then we hired two more, bringing our department to five people. Due to the economy, our raises just kept up with inflation. I always good great annual reviews. Eventually, the company announced that significant raises would be tied to position- the only way I could get a raise better than inflation would be to be promoted to Primary. I figured that I'd get that position at the next review.\n\nWell, I didn't. Other people in other departments did. I asked for a meeting with my superiors, and asked why I had been passed over. They said that they wanted me to prove myself for the position. I was a little upset (I mean, I'd been there longer than anyone else, and had always gotten great reviews- why didn't that count as \"proving\" myself?) But, I agreed, and started working even harder.   \n\n\nMy next review was glowing. I figured I'd gotten the promotion, so I waited. And waited. I saw other people get promoted in other departments. Finally, I asked again, and I was told that they still wanted me to work on some things- different from what they'd said before. I agreed to work on those things.\n\nThree months later (just a couple of weeks ago), I found out by accident that the second guy they'd hired after me had been hired on as Principal. Apparently, he'd been in that position for two years and nobody had ever mentioned it to me. I was fucking furious. After all, how many Principals does a team of five need?  \n\n\nI've got a phone interview at another company this afternoon, and I'm talking to another company in email right now.  \n\n\nIt pisses me off. In many ways, this is my dream job. But I'm ten years from retirement, and I'd like to end on a high note, not a whimper. All I can imagine is the other people in my company wondering why two people had been promoted over the guy who'd been in the company since it was founded.",
            "When nobody’s got your back, it’s time to move your back.  Congrats on being a great CEO of You, Inc.",
            "The modern way. Be a team player, learn all you cam to make yourself more valuable.\n\nWe see it on the TV news. Employers complain because they can’t find the people they need.",
            "I worked in a govt company for 15 years. Put my best efforts. Got promotions. Everything was good. Treated my work space as my family. At one time they promoted other guy. He was also good. When I asked for mine promotion, they said you have to transfer from this place to about 1500 km. After that, all that aura gone and I started to look for other job. As luck would have it I was appointed as CFO in my hometown. And best thing to work in hometown that everyone knows you and your company.",
            "Thus hits home \n\nWas a developer, eventually started running small projects, building client relationships and selling  - I wanted to get into management. \n\nBosses dragged their feet and said I had to prove myself. I was already working as a manager, couldn't do anything different so I Got a bunch of certs, eventually the PMP, then taught the class of new promoted manager cohorts classes on program management. Got one of the highest ratings as a volunteer faculty. Even that wasn't enough that I was teaching new PMs how to manage and couldn't get myself a promo to a manager.\n\nThe PMP & other certs opened up many doors - went to a significantly larger consulting firm as a manager. Got a 30% base raise, 15% performance bonus where it was 0 before and a 5% sign on. Shocked pikachu faces by my manager and his boss. \nI did maintain a great relationship with them - still drop them a hello from Time to time. I was never obnoxious about leaving. \n\nBut damn did it feel good to tell them when they asked why I was leaving and what they could offer to retain  \"as you have been aware, I have been targeting a management role for a year but was unable to achieve it. Not for a lack of trying as i demonstrated on my career plan I've exceeded every performance objective that was asked of me and then some - for Eg the volunteer faculty, I look forward to our paths crossing and I can't thank you enough for the opportunities and mentoring\"",
            "Basically my story. Worked as IT in health insurance as a junior developer, did the same work as the regular developers but didn't get a day to work from home. Went above and beyond, did great work, asked for a promotion. Boss was on board, said we would talk about it in 2 weeks. 2 weeks later, his boss had said \"we need to see more\". Started applying that day, got another job, quit. They were upset that I didn't give them the chance to match the offer and I told them they had the chance before I applied.",
            "I love it.",
            ">My manager then comes and asks me “so was there anything we could’ve done to keep you like make you a Sr.?”\n\nHow tone deaf can someone be?  Deny a raise, then ask why you're leaving for a better paying job?!",
            "My son says to changing  employers every two to three years is the best way to get a rise",
            "Yes, I can confirm Banks are like this. \n\nI hired in with an I.T. Title. But no VP, AVP, SVP or EVP tag. That eliminated me from a lot of perks. Worked there a long time due to family issues with medical. Watched people hire directly in as VP or AVP. They get the special perks.\n\nYear before I left they were all about selling or merging. They had a consultant come in and they retitled a ton of positions. Mine was still Systems Admin. No change. Ran the department for months at a time when my boss was out with no pay bump or bonus. Successful projects and deployments. Nothing really to show but experience. \n\nWhen I left the CEO called me up less than 30 minutes of my resignation. (I wrote it on my cell while in a meeting with his consultant son and the latest highly paid consultant they brought in 'to help me' but make lots of cash while I did the work) I only had to go down to get the printout. He could not understand why I was unhappy. He said in a few months I was going to be a SVP in my department with a new title as the merger was coming. \n\nNo, If you could not do it in 6 years you are not doing it in 6 weeks. I have enough experience and sense to see whats coming. Everyone that stayed and even the ones in the closed meetings were gone in less then 2 years. They have merged 3 more times since. Branches are gone in my area and I dont know anyone there. \n\nMove and continue to grow. The place that hired me was a large upgrade and I learned a lot and grew. Staying in the same job puts you in a rut and only small COL raises.",
            "I did this. Twice. Both times I achieved goals that were set and exceedingly supported the teams I was a part of. When promotion talks came around and I didn't see the effort from the company side, I bounced. Last job this had happened, I asked for my future and was told that it was unlikely to be promoted, as the deadline to submit these for our managers was the prior day. Two weeks later I submitted my two weeks and all of a sudden it was no longer \"too late\" to promote me.\n\nToo late indeed.",
            "Switching jobs is the ONLY way to get proper current pay.  Annual raises suck.  You're making less and less with inflation. They will play the b.s. retention card ONLY after you quit, never before even if you ask.  They're calling your bluff so ... don't bluff.",
            "I feel like I’m about to be in this boat. Up for a director gig and I feel like it’s between me and one other person. If they get it over me, I’m going to be looking elsewhere. I just don’t know where to start when it comes to looking. I’ve been with my current employer for 15 years.",
            "Had a similar thing happen at a job once. Boss told me I was a better fit for management but that there were no open positions. That night a neighbor asked if I wanted to manage a cell phone store because the company needs managers. So I applied and got it, when I put in my two weeks I made sure to mention that “at the advice of ownership, I decided to pursue a management position being that it is a better fit for me.”",
            "What company pays a 30% bonus QUARTERLY.  Or do you mean they split the 30% bonus into 4 payments?",
            "Lesson learned: now update the resume and get it out there. You need to know what the market thinks you are worth. This is the best tool available to employees when their annual review comes up.\n\nYou can make all sorts of allowances for culture, work interest, etc.  But taking it all together, the fact is, if they’re not paying you what you’re worth what is that saying?",
            "Some companies just don’t get it. If you want to retain the best employees, you need to pay them more than the competition, or eventually that’s where they will end up.",
            "I had a job paying 85k, found another job making 90k, told current one I'd stay if they matched (but I told them the other job was offering 100k), they matched so I stayed.",
            "After finding out my previous company’s direct leadership deliberately sabotaged any chance of a promotion for me (I’m Gen X to give some age concept), and only hired people 25-35 years of age (to avoid paying me a lot more due to my age and years of experience), I got in with a company where my peers and upper management are equal or higher in years of experience. And landed a $16K yearly salary increase in one fell swoop. Never stay where you aren’t appreciated.",
            "I worked at a small company where the Sales Director was put in charge of the whole promotions/review process.  When one of the lead developers asked for a raise, the verbatim response was \"why should we pay you more for doing your job?\" (and, yes, that was purely a rhetorical question).\n\nI refreshed my resume that night. A whole lot of engineering left over the next couple months.",
            "I think in the 80's  employees were grovelling and begging for their jobs.  A lot of the older employers never gave up  that era. I work as a recruiter, I get an earful from my clients when I present candidates closer to market value. Then another earful when my candidates wont accept their measly offers. This isn't everyone just some delightful few",
            "Climb if you can but always be on the lookout for better pay. That’s the game now. If you want loyalty get a dog.",
            "I once thanked a supervisor for firing me. I ended up getting a much better job.",
            "Yes this is how you do it. Ffs people are still out there haggling and whining at their company for raises and stuff. So stupid. Everybody knows that in order to get ahead you have to be willing to leave, it’s been that way for many years now.",
            "They fucked around and found out. Good for you, I say.",
            "Exact same situation happened with me and similar numbers. 5 years later I now make close to 3x what I was making back then. My manager couldn't even be bothered to see me one last time before I left. I gave my two weeks and never looked back.",
            "It is pretty typical in the tech world.  \n\nGet a job, level up your knowledge for a few years, then get the next job to get the raise.\n\nI stayed one place for 10 years but that’s because I was able to travel home to see my brothers once a month on the company dime.    But my pay was stagnant, so it was a calculated trade off. \n\nAs soon as I left I was able to get a significant raise.\n\nReally the only reason to stay put is if you’re trying to do management track (shudder).",
            "I had basically this exact situation but got a 61% pay increase, a sign on bonus and some ridiculous RSU earnings.  After I got out, I realized how much the original employer was also taking advantage of me.  Not only were they undercutting even the lowest typical pay for my field but they had me doing work that I didn’t realize wasn’t part of my role.  Don’t stick around folks out of loyalty!",
            ">for various reasons I was denied the promotion. Not a big deal. I understood the reasons. I really did. I wasn’t bitter. A more deserving external candidate 100% got the position. I was still given the opportunity to work in that domain. Great learning opportunity.\n\nGOD why did I feel this in my soul. My workplace keeps externally hiring and people here are dropping like flies. They can't understand why! Nobody wants to work anymore!",
            "We all need to stop thinking promotions are a career path.  Sometime in my father's, past companies were loyal - they showed their loyalty by providing career growth through promotions and employees showed their loyalty by staying with the company.  Now that's all gone.  Cut-throat is the name of the game.   So the best advice I ever received is that your only job security is how quickly you can find a new job.  Your only promotion is at a new company.  live by it.",
            "If you’re satisfied with the job you have, management isn’t under any obligation to promote you or even give you a raise. If you want to find out the true worth of your job, you will have to look elsewhere. In my career, I worked for 8 different companies and never regretted changing from one to another.",
            "Once they give you the reason to start looking, no telling what you find.\n\nRetention begins with maintaining satisfaction.",
            "Sometimes, such things happen for our own good\nFor example, my dad was made to resign as the chief civil engineer in a big construction firm in our city because of his differences with the MD's son. It pushed him to start his own firm and now we are so well to do thanks to that little push he received early on",
            "I'm also a business analyst, so this post spoke to me. I'm a senior business analyst in my job now (in year 5, but 12 years of experience in total), but there is no upward mobility within my department, so I'm done advancing unless I look elsewhere. This job is pretty great though: $95k, 7.5% annual bonus, 4.5% raise annually, work from home and a great team to work for. Really no reason to leave except for money and advancement, so not sure if it's worth it.",
            "The same thing happened to me! They made it hard for my manager to prove that I was worth promoting, gave me the lowest salary in my pay range, and gave me the difficult clients because I rarely complain anyway. So I left and got more than 100% salary increase.",
            "In IT it is always to your benefit to switch employers every 3-4 years.",
            "This is the sad reality of working for a company.  Companies always put more value on potential employees from outside than they do existing employees.",
            "Some little savings lead to big losses...",
            "Reading with interest because my annual review is coming up. I’m the only one doing this job. When I was off (COVID-positive) it took took three people to cover my workload. When another person was off for the same reason, I covered his workload and mine. \n\nSpeaking of workload, I’m finally to the point that I’m covering enough work that it’s hard for me to sit at my desk to answer emails, VMs and to schedule new appointments. I’m about to ask for an assistant. I’m also silently composing my response to the “standard” 3% raise they offer each year.",
            "I have seen so many people try to prove themselves for the promotion that never comes. Effectively helping upper management cover for multiple positions while still paying you the money for the original role. Personally, I rarely see this work. For me is pay up front or no thank you.",
            "I proved myself past year for double my pay and like ten times the bonus pay lol. Love it",
            "The job I had before my current position decided to cut benefits while telling us that it was an improvement.  Basically, it was changing the way personal time was calculated.  The math was not hard - it was a definite downgrade.\n\nSo I started looking for a new job.  I took a $0.05 an hour paycut and the benefits were triple what the other place was offering before the downgrade.  Then 6 months after I took the new job they gave me a $2.00 an hour raise because I evidently impressed them.",
            "had the same thing. liked where i worked but wanted a different role, not even asking for more money, i was just done what i was doing and wanted to do something else  within the company.\n\nwell they hummed and haa'd for MONTHS while i told them i was actively being pursued by 3 other companies. They were shocked when I handed in my notice. CEO said i can match whatever they are paying you (he didnt know  where i was going). I said so you're saying if they are paying me 30% more you'll match it? \"yes\". then where was that for the last 4 months while i've been begging for you guys to find a way for me to stay?  \n\n\ndidn't hurt that it was actually more than 250% of what I was making at the time",
            "I was promoted within a company after proving myself, but they wouldn’t budge on the number in negotiations. VP had his own personal policy of no more than 8% raise a year for anyone. So I was going to walk and they met my ask of 20% but they split it into 10% raise and 10% bonus and said I should be happy that was even approved and no one has ever been granted such a raise. \n\nAt this time I was now 2 in command at this IT/AV company for the account. Having to hire people in my previous position on this new account. They’re all coming in at 50% over what I had been getting paid for years. And 20-40% over what I was promoted to. My management figured out I’d now see what everyone was making and told me that it’s just business. \n\nSo I left for another company 2 months later at a 40% increase, better benefits, and way more time off. \n\nNow I plan to do the same to this company that just gave all my coworkers a raise but skipped me. \n\nJust job hop after a year or two till you’re making what you want and have the work life balance you want. Company loyalty is a joke.",
            "> Current Job: $88k + 15% bonus paid annually\n\n> New Job: $110k + 30% bonus paid quarterly\n\nWhen I read those salaries, the only way I can keep myself sane is by repeatedly muttering to myself \"cost of living\" and just assume you live on the east/west coast or some shit. There is no way I could be getting fucked over that hard.",
            "Prove yourself, ok better job more money, and more bonus, there I proved myself because you did not see my value to the company.",
            "Whether or not you like them, this has been a great learning experience for yourself *and* your former employers. Nice job - in more ways than one!",
            "100% sounds like your manager knew you were going to leave and the director was had an old school mentality about promotions, show loyalty and that you can be abused by the company lol.\n\nNow they're going to have to probably pay someone new what you would've made with the promotion anyway, too.\n\nStill, in my experience it us much harder to get promoted than to get a new job at some companies. \n\nGood for you for moving up of your own accord and best of luck with your new role!",
            "Exact same thing happened to me.  I went from 110k to 180k after I was told at my previous company that there was no room for a senior engineer.  They scrambled to keep me, but once I started looking I saw too many opportunities.  If they'd promoted me when they should have I'd probably still be there.",
            "I had pretty much the exact same thing. Upside-down pyramid at the company, no they couldn't promote me even after doing work at that level. They did end up promoting some others a few months after I left who were in a similar spot, so I like to think I martyred myself for that.",
            "The invisible, all-knowing, best-of-all-possible-worlds hand of the free market has spoken and proven your worth!\n\n(This is part sarcasm about \"free market\" exaggerated bullshit, but also snark about the old boss.)",
            "Would you mind sharing your experience with your new company now, how do you like the structure and feel to the new position? Sounds like the culture and fit was there in the last company besides the sad exit move by the director.",
            "This is your director being incompetent. Your retention alone is worth the pay increase and instead of actually working with you to securing a promotion, he's making you dance till you drop. This is a bad managerial decision.",
            "Why is he asking what they could have done to keep OP when they've done everything they could to push him out the door?",
            "The funniest thing I ever heard was a good friend, highly placed in an established computer company say … “ The bastards pay me too much money to quit!”",
            "Good stuff and good luck!\n\nThe Director made one mistake, your supervisor made another - both egregious. \n\nThe Director gave an ill-thought answer and left it at that.  No indication on what you needed to do to advance or even if you had already accomplished it.\n\nYour supervisor should have already known what you needed to stay and not have asked after you gave your notice.  It's too late by that point.  \n\nIf they were more interested in knowing why you are staying or even why you are considering leaving, they would have kept you (and your loyalty, your historical knowledge, and your discount pay).\n\nPoor leadership and poor management has a cost.",
            "You more than doubled your bonus pay. It was only 15% annually for the old company, but the new one is 30% quarterly. You get an extra 3 bonuses each year. Glad you were able to find a better job.",
            "Next time they ask you what they could have done to keep you, **tell them the truth.**\n\n“Is there anything we could have done to keep you?”\n\n“Well yes, actually.  When I inquired about the promotion to Sr. Business Analyst having demonstrated my competence on the success of projects 1, 2, and 3, the company could have been more supportive instead of my director telling me that I needed to prove myself despite having done exactly that over the last 12 months.”\n\nAs it stands now, they just think you left because you were being impatient about a promotion.  It is important that they understand their lack of respect has an impact on retention.",
            "Lol literally did this move this year.  Nice work.",
            "Always be looking. Staying with a company for 20+ years will never yield anywhere near as much salary potential as calculated moves every 3-4 years.",
            "I feel like this is the story at a lot of big companies.  You put in a good few years with 3-5% raises at best.  Only way to make the next big jump in pay is by leaving somewhere else.  A small percentage of employers may match your raise elsewhere, but it seems that the vast majority will let you walk even though it will cost them way more to hire and train someone new.",
            "Was told to \"make myself valuable\". I am the only one who does my job. Took on more responsibility.....didn't get close to what I was asking for in the way of a raise.",
            "This isnt malicious compliance, but well done for getting out and finding a better job",
            "I've gotten my best raises by moving/changing companies.  That just seems to be how things work in corporate America.  And people wonder why employees are not loyal.",
            "And here I am never having made more than 31,500 no materr what job I get! lol. I would have been just fine with 88k.",
            "I feel like we worked at the same company.",
            "My bil tailored a job description around himself - and applied for it - it was so niche he was the only one qualified to apply for it and he still got turned down for it!",
            "What's more is you had already proven yourself by completing several successful projects, in essence, already proving your worth. So, for that director to just up and say what he did clearly displays his ignorance. I understand also that sometimes there isn't budget for the promotion or whatever; at least those answers could be given. But flippant remarks like that are stupid. Moreover, apparently there was the budget to hire an outsider for a substantial amount of money, but then why not take that money and use it to hire/promote someone internal? Boggles the mind. \n\nGood for you, OP. Glad you were able to find a job that pays you what you deserve.",
            "It is a job hoppers market nowadays.  Managers, recruiters and administration are often still stuck in Old World Blues of company loyalty.  It's bad for business and it's bad for people.\n\nListen, your casual random dude can spend a couple hours flipping items on sales sites, drop shipping, online marketing, trending deals, OF and more and make upwards of 40, 50, 60, 70k.  This isn't like Logan Paul or any of those, that's your regular everyday dude.  The big ones are making millions.  \n\nYour nine to five for $12/hr is only appealing to the people that haven't figured out how to do that yet or are in a high enough position that it's worth making it to salary.",
            "Money is great, but it was also 88k for a job you liked... most people make far less for jobs they don't.\n\n\nWhere is the good enough line money wise for a job your happy with?\n\nI guess finding jobs or places of work I genuinely enjoy has always been quite difficult. It's hard for me to call making 88k, being content and not wanting to leave, being complacent.\n\nAlso congratulations, You're clearly working hard for it and I am not trying to belittle your promotion or change in situation. Im just very scared of the rat race lately and my own desire to trudge along in it.",
            "Can someone translate this from corporate nonsense into real words?",
            "This sounds like the story of my BA at overstock.com",
            "I would have called out the Director in the Exit Interview. I wouldn’t have just said, “shoulda been promoted” I would have also professionally stated, “f*ck you” to the Director.\n\nLetting that disdain drip from your words with the biggest grin on your face is so satisfying.",
            "what a fantastic story! Good job, OP",
            "I'm currently in a situation like that with a shitty manager. We'll see what the grass looks on the other side, that's sad but the money is necessary to live.",
            "Turns out the boss was right after all.",
            "Somehow I feel like you work at my place of work, this sounds all too familiar 🤣🤣🤣",
            "Very cool.",
            "That company would have given you the chop for the same volume profits so absolutely. You can now get to your retirement point 25% faster/sooner. And if needs be you can always meet the guys in the old company for social events.",
            "It's pretty amazing what that last little thing is that gets us moving along to look around for new opportunities.  LOL",
            "You have an awesome attitude! I'm sure you'll do well no matter where you are! Congratulations!",
            "Great story",
            "Congratulations. You are worth every penny.",
            "You think they learned their lesson?",
            "Sir you said you doubled your bonus but right there it said 30% quarterly you didn’t double your bonus you multiplied it by 8",
            "\"Penny wise and pound foolish\" should be your director's sub-title.",
            "And this goes to show no matter how amazing the company is you should always be looking and applying to other companies.  Even great companies might not be paying you what you are worth.  I am glad it worked out for you",
            "Congrats! Where are you finding business analyst jobs that pay that amount?? I’m in the same field, trying to change companies, and come across nothing like that.",
            "They could have proved their worth",
            "Your bonus effectively went up 8x. Double the percent, but for times per year instead of one"
        ]
    },
    {
        "post_id": "cw1xyg",
        "author": "brycen64",
        "title": "Woke up the CEO at midnight because manager told me to. He wasn't happy.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cw1xyg/woke_up_the_ceo_at_midnight_because_manager_told/",
        "score": 17651,
        "num_comments": 380,
        "created_utc": 1566897829.0,
        "selftext": "I was working IT for Safeway Corporate. Throughout the day employees can submit for tech support by either calling the number or sending an email. As we were mostly a call center, the emails (called web tickets) would back up as everyone was busy on the phone. They would nominate a few agents to jump off the phones and call out on these emails we got. The average person would do 20-40 by the end of their shift.\n\nI got assigned to a special group assisting other tech specialist with telephony engineering issues (phones don't work). We needed someone to work the night shift to help the night guys. I gladly volunteered. We got maybe 3 calls a night and that was for general tech support. I helped with maybe 1 thing a week. My manager asked why I wasn't very busy at night, I told him all stores are closed except those in Hawaii and we just don't have the same volume of calls. He tells me he wants to see me work web tickets at night.\n\nI work a few web tickets from 10-11 when I show up and a few more from 5-6 but don't have much success as night and morning stock crews want to put product on the shelves, not reboot a printer that is probably already working just fine.\n\nMy manager calls me in and is saying that everyone works significantly more web tickets than I do and he wants to see my numbers go up. I explain to him that the majority of the tickets are for stores that are closed or for our corporate office in California where execs are sleeping. He says he doesn't want excuses. So that night I call all 200 tickets, it isn't difficult and doesn't take long because no one answers and I leave the typical voicemail explaining why I called and to please give us a call back.\n\nThe next morning my manager calls me in furious, apparently high level corporate execs called my manager personally wanting to know why they were getting woken up in the middle of the night by tech support. My manager asks \"Did you call these people just to prove a point?\" ... I could have said many things \"just following orders sir\", \"Just doing my job\", \"What did you expect?\", \"do you know how dumb you look?\", instead I simply replied \"yup\"\n\nHis reply: \"Well played\"\n\nHe no longer expected me to do web tickets at night.\n\nAdding an update post below :)",
        "permalink": "/r/MaliciousCompliance/comments/cw1xyg/woke_up_the_ceo_at_midnight_because_manager_told/",
        "comments": [
            "Your manager owned his mistake?!\n\nDamn, man, well played indeed.",
            "At least he was a champ about it, could've gotten way worse that 'well played'!",
            "Another graduate of the Anatoly Dyatlov school of Middle Management. “Just do what I say, your protests are delusional!”",
            "Update/Edit for all those asking:His \"well played\" came with a smile that said \"I understand we are playing a game, and now it is my move\"\n\nEd seemed like a really cool manager for a while, He would swap D&D stories with me, he would joke around and seemed like my kind of boss, someone who could be light hearted and serious enough to get stuff done. That's my style, I am a hard worker and top performer who likes to crack jokes to co workers but build rapport with customers.\n\nbefore the story above I had asked Ed to place me on a special project as my numbers were through the roof and I wanted a challenge to break up the day. Boy was I in luck, that day upper management asked if they could downsize the Telephony Engineers and break down what they do into a script for employees to follow. He added me to this initiative as 3-4 telephony engineers were fired. Everyone over there wanted the project to fail, because if we succeeded we would justify letting them go. After a few weeks of this the head of all IT (My Bosses' bosses' boss) was walking around asking how the merger was going. Everyone was singing praises and false lies about our progress. Truth is we were doomed. I was the only one who told him \"It is not working and it's going to fail, but if you give me 30 minutes of your time in a meeting I can tell you exactly how to fix this\". Luckily for me this guy worked his way to the top and understood that lowly people like me could have valuable input. In the meeting I explained that those in the department wanted us to fail because it justified firing them and we just cant boil engineering degrees into scripts.\n\nMy solution was simple, give me unrestricted access to speak with each engineer separately. I will ask them every scenario on the books and off the books to fix anything telephone related. I will create scripts for all the basic troubleshooting and develop a procedure to transfer complex issues to a smaller team of engineers we can keep on board instead of letting them all go. He loved it. He placed me in charge of the project and gave me everything I asked for. During this time I was solely dedicated to the project and Ed would ask me to do Regular Service Desk stuff, I would politely decline and let him know the project deadline was approaching and the big boss is expecting things of me. It didn't sit well with Ed that I was slipping out of his grasp. When the telephony team moved me to nights I was even more out of Ed's grasp, if he wanted to meet with me he had to come in early. This is when the web ticket story starts.\n\nAfter the web ticket story (see above) Ed decided he would swap me out with another employee. I had finished all my policy writing and script typing. So the big boss was no longer watching over me. Ed informed me he was immediately swapping me with another employee in his words \"you're going to go sit back at your desk and take calls like a regular employee\" seems like a normal sentence but he added an inflection as if I thought I was better than everyone else.\n\nI called a meeting with his boss to explain that we just weren't seeing eye to eye (there's more to the story but there is not time, Ed and I butted heads on a lot of things). His boss sympathized with me and told me not to worry, the position I temporarily held was going to me solidified in 30 minutes to make it where I no longer worked under Ed, but worked under his bosses boss. I immediately let her know that I was taken off that position and it was handed to a new guy. Her face sunk, \"what? I didn't know about this\". because the switch taking place was tied to a position, not a person, it made it where the new guy got the new role. Because of big corporations there was nothing to do gears were turning and they could not easily rewind.\n\nI didn't mind too much, I went back to doing my Job and getting top numbers. Ed wanted me to grind out calls all day, but his leads (authority below him but above me) saw that everyone did 19 web tickets a day, I would do anywhere from 40-90. So they would ask me to work on web tickets full time. Ed demanded I stop doing this and take calls. I shrug \"sure thing boss\", hours later the leads ask \"Why aren't you doing web tickets, the queue looks awful!\" I told them Ed wants me taking calls. I have never seen so many leads walk over to Ed's desk and demand he put me back on web tickets. Ed came back over \"hey.... uh... we're going to need you to jump back on web tickets\". I replied \"sure thing boss\".\n\nthese are just the highlights, in reality every day was an antagonistic fight between myself and Ed. I just wanted to do my job, and I was the best at it (according to all numbers). My friends at work were all top performers as well and we formed a bit of a bond even meeting after work for cookouts, going to each-others parties etc. But Ed had it out for us. I loved working for Safeway, I took pride in what I did and I loved seeing those high numbers, but working with Ed was petty and infuriating, he would call me to his desk for not reason at all, fish for a reason to write me up, luckily I new our business and policies better than him and would explain and highlight written facts for him to interpret. He would dismiss me back to my desk, and now I was worked up and frustrated and all I wanted to do was sit down and do my job. He began to do this will all my friends.\n\nThe last straw was I had found religion and told my boss I needed Sundays off for church. (I was going to be a Sunday school teacher at my church). He said no, I filled out a religious accommodation form to HR, something they offer for employees like myself. The form was in the final stages of being approved until Ed came out of nowhere and said \"I've changed my mind, you can have Sundays off\". He switched my shift which made my religious accommodation form invalid. after 1 week, he held a mandatory shift bid and suddenly I didn't have Sundays off again. So I put in my two weeks. He asked me \"So you're going to quit because God is more important to you than this job?\" I said \"Absolutely\". A mass exodus kicked off and all of his top employees started to find new jobs. As his department was bleeding he walked up to my friend Mario,  who still works there and asked \"Why are so many people leaving?\" Mario replied \"We don't want to play games Ed, we just want to do our jobs\" Ed asked \"how many more people are leaving?\" Mario replied \"I can't tell you, but if I was going to show you the number on my fingers I would need both hands\". Ed gulped \"Is there anything I can do to make you stay, do you want anything a coffee or soda?\" Mario stated calmly \"Just leave me alone and let me do my job\". I heard from then on Ed sat quietly at his desk and let employees work.\n\nI would go on to be a manager and work directly under VPs and CEOs, so I was doing just fine.",
            "Sometimes the best MC is to do something that affects their bosses. That's what you did to perfection! So good!",
            "See now that is a good manager. Doesn't feel the need to grandstand when they know they're in the wrong.",
            "Having worked the floor at a Safeway many years ago, I suspect you did exactly what the executives would have wanted you to do provided you:\nLeft each voicemail with a smile\nPhysically touched the item they asked about\nAsked if they wanted to try eating the thing they asked about\nMade a serving suggestion to try to upsell them more stuff",
            "This is exactly why I don’t open tickets, I just call our help desk escalation contacts directly. Otherwise if I open a ticket the help desk will call me back at two in the morning my time and tell me that if I don’t get back to them by nine they’ll close the ticket (you know, so they “hit their SLA” on first call resolution).",
            "When I was a Phone technician for Ma Bell, we had a manager who came from the business office.  In the business office the employees were always on the phone, in testing & network we only worked when the network was down or had a technician on location who needed help.  Absolutely gave the guy fits, we would be sitting there shooting the shit while waiting for phone calls, either from the NOC or a customer, & he would be like isn't there anything else you can do?  I told him point blank, listen if we don't get a phone call all shift, its great as it means nothing broke.  He replied what the hell are we paying you for?  I told him 20 years of experience on fixing complex telecommunications issues.  He eventually left & went back to the business office, thank god.",
            "I can totally relate. I work vampire shift and lots of places aren't open. I can work on many issues overnight. I can however prepare morning shifts for them.",
            "this sounds like a story i would dream up of while sleep deprived doing web tickets",
            "A lot of questions. How would you wake employees up? When you submit a ticket at Safeway now you provide your home number?  The CEO submitted his own ticket? Hmm.",
            "> He says he doesn't want excuses\n\n> His reply: \"Well played\"\n\nAm I the only one who finds it hard to believe that a seemingly unreasonable and arrogant manager was so calm and understanding about the situation?",
            "Yup is the direct answer to a direct question.  He could not ask for more.",
            "Help desk managers who only know how to run reports on others are my least favorite people. Good for you on being MC.",
            "\"The last straw was I had found religion...\"\n\n\"I would go on to be a manger.\"",
            "[Mirror](http://imgur.com/a/DYEKC2r)  Because it was deleted/removed.",
            "Heres the story\n>I was working IT for Safeway Corporate. Throughout the day employees can submit for tech support by either calling the number or sending an email. As we were mostly a call center, the emails (called web tickets) would back up as everyone was busy on the phone. They would nominate a few agents to jump off the phones and call out on these emails we got. The average person would do 20-40 by the end of their shift.\nI got assigned to a special group assisting other tech specialist with telephony engineering issues (phones don't work). We needed someone to work the night shift to help the night guys. I gladly volunteered. We got maybe 3 calls a night and that was for general tech support. I helped with maybe 1 thing a week. My manager asked why I wasn't very busy at night, I told him all stores are closed except those in Hawaii and we just don't have the same volume of calls. He tells me he wants to see me work web tickets at night.\nI work a few web tickets from 10-11 when I show up and a few more from 5-6 but don't have much success as night and morning stock crews want to put product on the shelves, not reboot a printer that is probably already working just fine.\nMy manager calls me in and is saying that everyone works significantly more web tickets than I do and he wants to see my numbers go up. I explain to him that the majority of the tickets are for stores that are closed or for our corporate office in California where execs are sleeping. He says he doesn't want excuses. So that night I call all 200 tickets, it isn't difficult and doesn't take long because no one answers and I leave the typical voicemail explaining why I called and to please give us a call back.\nThe next morning my manager calls me in furious, apparently high level corporate execs called my manager personally wanting to know why they were getting woken up in the middle of the night by tech support. My manager asks \"Did you call these people just to prove a point?\" ... I could have said many things \"just following orders sir\", \"Just doing my job\", \"What did you expect?\", \"do you know how dumb you look?\", instead I simply replied \"yup\"\nHis reply: \"Well played\"\nHe no longer expected me to do web tickets at night.\nAdding an update post below :)",
            "So, I guess you guys couldn't connect to a computer remotely to work on it? That was always my dream when I worked tech support, get a web ticket with enough info to determine the problem (good luck), then rdp into the machine and fix it or install whatever, and never talk to the user. \n\nProblem was most web ticket descriptions looked like \"outlook\" or \"install needed\" and then the user wouldn't answer the phone, instant message, or email. Or it was a laptop they took home every night.",
            "Why aren’t you as productive at night as your coworkers are during the day!?!\n\nBecause people are asleep.\n\nNot good enough! Bump those rookie numbers!\n\n(Next day)\n\nSo let’s not call people at night anymore",
            "Fuck! \n\nThat has to be the best response to MC I've ever seen, although ya bossman was a dick in the beginning, he took his serving of MC like a champ.\n\nAlso\n\n*Well played.*",
            "it's really poor judgment on your part to explicitly mention the company you work for",
            "Me: \"oh boy, a new reddit post to read!\"\n\nOP: *removed*\n\nMe: \"k, I'll just go back to depression town\"",
            "*Well played, Clerks.*",
            "And like you. And by the way he responded, I now like your boss too",
            "Heey I used to work Tech support for Safeway. I was a field tech, you may have routed a ticket or two to me. Printers and meat wrappers were the bane of my existence with that gig.",
            "That could have gone so many ways, “well played” wasn’t one I expected",
            "Safeway closes at night? Every Safeway I know of around me, four within two miles, are open 24 hours. I'm in California.",
            "I always hate that I have to call IT for simple ass stuff. But our computers are so locked down that I barely can use the blasted thing. So I submit a ticket and some poor Level 1 guy has to call and do some minor task that I could have done myself three days prior.",
            "Not just your boss, but I don't understand this corporate mentality of the boss knows absolutely every fucking detail of everyone's job so well that he/she knows 100% without question how every cog in the machine works.\n\nI might not get paid the national average for my job, but I'll take the lower pay to have the ability to go to my boss and tell him he's blowing smoke out of his ass if he thinks he knows better than my 8 years of experience.",
            "That edit just made a Medium length story a Long wall of text. :/ Next time break it up over a few other posts man.",
            "I used to work corporate security for a grocery/gas station retailer and found an error in a program that made the gas pumps record transactions twice, but only record the payments once (making it look like all of the gas stations were experiencing theft).  I reached out to IT which had been outsourced overseas (Philippines I think).  The techs were working on it while it was the middle of the night in North America and the next day, my managers came to work bleary eyed because their phones had been blowing up all night with emails back and forth problem solving (Something like 50 emails in 6 hours).  They technically had nothing to do with finding the solution but had been cc’d on everything.  They couldn’t turn off their phones since they were on-call as security personnel.  I was blissfully unaware since I wasn’t on call",
            ">He no longer expected me to do web tickets at night.\n\nbecause you got fired?",
            "Has his attitude toward you changed positively or negatively, or not?",
            "I actually like that the manager appreciated the mc",
            "Ah I just love the wholesome ending",
            "I wonder if your boss had pressure on them to show why your numbers were low, and by doing this you helped out your boss too.",
            "I'm legit shocked your manager didn't get pissed at that answer lol, I would have gone with playing stupid and just \"doing my job.\"",
            "Upper Management will always do the right thing, after they have tried everything else.",
            "Manager seems aight",
            "Why are managers so disgustingly dumb?",
            ">telephony engineering issues (phones don't work)\n\nThat made me snort.",
            "If it wasn’t an issue before, I wonder if someone called it out the manager to begin with.  \n\nI wonder if that conversation went something like this:\n\n“Why isn’t John on these tickets?”\n\n“Well, I don’t know, sir, but I’ll get on him about it.”",
            "http://imgur.com/gallery/HfyRhZi",
            "Why did you call people if they submitted electronic tickets, instead of responding electronically as well",
            "Jesus... I worked a helpdesk for a company of about 300 people and wed get maybe 20 tickets a day and 3 or 4 phone calls... There were days were we got next to nothing. I cant imagine working with that kinda workload wouldnt have time to netflix!",
            "Moses: leads mass Exodus out of Egypt\n\nbrycen64: leads mass Exodus out of work",
            "Aaaaand deleted. Well I hope you still have a job good luck!",
            "does anyone have a mirror? just got removed",
            "Ah man. Deleted right when I was getting into it",
            "how does this fan fiction have 10k upvotes?",
            "But Safeway is open 24/7?",
            "He didn’t say well played at all. Nobody actually says that.",
            "Glad to see he understood his folly",
            "Long as that guy who sang \"happy\"",
            "Nice",
            "He was already told EXACTLY who was at fault here. Ever executive who called the manager knew the manager told you to get more tickets and had it explained to him why that's not your job and he needs to get his head out if his ass.",
            "Hey, at least ya gotta give him credit for realizing his fuckup and correcting himself instead of doubling down in his stupidity like most bosses do",
            ">His reply: \"Well played\"\n\nPretty cool, imo.",
            "Wow. I am actually impressed by your manager. I can imagine if that is my manager, things will go very differently.  At the same time, good for you.",
            "Damn, well he sounds like he might be stubborn as a mule, but at least he's a good sport.",
            "[deleted]",
            "Good for you for standing up to him.  A manager may be the boss, but they have no right walking all over their employees.",
            "Stories like this remind me I don’t need to be friends with my manager.",
            "Wasn't expecting that ending -nice! ...You might need some new pants to accommodate those big balls!",
            "passive aggressive well played",
            "Well he looks pretty happy with that. Interesting.",
            "~~Because it wasn't the title that told you?",
            "This is why your manager isn't your friend guys. For real. It's a game of survival and they will most likely throw you under the bus instead of themselves.",
            "Well played indeed, but remember: [with great power, comes great responsibility.](https://www.youtube.com/watch?v=Wsn2qMMmgKk)",
            "Safeway still exists???",
            "Way too much text for little payoff. Juice is not worth squeeze on this one.",
            "good programmers can automate portions of their job.  great programmers can automate people out of their jobs.",
            "Real life him halpert\nEdit: Jim",
            "And that managers name.",
            "Its good to see that’s Miami lol",
            "As someone who escalates tickets regularly, I can state that most companies want it done a certain way each time, every time. No deviation. It prevents fuck ups. The CEO will now have a conversation with the CTO and the CTO will hash out the details with the respective underlings.\n\nMost likely, the policy will not change. Maybe a VIP note saying EXCEP THE CEO DONT CALL THE CEO.",
            "Put it back",
            "I was bloody reading that",
            "removed wtf",
            "That's a dude I could crack a brew with - \"well played\"",
            "Aaaand it’s gone. Someone else at that company uses Reddit.",
            "I just read this, and then reloaded my page. Why did it get removed? I don’t think it revealed at personal information.",
            "Ed must have seen this...",
            "Why was this removed? I’m sorta new to Reddit so I also don’t get why when a post gets removed all the comments remain. 🤷‍♂️",
            "The manager bowed to the weakling.",
            "[removed]",
            "I'm a bit confused, if you're in the US, which I assume you are, California would be earlier than wherever you are (most likely) so why would executives be asleep when you are doing tickets at night? Why do you call the executives for a web ticket? Sounds like you'd call a worker and not the executive. I truly don't understand.",
            "I stopped reading at \"telephony\"\n\nYoU'rE a BiG fAt PhOnEy!!",
            "1a)@",
            "next time include a TL;DR",
            "r/that_happened for some reason this seems too unrealistic",
            "FAAAAAAAAAKE",
            "[deleted]",
            "Wasn't this just regular compliance?",
            "You're a shitty employee",
            "Don’t be a submissive twat, maybe that will help your life’s mindset brother. Never let someone steamroll you and get you to do something you don’t want to or do not feel is right."
        ]
    },
    {
        "post_id": "bposd6",
        "author": "CrackB3ar",
        "title": "Want me to answer every call? Sure thing. Enjoy your wait.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bposd6/want_me_to_answer_every_call_sure_thing_enjoy/",
        "score": 17603,
        "num_comments": 316,
        "created_utc": 1558083161.0,
        "selftext": "Background: Part of my job involves taking calls from the public to offer various types of support, this can range from tech support to helping people find services in our county that they need. My \"team\" is me and one other person, between us we have to cover 07:30 - 19:30 Mon-Fri and weekends as well. Because of this, and the fact that the company won't invest in call waiting for us, we can only take one call at a time. Our voicemail quite clearly states that we're a small team but if you leave your name and number we aim to get back to you within 5 minutes.\n\nNormally people are rather understanding of our situation and are happy to wait for us to call them back but, as the world is full of impatient a\\*\\*holes, we often get voicemails just criticizing us.\n\n&#x200B;\n\nNow, this happened today and I've been wanting to react this way for a long time and finally got the opportunity to!\n\n&#x200B;\n\nMe = Me\n\nAsshole Caller = AC\n\n&#x200B;\n\nAC: (Voicemail) *This is bl\\*\\*dy ridiculous, I was told to call this number but what's the f\\*cking point in telling people to call if there's nobody to answer the phone!?*\n\n\\-AC calls again-\n\nMe: *Hello you're through to -company name- CrackB3ar speaking, how can I help?*\n\n*AC: Oh, so now you answer the phone. What is the point of having a number if you never bl\\*\\*dy answer in!?*\n\nMe: *Ah, did you leave us a voicemail? I've just listened to it but unfortunately you didn't leave any contact details so I was unable to return your call. Thank you for calling back, how can I help?*\n\nAC: *You should answer every call that comes through!!*\n\nMe: *Well unfortunately there are only two people in my team, including myself and there tends to only be one of us in at a time so if I answered every call I'd end up having to keep putting people on hold and that really doesn't seem fair. Regardless though, you're through at the moment and I'm happy to help you however I can.*\n\nAC: *You can help me by doing your job and answering the phone when it rings!*\n\n&#x200B;\n\nAt this point I'm like, f\\*ck you lady. So sod it, I'll comply.\n\n&#x200B;\n\nMe: *Ok, sure. I'm sorry that I've annoyed you, I'll make sure to answer the phone whenever it rings. Now, how can I help?*\n\n\\-AC starts to describe her problem-\n\n\\-Phone rings-\n\nMe: *Oh, I'm sorry, the phone is ringing. I'll have to place you on hold.*\n\nAC: *Wai...*\n\n\\-Hold-\n\n&#x200B;\n\nI then help the person calling, taking my sweet, sweet time. Like going above and beyond just to keep this other b\\*itch waiting... plus, y'know it's nice to help people.\n\n&#x200B;\n\n\\-Take AC off hold-\n\nMe: *Thanks for your patience, now you were saying?*\n\nAC: *How dare you put me on hold, especi...*\n\nMe: *Oh, I'm sorry, the phone is ringing. I'll have to place you on hold.*\n\n\\-Hold-\n\n&#x200B;\n\nYou can see where this goes. I think I managed to keep this going for about 15/20 minutes before she hung up and I'm in for the next 10 hours.... god I hope she calls back.\n\n&#x200B;\n\nTL;DR: Lady wants me to answer every single call that comes through, regardless of whether I'm already on the phone or not. I comply.\n\n&#x200B;\n\nEDIT: Obligatory (but also 'cause I wanna) - thanks for the gold stranger! :)\n\nEDIT 2: Silver too! I'm enjoying this metal, thank you.\n\nShe still hasn't called back though guys, although there's still time in the day!!\n\nEDIT 3: Platinum - motherflippin' heck yeah! Thanks dude :D - [this.](https://media.giphy.com/media/lS74OiH1JYYak/giphy.gif)\n\nStill no sign of her but 4 more hours, here's hoping!\n\nEDIT 4: I'm afraid they didn't call back, sorry to disappoint! Have a great weekend all... except that one person who called me a cunt... I hope you have the best weekend! <3",
        "permalink": "/r/MaliciousCompliance/comments/bposd6/want_me_to_answer_every_call_sure_thing_enjoy/",
        "comments": [
            "Silly /u/CrackB3ar!! You're supposed to answer every time SHE calls! Those other people are obviously less important!",
            "Of course, she only meant you to inconvenience those other, lesser people.",
            "This is fantastic MC. Great work OP ;D",
            "I like it. Some people don't like to listen. You cant teach someone who knows everything about your job or career. Might as well learn from the professional lol",
            "This is gold. I used to have a phone like this, where the calls would come through at a very high volume and I was the only one to answer them. We also didn’t have a voicemails set up and my boss would periodically come yelling that people weren’t getting through and got kicked to her cell.\n\nAlso I was expected to make outgoing calls as well, which I had to do exclusively from my cell since every time I picked up the office phone to call out, somebody else was already on it.\n\nNow we have a new phone system where they go into sorta a queue type system with hold music. However people keep telling me they’ve been on hold for up to an hour - but idk why because the phone isn’t ringing in the office. And I’d say about a third of the time, I can’t hear anything on the calls I pick up and the people will call back irate “I WAS TALKING TO YOU AND YOU COULDNT HEAR ME AND YOU HUNG UP ON ME”\n\nI don’t know why it’s so hard to just pay for a reasonable and working phone system but ¯\\\\\\_(ツ)_/¯",
            "Niiice. But this bitch is probably going to complain. If she does, I hope that you get to tell her that your manager isn't currently available, but if she'd like she can leave her name and number...",
            "Wonderful compliance :) I hope you don't get in trouble for it, and I hope there's and update coming!",
            "People do the same shit at my job all the time. We are by appointment only for in person help and people will show up and pound on the locked door til we let them in, then pitch a fit if we can't help them right then. \"But I drove all the way here!\" Okay? No one asked you to. I'm not going to kick out someone who made an appointment just because you feel inconvenienced by your own poor choices.",
            "Did you just censor the word \"bloody\"?",
            "I manage customer service in a company that doesn’t care about it at all (they were bought out by someone else) and I absolutely hate that they don’t hire more support. \n\nI always tell the agents to take pauses when they are overwhelmed. Customers need to wait, I get they have an issue and need help but their expectations seem to be the same no matter who they are calling and it’s not fair. Good on you to show that customer what happens if every call is answered immediately like everyone is a precious special gift from the ether of incoming calls. \n\nAlso FUCK old people they are not compliment and way too entitled. \n\nI have some trying to return Christmas gifts from 2017!",
            "Perfect MC: you did exactly what she demanded and twisted the knife with each repetition!",
            "[deleted]",
            "Ugh. I work at a pizza place and it was just me and my AM one night because the drivers were constantly out since it was busy. We have a ton of stuff to do and he's got a ton of orders to make and this lady comes in and asks why we weren't answering our phones. We both explained that we were short staffed and it was very busy but we could help her at the counter right now. Not good enough apparently. She said she'd been calling for ten minutes and again asked why we couldn't answer the phones. So I told her again that we were short staffed and busy and she again asked why we couldn't answer the phones and I reslly didnt know how to keep dealing with her so I just went on with what I was doing. She didn't even end up ordering anything. This lady was calling us for ten minutes and then walked into the store to yell at us and leave without food. So I'm thinking she either was sat in her 15 feet from the door calling to place a take out order or she was so pissed we didn't answer her calls that she drove all the way over just to yell at us.",
            "Worked on the phones for a lot of my past jobs and this gives me intense joy to read. Thanks OP.",
            "Perfection.",
            " *AC: You can help me by doing your job and answering the phone when it rings!* \n\n&#x200B;\n\nNah, see, the assumption is that you're just sitting there in an office goofing off and the phone is ringing off the hook but YOU DON'T CARE ABOUT INCONVENIENCING PEOPLE!!\n\nThe last part is just typical end user incomprehension that anyone else is calling you as well.",
            "If it wasn’t for the fact I’d make myself look mad, I would’ve burst out laughing at this in public.",
            "This is some extremely fast MC. Usually it takes a while, but you turned it around instantly. Kudos!",
            "Why is the word bloody censored lol",
            "Well, you see, she meant you were supposed to answer HER call. Don't you have a special ring for The Queen of the Universe?",
            "That is hilarious, but to be fair, it sounds like your company isn't investing enough in it's support team and tools - the callers have every right to be pissed (not at you personally, but frustration tends to bubble over).",
            "Some people really think that they are the center of the universe",
            "Know what you'll find if you look up malicious compliance in the dictionary? This story",
            "TIL I'm a ding-dong and need to express myself/write things with **zero** censorship. Thanks for helping me learn Reddit!",
            "I feel so satisfied reading that",
            "Hope this makes it up to the all time top posts. One of those stories perfectly representing the spirit of mc with justice swiftly delivered.\n\nNot petty revenge, not \"see, I was in the right\". Just doing exactly the stupid thing they want so it bites them in the ass.",
            "congratulations you played yourself *.gif*",
            "Bl**dy h*ll",
            "Company won't invest in call waiting....tells AC they have to be put on hold....you cant have it both ways so which part is true?",
            "You're a godamn hero. I fucking *hate* stupid cunts like this dumb bitch.\n\nIf she calls back to complain you should seriously say \"ohhhhh, i didnt realize i was only suppose to answer every call for *you*\"",
            "Nice, not only a deserving MC, but the way you twisted the knife deeper with each and every hold makes it all the more satisfying",
            "This is so good.\n\nI work on phones and this is one of the best stories I’ve read.\n\nPlease let us know if she called and if you pulled it off again.\n\nBrilliant.\n\nCheers!",
            "\"gets annoyed at call taking to long\"\n\nSo naturally the best way to have it go quicker is to continually complain!",
            "Need to bleep out “bloody”?",
            " Me: *Hello you're through to -company name- CrackB3ar speaking, how can I help?* \n\nImagine if people actually answered the phone at work with their internet usernames.\n\n\"Uh... Crack Bear? Like, a bear on crack? I think I called the wrong number...\"",
            "I'm sorry but you and one other person are manning a helpline for customers 12 hours a day 7 days a week? And grin what it sounds you hey a decent call volume\n\nYou better tell me you're making 6 figures for that because if not you need to switch jobs fast, it sounds like a staggeringly unreasonable workload for two employees to handle and this is coming from someone who lives in one of the corners of the U.S. with a labor laws that would be considered lax by Somalian standards.",
            "Great work OP",
            "Top MC, good work! I bet that sour-faces bitch is seething!",
            "I like this, and totally approve.",
            "So do you work for 12 hours every day or is it split 6 for you 6 for you coworker?",
            "Classic example of scarce supply and unlimited high demand",
            "Did she call back??",
            "TIL bloody is asterisk worthy in some places",
            "I read this in Moss's voice.",
            "This is reddit homie, why you censoring yourself lol",
            "Please update us if she calls back.",
            "It’s so petty of you. I love it.",
            "Brilliant",
            "TIL \"bloody\" is a cursed word",
            "I'll be honest, calling some pleace and having to leave a VM is for some reason the most infuriating process for support.\n\nI'd rather wait on hold for an hour sitting in a queue than leave a VM and never get a call back, which is what ends up happening 98% of the time.",
            "Why did you censor bloody?",
            "I feel as if a sarcastic witty aura has surrounded me, you legend.",
            "You might think if she did call back she would pretend to be someone else. Gutless phone jockeys are expert at this. (I worked on phones for over ten years)",
            "It's ok, you can curse on the internet op.",
            "Yes you are fucked, shit out of luck",
            "r/AwardSpeechEdits",
            "Perfect MC. I love it. Well done! :D",
            "it's been an hour. have they called back? we need to know!",
            "Yesssss god bless you",
            "A plus maliciousness.",
            "Congrats op to put someone on their place :)",
            "For some reason most people were raised to think that no one's life matters but their own.",
            "Mon-Fri plus weekends = Mon-Sun",
            "Favorite one I've seen on this sub. Well done :)",
            "lmfao this made my morning.",
            "I love this one... ;)",
            "Instant malicious compliance. Very efficient.",
            "Hahahaha\n\nOmg\n\nThat is so pro level compliance :D",
            "Dang perfect.",
            "Lmaoooooooooooooo",
            "My hero!",
            "This just made my day!",
            "As someone who worked 4 years on an IT helpdesk, this story made my day",
            "No one likes stack flow, FIFO is much better",
            "This is one of the better posts put here. Short and easy to understand, while being hilarious. Good job!",
            "This post makes me so happy.",
            "It's been almost 10 hours! Has she called back?",
            "I know some places that do just this like best buy and auto places where they have both phone lines and real lines to answer at the same time. it's always \"best buy please hold, best buy please hold, best buy please hold\" I don't know how they manage it.",
            "Okay but why the hecc doesn't \\\\ escape asterisks",
            "The epitome of malicious compliance. Thank you CrackB3ar!",
            "Ok, genuine question here. Is bloody a bad word in England?",
            "We've had doctors with that attitude at our company... Until one of the members of my management team got fed up with their endless demands of special treatment and just said \"You're one of {x} thousand. Just one of {x} thousand.\" Where \"x\" is how many thousand employees at our company, and yes, he did repeat it for dramatic effect. It definitely shut that doctor up. \n\nDoctors still get preferential treatment where I work, but at least it's not the royal treatment they sometimes demand. I'd love if they got treated like our regular clients, but the again, I like my job.",
            "Perfect response to a very rude caller. Just wanting to complain, and when you follow through with their \"you MUSTs..\".... hahahahha, she deserved what she got.",
            "Did you censer the word bloody?",
            "Might just be me but the fact your company is shitty and wont hire enough resources shouldn't be the end users fault.\n\nYea customer was a cunt. Deserves the response no doubt. \n\nStill the villain in the piece is your company",
            "It's \"s*d\"",
            "I like how you were trolling her.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/platinumuserclub] [Want me to answer every call? Sure thing. Enjoy your wait.](https://www.reddit.com/r/PlatinumUserClub/comments/bpryop/want_me_to_answer_every_call_sure_thing_enjoy/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "This was funny as heck!",
            "My God this is so Gold. I love it lmao.",
            "Perfect",
            "Beautiful!",
            "Awesome :D",
            "This just makes me happy. Malicious compliance at its best.",
            "Is bloody a swear word in the UK?",
            "Is that the tiny demon from Buffy?",
            "Hahahahahaha i love it!",
            "great story, now I gotta go listen to beezelboss",
            "This story made my day. Thank you.",
            "Test",
            "To be fair...it's 2019.  A call queue is so fucking simple to implement.",
            "This is the best post I've ever seen in the sub. Nice work!",
            "The best part is you don't even need to pay for call waiting. All you need is an old desktop with FreePBX installed on it and a SIP trunk with a DID (probably less than the phone plan they have now). Pretty much any PBX server can make a call queue to handle overflow like that.\n\nSource: I'm a CTI Engineer for a call center and setting this stuff up is literally my job.",
            "Make them eat their own words.",
            "How dare u not talk to ac over EverY ThAtS NoT HoW It WoRcKs",
            "Why did you bleep out bloody?",
            "why did I read this with an Indian accent??",
            "Bloody is a swear word in Europe.... Like man my leg is bl**dy after I fell in the field. Or my hands got bloody when I tried to stop the bleeding... I feel this to be odd idk",
            "Being a stickler for semantics here, but it's kind of weird to say you never pick up as the first thing to say after you pick up\n\nWhen I was growing up kid content told us to never say never, whatever happened to that?",
            "“He’s hurting the wrong people!” - Trump supporters",
            "\"EDIT: Obligatory (but also 'cause I wanna)\"  \n\n\nNo, it's not obligatory at all. Nothing and nobody is obligating you to do any of this. It was *only* because you want to.",
            "It’s weird because I think we all know that we never know what other people are going through, it’s possible they have cancer or lost a family member and are losing it on people for little things... but then again maybe it’s not and the MC feels so good. I wonder if it’s some kind of natural way of keeping people in check. Because literally it doesn’t give us anything except some deep down warm feeling lol",
            "I don’t agree with your approach OP, she was mad but she was right, the justification “my team is small” is completely irrelevant to the customer and will only get her more angry.\n\nAlso, do you have the authority to react that way? I saw people getting fired for less.\n\nThe right way to answer imo is just smile and wave and report to your seniors “this happened”. If they don’t give a shit, then you should leave. The mad lady is a consequence, not the problem.",
            "[deleted]",
            "[removed]",
            "This don’t happen like that at all.",
            "[removed]"
        ]
    },
    {
        "post_id": "crqj8i",
        "author": "Lovelyhairedpianist",
        "title": "\"You cant use the company TV for your Switch.\" Sounds good to me!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/crqj8i/you_cant_use_the_company_tv_for_your_switch/",
        "score": 17556,
        "num_comments": 539,
        "created_utc": 1566069234.0,
        "selftext": "This will probably get lost in New but thought I'd share what felt like a solid victory today:\n\nI work for a pretty well known home improvement store, and we have a breakroom in the back with a TV for us to watch programs and sitcoms on our break. On this particular day, No one was using the TV -- it was turned off and everyone was on their phones, so I figured that there was no harm in plugging in my Switch and sharing the fun of letting people have a go at it.\n\nWhile Im watching people play, my supervisor walks in and sees the setup. She informs me that \"this is the company's TV, so you cant use it for personal entertainment.\" Big bummer, since people were having fun, but I cant lose my job, so I pack up my Switch.\n\nThat day on my way home from work, I pass by a house that has a massive honking old school CRT TV out front that theyre giving away for free. Its bigger than the TV that we have at my job and it still works!\n\nThe next day I haul this massive TV out of my car and into the breakroom. I get a few odd looks but I dont care. Too focused on complying with the rules. I plug this sucker into the wall right underneath our company TV, now tiny in comparison to the CRT and hook up my Switch to it for people to play.\n\nSupervisor walks in and sees people playing on a bigger monitor. Im not using the company TV, but I am using an even BIGGER personal Tv. People are playing the Switch and having a good time. She tries to say something about how Im blocking the view or causing disruption in the breakroom, but the other TV is turned off anyways and people are watching intensely as two coworkers are racing around in Mario Kart, so I dont really think it was that big of a deal. Not really sure if Im gonna get a strike for this or not, but Itll be worth it if I do, and I think i might be able to argue that I followed the rules.\n\nPart of me expects that this TV will \"mysteriously\" disappear and that security will have \"no footage\" of who might've taken it, which will be funny since its so big, but its the thought that counts.\n\nEdit: Thank you for the Platinum!! What do I do with it?",
        "permalink": "/r/MaliciousCompliance/comments/crqj8i/you_cant_use_the_company_tv_for_your_switch/",
        "comments": [
            "[removed]",
            "What the fuck is the TV in there for then?  You're on break, that's personal time.  Chances are, you're using the TV for personal entertainment...",
            "I never understood the mindset people like your manager have. You're on break, so long as you're not disturbing anyone, do whatever the fuck you want. Happy employees are productive employees.\n\nHell, my employer lets me take breaks whenever I want. Need to run an errand during work hours? Go for it. So long as your job gets done, who cares. As a result, I often happily work through lunch or stay late if needed, it'll get made up later on.",
            "[removed]",
            "Didn't know the old CRTs could run a Swtich.\n\nStill a badass move on you man",
            "I get it. You *switched*  TV's.",
            "A happy workplace? Colleagues bonding with each other? Can't be having that!",
            "[deleted]",
            "I once had a supervisor try to report me for hooking up my laptop to the big screen break room TV to play video games during our lunch hour.\n\nat 2:30 AM.\n\nThe manager looked at him like he was crazy and told him to shut up.",
            "I'm surprised you didn't get shot down by being told you aren't allowed to plug in unapproved or personal devices.\n\nIt's the company paying the electricity after all.\n\nI knew a guy that worked a regional office of a \"big corporate\" type place.   He said someone had brought in a coffee machine on their own dime since they couldn't seem to get one \"officially\".   (I think this might have been a bit fancier than a basic drop coffee which they did have provided, like espresso machine, but beside the point).\n\nWhen ever someone \"from corporate\" was coming into the office they had to unplug/hide it because it wasn't an approved device.",
            "I hope they let you keep your tv and continue to play switch.",
            "You found a crt HDMI input?",
            "Try asking if they’d like to have a go and explain the benefits of employee connection and camaraderie. You know some shitty spool of the sorts.",
            "Good god your supervisor sounds miserable and exhausting",
            "Can't use the company TV for personal use? Is watching it not personal use?",
            "If the T.V. goes missing, and security has \"no footage\" ask r/legaladvice if they're obligated to show the footage or not",
            "You should email corporate, and inform them how much happier, as well as  _efficient and motivated,_ workers are after enjoying their breaks in this wonderful manner. Perhaps you could go as far as to recommend it in their other stores, just to get the point across. I'd be curious to see the outcome.",
            "I would have just asked if they wanted next race.",
            "how did you hook the switch dock up to the crt? i dont remember any of my crts having hdmi ports",
            "I would have just let them play on the switch lol.",
            "Had the same thing happen at my job but I just bought a TV from a pawn shop near my house.",
            "Keep in mind the electrical appliance will probably need a test tag from an electrician to ensure safety rules.",
            "Hey dude, don’t start with ‘this will probably get lost in new’ it’s cringe",
            "As CRT TVs don’t have HDMI, how did you connect it up?",
            "I'd be careful. You're technically stealing company electricity to power that set up. \n\nDepending on your country, you may also need all electrical devices professionally safety tested before they can be plugged in.",
            "Then get fired for stealing company resources, electricity.",
            "What’s the deal with your supervisor?  She sounds like a crappy boss.",
            "Hope you don't mind, but I x-posted to r/screwyoublessthem",
            "[removed]"
        ]
    },
    {
        "post_id": "d6x07v",
        "author": "warmachine83uk",
        "title": "You don't have time to talk privately... ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d6x07v/you_dont_have_time_to_talk_privately_ok/",
        "score": 17528,
        "num_comments": 383,
        "created_utc": 1568995351.0,
        "selftext": "So I have worked in IT most of my life\n\n\nOne day in a job I was in it was slow so the manager asked me to check the firewall logs for anything dodgy\n\n\nPretty soon I find indications of a female staff member accessing some racy content of the adult nature \n\nThis staff member had a reputation for blaming her slow productivity on her computer/network/mouse etc so she was given no quarter \n\n\nI go up to the large office where she was is surrounded by many other staff members but here monitors are facing a wall and only she can see them\n\n\nI politely as to speak to her in private for a moment in a meeting room. \n\nHer response \"no I don't have time I'm too busy\"\n\n\nAgain I quietly said it would be in her best interest to have this conversation discreetly \n\n\nHer \" look! Stop wasting my time and say what you need to say\"\n\n\nI pause. Clear my throat and say loud and clear \" OK the IT manager has asked that you stop accessing bondage porn sites on your work computer\"\n\n\nThere's a moment of stunned silence where the staff member turns Scarlett and everyone looked at her including her manager.\n\nMe \"ok see you later\"\n\nAnd I turned and left the office\n\nCorrected: spelling",
        "permalink": "/r/MaliciousCompliance/comments/d6x07v/you_dont_have_time_to_talk_privately_ok/",
        "comments": [
            "She was too busy to step away, her hands were tied.",
            "We once got an email from IT asking that we stop shopping for vacations and new jobs during work time. It was so pervasive that they just told everyone.",
            "What was the fallout?",
            "It boggles my mind that people watch porn in public places. Whether the monitors are hidden or not. \n\nGroup of guys I knew from high school spent everyday in the library trying to find unblocked porn sites. And then they’d watch videos, TOGETHER. Why.",
            "If she’s into humiliation porn you might have made her day!",
            "I worked tech support, the week-end Mid-night shift. Easy work. From 8PM Friday, until 6 AM Monday, had maybe 4-6 calls a night. (Monday, between 6 and 8, OTOH...)  Things were pretty cool, and they knew it was a lot of dead time, so they didn't mind if we downloaded and played games. Along about the second month, the department head and I were chatting as I was heading out for the day. He said he was proud that I was the only midnight worker that never tried to download porn. \"Oh, I download it all of the time. that's why I have the internet at home.\" He lost it. Then, this was before High Speed Internet was everywhere.",
            "My work PC is close enough to the front desk that I can turn on wifi to get around the company filters. I've also been known to just remote desktop into my home PC to use banned websites.",
            "> the staff member turns Scarlett \n\nWhat was her name before that? :p",
            "Well.. she *did* say she couldn't speak *privately.* You certainly complied with that lol. Bravo.",
            "[deleted]",
            "Jokes on you she's into public humiliation",
            "> the staff member turns Scarlett and everyone looked at her including her manager.\n\n> Me ~~\"ok see you later\"~~ \"Frankly, my dear, I don't give a damn.\" \n\n> And I turned and left the office\n\nFTFY",
            "There is no way I, as a man, WOULD have that conversation with her in private.",
            "What kind of company has the IT guy do that? Even looking for that should come from HR, and they should deal with the discipline. With all that IT has access to, they have to remain neutral on these moral grey areas.  \n  \nI mean, maybe there are companies with IT and no HR and I just haven’t seen it, but if my boss told me to check the firewall logs for anything suspicious, someone looking at porn wouldn’t be what I was looking for.",
            "She was bound and determined to embarrass OP wasn’t she?!",
            "/r/talesfromtechsupport would probably appreciate this :)",
            "Watching bondage porn on the work computer?  You betcha that's a paddlin'.",
            "I play video games on archive.org",
            "\"Okay, see you later!\"\n\nA brilliant exit line.",
            "As a former, longtime IT weenie, I must admit that this made me rather moist.",
            "I guess the office wasn’t pegging her for that type of employee.",
            "This story is a lesson: do not fuck with IT people. They have the real power.",
            "Plot twist: Embarrassment is her kink",
            "Manager- u can't look at that stuff at work \nKern- l know u should punish me\nManger- yeah your punishment is to not come back to work",
            "This is awesome. Stuff like this is why i love this subreddit.",
            "I bet she was so red she glowed the rest after that XD",
            "Nice.",
            "Eh, least it was only bondage.",
            "/r/talesfromtechsupport",
            "i’m surprised she wasn’t fired",
            "WAIT WAIT! what happened after that! you left us hanging! DETAILS man!",
            "She deserved a good beating for that",
            "Hahahahhahahahahaahhahahahahahahahahahahahahahahahaahahahhahahahahah",
            "She should be fired for this.",
            "[removed]",
            "It's not that she couldn't talk in private. She wanted you to spank her....\n\n\n\nAnd you did",
            "Cool guys don’t look at explosions",
            "[removed]",
            "Quite possibly the best post I have ever seen on this thread",
            "How tf yall have time to watch porn at work? I'm on my feet doing shit for 10 hours straight",
            "[deleted]",
            "im fing dying",
            "Emails: am I a joke to you?",
            "Hahahahahahaha. You're awesome.",
            "What happened after?",
            "Think she gets fired?",
            "[deleted]",
            "So savage. I'm too polite I would had given her a note haha",
            "Why the fuck would the company even let you access that on a work computer?",
            "You are my hero.",
            "Surely you could have emailed her first asking if she could spare a few minutes during lunch or some other time? No?",
            "Just wondering why something like this wouldn’t be an email in the first place?",
            "That girl will get harassed about that for the rest of her life.  Not all heroes wear capes.",
            "[deleted]"
        ]
    },
    {
        "post_id": "f8yj5m",
        "author": "wworrall",
        "title": "They wanted a bigger glass, so he gave them a bigger glass.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f8yj5m/they_wanted_a_bigger_glass_so_he_gave_them_a/",
        "score": 17502,
        "num_comments": 466,
        "created_utc": 1582579705.0,
        "selftext": "My parents and I were on vacation a few years back, and hanging out at the Hotel bar. This place was one of those places that was cheap, but everyone who stayed there thought they were better than everyone else. A couple (Male & Female) walked in talking about how \"Nice and quaint\" the bar looked. They sat down at the table next to us. You were supposed to order your drinks at the bar, then sit down. But since it was a slow night the bartender walked over, and served them. \n\nBartender - Hi, what can i get you?\n\nMale - What wines do you have tonight?\n\nBartender - (Reads off wine list)\n\nFemale - Ooo, a Rose wine would be just perfect.\n\nMale - Make it two.\n\nBartender - Sure that'll be $15\n\nMale - We're going to open a tab.\n\nBartender - Unfortunately we don't do tabs here, you have to either charge it to your room, or pay cash.\n\nHe throws his room card on the table.\n\nMale - Ugh, Fine. Charge it to that.\n\nThey laugh as bartender grabs the card, and heads back to the bar. Bartender pours their drinks, and brings them back over. The first thing they did was hold up the glasses. \n\nFemale - Hmm, these are rather small, do you have any bigger glasses?\n\nBartender - Unfortunately those are the standard glasses.\n\nMale - Really? We're paying $7.50 a glass, and you're going to get chinsy on us? Surely you have bigger glasses, come on.\n\nBartender (clearly annoyed) - Ok, I'll go check.\n\nHe went to the bar, and came back out with two glasses that I think were supposed to be for margaritas, but were atleast twice the size as the wine glasses. He held them up for them.\n\nBartender - How are these?\n\nFemale - Oh, those are perfect.\n\nMale - Yes, thank you.\n\nSo bartender puts the bigger glasses on their table, then takes the smaller glasses and dumps them into the bigger glasses. \n\nBartender - is there anything else I can help you with?\n\nThey didn't say anything, just sat there dumbfounded.\n\nBartender - Great.\n\nMy parents and I start losing it. We tried not to laugh, but we were all a bit inebriated I guess. Bartender looked over at us and smiled. My Dad gave him an extra $10 tip and said \"Thanks for the laughs\" Don't fuck with the people who serve your drinks lol",
        "permalink": "/r/MaliciousCompliance/comments/f8yj5m/they_wanted_a_bigger_glass_so_he_gave_them_a/",
        "comments": [
            "Meanwhile bar glasses are all smoke and mirrors. Back when I was a manager at a bar, they sent us a case of the wrong style and size martini glasses. They were 4oz, we served in 5 oz glasses. Distributor just said keep them. We ended up having to get into 4 oz glasses one night. Wouldn't you know it, a regular lost their mind when they got their 2nd round in a 5 oz glass... And insisted they get the 4 oz one... Cause it was bigger. What ever.",
            "They actually expected them to top off those glasses?\n\nMy god.",
            "I'm a bartender and people ask for a bigger glass all the time, sometimes pint glasses for their mixed drink. They seem to think the amount of alcohol is proportional to the volume of the glass. Wrongo. I usually inform them that this just means they'll be getting more mixer and they're shocked or confused. One guy was like \"yep, that's what I want. I don't want to taste the vodka.\"\n\nMan knew what he was about. I respected that.",
            "[deleted]",
            "My old head doorman was not a people person when it came to complaints about glass sizes. Customers used to think complaining to a doorman was better than going to the bar.\n\nBest one he ever did was invite 2 complaining customers outside as there were bigger glasses out there.\n\nHead doorman: \"you see that bar across the road? Well they have bigger glasses than here so you can fuck off over there!\"",
            "hahahahahahahaha i freaking LOVE THIS!!!!!!!!!  I remember once when i was a kid and my family went on holiday. We were at a restaraunt and Dad ordered a beer. Well it came in this HUGE arsed glass , thing was about  16 inches tall! Dad kept admiring the glass so while he was in the bathroom, my brother and i went up to the bar and asked if we might please purchase an empty beer glass. I think i was about 11 at the time, my brother was 13 so the bartender must have thought we were pretty cute because he actually sold us an empty glass for $5. We were SO excited to give it to our parental unit when he got back to the table haha. Its still kicking around at the back of the kitchen cupboard!",
            "It’s so funny when guests think they can outsmart the bartender for extra drink. My favorite is when they ask for a drink with light ice and/or light mixer and then try to get mad that the glass comes out half empty. It’s like ma’am we’re literally giving you exactly what you asked for, less mixer =/= more liquor by any means. If you want more, order and pay for more. Thems the rules.",
            "It’s like people who ask for less ice and a bigger cup at Starbucks thinking they’re getting more coffee. Nah, now you just have lukewarm coffee.",
            "I love that they acted like $7.50 a glass was *expensive.*",
            "I feel like I would've made sure the couple heard me laugh because of how absurd they were being",
            "I work at a restaurant attached to a time share place. Those people think I'm their slave. They're trash and their time share is cheap as shit compared to where we are. Our house wines arent even as cheap at 7.50 lol",
            "> Don't fuck with the people who serve your drinks\n\nOr your food.  You have no idea what they are doing with it out of your sight.",
            "They are the same kind of people that order a margarita “without the ice” then act devastated when they get a glass that’s 1/3rd of the way full.",
            "It reminds me of [the story where Americans chose McDonald's quarter pounders over A&W's third pound burgers](https://www.mentalfloss.com/article/76144/why-no-one-wanted-aws-third-pound-burger) because they sounded larger.",
            "It’s funny that he thinks 7.50 a glass is a lot",
            "I tended bar for 10 years.  People have tried everything you can imagine to get free stuff or get me to serve unlawfully.  People can be pretty entitled.",
            "Maybe I'm just a bit confused. But isn't charging to the room essentially the same as a tab? \n\nWhenever I've been to hotels anything you order just goes to the room and you pay at the end...isn't that the definition of a tab (minus the room if it's not a hotel)?",
            "That’s a wonderful old bar trick. I’ve done it several times myself.",
            "Once I asked a tall glass of water at a bar. He brought me a pint glass filled of water to the edge. Challenge accepted. I drank all of it.",
            "It's crazy how many people don't understand a 250ml serving of wine is considered a large and start to complain. Not my fault you have a novelty glass at home that fits a full bottle.",
            "Never piss off your servers. It is just common sense.",
            "You want a bottle's worth of wine for $7.50? Go get some Boone's Farm.",
            "People who ask for no ice in the drink \n\n“I want to be able to taste the alcohol”",
            "don't you serve the same amount no matter what size a glass is? what was their point in wanting them bigger lol. It's pay per ammount not per glass",
            "Perfect",
            "7.50 is not an expensive glass of wine.... that's pretty average I'd say",
            "This is some straight up Monkey’s Paw shit",
            "Do people really use the word quaint?",
            "Guys, he was far too old for them",
            "Swish",
            "Gotta love people who think that because they're paying; they deserve everything.",
            "Wow I did not see that coming, although I probably should've",
            "7.50 for a glass of wine is so cheap lol usually when I go out the lowest is like 14",
            "NOLA?",
            "Love this! Brilliant!",
            "My in",
            "Okay, I really don’t like wine so I may be wrong, but $7.50 a glass sounds normal to me? They really never seem to fill it close to the brim or anything. I have no idea why they would have expected differently.",
            "One of the saddest moments at a bar is when an alcoholic picks a fight with the bartender over pour size. It’s even rougher when it’s 5:10, they’ve just started drink service, and the guy is already on number three.",
            "I have people ask for drinks with light ice. If you ask for a soda with light ice I'll fill it up to the top of the glass with soda bc pricewise it's not really an issue. However when people get a cocktail light ice and it comes out only 2/3 to the top of the glass they complain. If you want a double.......... pause for suspense......... you'll have to pay for a double.",
            "I’m surprised they didn’t fight the bartender for a refund, demand the manager, or argue about the glasses sizes. Good one on the bartender though for playing his part.",
            "Lord have mercy, this literally happened to me. A customer at the bar ordered a double bourbon. Because it was midshelf to topshelf I gave her a king cube, the cube got stuck halfway down the glass so it didn't fully sit on the bottom of the glass. She complained I underpoured her, so I grabbed a tong, picked the cube out of the glass and poured regular cubes into the glass.\n\n\"see? That's so much better.\"\n\nYes Norma Jean it sure is.",
            "[removed]"
        ]
    },
    {
        "post_id": "ziq69a",
        "author": "alexann23",
        "title": "my (17f) manager had me leave the new girl waiting tables on her own, so I took her at her word.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ziq69a/my_17f_manager_had_me_leave_the_new_girl_waiting/",
        "score": 17496,
        "num_comments": 794,
        "created_utc": 1670761943.0,
        "selftext": "I, (17F), am a waitress/server/cashier at a semi local Italian chain. (Not going to say which, but it's considered a \"specialty\" of the DMV area.) I recently had to take a month off of work for health reasons, since I was in the emergency room and then had to spend time in inpatient. While I was away, there were huge changes at my job, including new managers and two new employees. \n\nI've only been working there since last June, but I picked things up pretty quickly, barring the first day I had to deal with a packed dining room by myself while still in training- I'd messed up pretty badly with the computer system and needed the Manager's help. Still, it happens. \n\nYesterday, I met the new girl for the first time (it was her third day, still in training.) She's my age and a complete sweetheart, and as the dining room slowly became more and more packed, we made a great team - she got to practice working with the computers and talking to customers while I took down the orders and showed her how everything worked. It was her first time \"properly\" serving there, and she really did great considering that, certainly at first. \n\nThe other two people who were working was a manager and one other hourly employee. The managers at my job will also serve and work the counters (basically, all waitresses have to do double the work, and we still get paid dirt but that's another story.) I was running between the dining room and the counters to try to keep up (although we can only serve max two people at the counters picking up or placing orders at a time.) It was to the point where my manager and her friend had bundled up and complained about how cold it was, while I was flushed, with my coat off, covered in sweat (cleaned myself up when dealing with the food, of course.) The manager and her friend were sitting down together, alternating between scrolling on their phones and talking, only getting up to answer the phones when they'd already rung 5+ times and having people wait at the counters to be helped for 10+ minutes. It was massively irritating, but I didn't have the time/energy to confront them. \nWell. \nAbout halfway through my shift, my manager told me that I can't just go in between the dining room and the counter, and if I didn't pick one or the other she'd withhold my tips for both, since I \"wasn't fully invested in either.\" Ouch. She gave me a choice on paper, but in reality made it perfectly clear that I was stuck behind the counter and the new girl, the trainee, was on her own. There was nothing I could really do, so I just stayed at the counter, though that was plenty slammed in and of itself, and I really, really could have used my two coworkers who were screwing around on their phones. I didn't have time to answer phone calls, pack up orders, check people out, and take to go orders all at once, and I had one particularly angry woman call me a \"lazy bitch\" for leaving her on hold for about two minutes (that stuck with me.) While I was doing all this, the new girl was stuck with a packed dining room and no help. \n\nAbout twenty minutes into it, my manager approaches me looking both angry and sheepish. Basically, the trainee had messed up and charged the wrong orders to the wrong cards and needed help- though the way she phrased this was, \"you know, you don't HAVE to stay by the counter the whole time, that's not what I meant.\" I looked over and could see her friend on her phone still, and the manager herself still had airpods on and a show playing on her own phone screen. I responded in my sweetest, most respectful voice, \"I'm sorry, but as we only get paid $10/hour, my tips are too vital for me to forfeit them, so I'm going to stay put.\" (Context, minimum wage is 15.65 where I live.) She was floored and instead of helping either of us herself, waddled back to her seat and resumed her show. \nOf course, I ended up checking in with the trainee and asked if she needed my help, and if the mistake was sorted out. She said that she had things back under control and a lot of the people dining in were headed out, which was great because the counter was still slammed. \n\nThe kicker? This morning apparently a customer called in and complained that \"the blonde girl (me) and the girl with braids (trainee) were so busy that they were sweating, while the two other women (manager and her buddy) were sitting on their phones.\" I only wish i saw her face when she heard about the complaint. \n\nTL;DR- manager told me to leave the new girl floundering because she and her buddy were busy on their phones, so I took her seriously and literally- even when she tried to take back what I said because there was a big mistake.\n\nUPDATE #1-I really wasn't expecting this to blow up, wow! It breaks my heart that a lot of people can relate. I'm having a hard time keeping up with comments, but I'm reading through as many as I can. I'll update after my shift tonight...for clarity: I'm 17, my manager is middle aged. I have other applications out, but have yet to hear back- and am definitely planning on reporting to the state. \n\nI guess they cut corners here after all (iykyk...)\nI'd also like to say, yes, I am really seventeen- English isn't my first language and I was raised largely by my Ukrainian grandmother, so if my vocabulary (almost said \"vernacular\" just to mess with people) is a little dated or odd. Apologies!!\n\nUPDATE #2- I've been looking into ways to try and get things sorted out. I'm still trying to figure out the best way to report it, as I've been applying for other jobs but haven't heard back and I can't afford to be fired in retaliation. As I've mentioned in some of my responses to comments, I'm a self-supporting seventeen year old who has bills due regardless and is trying really hard to not drop out of school (so close to graduation...) I've been put in touch with social programs and assistance but they all take a really long time to hear back from. Some folks suggested starting a GoFundMe so I could afford to quit my job and still survive in the interim, but I'm not reakly comfortable doing that as I don't feel I'm a charity case (yet) to that degree. I do have a Venmo, if anyone's feeling particularly *giving,* though I'm not expecting anything obviously - @H-ann-pik23 . I'll keep this post updated. \n\nUPDATE #3- Nothing much new to report, as there's no way to do a state audit without the name of the employee (me!) being revealed. Will keep this updated.",
        "permalink": "/r/MaliciousCompliance/comments/ziq69a/my_17f_manager_had_me_leave_the_new_girl_waiting/",
        "comments": [
            "You know, having a friend call in with legit complaints isn't a bad idea.\n\nAnd if you have video camera it can be even better.",
            "I’m so glad a customer called in and said something about their laziness.",
            "Report this higher up the chain.",
            "Do you live in America? Because that's illegal and there's people paid by the state that can take this up.",
            "You're not fully invested in either what the hell kind of bullshit is that?\n\n\nThat's the same kind of manager nonsense as \"you can't sit down while you're doing nothing waiting for customers, that makes you look lazy!\"",
            "It's 100% illegal for them to withhold tips & next time, get it in writing if you can... But if they are, call your local labor board.",
            "Ugh restaurant managers are the worst. I'm 5'11 and my coworker was maybe 5' in heels. Anyways we had deep cleaning side work this particular day.  I switched with my coworker because mine was to clean the top and underside of the bottom shelves and hers was to clean the top and underside of the very top shelves. We told a different manager and she said it was fine btw. She would have needed a ladder and my back would have been killing me. Anyways we got yelled at for switching by a different manager.  I looked at him and said it wasn't my fault he didn't know how to logically utilize his employees to everyone's advantage. I'm pretty sure he had to think about that one because he stared blankly at me for a minute and walked away.",
            ">my manager told me that I can't just go in between the dining room and the counter, and if I didn't pick one or the other she'd withhold my tips for both, since I \"wasn't fully invested in either.\"\n\nI couldn't even read past this, it's fucking infuriating. It's definitely illegal, and you're a minor. Tell your manager to go fuck herself and get a job literally anywhere else - restaurants are always hiring.",
            "Nice customer",
            "I quit a job over something like this. Busy night, staying close to my section, keeping my tables happy. Manager tells me to “find something to do.” I’m sorry? I’m making sure my tables are taken care of; also the place is packed and we’re at full staff, what else should I do? He didn’t care, and repeated to find something to do. So I walked across the restaurant by the bar and like it was fate a customer dropped a full bottle of wine off their table and glass and wine went everywhere. So I go get a mop and broom. As I’m cleaning the mess my manager comes over and tells me that multiple tables are complaining they need something. And I looked him right in the eyes and said “you can’t help them?” And he said “no, that’s your job” so I dropped the wine soaked mop right where I stood, took my tips out of my book, and threw the apron and book on the expo counter and walked out. I never went back to that shit hole job.",
            "It is illegal for your employer to withhold your tips for any reason. Report those motherfuckers to the federal labor board",
            ">\"I'm sorry, but as we only get paid $10/hour, my tips are too vital for me to forfeit them, so I'm going to stay put.\" (Context, minimum wage is 15.65 where I live.)\n\nCan someone explain to me how/why this is legal. Isn't the minimum wage supposed to be, you know, the *minimum wage*?  \n\nAnd the tipping culture in the USA needs some serious work. Employers should give their employers good enough of a wage that they can live off it, and not have to rely on tips. Imo tips should be for exceptional service, where people go above and beyond, not a way for corpos to avoid paying the staff like it is now.",
            "Ah yes, the good ole \"Department of Motor Vehicles\" area.",
            "[deleted]",
            "i’m not from dmv i’m an eastern shore md girl but im so curious what the chain is",
            "I'm just curious what area is so cursed by multiple department of motor vehicle.offices, that it's called the DMV area. I can't imagine anything ever gets done there.",
            ">English isn't my first language and I was raised largely by my Ukrainian grandmother, so if my vocabulary (almost said \"vernacular\" just to mess with people) is a little dated or odd. Apologies!!\n\nAin't no way no child of no immigrant gonna speak American better then us real Americans! I call BS on this whole thing. Ain't no way this happened. I ain't never met no 17yo girl who worked up a sweat not once in her life. That manager probably was watching to make sure you was doing the work proper and good. Ain't nothin wrong with that.  \n\n—Lady who called you a lazy bitch, probably.",
            "I hate cellphone use by employees durng working hours, bUt WhAt AbOuT An EmErGeNcY! Like realy you have 147 emergencies a day? Thats funny because all I ever see you do is scroll social media, online shopping, text your friends, streaming tv. Basically wasting time when you should be doing your JOB but your addiction to your screen comes first and let your coworkers have the added workload.",
            "Wow frick em",
            "You probably already know this, but for the benefit of anyone reading this who doesn’t:\n\nWithholding tips is wage theft and is illegal af.",
            "I’m a little disappointed the top comment doesn’t mention that withholding tips is illegal.",
            "I'm sure that we have many problems like this too but I see a lot of US-stories passing by. My god. They will do anything not top pay People (the right wage they deserve). It's mindblowing most of the times. Seeing a lot of stories about people working 2 or even more jobs just to je able to pay their bills.\n\nI hope that the official organisations will deal with the issues that you and your colleagues are encountering. Good luck!",
            ">English isn't my first language\n\nLiterally nobody would have known that if you didn't say it :P",
            ">  she'd withhold my tips for both\n\n\"I'm sure the state labor board would loooooooooooooove to hear about that, wouldn't they?\"",
            "/u/alexann23 \n> I had one particularly angry woman call me a \"lazy bitch\" for leaving her on hold for about two minutes (that stuck with me.)\n\nSomething I learned a while ago, but occasionally still need reminding of is that \"Do not let words, especially inconsiderate ones from people who do not know you or the situation, hold power over you. Because then you allow anyone to have power over you\"\n\nDon't even sweat what a rando who doesn't know the entirety of your situation has to say. That she would say such a thing speaks volumes to her character, not yours. You focus on continuing to be a rockstar, not what dummies have to say while half informed. \n\nMaybe we'll unknowingly run across each other at Ledo's someday ;)",
            "I promise there's nothing wrong with your English. I feel like people from Europe who doubt their English are always the most articulate people -- more articulate than a lot of native speakers.",
            "Your English is better than 99% of Americans’. You never have to worry about that.",
            "I don't know where you work but restaurants by me are always looking for more staff so jobs are easily changed.  Since your managers are lazy butt holes you should start a job search.  You probably can't do worse than you do now (though make sure they do enough business to match your current place or you might lose out on tips).",
            "Good on that customer, a good reminder that we can help out employees too by making those kinds of complaints.",
            ">if I didn't pick one or the other she'd withhold my tips for both, since I \"wasn't fully invested in either.\"\n\nThis manager is a lawsuit waiting to happen.",
            "You're a very capable young person and you sound very mature. I wouldn't have been able to handle that as well as you did when I was 17.\n\nThat shit is completely unacceptable and you need to talk to the higher ups. Fucking bitch sitting on her ass while two junior employees are slammed trying to run the whole operation.\n\nGood luck, hope your situation gets better.",
            "Manager: \"Hey, we're getting slammed here, you guys better work harder.\"\n\nAlso manager: \"Ok, back to my own shit.\"",
            "Ledos is a shitty place to work and from the description of the manager you may have worked at the one my brother did.",
            "I'm glad a customer called in. I do the same any time I see bullshit like this. I rarely complain, but situations like this I call corporate if there is one. OP: piece of advice, although unsolicited. Get yourself a skill set in a career that you're needed in and nobody gives you shit. I'm a Therapist (Mental health) at a community organization so I'm out of the office 90% of my time. I can find a new job tomorrow if I want to, and do a good job. My manager talks to me maybe twice a week and it's usually just to say hi. Make yourself valuable enough that you can leave at any time and it makes life easier.",
            "You should talk to the owner of the franchise at some point about the lazy manager.  Most owners don't like lazy management.  It loses them money.  And tell the owner about the manager threatening to steal your tips.  If that doesn't work,  go to corporate.  They DEFINITELY don't like a potential lawsuit.",
            "You said the customer calling you a lazy bitch stuck with you. \n\nThink about this and let it stick. You had her on hold.  You were busy working else where. Her response had nothing to do with you it is a projection likely due to her own laziness.  Rather than someone who understands busy she is likely someone that fucks off and is lazy while working and therefore automatically thinks everyone else is just \"lazy\" like her. \n\nAlso. Seek other employment. Those \"managers and coworkers\" are toxic and it will lead to resentment that simply isn't worth it.",
            "Fantastic, but can you confirm if we’re talking Ledos here?",
            "Your manager cannot withhold your tips. Ever. Not even a penny. If she/he threatens you with that nonsense again, politely remind them that the Labor Board would love to hear about that.",
            "Next time I’d take a video of a packed restaurant ending with them sitting on their asses. Send it to their boss and social media.",
            "Anonymous complaint up the ladder. I hope this will Ledo to some changes.",
            "WTH. They can’t withhold your tips for one. They need to learn about wage theft and learn how to delicate jobs and share the workload. That place sounds toxic to me.",
            "You're doing great. Her withholding your tips is illegal, so please keep that in mind (if you're in the US)",
            "I'm trained as a host and that is my primary job. One day I was handling To Gos because the person scheduled didn't show up and didn't call in. \n\nI had 30 orders in less than an hour and we ended up shutting down the dining room and three waiters came back to help me. We had more than a dozen delivery drivers in our dining room waiting for their orders and the kitchen staff were slammed, tired and making mistakes.\n\nDid management help? Nope. Did they turn off the To Gos some we could catch up? NOPE.\n\nI stayed 4 hours PAST my clock out time. When I got home I went online and sent an email to Corporate with copies of my clock in and clock out ticket and the photos I managed to get of the tickets coming in, the dining room and the kitchen staff.\n\nMy manager the next time I came in handed me an envelope with about 150$ worth of tips and OT pay.\n\nI turned around and split that with the 3 waiters that helped me and the 2 kitchen staff that had to deal with the bullshit.",
            "Not sure if someone posted but withholding your tips is theft. It's your money and belongs to you.",
            "Just so you know, your English is perfect. :)\n\nFor ease of reading though, when you write a lot of stuff, if the paragraph starts to look chunky/big, just break it up a bit. Make smaller paragraphs. It makes it easier for the reader. \n\nI enjoyed your story. It’s nice that you helped your new colleague. \n\nGood luck.",
            "Pretty sure withholding tips is super illegal.",
            "I’m really impressed by you, OP. Good on ya for standing up for yourself!",
            "You are right. Your tips are vital and you protect them and yourself! That manager, or other employees who do not jump in where needed cost YOU money that you require to live. They are not going to pay your bills. They are not protecting your job. They are screwing with your quality of life. The hell with them.\n\nBack in the day I considered any one who callously effed with my tip making ability an enemy committing an act of war. \n\nHave a friend, or relative come in and video them playing on their phones with a packed house. Email it to the store manager, or even to corporate anonymously. No mercy!",
            "man as soon as you're 18, jump that shit.  you can easily make 20-40/hr waiting tables in the burbs, the city is great with places after you're experienced.",
            "I thought your writing was marvelous, it was a treat to read, and I love writing and reading. Rule #1 for a good manager is never be afraid to do what you ask of your employees. Rule #2 is don’t be afraid to delegate, but first get in there and work. I’ve seen managers help wash dishes when we needed it, mad respect.",
            "I had a newish manager cut the floor early, didn’t tell me so I had my half of the 3rd dining room and a bunch of tables in the other half from the girl she cut. Then she moved me to the middle/2nd dining room and sat a bunch of tables (at this point there was 1 in the 1st, me+1 new employee in 2nd). Then she cuts server in 1st and moves me there. \n\nAt this time I have 17 tables (at least 50+ people) spread across 3 dining rooms, no prep cook, very little of the server aisle cleaned or prepped b/c she sent them home without checking, and a cook that kept disappearing to the walk in to play on their phone. I had also been working since 7 am without much of a break and I have to help the newbie with everything. And some asshat stole my bin of silverware I had washed and polished and was waiting to roll, so I was gonna have to redo that…\n\nThen our night manager and retail manager come in and get food in the 3rd and want me to serve them. Then the regional manager comes in and they sit him in my section and demand I serve him. So then there is a grand total of 4 managers sitting watching me suffer and they had the audacity to call me over and ask why I seem flustered… I snapped and told them I had 17 tables and zero support from management so I was in the weeds and to forgive me for not being quick enough with their refills… 🙄🙄🙄",
            "Aside from what everyone else has said, have you or anyone else had their tips withheld like they threatened? That is also illegal, so be sure to mention that when you report your workplace.",
            "I was at a party on Friday and apparently there was a miscommunication about the number of attendees. There was 1 server and 1 bartender for a party of about 100 people. It was a low key event so if the manager had helped it would have been fine. Instead she was playing on her phone in full view of everyone while the bartender had as many as 20 people vying for attention. After a couple complaints the manager finally at least started helping by doing some bar back type stuff (clearing glasses, refilling can and bottle drinks etc.) and it was clear she was only doing it because there were like 10 people waiting and the bartender was too slammed to go grab refills and was almost out of glasses.",
            "Op, good for you for sticking to your guns. I wanted to point out to you, as your manager threated to withhold your tips as a disciplinary tactic, this is illegal and wage theft.  Your earned tips are yours and your manager may not withhold them from you for any reason. We don't have a lot of workers rights in the US, but believe me, you should familiarize yourself with them especially because your age will make employers feel safer crossing that legal line with you.",
            "They threatened to withhold your tips? Is it even legal?",
            "I got totally sidetracked on the second sentence:\n\n> (Not going to say which, but it's considered a \"specialty\" of the DMV area.)\n\n**Department of Motor Vehicles?**\n\nI had to use the qualifier 'area' to get the correct answer:\n\n*DMV area*\n\n**D.C., Maryland, Virginia**\n\n*The Washington metropolitan area (also known as the National Capital Region and colloquially as the DMV for \"D.C., Maryland, Virginia\") is the metropolitan area centered on Washington, D.C., the capital of the United States.*",
            "Sounds like Ledo’s is about to see a big dip in sales! \n\nBest of luck on your job hunt",
            "I wanted to guess the chain when you said DMV area, and I guessed correct. We got takeout from the chain tonight. Glad your health is better.",
            "This is sadly what the industry has come to,  people who only care about paychecks while others who genuinely care about good service and work ethic are expected to pick up the slack and continue doing a good job..",
            "I used to live in the DMV area and I moved to the Bay Area. No one I’ve met out here knows what the DMV area is and I’ve just started saying DC since every time I would get “tHe DePaRtMeNt Of MoToR vEhIcLeS??” I’ve missed living there.",
            "If you’re in Yankeeland, it’s federally illegal for an employer to withhold your tips. Might want to post this on /r/talesfromyourserver.",
            "Excellent!  …that a 17-year-old nowadays can write a full story with real grammar and spelling. So many other subreddits I frequent have people who are offended by anyone even pointing out to them that “alot” is not a word.",
            "Doing groups projects in school is a warning of how working will work in the real world.",
            "not sure if anyone else mentioned yet but withholding your tips is illegal",
            "r/USdefaultism ? \n\nOr is DMV area in some other country?",
            "[deleted]",
            "You are incredibly mature for your age and seem to have tremendous potential. I hope you plan to get a higher education (or specialized training in a field) and use your drive and determination to its fullest.",
            "Man, I would have been in the thick of it with everyone. I admit to sitting in the office on my phone but I always always have an ear out when I hear my name and help I get up and leave my phone in the office. I hope they get more complaints",
            "Sounds like the worst kind of manager and exactly the kind i strive not to be lol. With all the clues you left, I'm pretty sure i know exactly what spot your talking about and never really loved it haha. Unfortunately a lot of the dmv area's food establishments have shit leadership or conditions, but not all. There's better out there and everyone is hiring. Don't be afraid to check out glassdoor or other company review sites either. I found the people in this area are quite good at using those whenever a company is shite.",
            "It’s Ledo Pizza. Great pizza but I’ve had friends and family work for them in the past and it really depends on the location whether it’s going to be a positive experience. My cousin worked at the one in Crofton for like 3-4 years with few problems and then had a buddy leave another one after a couple months because the manager was a twat waffle. The staff at the one near me in Rockhill SC seemed pretty chill and they were all working equally.",
            "$10 / hour? Unionize y'all",
            "It is illegal for your manager to withhold your tips for ANY reason EVER. She is making empty threats because you’re young and she thinks you won’t know any better.\n\nIf she does this again, threaten to report her to the labor board and tell someone higher up in management than her. I guarantee she will be dealt with swiftly.\n\nSource: been in food industry over 20 years.",
            "Sounds like you are in a difficult if not impossible position. My daughter is 18 and has gone through several similar positions but has been fortunate enough to be able to leave the terrible work places. \n\nRegarding your vocabulary,  your post was far more readable and easier to understand than some work emails and texts I receive!\n\nBest of wishes to you, hopefully an observant employer will see what a valuable asset you are and treat you accordingly.",
            "Yea i’ve worked jobs where people were sitting on their asses while I tried to get things done.\n\nBut once I see a manager/supervisor notice the person slacking and not fixing it? I go into slow mode. I do everything I can as slow as possible. I get things done but I don’t rush, I don’t hurry, I just work as fast as I would if there was no backup. \n\nThe problem usually gets fixed after that. As working normal during a rush just makes the lines backup faster.\n\nKey advice. Never bust your ass if a manager and another employee are just chilling. They’re not gonna fire you. If they do then its not a place you want to work anyway. There’s a ton of waitstaff jobs out there, no reason to bust ass to save a crappy job with a manager that doesn’t like you.",
            "If someone on the phone called me a \"lazy bitch\" I would hang up.\n\nThen feign complete ignorance when they call back. And hang up on them again as soon as they called me another name.\n\n\"Calling people names isn't getting you anywhere. Do you want to try another approach?\"\n\nYelling? Hang up.",
            "Put it on Google reviews. They're very difficult to remove.",
            ">considered a \"specialty\" of the DMV\n\nI think I have a 50% chance of eating your pizza today",
            "Your English writing is pretty stellar, in my opinion. Never would have guessed it wasn’t your first language. I haven’t served tables for 10 years or so, but I still have an occasional nightmare (or Applemare, as many of us at a certain US chain restaurant called them) of the full dining room, check error, no help scenario. It’s good that someone was mindful enough to notice the manager sitting around and complained.",
            "Cutting corners eh?(ikwyk). Figured as its about the only DMV local Italian chain.  And with the min wage statement,..  howdy neighbor!",
            "English may be your second language, but your command of it is impressive.",
            "You should post screenshots of you reddit post on twitter and tag your restaurants corporate account.",
            "Fucken expose them",
            "This really reminds me of the time I messaged my manager friend who works in a spoons (chain of budget pubs in the UK)\n\nMy friend was sat in the corner on their phone smirking while I could see the staff glancing and getting quite annoyed. I messaged my friend asking if they're comfortable over there. Then he came over to talk to me. I've known this guy since I was a kid and we're more like brothers than friends. I didn't hold back with the insults.",
            "Sounds like North Italia",
            "I’m wondering if I’ve been exactly to the restaurant you’re talking about. I graduated from GMU earlier this year and lived in the DMV area for 12 years. Hopefully things work out for you and you get better treated by your manager and the other employees. Also, glad to hear you’re feeling better and back on the saddle.",
            "I'd have taken a video of the busy place and the two coworkers fucking off, maybe 5 or 6 times and made sure the owner saw them all.",
            "Dude, you need to tell us the place so we just don’t go there. People in the DMV are super foodies and we sure don’t like to support shitty business.",
            "Your English is actually excellent. Hope you get out of that shit",
            "We've had similar at my work (a shop). We've been absolutely slammed and we've called every till trained person to the tills and the floor manager and her friend refused to jump on, instead they guided people to the best tills to use, leaving two empty tills and queues going down three while aisles and into a fourth. After a customer complaint, the friend got promoted to supervisor and not long after, the floor manager got promoted to assistant store manager.",
            "Hey Lido pizza! 👋",
            "[deleted]",
            "If someone threatened to withhold my tips, we’re fighting",
            "When I was 17 I worked at Wendy's with this dude who was obnoxiously loud and arrogant. It was slammed for lunch one day, I was on front reg and he was on the line. The counter was slammed and this fuck was being so loud that I couldn't hear the customer right in front of me. I asked directly if he could be quiet so I could actually hear customers, to which he said he doesn't take orders from girls. The customer heard it and said how inappropriate and rude it was. So, that night my friend and I left a phony complaint on the restaurant website as that customer who heard him (he was disgusting and harassed me a lot so I felt good about it). The district manager came in a couple days later and ripped him a new one. He was quieter after that.",
            "I would've walked out after the manager threatened my tips. No point in dealing with that nonsense at all. I would have put up with it when I was your age because I am admittedly a people pleaser and didn't know I didn't have to take that.",
            "Middle managers are the worst scum on the planet.\n\nThey're akin to police. Get paid just enough to be betrayers of their class. Feel special and powerful. They want to be something and someone they're not, and that makes them dangerous.\n\nFuck these people. When the time comes and the job doesn't benefit you anymore, burn the motherfucker down.",
            "Mama Lucia’s sucks anyways. The owner is a creep who has been arrested multiple times for sexual harassment of his employees. You can do better",
            "If you're a non-native speaker, NEVER apologize to US native speakers on Reddit. You've already shown you're more intelligent than 98% of us knowing a second language at age 17 well enough to fool a 57 year old native speaker (me)!",
            "i worked as a hostess at a restaurant that was super understaffed. we went from having 3 hostesses every shift, to me working by myself almost every shift. one day we had a huge line of people waiting outside before opening and just me to seat everybody. i asked my manager who was just standing and watching me if he could walk a party to their table for me (managers always did this for us). he said no. no explanation, nothing else to do, just said no and gave me a sarcastic smile. then stood there and watched me open and seat about 7-8 parties by myself. \n\nhe ended up leaving to go manage at a hotel weeks before covid hit. idk if you remember but hotels were one of the first industries to be hit hard by covid. mass lay offs.\n\nthe next time i saw him, he was serving at a neighboring restaurant that i was dining at once restaurants opened back up.",
            "First off I wouldn't have k own English is a 2nd language so hats off to you! Second just keep yourself available for other opportunities that arise, and keep helping the trainee (hopefully you can  take her with you when you leave) and leave your current place in the red",
            "Sad to hear another story about how management doesn't GAF about their job, their customers,  or the business the work at.  They are slack, and it creates a toxic environment for the staff like yourself, who do extra work to carry that workload.  Unfortunately, it's incredibly common when wages are not enough to live off, you should never have to need tips to survive. \n\nApparently Seattle is now making great strides in this area to give hospitality workers a real wage.",
            ">Some folks suggested starting a GoFundMe so I could afford to quit my job and still survive in the interim\n\nGetting help that levels out the hardship you're facing good and just and everyone does it\n\nLiterally no one is getting through life without help. Everyone else are accepting help on a daily basis. I promise you. Everyone's getting help all the time\n\nIt's only those of us who've been neglected that have been taught that we're not supposed to receive help. That we're supposed to do everything on our own, no matter how heavy the load\n\nI lived through that until I reached 30. Please believe me when I tell you that it's a lie. You need more help, so you feel like more of a burden. But the reason you need more, is because everyone else are covered in help already\n\nSome have parents who keep them fed. Since have never been forced to spend mental energy worrying about losing housing. Some have their own cars. Some have parents who make them for and drive them everywhere into their 20s. Some actually get paid close to how much money they make the company they work for. Some make more than their labor produces\n\nYou won't get anything from refusing help. Help connects people, it's valuable, it's meaningful, it makes us feel like we make a difference, that there are things in this world that matter\n\nDon't live your life on hard mode. Accept all the help offered to you. I promise, it'll provide you a better life with better relationships. The people who genuinely care about you and would like to help places where it would make a big difference to you, but would cost them little, are the ones you want around. Where the respect and help is mutual. The ones who prefer you to do everything yourself and would be offended if you asked for help - you don't want them around\n\nYou are so far from taking advantage of other people, it's gonna take a lot of effort to rewrite and unlearn before you have to worry about falling into that camp\n\nYou deserve as much grace as the rest of us. Don't live life on hard mode. Life is a marathon, not a sprint. Give yourself breaks. Learning to reach out for help is the most important tool to acquire. When you've got that, you will be able to get through anything. Anything\n\nI truly wish you all the best ♥️",
            "Popular Italian chain in the DMV.... Ledo's?",
            "A GoFundMe would help you get a stable home once you turn 18. Rent is expensive and you want to go to college, easier to study and succeed with a stable home.",
            "U/alexann23 - Just an idea (and I’m SO HAPPY TO BE THE FIRST ON THE LIST), you have a huge untapped resource of thousands of new online friends who are happy to inundate your corporate owners/franchisee/corporate headquarters with complaints of sightings we experienced with these horrifyingly unhelpful trolls who let you slave away whilst they caught up on their favorite shows with their work bestie. \n\nThat’s some bullshit. If I’m sweating, damn sure every single other person better be sweating too. \n\nIf you were to create an anonymous Reddit account that created a post that was a deniably unrelated for HR, but but let’s us know your restaurant, we could be well on our way to starting some social media noise on Twitter and the like. \n\nMy other suggestion is to look into reporting the company or just the location to the IRS. I believe you might be able to do that anonymously with an explanation for what your concerns are about the company. Definitely Google how to report concerns about abuses of child labor laws.\n\nREMEMBER- you need to find someone to come help look at accounting, which is fucked. Not to understand or identify if they are breaking the laws for your jurisdiction. \n\nLastly, I suggest getting a cheap body cam that is in the form of a pen or something that would fit into your uniform or attire. Do check with your local law enforcement to ensure it isn’t illegal to record people without their knowledge or a warrant in your county. Just some way to validate your claims when you talk to your superiors. \n\nNo matter what, it sounds like you have a substantially bright future ahead of you and these pitiful excuses for managers will be a comedic story you recall to your friends years from now when you have conquered the world!",
            "Didn't know they had restaurants at the DMV",
            "When it said my 17f manager I those that the manager was 17 till I read the rest",
            "FYI in case you don’t know, your employer can’t withhold your tips for almost any reason. Your money is your money. Typically your tips must be enough that you make more than minimum wage. In a lot of cases this includes your state minimum wage. As a punishment such as in this case, it’s never ok. Your manager is a total fuck… whoever owns this restaurant should definitely be made aware that their manager is doing things that could cost them thousands.",
            "actually, u should have ur fam and friends submit complaints to corporate about that... and point out how y'all were busting ur ass and they sat and played with their phones the entire hour and refused to help.",
            "man fuck lazy managers. they’re gonna just do the bare minimum while people being paid pennies in comparison cover all their work? shit like this is a part of a much bigger issue in the service industry. i’m glad it didn’t blow up in your face and that lazy bitch got told off",
            "Honestly I’m just impressed the Department of Motor Vehicles has a specialty Italian restaurant chain",
            ">I \"wasn't fully invested in either.\"\n\nDon't tell me that while you're playing with the electronic pacifier instead of working. You're not going to like my perspective on that.",
            "Okay you lost me at only 10.xx hr. That's more than minimum wage here and more than I made at my first job at 17 🙄",
            "[deleted]",
            "$15 minimum wage? Wow Where I am minimum wage is $7.25 and hour and most places only pay servers like $2 an hour and they have to make the rest in tips",
            "They can't touch your tips.\n\nThe local chain will fire her in a second if they find out about this to avoid dealing with the state.",
            "Do you live in BC? We don't have servers wage here.  Minimum wage across the board is 15.65.",
            "Is withholding tips legal?",
            "Don't really have any tips and pointers to tell you, as what needed to be said has been said. Just wanted to say chin up! And you will get your just deserve, as will your \"manager\". You got this!",
            "You seriously need to contact a lawyer for your stolen wages. Just type into Google your city and labor lawyer. I did Washington DC labor lawyer and this was the first result. He's also got a whole page just for restaurant workers. May as well send an email or call around to see your options.\n https://www.mselaborlaw.com/resources/private-employees/restaurant-and-food-services",
            "Carrabas?",
            "Those managers were probably on r/antiwork complaining about their jobs. Sounds like they've completely phoned it in.",
            "You sure showed her, she must of been so flustered while relaxing on her phone watching you guys work",
            "Typo on last line?\n\n> even when she tried to take back what ~~I~~ *she* said because there was a big mistake.",
            ">English isn't my first language \n\nYour English is better than most American high-school graduates.",
            "What is iykyk?",
            "Wat mean “DMV area”?"
        ]
    },
    {
        "post_id": "jnf0e4",
        "author": "mynamehere90",
        "title": "Recycling bin has to be unusable? Okay",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jnf0e4/recycling_bin_has_to_be_unusable_okay/",
        "score": 17493,
        "num_comments": 382,
        "created_utc": 1604425755.0,
        "selftext": "This one is short and the comments on another post here reminded me of it.\n\nThe city I live in provides you with one recycling bin for free. If you want an extra one it's $10. If it breaks for any reason they replace it for free.\n\nWhen I moved into my house the old owners left the recycling bin. Both handles were broken which made it near impossible to carry so I took it to the dump to exchange it. When I got there I was told it was still usable so they won't replace it, but I could buy a new one for $10. After a bit of polite arguing I asked if there were any restrictions on how the bin breaks to have it replaced. They said no, if it breaks for any reason at all and is unusable they would replace it. So I placed it on the floor and stomped on it a few times, until it was in pieces. I then picked them up and put them on the counter and said \"Excuse me, my recycling bin broke and I'd like a replacement please.\"\n\nThey had no issues giving me a replacement.",
        "permalink": "/r/MaliciousCompliance/comments/jnf0e4/recycling_bin_has_to_be_unusable_okay/",
        "comments": [
            "[deleted]",
            "It's like that MASH episode where Margaret needs a new trunk but the army won't replace it unless it was \"damaged in combat\". She shot it with a shot gun :)",
            "This reminds me of turning in our uniforms at the end of Army infantry school to get new ones, only kind of the opposite.  A lot of people got it into their head that they'd refuse to give you new uniforms if your old ones weren't damaged beyond repair, so they went crazy tearing them into rags.  We got to supply and the people there just took all our old uniforms, no matter the condition, and gave us new ones.  I was more than a little miffed.",
            "The employees know how stupid it is, but they don't make the rules and aren't going to risk getting fired by breaking them.",
            "[deleted]",
            "I could see that guy you were talking to getting yelled at by his boss for accepting a \"still usable bin\".  Then later, getting yelled at for accepting one like that and breaking it himself so it could no way be usable.  So he just had to be the jerk because that's what the boss said. \n\nIts like his own little malicious compliance",
            "Lol I work for a waste management company. We replace recycling and trash containers for free, but they have to be damaged. Back when I worked in customer service, I would get calls and emails from new homeowners who wanted new containers because the ones left were old or smelly, etc. I tried so hard to obviously hint it people that the container has to be BROKEN for us to exchange it, wink wink, but only a few people got the hint. The majority of them were too busy yelling at me as soon as they heard me say “unfortunately” that they totally missed it before angrily hanging up. Sorry 🤷🏻‍♀️",
            "Did something similar with my driver's license a number of years back. If you moved, you had 30 days to get a new one with the new address, and it cost you a few bucks. I was waiting in line with it out and bored (DMVs tend to do that) and was chewing on it. Broke off a corner of it. Got up to the line and got told that there was no charge since it was broken.\n\nEvery time I've had to get a new one like that, I'd take and snap it in half just to save those couple dollars.",
            "my grandmother did something similar with a door to door corningware salesman. he claimed his plates were unbreakable. she asked if there was a \"you break it you buy it\npolicy\", he said no, and she took his plate, placed it upside down on the kitchen counter, took off her church lady shoe and smashed the back of the plate with the heel of her shoe. the plate broke, and she showed the salesman to the door.",
            "It's the same with USB dongles for software licenses. The old one needs to be broken in order for you to get a new one so you can't just duplicate all the licenses contained.\n\nI know a guy who sent a photo of his broken dongle to the company that made them, and they said it wasn't broken enough. He had to smash it with a hammer and sent proof of that before he got a new one.",
            "The university I went to provided laptops for its engineering students. If there were software issues, it was weeks to get it fixed. If there were hardware issues, they'd replace it. You can imagine what people would do when they started having problems.",
            "I feel like I’m having dejavú. Was this already posted before?",
            "I did similar with a tape measure. I broke just the blade on a Craftsman tape. They had just changed the policy. Instead of a new tape they'd give you a replacement blade. Brought it in and when they said just a blade I walked out the door and in view of the counter smashed it on the sidewalk. Replaced no problem.",
            "I did this exact thing with a cell phone I had under contract with AT&T about 10 years ago. I had insurance on it but the insurance wouldn't cover the screen being cracked unless the screen didn't function. I smashed it right there on the spot and got a replacement.",
            "Gamestop's won't take a sealed game. \n\n*Opens game box in the store*\n\nOkay sir, we'll give you $2.78 or 3.50 store credit.",
            "By the sounds of it they were on your side and giving you hints while having to comply with crappy rules from beyond.",
            "Now they can recycle it.",
            "\"we MUST follow the rules....no matter how stupid they are.\"",
            "Reminds me of one bloke on Reddit who had his car fail the inspection for a cracked rear view mirror on a windowless van. He asked the inspector if it would pass if the mirror wasn't there. The inspector said yes and the guy ripped it off and threw it to the back of the van. The inspector shrugged and passed him.",
            "This sounds like the person at the counter had very specific instructions from their higher-ups on what an unusable bin actually was (i.e. Can't store anything) and really didn't care how/why it was broken. Sounds like a decent person, sorta like how if you go to a dump in the UK, they don't explicitly say you can't take anything, they just say things like \"there's cameras\" or \"my boss might be about\". The camera thing is like if you're taking the piss with how much you take or if you take it and they hear about a fly-tipper in a few days or something. Since it's in a place to go get recycled, it's not like you're stealing so it's alright to do more or less.\n\nEnjoy your new recycling bin :)",
            "\"It can be broken for any reason.\"\n\n*watches man destroy thing*\n\n\"That would qualify as any reason. Here ya go.\"",
            "It's probably to prevent people from claiming like 20 bins for whatever greedy reasons they have.",
            "I would have gone outside and done the same thing and come back, but I applaud your confidence",
            "Yeah, this guy was clearly telling you what you had to do to get what you wanted. The twist here is that this was malicious compliance on his part. It sounds like you were being a snarky ass though.",
            "INFO: how extremely small is the recycling bin that you can actually carry it in, stomp on it to break it, and then put the pieces on the counter so they fit?",
            "My sister did something similar to this when she wanted to have her phone fixed. She ended up smashing it to pieces right on the desk. She’s kind of a Karen sometimes.",
            "They knew what they were saying, and what you'd do.",
            "Had the same experience at my company. I've been keeping the same computer for a while now while newcomers would get a fresh Mac out of the oven. In the beginning I didn't care but after some time I wanted to get a new one as the old one was getting rusty. Of course since it still worked they wouldn't replace it.\n\nAfter gritting my teeth for many years one day my computer fell and got a nice big line on the screen, making it still usable but not comfortable to work. Still didn't want to replace it.\n\nSo I straight up dropped it on the floor after backing all the data to the point where it couldn't turn on. I got a fresh new one after that. I still feel bad from that but man I also deserve better equipment.",
            "Mattresses have an extra fee when dropping them off at the dump but bundles of springs and fabric don't. They'll tell you this at the gate.  \nIt just occurred to me that maybe they don't like disassembling mattresses and that this wasn't an altruistic money-saving tip.",
            "This reminds me of an old story I read, from back when Sears was still around and was known for selling good-quality tools.  But they had started moving manufacturing out of the USA into east Asia.  At that time, if you bought a set of wrenches, you could end up with either American-manufactured wrenches, or Asian-manufactured wrenches, but they were sold under the same brand name and item number.\n\nDuring a sale on wrenches, one man bought a set for himself.  But upon getting home and inspecting them closely, he realized he had not gotten the American-made ones, and he really preferred to have the American-made wrenches.  So, he went back to the store to exchange the wrenches for a different set.\n\nThe clerk said \"I'm sorry sir, but I can only exchange the wrenches if they're broken.\"\n\nThe man argued for a while, basically pointing out that he was returning them in brand-new condition, the store could take them, put them back on the shelf and sell them to some other guy who didn't care whether he bought American-made tools or not.  But of course, the clerk didn't make the rules, couldn't bend the rules, and refused to even consider taking the wrenches back unless they were broken.\n\nSo, the man took his Asian-made wrenches and left the store.  He went and bought a quantity of liquid nitrogen.  And then he poured liquid nitrogen over the wrenches until they were good and cold.  He got a hammer and smashed each wrench into several pieces.  Then, he took the pieces of wrenches back to the store, and exchanged them for a new wrench set!",
            "Reminds me of a story from the old days of Ma Bell. A friend told me she had heard that Bell Telephone would take back any defective phone and give you a new one. So ... they sawed one in half. This was not easy because it was one of those big black heavy plastic jobs, and they sawed it right through the rotary dial in the middle. (These were the days when a lot of phones were still the property of Bell Telephone).\n\nSo she went to the C&P customer service center, gave the attendant her phone number, and said, \"Hi, my phone doesn't work any more; can I get a new one?\" The attendant said, \"Sure, just leave the defective unit here and I'll grab you a new one.\" She opened up the box to show the attendant and said, \"It's really broken badly.\" The woman just nodded and went in the back to get a new one. Trying to get a reaction from her, my friend said, \"Actually, it looks like somebody sawed it in half!\" The attendant just said, \"That's fine; we'll just send it down to the shop. Here's your new phone!\"\n\nBeing a monopoly has its advantages, apparently.",
            "Worked in a flooring store once, with a manager who hated doing the paperwork for damage returns.  Many manufacturers will take back damaged product and replace it, and if not, it gets charged against various cost of doing business accounts, shrinkage, etc.\n\nIf tile, carpet, vinyl, etc. was only a little bit damaged, he'd have us put it back on the shelf, hoping someone would buy it without noticing.  We always had lots of boxes of tile that were chipped, vinyl with tears, etc.  Made the store look shabby, pissed off customers, and generally was just a shitshow.\n\nSomehow though, when the shelves started filling up with unsalable flooring, things stopped being 'a little damaged but still salable' and started to be a lot damaged.  Me and my hammer never did get caught.",
            "My financial literacy student teacher worked at a hockey store, and once sold a hockey stick with a one year warranty. Customer dutifully came back 364 days later and broke the stick in front of him",
            "That’s hilariously petty",
            "[removed]",
            "Ive had to do that with sone tools with a lifetime warranty. They would be unusable but not \"broken\". So if denied I would take it out to my truck. Stick it in the receiver of my trailer hitch. Then stomp on it or hit it with a sledgehammer.  Walk back in with the handle broken off and the same person would gladly tell me to get a new one off of the shelf while they start the exchange process.",
            "Sometimes, you just have to go \"HULK SMASH!\" to get your point across. Lol",
            "I feel like we need a YouTube channel that turns all these malicious compliance and petty revenge stories into short films. 10/10 would subscribe.",
            "This gave me a right cuckle....",
            "These stories always give me a boost of satisfaction.",
            "I worked in the model shop for a VFX company back in the day of practical effects. That business is packed with pack rats (I know, I am one too)\n\nWhen I come across things like motors and such that are not worth repairing I would have to totally destroy them before tossing them in the trash or recycle bin. If I didn't some packrat would have saved it and then bring it to me later to know how to fix it. Trust me, if I throw something away, it needed a good throwing away.",
            "Recycling or reusing should be part of the religion",
            "My heart stopped for a second? Literally unusable.",
            "My previous owners left our garbage bin, recycling bin, and yard waste bin all packed with trash, lids left open to collect rainwater and braise in the summer sun in the months before I began to occupy the house. No malicious compliance here, just me struggling not to vomit as I dump a few dozen gallons of hot rancid trash water over in my driveway because they were too heavy to do anything with but knock them over.",
            "I hope you recycled it.",
            "Did they react when you crushed the bin?",
            "Unfortunately it’s how things are done. Especially in college years where everyone lives under the same address and the house is like an Amazon shipping center.",
            "PERFECT! mwah! (Chef's kiss).",
            "[deleted]",
            "Sure......",
            "How is this malicious? The worker had rules they had to follow, but pretty much outright told you how to get around them.",
            "Typical government policy. I don’t blame the people at the dump. They are just following the rules. They knew that bin was useless but rules are rules. This the same in everywhere in every country.",
            "[deleted]",
            "What's your point? You got a new bin. That's how it works.",
            "K",
            "that has its own chapter",
            "Sounds like government efficiency at its finest to me",
            "Gonna have to say best MC ever 🤣",
            "Holy shit that made my day. Cheers!!!",
            "rules are rules.",
            "i believe this, my step dad drop kicked his satnav in store and they gave him a replacement",
            "Well played.",
            "There's a hilarious text online about a guy that basically does the same thing when the bank refuses to give him new batteries or upgrade his 2FA device. Sadly, it's only in swedish.  \n\n\nEdit: [link](http://zenigen.blogspot.com/2010/10/bonus-pa-banken.html)",
            "Remember when Hawk had a hole in his boot and couldnt get new ones? Then Beej put nail holes in Hawk's boots? I love Hawk so much I built a shrine to him.",
            "What would have been funny is you go away when they deny you a new one. Come back a few hours later, or the day after with the bin completely demolished. If they dare ask you what happened you say \"well, you know, it got worn out over time.\""
        ]
    }
]