[
    {
        "post_id": "cwkcu4",
        "author": "virusoverload",
        "title": "Want me to cover up my tattoos? Sure. You never said what with.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cwkcu4/want_me_to_cover_up_my_tattoos_sure_you_never/",
        "score": 17492,
        "num_comments": 553,
        "created_utc": 1566996557.0,
        "selftext": "Let's set the scene.\nSo this was a few years back. I have quite a few tattoos (basically all my chest, my upper back, top half sleeves and one on the inside of each forearm (about 15cm across)<<these last 2 are what started it all.\n\nI worked for a cinema chain for a LONG time. Always had tattoos. I landed myself a management role.(more like a supervisor). The standard uniform was black shirt and black trousers. I prefer a short sleeved shirt due to being a bigger guy and cinemas being bloody hot.\n\nMy site manager quite liked my tattoos and other querks that I had. My area manager however did not. She would come in to the site, walk passed 8 other staff with full sleeve tattoos and make a b line straight to me. Stating that my tattoos need covering up and I quote \"they're not offensive just alot of people don't like them\". Now my tattoos aren't offensive they're just patterns.\n\nShe informed me that I had to wear long sleeves to cover them up otherwise I would face disciplinary action. I had read the employee handbook a few times because of other petty crap so I know it was the managers decision (my site manager) but she decided to over rule it. What she forgot was just because the normal retail staff HAD to wear black. Management were allowed to wear white. Just Nobody did cos it was hard to keep clean.\n\nSo what should I do? I know let's go and buy the thinnest cheapest most see through white long sleeve shirt I can find.\n\nNow if you could only see her face when she came in next when I'm basically wearing a shirt more see through than tracing paper. (I'm talking you can see the colour shift from my individual chest hairs) and ALL my tattoos are on show for everyone to see while stood behind the tills talking to customers.\n\nNeedless to say I got to wear my short sleeved black shirt again after that.\n\nEdit: finished a sentence.\nEdit2: spelling\n\nThanks for the silver stranger.",
        "permalink": "/r/MaliciousCompliance/comments/cwkcu4/want_me_to_cover_up_my_tattoos_sure_you_never/",
        "comments": [
            "An ex-coworker(dental assistant) was given a write up because a patient complained about her tattoo. The tattoo was a small butterfly in in the wrist. Apparently, the patient felt threatened because of the tattoo. The dentist (owner) gave a verbal lashing to the poor assistant, that the girl was left in tears and was sent home. I don't understand why people make a big deal about tattoos,  if they are not offensive or obscene why do they care. I seen other people get in trouble because of tattoos, my car salesman got in trouble because an old couple complained about his tattoo sleeve.  The sleeve was made up of different superheroes with a massive Hulk. I just don't understand those people.",
            "You're my kinda dude :)",
            "I'm picturing you in one of those Philippino style dress shirts that the only significant fabric is at the buttons, collar, and cuffs.  LOL.",
            "It would've been cool to get tattoo sleeves. There ya go! They're covered now!",
            "Does anyone have a theory as to why so many people dislike tattoos seemingly on principle?  It seems like such a cultural relic to associate them with criminality these days.",
            "Can we have some pics of your tats? I'm curious how \"not offensive, just a lot of people don't like them\" they are.",
            "Yanno, I like this way of handling it. I too had an employer who suddenly changed their mind about my tattoo. Told me o had to wear their long sleeve uniform shirts. Which were built for winter. Two weeks later, they paid for my two days in the hospital with heat stroke/concussion because i wasn't allowed to leave my post and hit my head when I passed out.",
            "I used to work at a pizza place, and was eventually asked by one of the owners to cover my tattoos. Their logic was, “Oh yours are really nice, but if we let you do it then we have to let everyone do it.”\n\nI just don’t really get the logic. What, some employee with a giant swastika on his arm will complain I get to show my tats off? Why would you hire swastika dude in the first place, how is that my problem?",
            "Plot twist: she just wanted to see your perky nipples.",
            "I was under the impression that it was always freezing at cinemas.",
            "Never understood why tattoos (though I wouldn’t get any myself) have to be a taboo in society. You can still do everything normally. \n\nIt’s kinda like being a different skin tone, but a choice. We shouldn’t belittle because of it.",
            "When I read the heading a story unfolded in my head that was quite different. In this story a tattoo artist receives a customer who wants his tattoos to go away/be overpainted, and is so condacending to the artists that the artist just tatoos stuff over the old tattoo that it embarrassed the tattoo wearing person.",
            "I personally wouldn't get a tattoo (certainly not a sleeve), just not for me, but I seriously don't get why people get riled up about them. As long as it's inoffensive, then it really doesn't matter.\n\nThere are some formal workplaces where you should consider covering them up, but I seriously doubt a cinema is one of those places. Just a tight-ass in my opinion.",
            "The \"cover up your tattoos\" rule is beyond me.  It's 2019.  If you have a curse word or nudity or something offensive - yeah, cover it up. \n\nI work in healthcare as a RN in the hospital and I have never once had a patient, visitor, or staff member express concern.  If anything, they are curious (I have a large right forearm tatt and one around my left wrist).  Regardless, my tattoos (or anyone's) do not impair the ability to do my work.\n\nYeeeesh.  Glad you thought of the ol' white shirt razzle dazzle.",
            "A friend of mine played a character in a limited-time show at Disneyland, and the character was a rockstar. My friend had to wear costume tattoo sleeves over his tattooed arms. I still think it's hilarious.\n\nApparently it was for copyright reasons.\n\nHis tattoos are all non-offensive. Patterns mostly.",
            "At my job I got a henna tattoo and was told by the big man district manager that I needed to cover or get fired. It was a hobby shop so I went to the fabric part and got the gaudiest cars 2 sequined fabric I could find and wrapped it all around my arm and the district manager saw me, literally snarled, and said \"thanks.\"",
            "This makes me laugh because nipples. Bonus points if they were pierced. Take that pain in the ass manager.",
            "The restaurant I worked at had a tattoo policy that led employees to cover tattoos with an ace bandage. It was a greasy job, and no one really monitored the condition of the bandages, and they quickly became stained, tattered, more unsightly, and a genuine sanitation concern that was still completely overlooked by management. \n\nFun stuff.",
            "I have both arms covered in sleeves.  One entire arm is just different variations of skulls.  My other arm has an inverted pentagram on the elbow.\n\nI used to be scared of the last one, as I am in the service industry, and occasionally work in churches and for religious people.  I've never had one word spoken bad about my tattoos, even had a Pastor last week that said he liked my ink.  \n\nLike my tattooist said to me \"Once your covered, no one sees a tattoo.  It's just one giant blind eye\"",
            "This story reminded me of the one EP story I heard on YouTube. OP is the one telling the story.\n OP was staying in a hotel which had an indoor pool. He's a guy who decided to take a dip in the pool. He takes of his t-shirt (OP is male. So it's okay for him to go topless, right?)\n So thirty minutes later he gets out of the pool and he wraps a towel around his waist. Guess who comes into the pool EM and her fuck trophy which is female and under the age of 12.\n \"OMG! COVER YOURSELF! You're exposing yourself in fount of my sweet BAYBEE!\"\n \"What?\"\n So EM starts evolving into Crazy Entitled Mom or CEM.\n For the next ten minutes OP has to deal with CEM yelling at him because she thinks that male nipples are supposed to be covered at all times.",
            "Really thought this was gonna end with those printed ed hardy-esque tattoo sleeves.",
            "What a fucking power move.",
            "Where are you where movie theaters are hot?  I’ve never been in one that wasn’t absolutely freezing.",
            "Should have gotten those \"tattoo sleeves\" that look like you have tattoos...",
            "If she was ignoring other people with tattoos couldn’t you make a complaint that she was targeting you unfairly?",
            "Can we get a pic of you wearing the see-through shirt?",
            "r/madlads",
            "Requesting to see your tattoos! I’d love to see what designs you have!",
            "I’m not a fan of having tattoos on myself, but I find it fascinating looking at other people’s and hearing the stories behind them.",
            "Ummm.....   pictures?  😏",
            "Cover the tattoos with more tattoos",
            "As someone also with many tattoos I love this MC! The best MC always makes the new situation 'worse' than the original - well done!",
            "Awesome, although if she'd had sense she would have gone back to the dress code and found the bit about 'appropriate casual work attire' or some such. I don't think anyone thinks see thru is appropriate.\n\nBut I'm rather glad you won.",
            "I fucking dig it",
            "That is perfect.\n\nOnly thing is I seem to have the opposite problem with cinemas and movie theaters, they are always super cold. Maybe that is just by chance.",
            "I'm planning on getting my first tattoo soon on my forearm and have been doing a lot of reading about how it might affect my career.\n\nI'm a little apprehensive about it, but at the end of the day it's something I really want done so if people don't want me to work for them then fine.\n\nThat said, have your tattoos affected your career path at all?",
            "Should have bought some of these ugly tattoo sleeves",
            "Yanno, I like this way of handling it. I too had an employer who suddenly changed their mind about my tattoos. Told me I had to wear their long sleeve uniform shirts. Which were built for winter. Two weeks later, they paid for my two days in the hospital with heat stroke/concussion because i wasn't allowed to leave my post and hit my head when I passed out.",
            "Haha love this :) Dunno why people always have to be dicks...",
            "I used to work at a restaurant that made a server cover her tattoos on her arms so she wrapped them with ace bandages, which looked way worse.",
            "Nice going! I was expecting body paint, preferably alternating neon stripes or things that are worse than the tattoos they are covering.",
            "Reading thru my work handbook has saved my ass multiple times. Its surprising how im the only person at my job thats gone thru it.",
            "I'd threaten legal action on the grounds she was targeting a specific individual while ignoring everyone else with tattoos.Either everyone is allowed or nobody is.",
            "I think I'd have worn the short sleeve and just covered the arm ink. With saran wrap.",
            "Lol. That's great.",
            "Kinda the best thing I read today, thank you! :)",
            "I wish I had color shifting chest hair",
            "I think I would have worn tattoo sleeves, but what you did was equally if not more effective",
            "Love it.  Although obviously a see-through shirt like that would be an easy argument for her to tell you you can't wear it.",
            "> cinemas being bloody hot\n\nCome to America where movie theaters are known for being freezing cold.",
            "Perfect.",
            "Cinemas are hot where you are? In the US they keep them just above absolute zero.",
            "I'm surprised your manager just didn't make you wear the black shirt over the long sleeve. That's what my manager made me do. In Vegas. In the the summer. It sucked.",
            ">Now my tattoos aren't offensive they're just patterns.\n\n[Any chance its going to be a maze?](https://www.youtube.com/watch?v=c15O5XfXpdk)",
            "This must have been hilarious. Good job man.",
            "I wish I could've seen her face when she saw you in your white shirt lol. Not like she could've said anything, you weren't breaking any regulations plus everything was covered.",
            "As someone with almost 200 hours of tattoos, I think you're being a bit ridiculous here. Anyone committing to a visible tattoo has to consider that it comes with some consequences, usually tied to a job. You should being going into it with idea of yeah, they're not offensive, but I might still has to cover them up, especially in a leadership role. Seems a bit petty to try and strong arm your boss about it.\n\nAs someone who works in upper management, I'd be looking for the easiest way to get rid of you. Don't be late!",
            "What cinemas are \"blood hot\"? \n\nI don't have \"blood hot\" cinemas in my area and bring coats to wear even in summer.",
            "The pettiness of some people really... Why can't they fucking mind their own business let other people breath and mostly haven't they better thing to do ?? \n\nYou owned her good. Must have been priceless. I bet you had quite a smug face on, ahah.",
            "have you posted pics? i would love to see them.",
            "Can we get a photo?",
            ">\"they're not offensive just alot of people don't like them\". Now my tattoos aren't offensive they're just patterns.\n\nI mean, it sounds like you agreed?",
            "If their citizens don’t cover either",
            "Sounds hot",
            "Bravo",
            "Bravo!",
            "P£+",
            "SMH.",
            "Way to go!"
        ]
    },
    {
        "post_id": "mzpuf5",
        "author": "semiTnuP",
        "title": "That Time A Boss Killed His Own Company",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mzpuf5/that_time_a_boss_killed_his_own_company/",
        "score": 17480,
        "num_comments": 509,
        "created_utc": 1619534146.0,
        "selftext": " This is my dad's story, but he's not into Reddit.\n\nMy dad is a hard worker. This happened about 15 years ago. Worked for a company that fixed and rented heavy equipment (backhoes, scissor lifts, steamrollers, forklifts, etc.) His boss (the CEO of the company, whom he reported to directly) was a middle aged Italian guy whose grasp of English was tenuous at best. He understood what people were saying, but had trouble communicating his own intentions back clearly. On the other hand, my dad had zero grasp of Italian but spoke perfect English. However, he was a solid mechanic who would go on to make the machine bay of this company something approaching a Sherman production line a la 1943. Shit. Got. Done. And, even though he didn't always understand what the boss wanted him to do, he just focused on the reason he was hired: manage the repair bay, hire new mechanics, train new hires and off-site 'on-call' repairs.\n\nWell, boss guy gets it in his head that my dad is going to 'replace' him as the leader of the company (because he's much better liked, speaks perfect English in an English speaking country and has basically all the department heads coming to him for help, even though he's technically only in charge of the repair bay.) And so, he calls my dad in, chews him out (we think, it was mostly Italian so my dad wasn't picking up on it, but the tone indicated as much) and manages to communicate that he's being fired for 'poor work performance.'\n\nAnd my dad just smiles, shakes the guy's hand and leaves. And, thanks to his less than firm grasp on both the English language and business law, the boss guy just sent him on his way with his last paycheck and nothing else. So my dad started his own business. In the heavy equipment mechanic market. And, after telling all his old work buddies about the situation, suddenly got a bunch of new hires. And his old workplace suddenly had a lot of vacancies that the Boss had no idea how to fill (because the guy he'd hired to do that had just been fired.) He went under about 6 months later.\n\nSometimes, my dad drives past where the old shop was (on his way to a call.) When he does, he just laughs and laughs.\n\nTLDR: A paranoid boss fired my dad because he was afraid my dad was muscling him out. My dad left and went on to create a successful rival business as a heavy mechanic repairman (and heavy equipment instructor.) His old job was shut down 6 months later.\n\nEdit: For everyone who's been saying 'this isn't malicious compliance,' here's why I think it is:\nWhen my dad was brought into the office, he knew right away that he was getting fired and he knew right away what the hell he was being fired for. Of course, the boss didn't say that the reason he was firing my dad was because he was feeling threatened by my dad's popularity and work ethic. Instead he just blustered through my dad's 'poor work performance' and fed him a line of bullshit about how 'he'd put up with it for a long time but enough was enough.'\n\nAnd my dad thought about taking him to court. But then, as he tells it, a bolt of lightning came down from on high and he just reached out and shook his boss' hand. He knew that if he took the asshole to court, he might get money out of him (almost certainly would have) but his boss would have had time to think about things and try to force a non compete contract down his throat. By just resigning immediately, he knew his ex-boss would never even think of it until it was too late. And he double-timed it putting in paperwork to get his new company off the ground before ex-boss COULD think of it.\n\nSo maybe I didn't explain details and motivations clearly enough but, based on how my dad told the story, I think it definitely fits into Malicious Compliance.",
        "permalink": "/r/MaliciousCompliance/comments/mzpuf5/that_time_a_boss_killed_his_own_company/",
        "comments": [
            "The most humbling truth of business is that you will create your own destruction.  A toxic workplace will spawn your competition, and poor services will drive your customers to the other guy.",
            "Dad, what do you do whenever you're feeling down?\n\nDad: well, there's this place i drive by...",
            "Lesson learned: Treat your staff with respect. Don't let your insecurity ruin your life.",
            "I would have made your dad a managing partner and headed to the house. I would just come to the shop to pick up earnings and then back to the fishing boat",
            "Just the push your dad needed. He should thank that dumb bastard.",
            "Although I enjoyed the story, idk if this is malicious compliance. Perhaps it would fit better in r/regularrevenge ?",
            "The Italian wasn’t wrong in the end. Just about the company your dad would do that in.",
            "A self-fulfilling prophecy.",
            "I have a question for your dad, since he's in the heavy equipment biz. Our neighborhood rented a DitchWitch to cut new borders for our volleyball court. But since it was mostly digging sand where the old volleyball court was ... does that make it a SandWitch?\n\nI'll just let myself out ....",
            "Something isn’t reading right.  He’s the owner.  Nobody can “muscle him out”.  He owns the business.  \n\nNot to say that business owners can’t be stupid and as petty as a 13 year old “mean girl”,  but I’ve met very few who were stupid enough to say “I’m threatened by you because you make me too much money - you are fired.”",
            "`This is my dad's story, but he's not into Reddit.`\n\n`My dad is a hard worker.`\n\nI also was a hard worker until I got into Reddit.",
            "Reminds me of a company my friend used to work for. These 3 guys worked for a state agency, responsible for building and maintaining some kind of network. In the mid-90’s, a few local businesses approached them for some help in doing the same, as the companies were becoming more connected. \n\nThey wanted to do some work in the evenings and weekends, but were bound by their contracts not to do this work for anyone else. They applied for an exemption and were denied. \n\nEach of the guys was making, maybe, $50k-$70k in their government jobs, and decided to roll the dice. They left their jobs and founded their firm. \n\nOn the second day that they were gone, the State realized that no one else knew how to do what these guys did, and so wanted to hire them back. They had already lined up a few contracts with local companies, and so knew they’d be very busy. \n\nThey (partly joking, partly in spite) threw out a multi-year contract at $9 million per year ($3 million each). It took about a week, but the State agreed. \n\nThat was the revenue that allowed them to staff up into a multi-billion dollar IT company, and they’re still going strong. \n\nI was told the story in a hangar full of their corporate jets, so am included to believe at least the gist of it.",
            "Reminds me of my younger brother who happened to work for my dad.\n\nMy brother was a hard working dude who cleaned and organized the shop every day. Went as far as to clean the bathrooms, which he didn't need to do but he did it. He replaced the soaps, he made sure everything from the docking bay to the kitchen was clean.\n\nHe got fired out of the blue. No reason was given besides how the company needed to save money. The guy who did it didn't even tell my father, who was at the same level as this other manager.\n\nMy dad was pissed, but he knew very well what to do, which was wait. After a week or two, this other manager started to get real pissed. Workers kept on asking where things went, kitchen got nasty, and the bathroom toilets looked like an abused outhouse. The manager went to my dad and said, \"Why isn't anyone cleaning up shit around here?!\"\n\nMy dad looked at him and said, \"Prolly cause you fired the kid who did it.\"",
            "I like the story, but this isn’t malicious compliance. He didn’t maliciously comply to anything. This is more for one of the revenge subreddits.",
            "What’s ironic is that I am reading “The E Myth” in which the goal of people who start a business is to make it run pretty much without them which the Italion CEO accomplished but did not realize that that made him a successful entrepreneur.",
            "Somewhere an Italian man is telling a story about a great employee he had, so great that one day he decided to give him a bonus and sing his praises but after he got the extra money he left and started his own company...",
            "Even with the edit, I don't see the malicious compliance.",
            "Icing on the cake would be if he also collected unemployment from them because of that as well",
            "Fun story, but I don’t think you used TL;DR correctly. It’s supposed to contain a brief summary for those that didn’t read, while you seem to have used it to just provide the aftermath which should just be part of the story.",
            "Is getting fired now considered Malicious Compliance? Good story but I don't think it fits here...",
            "Wait, how would an employee replace the CEO?",
            "I had a boss like that. Totally convinced everyone was out for her job so she hoarded tasks, didn’t let people be team players and spied on you all the time. She wondered why turnover was really high and why she was spread so thin with so much work all the time",
            "Ah ha! The seldom seen self-fulfilling prophecy. Shy in nature, it generally conceals itself in the underbrush.",
            "A lot of the heavy equipment companies (John Deere and Caterpillar for sure) are very particular when it comes to who they let have access to their manuals and access to run codes on the engine.  \n\nSo even if the old boss could have hired new capable mechanics, he still would have had to pay an arm and a leg to have consultants come out and diagnose issues.",
            "I've seen something of the sort first hand. I truly would not believe the story if I hadn't seen it myself. \n\nWe had a wonderful manager at this \"agro-centro\". Think of it like a one stop shop for everything animal and farm related. The manager got along beautifully with staff, the animals, suppliers and customers.\n\nThing is, when you're talking about farms there's so much that needs to be done and depending on the problem there are a million different solutions. I'm telling you no lies when I say I never saw this woman stumped by any issue. She always knew what to do to help customers and keep everyone happy. The owner was disliked by everyone and it seems that after about 15 years of her working there he got tired of it and replaced her with his mistress. The business took an immediate nose dive and closed down about two years later. \n\nTl;dr had a similar experience in a shop where everyone loved the manager but she was fired and replaced by the owner's mistress. Two years later the shop went under.",
            "Excellent revenge story man, but not MC. An MC needs your Dad to follow the boss's instructions to achieve the satisfaction. His Boss never said, \"Make your own company, see how that goes,\" or anything similar so while he blew his own foot off by firing your Dad, that wasn't the most direct part of his own business failing.",
            "Oh man way to similar with my old man. He worked heavy construction and was the manager of the company. The boss thought the business had a reputation and that is what drove their success. He did not understand it was my old man’s and brothers rep that drove it. Son one day an employee messes up, causes lots of damage on a site. The boss blames it on my Sister in law, was not her fault at all and was not the one to cause the damage, he fires her. My brother calls the boss on his bullshit and so gets fired as well. The old man gets fired too, just because.  dad was not even back home from work and was getting calls from the companies main repeat customers skiing if he was starting his own company and if so they would be moving their business to him. In the end, dad’s new company is now bigger than the old bosses, took more than half the clients with him.",
            "I literally just worked for someone like this, he put himself out of business.  He wanted me to buy his business, I was keen to do it, but I came in and checked it out and the place was a mess.  No inventory had been done in years, his employees were terrified of him, the place reeked of sewage etc. He really could have done a good business with it, if he would have stopped being a bitter old man.  He’s 86 and is financially ruined because no one will buy it, it’s kind of a niche market and if you know who to cater to you could make a killing off the internet.  But he doesn’t know how to do that, he only knows how to build things and alienate people.  From what it sounds like his son is supposed to be taking over the business but he has no idea what he’s doing and lives in another country altogether so I’m sure that will work out swimmingly 😂",
            "[deleted]",
            "Great leaders don't create followers,  they create future leaders.",
            "Sometimes the problem is found on the path you take to avoid it. He didn’t want your dad to replace him, so he fired him and that ended up creating the problem he was scared of in the first place.",
            "It's not just business owners.  There are a lot of managers and supervisors in business who get scared and paranoid because someone under them is superior is knowledge and work skills so people in other departments ignore the manager and come straight to that person under them for help or advice.  These insecure managers and supervisors also retaliate and are petty.",
            "His insecurities really fucked him over. It's karma but I also feel a little bad for the guy. Good for your dad, at least now he's getting the returns he deserves for the job he is doing.",
            "This guy should have just been happy that everything was getting handled by someone subordinate to him. Just be happy that the work is getting done and everyone is happy. \n\nI'm not sure how a CEO is selected, but I don't think its a popularity contest between the current CEO and a mechanic.",
            "Self-fulfilling prophecy.",
            "Boss tried to prevent him from taking his job, takes the whole company instead. Don't be a jerk to your employees, you still need them.",
            "Quick question for OP from the first line. What IS your dad into?",
            "Paranoia is the undoing of a great many people in a lot of circumstances.",
            "In a way, he did take over as the business owner. \n\nCareful what you wish for.",
            "That my friends is called a self fulfilling prophecy.",
            "This sound like the ancient stories about kings hearing the prophicies about a son killing them and creating the path for the son to fullfill the prophecy",
            "Nah, not malicious compliance at all. This belongs in another subreddit. Is leaving after being fired malicious compliance? Lol \n\nLike, what else do you do? Lol \n\nDon’t get me wrong, the story is wholesome but it sounds to me like he got fired so he needed a job and started his own business which was successful.",
            "You should post this to /r/prorevenge.",
            "How could he possibly force a non-compete clause on dismissal if theres none in his work contract and hes just fired with a weeks salary - I dont understand?",
            "Paints your dad in the best light possible, I suspect it was less magnificent and more grubby than that",
            "When the fear of replacement is what makes to be replaced (sort of)",
            "Coming from an old school Italian American family - I can see this playing out a million times over. Some of my more traditional family are so ridiculously unreasonable and illogical. Other half of my family is Irish American - and goes the same. Unreasonable grudges to the grave was common on the Irish side.",
            "I’m in a very similar position, and business is getting really good! Ugh. Wish you know about people sooner, but cest la vie!",
            "It's like an ancient Greek prophecy",
            "self fulfilling prophecy right there!",
            "He might have been in early stages of dementia/Alzheimer's. Behavior changes and paranoia are common signs. May have been time for him to turn over the business but couldn't see it.",
            "I call this taking someone out into the open market and beating their ass. Had the pleasure to do it once myself.",
            "Poor Italian guy tho. He was obviously scared and under a lot of stress.",
            "That was a self fulfilling prophecy.",
            "Hmm, was there any raucous applause?",
            "I spent about four years working veru closely with the owners and other financial leaders at small to medium (tow trucks/bobcats etc) mechanic operations. \n\nIn just those four years, I saw essentially this same scenario play out six times!",
            "Your dad is a genius.  Very well handled on his part.",
            "I dont see how your dad's old boss could force a non-compete clause on to your dad if he was being fired. You cant fire someone then tell them where they cant work after you fire them.",
            "How did the Italian guy ever get the company off the ground in the first place?",
            "I'm reasonably sure you can't be forced to sigh a non-compete document AFTER you leave the job.",
            "How would he force a non-compete? Why would your dad ever sign that?",
            "I work in maintenance. It’s funny how every maintenance guy could move the sun and the stars at work according to their family members but in reality a lot of guys couldn’t turn a screwdriver. I’m not saying op is lying or anything but I do find it funny how every person who’s parent is a tradesman thinks their dad is gods gift to the trades. \n\nAlso I find this story hard to believe that he just up and started what sounds like a multi million dollar business on multi million dollar pieces of equipment and hired the entire or most of the previous staff in six months. As a business owner I find it unlikely that you would go from being a lead mechanic to an owner of a business like that. \n\nMost guys I know running a business like that either bought it out for tens of millions or spent 30 years building it from the ground up. If you have even two guys on payroll you need to be grossing over 100k per year to cover wages.",
            "A non-compete in that situation wouldn’t be worth the paper it’s printed on. You can’t prevent people from earning a living. And they are signed when a new hire is joining a company and will be learning proprietary information, not when firing someone. There’s no reason for an employee to sign one then, typically when they are signed at the beginning of a job it’s because there’s some exchange that makes signing it worth it, like a salary bump or bonus. When it’s signed well after employment began, an incentive is given.  The only way it would be worth signing at the end of a job would be if it includes money equal to the salary the person would make for the time it’s enforceable. (And there are rules on how long the restriction can last, usually it’s 1 year.) There’s no way you can fire someone and be like “oh and you can ever work in this industry again”.",
            "That Italian guy failed to empower his employee.\nHe was too afraid of losing his power that he fired a highly influential leader in his own company.\n\nLeadership is influence.",
            "Sorry, I'm just not \"diggin\" that pun...",
            "You know you have to feel kind of bad about what the old boss was going through as he truly didn't know the language not to mention that your father was a key element of his business and it wasn't his fault, either of them, just bad misunderstanding and all.",
            "So in other words the Italian guy was right?",
            "CEOedipus",
            "It is not hard to learn a language well enough to be able to communicate intention...\n\n(I actually am even a bit angry at myself for wanting to message instead of speaking to a colleague - she has a terrible accent, and sometimes I am having trouble understanding her... also speaks too quietly.\nWhen *I* was the immigrant, everyone treated me with respect, despite my accent.)",
            "Often, the things we do out of fear cause the things we are afraid of.",
            "How is this malicious? Sounds like the ceo just ran his own company into the ground. Your dad didn't have anything to do with it after he was fired.",
            "[deleted]",
            "It's the xenophobia for me",
            "I don't think this fits even with your edit. It's a good story but there's no malicious compliance here. Your dad was fired and started his own company. That's good revenge and he was smart (and did some quick thinking) but he didn't maliciously comply with the owners instructions in any way.",
            "Upvote for appropriate use of \"whom\".",
            "The pro revenge would be for your dad to purchase the old place and demolish it.",
            "Sounds like he was correct to be paranoid!",
            "Anyone remember Ratners?",
            "Nearly instant karma",
            "Small business owners get really arrogant really fast.",
            "I agree that this is not exactly a MC but it'll fit perfectly in a self-fullfilled prophecy subreddit.",
            "> try to force a non compete contract down his throat. By just resigning  immediately, he knew his ex-boss would never even think of it until it  was too late \n\nThing is, by that point it was already far too late. You can't really \"force\" anyone to sign anything, a contract has to be entered into voluntarily. So either it would have to have been included in his original contract when he was hired, or he would have had to offer a significant financial incentive for your dad to be willing to sign it.\n\nI do think your dad made the right call anyway, though. Doesn't seem like there was really any need to sue the guy.",
            "Is it normal to sign a non-compete agreement when you get *fired*? That sounds... pretty fucking stupid and against the purpose of one",
            "And this, folks, is the difference not in leadership, but in management *and* leadership.\n\nBossman managed. Mostly alright, at the end catastrophically. Managers tie up loose ends, keep the lines and the people moving at a pace that meets the bottom line of the business. They fire, hire, and oftentimes push paper as often as they don't.\n\nLeaders like OP's Dad tie up loose social ends, make friends, allies, and keep the lines moving by motivating the people and stepping up themselves.\n\nChances are people did not leave because they disliked Bossman that much. They left because they *liked* OP's Dad enough to do so, and because they trusted him after he had proven himself, likely after mistakes and failures. Bossman could have cruised right along by continuing to communicate, toss in a bonus or extra vacation or whatever, and generally stayed mostly out of the way. Like a good manager, with a good crew, should do.",
            "Did Dad buy the guy's old equipment for pennies on the dollar when the company went bankrupt?",
            "He was so scared of your dad taking over...that he let him take over.\n\nGotta love it.",
            "The non-compete confuses me. You sign those usually at your hiring or if needs be, your exit interview-but only if you are expecting a benefit package that includes something your boss/company can affect. Like for instance, if your employee handbook (which is scripture in most US States, if there is no union) states if you fail to give x amount of notice or work x amount of hours in your last pay period (if hourly), the company reserves the right to drop your pay to state minimum wage. Then they can try to coerce you to sign something in your exit interview, y'know or you won't get your full hourly pay!  But this boss didn't seem to have any business acumen at all. I'm pretty sure your Dad could have cleaned out his wallet and I doubt he would have known how to stop it. But still its cool karma your Dad pulled.",
            "How would he have even retroactively forced your dad to sign a non compete? Aren't those usually put in place at the time of hiring, not firing?",
            "Que sera, sera....",
            "This is why I absolutely hate non-compete clauses since it puts all of the leverage on the employers but this is also a major reason why california has silicon valley since those kind of contracts are illegal in the state. It let's tech workers leave the moment they don't like the company or when they have a really good idea.",
            "I want to know why Analbox and Stabmaster are so chummy.",
            "How does one take over a company from someone who owns the company?\n\nIt's not like empolyee's can vote who runs the company. At least in a private owned company. Or are we talking about a big public firm with a board of directors and CEO appointment? Is this a company where a guy, who is in charge of the repair bay, can get promoted to being CEO?\n\nSorry for the doubt, but things don't add up.",
            "To be fair he wasn't paranoid, you Dad did replace him.",
            "Self-fulfilling prophecy",
            "This is like one of those 'your son will dethrone and kill you' prophecies in Greek Mythology. It only happened because you try to prevent it.",
            "Not MC, time for me to unsub from this place as so much of this recently.",
            "Boss who caused his business to fail? \nEver heard of Ken Griffin and the Legend of Gamestonk?",
            "It's a perfect example of a clumsy action that causes exactly that effect that one wanted to avoid.\n\n(It's similar but not the same as a self fulfilling prophecy. The self fulfilling prophecy is just saying things, predicting things, not necessarily linked to an action, or one's own action. With SFP the action is usually taken by others. Here it is self-inflicted.)",
            "The boss couldn't have forced a non-compete at that point - he was no longer paying your dad anything.  The best he could have done was offer to pay more in severance pay than your dad thought he could earn by taking competing work.",
            "Thinking about it he really didn't have to double time to put the paperwork in for his new job. I mean it's not like his old employee could force him to sign a non-compete AFTER they fired him and he left.",
            "Truth be told, the Malicious Compliance part of the story - _You want me out? Why, sure! See what happens._ - isn't the most elaborate, it still counts. This is glorious."
        ]
    },
    {
        "post_id": "15okork",
        "author": "LadybugGal95",
        "title": "I don’t think your kid will like my candy, lady, but whatever.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15okork/i_dont_think_your_kid_will_like_my_candy_lady_but/",
        "score": 17475,
        "num_comments": 838,
        "created_utc": 1691787881.0,
        "selftext": "Since there’s only a week left of summer, I decided to take the kids to the local amusement/water park today. As I’ve gotten older, the rides have gotten a little tougher on me. In addition, my daughter tends to get motion sick rather easily. I don’t like the way motion sickness pills make me feel. So, I always take a ziplock baggie full of ginger candy along to prevent and soothe nausea. \n\nToday, I had chewy mango ginger candies, hard plain ginger candies, and hard lemon ginger candies. For those who’ve never had ginger candy, it is SPICY. The lemon ginger is probably the mildest. The plain ginger is just plain hot. The mango ginger are sweet and spicy but they also stick to your teeth like crazy. They’re definitely an acquired taste. \n\nAs we are standing in line for the log ride, I pull out my baggie. I choose a lemon one as does my son (13). My daughter (12) asks for a mango one. While I’m fishing a mango one out, I hear the kid in front of us tell his mom that he (around 7ish) wants some candy. His mom distractedly says she doesn’t have any candy. The boy says, “But she does.”\n\nHe turns to me and asks for one. I tell him I don’t really think he’d like my candy. By this time, his mom has focused in on the interaction. As the kids starts to whine that, of course, he’d like my candy, his mom just huffs and says, “You’ve got a whole baggie. Can’t you give him just one. Com’n, don’t be greedy.” (Oh, you said the magic word there lady.)\n\nI say, “Alright,” and dig out a lemon one. (I’m not completely heartless.) That’s when the kid whines that he wants mango, mango is his favorite. I tell him lemon is better but he insists on mango. I tell him it’s kinda sticky as I hang it over. \n\nThe kid rips it open, shoves it in his mouth, gets in three quick chews while my kids stare at him. Then, he actually starts to taste it and a look of horror comes over his face. He screams and tries to spit it out. He’s jumping around and flapping his arms. His mom is panicking and asking what’s wrong. He’s screaming that it’s bad and it’s hot and he wants it out. His mom tells him to spit it out. \n\nThat’s when I pipe up with the very helpful, “It’s really sticky. What’s left is probably stuck in his teeth. He’ll have to wait for it to melt off if he doesn’t want to chew.”  The mom looks at me in disbelief and a shrug. Then she asks what in the hell I gave her son. (Probably should have asked that sooner, lady.) I answer, “Ginger candy. It’s good for nausea.”\n\nI’m pretty sure I’d be dead if looks really could kill. We got to move up in line two spaces though because she whisked her kid off to a water fountain. I’d like to think the kid will think twice about demanding things from strangers. Plus it was entertaining. Overall, the kids and I counted it as a win.",
        "permalink": "/r/MaliciousCompliance/comments/15okork/i_dont_think_your_kid_will_like_my_candy_lady_but/",
        "comments": [
            "It's amazing that some parents can be so entitled that they expect complete strangers to placate their kids.\n\nOn the plus side, I bet that kid won't be accepting candy from strangers again.",
            "That's what  you get for demanding that other people not be \"greedy\" with their own stuff. I hope the kid learned a valuable lesson about entitlement mentality.",
            "You did warn her he wouldn't like the candy.    You warned them that the candy is sticky. Her giant ego didn't register the warning.\n\nLet's see if two people drop their entitlement mentality toward other people's candy.\n\nI'm not holding my breath :)",
            "I love that you had a Willy Wonka (wilder) moment. “No. Stop. Don’t. Wait”",
            "Reminds me of the time my cub scouts wanted to try my wasabi peas. Anytime I didn’t want to share anything after that, I’d just say it was wasabi.",
            "I am just remembering about how I was taught to never take candy from strangers in the 80s and 90s and now parents are demanding candy from strangers for their kids?  WTF?",
            "That reminds me of my mom’s story. She always carries some candy in her purse, that particular time it was liquorice flavour. We were waiting in ER, next to us a mother and her maybe 6yo daughter sat together. My mom got bored and ate her candy, the girl noticed and very kindly asked for one. My mom hesitated but asked girl’s mom if that’s alright because not everybody likes that flavour. Girl’s mother let her take one. That look of pure hatred on girl’s face directed towards us was really funny when she realized it was not sweet at all. She tried to quietly spit it out but her mom told her it was impolite and made her finish eating it.",
            "Literally the first thing I thought of was never take (anything) candy from strangers. What the hell was that mother thinking? Not to insult you or anything, clearly you didn't intend to harm the kid.",
            "How dare you not give my child an unknown substance to eat?!",
            "This is exactly why the THC taffy I make is ghost pepper flavored. Adults love it but any kid would spit it out within 2 seconds.",
            "My step mom used to drink diet coke all the time, taking sips throughout the day while leaving the open can in the fridge. My 2 siblings and I would always sneak sips, and she caught on pretty quickly. One day I went to take a drink and I got this horribly spicy surprise. Turns out she added ginger to the drink as a prank/revenge. Pretty sure she got one of my siblings as well, but none of us ever stole her drinks again. My bio mom thinks it was mean but I think it was hilarious and clever.",
            "I’ve had a similar experience. I’m Danish but I’m currently living in Australia, and I was waiting for my girlfriend at a shopping centre and just munching on some Danish salt liquorice. Lady comes over with a little boy and says he’d like some. I say he won’t like it, it’s from Denmark and it’s… she interrupts me and says he loves liquorice. So I shrug and let him take a piece. He spat it back out almost immediately and asked what’s wrong with it. I said, well if your mother hadn’t interrupted me, I was going to say it’s salt liquorice.",
            "Mango like candy.",
            "The maliciousness of your compliance still did not ease the anger I felt toward that entitled bitch",
            "I have the same mango ginger candies at my bedside for my anxiety nausea! I’ve eaten so much ginger candy that I now enjoy the ginger that comes with sushi \n\n*Definitely* an acquired taste. I actually acquired it because a family friend thought it was the kind of strange, out there thing I’d like to try, and I ended up eating a whole bag of the haribos because I wanted to like them that badly lol",
            "There’s a company that makes ginger jam.  While it’s not bad with peanut butter, try it on a cheese sandwich.  You won’t be disappointed.",
            "If someone said that to my son (\"I don't think you'd like this candy\") I'd automatically assume it was like THC Candy and immediately drop  the subject and tell my kid to knock it off and we'd leave if he kept bugging the person. Lol. If an adult says something along those lines, it's either 1. Not legally for minors 2. Incredibly disgusting, or 3. The adult is just not feeling very much like sharing and that's their right. Definitely don't push the issue regardless of which option it may or may not be. The absolute beach ball sized lady nuts on that mom.....",
            "One of my kids has OAS and seems to be allergic to the whole world. Everyone in the family knows that you have to ask what's in it before you accept any food from anyone.\n\n\nBut they're not allergic to ginger and loves it, so we might have raided your stash!",
            "Hmm. I love plain candied ginger! I wonder if it’s just that I’m old.",
            "I have ginger chews in all my first aid kits. I was having a lot of nausea and it really helped until I figured out it was the fish oil caplets the doctor had me on.",
            "I use the ginger candy too! Always had it with me when I was pregnant. The older kids would start out asking for a piece and wouldn't believe me when I told them they wouldn't like it. They left me alone after the first time.\n\nNow it's kind of a gauge in our house, if you're really nauseated then a ginger chew isn't so bad. If they won't eat one then they're well enough to go to school.",
            "What ever happened to “Don’t take candy from strangers”? \n\nIdiot parents raising their kids to get kidnapped right there.",
            "Willy Wonka to Violet. \"Stop. Don't.\"   \n\nKid's a nitwit.",
            "She fucked around and found out. Hopefully they learned",
            "With a parent like that, it's no wonder the child has been learning bratty tendencies.",
            "How did we as a society get from \"Don't take unknown candy from strangers\" to \"How dare this stranger not give my child a piece of unknown candy!\"??",
            "WTF? When did people stop telling their kids not to take candy from strangers??",
            "The kid wasn't really at fault here. His mom should've been a parent and said no. No is no, don't get candy from strangers, etc.",
            "That's a very narrow minded view OP, to say that \"Overall, the kids and I counted it as a win.\"\n\nIt's a win for everyone in the queue, not to mention it being a 'learning point' for that kid and his mum. :)",
            "[deleted]",
            ">C'mon, don't be greedy\n\n**I CAN'T BE GREEDY BY HOGGING THE STUFF I BROUGHT FOR MYSELF FROM HOME**\n\nBuying the last twelve bags of Skittles when the kids behind wants to buy one really badly? Yeah, maybe greedy.\n\nNot this!!  \nGods I hate entitled parents... Dunno what it is but the moment there's a bun in some ladies' ovens, they get switched on to Karen mode and never turn it off...    \nI loved the pregnant lady insisting on taking somebody's chair at an open air venue, when she didn't bring herself a chair but the OP had... People are amazing...",
            "I'm a fan of The Chimes plain Ginger. Its got 3 ingredients! And burns like no tomorrow (but in a good way). It tastes sweet but burns spicey, and is also chewy. What are some brands you like?\n\nI also don't react well to nausia medicine.\n\nBut wtf kind of idiot lets their kid take food from a stranger like that??? Did we all forget the LSD-marijuanna-mushroom-meth-in-Halloween-candy panic of the 90s???",
            "My great grandma always kept a jar of ginger lollies on her mantelpiece.\n\nWe *all knew* they were ginger. We *all knew* what they tasted like. *We still always wanted them* whenever we went to visit",
            "When my daughter was younger, maybe 7 or 8, she ate a whole container of sugar-free ice cream. On the back of the container,  it bold letters it said may have a laxative effect. Yeah, it did. A few years later, she decided it would be a good idea to eat a box of Fiber One bars. Sometimes, I wonder how she made it to the age of 26. 😂😂",
            "Where exactly do you live that actual mothers let their children accept candy from strangers???  Like....isn't this still taught in schools as a major NO-NO?\n\n\"We DO NOT accept candy from strangers!  EVER!\"",
            "..I don't understand why a parent would demand a stranger give random things from a plastic bag to their kids. What if OP was educating his kids on edibles? Acid trips? A kool-aid free version of the Jonestown massacre? What type of person says \"hey random person, give that thing in that bag to my kid now\" and then after their kid starts screaming decide to ask what it is?",
            "Thank you for widening my world of ginger candy. I never knew there were other flavors.",
            "Well, it was an AMUSEMENT park. Seems to me you follow the amusement part quite well...",
            "This reminds me of years ago. I was going to my friends house and I stopped by the carryout to get something to drink. Today I wanted something other than pop and I saw a can of V8 and thought well I haven't had one of those in years and grabbed it. Once I got over to my friends house and said hey to everyone. I sat at the table and his 6 yr old daughter looked at my can and asked what that was. I started to feel ornery and said \"It's pop you wan some.\"  She said sure. I handed it to her she took a good swig and had a confused look, so I said do you like the pop? \n\nShe still had a confused look, and she knew she liked pop and hesitantly said yeh. \n\nAngie if you're reading this and remember, Sorry.",
            "Is stranger's candy allowed now? I grew up learning stranger danger and to avoid vans and strangers with candy, how did this parent, presumably of my generation ALLOW STRANGER CANDY",
            "DON'T BE GREEDY??? I'd have lost my mind. Greedy with my own property? That's not greed, that's called Ownership, bitch.",
            "Lmfao boy is way too dramatic. The mom is just trash.",
            "And this is why you don't take candy from strangers",
            "OMG I eat ginger candy for nausea and it also works great for heartburn. I hate it every single second that I'm eating it, but I know it works so I endure it. I can't imagine what that kid thought. He must have thought he was being poisoned! I bet he never asks for candy from a stranger ever again.",
            "The only mom in the world actively encouraging her kid to take candy from strangers. We'll be reading about his disappearance in a couple years.",
            "Who in their right mind would let their kid have candy from a stranger anyway?",
            "I’m picturing Dudley and Petunia Dursley in the story…..",
            "\"Remember when I told you right to your face that your kid wouldn't like it and your response was to ignore that and call me greedy? Oh look, it's the consequences of your own actions and rudeness.\"",
            "My mind visualized this kid as Dudley Dursley from Harry Potter",
            "That's new.  Your mother helping you demand candy from a stranger....",
            "I had to go get some candied ginger to eat after reading this",
            "Whatever happened to no candy from strangers?\n\nPeople give mothers too much trust.",
            "Maybe it's just me, but aren't you supposed to teach your kids to NOT take candy from strangers?",
            "If someone stares at me with a look that could kill, I would flip them off with a smug.",
            "greedy? does she know what that word means. it’s used when you’re asking for stuff from others as the recipient not the giver",
            "Shit and I remember being drilled by my parents and the education system to never take candy from strangers yet here this kid is.",
            "What parent in their right mind accepts candy from strangers, let alone demands them?",
            "WIN all around! This reminds me of the greedy, rude kids and the parents to give their kids everything they want in Willy Wonka, and the chocolate factory!  Nice work!!",
            "I know exactly what candy you're talking about. I love them, but we wife hates them. The crazy thing is, my two year old son loves them too! He has been eating the straight ginger ones since he was about a year old, and people are always shocked.\n\nHe has tried hot salsa and peppers a few times and can't handle that kind of heat, but he loves ginger!",
            "okay but no one is asking the important questions. What's the brand of candy? they sound delicious but anytime I try ginger candy it's always pretty mild. I need that spicy mango.",
            "\"GIVE IT TO MY KID!!!\"\n\nthen to be FOLLOWED BY\n\n\"WHAT DID YOU GIVE MY KID?!?\"\n\npriceless",
            "I learned about ginger candy in high school because my jazz history teacher was super into them. One day, there was a hard test that I just barely failed, but so did a fair portion of the class. To give extra credit, he offered anybody who could eat 1 entire ginger candy (the plain ones from OP story) would get a passing grade. He also explained the flavor and how bad it would be but how good it was for your health. One other person tried it before I did she took a nibble and decided she'd rather fail the test while loudly gagging. I wondered how bad it could really be, so I just went full send and threw it in my mouth and chewed. It was EXTREMELY spicy and pungent but jokes on him, I'm into that shit. After chewing that glob of ginger for what felt like eternity, I finally swallowed it, and the teacher, in utter shock 🫨 at his table, declared I would get a B+ for the test. Several other students tried but failed the same as the first girl. \n\nTldr: I ate disgusting ginger candy in high school for a better grade once.",
            "I'm still dumbfounded that a mother would coerce someone into giving food they have to her son. Didn't even ask the ingredients. That's insane.",
            "What about \"never accept candy from a stranger\"?  \nAlso, I would've totally given the kid a plain one. (I actually am completely heartless)",
            "wait, I love the story but also you're telling me ginger helps with motion sickness??? I've just been popping dramamine and hoping for the best. I'm about to keep both on me at all times bc this is a game changer",
            "Ok I have to try this stuff. Where do you hang out so I can demand some?",
            "But, Candy from strangers tastes better!",
            "And this is why you don't take candy from strangers right?",
            "What the hell happened to ”don’t take candy from strangers?!”",
            "Completely harmless and incredibly useful life lesson.",
            "NTA but *I* am: daughter *loves* candied mango, so we sent her a bag when she was in college. I, the troll, threw in a piece of candied ginger, identical in appearance to the mango. We heard about that one all year.",
            "Isn't that one of the basic tenants parents and society teaches children? \"Don't take candy from strangers\"? \nSmh, fuck these people.",
            "Did the whole “Don’t take candy from strangers” thing go out the window?",
            "Ginger’s a special kind of spicy too. Found that out the hard way on a cruise once.",
            "Maybe the mother learned a lesson, too.  Well, not likely but it's nice to have hope.",
            "Stupid should hurt.",
            "Entitlement.....what a way to deal with it.  Taught that little....XXXX ....entitlement earns the prize.  The prize, not necessarily what you might think of or want.",
            "I think I know the candy you're talking about. Theyre delicious. I would have asked for one too. Of course I'm an adult though.",
            "You are a magnificent bastard. I love it",
            "Dude ginger candy fucking slaps and I never see anyone else acknowledge it",
            "You just reminded me I still have some candied ginger in my pantry.  \nHid it from hubby and forgot about it 😂",
            "Young enough to remember when kids were taught not to accept candy from strangers",
            "I did this kind of thing with Wasabi Peas and my mexican workers who were always trying to prank me (anglo) with hot sauce laden lunches.  Wasabi is completely different kind of hot and they hit the ground 1 second after they popped the peas into their mouths.  Like a hound with a piece of Broccoli.  We all had a good laugh.",
            "Kid and slob momma found out.",
            "I love ginger candy. I need to know more about this mango though. The three options I currently have are the hard ginger, lemon, and a soft ginger covered in sugar. My kids don't like the candy but they devour my ginger tea. Let's be honest I have ginger problem. I also use it for a lot of stomach issues.",
            "Someone needs to check up on that woman. Who the fuck lets their kid just take candy from a bag a stranger is carrying around?",
            "Dumbass mom *asking* strangers to give her kids candy",
            "Love this. Well played.",
            "🥇\n\nYou are doing The Lord's Work!",
            "I once was in line for something and a woman comes up to the guy in front of me, apparently her husband or partner, and in a very self-effacing way asks him for, I shit you not, A PENNY. She was just that much short for some purchase she wanted to make. This would have been years ago as pennies haven’t been in regular circulation in Canadia for a decade or so.\n\nGuy looks at her with contempt, says nothing to her, then turns around to ME and snarls “Give er a penny.” ME! A complete, uninvolved stranger!\n\nReddit, in that moment, this lady’s whole awful existence being tied to this assturd was made patently clear to me, and I gave the poor thing a penny. Not because of the dude, but because it would help her. Wish I could have given her the means to get away from him…",
            "Years ago, I had some Warheads (super sour candy), and we were at a friend's house playing a game. His son, who was a toddler (maybe 3), kept wanting to try it, and both me and his dad kept telling him he wouldn't like it. But, he was being persistent, so his dad asked me to give him one. He spit it out immediately and started crying. I mean we did keep telling him it was yucky and he wouldn't like it, but he had to fund put for himself.\n\n\nAlso, I LOVE ginger candy, it satisfies my spice craving and settles my stomach. I can't do spicy foods anymore, but I love spicy food.",
            "Oh how I have *dreeeeeeeamed* of such an opportunity!",
            "Gin-Gins?",
            "This has got to be one of the better stories of entitlement, and the result of karma in the same story! 💕",
            "Don't be greedy. But I AM greedy. It's the Precious!",
            "This is the kind of joyousness I come to the internet for. Fuck that entitled ass lady and her shitty kid.",
            "Never take candy off strangers!",
            "Holy crap that mother 🤦‍♀️. Who does she think she is demanding you give her kid to our candy. I would of been like WTF lady. I would of told her it was THC candy and pretend to hand it to him and she how demanding she is after that lol 😂",
            "Tell her these are edibles, if he wants one, cough up three bucks.",
            "Sounds like a learning experience; hopefully the kid and the parent both actually learned from it.",
            "Ginger candy and lemon ginger candy YES. But not the mango,  but only because I am not a fan of mango.  But brilliant job.",
            "\"What the hell did you give my kid?!\"\n\nExactly what his spoiled and your entitled ass tried to publicly shame me into. Fully deserved to learn the mildest lesson of \"don't take candy from strangers\" and \"ask questions\".",
            "I would have just said no and they would have had to get over themselves. It's my shit and I absolutely will be greedy I don't care if it was actual candy.",
            "\"What did you give my kid!?\"\n\n\"...hard drugs. all the bad ones. oh yeah, he's definitely all drugged up\"",
            "\"feed my child I supposedly want the best for some random crap that I don't know what it is!!!!”",
            "“Can you give one, you got a full baggie!!!” Was a turn off by itself…",
            "Who in the AF would not only ask but allow their kid to take candy from a stranger?  This is the craziest thing to me. Don’t get me wrong, I’m certain interactions I have let my daughter share with kids we don’t know. But 1- I can’t even fathom asking a person to give my kid something and I’d die before I said you have a big enough bag. 2- why wouldn’t you ask what it was beforehand?  There is so much wrong here. But I’m glad both the mother and child got what they deserved.",
            "Wtf? That mom needs to teach her kid not to take candy from strangers. Ultimate parenting fail.",
            "Well ... one way for the kid to not accept candy from strangers.",
            "I was in either Kindergarten or 1st grade when our class walked over to the public library, which was maybe a 2 minute walk, for a short field trip. We were milling around on the sidewalk in front of the library entrance. Parked in front of the library was a little truck with an open bed. Because the sidewalk was unusually tall it was easy for me to see these little, bright white balls that looked like candy scattered around the truck bed. So I reached in, grabbed the closest one, and popped it into my mouth. I spat it out immediately because it was weird and bitter and I started to cry. One of the adults in charge quickly figured out that I had put a moth ball in my mouth, so she took me back to the school nurse. I was fine, but I learned my lesson.",
            "I’m laughing at the SPICY part, I mean it is tad spicy but not SPICY.",
            "in 4th or 5th grade (i can't remember), there was  a bully stealing from our brown paper bag lunches in our lockers. one day three of us left exlax chocolates in our paper bags. he never stole again. (we did this ourselves and didnt tell parents ;)",
            "Dafuq is that woman teaching her kid? Rule 1 is to never take candy from a stranger, yet here she may as well have practically forced it into her kid’s mouth. Utter mind-numbing stupidity.",
            "Another ginger kid casualty.",
            "Seems perfectly fair to be amused at an amusement park.\n\nKaren and her crotch Goblin were lucky it wasn't me. I carry the hot Chinese candied ginger and the Mexican chili and plum candies... And I'm not nice to rude people... Especially if they think they're \"entitled\" to anything I have.",
            "I have the mango chews but Im curious about the lemon ginger ones... what brand is it?",
            "This is great",
            "I hate kids and entitled people so this post made me happy",
            "I love ginger candy, but it’s definitely an acquired taste. I’m impressed your kids eat it!",
            "I love candied ginger. Please may I have a mango one?",
            "I love ginger candy because I have a lot of nausea issues. I'm cracking up.",
            "Great, now you’ve made me crave chewy ginger sweets. I hope you’re happy!",
            "I woulda just told her no - they're edibles. LOL",
            "Hilarious. Astonishing entitlement and a great dose of karma. Not optimistic they learnt.",
            "There was a much better way to go about that. Like teaching her kid to be polite and talk to the person and ask questions and then testing things like that before just gulping it down. \n\nWonder if either the mother or the kid learned anything that day.",
            "What a karen and a brat...",
            "Normally not into spicy but ginger is my exception and I love mango so now I’m wondering where to find these magical candies.",
            "Mango ginger!  Oh my where did you get those!?  They sound delicious.",
            "Hahahahaha, awesome.",
            "Would water actually have done him any good or made things worse? Milk is usually the ticket for countering spicy stuff.\n\nP.S.: Your story is bloody Awesome!",
            "Gotta try the peanut butter Chimes, honestly.",
            "**Gre-e-edy**...!     LOL",
            "Hysterical -- haha!",
            "How did your kids start to like it?",
            "Any augar feee soft drink make me sick",
            "I like your kind of evil, it's hell-a entertaining.",
            "…. What if these were weed candies in a legal state? Would she demand her kid gets some? I just don’t get people",
            "LOL this was a great story",
            "Good life lesson for the boy - and hopefully his mom.",
            "Completely off topic but bonine is a great anti nausea pill that actually doesn’t make you drowsy, highly recommend",
            "Are these home made or are the Gin-gins?",
            "South Indian ginger pickle! Awwww yeah…",
            "That's fantastic work!",
            "Augustus Gloop. And his spoiled shit enabler.",
            "I am low key sad at this story. I am 50(ish) and as a child I LOVED ginger candy. My dear nana used to sneak them to me as our little secret. It began my long love affair with anything bitter and tangy. Miss ya Nana 😘",
            "Love it! Strangers with Candy! Ha! What an entitled mom/ kid, there's sooo much gall! Plus love those candies! Especially the hot plain ginger! You taught the youth of today an important lesson for the future, Don't be a Greedy Whiner!",
            "I want some of that ginger candy",
            "That kid needed to be r/TraumatizeThemBack",
            "Ha ha, I was eating ginger candy in front of my nieces and nephews one time, and they asked for some. I told them they probably wouldn't like it, but agreed to give them some. Their father was smart enough to tell me to cut one up (these were chewy ginger candies) rather than give everyone their own candy. As expected, nobody like them.",
            "Well played.  I've seen more than my fair share of Karen's demanding kindness from strangers... sometimes to their detriments.",
            "I think about mysterious vans with creeps offering free candy. This kid would fall for the trap, I am sure.",
            "How did he know they were mango?",
            "Not that you did a single thing wrong here but the one thing that might have made the compliance a little less malicious but a little more satisfying is asking the mom if she didn’t want to try it first and getting to see her squirm.",
            "I love ginger candies. I can only find them at one store. This story made me laugh as my grandkids have tried my candy and didn’t like even a couple licks as a taste test.",
            "\"It's my home recipe!  Ginger root 🫚,  Mango 🥭,  and 125 micrograms of lab grade LSD.  Y'all are in for a wild ride.\"",
            "ooooh I love this one.  Fuck people, especially shitty parents.",
            "Haha love it! Teachable moment for kid and mum! 😅 I’d hate your sweets! Your kids must have strong tongues!",
            "I'm looking for good ginger candy for my VR sessions. Could someone share with me what's your brand? Thank you!",
            "I love spicy ginger stuff, what were the candies and where can they be purchased?",
            "Ha. Good.",
            "Classic Schadenfreude right there!!!",
            "Should mix in some horehound hard candies from cracker barrel for this occasion. They’re very much an acquired taste but I have always enjoyed them.",
            "That’s funny as shit.",
            "She should count herself lucky you're not the family that like to pop edibles together before a ride.",
            "I laughed hard... good, it was not something else candy.",
            "\"'No' is a complete sentence\"",
            "I need to know, what brand of ginger candy do you prefer?\n\nI eat em for the same reason, haha.",
            "I'm slightly disappointed most of the comments are about ginger a d not about Karen's and their spawn getting exactly what they want.",
            "Damn I was hoping this was about thc gummies lol",
            "It's got molly in it, have fun kiddo!",
            "We love ginger gummy bears from Australia. No one asks us for a second one.",
            "I keep ginger candy with my VR stuff, because of the motion sickness benefits.\n\nCan also confirm it's spicyness.",
            "Hey. This candy actually sounds like I would enjoy it. \n\nMind sharing?",
            "Learning is fun",
            "Dad skills on point, my friend!",
            "Well played",
            "🤣 this reminds me of the time I had an older Japanese auntie try (and fail) not to openly laugh at me.",
            "Out of curiosity, does ginger have the same type of spiciness as hot sauce to other people? That’s what OP kind of made it sound like. Because for me, ginger is a pleasant tingle while the hot sauce variety of spicy is terrible and painful and I hate it. But if spiciness in general feels like ginger does to me, I could understand why other people like it.",
            "I remember when we used to be told not to take candy from strangers",
            "It amazes me that people let these interactions proceed past the first question. \"Let my kid have some of your candy\" she will ask \"no\" you should say, and then just ignore the bitch. Blatantly ignore her. Who gives a fuck. Teach your kids a lesson on how not to act with her right there even that usually makes them fuckboff.",
            "Hopefully she learned a lesson about helping herself to other people's things.",
            "This lady is literally actively teaching her child to take candy from strangers.\n\nJFC.",
            "Guess his favourite song is 'I want candy'",
            "I gotta ask you, where you get that candy from, and if it might be possible to get it online somewhere. I'm a big fan of ginger and after that entertaining story, I would enjoy those even more.",
            "Awesome story! FWIW, I love candied ginger- burns so good :)",
            "I like this story.",
            "Lady, I don't think your kid wants one of my gummies.",
            "Aww man don’t remind me summer is almost over. It makes me sad 😞",
            "Cue Hannibal Lecter on the plane where the kid asks for some of his food.\n\"You wouldn't like it. It's *liver*.\"\n\"Liverwurst?!😀\"",
            "BRILLIANT ENDING! 🎉",
            "That was such a satisfying story lol",
            "Read this story the other day and had never heard of ginger candy. Went to TJ Maxx and saw it at the checkout so decided to give it a try. I got the “orange flavor” but definitely get where OP is coming from on the ginger and it getting stuck in your teeth. I enjoy cinnamon candy so this is pleasantly spicy yet chewy. I can dig it."
        ]
    },
    {
        "post_id": "rq3f1h",
        "author": "AQuietBorderline",
        "title": "\"You Will Work This Dangerous Position Without Training\" Leads To \"Have Fun Talking To The Union\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rq3f1h/you_will_work_this_dangerous_position_without/",
        "score": 17478,
        "num_comments": 388,
        "created_utc": 1640656214.0,
        "selftext": "My Dad was visiting us for Christmas and as usual, I got him to share some more stories about his youth and he shared a time where he used Malicious Compliance to not only shut up one of his bosses and get him into trouble.\n\nMany years ago, back when Dad was a college student, he earned extra money for living expenses by working in a car manufacturing plant. The state at the time was a closed shop, which meant you had to join the union in order to work unless you were in an executive position. One of the rules said union set up at Dad's workplace was that no employee could work certain positions unless they had been trained for it. This included positions such as forklift operator and trash compactor. This was included in the contract and was a no break rule.\n\nEnter George the manager (made up name). Unlike many in this thread, George was actually a nice fellow but to quote Joseph from *It's a Wonderful Life*: \"He has the IQ of a jackrabbit\" and didn't always think things through.\n\nOne Saturday afternoon, Dad came into work when George pulled him aside. \"I need you to do me a favor, son...the trash compactor is jammed and I need someone to crawl in and unjam it. You're the smallest of us all so it shouldn't be a problem for you.\"\n\nNow not only had Dad not been trained for loading the compactor but even he knew crawling in there would be a dumb idea. \"Uh, George, I haven't been trained for this position.\"\n\nGeorge got all flustered and told him \"Just do it.\"\n\nDad then got an idea for some Malicious Compliance \"I'll do it but is it okay if I ask one of the other guys to spot me and make sure I don't get squashed?\"\n\nGeorge said \"That'll be fine, just make sure the job is done.\"\n\nDad then headed to his union shop leader Kenny (made up name). Like George, Kenny was a decent fellow but was very protective of his workers. Dad told Kenny what had happened and asked him to spot him.\n\nCue Kenny \"turning at least five shades of purple\" before storming to George's office. Dad told me the whole floor went silent as Kenny unloaded on George for trying to make \"a poor college kid do something so fucking dangerous\" and that \"this will be recorded and written up.\" Kenny stormed out, leaving a frightened looking George quaking in his steel toed boots.\n\nThe compactor ended up getting fixed without someone crawling into it and George always asked if people were trained for positions before asking them to do it.",
        "permalink": "/r/MaliciousCompliance/comments/rq3f1h/you_will_work_this_dangerous_position_without/",
        "comments": [
            "Kenny may well have saved your dad's life. I'm glad people like Kenny are out there.",
            "I worked in a warehouse with a compactor/bailer thing... that thing was fucking serious.",
            "What a smashing story!",
            "Love \"Union Compliance\" stories.",
            "Well at least he learned his lesson, unlike many others!",
            "Don't 👏 Enter 👏 Confined 👏 Spaces\n\nEspecially ones designed to stop being confined spaces and become confined nothings.",
            "You could have role played Star Wars when in the trash compactor.",
            "And this is why we need unions.",
            "This story just pisses me off. George is one stupid motherfucker and had no business being in a position of leadership.",
            "The fact that the compactor was able to be fixed without needing anyone to crawl under it SHOWS how incompetent the boss guy was. Fuck that guy. Your dad's hella cool btw",
            "Shit like this is quite literally why unions were formed, to keep people alive because their employers couldn't be bothered without mass worker revolt.",
            "We had proper lockout procedures for that type of work",
            "Send an untrained person to clear a compactor?!? \n\nThe guy probably didn't have locks and if he did, he certainly didn't know how to properly secure that device.\n\nGeorge sent that guy into a situation that could have easily gotten him killed.\n\nKenny let George off easy. \n\nI would have had his head on a fucking platter!",
            "OP, I hope you realize that you were only one \"George\" away from possibly not existing.",
            "[deleted]",
            "Glad it was George who got crushed rather than your Dad",
            "And people wonder why we need unions",
            "I've seen first hand what trash machines can do to someone who isn't trained on them.  When I was in the Army our unit was on a rotation for Post Cleaning one summer.  As per normal the troops who are lowest on the scale, both in rank and IQ wise, are given the crap jobs.  One group got sent to the recycling plant and a one Joe got put on the industrial shredder.  His training consisted of \"Take the stuff in this bin and throw it in the hopper.  Don't bother me with stupid questions!\" So he does and a few hours later the hopper gets jammed and shuts off.  Not knowing what to do he reached into the hopper and pulled out the phone book that was stuck.  The jammed cleared, the machine starts back up and sucks the phone book into the shredder along with three of the poor Private's fingers.  \n\nI can just see some poor college kid climbing into a trash compactor and getting squished when the jam was cleared.  Glad your Dad had the smarts to avoid that issue.",
            "[deleted]",
            "I have worked in a factory my entire adult life and good for your father. This is *exactly* how this situation should've been handled.\n\nFor anyone who needs to hear it; If you work with large machinery like compactors or anything with safety gates, exposed electrical, moving parts, etc., never ever get inside of the thing unless you've been trained in Lock Out Tag Out and your personal lock is on that machine power supply. If you don't know what LOTO is, then don't get in the machine, it's pretty easy to stay alive when you think of it this way.",
            "Its sad when you can flat out refuse to do a task you aren't trained for in the military but a civilian without a union could get fired for it.  Welcome to corporate dystopia.",
            "I went through a period of doing temp work in warehouses.   When our group was brought in, our jobs were explained to us.   We were not to do any final boxing or loading the trucks.   Only the regular union guys were to do those jobs.   Besides which there was a double yellow line, that said DO NOT CROSS between the lines.  \n\n\nA few days in, one of the supervisors grabbed some of us and took us to the packing area.   \"We need someone to seal the boxes.\" then shows us how to use an industrial stapler.   Most of us take a giant step back.   One guy takes a step forward and says \"Sure, I'll do it.\"  \n\n\nLess then 20 minutes later, he screams in pain.  Last anyone sees of him, is a manager rushing him out with bloody cloth around his hand.  \n\n\nAs a temp he was lucky if the agency or the customer even paid for the ER visit.   Forget sick time or follow-up care.",
            "When I worked for a job that had a compactor on site, it was a class A safety violation to even suggest someone climb in the compactor for any reason. Class A means you're fired immediately. No ifs ands or buts.",
            "Similar story from the great Mart of walls. No mc, just smart about it. They wanted me to unclog the compactor because some yutz was throwing broken pallets in that were just long enough to get caught on the flange. I said fine but I want maintenance to lock it out first. They refused cause maintenance was too busy. So I walked over to the control panel, opened it, and yanked out every fuse they had, and put them in my pocket, all while maintaining eye contact with the manager on duty. No word was said and I cleared the compactor. At the time, while this was technically a maintenance issue, because it was a physical obstruction it did fall under my job as well.\n\nEdited for grammar.",
            "What trouble was tossed upon George?",
            "There's an absolutely horrifying 911recording floating around the internet of a young lad who lost his leg in a trash compactor. He was working alone and the compactor got jammed so he crawled in and stood on the pile of cardboard like had been told to do by his boss. \n\nThe call lasts over 20 minutes and is simply heartbreaking at how polite he was despite having his foot amputated. At one point he begged the operator to tell his Mum he loved her and asked him if it was ok if he prayed. \n\nIf you find it, have tissues handy cause even the strongest have cried listening to him.",
            "Kind of reminds me of when I was working with some welders. They (the team I was with) wanted me to brush the welds as they finished them and moved to the next, on like a large frame for a greenhouse, with no ppe not even some fucking sunglasses. So I'm like I like my eyes so let me go get some goggles so I don't go blind so I go to boss man and boss man was pissed bc he'd apparently been telling them the expressly not do that.",
            "Yeah that is why lock out tag out was invented.",
            "Jesus Christ, I’m glad your dad knew to stand up for himself. This could have ended so badly.",
            "The words \"trash compactor\" and \"crawl into\" should never be spoken together...",
            "Damn.. good shop steward…",
            "And the manager learned his lesson?  Fuck yeah!",
            "Now *that's* what a union is for.",
            "Updoot for worker solidarity! Good work, Kenny and dad!",
            "> George was actually a nice fellow\n\n> George tried to bully a college-aged employee into crawling into a *trash compactor* and risking an awful gruesome death just to get the fucking thing unjammed quickly instead of taking time to do it the right way\n\nOne of these statements is wrong.",
            "There is a 19-year-old kid who died a couple years ago in my state the second day on his new job\n\nThey were running a wood chipper and when it jammed they would use a handle to push the stuff out of the way instead of hitting the emergency stop and clearing it and then restarting the machine correctly. The kid cleared the jam and the blade started spinning again and sucked him in.",
            "I wouldn't go into a trash compactor no matter how trained I was or how much they paid. Wouldn't that be one of the most important rules there?",
            "I need someone to crawl in and unjam it.\n\nNope, not without an engineer/mechanic locking and tagging it out first.  Thanks.",
            "You see kids, this is why unions are bad! /s",
            "And that's why you need to unionize!",
            "And if he had been trained, the first thing they teach you is don't *ever* climb down into the compactor. If all else fails, you call the company to remove it from the outside and clear the jam from there. But you never, ever enter that machine.",
            "If someone tells me to \"Crawl in and unjam a compactor\"  I'm walking on out of any building/job thats in even if the alternative is homelessness. I'd rather not be dead.",
            "There is no way I would crawl into a compactor",
            "A good shoppie is worth their weight in gold. \n\nAnd people who take shoppie positions to stick around longer are scummy fucking bag lickers and have no place in unions.",
            "This is why unions exist. While unions has problems, they certainly solve more than they have.",
            "I'm so grateful for the Kennys out there looking out for us in the midst of the Georges",
            "> …the trash compactor is jammed, and I need [you] to crawl inside and unjam it.\n\nWhat the hell?? That’s a hard no, George dear. A **hard** no on maybe getting compacted to death on the job. Holy hell!",
            "That's one of the often overlooked benefits of union membership, keeping you safe. Non union shop you do what your told safe or not.",
            "So many people get hurt or die because of this shit, glad your dad wasn't one of them! It's not even malicious when they endanger peoples lives, just stupidity.",
            "I once saw a video on Reddit of an accident like that happening, the stone crusher got stuck with a stone that was too big for the machine and one of the employees was tasked to go on top of the stone that got the machine stuck in the first place and just move it, he ended up  falling along with the stone and grasping the sides of the stone grinder, but the machine kept going and swallowing him little by little until he was gone. No screaming, no sudden moves, nothing, pure shock.",
            "And what exactly is supposed to happen when you’re inside the thing that is supposed to compact, after you unjam it?",
            "Clarence had the IQ of a jack rabbit.  Not George.  https://xkcd.com/386/",
            "Kenny is a bally hero!! He very likely saved your dad's life because an incompetent manager didn't understand that heavy machinery and human beings aren't supposed to mix!\n\nI saw a video a few days ago of a guy who went to fix something instead of refusing. He didn't live to tell the tale",
            "going inside a trash compactor feels like some kind of a nightmare scenario to me.",
            "Good thing he was smart enough to call in for some help from an authority above him, I worked at a place that had two deaths. One due to a missed LOTO (Lock Out Tag Out), and the other due to a guy that didn't stop the molding machine to clear a jam and got his head and upper body caught in the mold.",
            "Union for life.  Stand together, brothers and sisters.  We have nothing to lose, but our chains!",
            "I'm in a union too, and they still drive home the notion of \"Don't do ANYTHING you're not QUALIFIED and TRAINED how to do.\"",
            "Also was you dad trained to do lock out/tag out and the forms that are mandatory per OSHA/CSA?\n\nThis kinda story gives me nightmares, like that guy falling into the rock crusher. (NSFL/Don't look it up)",
            "Malicious compliance that led to lasting change-awesome!",
            "I somehow expected the story to be about him hiding behind the compactor, then starting it when George came by and calling in panic “Turn it off, turn if off!“",
            "Somebody committed suicide in a compactor in a place I used to work. It was before I worked there but it was just barely in frame on a security camera. Fucking horrifying way to go and you can see the exact frame where the guy changed his mind and wanted out. \n\nSo glad your dad had somebody competent on his side that day.",
            "Kenny and George have some serious Dr Cox and Dr Kelso from Scrubs vibes.",
            "Your dad is a genius",
            "Sounds like somebody was trying to shut down all the garbage mashers on the detention level and got carried away.",
            "TFW you go to work and find out you're a red shirt",
            "UNION PRIDE !!!!!!!!!!!!",
            "Way to go Kenny.",
            "If I were given a request like that, I'd wonder if they were trying to off me. D: I'd be thinking about my legal rights real quick.",
            "\"In modern business it is not the crook who is to be feared most, it is the honest man who doesn't know what he is doing.\"  -- William Wordsworth",
            "Unions for the win!",
            "Thats crazy! Your dad is awsum 😍👌 insane that the boss would do that.",
            "Didn’t he know you gotta shut down the trash compactors on the detention level first.",
            "\"Hey, the death machine is stuck, why don't you slide on in there and fix it?\"\n\nYeah I'm pretty sure I saw [a documentary about that](https://m.imdb.com/title/tt1535108/)",
            "Is your dad Uncle Remus or Brer Rabbit?",
            "Now it's just \"Hey *undocumented immigrant getting subsistence wages* go shove your hand into that de-gloving machine and remove the jammed product [or you're getting deported]\"",
            "This is why we need unions.",
            "I told you touch nothing, but you a bunch of cowboys… Do you think that’s where this mentality comes from…? Your fathers got some pretty great advice, I’d follow his lead.",
            "I'd be gone either way, that made me sweat just reading about it",
            "At least he learned :D",
            "Kenny #1",
            "What's a union?\n\n<source: US worker in a \"right to work\" state>\n\n/s\n\n:-(",
            "so...did he died?",
            ">Like George, Kenny was a decent fellow **but** was very protective of his workers. \n\nIs it a bad thing that Kenny was protective of his workers?",
            "> you had to join the union in order to work unless you were in an executive position\n\n(in which case you wouldn’t be allowed in the union in the first place)",
            "Great story, not malicious compliance I believe.\n\nHe didn't actually do the thing, nobody meant any malice and it was just a good resolution to a work place safety issue.\n\nI.e. I sincerely hope that refusing dangerous work that goes explicitly against the already written contract isn't malicious.",
            "Rewrite this summarized in one paragraph and then I’ll read it",
            "This story seems like it’s been condensed.",
            "That movie Elysium could have been avoided if Kenny had been around.",
            "Obviously, George made a gross judgement error, but it does sound like he took the lesson to heart.",
            "Training is required for managers, too!",
            "Your dad dodged attempted murder there LOL\n\nWould've looked like an accident!\n\nI'm kidding. Good on your dad though. Bosses shouldn't treat their employees poorly if they want everything to run smoothly.",
            "Humming the tune to “we just come to work here, we don’t come to die” on this fine morning after reading this post",
            "Another case of a supervisor needing training.",
            "This could have ended up a r/Mrballen story.",
            "Reminds me of the plot of Elysium",
            "No LOTO procedures?? My god",
            "Great, great story telling. It felt like a flashback scene from an italian-american old school thriller",
            "\"Dad, what is this union you speak of?\"",
            "This reminds me of a video where the guy actually got crushed."
        ]
    },
    {
        "post_id": "ozillr",
        "author": "dalek_max",
        "title": "All tattoos must be covered? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ozillr/all_tattoos_must_be_covered_okay/",
        "score": 17473,
        "num_comments": 725,
        "created_utc": 1628294213.0,
        "selftext": "Worked in a nursing home about 10 years ago as a RN on night shift. Had two small upper forearm tattoos (text)  upon hire, but usually wore a jacket to cover them. Was never an issue if I had my jacket off, always struck up a conversation about my ink and the meaning behind it. \n\nOne day, the director of nursing announced that ALL tattoos MUST be covered at all times as to \"not offend the residents or visitors\". Okay, I worked at night, with patients who had some memory issues, so sure, whatever. Don't wanna \"offend\" anyone.\n\nMalicious compliance- towards the end of my shift, I remembered the new rule. Management would be in soon. I took two large pieces of silk tape and covered my tattoos to prove the point.\n\nManagement (noticing the tape on each forearm)- \"dalek_max, what happened to your arms?\"\n\nMe- \"oh well you guys made that new rule that all tattoos must be covered, so I covered mine.\"\n\nManagement- \"oh, I didn't know you had tattoos.\"\n\nMe- \"my point exactly. You noticed the tape yet never noticed my ink.\" \n\nSoon after, the rule was thrown out.",
        "permalink": "/r/MaliciousCompliance/comments/ozillr/all_tattoos_must_be_covered_okay/",
        "comments": [
            "I knew a swim instructor who had a tattoo on his shoulder of a naked woman straddling an A-bomb. Had to draw a swimsuit on her with a Sharpie every day.",
            "Am male. Had an ear piercing. Worked at a supermarket.\n\nAll men had to cover up any earrings with plasters so used blue plaster. One day a customer came in, asked what I'd done to my ear and angrily asked to see the manager; they were an employment lawyer. Got my other ear pierced the following week to take advantage of the newfound ability to show them off.",
            "I used to have my eyebrow pierced.   My genius DM decided I had to wear one of those little round band-aids on it so nobody would have to be subjected to a facial piercing.  Probably 20 times a shift I got asked what happened to my eye area.  The band-aid absolutely drew more attention than the ring would have.",
            "I had to do the same at my FAST FOOD job. Since I had tattoos on one arm, I wore a sports sleeve rather than a long sleeve shirt under my uniform (it was hot). People CONSTANTLY asked what happened to my arm and I'd explain I wasn't allowed to show my tattoos. Before that rule, no one ever said anything. Stupid rules draw MORE attention to tattoos lol!",
            "I worked in a store in the mall that thought it was a high-end boutique (I genuinely loved their clothes, but it was not remotely a high-end boutique) and they made me wear long sleeves in the summer to cover my tattoos. The company felt that tattoos on their employees would distract customers from the clothes. It was always an eye roll and a laugh when a customer covered in tattoos would ask why on earth I was wearing long sleeves when there was barely any AC in the building…”oh, it’s so I don’t distract you with my tattoos!” \n\nThat company is now bankrupt.",
            "I worked in a hospital with a rad tech that had two face tattoos.  She'd had her eyebrows removed and replaced by tattoos.  She looked good.  \n\nI can just imagine her with white tape over her eyebrows now.",
            "I worked at a fast food place in college, and they had a “no visible tattoos” rule. \n\nOne of the women had a butterfly or something on her hand. They made her wear a bandaid on it. \n\nPeople didn’t want to take food she’d touched, because they thought she’s bled on it. When the manager wasn’t in, she let her ink show. Nobody gave a shit about her handling their food on those days.",
            "Damn, I would need a wetsuit or overalls",
            "10 years ago maybe, if they said that on my unit now every single nurse would be wearing long sleeves",
            "I had a retail job at a pretty conservative clothing store and they knew I had tattoos since they recruited me from another store that was less worried about tattoos (so they’ve seen them). I came into the job one day early (before the store is opened) doing visual merchandising but I had a crook in my neck so I had a huge heating pad on my neck and shoulder that they could see through my shirt. I guess my management team thought I got another tattoo and very visible on my neck. My boss took me into the office and asked me why I would get another tattoo that would show on my neck knowing their policy and asked if I was hoping to switch to the visual merchandising side of the business and reminded me that it would severely cut my hours if I wanted to do that. \n\nI had to tell her that:\n1). I didn’t get a new tattoo, I just want my neck to feel better. \n2). Do you think I got a tattoo for the sole purpose of forcefully my switching roles at work that would reduce my hours and pay!?!?!",
            "Good for you!  Most ink is tastefully done and does not offend anyone.  However, I have come across some pretty strange ones in my travels.  I inspected nursing homes for Medicare/Medicaid for 10 years.  One male nurse's aide was caring for a patient.  He had a set of arm protectors (a sort of stocking/sleeve that has the purpose of preventing skin tears in the extremely frail elderly).  I asked him what the arm protectors were for.  He pushed back the protectors to reveal extremely violent and sexual tattoos that covered both arms from his wrists to his elbow.  Another time, a female nurse's aide was caring for elderly patients with the words \"Slit me\" tattooed across both wrists.  I suppose that there are some people that the \"cover the tattoo at work\" rule is a good idea.  But it should be based on the individual, not a blanket rule.",
            "If the rule is literally \"all tattoos must be covered\", cover them using a transparent material!",
            "[deleted]",
            "I worked at a university sandwich shop in the 80s and got my nose pierced - (this was in the you could get a piercing at an underground tattoo place in NYC only days… ) - had a drunk guy come down the line one night: “ oh my gif they let you work here with that thing?”  Me: uh yeah why?”  Him: “you look like someone who’d spit in my food”  me:  “keep being so nice to me and I just might” him:  <derp>  blink, blink slide away while looking at his feet… \n\nPeople are idiots.",
            "So if someone got permanent makeup, would the have to wear a ski mask to work?? Would be an amazing MC if they worked as a bank teller!",
            "I work in an asian corporation, and I am covered in tattoos. I have to wear a full suit everyday to hide them. occasionally we'll have corporate retreats or whatever where everyone will be naked together and it always comes up as an issue.   \n\n\nthey can't say anything to me because i'm good at my job but the evil looks and the nagging i get is the worst. sometimes we'll be at a place where they don't allow tattooed patrons either and I will bow my head and tell my colleagues to have a fun night without me.",
            "I was recently in the hospital and noticed several of my nurses had tattoos. Nothing offensive. Birds, flowers, lyrics, whatever. And let me tell you...as I was feeling like death in the hospital all I could focus on were these tattoos. Also, while she was trying to do her job her tattoos made it extremely difficult for her to put in an IV, give me my meds, etc. I immediately demanded another nurse /s \n\n\nSeriously though, I’ve never understood tattoo hate. Think they look like shit? Well, I think ur ugly ass shoes look like shit. It literally doesn’t matter and unless those tattoo jump off your body and slap the IV out your hand, idgaf. Do your damn job and that’s all that matters. I understand if it’s gang signs, drugs, vulgarity, etc. \n\nAlso, those nurses I had were some of the smartest and most helpful nurses I’ve ever had!",
            "I had to do something similar at Starbucks back in the day. Rule was no visible tattoos, and that included the small ones above my ankles. So each day I would cover them with Band-Aids, and constantly have customers ask what had happened. But they'd never commented when my tattoos were visible...",
            "I can’t wait until we don’t have to worry about these stupid tattoo/piercing rules in the workplace anymore.",
            "Boss at my old job let women wear all sorts of jewelry, even though policy stated we were only allowed one earring per ear, a necklace, and not much else. Some female employees frequently more multiple necklaces, facial piercings, multiple earrings in each ear. \n\nI’m a guy with slightly longer hair (hid my earrings), and my ears are very slightly stretched. Upon seeing the HR manager with gauges quite larger than mine, I decided to go up a size, and when the boss saw my tapers he lost his shit and said I was in violation of the rules, while surrounded by female coworkers wearing shit loads of jewelry, and my two tapers were over the line.",
            "they're already dying and now they have to deal with your tattoos smh /j",
            "Great explanation too. They walked into it and you did not disappoint.",
            "One of my friends went to med school and became a surgeon. She also has full sleeve tattoos. Apparently the only people who really care are the more elderly patients she has. There have been a few who requested a new surgeon, anyone under around 50-60 tho seems perfectly fine with it.\n\nAs a long haired dude I have lost job opportunities by refusing to cut my hair, yet female employees can walk around with hair to their waist and its all good. \"We DeAl WiTh A pRoFeSsIoNaL cLiEnTeLe WhO wIlL bE oFfEnDeD bY a MaN wItH lOnG hAiR\" I'm sorry but if long hair on a dude offends you so much you would do your business elsewhere,, you need to chill tf out.",
            "My son is IT director for a huge Cancer practice in America. His arms are both covered in Tats. He always wears a long sleeve dress shirt to work, as he is conscience about not  \" offending \"  the anti Tattoo Staff and Doctors.\n\nWe are at a wing joint on the weekend having wings and a beer, and he looks across and sees one of the Cancer doctors. My son says \" hey doc Jones! how you doing?\"  Doc Jones is having a beer with his wife and sees my son, comes over to talk to him. My son has never saw Doc Jones without a shirt and tie. Doc Jones has both arms covered in Tats!  they both got a kick out of that....lol",
            "Cover up your forearm tattoo with one of those long sleeve shirts that make it look like you have tattoo sleeves.",
            "Lol. As someone with eyebrow tattoos, eyeliner tattoos and lip tattoos, it would make walking around and doing stuff very hard with my face all covered up.",
            "Where I used to work, they had a policy that all tattoos had to be covered. Despite the fact that the business very much attracted an \"alternative\" employee base, the business caters to older and wealthier clientele, so they decided it was best to make all employees cover up their tattoos and take out all piercings while they were on the clock. If your uniform didn't cover your tattoo you were expected to either put makeup over it that blended in (vaguely) well enough to pass as skin, or to wear something like a bandage/extra piece of clothing specifically to cover that tattoo.\n\nWe had multiple female staff who were in uniforms that didn't cover their shoulders, but had tattoos on their upper arms/upper backs. There was at least one member of the staff who regularly wore a full size (at least 2\" x 4\") bandage while at work because she didn't want to wear the full-sleeve shirt option for her uniform, and management told her she had to wear something to cover the tattoo... it wasn't even an offensive tattoo, or something that people might object to. It was genuinely decent-to-good artwork, and it looked infinitely worse to have a massive bandage slapped over it.\n\nMeanwhile one of my direct supervisors had some ink on the back of their hand, and management told him he was expected to wear a massive bandage to cover the back of his hand every time he came to work. Fortunately, he was one of the most charismatic and endearing members of our staff - after multiple conversations with our customers, enough of them put in complaints to the business/upper-level management about how bad it looked for him to always be wearing a massive bandage on his hand that they eventually relented and told him he was allowed to come to work without it.\n\nYet, to my knowledge (haven't worked there in a while), they still require everyone *else* to cover their ink to clock in. They'd rather carve out a deliberate exception to the rules based on customer complaints than acknowledge they're out of touch idiots.",
            "I have a ton of tattoos and while my arms aren't full sleeves they are very close to full. I also teach. I started getting them done once I had my contract secured so they couldn't let me go over it. They have never been a problem, but some of the bosses don't like it. There are a couple others in the district like me, and a lot of teachers have them now.\n\nTattoos aren't offensive except to a small subset of old and religious people, which often overlap. Fuck 'em.",
            "I wish one of the nursing homes I worked at was like that. I have 4 dime sized sea turtles on my ankle. Sometimes when giving many showers I just roll my pant legs up a bit to keep them from getting wet (I HATE wet pants legs). “You have to cover your tattoos!” So like half the staff would be waking around with random pieces of tape on their arms and legs. The tape certainly always drew more attention than the tattoos did. Nobody, and I mean nobody (besides my dad, because “tattoos are for degenerates not my kids”) is getting offended about tiny sea turtles. I’ve had a literal catholic nun compliment my sea turtles. Anyway, for that and many other reasons I’m glad I only worked there for four months.",
            "Not tattoo-related, but my first teaching job out of uni, I had a head teacher who always wore polo shirts and drill fabric trousers to school. He was in his late 60s and had long pure-white hair that he always wore in a slicked-back pony tail.\n\nI cannot tell you the number of students who would comment to me that you could see nipple piercings clearly outlined through his polo shirts. Quite frankly, I was never game enough to look at his chest area for long enough to confirm or deny the comment. Also, my care factor was quite low. I used to tell the kids that it was no one else’s business but my head teacher’s as to whether he was pierced or not, and that I would rather not be thinking about it one way or the other given that he was effectively my manager.",
            "I worked as a housekeeper at five star property in Las Vegas. As was the normal thing to do, I wore long sleeves to cover my tattoos. Day one comes and I’m ready to change into the uniform and asked if I wore longsleeves to my interview. Duh. She says you can work like this day one but that tattoos must be covered. After shift I got get Dermablend and covered my tattoos. Work two weeks training got my pay and quit. Dermablend is incredibly expensive makeup and usually it works. If you aren’t sweating and making beds with silk sheets. Orange stains alllllllll over the beds, I’m surprised they didn’t get complaints and figure out it was me.",
            "Almost the same happened at my first nursing job. New rule about covering all tattoos. I pointed out that our manager had tattooed on makeup and asked when she would start covering it up. Suddenly no more rule.",
            "Reminds me of one of my paramedic freinds had to have all tattoo covered so he wore one of those tattoo sleeve shirts to cover up his small tattoo on for arm",
            "It makes me sad that some employers are still so closed-minded about tattoos.  I don't have any myself but I love seeing other people's.  There are some true works of art.",
            "As someone with visible tattoos working in a nursing home, that’s so ridiculous. The old folks really don’t care and neither do families. I’ve gotten only compliments from residents.",
            "I would enjoy a bit of MC with mine. My ink on my body is usually covered by clothing, but trying to cover up the semi permanent make up that is my tattooed eyebrows & eyeliner would be interesting. Strips of tape on the eyebrows  & dark glasses or swim goggles  maybe?",
            "Why I am glad I moved out of the \"bible belt.\" Don't have to worry about people judging me over my ink.",
            "I'd cover the tattoo with a picture of the same tattoo",
            "I worked in a care home a few years ago that was part of a group of care homes owned by someome... The manager of the care home was awesome, not just because she actually cares about the residents but because she cares about the staff too (I use the present tense because I'm pretty sure she's still working there as the manager)\n\nAnyway, we had all types of residents not just ones with dementia... And there was the old boy in there who had an option about EVERYTHING! One day he got on to the subject of Tattoos and how the look horrible on women and how they're not ladylike and he always notices them no matter how small or hidden they are (weird, because most Tattoos are covered with clothes and at this care home the care staff wear tunics that cover your backside 🤷🏼‍♀️) basically getting at one of the other carers... I said that I personally love Tattoos on women... And he says \"But you don't have any Taylou33...\" Bare in mind at that time I had two on my wrists, (one on each) one is a purple and green daisy chain bracelet tattoo, and one is a black Japanese symbol with blue outline on my inner wrist, (supposedly it means strength... This was at a time when everyone was getting Chinese symbol Tattoos and I decided to be different and \"edgy\" by getting a Japanese tattoo... Yeah, 19 y/o me was a total dick... But, if it means what it's 'supposed' to mean then its pretty cool as its highly symbolic to me, excuse the pun), I tell him that I've actually got a seven tattoos and two of them can't be hidden very well here because they're on my wrists (care homes get SO HOT and you really don't want to be wearing long sleeves under a thin tunic!). Tnis old boy then tries to tell me that I don't have tattoos else he'd have seen them... So I walk up close to him and hold my arms out and show him my wrists... All he could say is \"oh\"...\n\nHe never picked on or got at any member of staff about tattoos after that... I wasn't horrible to him (as much as I wanted to scream at him, but that tends to get frowned upon by management)... He was also they type of man that if you didn't answer his call bell, or A call bell right away, no matter how busy the carers are he'd have a pop... The care home I worked at has two different call bells one means a resident wants assistance, the other means drop everything making sure no residents are in danger and get here now... One night one of the other residents had a fall and he pressed the normal call bell so we took our time (3 of us on a night shift about an hour after shift change, so the senior was doing the meds rounds and me and the other carer were helping people get ready for bed). I'm available after 5 mins so look where the call bell is coming from, go down to see who wants what, see the other resident has had a fall and hit the emergency bell... As we're assessing the fallen resident the old boy who doesn't like tattoos on women kept saying \"I pressed that bell and it took you lot 20 minutes to come\" I looked him dead in the face, in front of my senior and said \"No, I came after 5 minutes, we can't just drop everything if its not an emergency... Don't start!\" he fell silent on the spot... I spoke to my senior later on when we had five minutes and asked if I was in the wrong for what I said to him and she said no not at all, and you did me a favour because ei was about to say the same thing to him!\n(just gave that 2nd story so you can get an idea of this bloke)",
            "I am a senior in a nursing home, I'm covered In tattoos and have a lot of piercings on my ears a septum and vertical labret. My residents love them, they always strike up conversations on my tattoos, and the relatives do too. I also have bright green hair right now.  My manager isn't bothered at all, he said I can have whatever colour hair, and never said cover my ink but if we receive complaints we may have to discuss tonight it down a bit which I think is fair",
            "That’s the Streisand Effect illustrated (pun intended) right there.",
            "Didn’t anyone have had taken account of the ‘contents’ of the tattoo? \n\nLike, in a dementia department, I guess a skull eg would cause scares maybe. \nOr swear words, or just plain ugly? Our secretary regrets her tattoo and almost always covers it, but it faded and the lines aren’t sharp by far, so you might compare it to wearing chipped nailpolish (but way more complicated to restore)\n\nI’d find it more logical if the contents of the tattoo were offensive, than a tattoo itself.",
            "Awesome",
            "I hardly see it anymore, but when business would require people with stretched ears to take their plugs out. \n\nI would way rather see someone with plugs then their dangly earlobes with a 1” hole in them.",
            "I have my ear tattooed. In nursing school they asked me to cover it. My first day with patients I had to bandage my entire ear which looked ridiculous and got a lot of comments. The second day they asked me to cover it with makeup which made it look like I had a horrible skin disease and actually scared people. Fortunately on the third day they told me not to bother. I went the rest of the year without a single patient even mentioning my tattoo. No one cares if no attention is brought to it.",
            "Tattoos, colored hair, piercings, etc being seen as “unprofessional” is just an old boomer bigot mentality that needs to die off already.",
            "I don’t get it. How does what someone does with their body offend someone else?? How does having tattoos offend anyone?? Imagine if I went around being offended by pierced ears because “I don’t believe in it”. Why in the world does that shit matter to other people. I could understand if someone had a giant swastika tat in a visible place but a tat of flowers or a bird shouldn’t matter to anyone.",
            "My cousin has a medic alert tattooed on his wrist because he forgets to wear his bracelet. Can you imagine collapsing at work and a paramedic not being able to immediately notice the Caduceus with ADDISON'S written under it?",
            "Worked in one myself that a rule like this. Thing is they never cared, except for day shift workers, and when there was going to be an inspection for the health department. Because piercings and tattoos apparently mean we can't do our job properly to the state? \nSo despite being at least a dozen of us with nose studs they said they had to come out or be covered. Well Idk if you've ever pulled out a nose bone but it fucking Hurts when the end goes through. So I and many others who just didn't want to take our a screw, put band aids on our nose. It looked So stupid and all the residents were asking everyone all day about why they had a bandage on nose, lip, even upper ear or cheeks for one aide who had transdermal implants  All at the insisting of the HR lady. Plus it was early summer, and many nurses and aides had full scrub jackets on, sweating because you can't keep it too cold in a nursing home but they had tats. One had to wear a thin scarf to cover her back of neck tattoo. I myself had my hair half down to hide mine.",
            "I worked at a sandwich shop years ago that has the same rule for tattoo's, and I have one on my inner forearm a few inches above my wrist. I would cover it with a big bandaid. \n\nAt least once per shift, a customer would notice and ask if I was OK and what happened. When I explained I had to cover a tattoo they would say they thought that rule seemed ridiculous and shake their heads.  Management preferred to have customers think I had attempted to off myself over seeing a tattoo.",
            "Leadership needs to let this stupid shit die. 30 years from now meema and popop are going to be all inked, pierced and dyed up in the nursing home playing smash on the switch.",
            "Had a tattooed colleague in retail, they treated him like shit until he stopped serving customers with tattoos, saying he felt distracted by them. Eventually they just let him be.",
            "The type of people who get offended by tattoos are the same type who are offended by slanted eyes or dark skin. Why should we cater to them? Because they are from a different time?? They just need to learn to accept people no matter how they look, and get over their dumb prejudices...",
            "I worked in a hospital gift shop before covid, and plenty of the nurses and other professionals had awesome tattoos. No one had to cover them unless they were actually obscene.",
            "I work in a hospital (in admin) and a lot of the patients either take no notice of my tattoos (a lot on both arms and some on fingers) or they're like that's really cool what's that. I don't think they cause offence anymore.",
            "I'm so glad that the people who set these rules are on their way out.\n\nNo customer is ever arsed about ink.",
            "Fuuuuuck anti-tattoo rules",
            "I can't understand how a tattoo could offend people? Like I would agree if it was an offensive or morbid tattoo, but how can a tattoo of a (for example) dog be offensive?\n\nThe only reasonable explanation I can think of is that people who look at a tattoo and are afraid of needles could think about those (?). Surely that's not the case because by the same logic even patches could \"trigger\" people who are afraid of blood or something...",
            " I have tattoos on both wrists. One employer decided they were soooo offensive that I had to wear bandages over them… which then just made me look like I’d tried to slit my wrists. 🙄",
            "I think the stigma against tattoos stems from the fact that they were usually found on \"fringe\" members of society. Sailors, prisoners, gangs, etc. Also, dirty needles spreading Hepatitis was a real problem. It was only maybe 10 years ago that our local blood donation center allowed people with tats to donate.",
            "I have microblading done, I'd have a blast with my MC",
            "We have a policy that encourages scrubs to be worn but not mandatory, we would get an allowance if it was mandatory. Some higher up decided that it was time to change the tattoo policy as we never had any issues before. So I brought it up to the union that they’d have to pay me to cover up my arms. The company I work for backed out and I still have my ink exposed. The reason behind it “ we don’t want to trigger our delicate residents” I work psych, they love the cat tattoo I have.",
            "I’ve worked in restaurants a long time. I remember bartenders wearing armbands or sleeve covers back in the day. Then it got to the point that you literally couldn’t hire decent bartenders without ink or ones willing to cover it and it quickly changed the rule of thumb.",
            "I worked at a place that had a no facial piercing policy, but was hired with a small stud in both nostrils, manager said nbd. A new hire was told she couldn't wear a hoop in her nose, and she immediately went \"well what about her?\"... I was then told to remove my nose studs.",
            "Would love to see the MC with someone who had eyebrows tattooed on, would be hilarious if they put plasters over them 😂.",
            "The tattoo thing wow. My job now, at a blood center they don't care as long as it's not indecent. Have blue hair too if you wantq",
            "I hate places that make you cover tattoos. I can understand if it says something vulgar and you work around customers but other than that its pointless. I've had nothing but positives conversations about mine with guests",
            "Man pretty good, but I was hoping you would start covering patient tattoos in front of management \"to not offend any of the patients\".",
            "My wife worked in a hospital that didn't allow _engraved_ ear-studs \"in case the pattern fell off\".",
            "awesome, good to here it worked out for you… I was about 25 yo and in the icu and then the hospital for weeks w a certain medical condition. I didn’t have a shirt on n walked to the bathroom. I have a relatively large tattoo between my shoulder blades. My dad flipped his shit when he saw that. I just don’t get this type of thinking.  I’m in a situation where I could possibly die and my dads wants to bitch about a tattoo I have.",
            "Mummy chic.",
            "Ms. Choksondik",
            "Lol you sound insufferable always having to bring up your ink and the meaning behind it. Almost everybody doesn't give a fuck.",
            "That's nothing.. back around 2008 I worked at Arby's as a cashier. I had been employed there for almost a year when one day a customer came through the drive-thru, an old man of course, when he pulled up to the window he looked at me like in pure disgust and asked to see my manager. He told the manager that he wanted a refund because \"he didn't want to get hepatitis\" 🤷‍♂️🤦‍♂️ \n\nThe manager, who also had hidden tattoos told the guy that I don't even make food and the old prick just went off and ended up calling corporate. Apparently my manager was told to either fire me or he would be fired. He had been the manager for several years (he also has a wife and kids to support) and I couldn't believe it but he stuck by my side because he knew it was ludicrous. Anyway they ended up firing both of us!!! I tried to file a report but unfortunately in Ohio you can be fired for basically any reason. \n\nLong story short, fuck outdated rules and anyone who is offended because another person has ink on their skin. (So as long as the ink isn't racist)",
            "Darn. I was really hoping you had tattooed eyebrows. Tape there would be hilarious MC.",
            "I can understand your boss though. I’ve taken great care to put my tattoo where nobody will see it unless I run around in swim wear, because I don’t want to be seen as unprofessional when it comes to work.\n\nI think their intention was more to wear something long sleeved to hide them, instead of tape though.",
            "Then the rule exists for people who might have more extensive or more offensive tattoos than you do. Management can't have to make judgment calls for every individual person. Tattoos are a choice you make and nobody is obligated to respect that. And that is coming from someone with more than 15 hours of tattoos",
            "Lol what management would throw out a rule because of this? Op has never fuckin worked.",
            "Your story reads like bullshit. \n\n> Was never an issue if I had my jacket off, always struck up a conversation about my ink and the meaning behind it. \n\n>Management- \"oh, I didn't know you had tattoos.\"\n\n Really cool you have tattoos that seamlessly go unnoticed but strike up convos regularly",
            "Our company just changed our very outdated and conservative tattoo & piercing policy and I now have a sleeve and 4 more appointments to get the other arm done. This was done within 7 months. During COVID HAHA. I’ll add I have 19 ear piercings and two nose piercings thinking about a tongue and septum but haven’t decided yet. Yay!",
            "Have tattoos but this is a jewellery story.\n\nUsed to work in the food industry before I married and the rule was no jewellery except one plain Wedding Ring.\n\nChose a ring set with bling all over it out of spite - They were NOT dictating to me what type of Wedding Ring I was having for the rest of my life!\n\nI have not taken them off since they were put on my finger on my Wedding day.\n\nLoved to make the managers squirm because they couldn't ask me to remove them due to them being my Wedding Rings. They tried to ask me to cover them with plasters but they kept coming off with the amount of gloves I wore and all the hand-washing.\n\nThe company is gone now and I have yet to loose a single stone.",
            "This is what's considered 'malicious compliance'?",
            "You'd hate Japan.",
            "This is just compliance. Wheres the maliciousness?\n\n\"I did what I was told to do and then complained about it - Got em!\"",
            "I am Gen X. When I was growing up, the only place where one could get tattoo was jail. Thus having a tattoo meant you did a time in jail. There were some budding gopniks who wanted to be seen more mature and imposing than they were, thus they got tatttos at home. This was supposed to mean they were tough.\n\nIn the adult world, in some cases, you would not deal with people whom you could not trust or who did time in jail. Thus, you would be suspicious and instinctively distrusting f the people with tattoos.\n\nFast forward two decades. The romantic culture of the trough man in jail spread through the rest of the society, and detached from its roots. Now, every man and his dog were getting tattoos. But I still do not trust to a lawyer or jewellery seller who sports tattoos. Just in case."
        ]
    },
    {
        "post_id": "cdv9z5",
        "author": "TheInitialGod",
        "title": "Want a child ticket? Sorry man, can't let you in.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cdv9z5/want_a_child_ticket_sorry_man_cant_let_you_in/",
        "score": 17464,
        "num_comments": 612,
        "created_utc": 1563273155.0,
        "selftext": "So, here in the UK, a 15-Rated film means that you have to be 15 to see the film, no exceptions. Back a few years ago, we had 2 ticket types at my cinema.  Adult and Child (it's since changed to incorporate a Teen ticket).  Child was Under 15, and Adult was anything 15 and above.\n\nThis guy comes in with his mates, back of the queue to get in, but can be heard throughout the foyer being all loud and obnoxious, and the generalisation I've found in my experience in the cinema is that if they're teens on their own and they're loud and obnoxious in the foyer, there's a high chance they'll be the same during the film and generally be a nightmare in the screen. I start to notice some other people in the queue looking over at him and rolling their eyes.\n\nI get the pleasure of serving this guy. Comes up to me, still shouting over at his mates who are getting served by some of my colleagues, and asks for a ticket to see this 15 Rated film (can't remember which.  One of these low budget crappy horrors that have come out in their many sequels recently... Insidious, or Sinister, or Annabelle or whatever).  \n\nHe looks about 16/17, but since he said \"a ticket\", Work Script Autopilot takes over as I ask how old he is so that I can sell him the correct ticket type. Him being the person he is, and probably since he's gotten away with it before to get the cheaper ticket price, said he was 14.\n\nThe moment he said that, a massive grin washes over my face. \"Sorry mate.  This film's a 15.\" holding back my glee at not having to deal with his bullshit for the next 2 hours.  \"I can't let you in\". No amount of begging and pleading would make me budge, so he asks to speak to the manager. Manager comes down, sides with me and he's on his way, day ruined.",
        "permalink": "/r/MaliciousCompliance/comments/cdv9z5/want_a_child_ticket_sorry_man_cant_let_you_in/",
        "comments": [
            "This reminded me of a friend I had a long ago, In 2002 when he was 16 and had a beard the following conversation occured at the ticket counter:\n\n- I want a ticket to Spider-Man\n\n- I can't sell it to you, the movie is PG 13\n\n- How old do you think I am?\n\n- Eleven\n\n- Lady, look at me, I have a beard\n\n- You could have done a hair implant\n\nNeedless to say he became known as Eleven afterwards.",
            "I had it the opposite way around once we were going to see a r15 movie and I was 16, but being sixteen I didnt carry ID. The lady refused me entrance to that film because she didnt belive I was over the age of 15.\nMy friends and I decided that was fine and that we'd srill see a different movie, but I decided to be a little petty and asked for a childs ticket seeing as she belived I was under 15. \nOnce again she refused to sell it to me because she didnt belive I was under 15. \nEventually the manager was involved and I was given a half price ticket to our second film choice.",
            "My first job was in a movie theater, and I loved catching people doing shit like this.\n\nOne night I was ticket tearing, and this couple in their 30s walk up. They hand me tickets, and I glance down to see the auditorium number so I can point them in the right direction.... And see that they have bought CHILD tickets from the self serve kiosk.\n\nI tell them I'm so sorry, I know those machines can be confusing, but you'll have to go up to the help desk and return your tickets. They can exchange them for adult tickets for you. (I was just being professional, we all knew they did it on purpose)\n\nI knew something was up when they returned the tickets, but instead of getting replacements from the desk, they went back to the kiosk.\n\nThey return to me with two SENIOR tickets. Now I'm pissed. I give them the same spiel, and dude is pretty upset at this point. They finally get their correct tickets.\n\nHere's where I had fun: since it was an R rated movie, we had someone stationed at the auditorium door checking tickets to make sure kids didn't sneak in. I radioed him, and told him to check this couple's IDs, even though they were obviously old enough. I also asked the concession stand to card him if he used a credit card (something we could do if we suspected the card was stolen)\n\nA minor inconvenience, but it was pretty satisfying watching him have to keep clawing his wallet apart in ever increasing frustration.",
            "I once remember overhearing a kid moaning about not being let into a 15, saying 'I've got size 9 feet, of course I'm 15'. I think the ticket guy had to hold back from laughing.",
            "I have a reverse story.  When I was in high-school, the gloriously tacky [Starship Troopers](https://www.imdb.com/title/tt0120201/) came out.  It was rated R, meaning you had to be 18 or older to see it.  Of course, I and all my friends wanted to see it.\n\nSo we buy tickets for a different movie, and head into the Starship Troopers theatre.  The theatre is maybe 1/3 full (small theatre, smallish town). We're sitting there all smug in our epic teenage awesomeness at beating The Man(tm).\n\nThen a theatre employee comes in, and says loudly \"So... we have 2 tickets sold for this movie.  The rest of you go see the non-R-rated movies you paid for.\"   Cue dozens of teenagers sullenly leaving the theater while the 2 people with tickets were laughing their ass off.   My friends and I did go see the movie we paid for;   [it wasn't great.](https://www.imdb.com/title/tt0118689/)\n\nedit:  JFC people.  I know that Reddit is mostly US users, but the entire world doesn't follow US laws.   Where I am, movie classifications are controlled by law.  Under-18s cannot see R-rated movies, even with adult accompaniment, period.",
            "It was definitely annabelle",
            "This happened to me and my friends once but by accident. Our school years are September to August, and the last person in our friend group had finally turned 15, in August. We rocked up to the cinema (not obnoxiously I might add) and she asked for a ticket and then said she was 14 by accident.\n\nThey wouldn't serve us after that. It was her actual birthday that day.",
            "Jokingly did this once with a couple of mates at the local cinema when we were 16. Woman at the box said no problem, but then pointed out the age rating. We confessed our ages but she said she couldn't let us in as for all she knew we were lying again. Eventually she settled on flipping a coin, we won, paid the extra and got in. Would never have worked though if it had been busy or if we were dicks about it.",
            "[deleted]",
            "I had the reverse of this once. I asked for an adult ticket to see Deep Blue Sea. The guy asked how old I am and I insist I'm 15 to get in, after a back and fourth he eventually says it's cheaper if I'm a child and points out the film was a 12. Good guy.",
            "hahahahah he shot himself in the foot! i love it!",
            "I took my cousin to see Spawn when it came out which was before the 12a rating was introduced and it was just 12 and above. He was 14 at the time and the ticket guy asked without any idea how absurd he sounded if he had any ID.\n\nLike what ID is a 14 year old meant to be carrying around other than possibly a passport which not even everyone has. After much arguing back and forth he eventually just gave up. Best part after the movie I realised he'd only charged us for one ticket.",
            "Went to see an R rated movie with my buddy one time.  Being a smart ass, I asked the kid for “1 child for “R rated movie””.  Which I received.  The ticket checker took my ticket, and waved me in.  Said buddy was pissed. Lmao",
            "Two guys came through my line at work where we have children's and adult pricing for entry into paid exhibits for my museum. Two very grown men told me they needed a child's ticket for the one of the adult man with tattoos and cigarettes and I was like \"whatever, here.\" Then the other guy was like \"wait, lemme get two\" and I told them minors couldn't be unaccompanied and processed the adult and child's ticket for these 2 very grown men. It was funny.",
            "One time I was with my boyfriend, him 22 at the time and me 20, going to see an R-rated film. In the US you can be 16 I think (it might be younger) accompanied with anyone over 18 and see an R-rated film. Which honestly shouldn’t matter in that case because I’m clearly over 18 let alone 16, wearing a full face of make up and heels I’ve been told I look 25, which I was wearing that evening. The woman at the box office refused to sell him two tickets because I didn’t have my ID on me, but she never asked for his ID? So we just walked over to the self-serve kiosk and purchased the tickets, all while she is glaring at us knowing her attempt at ruining our evening was squashed. I still get heated thinking about that unnecessary bullshit.",
            "I tried pulling the same move when the Inbetweeners movie came out. Pretty hilarious seeing it from the other side.",
            "Had the same thing happen when I worked at a theater. Snotty kid came in for a pg13 movie wanting the \"under 12\" price.",
            "buy a fucking ticket to the G rated show and walk into the show you wanted... who ever checks the ticket past the gate?",
            "Could just come back in and buy a full price ticket",
            "Sounds like you work at a good cinema. Our local one lets 13 year olds see r rated films lol",
            "As a regular cinema goer, thank you. People who are loud and obnoxious in cinemas deserve to be taken outside and shot.",
            "I look about 3 years older than I actually am so it works out for me in some cases like seeing R rated movies.",
            "The teen then went home and used BitTorrent to download the movie ;-)",
            "I once had a theater in the states sell me a beer, then not let me in to a pg13 movie.  Was a really weird day.",
            "I work at the theaters as well, and asking for ID on obviously young teenagers is what makes work fun! I only do it to teens that seem like dicks.",
            "Probably a not so nice move on my part but once time I took my little brothers (they were like 15 years old at the time I think, maybe 14) and we wanted to see that one Halloween movie, the one with Micheal Myers or something. But the lady at the desk was doing her job correctly and didn't let us in, even though I thought they could go with an adult, which I was 19 yo. After being turned away we decided to go back and buy tickets for hotel Transylvania, and then we went into the theater showing Halloween.\n\nIllegal, idk,  but we had a good time",
            "With great power comes great responsibility.",
            "Insidious and Sinister were actually pretty good horror movies.",
            "Nice.",
            "So he had no ID saying he was 15 or over?",
            "This reminds me of when i worked in a cinema a few years ago.  \nAdding to the age restrictions, we had a group of loud, foul mouthed kids, about 11, wanting to come in and watch a 12A (where you can either be 12 or older, or under 12 and accompanied by an adult)  \nAnyway these kids come in and ask for tickets to watch Guardians of the Galaxy 2\n\n  \nI asked them for their ages or any form of identification that they have to prove their ages.  one was 12 and had  his Passport with him so i sold him his ticket the others said that they were 11 but nearly 12. Unfortunately, nearly 12 isnt 12 so i told them i couldn't sell them the tickets (Cinemas can get hefty fines for it).  \n\n\nThey start yelling and saying that they will call their mum who will  buy them the tickets and come back later.(Oh the Joy)  \nAbout 20 mins go by and the kids mother shows up, starts yelling at how its just a 12A and they have her full permission to watch the movie.  I ask her if she will be watching the movie with them and she mentions that she has other things she needs to do so she wont be watching it. Again i tell her that is she is not going to be watching the movie with the two kids under the required age they cannot watch the movie.   \n\n\nShe asks for the manager and he tells her the exact same story and she and the kids leave.   \n\n\nThe kid who was able to watch it ended up getting a refund and brought a tango ice blast instead...",
            "Sooo satisfying",
            "I was a 6'3\" sixth grader.   I used to carry my birth certificate in my wallet so I could get into the movies for the cheaper ticket.   Of course it stayed in my wallet for an R rated flick.",
            "(US, rated R means you have to be 17 years old to see the film.)\n\nA different take, take from this what you will:\n\nI’ve recently turned 18 years old. I have an early birthday, so I’m going to enter my senior year of high school.\nMy family is well below the poverty line, my mother is disabled and can’t work and I have a 13 year old sister. My father is not in the picture. We have one car, and I haven’t gotten my drivers license due to drivers Ed being ~$350, not to mention more than likely needing to purchase another car to drive in the first place. I have two jobs, one on weekdays and one on weekends.\n\nI find time to go see Rocketman, the Elton John adaptation. You know, the one that’s only rated R because of one homosexual sex scene? The musical? yeah. that.\nI get carded, and she asks to see my drivers license. I inform her I don’t have one and she asks for a passport. I tell her I don’t have one of those, either — i’ve never even left the country.\n\nShe tells me without any hint as to how old I am, she can’t let me in to see the film. I ask if my student ID will do, she declines. I say I have my SScard, she says that won’t do either. I’m angry at this point, as I’m old enough to vote — and a voice pops up from behind me. My manager at one of my jobs is there, and vouches to give the woman her card and she’ll provide verification from my job how old I am.\n\nDespite my manager trying to be my knight in shining armor, the ticket saleswoman won’t budge. I ask what else I could possibly provide her and she has no idea. I’m extremely upset and storm home, saving money on overpriced popcorn and pirating the damn thing at home regardless.\n\nMy take is while yes, obviously underage kids by 4-5 years should not be allowed in, they’re ridiculously strict on the carding of people on these films. The rating system is bigoted and corrupt regardless and these theater companies (keep in mind i’m blaming the companies, not the workers themselves — I work two minimum wage jobs, I understand policy is policy) have their heads trapped in the sky about “oh? a gay sex scene? R. A straight one? PG-13.” “Ok, they said “Fuck”, but how many TIMES did they say it?” \n\nThey seriously need to walk around outside, they aren’t protecting the innoncence of anyone.",
            "Strict movie laws yikes",
            "My only gripe with your story is slamming this new crop of horror films as crappy and low budget. If anything I feel like the last decade has been a resurgence for decent horror films. Granted not all of them are gold, and while I've liked most in the Conjuring Universe (didn't care for the Nun and the most recent Annabelle was probably the best of the 3) there are exceptions, but we haven't had this many consistent decent horror films in a couple decades IMO. The 90s and 00s had films that catered to just pure jump scares with shifts in volume and very little of the good deep psychological terror. Or just weak Americanized knock offs of Japanese horror series like Ju-On or the Ring.\n\nHorror movies as a genre seem to be consistently better than most genres in theatres right now. Comedies are struggling and underperforming (feels like Hollywood forgot how to be funny for some reason) and Marvel still makes bank but other than Endgame, I don't feel like a lot of the movies have really been that high quality wise since Black Panther. One man's opinion of course, but of the movies I've seen, the only genre that has not disappointed lately is horror, and I'm looking forward to the 2nd part of IT coming out as well. Probably the only highly anticipated movie I can think of right now.",
            "Absolutely right! And the age you get sent it is 16!",
            "Yep that’s what is the norm now just a letter with the numbers in big fat bold print. I think they phased out the cards quite some years ago.",
            "Are you allowed to see a 15-plus while underaged if you’re with a parent?",
            "Size 9 feet here and I'm 24.",
            ".z p",
            "Well GOT DAMN! WoopEE Doo",
            "Lol! Literally had this moment happen to me while selling tickets to ‘Child’s Play’.\n\n\nFamilies will lie about how many ‘kids’ there are to get cheaper pricing. I can’t entirely blame them. So I ask this girl (well past puberty) how old she was.\n\nShe proudly proclaimed, “I’m 11!”\n\nWell. I can’t sell R-rated tickets to kids. Not even if their parent is there. Company policy.\n\nDad is embarrassed. You can tell he told her to say that. I can’t even let him try to tell me her real age(must go by what they first said). He wound up seeing ‘Men in Black’ an hour later.\n\n\nAnd then some jerk decided to complain about his 8 year old daughter tickets to the same movie.\n\n\nThings get funny/aggravating when you had ticket policies. Also this conversation-\n\n“Okay, how old are you?”\n\n\n“12-ish.”\n\n\n....Ish?\n\n\n“Okay. That’s an adult ticket.”\n\n\n“Oh-I’m ten!”\n\n\n“Sorry. I need to charge by what you said first.”",
            "Nope...just tried again right now here in So. CA and even the manager said “we don’t have military discounts.” And then walked away.",
            "How is this MC? You didn't maliciously comply with anything he told you to do, you just followed the law.\n\nMC would be like giving someone over 15 a child ticket for a discount then not allowing him to use said child ticket to get into the 15+ movie.",
            "This post was so brittish I had to double check if I was still wearing my American flag underwear",
            "National Insurance card proof of being over 16, is something we have here in 🇬🇧 UK.",
            "14..oh wait sorry I thought you said IQ...."
        ]
    },
    {
        "post_id": "lpwy23",
        "author": "Cyrano_de_Maniac",
        "title": "\"Keep digging until I get back\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lpwy23/keep_digging_until_i_get_back/",
        "score": 17456,
        "num_comments": 194,
        "created_utc": 1614020985.0,
        "selftext": "Long ago in a land a couple hundred miles away, my father wanted to dress up the front corner of our property with a section of decorative fence and a few rose bushes.  Myself, being a tweenage boy and not having the good sense to be somewhere else, was drafted to help him one hot July Saturday afternoon.\n\nWe brought the new fence posts to the corner of the lot, along with a shovel and a post hole digger, and set about the task.  It was a long slow process, as the clay-heavy soil was fairly dry and hard-baked, and as such each hole was taking the better part of 20 minutes to dig.  This definitely wasn't on the list of things I wanted to spend my afternoon doing, but such is life.\n\nRight about the time we started on the final hole Mom yelled to Dad from the house, announcing that he had a phone call.  As these were the days before mobile phones, Dad headed off to the house and instructed me to \"Keep digging until I get back\".\n\nLucky for me this hole went a bit different than the first four.  About the moment he got to the door of the house I busted through the clay layer into much sandier soil where I could get a couple inches of soil in one scoop rather than perhaps a quarter inch per scoop.  Easy peasy!\n\nNow, I was a good kid.  I didn't cause trouble of any significant variety, I got good grades, and I helped out around the house when I got caught unawares.  But seizing an opportunity for malicious compliance was definitely among my personal strengths.\n\nSo I kept digging.  And digging.  Post-holer in, squeeze, post-holer out, dump, repeat.  Dad wasn't on that phone call very long, but I made good time and by the time I saw him at the door coming back, I was quite literally putting the post-holer all the way into the ground to the point where the tips of the handles were just below the surface of the ground, and I couldn't really dig because I couldn't open up the handles to squeeze the digging end any longer.  So, if I had to guess, I'd say that hole was about five feet deep.\n\nDad: \"How's it going?\"  \nMe: \"I think it's deep enough now.\"  \nDad: \"Let's put the post in and check.\"  \nMe: (Huge grin while he stoops over to pick up the post).\n\nDad proceeds to drop the post in the hole.  ***All*** the way in the hole.  See, these posts were maybe hip height when installed, probably about five feet long themselves.\n\nSo there's Dad, momentarily struck speechless, amazement washing across his face.  He looks at me.\n\nMe: \"You told me to keep digging until you got back.\" (shrugs)  \nDad: \"You little shit!\" (laughs)\n\nDad had to grab the post with his fingertips and pull it back out of hole, and it wasn't but a few seconds of work to refill the hole to the proper depth.  And to this day he loves telling the story of his maliciously compliant son.",
        "permalink": "/r/MaliciousCompliance/comments/lpwy23/keep_digging_until_i_get_back/",
        "comments": [
            "Follow-up:  Years later Dad realized he should have followed the \"call before you dig\" rule.  Turns out that hole I was digging was within a foot or two of an underground main power line for the neighborhood.  He still has a bit of an \"I almost killed us\" guilt about it.\n\nAnd just to head off the puns at the pass... He was kind of shocked when he learned where that line was buried.",
            "Wholesome af. Love it!",
            "Reddit does love to see a good post.",
            "Glad your dad had a positive reaction to this!",
            "\"you little shit\"\n\nHe was as proud as one can be, for he was outdadded. lmao",
            "Good story! \n\nAlso, this is why you dig post holes in spring and not summer !",
            "Pro tip for clay; soak with water to make it a lot easier to dig. I did this when running low-voltage conduit in my backyard, sped the job up significantly.",
            "Holy post holes, that was mighty fine MC, right there.",
            "[deleted]",
            "Gotta love working on those hot summer days with dad! Love the story man.",
            "/r/wholesomecompliance",
            "Reminds me of this [classic song about digging holes under management](https://youtu.be/yShvgXZQBTs)",
            "I was HOPING your dad’s reaction would be to laugh and I wasn’t disappointed. He was a good sport about it.",
            "I love this. I got a free wholesome award today, you deserve it!. My dad loved to call me a \"Little shit\" too. Thanks for reminding me.",
            "Really put your PhD to work!",
            "If I wasn't so lazy I'd do that, that's also the exact response my dad would give.",
            "Reminds me of the time my dad gave me $20 and told me to go to the store and buy a bunch of bananas. I got about $20 worth of bananas. He wanted a single bunch(5-6), but I got a whole lot (20+) of them.",
            "Great story. Once when I was about 7-8 years old I wanted to dig to China like bugs bunny. My dad when he got home off of work was not amused one bit. My mom didn’t think to check on me outside as we didn’t have a pool and we had a fence. I wasn’t going anywhere. I dug quite a hole for a kid.",
            "Stories like this remind me that we used the height of the post hole digger as our intended depth due to the frost line.\n\nIt sucked the summer my parents put in a couple hundred feet of wooden fence when I was a teen.",
            "Is wholesome malicious compliance a thing? I think this is it.",
            "Love it, that is some wholesome malicious compliance!\nOne thing caught me off-guard, is your dad 10 feet tall?\n> See, these posts were maybe hip height when installed, probably about five feet long themselves.\n\nOr did I just misread that. lol (no harm no foul!)\n\nEdit: I'm stupid as hell. The whole post is 5 feet, a few go into the ground, leaving 2-3 feet that can go to the hip. I dum.",
            "This was really well written. I dig your style.",
            "Crying in Canada, post holes here are at least 4' deep for the frost.",
            "It's a post holer, it makes holes for posts.",
            "Sweet story, OP. My dad laughing and calling me a little shit was usually his way of expressing love. He never used that expression otherwise.",
            "Nearly spat my morning coffee all over my phone laughing, now that's some wholesome malicious compliance.",
            "*shoomfp*",
            "When I was 15 I had a job at a reeeeaaallly shitty beach boardwalk pizza place. The boss lady was so fuckin mean and crazy by the end of the first year there I was the only employee left. Everyone else either left or was fired (she told me once that she needed me to work through 4th of July weekend but after that I was fired... Why would I stay?) \n\nAnyways she told me know morning to \"Wash and peel potatoes until I get back\"\n\nIdk what the fuck she was doing but I was a kid and I lost track of time, all I know is I was supposed to do potatoes...so I did....for two hours.... Apparently I had done ALL of the potatoes...she was pretty mad..althou, fuck you don't leave a kid with one task and dip out for hours",
            "Even with the threat of receiving the belt, I would have definitely done this. This has me laughing like a madman good thing no one is around to hear me.",
            "Holey fence post, son!",
            "You’re a very good storyteller and writer.",
            "I thought this story would end when you popped out in the middle of the indian ocean on the opposite side of the globe!",
            "I literally laughed out loud when I read your dad's reaction. Great story",
            "Yay, a wholesome malicious compliance story! :D",
            "5' at the hip. Explains a lot! Giants!",
            "Sounds like something I would do to my dad, upvoted",
            "That moment when your son pulls a dad joke on you... Priceless!",
            "My little brother in law would do this, the difference is his dad, My father in law, would scream at him. You're lucky OP. And that story is great lol.",
            "Good on you for following those instructions to the letter!\n\n>Dad had to grab the post with his fingertips and pull it back out of hole\n\nI'd have probably tried to grab it with the post holer first.",
            "Nice one!!",
            "Aweeee",
            "We'd love you at r/wholesomecompliance too, I think!",
            "Lol, when you hit sand, I thought it was going to be marker (gold/yellow) sand to warn diggers to stop: buried electric lines!  You little shit!",
            "In 50 years time you will wish you could go out and dig holes with your dad.",
            "I'm all about the proper clay/sand terminology. Great soil science!",
            "\"20 minutes\"?\nThat's it?\nLucky you",
            "You made the worlds biggest peg hole.",
            "For real though. \n\nDigging post holes with a shopvac is a gamechanger.",
            "This is some wholesome soulfire here. \n\nYou have my upvote!",
            "Just keep digging, Just keep digging",
            "Sounds more like /r/mischievouscompliance",
            "I absolutely love that term “maliciously compliant”",
            "Unexpectedly wholesome given the usual stuff on this reddit. Muy bien!",
            "Should have used the post holer as a pair of tweezers.\n\nI'll let you decide if that is the tool, or the tool.\n\nOkay, okay...  The tool or the user. 🤣",
            "Love this:) wish I grew up with my dad",
            "Fucking awesome, I hope my kids do that to me one day",
            "One of my favourites here so far.",
            "[removed]",
            "You can just say you’re a bitch, daddy’s boy. This wasn’t impressive nor malicious",
            "[removed]",
            "This is quite wholesome :)",
            "r/wholesomecompliance",
            "A wholesome one! Awwww",
            "Thats great! A funny malicious compliance!",
            "I love this.",
            "This just had me laughing!   Reminds me much of Patrick F McManus' stories.",
            "You're from Maine, aren't you",
            "The only wholesome malicious compliance post ever",
            "Youthful AMC at its finest!",
            "That gave me a good laugh",
            "[Saturday’s with grandpa are a little different, though.](https://youtu.be/a0U9FnrhWR4)",
            "\"just dig the hole, hole digger\""
        ]
    },
    {
        "post_id": "rrh1ci",
        "author": "joke_on_you9719",
        "title": "Boss fired me for being pregnant, I’m the one who gets paid in the end",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/rrh1ci/boss_fired_me_for_being_pregnant_im_the_one_who/",
        "score": 17435,
        "num_comments": 457,
        "created_utc": 1640807731.0,
        "selftext": "I posted one of the emails she sent in r/antiwork and they mentioned I should tell the full story here. To see the photos click the link below. \n\nhttps://www.reddit.com/r/antiwork/comments/rqq213/boss_fired_me_for_being_pregnant_and_then_didnt/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\n\nThis last year during Covid had been a tough year for my family. My husband went from six figures supporting our family on his salary alone while we pocketed my entire salary to losing his job for 8 months.\n\nI work in political campaigning which means I work on short-term contracts as an independent contractor. In other words if we lose an election I move onto the next race. I made a pretty good name for myself working on the lower levels of a campaign and moving up quickly. In my state this year there were statewide elections and I caught a lucky break and ended up the Campaign Manager on a statewide race. I am the youngest CM  (24F) to run a statewide race in about the last 20 years. When the primary came up we lost the election by 200 votes. While we lost the campaign, coming so close to winning and my age made me kind of a superstar in my field. After we lost I had offers from all over the state for jobs. The problem is I had just bought a house and wasn’t looking to relocate (like you often have to do in politics) or the positions weren’t high enough coming off being the top dog as the higher positions were already filled.\n\nI got an offer to join a local campaign (so no relocation) but the salary was lower than what I was used to, I would however, be the CM again. \n\nHowever, I learned quickly my boss had a “holier than thou” personality. She made several comments about how “real” women breast feed and have natural births. I would later be able to do neither and it really screwed with my emotional well being. I don’t have time to list all the red flags but I was literally just waiting until my husband got a job to exit.\n\nThe campaign hadn’t been built out at all. There was no one other than the candidate. I ended up building out our entire team, consultant, fundraiser, staff, ect. Luckily I have made a lot of powerful connections in my time. I signed my contract and sent it in with the salary we had agreed on with the stipulation that if we raised enough money 3 months down the line my salary would be raised but could not be lowered at any point.  Just a few weeks prior I had also found out that I was pregnant and my due date was the week of the election and just a week after joining the campaign I was also in a serious car accident. Luckily my pregnancy was safe but I herniated a disc in the car accident and due to my pregnancy there were very few things that could be done as far as helping my back or pain management. If I did my job right that shouldn’t be an issue because my job can essentially be handled from home and staff could do the rest.\n\nI had The team working in lock step and I was proud of the work I was doing even though only about 10% of my views aligned with the campaign. Then we hit a snag. The candidate’s husband got deployed to a rather dangerous place for a month and she completely checked out. She stopped fundraising, which means that everything comes to a halt in campaigning. She stopped putting in the leg work to win. We also lost our only lower staff member during this time. We knew she was worried about her husband so no one on the team tried to push back very hard. Eventually her husband came back and it was go time. There wasn’t a minute to waste and I was back to getting our operation working full speed.\n\nOne day she calls me up to tell me how 20 years ago her first job as a private school teacher was making as much money as I was now. I also live in an expensive DC suburb, not the backwoods where she grew up. I have multiple college degrees and this job offers no benefits unlike teaching. Not comparable at all. This is when I realized there might be a problem.\n\nA couple weeks later, I told her I would need to take a step back from doing the other staff members job (mostly door knocking) because of my injured back but that we would hire someone. Unfortunately, due to the lack fundraising it made it hard to pay anyone else and those duties fell on her. CM’s do not typically door knock. We had a team meeting with the entire team and I started pressuring the candidate about all the things she wasn’t doing and there was a legitimate meltdown. She started yelling at me about how I wasn’t doing my job and her my pregnancy wasn’t her problem and how I was the reason everything was failing and then hung up on the entire team.\n\nThis is where the malicious compliance comes in. After this I decided to take a step back from doing all the duties that are typically handled by lower level staff and just focused on doing my job duties which weren’t being appreciated. I pretty much went radio silent and she kept nitpicking at everything. Everyone on the campaign started to grow uneasy but I told them to just hold out.\n\nWell sure enough she calls me up and says, “Since you are pregnant and can no longer door knock you can either work for (state minimum wage) or you can find a new job.” Mind you, she knew my husband had been out of work for 8 months and thought I had no options at this point but what she didn’t know is that my husband had gotten a job offer that exact day. So I stopped her right there and thanked her for the opportunity and told her I would be working my contractually obligated 30 day notice at my current salary and then leaving the campaign. She then began to scream at me about how she wasn’t paying me a dime more and started listing off a list of issues she had with the way I was doing my job. I stopped her. Thanked her once again and told her all of my finishing tasks would be completed when I received payment for the last month I worked (Yes, she was a month behind on paying me) as well as payment for the 30 day notice that she was legally required to pay me whether I continued working or not.\n\nI waited a few hours and she never finalized my termination in writing so I sent her a termination letter thanking her for the opportunity and once again repeating everything we had discussed on the phone. She sent me a nasty email again reiterating that I wouldn’t be paid for the previous month or 30 days and listed about 10 things that I had done to be terminated, including that I didn’t wear make-up to work every day.\n\nI decided to send this email to the rest of the team and sure enough everyone quit except for the consultant. In 5 minutes she lost everyone she had. Then a friend of mine offered me my dream job working for him so all in all it worked out in my favor within 5 minutes of being fired.\n\nWell, here where things get tricky. I realize that my contract that obligates her to pay me for the 30 days’ notice isn’t signed and I’m screwed. Well sure enough in her fit of rage she starts emailing everyone talking badly about me the only problem is I still have access to the campaign email and I’m seeing every email she is sending. Emails saying that she wants to keep me on staff but that I need to take less money, and that I shouldn’t have been “dishonest” about my pregnancy, so clearly I wasn’t doing my job that badly, she just wanted to pay a pregnant woman less. She also asks the consultant for a list of things that I did wrong on the campaign so that she will have cause not to pay me my contract. I notice that the consultant never replies to this email. He tells her that if she want to fight it to send him a copy of the contract and he will have a lawyer take a look at it. Well sure enough she sends him a signed copy of the contract and once again my contract is valid and she now has to pay me my severance. She has given me every piece of ammunition I need to get paid at this point as well as wage a discrimination suit for referencing my pregnancy as a reason for termination.\n\nI hire a lawyer. She continues to pester me about turning over all of my work, the thing is since I’m an independent contractor I only owe her a final product if I get paid. I reiterate that she isn’t getting anything until I’ve been paid and she can take it up with my lawyer. She begins slandering me to everyone I know and continuing to send emails about me that I’m just collecting. She then starts calling every friend she has to bully me into giving her what she wants. My response to all of them is, “talk to my lawyer”.\n\nIn one final ditch effort she has the consultant call me begging me to turn over the stuff, the problem is that the consultant and I are personal friends and he’s really unhappy working for her but has contractual obligations. I tell him to tell her the same thing, “talk to my lawyer”. Five minutes later I get a call back from him saying that she has fired him because he refused to throw me under the bus and make up excuses for my termination when he believes I was wrongfully terminated. She fires him too and now he’s out of his obligations. He also tells me that the lawyer she sent the contract over to said to pay me.\n\nIn a matter of two weeks she is once again at square one with no one on her side, she is out of money and struggling. She finally emails me at 11pm that she is willing to pay me. Its nighttime and I don’t work for her anymore so I decide I don’t need to respond at that moment. Well she starts calling me incessantly and texting me, all of which I’m ignoring. By the time I wake up in the morning I have 20 texts and 5 missed calls. I tell her that I will need to talk to my lawyer at this point and I’ll get back to her after he responds.\n\nWell, she goes nuclear. Twenty-minutes later I get a call from the police. She is claiming I have been embezzling campaign funds and stealing her data. I have to get my lawyer on the phone and explain the whole situation and why this is a BS claim. I offer the bank account information for the funds she claimed I stole and proved that they were sitting right there in her account she just doesn’t know how to access them because I’m usually the one who does that. The police officer thinks she is nuts at this point… because she is… but then informs her that it considered larceny to withhold my pay and asks me if I would like to press charges. I say “If she refused to pay then yes”. Within two days I received a check in the mail with my payment and I turned everything over. The funny thing is that my 30 day notice pay was actually more money than if I had finished out the contract with the reduced pay she wanted to pay me. I got an extra $700 and didn’t have to work for her for the remainder of the time.\n\nShe ended up losing her election in a swing district by 15 points.\n\nEdit: for those of you wondering I left campaigning and will never go back. If you want to hear my thought on politicians check out the link posted above. I am not proud of my job nor did I love it but a girls gotta eat and good luck finding a company to work in America for that isn’t at the very least morally questionable.\n\nEdit 2: thanks for all the upvotes and awards guys, I didn’t think it would get this much attention, I’m just tired of women being treated like they can’t be good employees and moms. On the plus side more people have upvoted this post than voted for her on Election Day.",
        "permalink": "/r/MaliciousCompliance/comments/rrh1ci/boss_fired_me_for_being_pregnant_im_the_one_who/",
        "comments": [
            "The saddest part of this story is how the candidate is clearly not qualified to hold an elected job as a window washer and still only lost by 15 points.",
            "So you're still suing her for firing you for being pregnant, right?",
            "Made my afternoon. That was juicy. Each new paragraph telling us what else was she doing, emailing or calling, I was thinking \"yeah, thx add it to the evidence pile\".\n\nJust a small tip, the black marker used to cover the names still allows you to read some names.",
            "[deleted]",
            "> losing her election in a swing district by 15 points.\n\nIn other words, she lost 42% vs 58%. Meaning even with all that toxic behavior, 42% of the electorate wanted her to represent them.",
            "This is what happens when a person who has gone through life bullying everyone and never getting stood up to, runs into someone who they have 0 leverage over and is smarter than them.  Well done.",
            "Great you got what you're owed...but this person needs to be taken down harder.\n\nBare minimum pay for your lawyer.\n\nBest case absolutely ruined",
            "After the first meltdown, I was thinking to “is it even a real campaign if the candidate hasn’t totally lost their shit on the CM over a problem of their own creation”… but then she kept goingggg! Brutal, but glad to hear it all worked out.",
            "This is one of the best malicious compliance stories I have ever been blessed with. Bless you and your family.",
            "You:   Well known rockstar of a Campaign Manager  \n\n\nHer:   Local politician who slandered you to everybody she could contact.  \n\n\n  \nI wonder who is has a future in politics?",
            "\"Well sure enough she sends him a signed copy of the contract and once again my contract is valid\" I almost can't even read further because this is so so so good",
            "My boss fired me to for being pregnant too.  I also won the lawsuit.",
            "I’m sorry all of this happened to you but this is soooooo satisfying to read.",
            "You've given enough detail in the post that someone who wanted to do a couple of hours legwork could find out who you are.  Might want to edit the post to remove some of the more specific details.",
            "Sounds like this person wasn't ready for a political career.  Not the OP, but the candidate.",
            "I wanted to address the obvious elephant in the room...\n\nso how is the newborn?",
            "Hey, I did some political consulting in college for a (non-US) political party which I absolutely detest.\n\nI desperately needed money and was assured by a former boss who knew the candidate that the candidate was a good guy despite belonging to this party—I still hated every minute of it and know I compromised my values; there's not enough showers in the world that will ever make me feel not icky about it.\n\nWhen my first daughter was born, my wife was out of a job for about two years and it was *rough*. She ended up doing freelance work for truly evil corporations, but the money paid for my daughter's diapers and food.\n\nLike you said, you've gotta eat.\n\nWe're not proud of it, but we saw no other choice at the time.\n\nLife's messy and I don't condemn people in desperate situations for making morally compromising choices.",
            "Working for politicians…. That’s a hard no for me. I’m happy you made it work for you. How’s the Baby doing?",
            "I get that you cant drop her name here, but damn i want to know who this politician is so we can really lay down some heat on her.",
            "Made my day!",
            "This screams \"I worked for a Republican\" to me",
            "What happened to your consultant friend?",
            "I’m annoyed that a woman was mistreating another woman. Good for you!!",
            ">Then we hit a snag. The candidate’s husband got deployed to a rather dangerous place for a month and she completely checked out. She stopped fundraising, which means that everything comes to a halt in campaigning. She stopped putting in the leg work to win. We also lost our only lower staff member during this time. We knew she was worried about her husband so no one on the team tried to push back very hard. Eventually her husband came back and it was go time.\n\nOkay, this right here is a sign that she's not a good candidate and would be an even worse elected official.  If that were to happen while she's in office, she'd have to suck it up and continue to perform her duties.  If she wanted that position bad enough, she would have sucked it up and kept fundraising/campaigning, thus showing she's capable of doing the job despite personal circumstances.  I mean, taking a day or two in order to compose herself is one thing, but an entire month?  Yeah, that crap wouldn't fly while in office.  People would start demanding that she resign or get removed because she wouldn't be doing her job properly.",
            "Let me guess, Republican?",
            "Hm as an independent contractor, can you still file for wrongful termination due to pregnancy though. Where I am, self-employed people won't have this right since by definition the relationship isn't one between employer and salaried employee.",
            "I'd be a little careful about admitting to reading the emails she sent. If it's the office group email you're probably fine, since you still worked for her, but if it was her personal account it might be problematic.",
            "OP should feel good that they didn't end up helping a shitty person excel further in life.",
            "You should have filled a suit against her for slander and harassment. The slander is proven in the emails, and the harassment is proven in the call logs even after you told her to speak to your lawyer. Ruin her. She really deserved it.",
            "As much as I hate this, Pregnancy is actually considered a disability under federal law.  Hopefully you kept the emails so if they run again, you can share it with the competition and really screw them",
            "I lost it at her reprimanding you for not wearing make-up (don't even get me started on the pregnancy)  - that's sexual discrimination, she would not chide a male for not wearing makeup.",
            "OP I’m in the military and we are proof positive that women can be great moms and employees.  Anyone who thinks different needs to come back from the 1940’s.",
            "Upvote for that jab in the second edit alone. That was spicy.\n\n&#x200B;\n\nCongrats on the baby, by the way. Hope you're enjoying your little one to the fullest.",
            "“30 days notice because lots of work has to be done”. \n\nI’m still surprised 1 month notice isn’t standard in the US.\n\nGlad it worked out for you though. She sounds like a right bitch!",
            "You should have sold your data to the other party, for equal measure.",
            "Why would you campaign for someone who's policies you doing believe in?",
            "Politics \n\nSo dirty",
            "Saw your original post on AW yesterday, the whole story is soooo much juicier",
            "15 points?\n\nsounds like she never had a chance in the first place.",
            "You… I like what you’re about, fam.",
            "Why the hell do people never press charges? God dammit these people need to get what they deserve!!!",
            "You are done with the campaign world now. You don't marry a candidate, they all have horrible quirks they expect you to accept. I can't think of one who didn't. This is why young people are not accepted in the field for long. I don't support it. I am just aware of it.",
            "I am not familiar with the law and the American system but can you not hurt her quite deeply with a lawsuit? In Europe, getting fired for being pregnant sounds like a nuclear that you can throw on your boss.",
            "This is literal gold. Absolutely GOLD. Idk if reddits got algorithms for posts with a lotta comments but take this one so more people can see this post. \n\nGOOOOLDDD. Literally a MOUNTAIN of gold.",
            "Wow, went to her ballotopia page......this lady just LOOKS like someone who would throw a person under the bus.  \n\nI'm normally not someone to go off of a person's appearance, but when her picture came up I got that instant Gut Feeling that this was NOT a nice person.  I kinda hate it when that gut feeling get's validation.",
            "Love this. Also I too worked in politics for a short period, you're right 99% of them are wretched people.",
            "As someone who also works in campaigning /politics, we work with some HUGE egos. It’s a lot to handle, but you handled it beautifully. And for someone who is only 24, you seem to have an extremely level head and good temperament. Especially in a stressful situation like this one. Kudos.",
            ">On the plus side more people have upvoted this post than voted for her on Election Day.\n\nThis is awesome! 👍",
            "Working your hardest to get shitty politicians whose ideas you don't even believe in elected...\n\nWhat a disgusting, very American business.",
            "Super proud of you, Boo 😘 Hope you and Baby are doing fine!",
            "Politicians are scum",
            "This person deserves a name-and-shame.",
            "Omg please tell us who this psychopath is. I don’t want to be inadvertently voting for them",
            "Where's the part where you actually sue her for firing you for being pregnant?",
            "[deleted]",
            "> On the plus side between the two post the number of upvotes is more than 1/3 of the number of people that voted for her.\n\nSnap!",
            "To be honest I really wish this candidate would be named in the post so that people in the state know who not to vote for.  Reddit could yeet you for it though, so I understand why you may have made the choice not to.",
            "I know from experience how insane it is to be going through a pregnancy and buying a house at the same time, so the fact that you went through all this, plus a freaking *car accident* to boot; you got some tenacity, that's for sure!",
            "As someone who does the campaign consulting work, I am lucky to have never had this issue, but I know people who have. You get a few types of people running for office. The narcists who are running for their own ego and power. The political pawn, the wet noodle doing the bidding of a more powerful interest (either a part leader, wealthy patron, etc)and goes along because these jobs tend to pay well, and they know they get the perks. Then there are those who get into it for the perks and benefits. You have the professional politicians, people who love the  political system and being a politician, they run for low level office when younger and keep running for new ones as they get older. Lastly you have the do-gooders, much rarer and about 50% get corrupted in office and become part of the other mentioned groups. \n\nThough I cant imagine working for someone I only agree with on 10% of issues. I have the 70% policy, that I must support in some form at least 70% of your platform. The Candidate I worked for in  2020 for example, we agreed on about 75%, and in a 6:1 district against us, beat the polls by 12 points and lost by only 32 points. I mean we knew it was a very long shot, but I am back on for 2022 and working to build on last time. 2021 I worked a different campaign, that had potential but poor fundraising and outspent by a much better funded campaign with lots more boots on the ground, and the ability to send out mailers.",
            "I'd upvote this but I'll have to talk to my lawyer first.",
            "Awful candidate, but if the CM is the only member of the campaign staff, all duties will fall to that person unless they can recruit volunteers.\n\nI've worked on political campaigns, and CM is not a job you can do from home. It's more of a 24/7 on your feet kind of job.",
            "looking at Gina, makes this even more believable. she looks like a Bitch.",
            "just out of curiosity, what was the dream job a friend of yours offered? dont have to answer of course, also, hope your 'herniated disk' (not sure what that is, sorry >.<) is okay and hope the pregnancy went/is going well! :D",
            "One friend from college was thrilled to get hired on to a campaign only to quickly discover the candidate wasn't some one he would actually vote for let alone help get elected. Sounds like you did too. Sorry.",
            "Hope you also sued for defamation. So proud of you! Hope you, your husband, and baby are all good.",
            "Wow. It sounds like a political operative is the very LAST person you would want to fire for the wrong reasons! You handled this so well, I usually melt into a puddle of goo at any kind of conflict. You should sue her too, she deserves to pay more for breaking the law and you have more than enough evidence.",
            "This might be the best thing I’ve ever read on Reddit. (I’m really sorry you went through all that, OP! But holy shit did you handle it like an absolute champion!)",
            "I'm sure you're not like her but i got sudden flashbacks to Jennifer Barkley from Parks & Rec, the only reference I have of a campaign manager lol.  \nI'm glad you & your baby is doing well now.",
            "[removed]",
            "Sounds like you are doing God’s work keeping shitty people out of office",
            "Idk how your system works, but from the comments, 15 points isnt a lot. So if the electorate or whatever she's called had of kept you, she probably would've won. Which is outstanding considering you didn't really do much (or did you? cant really tell from this post.)",
            "Like for the compliance, WTF for the \"I love my job of helping people of questionable character take public offices.\"...",
            "Need to cross post to r/prorevenge",
            "Oof.",
            "This…this is incredible. You are a saint",
            "This post reminded me of a strange discovery at a former employer.  They used one of those massive A3 flip sheets for notes and things and never removed it from the meeting room that doubles as a break room on occasion.  Well we flipped through the old notes and one was \"number of pregnancies\".  This was a low paid, high turnover establishment that was mainly staffed but women.  The problem was they had so many staff pregnant at once, some couldn't continued in their nominal positions due to the chemicals used so needed alternative position to work at full pay until maternity leave as week a a temp to fill their position and then once on maternity leave they needed cover and keeping full-time staff more than 3-6 months was a challenge let alone agency staff which they were loath to use because it cost them so much more.",
            "[removed]",
            "I stopped reading after the whole “only 10% of my views aligned with the campaign.”\n\nThat’s one of the great evils IMO. Willing to sacrifice the people who’s real lives will be impacted by this politician just because it’s “a job.” \n\nMoney. Power. A resume builder. Shame.",
            "Unrelated to the post but could you be fired if to are no longer capable of completing the requirements of your job due to outside circumstances of the job?\n\nTo give an example, if I was in a job that required heavy lifting (let's say 50lbs objects consistently throughout the day) and I either become pregnant or to make this a unisex issue, get in a car accident and get a back injury, could I be fired due to no longer being able to do my job (assuming said car accident or boinking happened off the clock)",
            "Man, am I glad I read the whole story. That was awesome! It just warms the cockles of my heart, reading a story about someone getting exactly what they deserve. Delicious malicious",
            "EVERYONE quit huh? Suuuure…",
            "[removed]",
            "Wait, what about the baby??  *When did this happen??*",
            "On one hand, this gives me a justice boner. On the other hand, lmao that antiwork sub. Still, hope the suit is settled out of court nicely in your favor. You deserve more than just that 30 day cut.",
            "I call BS because I couldn't find any elections that supports your claims.  (Ignore the fact that I didn't even try looking please, because I'm a bit on the lazy side.)\n\nSo you need to tell me which election she was in (and lost). 😁\n\nOh and congrats on your baby.",
            "TLDR",
            "I wonder why you would work to make this person win an election, when everything you see about her is wrong. This makes you part of the problem, part why the democracy in the US is failing tbh.\n\nEdit: Sure, downvote the truth. Go ahead. That's why your nation is failing.",
            "How do you reconcile helping a person with whom you don't align with, get elected ?   I could never do that, even for obscene amounts of money.",
            "Bravo a true Comrade !!!!!!!!",
            "Please post this on r/antiwork",
            "You got a call from the police claiming you were embezzling... you sure? Elaborate on the process you went through with this accusation.",
            "Thank you Hilary Clinton",
            "TL, started falling asleep",
            "Thank god I looked at how long this was before I started reading… no tldr. That’s crazy no way",
            "I was following until you said your views didn’t line up with the campaign. Fuck you.",
            "/r/NuclearRevenge worthy?",
            "Helluva story! Thanks for sharing it with us!",
            "Everything about this is nuts. But from working on campaigns, her refusal to canvas is just...clearly you don’t want to win lady. Glad she wasn’t elected.",
            "I’m fuming on your behalf, and thank you for sharing.",
            "Well played.",
            "You seem like a very interesting person, which makes me wonder what your dream job is!",
            "As someone who has worked in political campaigns, this sounds all too familiar.",
            "Finally, a story from an industry I’ve worked in! Hm, I don’t think I will go back to a career in campaigns.",
            "So like, let’s assume no professional bullshit happened and the campaign went smoothly.. since your political inclinations don’t match up to the candidate, would you have personally voted against her?  Or would you have voted for her to mitigate conflicts of interest?\n\nI never imagined that a candidate’s campaign staff would have people that are not of the same political inclination as their candidate.",
            "Imagining OP as Wendy from Ozarks.",
            "Pleeeeassse share her name with us",
            "The candidate is on Facebook with a page where she's apparently running in January...",
            "Great Story! This was an awesome read in the morning!",
            "How could someone work so hard to help some get in office that so clearly dosent belong there? This country is fucked.",
            "Eddie: don’t forget to vote",
            "Do you do private work for projects still?",
            "\"Good luck finding a company in America to work for, that isn't at least morally questionable\" \n\nThe same but double for American politicians!"
        ]
    },
    {
        "post_id": "c0ic93",
        "author": "cyberphobia_au",
        "title": "I can find the email address on the website... ok, if you say so.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/c0ic93/i_can_find_the_email_address_on_the_website_ok_if/",
        "score": 17428,
        "num_comments": 474,
        "created_utc": 1560506711.0,
        "selftext": "This is without a doubt the best outcome possible from a bit of Malicious Compliance I could have achieved. I was only aiming to support my wife's good deed, but this paid me great dividends. This is a bit detailed as it covers a long span of backstory with a very rapid response once the malicious compliance was engaged in. A TLDR is attached at the bottom.\n\n**The backstory**\n\nI've had a shoulder injury for over a decade, when it occurred I had an MRI and was told the cartilage was fractured and tendon torn, whilst healthcare is free in my part of the world the lack of income while I would be healing prevented me from doing anything till 2017 when I figured I had a well-paying job and plenty of sick leave available. So, I started the ball rolling on getting it fixed, I was initially put through physio to try and fix the problem (or at least strengthen the shoulder). I completed the physio and as expected the shoulder was still an issue (albeit stronger now). Forward to the start of 2018 and I had an MRI, I was told I'd hear from them in a few weeks to have a review....\n\n...\n\n...\n\n6 months later after extensive nagging from my wife I finally called the hospital to see what was happening. Nothing like being told that the case had been closed. After a few firm but polite words my case was returned to the waiting list. Wife was happy, I was content to be back on the list (although rather confused that I'd been removed)..\n\nSo, I waited...\n\nand waited...\n\nand waited...\n\n**The Setup**\n\nMy wife is a loving woman and I'm damn lucky to have her. After her nagging for me to chase it up falling on deaf ears (although this is also because my work hours make me unable to contact the hospital during their office hours) this tremendous woman decided to sort it out for me and find out what was happening, i.e. am I still on the waiting list? After all it was now almost 18 months since the MRI had been taken.\n\nMy wife contacted the hospital and after being transferred a few times was connected to the right department, unfortunately she got stuck with an absolute Karen. The first response from Karen after hearing from my wife was to tell her she's not authorised to discuss the case with her (I've made it very clear in the past that my wife is authorised to act on my behalf, I could only assume later that this may have been due to the reactivation of my status via phone). My wife tried convincing her that she didn't require any details, all she wanted was for Karen to confirm if I was still on the waiting list. Karen however wouldn't give up so easily and continued to block my wife's request. Could Karen call me to inform me of my status, No, blocked. Could Karen email me, blocked. As you could imagine my wife was getting a little frustrated by now. Finally, Karen did something useful, since she wasn't going to contact me, I could contact her. My wife reminder her that calling during office hours wasn't possible. Karen countered stating that's ok he can email us...\n\nWife: Thanks Karen, what's the email address? There isn't any on our paperwork.\n\nKaren: That's ok, it's on the website.\n\nWife: I have a paper and pen could you tell me the email address.\n\nKaren: It's on the website, you'll find it there.\n\nWife: Whereabouts on the website?\n\nKaren: You'll find it on the website.\n\nWife: I understand you're telling me it's on the website, what I'm asking is where on the website is it? What should I be looking for?\n\nKaren: I told you, it's on the website.\n\nAt this point my wife was frustrated and tired from trying to jump through Karen's hoops. She thanked Karen for her time and finished the call. Frustrated my wife contacted the local member of parliament for advice on how to resolve the situation.\n\nDuring my evening drive I was listening to my frustrated, annoyed wife. She regaled me with the pointless call to the hospital and then her markedly better call with the local MP (member of parliament). I felt anger and annoyance. My wife had tried doing something lovely and had copped poor treatment from the hospital. My told me when I got home I was going to write an email to the Minister of health as that was the MP's recommendation... after a moment's thought I told my wife no.\n\n**The Malicious Compliance**\n\nI arrived home and told my wife that I was thankful for her time and effort, but it was alright I would take care of the situation now and I'm sorry that she'd had such a hard time that day.\n\nI opened my laptop and downloaded a program. This program is designed for marketing, it will scour through a website and pull any contact details (email address, name, title, contact numbers, etc) and compile them for people to then cold-call employees of a company.\n\nI typed up an email; detailing my case, history, being dropped off and returned to the waiting list, my concerns about the validity of an 18 month old MRI for surgeons and the supportive albeit succinct advice from Karen (I identified her department and name dropped her a few times in the email).\n\nReturning to my email spider program I found a healthy 768 email addresses. :-)\n\nAfter some thoughtful reflection I removed any email address that didn't belong to the hospital, leaving me with a still rather healthy 300+ email addresses. Copy, Paste into the To field. Then to continue to up my game I CC'ed in the department for the minister of health, the minister of health, shadow department for the minister of health, shadow minister of health and then the local MP.\n\nI returned to my email and thanked the MP for their assistance, emphasising how thankful I am as we are in the middle of an election (It's amazing how helpful politicians are around election time).\n\nI re-read the email one more time to make sure I had captured everything I had wanted... hmm, it needed just one more item to highlight the importance of the email.\n\n*\"I would like to thank Karen from Support Liaison for the limited support she was able to offer my wife despite her not being apparently authorised. I would also like to thank Karen for her clearly perfunctory instructions that the email address I needed to contact was on the Hospital website, albeit with no additional information as to the location of the email address I had to do some searching. Having followed Karen’s instructions I had found this email on the Hospital website. Admittedly it is only one of the 319 @hospital email addresses I found, I’ve presumed one of the remaining 768 email address not belonging to @hospital is not the one I am after (although I’ll assume no response from this email as an indication perhaps it is, or perhaps I should be trying the other Hospital sub-domains and associated websites?). If for some reason Karen’s instructions have resulted in this being inadvertently sent to the wrong email address please forward this to the correct department or Karen from Support Liaison (I’m sure with her cursory instructions she’ll be able to direct this appropriately). \"*\n\nWith that little extra added I smiled and hit send.\n\n\\*\\*As an amusing aside, I found over 3000+ email addresses when I included the sub-domains (I should point out that the Hospital is a large group of hospitals covering a large region)\n\n**The Outcome**\n\n***Week 1***\n\nThe following day I returned to work, in my lunch break I did my usual catch-up on emails. Except I noticed I had a few calls too.\n\n9:11 - Missed Call\n\n9:18 - Missed Call\n\n9:25 - Email 1\n\nDear cyberphobia\\_au,\n\nThanks for you feedback and I just wanted to update you and let you know that I have spoken to your spouse and given her the following information at this point.\n\n&#x200B;\n\n* I have logged your complaint and sent it to the Head of Unit for Ortho and Referral Management for investigation and response.\n* I can confirm that you are on the Orthopaedic waitlist and have been since the 27.4.18.\n* I have put a comment on our database under her details as emergency contact that states “*All information about appointments can be given to Mrs cyberphobia\\_au as per      direct permission from Mr cyberphobia\\_au.”*\n* I will follow up and escalate the complaint about lack of support given to your spouse by the Patient Relations Coordinator she spoke to.\n* I will keep your spouse and  you updated on the outcome of the Orthopaedics appointment as soon as I am advised.\n\nI have a couple of questions I just need to ask you in relation to your concerns raised.\n\n&#x200B;\n\n* Do you wish to have any response or outcome from Hospital about this complaint relayed to the office of Hon. Local MP?\n* May I please have your permission to put your email address on our database?\n\nPlease feel free to contact me if you wish to discuss anything further.\n\nRegards,\n\nNot\\_Karen\n\n11:23 - Missed Call (an appointment has been booked)\n\n1:16 - Email 2 - Appointment Details\n\n*\\*\\* I received an additional 38 automated email responses and another 5 responses from various individuals/departments wishing to contact me.\\*\\**\n\nI responded to the email from the Not\\_Karen and stated that I did not believe the details needed to be relayed to the MP at this point in time.\n\n***Week 2***\n\nI attended my orthopaedic appointment. The expected 2-3 hour waiting room experience was a brief 30 minutes to see the surgeon.\n\nAs expected surgery was the outcome.\n\nI make my way to the desk to provide my details to be put on the surgical waitlist. The nurse behind the counter makes a quip about it being a priority.... *that's strange? I'm not in urgent need for this, I've lived with it for the last decade.*\n\nI get told I should have some details sent out to me in the next week or so detailing my priority.\n\n**Week 3**\n\nI receive a call about my availability (standard sort of stuff), can I attend same day if they have a late cancellation (I need a few days at least to ensure transition for my work) .\n\nOn the Friday I receive some paperwork detailing that I am a priority 2 and should expect the surgery to occur sometime in the next 9 months.\n\n**Week 4**\n\nMonday morning, 9:20 - Missed calls\n\n9:30 - Message from my wife - Call me\n\nI call her during my lunch break, as she answers the phone I ask her 'So when is my surgery?'\n\n**Week 5**\n\nThursday morning, I get stabbed, jabbed and arthroscoped. Kept in for observations and then released today on Friday. Only to come home and submit my first reddit post (typing this one handed has been a challenge)\n\n*\\*\\* My wife received a call checking up on things and to inform her that Karen has undertaken a review of procedure and if my wife would like a formal apology from Karen... Whilst my wife was frustrated by her actions an apology wasn't needed, knowing she had been updated on how to handle things so others wouldn't face a similar situation was enough for us both... not to mention my exceedingly short turn around for surgery.*\n\nTLDR; So, because I am defensive and supportive of my wife and she was told for me to email the address on the hospital website. I indulged in a little bit of malicious compliance and emailed 300+ email addresses from the website with a clear indication of sending it to a few thousand if I received no response. I not only found out I was on the waitlist, but I was seen to, I was seen to in record time.\n\n&#x200B;\n\n&#x200B;\n\n**EDIT -**\n\nA huge thank you for the upvotes and awards.\n\nDue to popular demand and to save people trawling through the comments;\n\nThe program I used to secure the email address was '*Atomic Email Hunter*', there are others like it out there too.\n\nI am also based in Australia, despite the similarities to UK and Canadian healthcare.\n\nFor those who think Karen was let off easily I doubt the multitude of people who she works for/with who received this email would be thinking the same.\n\nAs an amusing/concerning side note the most interesting response I got from this was the Sexual Assault and Family Violence Counselling service. It took them 2 days before they responded, sure my email had nothing to do with that, but if it had a 2 day delay is a bit sad.",
        "permalink": "/r/MaliciousCompliance/comments/c0ic93/i_can_find_the_email_address_on_the_website_ok_if/",
        "comments": [
            "My mom does medical billing for a pediatrics practice and started hearing that no one was receiving invoices. For MONTHS. The bills just weren't showing up; she suddenly had an entire practice with all delinquent patients and no money coming in to pay the doctors. She called the company they pay to generate/send invoices and the woman on the line *refused* to confirm they were actually sending them. She also refused to escalate or give any other contact info, and just stopped replying to my mom. \n\nAfter this had gone on for almost a year, I was on the phone with my mom and she was at her wits' end. I asked for some of the company details and started looking around. After just a few minutes of searching, I found the emails for the CEO, CIO, and CFO. My mom copied them on the entire email chain, including the many messages she'd simply received zero response to. Her problem was resolved almost immediately.",
            "What a read, definitely worth it! Nice lesson in customer service for Karen I’d wager",
            "what's the program for e-mail scraping?",
            "Well done you, bravo, I wish I had known this when I was getting the run around for three years with my gall bladder problems, a couple of hundred emails might have shortened my misery and pain.",
            "[removed]",
            "[deleted]",
            "Brilliant.\nIs it Tasmanian? It honestly sounds like our healthcare.",
            "\\*cackles evilly\\* Well done!",
            "I would love to have been a fly on the wall when karen got her \"training\". I bet she had a lovley time.",
            ">shadow department for the minister of health, shadow minister of health\n\nBrilliant move.",
            "Fantastic bit of MC my good sir!",
            "I love blasting companies online when they drag their feet. Bought a house last year and the heat stopped working in October. My house got down to 40 degrees in the month and half that the warranty company kept saying “Yes yes tomorrow... tomorrow...” I posted detailed reviews on every single review website on the first two Google search results pages, plus Facebook, Google Maps, and Yelp. I had 5 different people reply within 24 hours and one replied within 20 minutes on Facebook.  \n\nMy heat was working within 3 days.",
            "[deleted]",
            "[deleted]",
            "Spamming the email list can be a very effective method when you don't get answers and you feel ignored. Same as leaving a comment on a business facebook page. Just make sure to not make it your default solution and keep it for extreme cases.\n\nI was first introduced to this at a previous job. Our software was on a SAAS basis and clients needed to connect to our portal to do any work on it. One morning we started getting angry calls because nobody could access our website because of a security warning. I don't remember who exactly but a security company had somehow blacklisted our adress as being dangerous. After spending half a day trying to talk to someone without any success my boss said fuck it, grabbed every single email adress from their adress book and emailed them a message detailing the situation, listing all our Fortune 500 and Fortune 100 clients and explaining that we were currently telling all of our customers that the reason they couldn't access their expensive software was because of said security company's screw up. We got a callback within 20 minutes.",
            "Congratulations.  Here in the US, I have to fill out a form every year stating that my wife has permission to access my health records and talk to my doctors.  My big problem is the Mail only Pharmacy that can't seem to remember that I have a prescription.  Fortunately my Wife is a Pharmacist and can educate them on the correct procedures.\n\n&#x200B;\n\nI hope your shoulder works out well. Sounds like you have the perfect Wife.",
            "I’m happy you were able to receive the care you need, but as someone who works in insurance, this made me really nervous. I of course didn’t have the same phone call your wife did, so maybe Karen was maliciously unhelpful. However, if your wife wasn’t authorized, I don’t know how you expected Karen to give out info. I’ve had hundreds of calls with Karens of my own that always go the same. \n\n“I want to know about my daughter’s insurance”\n\n“Well your daughter is 26 and we can’t release that information”\n\n“I don’t want information! I just want to know that she’s enrolled, which plan it is, did she pay her bill, which doctor is she seeing, is she receiving treatment...”\n\nYou do understand that confirming if you’re on the waitlist for a specific doctor who treats specific ailments **is** releasing private health information, right? Everyone always wants us to release private health information to anyone and everyone at the drop of a hat, but if ever we did release that information to someone you didn’t want us to, it’d be our necks on the line. \n\nNow as far as the email - I’m guessing Karen actually didn’t know who to contact. Maybe she was new, maybe she didn’t know her job, or maybe she’s not permitted to give that specific detail out to non-patient, non-authorized third parties. \n\nHowever it was scummy that your case was dropped and delayed several times. Again, I’m happy you got your treatment. Also please don’t barrage me with hate, I’m just trying to offer a different perspective. I’m happy to answer questions.",
            "I hope someone gives you Gold for this. Truly malicious in your compliance",
            "I did not receive OP's email. However, I am aware of it.\n\nI know that lots of these stories posted are pure works of fiction. He may be exaggerating details, as I said, I don't have this first-hand.\n\nBut, the crux of this (a frustrated patient emailed hundreds of hospital email accounts) is true. I hadn't heard of it being Cc'd to the health minister, though.",
            "The sad thing about this is, clearly Karen was in a position to know exactly how to help. I am a nurse, and despite the time pressures I have everyday, answering calls that come through to the ward is something that needs to be done quite often. Sure... A lot of stuff I can't help with, but it's not hard to help with what you can.\n\nWe have some Karen's at work who transfer people to our ward who have access to the same systems we do, so know the same stuff I can find out also, despite this we have people trying to track down loved ones and end up on our phones telling me I'm the third person to tell them their loved ones aren't there. It might take me 5 minutes to find someone or find out something, but that 5 minutes is nothing for the people on the other end of the line trying to find out even where their loved ones are at the least. We even have people sent to our ward from the main reception... Our ward isn't exactly easy to find.\n\nIt's depressing how many Karen's there are, when the smallest bit of time and effort can make someone's day exponentially less stressful than it is to be given the run around.\n\n/rant\n\nI am glad you ended up with a positive outcome, however delayed it all was. Props to both you and your wife for staying calm and collect to make some people get their shit together.",
            "What a bitch just saying the email is on the website, like what’s the problem with Karen withholding the correct email for your wife, it literally doesn’t affect Karen in any negative way so why was she so stuck up about it? Seems like she was too proud to admit defeat, bitch.",
            "Has anyone else been through so much administrative abuse that they got ~~a hard on~~ excited reading this?\n\nScrew your daddy fetish, I just want to see the world's Karen's squirm",
            "Evil and effective. Nicely done.\n\nWishing you a speedy recovery.",
            "That was pretty bad ass! Glad things resolved in your favor and quickly.  Why can't folks just follow the Golden Rule. Life would be much simpler.",
            "So glad you posted this. Hero status MC.",
            "This is my favourite Malicious Compliance yet. I hope you heal well, principally do you can hug and high five your wonderful wife with gusto.",
            "I've been on that same orthopedic wait list for 18months. I have severe osteoarthritis but I'm a cat 3. I still haven't had so much as an email in that time to say if I'm even still on the list.",
            "Anyone with knowledge of both legal systems is contacting your MP equivalent to contacting the mayor? Or is it contacting your senator or representative?",
            "I've done something similar. \n\nOnce I received an email that had hundreds of recipients all in the \"To: \" line. I wrote a very direct complaint about how irresponsible it was to use the To: line for sending all the messages, how everybody on the list was now vulnerable to email fishing, and if anybody on the list had a virus, how it exposed everybody to said virus, etc. \n\nI hit \"Reply - All\" on that message. I chuckled to myself as, for days, I received all kinds of noise from angry people about how their address was stolen, and even a few were mad at me for including them. \n\nHA HA HA",
            "...absolutely awesome.\n\n..could have insisted on the apology, but as like as not wouldn't have been sincere, but would love to have her supervisor tell Karen 'no apology requested as recipient wouldn't believe you anyway'",
            "She should have made her apologize. Not because she needed it, but because being forced to actually talk to the person she affected may stick with her more.",
            "It's a good thing Karen wasn't fired. She's going to be the best customer service representative ever",
            "[deleted]",
            "[Squeaky wheel gets the kick!](https://www.youtube.com/watch?v=LN1SXkfOAyU)\n\nthis is why IT skills are like weapons of mass destruction. and why hospitals need to be carefull with their customer-facing information.",
            "> As an amusing/concerning side note the most interesting response I got from this was the Sexual Assault and Family Violence Counselling service. It took them 2 days before they responded, sure my email had nothing to do with that, but if it had a 2 day delay is a bit sad.\n\nDon't worry. They'll have read your email and chucked it on the back burner as it wasn't important or indeed anything to do with them. It's a good sign that their priorities are in the right place.",
            "You should be so glad some numpty didn’t hit reply all.",
            "What a devious way to handle a Karen. I hope your recovery is going well!",
            "Well done. You handled that very well. What program did you use to get those email addresses? That last paragraph was the icing on the cake, and so was CCIng the government officials into the email. I'm sure a few hospital higher ups went, \"Oh shit!\", and phone calls were made.",
            "\"Thursday morning, I get stabbed\" - JFC, how long before you get a doctor's appointment for that? Did someone at the hospital decide to take matters into their own hands? Did Karen pull a Harding on you (Tanya Harding from back in the 90's)?  \n*Reads rest of paragraph*... Oh, well, that's good...",
            "Wow. I love this post! It's the best malicious compliance I've heard of! Take my upvote and my respect. I am currently dealing with a knee issue, I dislocated it and who knows what else. I certainly don't. I'm waiting for the MRI appointment. It's in 6 months from now. I damaged the knee 3 months ago and I'm still waiting to get the stupid MRI so the doctor can tell me what happened to it. And then treat it, which I assume will take forever for it to happen. I can barely walk. The family doctor told me \"we take this sort of injury very seriously\". It certainly doesn't feel like that to me! Good luck with your recovery. I hope you'll update us as to how it goes. I feel invested in this development for some reason.",
            "For the other several hundred people its he said she said and it's far more likely that they see you as the entitled patient demanding preferential treatment and management caving because you made a large enough stink.\n\nI'm not saying you are, but that will be the perception of most everyone else you mailed.",
            "9 month surgery wait...",
            "I enjoyed this post a lot. Thanks for sharing your story OP.",
            "Holy shit how does it take over 18 months to get an appointment after your MRI?",
            "Officially one of my favourite MC posts ever! What a fantastic read.. thank you for this and good luck with the surgery!",
            "Surgery booked for December after 38 week wait. \n\nCall from Karen, it’s cancelled, no new date\n\nJanuary, called Karen, not on list, she will call me. \n\nCalled again Mid January, sorry, dr is off sick, he is now 4 months before your operation (booked and arranged work cover over the 6 weeks I’ll be off over December already missed that one)\n\nNeed to sort cover for work. \n\n3 days later, called PALS\n\nAn hour later got new surgeon appointment from private hospital. \n\n2 days later, see new guy. \n\n3 days later have operation. \n\nLesson?\n\nGet fucked about.  Call up patient advocate lesion service. Get it sorted quickly with no effort.  \n\nFeb, get call from Karen, huge apology and written apology. \n\nNo, I’m not gunna go to ambulance chasing lawyer.",
            "As a wife, I'm like IF YOU HAD JUST HANDLED IT IN THE FIRST PLACE, but yeah.  Good MC :D . (and get your wife a cupcake or some shit.)",
            "OMG, I LOVE YOU! hahahahahaha! This...this is beyond epic. As someone who worked in healthcare for years and had to go to similar measures against insurance companies, I never reached this level and you are now my newest hero!",
            "I once did something similar, though not nearly as impressive as yours.\n\n&#x200B;\n\nI, daily, would review a bunch of news articles on an australian IT news website.  \n\n&#x200B;\n\nI'd control click the links in the emails I received, and open a new tab with the article I was interested in reading.\n\n&#x200B;\n\nI did this for years, before the website broke.  Each new tab would do a redirect to some page asking if I wanted to sign up to the newsletter.  The redirect was such that the back button didn't work either.  So, 20-30 tabs of 'sign up to our newsletter'.  Pretty useless.\n\n&#x200B;\n\nAfter a few weeks of this, no longer being able to read my articles, I figured I had to do something.\n\n&#x200B;\n\nI looked through their website trying to figure out how to get in touch with SOMEONE who might be able to fix the issue.  \n\n&#x200B;\n\nI figured out pretty quickly that their email format was [firstname@domainname.com.au](mailto:firstname@domain.com.au)\n\n&#x200B;\n\nI knew the name of the chief editor of the publication (Mark, from memory), so I emailed [mark@domainname.com.au](mailto:mark@domainname.com.au), and cc'd [owner@domainname.com.au](mailto:owner@domainname.com.au) and amazingly the issue was fixed the next day.\n\n&#x200B;\n\nIt's incredible how quickly things get fixed when you email the people who actually have power to make changes.\n\n&#x200B;\n\nGreat story, if this is what you can do one-handed, I can't wait to see what you can do with both arms.",
            "Lol so passive aggressive but effective",
            "At least something good came out of the disastrous re election of scomo.",
            "After having issues with my apartment complex and no one replying to emails, I went to the company we site, found the head people’s email address, and emailed about 5 people and what do you know, after 5 months they finally fixed the issue and credited my account all the money they tried to steal😀",
            "Just to have a complete picture, please tell us how much money you spent on this whole thing?",
            "So that's what free medical care is like, huh",
            "In America, it might cost money, but you’ll never get turned down for a procedure you need just because “it’s not important enough.” Your case is the perfect reason why socialized health care is absolutely terrible",
            "[deleted]",
            "Cant find time to make a phone call at work. \n\nCan find time to sort through dozens of emails.",
            "I wish we had a system like that here in the US... best we can do is call back over and over and bitch until they either block us, or do something... or ignore us forever :(",
            "That's some tasty compliance. Sounds UK based to me, a lot of Karen's in UK healthcare, of course there are a lot of fantastic not_Karen's as well",
            "What province are you in? My dad’s in a similar pickle with Comp and stupid surgeons",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/platinumuserclub] [This is what got me here. My first post too.](https://www.reddit.com/r/PlatinumUserClub/comments/c0k1r6/this_is_what_got_me_here_my_first_post_too/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "genius idea, and well played!",
            "Worth the read. Nicely done.",
            "I hope you have as speedy a recovery as you did in your last go-around for surgery scheduling.\n\nYou have a wonderful wife.\n\nGood health to you!",
            "Wholesome malice",
            "Nice work. I was hoping for more of a comeuppance for Karen, though.",
            "Can you tell us the name of the program you used to get the contact info?",
            "When she said it was on the website I thought you were going to wind up email the C.E.O or President of the hospital something like that, but you sir are brilliant.",
            "Brilliant job!",
            "\\*slow clap\\*  \n\n\nHoly shitballs, that's such a perfect reaction and perfect outcome! Congrats on it all! \n\nHope you're feeling better!",
            "Your wife truly is amazing. It’s great to know that she was willing to go through that ordeal just for your sake. Upvote for you sir",
            "As much as I love the NHS, sometimes shit like this is unbearable, why is it that all the Karen's of Britain want to work in the NHS rather than people who want to help people?",
            "This was a great read",
            "That was looong but oh so satisfying, totally worth the read. You have an awesome wife!",
            "This reminds me of when I tore the ligaments connecting my clavicle, and in my elbow. Went to the er and waited for hours, got a $4,000 mri, and was told the surgery would be around $30,000. The doc also said it would probably heal on its own in about a year, so I went with that. It took about 3 years to heal, although my clavicle still isn't attached.",
            "Great MC. I do have a question though; if you hadn't been priority, how long would you expect it to be from being scheduled to having the surgery? Priority 2 being within 9 months sounds like quite a while",
            "Malicious compliance with a thermo nuclear warhead.",
            "What program did you use to scour for emails addresses and contact info?",
            "This is by far one of the best malicious compliance posts I’ve ever read.",
            "Nicely played! It sounds like the Karen was trying to keep in line with the confidentiality policy but there was absolutely no reason for her to be rude.\n\nManners cost nothing so she have used them. Good on you OP.",
            "What a great yarn this was, im loving this Sub",
            "This is truly beautiful! Hope you have a smooth recover OP.",
            "Haha reminds me of myself. What program did you use?",
            "When executive email carpet bombs work, they work really well.",
            "Wow. This was so close to home I thought you were a family member switching details around for anonymity's sake.  \n\n\nI think it's oddly comforting that there is (free) healthcare systems out there just as useless as the UK's. Sometimes it's such an uphill battle just to keep things moving along it can feel like a difficult and lonely journey (despite having difficulties with multiple areas of our system, both personally, and with family and close friends).",
            "Im surprised the Emails went through, the email server firewall should have noticed the spam from one email address to hundreds on the email server and blocked them.",
            "I know the feeling mate.\nI waited 10 months for a plate to be removed from my leg.\nWhen I rang the hospital I was told I'd been put at the bottom of the list as they didn't see me as a priority after explaining the direstraights I was In from being out of work for 10 months they scheduled me in for the week after I'd called!",
            "I am also Australian and depending on what state you're in you may have emailed my father in law about this.",
            "This has to be the NHS right? I recently had a similar experience with them. As soon as I mentioned that one of their staff had broken my confidentiality (screamed my very private medical info at me in a full waiting room) I was treated so much faster and more efficiently.",
            "I'm going to keep this in mind the next time I get the runaround from customer service.",
            "That is awesome, though you are lucky your email wasn't flagged as spam.",
            "I hope this one makes the best of 2019 list.\n\nThis is so damn satisfying.  I bet Karen got so many lectures!  \n\nYour email was a delight to read.",
            "If I could give awards I would definitely pile on.  This is awesome, well worth the read.",
            "Most definitely worth the read.",
            "Well written",
            "Good job on cutting through Karen's uselessness & general bureaucratic nonsense. \n\nAnd if no one warned you, your post-op physical therapy exercises are going to hurt. Suck it up and do them anyway. Frozen shoulders are way worse.",
            "I’m a little late to the party, but what software did you use?",
            "Mate, this is fantastic. Awesome use of resources",
            "haha i am SO glad you got your surgery! well done i hope you heal quickly and well",
            "Very similar to how I had to follow the instructions from Western Digital to acquire my $50 rebate on a $500 hard drive bought. I actually ended up getting $150 IN 3 checks.",
            "Do all Commonwealth nations have similar healthcare systems?",
            "Zzz...",
            "> after a moment's thought I told my wife no. \n\nOh, I can see where this is going!",
            "As soon as I started reading week 5, I thought Karen came back for revenge.",
            "That was awesome. I need to remember.",
            "Queensland or NSW Health?",
            "Oh man this gave me great joy considering the ridiculous hoops my family has had to jump through for my chronically ill and physically disabled mother. So much bullshit. I'm glad to see someone actually got something good out of Big Pharma lmao",
            "That was quite a journey. Hope you’re doing better now with your shoulder",
            "I swear Minister Hunt probably has blank checks in his office. Good work getting him involved!",
            "BAHAHAHAHAHAHAAA! \nI think your compliance was AMAZE BALLS! This has made my day however I'm so sorry for the shitty process that got you to surgery. God Bless our Aussie Medical system hey!?",
            "Good work!\n\nOn the last bit - to be fair, if you emailed the \" Sexual Assault and Family Violence Counselling service\", then you're not a priority, and they can't waste time typing a reply to you immediately, heh. On the other hand, it doesn't sound like they're an emergency team either, as counselling is usually booked in advance.",
            "Sending an email to 300+ emails usually gets marked as spam these days.",
            "New Northern Beaches hospital in Sydney?",
            "Brilliant.",
            "Lmao I strive to be this petty, that's fucking dedication bravo my good sir",
            "New  \nAl",
            "Well done mate! Hopefully she won't be doing that any more to the rest of us!",
            " Brilliant, absolutely brilliant!",
            "Silly question but why did not_karen ask to put your email address on their site?",
            "I'm curious what program you used.",
            "MWAHAHAHAHAHAHAHAHAHAHAH! Beautiful!",
            "Curious, What was the subject heading of your initial email?",
            "I hope someday I meet a woman that would be willing to rather literally make a Federal case out of something (as we say in the USA) for my health. :)",
            "Funny, could tell it's Australia just by the way Karen said it's on the website (and the free healthcare)\n\nFor some reason we have some real horrible entitled people here...\n\n(Assuming I'm correct because your name ends in au btw)",
            "I love this. Please enjoy all the upvotes.",
            "Your wife's the real Karen here. The hospital worker was protecting your privacy and would probably have broken some laws by giving medical information about you. And yes, even confirming if a patient has an appointment is giving medical information about a person.\n\nAnd you have got your priorities backwards. Just putting half the effort you put in the email into calling the hospital and getting an appointment would have resulted in the same outcome without wasting dozens of hospital staffs precious time.  And on top of that you're complaining about a slow reaction from a health care service you had absofuckinglutely no use for emailing. Maybe you're part of the problem? You are taking time away from people who might actually need help.",
            "She could have been better about helping your wife find the correct contact info but HIPAA violations are no joke.  You can get in so much trouble for giving out seemingly innocuous information about patients,  even to a spouse.",
            "Ya know, it's all well and good that you finally got the treatment you needed and Karen got to eat it a little bit,  but it's a huge fookin shame that an average person would be so neglected in receiving medical treatment.",
            "I would like to upvote for my spouse. Can I find the upvote somewhere..... on the website?",
            "Your wait time and removal from waiting list sounds far too similar to my own experience recently. Even including my own Karen who repeatedly lost my case notes. I didn't send my complaint to as many people as you did, but it definitely had a few recipients. Glad you got your surgery in good time! Speedy recovery, OP.",
            "Wait Karen wasn't immediately fired and forced to do an apology either way, and your wife was happy with both parts of that (of course she got training, and some sort of slap on the wrist)?  \nThe fuck, it's so weird here...",
            "Wow that's a wild one!\n\nI don't know how things work in other countries, which nearly sounds similar, but in the US we have HIPAA, which prevents staff from disclosing any amount of personal health information to anyone that isn't the client and/or been given permission by the client. And the rules are very strict, with grounds of termination by offense. Although her total lack of cooperation was really absurd! This was well deserved!\n\nI work in Behavioral health and we go out of our way to work with the family within the limits of HIPAA, but we know sometimes we're going to have to frustrate people because of this.",
            "The true secret weapon of the customer is the ability to email some asshole's supervisor, and that person's supervisor, and that person's supervisor.  I have an expectation that anyone who is hired to do a job has an implicit responsibility to do that job right, and that means working to satisfy the customer's service requirement within the scope of your position.  It does not mean following a process flow to the end of that flow and abandoning the customer regardless of whether or not the process satisfied their request.  Unfortunately, far too many entitled pieces of shit look at their jobs as doing only what is required by their employer, instead of doing what is required of the task, and so you end up with people completely unwilling to help people because of a policy they can use against customers that allows them to sidestep actually doing work.\n\nI had a similar problem.  I got into a not-at-fault accident.  Police came, filed the report, told me it would be available on their website the next day.  Called my insurance company, filed a claim, and was told I would be contacted within 72 hours.\n\nSeventy-two hours pass, no response.  So I called my agent, who said she had yet to receive the police report (which is provided to them by some service they pay for and not an explicit task that a claims agent does, according to her), and that the other person in the accident had told their insurance a story contrary to the police report.  I inform my agent the police report is available on the county sheriff's website and give her the information, she said she'd pull the report and follow up with me the next day.\n\nOne day passes, no phone call.  Next day passes, no phone call.  My car doesn't run, and my insurance is supposed to cover a rental, so this is now a problem.\n\nI call back the agent, who gives me the same exact story despite earlier telling me she can pull the report from an official source.  So I decide to escalate the issue.\n\nI downloaded the accident report, attached it as an email, and sent it to her, her direct manager, and the regional manager for the insurance company.  I explain firmly that unless I am immediately provided with the service I pay them for; which is to insure my automobile, I will lawyer up and visit a doctor.\n\nAfter I hit send on that email, it took them less than one hour to call me, waive my deductible on my claim, arrange for a rental car, contact the shop I had left the car at to authorize the repair, and receive an apology from my \"former\" agent's supervisor for the substandard service I had received by them while processing my claim.\n\nWhile in the end they made it right, this was the second time I had a problem processing a not-at-fault claim from this insurer.  They're no longer my insurer, and they likely never will be again.\n\nI used to be like this too, I'll admit.  But I've long since learned my lesson that it's more important to make your customer happy then it is to save your employer a few bucks by blocking a customer's legitimate complaint or request.  Your employer doesn't notice when you use policy to prevent a customer from receiving a refund they're probably entitled to.  They **do** notice when that customer leaves a glowing review of the service you provided to your manager for helping them get what they were trying to get.",
            "tl;dr",
            "American here with a question: Is it normal to have a 9 month wait time to have surgery if you've been told you need it? Even if it's not emergency?",
            "Ok so why didn’t you call them and why did your wife have to call them to get anything done? Is it possible Karen didn’t have the information about your wife being an additional contact person? I know in the US if you work in the medical field you’re not supposed to give information out about a patient’s case even if it’s the patient’s wife or relative. Maybe Karen was just being careful and didn’t want to release patient specific information. Sure Karen could have been more helpful with locating the email but maybe you could be a little more proactive about your own health and not wait a year and a half.",
            "Shoulder injury in ~2007-2009?\n\nMRI in 2017, indicates a need for surgery.\n\nWaitlist.  Dropped from waitlist.\n\nRestore to waitlist in (2018?)\n\nAppeal to MP and subsequent Fire drill in 2019.\n\nPrioritized Surgery in 2019, 10 years after the injury and 2 years after confirmation that it was needed.\n\n\nFree healthcare is worth **exactly** what you pay for it.",
            "[deleted]",
            "I love Australian politics!",
            "Lmao I’m just imagining Karen getting 200+ copies of the same email 🤣 Not surprised they made you a priority case though. They dropped the ball on your care so much, there’d probably be a case for you to sue them for the failing in their duty of care. Between dropping you off the list, making you wait 18 months for the issue, Karen ignoring the fact your wife had permission to discuss your treatment and fobbing her off with the vague directive to “check the website”; some big boss would have been pissing himself in a panic. Not to mention the fact that you managed to get the email address of pretty much everyone with a hospital email address AND CC’d in a bunch of politicians. They would have been desperate to cover their own asses.",
            "And ya'll think American healthcare is fucked?\n\nThe goddamn VA is more efficient then that.",
            "I don’t want to get all political... but people shit on American healthcare all the time and here in the US even for the most minor things my family has never had to be put on a waiting list or sit in waiting room for 2-3 hours.",
            "And this is a lesson in why universal healthcare doesn’t work. This guy literally has to get parliament involved to get follow up on an MRI.",
            "People in ‘Murica are actually proud that the healthcare is utter rubbish and that the cost routinely bankrupts people. The healthcare in third world countries is actually considered a gold standard and Americans will go there to get competent, better managed affordable healthcare. The first response many people had when Trumps fuck Mexico dog and pony show started was damn that will make it harder to get decent healthcare.",
            "So \"free healthcare\" (not really free in the long run with taxes out the ass) has its own serious issues, long waitlists and long appointment times etc, and isn't the utopian dream that Dems make it out to be...\n\nThen again...Americans also shouldn't be charged $500,000 for a heart transplant and go bankrupt 🤷‍♂️👌",
            "Possibly Canadian?",
            "Sweet. Let's hope when democrats get universal healthcare they don't put maximum wait times so Congress can put their friends in the priority.",
            "I salute you 👏 👏 👏 (plus a silver because ealing with the NHS is a bloody nightmare)",
            "[deleted]"
        ]
    },
    {
        "post_id": "pnmv4h",
        "author": "kiltedturtle",
        "title": "All of my employees wear white shirts",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pnmv4h/all_of_my_employees_wear_white_shirts/",
        "score": 17407,
        "num_comments": 511,
        "created_utc": 1631562392.0,
        "selftext": "This is from the 80's.  I was the East Coast expert on a big mainframe company network gear.  I was associated with the manufacturing plant, but I did customer site visits to help field engineering either install or more often fix installations that were not working.  \n\nOn customer visits, it was suit and tie. Since I often worked in computer rooms I never wore white shirts because of the dirt issue.  (Plus TBH they make me look like the Sta-Puff Marshmallow guy. ) Normal was an up and down striped button down shirt in a blue, pale green, etc.\n\nFly to Boston to work with a sales droid on configuration of a system they were trying to sell to a big bank.  Sales droid says minor change, first we need to go to this mandatory sales droid meeting headed up by the regional VP of sales.  Fine.\n\nGet there, sea of white shirts ties and me in my colored shirt.  Sit in 5th row, room has about 50-60 droids.  \n\nRegional VP gets on stage, doing his best \"excite the troops to go out and sell millions\" speech.  Clapping and cheering, etc.  Mid sentence he sees me and stops. \n\n\"Hey you, where is your white shirt?\"\n\nLook around, figure he may be talking to me, so I point to myself.\n\n\"Yea you in the blue shirt.  ALL of my staff, everyone that works for me wears a white shirt\".\n\n\"Ok, good to know, thanks\"\n\n\"Thanks?!?! Get out.  And don't come back until you are wearing a white shirt\"\n\n\"You want me to go, and not come back unless I'm wearing a white shirt?\"\n\n\"Yes, get out now\"\n\nSo I get up, walk to the aisle, turn and go \"Hey, do you know who I am?\" \n\n\"No, I don't fing know who you are and I don't fing care. Out\" \n\n\"Super, then for the rest of you, I'm kiltedturtle the east coast expert in 'networking' product out of 'plantname' and I work for the Director of Engineering there. So I don't work for him, and it's unlikely that I'll be back since I don't own a white shirt.\"\n\nLeft. Flew home.  Frantic voice mails from the sales droid about his customer. \n\nNext day, dropped into Director of Engineering's office to give a trip report. \n\nHe starts \"So kiltedturtle, you were a big hit at the sales meeting.  VP of sales called to apologize and wants you to come back.\"  \n\n\"Nope, not going to happen.  He comes here, wearing a colored shirt and apologizes to me, I'll consider it.\"  \n\n\"He's not going to do that\"\n\n\"Fine, not traveling to that region, I'll talk to people on the phone, I can do my job that way just fine\" and walked out.  Called my sales droid and said we'd work on the phone, not coming back up.  Droid not happy, but understood.\n\nWeek later reception calls that I have a guest.  Go to lobby and there is my director and the regional VP of sales wearing a BLUE SHIRT.\n\nBest apology ever!!\n\nEdited to add: /u/Striderfighter asked why it was such a fast apology.  \n\nSo in the 80's network stuff was crazy expensive.  The networking part of the deal was worth ~$1+ million tying customers existing mainframes (fast host to host connections were new and a big deal) and some new mainframes; together so all in all $4-5 million.  And it wasn't going fly without some help.  So commissions for sales droid, manager, upper manager and VP of sales.  So a ton of money on the table for them.  \n\nThey got the deal.  And I got a surprise bonus. But I still had to go to Boston.\n\nEdited to add:  Wow, this got huge overnight.  Thanks for all the awards!  And the points!!! And especially thanks for all the great comments!!!!",
        "permalink": "/r/MaliciousCompliance/comments/pnmv4h/all_of_my_employees_wear_white_shirts/",
        "comments": [
            "Even if you worked for the VP, he was a jerk for calling out a person in a big meeting over a shirt color. It was a big power move to show everyone who is the boss (he failed in this case) but I would never want to work for someone that is big on showing off his authority.",
            "Man this reminds of that gobshite story of that specialized contractor who refused to get the foreman a coffee and quit, leaving them fucked on the historical restoration stuff they were working on. Remember that guy? Amazing.",
            "This just goes to show that if you're going to start a dick measuring competition in front of everyone like that, you need to be beyond certain you have the biggest dick or it'll backfire spectacularly.",
            "I hope that VP of regional sales learned a valuable lesson.",
            "That ladies and gentlemen, is how it is done.",
            "For people asking why:  Sales drones need engineers.  Engineers don't need sales drones.\n\nA sales VP is much more replaceable than any mid level engineer who has been good at their job for more than a couple years. A SME engineer is worth a lot more than that.\n\nAs a IT guy, this malicious compliance is delicious.",
            "At this point, he knew he fucked up and the only thing he could do was wear a blue shirt and apologize.  Give him props for doing that.  Also props to your director for being understanding.  I'm sure he had to deal with shit from the VP before the VP gave in.",
            "Working in government procurement.  For decades wore dress pants, shirt and tire.  At lunch I would take the tie off and put it back on.  Since I worked in a cubicle, no one really saw me outside of fellow employees.  Stopped wearing the tie after lunch.  Then a notice came out that there was no dress code.  Already had my wardrobe, so kept wearing the same stuff but skipped the tie unless I had a meeting with a vendor or being interviewed for a promotion.",
            "My dad was a photographer who was hired by Mega Corps to shoot their events and big wigs. As an artist part of his style was to wear tweed jackets, corduroy trousers and non white shirts. He looked professional and business like, but still looked like the artist.\n\nThere was the one company however where he figured out he needed to blend in. He has a dark suit and a set of 5 starched white shirts. They only came out when he was headed to Armonk or the 100 Percent Club events.\n\nIn the 70s when streaking was a thing he had a joke...  \nDid you hear about the streaker in the executive wing at Insanely Big Mega Corp?  \nA guy went running down the hall with no jacket and wearing a blue shirt.\n\nWhen I cleared his closet after he passed away I found the set of 5 white shirts. They are in perfect shape.",
            "This reminds me of Atlanta Falcons owner Arthur Blank. There’s a YouTube interview of him saying he tried to pitch the Home Depot idea to Ross Perot. Only a few ppl in the meeting, but Perot told him like “we all wear white collared shirts here.” Also told him no mustache, and his car brand wasn't what he should drive.\n\nHome Depot blew up lol.",
            "When you try to assert dominance, but realise you don't even have teeth to bite with!",
            "I can't imagine figuring out networking in the 80s. You just have to figure it out with the documentation. What a nightmare.",
            "Salute.\n\nI know what it's like to be the guy who gets the job done, and take shit from some guy who just has a great job.\n\nI generally go to work in shorts and flip flops (I \"dress up\" when there are workplace safety requirements) I'm a little behind your times, but I can comprehend how they weren't ready for that in the 80's, but that also when computers were 100% magic to the average user.\n\nI salute you because I couldn't be who I am at work if not for people like you. You all built the infrastructure that made my job possible, and you all used that influence you earned doing that to make it possible for more people to be \"unorthodox\" in our workplace attire.\n\nI stand on your shoulders.",
            "And we have a winner! I'm thinking he _might_  have learned something from that...",
            "these are not the droids you are looking for",
            "Man. Someone got knocked down a few pegs. I bet a lot of the others there were happy to see that happen.",
            "For anyone who thinks this sounds unlikely, these were the heady days of total computer nerd power.  This is where the Dennis Nedry Jurassic Park stereotype came from.",
            "> \"Nope, not going to happen. He comes here, wearing a colored shirt and apologizes to me, I'll consider it.\" \n\nI laughed out loud at this. Please tell me you have to get custom-tailored pants to contain your enormous balls.",
            ">80’s\n\n>mainframe\n\nYa, checks out",
            "Having a similar problem at my work. Talked to my boss  about it and they said that a white button down shirt is fine... So I plan on spending like 10$ on a white shirt and buttons to sew on",
            "I remember those days when I worked for an OEM in St Paul that did networking computers. Crawling under a raised floor in a suit and tie to pull a memory twist donkey dick cable was a real PITA. But, the big main frame company set the dress code standard back then and my company followed. After the first time, I did let the company buy me a set of coveralls for that kind of work.",
            "One of our area directors had a go at a field engineers for wearing jeans. Didn't go down well. A few other staff took the piss out the director by wearing decent quality charity shop clothes; suits, paisley cravat and matching handkerchief, bright orange braces, ...\n\nThe director was a know bully and eventually left although they should have been publicly pushed!\n\nEdit: wow. 28 upvotes in as many minutes! Cheers. Here's a bit more to the story.\n\nBully director complains to the actual director above the 'dressy' staff, who, disliking bully director basically ignores him. Can't remember exactly how long this went on for but it was something like a year or three.\n\nEdit 2: 10 more votes whilst I typed out first edit.😁",
            "Reminds me of a tech I contracted for a while when I was an IT manager. That guy knew his stuff, but also had a backbone shinier than the sun.\n\nHe dressed in jeans and hoodies. I was fine with that - he was a tech, and my country is not big on dress codes outside law and finance.\n\nHe told me he was a tech and an investment firm (finance) and showed up in jeans and hoodie. The CEO of the firm told him he needed to show up in a suit, white shirt and tie. He refused. The CEO insisted.\n\nHe went \"Look man, you sit in a chair in front of a desk all day, that is not taxing on a suit. I crawl under desks in the dust and dirt, handle sharp edged hardware and heavy servers. My suit would be ruined in a few months. Unless you are going to pay me the cost of a nice suit every six months, I am not wearing a suit.\"\n\nThe issue was quietly dropped after that, and he continued to wear jeans and a hoodie when he worked at that place.",
            "So I'm guessing you're in your mid-60s and worked for IBM at the same time I did, late 70s to early 80s, and this was a big sale of 3705's and SNA to somebody like State Street. If I remember correctly, you were based in the Raleigh-Durham area. Am I right?\n\nI was recruited into Sales in Central NY. With a degree in Computer Science, I expected them to hire me as a Systems Engineer, but instead they hired me as a salesman. I bought a suit and a sport coat and slacks from a discount store, and a couple of shirts, one brown and the other blue, both striped vertically. With a couple of nice ties, I figured I was golden.\n\nDressed like that, I got beat up and embarrassed at my first training session in Endicott, NY. They then assigned the worst territory in the branch office to me. It was spread out all over Central NY with customers that had been unhappy with IBM for years. That territory sucked my soul out of my body through my anus.\n\nEnd of story: I ended up with a closet of white button down shirts, blue suits, red ties, and black wingtip shoes two years later. I finally started hitting some numbers, because I was now an acceptable \"droid\" who deserved some resources like you. Saved a year's worth of commissions, resigned when the sales manager in Santa Barbara asked to transfer me and my branch refused to grant me an inter-office transfer, and moved to CA. Never looked back.",
            "Sales droid is my new favorite term. Bravo.",
            "Maybe I missed it but why did you go to the sales droid meeting in the first place if you weren't a sales droid?",
            "Sales droid and his Systems Engineer partner go hunting for bears. They reach a meadow and sales droid says, in order to avoid any real work, \"You put up the tent, and I'll go look for some bears.\" SE is almost finished pitching the tent when he hears a blood-curdling scream. He looks up and sees the sales droid running full speed at him with a growling bear in hot pursuit. As the sales droid runs past the SE, he yells, \"You skin this one, I'll get another one.\"",
            ">But I still had to go to Boston.\n\nThe absolute worst part of this story.\n\nI flew into and worked at sites in Boston when I was a VoIP engineer. I *hated* Boston other than the food.",
            "Congrats on the apology! I’ve yet to see a MC post where they actually got the apology!",
            "One of my parents worked in an ER. One of the nurses was into sewing clothing, particularly t-shirts; for the hospital folks: \"If you give me the cloth, I'll do you a t-shirt at cost\".\n\nSo folks did.\n\nSo for years these guys had weird t-shirts with patterns of galaxies, LSD swirls, tie dye, hippie-whatever, Hawaii-derivative, and so forth.",
            "I was in Tech Support.  Got a call from Sales folks, they have a customer who wants a meeting with someone who knows XYZ product.   I'm the TS in product, so of course they called me.   Check schedules, yeah I can do it on day/date.  \n\n\nThis is the first time I've ever even met a customer, so in the morning I dithering about how to dress.  Full suit?   Just a button down?  Tie?   Finally I give up, jeans and corp polo shirt.  \n\n\nIn the meeting room waiting on customer is My boss, Director of TS, Sales folks, their manager and the Director of Sales.   I'm feeling seriously underdressed, as even my boss is in a button down & tie.  \n\n\nA few minutes later, another Sales person shows in the customer team.   Their guy in a suit, ignores everyone else, comes straight to me.   \"You must be Otter, I'm {name} Director & Sponsor of the project at our company.\"    \n\n\nGuess I dress appropriately.  ;)",
            "goddam i hate corporate culture sooo much but am so stuck in it please helpppp me",
            "1980s networking.  Anybody else remember token ring?",
            "Thats a POWER move",
            "This guy '80s.",
            "And it is stories like this that have led the Bay Area to be known about its rather casual dress for the office.",
            "This is the best MC I have read on here yet. If I had an award to give, you'd get it.\nThank you. This one made me LOL, for real.\n\nIn a BLUE SHIRT!",
            "yup - somewhere in the 90s I stopped wearing ties as I was delving more and more into hardware with nasty spinning stuff. saw too many stories of other techs who had been dragged into nasty spinning things, and didn't want to emulate them. Well, I did, but just not in *that* manner :)",
            "I worked for a company in the 1990s where everyone in the offices wore a white shirt.\n\nHome Improvement was popular at the time and Tim Allen wore colored shirts on the show with ties, so I checked the dress code and there was nothing on it about shirt color, so I started doing that.\n\nWithin a year, every guy was wearing colored shirts.\n\n(It was a holdover from the blue-collar/white-collar era, but it didn't really matter anymore.)",
            "Homer and his pink shirt.",
            "What's important is that you stood your ground and didn't take any of that VPs shit. Having a poker face is easier to do when you've got the winning hand!",
            "I have a raging revenge boner for ~~you~~ ~~this story~~ you right now.",
            "That's epic, I knew when you said it was in the 80's and a networking and mainframe story it was going to be awesome.",
            "Jezus Christ we should hand out MC-Rewards or something.  \nThis is one of those gems.",
            "You made him be humble. You did gods work.",
            "That VP was acting badly in that meeting. However, he *did* apologize while meeting your criteria, so maybe he learned a little something. \n\nMy dad did similar work in the '80s and '90s. He installed mainframes and built networks from the ground up. His customers loved him. But he did have to wear a suit and tie (and yes, a white shirt). \n\nWhen I worked for a printer/copier company doing maintenance on their contracted machines, I was also expected to wear nice clothes (including a tie). I hated it. I wear nice clothes at my current job (no tie, praise the Lord!), and still don't like it.",
            "I worked as a software specialist for DEC in the 80s, in the Wall Street office.  My excellent boss had been transferred, and my new boss was promoted into that position just a month earlier.   \n\n\nOne day, we had a huge snowstorm, and since I lived just 1 subway stop away,  I went into the office anyway, wearing jeans and boots, only to find that I was one of only a few people who showed up.  My boss wrote me up for wearing inappropriate attire.",
            "Not nearly as an epic experience as this but my first job was basically the internal helpdesk for a telecom company.  Corporate offices were here and because of that they mandated slacks+button shirt or equiv for everyone (most of IT was on a different floor, and later a different building but yea).  Didn't take long for them to realize how dirty af you got after crawling under desks to fix things or carrying boxes around  (black pants and white shirst really show dirt for some reason ;)  It was later changed to allow nice jeans or khakis and collared shirts if you didn't work on the exec floor.",
            "Boston?\n\nMain Frames?\n\nMandatory white shirts?\n\n1st guess is DEC\n\n2nd Wang\n\n/my ole man did semiconductors until it all ended up in Taiwan.",
            "Great story. Reddit needs to add a Brass Balls award. Poking at a VP, even in a different org, was not done lightly. \n\nThanks for the trip down memory lane. I moved to the West Coast in 1990 where things were a lot more relaxed. \n\nWith exceptions:  on a visit to Boeing Aerospace (or whatever their military arm was called) in Southcenter, the software guys wore coat and tie. I remember asking my coworker if he wasn't a bit concerned about people working on weapons guidance systems while cutting off the flow of blood to their brains.",
            "(Thanks to all the new people that recently read this)",
            "This happened so hard it broke me",
            "\"Sales droids\" is the best part of this story IMO.",
            "I at least give the guy credit for showing up in his blue shirt to apologize.",
            "Damn the 80's had droids, that's sick",
            "This just sounds like some dude called out darth Vader because he wasn’t a battle droid then realised it’s darth Vader lmao\nGreat story",
            "[deleted]",
            "By the way, if it's the mainframe company I'm thinking of, in that era they had a corporate directive that all employees wear white button down shirts.  Branding or something.  So perhaps vendor was just trying to fit in. \n\nBut in any case, sending an expensive rented expert home for wearing a blue shirt is the kind of thing that legends are made of. Bravo.",
            "You don't get many \"do you know who I am?\" stories where it's actually somebody important.",
            "[deleted]",
            "Op talks about droids but I don't get it.\nIs it a derogative way to talk about sales-blockheads?",
            "Managers love to swing their docks until shit gets knocked over.",
            "Sounds like eye bee emm. Worked a few jobs for them back in the day. Everyone wore the standard white shirt, blue suit. They knew I was a contractor bc I didn't wear the uniform.",
            "What do computer field engineers and cops have in common?\n\nThey both wear clip-on ties.",
            "OP please tell us you had your picture taken with this guy.",
            "This is my favourite story yet.",
            "Reminds me of that Simpsons episode. At least they didn't put you in an institution lol.",
            "\"When you have them by the balls, their hearts and minds will follow.\"",
            "Did you like working for IBM?",
            "Follow up question …\nWhen u returned back to Boston, did the droids know the VP wore a blue shirt and visited you first?!?",
            "Being willing to walk away and not give a fuck is the smartest way to negotiate when your resume speaks for itself in terms of your options, gg. This was a satisfying read",
            "This is amazing. Thank you for sharing 😎",
            "The HAL 9000 series is the most reliable computer ever made. No 9000 computer has ever made a mistake or distorted information.",
            "Am sales Droid. Loved every. Freaking. Second. Of this story. Thanks for this, and on a Monday no less!",
            "Chubby boy",
            "You might not want to use a non common word like 'droid' repeatedly without any effort to explain it.",
            "That company was big and blue, wasn’t it?",
            "[removed]",
            "\"A bunch of mountain men? I think we can safely say she’s done up until this point in time would tell you she’s just a damn white t-shirt too. it’s from Annie’s giving AZ votes, and App State, maybe one or two. Yagami, at least a stretch of a reason to stick around",
            "Is \"droid\" some stupid 80's slang I missed or are you trying to be cool for the kids? It's just distracting and demeaning.",
            "Those \"droids\" kept you employed genius.  You sound like the typical egotistical tech guy to me.",
            "back when there were only a few options  Data Procession was fun!",
            "I love this story, awesome malicious compliance OP, today you're my internet hero!",
            "Do you think our present  generation of management would be this reasonable?",
            "This one with the great ending is the best one I’ve seen in a bit.",
            "Way to put his nuts in a vise",
            "I have an erection now. Great story.",
            "All of a sudden?",
            "Ah yes, mussolini, my favourite",
            "next time Hawaiian shirts and loud tie",
            "This sounds like some Wang Labs shit. I grew up in the Boston tech belt, I’ve heard some stories. Mostly DEC stories",
            "In the late 70s and well into the 80s, Wall Street had a dress code. Women were required to wear dresses, hose, and heels. The men were required to wear suits, ties, and regulation hair. It was a great job, but the dress code bit large. The 2 big tech companies at that time required their field people to wear white shirts.",
            "This story makes me visualize you as the villain in the move”Hackers”  but less evil obviously.",
            "r/dontyouknowwhoiam",
            "https://youtu.be/UDRLZFgEoGw",
            "I’m petty. \n\nI’d let him sweat it out overnight at least.",
            "It was probably a little vacation for him",
            "Absolutely phenomenal. He must’ve been pretty flustered when he showed up, huh?",
            "Print the shirts!",
            "Report it to the department of labor equivalent.",
            "Should of gone to the health board.",
            "this is brilliant!",
            "Sounds like coke-cocky 80s dudebros to a tee.",
            "I accept my part of the expierence...",
            "Looks like a good post for r/talesfromtechsupport",
            "You could have done more to humiliate that vp, but you didn't. 😞 i'm sad.",
            "*Was* super expensive? It still is.",
            "Hahahaha... reminds me of a former workplace. CEO'S secretary visited on his behalf and tried to berate me for not wearing a white shirt. Told him to save his breath because it was my last day.",
            "Yes, lots of things that are common we're new in the 80's. Trained people were in high demand. Gave them a lot of po\\er sometimes."
        ]
    }
]