[
    {
        "post_id": "wxwlgm",
        "author": "AdElectrical5354",
        "title": "I knew my job but the new manager thought he knew better so I did it his way. Very precisely.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wxwlgm/i_knew_my_job_but_the_new_manager_thought_he_knew/",
        "score": 17259,
        "num_comments": 326,
        "created_utc": 1661479944.0,
        "selftext": "So I used to work for one of the top delivery companies in the UK. There was a lot less competition 15yrs ago. \n\nI was very good at my specific delivery job and I often undertook every office task from single delivery routes to maintaining the office and delivery distribution to all routes. \n\nThen one day in comes the new manager and it was the cliche that you dread. You probably all have met the type. Suit slightly too big and a trainee moustache. He had just finished Uni and to his credit got himself a business degree. \n\nThe problem with this company was every office around the whole country was run differently and this poor manager was expecting every person to do things by the letter but most of the work was done on good will since we were allowed to finish for the day when we had completed our deliveries. It was creating a rod for our own backs tbh but it was nice to finish earlier on lighter days. \n\nFinally on his third day after watching me daily and asking me why I was doing things in certain orders I told him my delivery route was complex and required it to be done in a certain order to ensure the timed deliveries got there before 1pm and the other delivery staff were “fed” their delivery materials by myself at certain times to ensure optimum delivery speeds and minimum delay. He replied “No it doesn’t work like that”. I simply stared for a bemused few seconds and said I don’t understand. \n\nHe wanted it by the letter today as per company guidelines. I argued very hard against it and said he will really regret it because we won’t complete but he insisted I was wrong because it was all timed and measured.\n\nSo after an exasperated 15 minute heated discussion I did as I was told. To the letter. The 5 staff I fed deliveries too weren’t happy but understood. \n\nIt was like a domino effect of carnage. \n\nAt 12:30pm we all rang in the office to report the failed timed deliveries which he promptly freaked out about because they were strictly monitored. The subsequent enforced break times and shuffling required also left 15-20% of each walk unfinished which he also now has to complete himself on top of the timed ones. \n\nHe had to fill out reports for all failed 1pm deliveries, all walk failures and then had to call in managers from other offices to finish it all. They all finished around 4hrs late. \n\nHe was not popular!!\n\nThe next day he came to me asked me to show him the mechanics of the delivery route in detail because “I didn’t expect that to happen if I’m honest”. It was close enough to an apology for me 😁. \n\nWe actually became good friends over time but he never questioned me when I said “nope” ever again.",
        "permalink": "/r/MaliciousCompliance/comments/wxwlgm/i_knew_my_job_but_the_new_manager_thought_he_knew/",
        "comments": [
            "At least he appeared to have learned his lesson!",
            "Lol when what you learned implodes because real life. Classic example. I remember training people for fueling aircraft. The training videos where all one way, but the actual work was completely  different. Every time i would train the new guy, i would say, everything you just learned. Forget about it. Then we would show him the right way.",
            "This is a great of example of a good boss in the making. High and mighty with his shiny degree, slamming suddenly into how the real world works. He might not be a *leader* per se, but he's showing the capacity to admit he was wrong and try to learn from a mistake. Maybe one day an actual apology, or even taking responsibility for problems!",
            "You: \\*explains why you're doing things the way you are, as well as the consequences of not doing it that way\\*\n\nHim: \\*insists you do it differently, and experiences the consequences you explained\\*\n\nAlso him:  “I didn’t expect that to happen if I’m honest”\n\nAt least he learned from it instead of doubling down.",
            "Similar thing happened to me. First day on the job, the new manager told us (a great team of experienced professionals) that we WEREN’T to do any filing of orders: this was the “manager’s job”, that the back room was “*HER* office” (which we shouldn’t even enter when she wasn’t there), and those were the “*manager’s* files and books”, which were “none of our business”. \n\nAfter trying to argue with her (and finding her extremely patronising), we all gave up and left her to it. If she wanted to do some of our work, fine. But how did she even know about our orders? Something was wrong somewhere, but what can you do?\n\nRoll forward in time, and there you go: everything is chaos, collapsing in all directions. The woman hadn’t been fully trained and there were procedures that she’d never even heard of-which subsequently hadn’t been done for months.\n\nTo give her credit, she wasn’t a bad person-and she came to us, explained it all and thoroughly apologised. We all pulled together, got the department out of the hole (it took several weeks) and hushed the whole thing up. It was a horrible company to work for and she certainly would have been sacked.\n\nAfter that, she was absorbed into our team and we went back to being a group of really solid, efficient working friends. It was a bonding experience for all of us, actually.",
            "Looks like the book needed an update.",
            "Holy shit an actual good ending in here, typically you just see these type hating you more and try to fire, or get themself fired.\n\nThe guy is decent enough I guess, just not experienced at the time.",
            "This is satisfying 😊",
            "One of the best pieces of advice I was ever given when starting a new job was - don't start suggesting changes until you fully understand why things are done in a certain way. \n\nI've seen other people go blundering in, full of ~~good intentions~~ self-importance, only to be proven wrong. It's also a fantastic way to annoy everyone you now work with.",
            "I'm pleased he didn't turn around and blame you somehow, or keep insisting for more than one terrible day. Still very satisfying to have his way crumble to ash when you obliged him.",
            "This is a good story. I even take pity on the poor bloke. Coming straight out of school to his likely first real job, trying to make a good impression. Fucks up and actually LEARNS from his mistake instead of just exploding all over the place like a rage monster. I'm sure he's done well in the past few years.",
            "It’s nice to read one of these where it all ends well.",
            "I have my bad days as well as anyone & there are times I don’t wanna listen to those who know better than me. \n\nHowever, that being said, when I fuck up & need to ask someone to show me how to do it right, you bet your ass I’ll be going to them.  One of my main notes to myself when I open my own business:  “The supervisor I hire who knows more than me will be MY boss while on duty.”",
            "It's worth noting that at least one reason he insisted on going \"by the book\" is because he will have to answer to somebody above him about why they're not doing it by the book, especially if he just accepts that not doing so is the better way.\n\nPut another way, he insisted on following the book because he'd have to answer for not doing so just the same as he insisted on you having to answer for not doing so. He's not putting his neck on the line without proof that it's necessary.\n\nNow he has evidence to support his decision to ignore the book, should he be called to the mat about it.",
            "Frankly, this is a good experience for all involved, particularly the new manager.  He learned why something was done a particular way, and he'll wait to learn and gain more experience before suggesting (or imposing) new procedures.",
            "Very mature kid. Not many that would swallow their pride. Kudos to you as well for not holding it against him forever!",
            "Gotta work out how the boat floats before you go rocking it.",
            "Everyone comes in thinking they are going to cut waste, increase efficiency, and raise profits. And sure, there's always room for improvement. But first day in the job you're useless until you learn the processes and why things are done that way. Chances are, there's a good reason it's done that way. \n\nNow after you've been on the job for a couple of months and you understand the system, then you can start making changes and see how that goes.",
            "Suit slightly to big and trainer moustache. That says it all.\nHe learnt a lesson on early in life.\nI bet he eventually became a good employee/manager/supervisor.",
            "He gave it a shot and failed. Realized he was wrong and asked for help. Seems like a decent boss to me. Would have been nice if he listened to you but some people have to learn the hard way",
            "[deleted]",
            "Well, at least he was aware enough to realize that he'd caused it, and that life ISN'T a textbook case...",
            "I think this is an important lesson for anyone in management. Listen to the people doing the job, in many cases they are the experts at getting the job done well and on time.",
            "You don't know how GLAD it makes me to hear that he had enough spine to acknowledge his mistake and asked for assistance.  Too many spineless bastards see something wrong and then blame everyone else but themselves.",
            "Years of graduate school trumped by three days of real world",
            "What qualities of leadership management makes a person think this way?\n\nI want to know so I dont act or do anything in this way.",
            "Some rare self awareness here.  A pleasant surprise.",
            "Honestly this isn’t even all that terrible of management. I’ve worked on a number of teams who do things some way simply because “that’s the way we’ve always done it”. \n\nNow I’ve never been foolish enough to try to change everything day one, that is really the big mistake of OPs manager. “I’ve been doing it this way for X years” is not always a bullet proof answer. \n\nSo many of these stories seem to end with “and then everyone quit and the branch closed down” so it was quite refreshing to read that the course was immediately reversed the next day.",
            "Bro I wish I could honor the manager for acknowledging he was wrong and backing off. That’s really hard for a lot of managers to do.",
            "I'm an experienced graphic designer. At the time I was working for an asshat employer, I had 25 years under my belt. While struggling with a complex, multi color screen print design, the employer quipped that he didn't see what was taking me so long because HE could do it in 30 minutes. \n\nThis guy designed repetitive fabric patterns for men's shirts once upon a time. Aka, something that could be done in MS Paint. He also took an hour long course in Adobe Illustrator at a community college, so he was \"knowledgeable\". /s \n\nI sat back and asked him to show me how to do this in 30 minutes because I'm always willing to learn. An hour later the owner throws the mouse at the computer and stomps off grumbling. No apologies or recant.\n\nWhen your veteran artist can't do it fast, chances are it can't be done fast.\n\n*Edited for autocorrect.",
            "This reminds me of a common problem with engineers right out of college (and a joke with engineers in general) which is that the math they do is for their own little world. My dad was a programmer for blast furnaces at sand and garbage dumps for over a decade on his own and another decade prior where he learned and specialized. He would always tell stories of arguments with resident engineers that had it all mathed out and would get snippy when he pointed out that it wasn't possible (pipes in the way, too close to the furnace to run properly, etc). When I went to school for drafting, my goal was to become an engineer so I'd stand out for not making those mistakes because \"the engineers draw it on a napkin and draftsmen make it look pretty.\" All of my professors and even the engineers at my internship laughed and wholeheartedly agreed",
            ">and to his credit got himself a business degree. \n\nBusiness degrees are the participation trophies of college majors. Source: I have a business degree.  Business acumen, *especially* management, comes from experience that simply cannot be replicated in a classroom. And it sounds like you gave this guy a world class education his first week 😂",
            "The fresh out\"s sometimes have to learn that, what looks good on paper, does not actually work / transform into reality, unless there is decent amount of research done........\n\nAtleast in this case, there was no armageddon, just a quick learning experience.",
            "> The next day he came to me asked me to show him the mechanics of the delivery route in detail because “I didn’t expect that to happen if I’m honest”. ... He never questioned me when I said “nope” ever again.\n\nThis result echoes with one of my personal philosophies.\n\nLots of professionals take personal offense when someone (manager, client, colleague, etc.) asks to review their work. Not me. You want to discuss my analysis? Great! Let's do that.\n\nI take my work seriously. I delve deeper than is required, I pay attention to small details, and I consider the broader context. I put a lot of thought into the options and consequences. And as a result, I'm confident in my results.\n\nAfter this discussion, even if you have different opinions or choose a different option than I recommended, you'll at least be informed of the high quality of my work. And in the end, *that's all that matters to me.* I am not responsible for whether or not you make good choices with my work product; I can only play my part to the best of my ability.\n\nIf you repeatedly ask for these discussions, you will be reassured that I apply these standards consistently and dependably. Eventually, you will build a level of confidence in my work, and you will trust my results without questioning them every time.",
            "Lol we all gotta learn 🤣 at least he did, and after only one day! A freaking miracle",
            "I've had to tell my techs on more than one occasion \"do it the way it's written.  I know it won't work that way but do it anyway\". Management won't let me just change a procedure, I need documented justification to make changes. So I need the techs to fail at their task so that their tech reports show that it doesn't work. Then I can order a revision, where I can get with the senior techs and write the procedure based on the way the actually do things.",
            "As a delivery driver in the USA for a large brown truck company, this makes me happy. Most of our direct supervisors have no true experience doing our jobs. Sure they cover routes when there is no other option, but our union is so strong not many people want to leave the delivery job for management. A lot of our supervisors get on their high horse due to how their bosses tell them to work, but the good ones don’t. \n\nWhen we get new supervisors a lot of the time they try to flex their “knowledge” of how things should be done and end up running into this problem. Once they figure out that the people who’ve been doing it for years have a good idea of what they are doing, it gets better.",
            "I think every new manager goes through this cycle where they expect something to happen a certain way, but it doesn't happen, and then they have to resort to other means. The first escalation is always a teaching moment. \n\nThe thing is that he isn't wrong in expecting the processes to work the way they're expected to. The fact that they don't shows that the company is inefficient. Maybe if they grow in the company, they'll reach a position where they can realign the processes to work efficiently. \n\n\"The problem with this company was every office around the whole country was run differently\" - this is not the right way for things to run because this makes the system people dependant rather than process dependant. If you weren't there to guide him, they never would've known how to operate correctly.",
            "Sometimes you need to run exactly to the procedure as written so you can see where the faults in the written procedure occur, so you can then update the written procedure.\n\nYou might only need to do it for a day or a week but trying to explain to workers why you are doing something you know will fail so you can rewrite the procedure or come up with the concrete evidence to pass up the line to a more senior manager can be a fruitless task, and they all think you’re the idiot.",
            "\"You should do it this way\" instead of \"Why don't we do it this way?\" Classic.",
            "I would always defer to experience more than hierarchy. Fuck procedures written by pencil pushers",
            "*\"The next day he came to me asked me to show him the mechanics of the delivery route in detail ...\"*\n\nIs exactly what should have been done first but at least the new manager learned from the mistake.",
            "I love your story in and of itself, but even more because of that closing statement!",
            "I’m always forgiving with people like this because they accept when they’re wrong and even then go learn from their mistakes and try to better themselves from others. Really happy with the ending with this one!",
            "it's a sad thing that so many managers need at least one epic failure to teach them the lesson of listening to their employees. a gold star level manager would probably go to a new position, just spend a week or two just asking questions, figuring out why things are done the way they are, before going to the 'everything here sucks, I'm gonna fix it all' phase.",
            "Was this at a Royal Mail delivery office?\n\nNever mind - you said that the manager learnt his lesson very quickly, that wasn't my experience of RM lineos",
            "My question is if the current method is working just fine and everything is done by time or earlier why does he even had the urge to question it?",
            ">“I didn’t expect that to happen if I’m honest”\n\n&#x200B;\n\n\"Well you should have, because I minced no words on what was going to happen from changing things to the way you wanted because of reasons, if I'm honest\". At least he learned from this, others have doubled down to try and save face (which never works, they're only deluding themselves)",
            "Why didnt you become the manager?  You sound like you'd be the actually qualified person for the job.",
            "10/10 ending, all it takes to turn a shitty manager into a good one is admitting when they're wrong and asking knowledgeable staff for help.",
            "Most of that garbage \"written by the company\" is usually some ass clown in an office who went to some school got a degree and has no fucking clue about the actual work done. \"Our research/data shows\" jack shit and theories that will ultimately fail in actual practice.",
            "Now there's someone with an unreasonable expectation of how the world works. HOWEVER, the fact that he did not keep those expectations when proved wrong shows that he isn't a *bad* manager, just inexperienced.",
            "One of the most important traits in a good manager is admitting you were wrong. At least he didn’t double down like so many others would have.",
            "This is very common when new management comes in.  Good managers meet with their staff to learn procedures before trying to change things",
            "Once again a manager that gets it.\nOnce again it's not USA",
            "He learned his lesson after one day? Hell even I don't do that sometimes, and I work in manufacturing.",
            "Went from \"I know everything\" to... \"I know nothing.\"\n\nJust like that.",
            "Honestly this is one of favorite ones.. not so much because of the malicious compliance, but because the manager was flexible enough and humble enough to learn.",
            "Lesson learnt: Don't change things that already work properly",
            "I had a similiar new manager. Argued alot, did the thing letterally. Shit happened as predicted. Was my fault and got a my first written warning. Resigned with 1 months notice the day after. I spent that month playing on my phone at the desk 😌",
            "Quite common where I am. One of my housemates started her Masters degree immediately after getting her undergrad (her degree was a generic degree in Business Studies and wasn't very marketable) and had no work experience. She had loads of assignments that required work experience/know how so I would spend at least a hour explaining to her what the questions wanted, how to go about answering it (to make it seem she knew what she was doing) and what she had to do (some assignment required her to do things like come up with a list of questions for surveys, interviews etc).",
            "Was lapsing on as well?",
            "In theory, theory and practical are the same,\nBut in practice, theory and practical are not the same.",
            "\"if it ain't broke, don't fix it\".\nI'm glad the new manager came to his senses and asked you how it all worked.\n\nMy dad was in the military and if things didn't work according to the guidelines, he would get them changed to be more efficient.",
            "Maliciously delicious and wholesome at the same time. Glad he came out better for this !",
            "Quiet quitting is just malicious compliance! I've been trying to think of what it actually is haha",
            "well one bad day but all turned out well i guess?",
            "So many people can't seem to grasp Chesterton's Fence... Ask why a fence is there before you take it down, AKA ask why things are done a certain way before changing it.",
            "Love that story! \n\nHe not only got a degree to his credit, but had sufficient humility that I bet he eventually became an excellent manager.",
            "Yeah there’s the most gas efficient way to run a route and the right way to run a route. The drivers and dispatch will know best, especially with cutoff times, other companies delivery times for when the dock will be crowded, when the receiver goes on lunch. Ect.",
            "This makes me think of my time at UPS. I was a part-time supe, and my supervisor handed down some plan from up above. I told him that I've already got stuff working very efficiently and that this plan won't work. He told me to just do it their way, and things would be back to normal soon enough. In turn, I haven't it to my employees, was met with resistance, and told them that this was coming from up above; just give it a fair shot, and we can say we honestly tried when things don't work. \n\nWell, it didn't work, so they have us a new plan the next day, and that didn't work, either. We went back to doing things the way we had, and then upper management asked why I changed things in the first place. \"Because you told me to.\" \"No, we didn't.\"\n\nI'll give them credit for trying new ideas and abandoning then when they don't work, but there's no accountability from up above.",
            "Gotta love higherups bringing in new management when they have staff who know the entire ins and outs of the business. Degree over experience is not a smart business decision. Its understandable that they would want someone who knows their shit when it comes to the business side of things, but let them learn on the job in more of a training position until they can actually fulfill their duties.",
            "As soon as you said 1pm I knew the company was red crown love your story by way",
            "Sounds like a good manager to me. Started out with company SOP. When that failed he was very flexible and open to change. Quickly.\n\nSuccessful MC, though.",
            "I’m currently getting an associates degree for business. If someone is able to figure out a more efficient way to do something why not use it as long as it doesn’t break safety guidelines? You’ve probably worked in that position longer than I have so there is probably a reason why you do things the way you do.",
            "Dude was a young boss and coped to his mistake or at least didn't blame you there are much worse bosses out there.",
            "What?  He didn't fire you and give himself a raise afterward???\n\nI call cap.",
            "Huh. Look at that. The good ending!",
            "I’ve read this exact post word for word a while ago. This is 100% a repost",
            "I love that none of this is malicious.",
            "Your title gives me so much doubt in you",
            "There's too much internal jargon used in this story for me to understand exactly what you were describing.",
            "[removed]",
            "\"Seek first to understand.\"",
            "Lol. Gotta love new managers. I'm happy he realizes his degree didn't mean he knew everything.",
            "Hope you got promoted or a huge raise afterwards",
            "When you said \"to the letter\", I read it in Adrian Dunbar's voice",
            "Some usb c to vga in upstairs setup hall",
            "Too bad corporate policy couldn't (/s) be changed.",
            "So one of the rare ones wich turned out good",
            "New managers are the worst. They all have the *same* process when they're hired.\n\n1. Replace or take the place of the old manager\n2. Act like everything about the old managers process and how they trained their employees is inefficient and can be improved\n3. Stress shoots up to sky high levels, employees express frustrations, some quit, most are told to deal with it\n4. After a while of doing things the \"new & efficient\" way, the new manger finally realizes it doesn't work.\n5. Things go back to the way they were, things start to get done but less efficiently because some key employees left.\n6. New manager takes credit for the boost in efficiency and improved methods. Act's like they're the single greatest decision the company has made since founding.",
            "The learning curve of the new managers. Well most, some just continue to run head first into it until they get a concussion",
            "I am glad he learned. It is possible that the higher ups were pushing him to enforce the company rules and he was just trying to show he can tow the company line. Glad it all worked out in the end.",
            "At least that manager knew when he was beat, and how to sort of \"apologize.\"",
            "Ah the satisfaction when book learning hits reality. To his credit he did ask for the details. There is hope yet.   \nlife lesson-when the veteran in a position says we do it this way because…listen carefully. I’ve been a process improvement manager. It’s a very cool role but it takes great listening skills and the ability to weed out we’ve always done it that way vs actual improvements.",
            "I see he learned THE lesson, good for him. Y'know, sometimes even if you are manager your knowledge doesn't match those of your employees. If he sticks to his post, interacts with enough people, and learns from those interactions he may actually turn out to be quite effective, and the most knowledgeable of the bunch. But until then he has to bend over, which hurts the pride of many managers out there. Not everyone learns this lesson tho, so I'm glad he made it.",
            "Sounds similar to my Ex-boss who got Karma the hard way!",
            "These type of people who thinks they know better not from experience but from scoring an \nA on paper are truly scums on earth. I’m glad he decided to wise up but majority of people simply don’t and the amount of carnage it resulted is always severe and non rewindable.",
            "Ok google isn't helping me with the (probably obvious) definition of \"trainee mustache\". I've only heard it in British contexts. I'm guessing it's that first stash you get when you're not quite a man yet.",
            "I don't think the guy was wrong just his explanation or even reasoning was wrong.\n\nIf your gonna run a team or an office to the best of your ability you have understand how it works and how it doesn't. Going back and seeing why the prescribed system doesn't work and why the supposedly optimized system works better can be a good thing for all.\n\nFor 1 the boss gets to understand why their workers are doing things. Leading to less arguments and disagreements. It also gives all of them a chance to maybe see something that could optimize the system even further. Or allow someone who's getting taken advantage of in this system that makes his job harder but everyone else's easier to be seen and heard. It's hard to rock a boat that's in motion.\n\nSo if he just would have explained this or thought about it from this angle he would have been in the right and the employees who gave attitude would have been wrong.",
            "Once hired an Ex-Fedex driver to deliver auto parts to wholesale customers.  Think little garages with one or two bays/hoists as their money makers..  We'd sort the orders out in order of the customer's priority  - i.e. small mechanical with car stuck on hoist, then larger places with couple of hoists, then body shops.  He insisted on doing the deliveries in a circle / efficient route.  This meant none of our customers were happy.  He lasted less than a week."
        ]
    },
    {
        "post_id": "ch9jkl",
        "author": "combustablegoeduck",
        "title": "One minute late is late? OK.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ch9jkl/one_minute_late_is_late_ok/",
        "score": 17245,
        "num_comments": 687,
        "created_utc": 1563981683.0,
        "selftext": "So I had some \"attendence\" issues at an old job. Not really, the policy was that within five minutes of the shift is still considered on time. Well I had a manager who wanted to abruptly change corporate policy and define clearly that late = late.\n\nSo background, it's retail and I'm in my senior year of college. I'm not making a career out of this job, and I'm five years older than all of my coworkers. My immediate manager felt threatened by me, as I had previously declined leadership positions to finish school. He always had something he needed to \"fix\" about me even though I had seven straight months of \"Rockstar\" performance (exceeding metrics by +10% above goal) and I frequently aided in training new employees. Once again, this was a college filler not a career move for me.\n\nI'm not a bad employee. However, I was a busy employee. My last semester working there I had five classes, and would be usually within a minute or two to my shift.\n\nSo manager one day specifies I'm late (it's 3:01 and my shift starts at 3:00) to which I said \"marginally\". He, in front of other coworkers decides he's gonna put his foot down. \"no, combustablegeoduck one minute late is late\". So I stopped my task and calmly asked him, \"then what does it mean when I'm staying 45 minutes after my shift to help when we're short staffed?\". And he said, \"we don't even want to have this conversation right now\", and left. \n\nTo be fair he's not wrong-- he handled the situation wrong. If he wanted me to change something we could have talked in private, he wanted to swing dicks in front of the new hires. \n\nSo I complied. I made it a point to clock in and out exactly when my shift starts and ends. It's glorious. A couple weeks later he tells me I need to do something two minutes before my shift ends. So I start the task, and two minutes later I said, \"sorry manager, my shift is over!\" clocked out and left.\n\nMy mindset is go ahead, try to fire the best looking employee on paper for working exactly his shift and not a second longer. \n\nHe didn't want to swing dicks after that.\n\nTl;Dr A minute late is late, and I don't get paid overtime to work after my shift, so if your operation is so concrete that we need to be accurate to one minute of the schedule, you don't need me when I'm done.\n\nEdit: someone wanted a tldr",
        "permalink": "/r/MaliciousCompliance/comments/ch9jkl/one_minute_late_is_late_ok/",
        "comments": [
            "Time control freaks always end up having their own ideas backfire spectacularly",
            "My favorite is when I had a job where being more than 5 minuets late carried the same penalty as calling off completely.  \n\nGet stuck in traffic ?  Oops cant make it in at all. Enjoy.",
            "I had a similar scenario in an old job: the MD/CEO decided that he was fed up of people arriving a few minutes late even though almost everyone there would \"average\" being about 5 minutes early (5 minutes late one day, 10 minutes early the next).\n\nOn top of that \"Averaging about 5 minutes early\" (which nets the boss nearly 30 minutes per week of extra time per employee), the entire company was salaried and almost nobody went home on time, nor did people often take their full lunch hour unless they had an errand to run.\n\nSimilarly to your scenario, the boss started making a big fuss about anyone arriving late. Unfortunately for him, the most popular person in the company was having a bit of a rough time and so was late a few times in the first week, and thus got singled out.\n\nFor nearly a month, every single employee would arrive at their normal time and stand outside the front door chatting until 08:59:50, then walk in and sit down. Every single employee would stand up at either 12:00/13:00 (we had staggered lunches, to ensure cover) and walk out for lunch, then walk back in at 12/13:59:50. And every single person would stand up at 17:30 and go home.\n\nNobody said a word, nobody made a fuss, everyone just followed the clock perfectly.\n\nAfter 3-4 weeks, the boss announced a new flexible working policy allowing staff to work 30 minutes around scheduled start/finish times without permission, as long as they made up the difference within the same day (eg no leaving early unless you started early, if you arrive late stay late)",
            "This is so cathartically relatable to me.   I have a research job where for some reason my company has us all pick a specific 8.5 hour window to work during.  But our job does not have any reason, apart from meetings, where it matters at all what time we put in the work.\n\nUp until recently, I had been routinely staying anywhere from 30 to 60 to sometimes 90 or more minutes late just to get things finished when I was on a roll.  Didn't strictly have to, but I like my job well enough and sometimes when I was in the middle of stuff I just wanted to keep rolling.  Because I'm contracted to work 40 hours per week and I always go way over that, I tend to not sweat it about being 10-15 minutes late for my start time, and nobody has ever cared.\n\nWell, anyways, a few weeks ago, my manager sent out a very rude email to a few of us saying that she knows we have not been following our scheduled working hours, and that we need to start doing so immediately.\n\nAt first, I was super angry.  I was like, \"Okay, it's fair to want us to be on time for this arbitrary meaningless start time if you want to, but can we at least acknowledge that most or all of us way more than account for this lost time by staying late?\"  I considered sending a polite message back pointing this out to her that we're working more than our contracted hours, and the fact that this was a hard requirement had never before been made clear to us.\n\nBut then it hit me.   Her email said to \"follow our scheduled working hours\".  So, every day since this happened, I've simply arrived right on time or a few minutes early, and then left at my ending time, TO THE MINUTE, regardless of what I was in the middle of.  A couple of other people are doing the same.  It's fantastic, and I get such savage pleasure in the fact that my manager's own unnecessary pettiness has cost her hours upon hours of productivity every week.",
            "You are legally entitled to all the pay for hours worked past the end of your shift. Write them all down and ask to get paid for it. If they refuse, speak to the Dept of Labor for your state.",
            "I had a manager like this, but I did get paid overtime for any extra time worked. I was usually pretty conscientious and would try to get my work done within my shift whenever possible. Sometimes I’d even let it slide if the OT was less than 15 min. But once he started complaining about the few times I walked in 1-2 min late, you better believe I clocked in and out for exactly what I worked and made him justify my OT to his boss.",
            "I had a job once where we would write down what time we came in and left in a book. He once saw me write in the book I left at 6 when it was like 5:55. Then told me to write down the exact time I leave as we were paid by the minute. So I did 6:05 6:09 6:07 (I'm making up the times as was shift work but you get the point) after a couple of weeks of this he came to me and said you can just round it off.",
            "[deleted]",
            "[deleted]",
            "My previous job was like this. The last three months I was there they had decided that the 5 minute grace period policy was unnecessary and held all the non-management employees accountable for the new policy change for the previous year. Even went as far as printing out everyones time sheets and highlighting any \"late days\" during a company wide meeting. This was one of their many mistakes and they had to hire a completely new staff before the end of the year.",
            "Boss tried to tell us that we needed to be on the job site 5 minutes early, but couldn't write those 5 minutes on our time sheet. \"So you want us here 5 minutes early, but we're not going to be paid for those 5 minutes?\" \"Yes, you need to be ready to work *at the start of your shift*\" \"that's illegal, I'll be calling the labor board on Monday to report wage theft if you try to implement this system\". Never saw a manager stutter, turn purple from holding back her rage, and backpedal so fast... she would have effectively stolen (from my shift) 20 minutes/ week per staff, and we had 12 staff so... 4 hours of time? Yeah. She ended up getting demoted for other things later on. She also gave me my only bad evaluation ever because she would bark orders at people and I told her \"do not bark orders at me like I'm a dog that pooped on the carpet in your house, because I'm not and you don't pay me enough to treat me that way\" so my evaluation said I had a \"poor attitude toward authority\".",
            "Love your username, btw.\n\nThis reminds me of a story I've told here before. I was the transportation manager at a previous job. Like all managers there (and most other places I've worked), I stayed pretty busy and took breaks when I could instead of at scheduled times like the lower level employees did. This usually amounted to me skipping lunch or eating at my desk, and taking maybe a half dozen 3-minute working smoke breaks during a 10-12 hour day. During these breaks I was usually talking on the phone with customers or other employees, or working with other employees in person.\n\nApparently someone complained to the GM that I took too many smoke breaks, and he informed me that, despite the fact that other managers didn't have break schedules (even managers of lower rank than me), I was now to follow the break schedule of the warehouse. (I didn't even work in the warehouse.)\n\nSo my maybe 15 minutes of working breaks per day turned into a one hour lunch break and 30-45 minutes of 15 minute breaks where I completely shut down and refused to work.\n\nWithin a week enough people had complained about my lack of availability that I was asked to go back to my previous method of taking breaks.",
            "Had a boss who sent me a SMS like 3 minutes before I got there because I usually come sooner.\n\nFrom there, I strived to be \"on time\" both for clock in and clock out.\n\nThat's the most stupid thing an employer can do.\n\nIn my current work, I simply shift my clocking out accordingly. It's that simple!\n\nSometimes I need less than the 8 hours, sometimes more. I do accordingly too. Just trying to not overwork and being honest. (no hour teft)",
            "[deleted]",
            "I'm regularly 5 - 20 minutes late for my shifts. I'm a backshift worker mostly and the roads are generally bloated with traffic when I leave for work, but if I leave earlier, I usually beat it and am far too early and get made to start immediately. It's regularly brought up that I'm always late, people like to huff and moan, but when asked about it, they don't really have a retort to the fact that I stay easily an average of 30 minutes extra at the end of each shift. \n\nTo the end that, when we recently got a new system for clocking in and out, an owed hours test was carried out. Most people earned between 4 and 40 quid based on their trends throughout the data collecting period. I earned over 300 in extra minutes here and there (in a single month) before the new system came in to play. Now we have a log and are supposed to be 1 minute early for shift... I'm owed many many hours according to this systems data. \n\nI'm in the same boat as OP, though. This is not a career place for me, though I'm often the top employee and help to train staff, having passed up promotions to focus on school. Only difference is, my manager understands the difference between regularly late and regularly works more than is paid even though it's slightly offset.",
            "I used to work for McD. They're very on the clock, to the literal second. I have had different sex manager entering the loo while I'm taking a shit on my 15 minute break, to call me to \"come back\" cause my \"break is over\". In the middle of my shit.\nAlso, at McD is how I realised I was lactose intolerant. I stopped having the free hot chocolate on my breaks.\n\nEdit: added final sentence",
            "Had an issue where an accident blocked 80% of the employees from getting to work on time. This included supervisors and manager. Everyone literally walked in at the same time. Manager was all smiles and hellos and darn that accident. The manager forced the supervisors to point everyone who was late.",
            "You need to keep at this until he breaks and starts making threats or swings a fist at you.  Don't let him apologize.  He 100% WILL pull this shit on other people if you do.",
            "Guys at my office who do in house work had the same rule - 5 minutes or less and you're good.  One sup decided to stand by the door and start writing up everyone for attendance starting at 7:36.  But being 6 minutes late was now the same as being up to 4 hours late.  So one of the guys - who had worked really late the night before, just looked at him and said he would be back at 11:30 since 4 hours = 6 minutes.  Sup tried to do more to him than an attendance hit - HR didn't agree and he stopped being a dick about 7:36.",
            "I had a buddy that would get written up and in trouble for being 5 mins later, however you could call out without penalty.\n\nSo sometimes when he was on the road, if there was bad traffic he would call out and then call us to see who was available to hang out.\n\nDumb system.",
            "Used to work at a factory that had that same 5 minute grace period. If you were late between 6 minutes and 4 hours you received a half a point. \n\nWoke up late one morning and was rushing to get to work, ran through security and up to the time clock to see I was at 7 minutes after shift start. Turned around without clocking in and walked back through security and went back to my car. Went home slept for 2 more hours and then went and had a nice breakfast.\n\nIf I'm getting a half a point regardless I'm gonna at least enjoy my morning",
            "My solution would be to ask to see the updated employee handbook and the memo from.corporate changing the attendence policy.",
            "(I like that you typed combustablegeoduck in your narrative.)         \n\nI wouldn't want to swing ducks with you, either.",
            "Rockstar performance you say? Probably unrelated but that phrase just gave me dark flashbacks to working at Old Navy",
            "My former boss used to do exactly this. I was 10-15 minutes late, which she wanted to complain about. Yet, I regularly worked past my scheduled shift because we were short-staffed. She hated paying employees past closing time, so all the closing time work was shifted to the supervisors. It sucked.",
            "Not one employer is as anal about ending a shift on-time as they are about starting it on-time. Glad you sent a message.",
            "best looking employee ON PAPER",
            "If I'm not clocked in more than 15 minutes before my shift starts, I'm considered late and docked an hour's pay. Guess I'll just sit in my car for the next 45 minutes and try again",
            "I know how this feels. Used to have a 30 min commute to a job I had, with no traffic. Traffic in the area, however, was very unpredictable. \n\nOne day I show up about 10 mins late. Not a big deal, my schedule overlapped with a coworker so there was someone there either way. The next time I see my manager (worked at a park and she was only there one day of the week I was scheduled), she chews me out and threatens to fire me. A bit intense for a first time offense, but okay it wont happen again. I made sure I started leaving with time to spare and got there a bit early from then on out.\n\nOne day, I get in about 20 mins early and decide to go ahead and clock in and get to work. I figured, \"sure I'm early, a bit, but I'm working so what's it matter?\" Well, manager lost her shit at this, changed my time card so that I clocked in at the start of my shift and not early, and threatened to fire me if I did it again because I wasn't \"allowed to clock inearlier than what she scheduled me for.\" She made sure to mention I was more than welcome to get to work early, I just cant get paid for it. \n\nThis was not my only job. By this point, I was regularly working 55 hrs at my other job and scheduled between 20 and 30 there weekly. No way in hell was I working without pay if I'm already at 70 hour weeks. The next time I got there that early, I walked in to the office (it was winter at this point) and sat my ass down in a chair to enjoy the heat. Manager happened to be there that day, and asked me to get to work. Informed her I wasnt on the clock, and since it was too early for me to clock in, I would be enjoying the heat as opposed to freezing my ass off for no pay.\n\nI quit shortly thereafter. It was a mix of this and her scheduling me at days/times that we had agreed upon at the time of my hire that I could not work (I was at my other more important job at those times.) It would be one thing if she had just fixed the schedule the 4 or 5 times she did it, but instead she told me that it was my problem and if **I** didnt find someone to cover then I would be in trouble. Ducked out quick with those 2 things combined.",
            "I no longer work at this organization but I do know to this day, this one manager makes his staff send him an email in the morning and afternoon to show what time they arrived and left.  These are \"salaried\" employees but in reality were treated as hourly, we were called that so we didn't get overtime but rather comp/PTO.\n\nIf we were late, say 5 minutes, we'd typically just work 5 minutes after our time. One day, a group of us went to a restuarant for lunch, we didn't invite the manager but he and another group ended up at that same restaurant. My group left before his did and were back to the office working before he and his group got back. We got an email that we were late from lunch and we owed him 15 minutes from our comp or vacation time. When we pointed out that the email wasn't including his group who were later, he claimed he would send them a separate email. We all opted to just stay 15 minutes later.\n\nShortly after that he had a staff meeting that said if we were even 2 minutes late, we owed him 15 minutes of our comp/vacation. I told him then if I worked 2 minutes past my time then I was putting down on my time sheet that I worked 15 minutes of comp time. He argued that I couldn't do that and I told him I was following his logic of rounding up. The rest of the staff complained as well and the idea was trashed before the meeting was over.",
            "The bosses who get pissed off at employees showing up a few minutes late are the same ones who expect free overtime.  They complain about how fast employees disappear when their shift is over.  The boss has trained their workers to watch the clock.",
            "My boss always talks behind my back..on how im 5 mine late to the floor every day [never to my face] doesnt ever thank me for staying 2 hours after my shift every. Singe. Night. Man i wish she had the balls to say somthing so i could try this.....o e more week n im outta there",
            "Some managers don’t understand that they need to adapt to their employees and lead by example. It’s the easiest way to get your employees to buy in.",
            "I had a manager do this once.  The store opened at 9am but he wanted everyone there at 8.30am.  Some people didn't make it there until 8.35 or 8.40, but would regularly stay until 6.30pm helping customers (unpaid, store closed at 5.30pm and so did wages).\n\nBoss got annoyed and put his foot down, and employees promptly started leaving at 5.30pm on the dot.  To hell with customers.",
            "People who ask for tl;dr ... Do they read it like the back of a book cover to see if they want to invest the time or do they just want the cliffsnotes version of everything?",
            "I was reading this on the train and went past my stop so now I'm late because of reading about others being late, And my stupidity haha",
            "I had a new owner takeover the deli I had been working at for years. He was a businessman and didn't know much about how the restaurant world worked. All he knew was numbers. So naturally we butt heads. \n\nHe tried to get me to quit a few times by bringing in someone else and reducing my hours but I didn't give a fuck, I had money saved up and knew those newbies would fail at all the tasks a was responsible for. Eventually we got along enough for mutual understanding but he finally got me when he docked my pay for coming in late. I was there every day at 5 a.m, would prep, turn on the computers, and clock in with a note to adjust my time. He also said he wasn't required to pay me overtime. \n\nAt that point, I broke and said I'm not one of your 17 year old girls you hire who know no better. You're going to pay my full pay. He fired me over my \"lateness\" but I got my overtime and unemployment for like 6 months.",
            "He’s intimidated by you and insecure about it. I’d start gunning for his job.",
            "the fun ones are always the shifts that say 4pm - Close. Because Close is an undetermined time that varies every single day /s",
            "Good stuff, fuck the time freaks.",
            "My current job has an electronic time clock, which records to the minute, but they round everything to 15 minute blocks.\nClock in 2 mins late you lose 15.\nClock out 10 mins late you don't get paid for it.\nSo now everyone walks up to the time clock 1-2 mins before clock in, punches and walks in, and at knock off time there are 5-10 people at the clock 2 mins before it ticks, and as soon as it rolls over they all clock off and walk out.",
            "I had a friend I worked with in retail who was hauled into the managers office one day. This guy was one of the best employees in the store so it was bit of a surprise to him and everyone else.\n\nHe said that the manager pulled out a ridiculous list from the past year of his clock in times and asked about every single one over the start time. \"why were you (3 mins) late on this date?\" over and over.\n\nHe said he felt like quitting right then, and left shortly afterwards when he found a new and better job.",
            "I had a manager exactly like that, he would chose to ignore early starts and working back. So every week he would call a progress meeting in a room we all could see across the hall. But what he didn’t know was the lady in charge of room bookings in this big corporate building was a good friend of mine, and I would ask her to change it at the last minute (we’d go one floor up) and leave him off the invite list. \nThere are ways and means within the corporate structure to wreck vengeance against brain nosing managers like him, like bombarding them with policy questions, organising a lunch room sit in so the floor looks empty and non productive, swapping out loan laptops with broken ones from IT (which he had to sign out), getting the office mailing list to include his home email address as well (that took a bit of doing)",
            "I had a boss so stingy that he would fine you if you were late and charge you rent if you were early.",
            "My rule as a manager is always \"praise in public, punish in private\" You always build your employees up in front of other people, if something needs addressing you do it in a private setting so no one gets embarressed. That said I was raised on \"five minutes early is five minutes late\", if you were always a few minutes late I'd definitely haul you aside for a chat",
            "Retail manager here. In defense of my fellows, it's not always us. I don't personally give a shit if my employees are a few minutes late, but I have bosses who breathe down my neck over that shit, so I have to enforce what they tell me to. It sucks, but everybody has to answer to somebody.",
            "well done!",
            "Did you typo your username?",
            "Old manager used to tell us that not being there 10 minutes before you punch in meant you were late. It meant nothing but he would complain about it all the time",
            "> I don't get paid overtime to work after my shift,\n\nBut you do get paid overtime if it's over 40h for the week and until then you get paid straight time for working after your shift, right?\n\nThis is assuming USA of course.",
            "And my boss gets mad when I tell her “sorry, I’m clocked out, no can do” after staying 30min past my shift and she wants me to do something, because *she* (the owner!) sometimes stays an hour or two after. \n\nYeeg. You have my sympathy.",
            "Imagine commenting on a post to ask for a tldr",
            "Fwiw not getting paid OT based on federal law is wage theft and a hecking bad crime.",
            "> \"no, **combustablegeoduck** one minute late is late\".\n\n*submitted 8 hours ago * by u/combustablegoeduck*\n\nUsername does not check out.  :o",
            "You have one thing exactly right, and don't ever forget it: \"we could have talked in private.\" The saying goes \"praise in public, punish in private\" and it's very much a good way to manage. It alleviates embarrassment and resentment for employees misbehaving, while also making them feel good about performing well.\n\nYou will make a good leader.",
            "Swing dicks\nThat's a new one",
            "Most often people quit because of managers, not the job itself.",
            "When I worked in a warehouse my boss realized that I had a habit of walking in 2-6 minutes late every day. He pointed that out to me (kindly) and I reminded him that I hadn't left within a half hour of my shift end more than twice in the last month, and could change that if it was important.\n\nHe said I was fine doing what I was doing. We both laughed and got back to work.\n\nHe was a good boss",
            "The only time that \"minute late is late\" mentality is legit is when someone is waiting on you to be relieved. Otherwise its so stupid.",
            " \"no, combustablegeoduck one minute late is late\". So I stopped my task and calmly asked him, \"then what does it mean when I'm staying 45 minutes after my shift to help when we're short staffed?\". And he said,**\"we don't even want to have this conversation right now\"**, and left.\n\nYeah because he's fucking wrong smh",
            "So glad I have a job where I dont have to do diddly squat unless I know I'm going to be 15 mins late or more. My manager doesnt give two shits and its amazingly refreshing.",
            "I honestly don’t care if an employee is 5, 10, 15min late, but I also hope that they don’t screw each other over at shift change. \n\n15minutes goes a long way, either way.",
            "Did the same thing when I worked at Best Buy",
            "\n\nIf as a manger, you're okay with 5 minutes late....what if I come in 6 minutes late? or 7 or 10? And if you don't say anything to the guy who came in 6 minutes late but said something to the guy who came in 7 minutes late, is that fair?",
            "My first day on my current job I rolled in eleven minutes late. I had only gone there once, on the day I was hired, and I had driven there straight from the temp job I was working. My first time driving there from home, in morning traffic, I misjudged how long it would take and then missed my exit. My boss didn't say a word about it. If I need to start early to get the trucks out the door, I come in early. If I need to stay late to get everything done so we don't need to come in early, I do it. It's how every job should be, save for air traffic controller and a few others mentioned in this thread.",
            "who usually pays to much attention when you got in, doesnt look when you got out",
            "I worked for a company for a short period that was insane with their clock in policies. If you clocked in so much as 30 seconds late, into the office you went. It was so insane that one day I tried a new route to get to work that ended up being longer than my normal route and so I had to run to clock in on time. I was able to clock in 5 minutes early but I was still brought into the office because \"if you have to hustle to clock in on time you're doing something wrong.\"\n\nThey fired me two days before I had surgery and I honestly wasn't sad to be leaving that company behind. It may have paid a lot but I'm so much happier at my current job.",
            "I worked at a call center where 5 minutes late was the same amount of points as 7 hours late. I'd have abused it if my commute wasn't 50 miles and the job barely covered gas. If you're wondering why would I take that job, I needed to stay employed for my resume. And it qualifies as \"tech\" experience.",
            "AITA for taking advantage of the punch clock grace period? My manager is pretty good about having us clock in early if we're there and he needs something done, which is fine. However, I learned that our punch times don't get flagged by the system for review if we punch in or out +/- 5 minutes. So I make a point to clock in 4 minutes early and out 4 minutes late. 8 minutes a day equals 1 and 1/3 hours of OT in a 10 day pay period... I'm broke as hell and this job pays garbage so I'll take every little bit I can get.",
            "Oh how I love being salary... no clock-in/clock-out... no “points” if you’re late (they don’t care as long as it isn’t really really chronic)... take a little extra time on your 1 hour lunch to go by the hizzle? Again... not an issue unless it’s terribly chronic (even if they notice)... Feel like shit? Stay home and still get paid... Works out nice 👍🏽\n\n:edit: And no real “overtime” per se... Might stay over 15-20 mins here/there if I’m in the middle of something... Occasionally might come in a little early if I know we’re short that day... But overtime? Nah...",
            "Hmm I smell Geek Squad.",
            "I’m so happy I’m my own boss.",
            "Managers like this don’t want good employees. They want people who they can control and will fuel their power trips. My one job in retail was under a manager like this. While all the sales associates got along great, morale was shit and it was primarily his fault.",
            "At my job, 10 seconds late counts against you the same as being 3 hours late. So if you can’t make it in time, many times that turns into “fuck it, I’ll just be hours late”",
            "Worked for this squadron as admin clerk.  I came in at 7 when the day started at 7:30.  Had the coffee going and guys going out early taken care before the CO showed up.  I was often reading the newspaper when he came in and he never said a word.  I often worked through lunch or ate at my desk took a ten minute lunch.  I stayed late, came in on my days off to day care of guys going to the missile field.\n\nThe CO never said shit.  Gave me a six month eval and said he loved everything I was doing.\n\nMy yearly eval came around and my CO down graded me.  I had messed up one letter  and put it on his desk and he called me in for the mistakes.  Took me all of five minutes to retype it and nothing more was said but, that was his excuse for down grading me. Oh and I read the newspaper everyday.\n\nSo, I figured if I was going to get a lower grade I would give them lower work.  Came in at 7:31, took an hour for lunch ever day, and was out the door at 4:29 every day after that and did no more than I absolutely had too.  I had way to much time in and they had no documentation to do anything to really hurt me so, I was sent to another squadron.  To a dead in job.\n\n&#x200B;\n\nI guess the only regret I had was one day some of the low ranking guys showed up in my squadron looking for some simple forms they should have easily gotten from my old office and I got the forms for them.  One of the guys asked if I could come back because no one in the office would really help them.",
            "The tried this at my last job, what made it better was after about 3 weeks of cars being left torn apart and unable to move (thus blocking half the bays for the other shift) they added cars had to be complete, which equaled to 2 hrs before end of day the shop is almost empty as all we had was 3 hour jobs.",
            "I worked for a pretty big corp doing chat sales and customer service for a few years. Left for awhile, and came back to just do a few month stint there before I moved again. They had an attendance policy where you would get points if you were late, or missed your shift, were sick, etc... even if you used PTO to take time off, you might get points, depending on if someone else had that day off or not. For a team of like 20 people, you can imagine there was a lot of time with overlap. \n\nAnyways, I was pretty much always on-time, worked OT, worked late, I just wanted to make as much money as I could. But Wilco was in town and I just found out, so in the middle of my shift I decided to leave, use my PTO and go see Wilco. It was like 1.5 points, but it didn't matter to me at all as I was gone in a few weeks. \n\nWhat a dumb policy, I don't think they really expected people to just be leaving their shifts.",
            "Never think a company will crumble if you leave a retail job",
            "I can tell just from the term “Rockstar” where you currently work because I work there too. Shit sucks, but you can look forward to getting out after school and getting an actual career. I wish you the best of luck dude, that place can suck a fat one",
            "I gotta start using the phrase “dick swinging” more often",
            "I've worked in many jobs and whenever anyone starts swinging dicks like this, it never works out for them or the company the way they planned",
            "\"Some motherfuckers are always trying to ice-skate uphill\"",
            "So you worked for Big Blue Box, Yellow Tag, big box store",
            "I am a software developer. Last year I changed my job and I went to a place where, one month later, asked us to work some extra hours and a weekend to achieve a milestone. Well, my wife is not working, if I left my job or I am fired during the three first months I can not have unemployment benefit (In Spain works this way, if you left voluntary your last job and in the new job you are fired in less than three months, you do not have this benefit) so I had to drink the Kool Aid. After that crunch, THE DAY AFTER, our bosses complained that we spent a lot of time having breakfast-lunch (it is about 20 minutes, we spent about 40, but we stayed till 20:00-21:00, so it was not a big deal). This complaint triggered:\n\n\\- A coworker left voluntary the next week.\n\n\\- I left about two months later, and because I couldn't sooner. The good thing was that, as I was in probation time, I didn't tell anything til the last moment.\n\n\\- Another coworker left two weeks after me.",
            "you work for JJ's? Great job for college kids. freaky fast baby",
            "Were you at least getting paid when you stayed after your shift was over?",
            "!thesaurizethis",
            "Well as fucked up as it might be, my employer (smiling boxes...)  has a policy that says we can clock in 5 mins before shift and up to 5 mins after the start of the shift, but lord forbid you clock in 6 mins late, they charge you 1 hour of unpaid time, but you still get paid for the time you are on the clock, you just loose the hour of UPT.",
            "I actually had a manager once tell me I was late coming back from break, because it was 2:01 and not 2:00. It literally blew my mind and I didn't get what he said when he said it. I just said OK and left it at that. Cursing him out in my head of course, because it's bullshit. I totally get you though, well done in the way you handled the situation :) I wish I had done the same back then!",
            "It’s gotta be Gamestop right?",
            "I worked an office job that made us clock in and out.  It was the stupidest thing.  I'd get docked six minutes for being a single minute late because they measured it to 1/10 of an hour (six minutes).  But to make it up at the end of the day, you'd have to stay the full six minutes.  And you'd better believe they never paid me for when I came in a few minutes early because my bus was on time.",
            "Report this fucker to the labor board! If you're routinely staying 45 minutes late you must be compensated.",
            ">He didn't want to swing dicks after that.\n\nCan't swing what he didn't have.",
            "Nom nom nom. Gloriously delicious example of malicious compliance. I can feel your shit eating grin from here. Well played, OP. Well played.",
            "I think I know where you work based on your review rating, lol.",
            "Good for you!",
            "Current boss gave me the “We want dedicated people who show up and do more than their 9-5”...yet he doesn’t wanna pay for it. \n\nMy clocking in and out exactly on the beginning and end of my shift times should be screaming volumes at him in regards to what I think of his shitty little powertripping comment.",
            "As a former boss in a large retail store I hate these sorts of dickheads. \n\nI used to work to the vibe of the staff when it came to lateness. Nobody is going to die because someone is late, and it happens to everyone sometimes. But if they are late repeatedly then I would expect an apology or willingness to help out for a few minutes after hours if I needed a hand. \n\nBut here’s the thing. The staff that respected work times were always the ones most willing to volunteer to stay back (to be fair we almost never needed this and I found it relaxing to have some alone time). Having a free flowing relationship I think helps staff respect the work, while being flexible enough to allow for the odd issue here and there. \n\nBut most of the people regularly late would run out the door on the dot. They didn’t stay long. \n\nI’ve currently got someone in my new business who demands people set up for them (part of their job) and then whenever I’ve asked for time to train them (something I get paid a lot of money to do outside of my own staff) they always say no or to be paid to be there. \n\nI’m literally helping them to get extra qualifications that could be used outside of my business (which would also mean I could increase their pay rate) and yet they want to be paid for the training.",
            "Combustable Geoduck is just a fancy way of saying Explosive Dick",
            "Your writing is very entertaining, well told!",
            "my current job has an official policy, 'clock in one minute late and you are late. so every time im late its 15-30 minutes.",
            "This was at a Best Buy, wasn’t it?\n\nEdit: checked your post history, now I know for certain wether it is or isn’t",
            "Best Buy?",
            "I feel pretty confident this was an apple store. \nThose guys and their attendance policy is absurd. I could rant and rant but I won’t. Ugh.",
            "My family own and operate hotels. The employee were getting there friends to punch their card because theyre running late or something so my uncle wanted to buy an expensive fingerprint card punch machine to stop them from doing that. I just don't get it. It's a few minutes late.",
            "Had a job where if you clocked in a few seconds early, it was \"time theft\", but if you clocked in 2 minutes late it was late. Thing is, lots of shift changes happened when it was busy (lots of customers) and we had to use the registers to punch in, and also a lot of people started at the same time. Meaning we couldn't be early even by a few seconds before the minute changes, but also we could end up having to wait 4-5 minutes before everybody is able to be clocked in, and then the managers complain about everybody punching in late.",
            "Someone wanted a TLDR, and you complied?\nNot very malicious",
            "I'd keep pushing it and make them regret it severely. Give fellow employees a sense of the power they truly have.",
            "I'm very fortunate and glad that I got out of the space of extremely strict time constraints. Though I wish I had a little more firmness and structure, being able to waltz into work at 10 or 11am and just stay later is very nice.\n\nFuck I hated my old job. 😅",
            "I did this at my last job, I was always 30 mins early, covered all shifts, stayed after to work 12 hour shifts if someone called out, in total I worked at that store for 4 years. Shit hit the fan with me and my manager some where in the 3rd year and I clocked in and out exactly when I was scheduled and never answered my cell phone if the store called me during my off hours/days. Wasn’t appreciated enough to putting my entire life into that job.",
            "At my job, only one other employee is able to get to work on time besides me. Because I live out of town and have to travel a highway to get to work and never know what traffic will be like, I leave early and always, to this day get into the parking lot at 20 minutes til my shift starts. Until about a year ago I would go inside and immediately start work at 15 minutes before my shift actually started and leave at 10 minutes before shift over. Well my supervisor got ticked one weekend when she had to cover a shift because someone called in sick (on my normal days off) and I couldn't. The next Monday she pulled me aside and told me (lied!) that someone had gone to our boss and complained that I was leaving early and that I couldn't do it no more, using the excuse that I was making my own schedule. So now Instead of the company getting 1 hour and 20 minutes a month free labor from me, I sit in my car and watch the clock til it hits 4 minutes til and then walk in the door..smh",
            "Bestbuy? Lol",
            "Sounds like a Best Buy",
            "I spent 8 years working for a company that by the end of I was pretty sour. We used to work a little late for no extra pay so i didnt have to deal with certain stuff when i came in in the am.\n\nOn fridays we'd go to the pub for 2 hours at lunch (instead of 45min entitlement).\n\nI always wanted my manager to raise it as an issue so i could drop a steamy heap on it. But in reality my manager was pretty chill so i never did.",
            "‘Late is late’ but ‘rules are rules’ is better.",
            "Have this exact same issue at my job. Once stayed behind 15 minutes unpaid to get a job finished before we opened the school the next day, as hanging wires can be dangerous for children. The next morning i was one minute late due to some temporary traffic lights that had gone up for roadworks and my boss put a late point next to my name. \n\nNow i make a point if at 3:59 i’m waiting by the door with my bag packed waiting to go",
            "Where my wife works, they have a point system, half for late, 1 for calling, 2 for no call no show, 6 points verbal, 8 written, more that 8 fired(unless you have a connection or relation to management).\n\nSo if you’re going to be late and don’t need every last dollar of your check, a lot of employees will come in at the half way point of their 8-12 hour shift because it’s the same amount of points.\n\nI understand that you want your workers to just be on time, but it’s hilarious when it screws up their high priority orders.",
            "This story reminds me of a buddy.\n\nBear in mind I live in South Africa, not the States so a) no safe kid-useable public transport and b) BIG distances to drive to and from work for most people and c) Kid will still be in the catchment zone for where you LIVE not WORK unless you can afford private, which my bud couldn't.\n\nMy buddy had to drop kid at school. There was someone at school for dropoffs from 06:30 (8am start), but that was the absolute earliest anyone was about. She was supposed to be at work 50min drive down an accident-prone, congestion packed highway. Most days she made it, but there was a decent chunk where she'd walk in at, say 07:35 or 07:40. 5 minutes! Le gasp! But she, like you, was one of their rockstar-level performers.\n\nShe's still, despite actually chatting this over with the Big Big Bosses, getting permission to be there occasionally a little late as long as it's within a reasonable margin (most people are decently understanding about our shite transport system here) etc etc, has a couple of middle-management dick swingers who want to fuss like hell over those 5 minutes.\n\nEvery time they try to dick swing to higher management... cos she flat out said she appreciates her work and does her best but she's not leaving a minor standing at the side of the road just for a job... they get told to get back in their lane and shut up.  \n\n\nShe says it gives her a little glow every time :)",
            "I got in trouble for being late once, I clocked in one second before my shift started. I looked at my supervisor not knowing if she was being serious or not. That shit ruined my night, I know how you feel",
            "You did exactly what I would have done, good on you",
            "This is my job, which I haven't had for very long. My manager is basically a \"if you're on time you're late\" type and a major control freak.\n\nSurprisingly I'm looking for a new job.",
            "I usually believe that when your work starts, let's say at 8, by that time you are already ready to begin, so for example if your worked with a computer by 8 you should be logged in and already typing. So whatever you need to do before to assure you'll be on time is your responsibility and so the \"late\" policies are right. Work ethics. (if you were paying someone by the hour, let's say a lawyer or a handyman for example, you wouldn't want them to charge you for their coffee time, or because the subway was stopped so they begun your time earlier) \n\nHowever, when they expect you to stay longer, or give extra hours of your life, without proper retribution, that is completely unacceptable, if you want to reinforce being on time then also leaving on time should be a given. \n\nAnd if the job allows a 5 minute window, then the person in charge shouldn't be micromanaging and just trying to have the employees punished for something that was allowed. Good that you stood up for yourself.",
            "At my job, being one minute late is a lot worse than some other pretty poor work practices across the office, in a variety of departments. People get admonished for being a minute late, but never thanked for staying an extra 20 minutes, funnily enough everyone leaves on time without fail now.",
            "My Dad worked at a place in the 80s that only had one time clock. The manager decided that even though the employee manual said 15 minutes after was still on time (a rule he hated desperately), he decided one minute after was late. \n\nHe was also *extremely* adamant that no one was allowed to clock in before their scheduled time as that would result in overtime, which is the Cardinal Sin of hourly work. \n\nThe manager though, couldn't quite understand why so many more people were being logged as late now that his policies went into practice. Now that this place had some discipline, it was getting worse. \n\nWhat he could wrap his Upper Manglement mind around was that 110+ employees couldn't physically clock at *exactly* 8 A.M. It just isn't possible. The large staff and single time clock is the entire reason there was a 15 minutes before 8 AM and 15 minutes after 8 AM grace period in the first place. \n\nHe still tried to write people up. When people started refusing, eventually his bosses got involved and the policy was over turned.",
            "I just show up 15 minutes early so this is never a problem. Been that way all my life, hate being late.",
            "I'm proud of you for not taking his shit."
        ]
    },
    {
        "post_id": "j3vvvm",
        "author": "None",
        "title": "Boss micromanages even though she doesn't know my field, I finally stop arguing and do it her way, and it doesn't end well",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/j3vvvm/boss_micromanages_even_though_she_doesnt_know_my/",
        "score": 17245,
        "num_comments": 383,
        "created_utc": 1601650252.0,
        "selftext": "I am the sole communications/social media person for a small company. I went to school in this field and have done it professionally in a few different spheres. My boss, on the other hand, doesn't even know what a Facebook or Twitter page looks like or what any of the buttons do. Yet she still micromanages me all day every day and I'm going CRAZY.\n\nI always schedule our email campaigns spread out enough so that people aren't getting bombarded (generally one per week at most). This is one of the most basic rules of comms and should be common sense even if you don't have a degree in this. Multiple times she has demanded that I post something immediately even though the next few slots are already filled with posts that are more time-sensitive. She always tells me to just send both in the same day and I have explained to her numerous times that that's a terrible idea (in nicer terms).\n\nWell, I gave my two weeks notice this past Monday, so I don't care anymore about fighting for what's best for the company. This time, I said I was going to push back each of our scheduled posts by one slot so we can post the listing for my job vacancy immediately, because for once the new post actually is more time-sensitive than the others. Once again, she tells me to just post both the job listing and the one originally planned for that day. \n\nFine! I sent out both. It's been three days and we've already lost 11% of our subscribers and nobody has yet applied for my job since that listing was buried.\n\nI present stats on the success of our email campaigns, website, social media, etc. once per week to my boss's boss. I look forward to explaining this drop to him in a few days.",
        "permalink": "/r/MaliciousCompliance/comments/j3vvvm/boss_micromanages_even_though_she_doesnt_know_my/",
        "comments": [
            "Its like my wife posting links, or sending me and the kids links to read. If you send 1 or 2 a day, we'll read them. When I check my phone and theres 10 in the last 2 hours, it loses gravity and we dont click any of them.\n\nShe gets mad but even the kids say stop spamming.",
            "Once worked for a company like that. Whole company went through a improvement plan, with objectives for every department. While some made sense, like reduce downtime or improve quality checks passes, internal communication had a single objective, which was literally \"increase number of emails, from 5 a month, to 30.\n\nOvernight, the weekly recap of what the big wigs were up to turned into the daily spam of useless shit. We all had a rule in outlook after that, routing those mails to a dedicated folder, named\" internal com\" for the polite ones, or \"IDGAF\" for most of us. Really helped the company.",
            "I don't work in comms but I work on a lot of projects that involve creating things for general public consumption, done in collaboration with people who aren't used to creating things for general public consumption. What frustrates me is that people refuse to use an ounce of self-reflection with this kinda stuff. \n\nYour boss knows that she scrolls past, ignores, or gets annoyed when she gets multiple emails a day from the same entity. People know that if they come across a bunch of signs in a row that all have like an essay's worth of text in 8 pt font, they aren't reading it. People know how aggressive and annoying it is when a social media graphic is like neon orange all caps bold underline weird stray quotation marks. But when the email/sign/graphic is coming from them? Suddenly it is the most important thing in the world and we MUST get it out IMMEDIATELY and with ALL THE TEXT and hey let's make it AS BRIGHT AND FLASHY AS POSSIBLE so people see how important it is!!!",
            "We will definitely need an update :)",
            "[deleted]",
            "Yes please update us on this thread! Need to know the outcome!!!",
            ">I always schedule our email campaigns spread out enough so that people aren't getting bombarded (generally one per week at most). This is one of the most basic rules of comms\n\nCan you pass this info along to, like, everyone else? I get so sick of the constant spam from places I ordered from or donated to once and specifically made sure to uncheck the \"Yes send me updates!\" box which is apparently just for show.\n\nUnsubscribe!! STOP\n\nI actually do social media for my company, too, but I have to share the responsibility with our \"PR\" guy. Who doesn't know how to use twitter. (He will send me a screenshot of a tweet he wants me to retweet... just send me a link so I don't have to hunt it down???)\n\nI look forward to an update after you report the data to boss's boss",
            "For those who are hoping to get into management...\n\nIt's important to learn the basics of the jobs you supervise so you can understand what you are talking about, or cover for them in an emergency. It's ok to ask questions. Ultimately, though, you hired them to do the job. Let them do it. If you can't trust them to do the job, replace them.\n\nMicromanaging will destroy you AND your employees.",
            "Once per week: Acceptable  \nOnce per day: Depends on what for, Tolerable\n\nMultiple on a day? Nope, that's a no brainer.",
            "Ha! Been there, done that and I'm being there again.\n\nIn my case I gave up on trying to make the boss understand, so now I'll put whatever he wants as priority. Now I have a backlog of 6 projects that are all top priority, but none are near finish.\n\nNot my problem.",
            "I'm going through email bombs daily now. With my kids in virtual school due to the pandemic the school started sending emails about assignments, classes, and general announcements and news.\n\nThe problem is, every single teacher send separate emails. Every assignment. Every zoom meeting. Every update/announcement/etc.\n\nIts absurd how many emails I get from school teachers now.",
            "[deleted]",
            "Been there before. I worked at a chicken factory and was covering a position I had previously held. The job was to regulate the flow of birds onto the line so production could flow smoothly. \n\nThings are moving smooth for the first few hours, then the supervisor decides we’re not moving product fast enough. I tell him if we run anymore birds they’re going to be spilling in the floor. He insists I let it run no matter what. Finally I said fuck it. Not my job anymore anyway. Three lines went on break about 5 minutes later. The birds backed up, the conveyer got so clogged it stopped moving, chickens kept dropping. The entire production line had to be shutdown three times that day as chicken rained from the sky and I just stood there with my arms crossed daring anyone to even look at me.",
            "Hahah great malicious compliance. Although since most of the bosses in our field are less literate on social media and all of the stuff we have to do behind the actual post, I would suggest you to arm yourself with tons and tons of information to support your recommendations. I work with digital and social media since 2009 and my whole life was like this. I’d always defend my recommendations and at the beginning of my career my bosses were all like your soon to be ex boss. It’s so stressful and frustrating to see a campaign or whatever sinking because your boss didn’t believe what you said and you know deep down that the results could have been different if they just listened to you.\n\nOne thing that I started doing was gathering research and trend reports, as well as campaign case studies that show the success of the campaign because of whatever I wanted to recommend. Some approved but, well, we don’t win every time and although that’s frustrating, we have powerful reports after to show what didn’t work and why and point that hey, we have to try a different approach next time. \n\nI hope you get a better boss on your next job and actually learn from them. It’s terrible having a boss that doesn’t know how to evaluate and criticize what you’re doing in a way that lead you to grow.\n\nKeep doing the good work and someday (hopefully soon) people over you at the agency will recognize your work and start coming to you more often for recommendations. Good luck! \n\n(edit to add the last paragraph)",
            "I’ve always wondered why a company will select a specific person to do a job, after likely sifting thru multiple candidates and YOU YOURSELF chose this person as the best individual for the position...\n\n...and then not trust them to do their job. \n\nHappens alllllll the time in my line of work (management of Michelin-level restaurants).\n\nThen they’re just FLABBERGASTED that nobody stays in the job more than a few months.",
            "Yep, sending me more than one email per week is a darn good way to get me to unsubscribe from all emails. I've done it many times before. Good luck in your next position!",
            "Jfc. I could have written this. The other week I had to write a pitch on *why I should be allowed to use the Instagram account for our company*. She says it’s a waste of time. She proofs all of my emails before I send them out. She sends all of the design work (I have experience in the field, and access to Adobe suite on my work computer) to an incompetent third party supplier (who charges an exorbitant amount per hour and just happens to be her best friend), which means any visuals for social media or email campaigns take days to be created when I could have done it myself in 30m. I feel you friend and I am *so glad* you’re getting out!!!! ❤️",
            "We have a guy at work who doesn't like our union. It's a good union, but he doesn't like it.\n\nEvery time they email him, he replies \"unsubscribe\". They explain how they can't just unsubscribe him, to which he replies \"unsubscribe\".\n\nHe drives them so batty!",
            "As a mechanic, I learned long ago that it's better to do it the boss' way the first time, even if you know they're wrong. If they're right, maybe you learned something and the boss thinks you're a good employee. If they're wrong, \"boss told me to\" and your hands are clean. Win/win. If they're wrong often enough and you know the right way, maybe you get to take their place. Win/win/win.",
            "I work in the same field (content marketing which often oversees social) and I know too well this “why bother with timing?” The entire success of marketing is predicated in reaching people at the right time, not wearing them down. Virtually no one seems to realize how much bad marketing is bad for everyone.",
            "My spam email account gets twelve emails a day from the President of the United States of America begging for money...\n\n>This is one of the most basic rules of comms and should be common sense even if you don't have a degree in this.\n\nI felt this part personally.",
            "Yup, if I receive 2-3 emails from a company in a week, unless I've asked for that, it's an immediate and complete unsubscribe.",
            "I hate bosses like that.  I had a boss with half my years of IT experience.   We argued over the network design and I finally gave in and did it his way with warnings about the consequences.   \n\nA few months later we had a scheduled outage at our main office.  All of a sudden we were getting pages about network issues at other sites.   He came in all panicked.   I just smirked at him.  “If you’d  let me do it the right way everything would still be up.”   \n\nI never did understand why they eventually packaged me out. /s",
            "I hope you got her instructions in writing.",
            "Could use more companies that follow the \"less is more\" rule on twitter. If you're a personality or a company, make sure you have a social account that is only for the important stuff. Unless I'm particularly invested in you, if I have to go through 2 of your posts to get to someone else on twitter, I will immediately unfollow.\n\nIf you're a personality on youtube or twitch or facebook, not all of your community gives a damn about how you feel when you wake up, or what you had to eat, or when the ubereats guys are late. They just give a damn about when you submit new content or have a stream up. Keep the chatter to your general account, and your business to your professional account.\n\nFailure to do so means you'll lose people who have been trying to follow you for the content, which means you lose eyes ON that content, so you lose impressions and money.",
            "Update will be needed! Can't wait to see how this goes",
            "As someone from the social media managing industry, a-fucking-men. \n\nIf your subscribers/followers wanted to be bombarded by bullshit all day you would not have hired me dude.",
            "You sound like me at my job except I have an ENTIRE MARKETING TEAM that doesn’t understand this shit. We are seriously sending out emails to the same lists at least 8x a week and our opens are horrendous. But that’s what they get for putting sales people in marketing roles.",
            "This is giving me hope",
            "Keep sending more per day until subscribership increases. \n\n^(/s)",
            "I had two vendors I used to do business with hammer me with spam.  I just turned the mail around and submitted them to spamcop and let them deal with getting tossed on one of the most popular of RBL's.",
            "I'm a bit confused. You send out weekly e-mails to subscribers, but then you're saying that you also sent out the job listing to that same list of subscribers? That seems a bit strange. Why would a company want to broadcast that on the same social media that they're using to entice customers?",
            "Missing fallout.",
            "I hate when I get multiple emails in one day from companies. I've written miffed reply emails to complain about it while unsubscribing. Lol",
            "God, why can’t some companies get this? If I have ten new emails every day and they’re all from the same companies, I’m going to unsubscribe from every one of them. Once a week is way better than once or twice a day.",
            "I had a very similar experience as the sole \"donor development\" guy who knew anything about planned giving (basically, people donating money in their wills), I inexplicably was given an office in the grants department and was managed by career grant writers who only knew grantwriting and couldn't really fathom that my job was *not* one of outreach but one of responding to specific questions and coordinate the actual transfer of money and stock from the probate lawyers to our accounts.",
            "Just wrapped up a social media manager job last Friday - I’ve been exactly where you are. It sucks.",
            "I unsubscribed from Domino's for a similar reason, they spammed me with the same 2 for 5.99 deal every day...",
            "Don't do them the service of telling them what they did wrong.  Just say some flowery bullshit and leave them in the dark like they deserve.",
            "My cousin does what you do and went to school for it! I think your job is so neat.\n\nAnd as a consumer, I am on your side. I have unsubscribed to so many things because I get too many emails. I don't need 3 emails a day from one company. That gets you unsubscribed.",
            "Update! Update! Haha metaphorical-kick that boss in the ass!",
            "Nicely done doing what you boss tells you to do!",
            "I am just waiting for the update",
            "Yuppers. It seems the people that manage are too busy managing to listen to those that know the job.",
            "Can't wait for the update!",
            "Good job! Please update us after you present the stats!",
            "We need an update to this after your talk with her boss",
            ">I always schedule our email campaigns spread out enough so that people aren't getting bombarded (generally one per week at most).\n\n Bless you. I hate constant emails SEPHORA.",
            "I'm in the same line of work, and I went from being micromanaged at one company to having total control and freedom at my current company.  This MC was so satisfying to read, and I applaud you for it.  Hope your next role is like mine.  It's amazing... and we've been very successful.  :)",
            "I'm a manager and my manager was a huge micromanager.  I didn't quit but after he gave me a stupid suggestion that made no sense (among all the others but this was the one that broke the camel's back so to speak) I did it.  After that he kind of got the point and backed off.",
            "I work for an ESP and this post gave me super-anxiety.",
            "Domino's Pizza is the worst at emails.  I subscribed using a junk email and they send an email every day or two.  The emails don't even have discounts/coupon codes, just saying what is on their menu or a promotion.\n\nOne day I decided to make a rule for Domino's emails and put them into one folder.  Then I selected a random email and searched for that emails' subject in the folder... had 3-4 results spread out over a couple months.  So Domino's sends out the same subject/content email every 5 months.\n\n[Example](https://i.ibb.co/p4m6wGw/pizza.png)\n\nSo lazy.  So annoying.  Ultimately I unsubscribed and haven't been to Domino's in a year.",
            "I appreciate people like you. I used to get 3 emails A DAY from fry's. It used to be 1 a day and then 3. When it was 1 a day I usually browsed around, 3 a day? I just started reading the headline and then deleting it. That's way to many",
            "On my first job, my restaurant owner was really ticked that we were just profiting from our work by 1/3 and she picked through every grocery order, meat order and kitchen tool replacement. My head chef and friend was in charge of all that due to the menu she and he discussed the same year and she just agreed to it all almost a year prior. She decided to take charge and order the cheapest offerings from new places and we started using stuff that was less prepped and lacking flavor. Customers immediately could tell the difference and started dropping off week by week till we were losing money. She then decided to give back charge to my head chef but the businesses we had worked with before were not having it. They upped the price for some things after hearing from I guess a collective market we swapped for a month and we ended up only making 1/5 of a profit for 4 months before returning to 1/3. I left the same year and 1 year later she did the same 1 year after that and had to close the restaurant.",
            "Please for the love of all things good and holy, ***update us, I want more of this juice.***",
            "I have worked for around 10 years in the Social Media field and oh my god I struggle so much with this.\n\nThing is, clients just don't understand the SM language, how it works, why it works. They just think of it as yet another media outlet like billboards, radio or TV, and that the more they have in-your-face presence, the more popular they become. When I try to explain that that's simply not how any of this works (in the nicest, most professional way ofc) they nod and seem to agree but then just go back to the POST THIS IMMEDIATELY AND MAKE THE PIC BIG AND MAKE SURE TO INCLUDE ALL THE INFO AND PUT A HUGE BOOSTING BUDGET THAT SHOULD WORK I TELL YA!\n\nUgh...\n\n&#x200B;\n\nI don't work in this anymore.",
            "So ***you're*** to blame for the gazillion useless emails I get weekly?\n\n> Hey <random person>\n> \n> Did you have a chance to look at my last four emails explaining how our awesome cloud platform you can save you $50/month with only a $2M investment?",
            "I'm gonna need an update for this one",
            "Tell us how it goes! I wanna hear their reaction",
            "Keep us updated!",
            "Explain the drop, explain how out of touch the manager is and say you're on the market for a new job and you should have it",
            "Just cheekily asking for some free advice here but with my instagram (just personal art bullshit) if I have like 5 new things to go, do I have to manually spread them out? And if so, is there some kind of optimal gap?",
            "Since it seems like you want to do my job so badly, now is your chance.",
            "What’s this a cliffhanger?",
            "Same ocean here. I have an entire management team that has no idea how social media posting and email campaigns work. They think a success strategy is posting and emailing multiple times a day every day of the week. I am dead inside.",
            "Emails don’t do shit. I delete ALLLLLL marketing emails that come to my inbox. I don’t understand why marketing people don’t understand that.",
            "I hear ya. These people exist everywhere, sometimes they are CEOs...",
            "Man, you should have kept the story to yourself for just a few days more! how am i going to sit through the weekend on a cliffhanger like this?",
            "Hi fellow Commsie. I feel your pain. Everyone thinks they are a comms, marketing or social media specialist. It’s frustrating. Hopefully you find a better company soon.",
            "Fuck I don't even work in comms and have had to remind our comms staff of this on multiple occasions.\n\nCommon sense is lacking in this world.",
            "So are you talking about a social media POST? Or an email CAMPAIGN. Those are two VERY different things.",
            "I'm slightly confused...did you send two emails in a single day, or two posts in the same day?\n\nIf two emails, then I can see an 11% drop.  Two posts?  I wonder what's really going on.",
            "Omg. My boss was like this.\n\nI kept telling her do not write essays in email. They will read one to two sentences. Max. \n\nAnd sure enough, the board only read the first bit or topic. The topic title was too long too. \n\nAnd no one gives two shits about strunk and white in email. And no, I'm not double spacing after a period.\n\nThat the lord I dont do that now. I just have to spell medical terms proper.",
            "You couldn't wait until after the meeting to post this? This wasn't that time sensitive.",
            "Good job!",
            "Can't wait to read how it ends :D",
            ">doesn't even know what a Facebook or Twitter page looks like or what any of the buttons do\n\npoints in her favor, in any other context",
            "This sounds like basically every boss ever.",
            "I would love to hear about it as well!",
            "Can't wait to see how that goes",
            "I'd loooove an update!!!",
            "Update us and describe her face in detail",
            "would love an update!",
            "Omg I think we work in the exact same place 😮",
            "I can't wait to hear how your boss reacts to it. XD",
            "This is probably the number one thing that makes me unsubscribe from YouTube channels. I don't care how interested I am on your videos, if you randomly post 4+ videos in a day more than once I'm out.",
            "OP you should also consider that the incoming person might not have felt they had the authority to stand up to the boss on day one and just gone along with their ideas. In which case it would look to senior management that the new person is bad at their job. By doing this now you might be saving someone’s future job.",
            "My girlfriend does this when she helps with Reno and construction projects. Keeps insisting on taking shortcuts, than I have to explain things in 7 different ways on why it needs to be done properly.....\n\nApparently I argue a lot when working with her. I call it attempts at logical reasoning, but potato potato....",
            "I don’t read any of the links my family sends me, like shit don’t bother me with that stuff",
            "Someone needs /r/JockoPodcast",
            "Til you can get a degree in social media",
            "Did something happen??? Please update!",
            "Any update? How did the meeting go?",
            "Follow-up pls?  Thanks!!",
            "what hapend?",
            "Update?",
            "666 upvotes. Perfect for maliciousness.\n\nEdit: Or it would of been had some sanctimonious holier-than-thou not downvoted to avoid 666. -.-",
            "[deleted]",
            "Wait. You can get a college degree in social media?",
            " S XX.     Did d.",
            "youve got a degree in posting on facebook? how much did it cost?"
        ]
    },
    {
        "post_id": "vx775e",
        "author": "CheeseLover80",
        "title": "Be Careful What You Say to Children",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vx775e/be_careful_what_you_say_to_children/",
        "score": 17225,
        "num_comments": 696,
        "created_utc": 1657618628.0,
        "selftext": "I have never liked iceberg lettuce, but growing up, that's what we got. Every time we had a salad, I begged my Mom to use less lettuce, and after all my begging sessions, she said \"When you make dinner, you can make it how you like it.\" I was probably five at the time.\n\nI turn eight, and I am now allowed to use the sharp knives. Mom asks me to make the salad for dinner as I am now old enough to help. I took one leaf of lettuce and chopped it up and then put in about a half pound of cheese, every grape tomato we had, and lots of raw onions. When I put it down on the table, she said it was not a proper salad as there was not enough lettuce. My response was, \"Well, Mom, when you make dinner, you can make it how you like it.\"\n\nNeedless to say I was never asked to do the salad again, but I was satisfied that my family ate it that way because they had been bested.",
        "permalink": "/r/MaliciousCompliance/comments/vx775e/be_careful_what_you_say_to_children/",
        "comments": [
            "I think of Amelia Bedelia as at least one of the patron saints of Malicious Compliance (although in the books, she’s written as being totally unaware, but I think it’s an ACT!)\n\nI can remember being a kid and completely thrilled/scandalized by the thought of getting the best of my parents like this, but never quite got up the guts to resist.",
            "As a parent I found out that the best way to deal with the preschool million questions a day phase is by answering a question with a question.  \"Why?\". \"Hmmm, What do you think about it?\". They answer, you get some cool insights into how their brains work, you never waste time telling them about their teeth when they were pointing at their tongue, and occasionally you get some really fun answers.\n\nThe downside?  I come out of the bathroom to discover my preschooler has lined up a dozen glasses on my carpet and is holding a pitcher of RED Kool-aid.  I screech \"What are you doing?!?!\" And the little smart Alec looks me right in the eye and says in the same tone I always used \"What do you think?\". I didn't know whether I wanted to laugh or scream, but I was a good mom and calmly helped him pour one glass and put the others back.\n\nEdit-- fixed calmly, don't know how it came out as can't",
            "Growing up I was NEVER allowed to pick what was on TV, I got the same line...when it's your house and your TV you can pick....well my mother comes to visit me in my first apartment and wants to change the channel to Young and the Restless....I absolutely shut that down! \"It's my house and my TV, we watch what I want!\"\n\nGuess who left? Lol",
            "When I was learning to drive, my Dad was not a fan of having the radio on. He and Mom took us on many road trips, and there were times when we had five kids in the car plus Mom and the dog; he wanted his peace and quiet. We learned to bring books and games and we managed.\n\nThis was in the '60s, when Dad was the boss and we knew it. It was respect, it wasn't fear. Okay, maybe it was a little bit fear.\n\nOnce in a while he would turn on the radio, and then, in the middle of a song that it seemed we all liked, he would turn it off. He would tell us that when it's our car, we can listen to whatever the hell we want.\n\nCouple of years ago, I'm driving my now elderly parents back from my brother's house, not a long ride, only a couple of hours. He pipes up from the back and tells me to turn the radio off. I told him no.\n\nI'm sure you can see where this is going.\n\nLet's just say it did not go well. He got very very angry, and we had very harsh words, which we had not done in decades.\n\nI told him, \"When you were teaching me to drive, you told me that when it was my car I could play whatever I wanted. Doesn't it suck when your words come back to bite you?\"",
            "My mom (Christian) asked me not to practice my religion under her roof, so I didn’t (I went outside).\n\nShe had to move in with me when she was homeless and tried to ban me from practicing in my own house. \n\nI pointed out it was my house and if she didn’t like it she could get her own place.  😋",
            "Iceberg lettuce has all the nutrients of an ice cube.",
            "In Australia lettuce is currently regarded as Upmarket Fancy Food because massive floods have destroyed most of our lettuce crops so prices have gone through the roof as stocks have dwindled.  It’s a bit hilarious, tbh. 🤣🥬🥗",
            "My mom is not a good cook. Two pieces of pepper is too spicy for her. We finally complained, i mean, school lunches were better. Fatty and fried and just not good stuff. She said something like that. Not malicious compliance, but my older sister basically took over cooking for us. It was so much better. I basically went from plain meat and potatoes to healthy near vegetarian and such an array of dishes and spices. We all lost a bit of pudge and felt better. It was almost like lifting a low grade depression on the three kids.",
            "This is actually a valid lesson. Kids should be able to make what they want for dinner. A better response from your mum would be to ask you too put some extra lettuce on a plate for the others, or do it herself. \n\nAs an adult i was cooking for my dad, just meat and veg. He said \"You should cook some spinach\"\n\nSo I replied \"but I fucking hate spinach\".\n\n\"But you eat it? \"\n\n\"Doesn't mean I like it. If you want spinach, you cook\"",
            "I hated romaine growing up and my mother wouldn’t budge. So I asked if I could make my own salad and was informed that if I had some kind of green in it that was fine.\n\nI was an avid reader but had no money. I started collecting dandelion greens. The first night I put them in my salad she flipped out that I was “eating weeds” and I had to show her the book at the library the next day to calm her down.\n\nShe bought me iceberg after that just to keep me from “foraging for my food like an animal.”\n\nI actually prefer dandelion greens and kept eating them, just not around her.",
            "Lol I’m with you ! I will occasionally eat iceberg lettuce but I’d much rather have raw spinach , romaine or spring greens as a salad base. As for toppings, anything goes! I’ll throw fruit in there, fresh veg and even edible flowers !",
            "When I was growing up, my brother and I always left the kitchen cabinet doors open. My mom would always say, “I can’t wait until you have your own house and I can come over and leave all the cabinets open.” Well, my mom never did that. She died a couple of years ago and everyone in a while I’ll see a cabinet door open and think of her.",
            "No cucumber? That was my idea of “salad” when I was little sliced cucumber with some oil, red vinegar, and some salt.",
            "The first time my mom visited me in my own place, I told her she had to put her feet up on the coffee table, because, “this is what we do in my house”.",
            "I only like iceberg because it has crunch, almost no flavor, and is an excellent carrier for ranch",
            "I spent many summers working at a sleepaway camp and the younger campers were experiencing some food freedom for the first time in their lives.  At the salad bar, they would create what we dubbed the \"Brownie Salad\" (because of their age group, not the chocolatey treat!) - Croutons, cheese, bacon bits, and ranch dressing!",
            "When I was a teenager my dad and I had the heater wars. He was the warmest person in the house and his room was also the hottest. I was always cold and my room was the coldest. Most nights I’d get up and turn the heat on. He’d get up and turn it off. Id turn it on and he’d turn it off. \n\nHe’d tell me to go put something on. I told him I was wearing flannel pjs, two pairs of socks and a pull over sweater. What else could I wear while still going to bed? I also had two thick, wool quilts. The first thing I did when I moved out was put the heater on as much and as high as I wanted. Now in my old age it’s the a/c. \n\nYears later as an adult I was helping my mom take care of my dad during the months before he died. He complained that he was cold. I told him to put something on. Unfortunately he was in the beginning stages of dementia so I didn’t quite get the satisfaction I had hoped for. I gave him a sweater though.",
            "clearly your mom has never had a greek or a caprese salad.  Neither of which has ANY lettuce.  ...or potato salad, or pasta salad or tabouli salad...  \nIn fact, what you made sounds a lot like a caprese salad.  YUM!",
            "I have a similar story\n\nDuring dinner one time when I was 6 or 7 years old, if I didn't eat my food my Dad would always say to me \"there are starving children in Africa\".\n\nMy response was \"what is their address so I can mail them this food\"?\n\nMy Dad never said that again",
            "My dad used to force me to wear shoes in the house. He said my bare feet was bad for the floors, and he said that if I used socks only, the socks got dirty. So I had to wear shoes. \n\nI make him take his shoes off at my place now. I’m a grown ass man and still do this.",
            "I often make a salad with tomatoes, cheese, onion, and whatever other veggies I have around at the time.  Lettuce?  Pffft, it's optional.",
            "My dad lived with me for a while after I was already an adult. I got to use the \"when you're living under _my_ roof\" line on him, was satisfying.",
            "Love it! You were obviously a brilliant child!\nAnd not malicious compliance at all but…my elderly parents moved in with me recently and my dad questioned something I was doing. I felt like I had waited all my life to be able to say, “well dad, when you live under my roof…”",
            "/r/deliciouscompliance",
            "I had awful housekeeping skills as an adult because of this shit. Took forever for me to learn how to appreciate myself and my house enough to clean it (adhd aside)",
            "My boyfriends mother is very good at this.\n\nShe knows I eat less spice than the rest of their family, so I'd always get my boyfriend to let her know when I was staying, despite being repeatedly told I was welcome whenever, in case it was spicy or she needed to make sure she had enough food to suddenly feed an extra person.\n\nOne day, all the notice she once again got was me walking in the front door. But this time she'd already but dinner on to simmer, getting it ready early, and had already added so much spice and heat I wouldn't be able to eat it. I ended up with leftovers, and my boyfriend went through a whole dinner of everyone in his family telling him he needed to let them know in future.\n\nHe always lets her know when I'm staying for dinner now. Might not always tell her I'm dropping by at other times if we're going out though.",
            "Reminds me of something I pulled at age 16. It was my 16th birthday, and we were going to go to Chapters/Indigo after lunch. I had been saving up to buy the rest of a book series I loved. Mom promised to buy me something there for my birthday as well. When we got in I knew exactly what I was going to ask for, I wanted the His Dark Materials trilogy. When we got in I asked her and she told me that I could pick 1 Thing. I saw the books I wanted on a table and grabbed all 3. I ran back to my mother, and she looked at me and said: \"I see three things there! I said only 1 Thing!\" I was upset, but I ran back to the table to put the books back. I held the first book (The Golden Compass) in my hands and was doing mental math to figure out if I could afford to buy the other two books (The Subtle Knife, and The Amber Spyglass) and I knew that there was no way that I could. I needed to get Mom to buy all 3 books, but how? That's the moment it hit me, BOX SET!!! \n\nSo, I put the book down and ran over to another table, where I spotted many box sets. I grabbed the Hardcover trilogy box set, but when I saw that the price was $59.99 I damn well knew that that was pushing it way too far! So, instead I grabbed the Paperback trilogy box set, which was only $29.99 \nI ran back to my mother, and I held it up and asked if she could get it. THE LOOK ON HER FACE!!!! So I smiled my most evil grin, and said, \"Mommy, you said 1 THING a Box Set IS 1 THING\" \n\nShe looked at me and yelled: \"YOU LITTLE SHIT!!!! THAT WAS SNEAKY!!! BUT IT WAS SMART SNEAKY SO I'M GOING TO REWARD IT!!! NOW PUT THAT FUCKING THING IN THE CART! YOU LITTTLE SHIT!!!!\"\n\nI was laughing my ass off!!!! It sounds horrible if you read it, but in my house growing up being called a little shit was a good thing. Mom only called us little shits when we out smarted her on something, so if she called any of us a little shit we would run away laughing! \n\nI shit you not, she was SO MAD!!! I could hear her yelling: \"THAT LITTLE SHIT!!! I SAID ONE THING AND SHE BRINGS ME A BOX SET! THAT LITTLE SHIT EXPLOITING MY EXACT WORDING!!! THAT LITTLE SHIT!!!! All through the store. I was laughing my ass off the entire time. (Thank goodness smart phones weren't a common thing yet or else someone would have put that on YouTube LOL) \n\nShe was still grumbling during the entire ride home. And as soon as we got home, she picked up the phone, called my Aunty Lori, and yelled into the phone: YOU WILL NOT BELIEVE WHAT THAT LITTLE SHIT DID TO ME!!!\" I lost it laughing all over again, and I could hear my Aunt laughing her ass off on the phone. She damn well knew that a funny story was coming with THAT as an opener. LOL\n\nEdited for Typos",
            "I'm just amazed that anyone managed to get a child of 5-8 to eat any lettuce whatsoever.",
            "As a teacher I absolutely adore this post. Too many parents say shitty things to their children and the kids resent them for it. People need to know how to respect children and respond accordingly to them.",
            "I love how literal children can be 🤣",
            "Oddly wholesome story, i like how your family even ate it.",
            "I have a soft spot for smart-ass kids. \n\nFunny enough, your salad sounds a lot like one of my favourite sandwhich fillings when I was a kid! Cheddar, grape tomatoes, green onion all chopped up and mixed with salad dressing and put in a pita. Your malicious compliance makes a good lunch.",
            "One time, my dad threw away one of my toys, one that I really liked, and he blamed it on me saying that I shouldn't leave my stuff lying around because he thought it was garbage.  \nLater, he asks me to clean the basement. I got to the laundry room and saw his wallet just lying around.  \nI seriously considered actually throwing that out so that could say the same thing to him. I didn't, though, but I did think about it the entire time I was cleaning.",
            "Username checks out",
            "My folks were always pretty stingey-- like *essence* of peanut butter on toast-- so they'd hit me with the \"you can have as much as you want when you buy it yourself\" \nFor context, I also had undiagnosed adhd, so when I started earning money I started binge eating",
            "Lettuce is fuckin garbage. No Nutritional value compared to other leafy greens and it's just terrible generally",
            "Username checks out. :)\n\nIncidentally, I looked up \"cheese salad\" in a web search and this was the first result: [https://www.thespruceeats.com/cheesy-ploughmans-salad-recipe-434868](https://www.thespruceeats.com/cheesy-ploughmans-salad-recipe-434868). It looks interesting and I'm going to try it. \n\nI've been preparing dinner for the family since I was 8, but I always just made what my mother told me to. Not that I'm complaining, we've always eaten pretty well. I prefer Romaine lettuce to the Iceberg stuff myself.",
            "I don't like iceberg lettuce, either.  I was really happy when I discovered that there were other kinds of lettuce available for salads as I grew older.  Now, I don't use lettuce at all, I use spinach leaves instead.",
            "No, it's not a life lesson. As an adult, I do not eat what I don't like, end of story. Forcing a person to eat something they hate just because you want it is incredibly selfish. The only lesson they're learning is their wants and opinions don't matter when they don't coincide with yours.",
            "I would have gotten smacked for that smart-assness.",
            "I'm not a parent yet, and I believe that I wouldn't say that to my child, but if I raise a smartass like that I will probably be amused hahaha",
            "Buahahahaha I love this!",
            "Well that's a great way to get out of chores LOL",
            "Children are so cute",
            "This generation is going to be doing this to their parents along with secret video recordings to make it saucier",
            "Username definitely checks out",
            "I used to eat whitebread sandwiches with both shredded iceberg lettuce and peanut butter in them. Mates couldn’t comprehend why. Basically it’s in the lunchbox so I ate it, was good though.",
            "I’m not gonna lie, that sounds like a pretty tasty salad you made",
            "My youngest, as we were helping him move into his first place after college, turned to us with the key in the lock and said to dad \" my house, my rules\" I almost lost it 😁. BTW, he has a \"honey do\" list for us each time we visit, absolutely love it!",
            "Ugh, iceberg is the worst lettuce.",
            "“Then put in about half a pound of cheese” well, OPs name checks out then",
            "Absolutely. My mother took it too far. Every time I had a complaint she'd laugh at me and say \"when it's your house you can do what you want\"\nWhen I complained about the way she acted towards me: \"well when you turn 18 you'll be an adult and you don't ever have to talk to me again.\nWhen I had a good relationship with her at 8 or so: \"When you turn 18 you'll have to start paying rent because you won't be a child anymore.\"\n\n????\n\nWell. Wishes granted. \n\nWhen I lived by myself at 14 I immediately kicked her out of my place any time she did something I didn't like. It was so gratifying.\n\nI turned 18 and 3 days later I moved across the country with my online boyfriend.\n\nI have been no contact more or less since then (22 now) except at family gatherings where I mostly ignore her and provide short answers. \n\nI would have no regrets and no remorse if she died tomorrow. Who's laughing now?\n\nDon't say fucked up things to your kids, redditors. Most of these are cute and funny but really, just don't be a dick to your kids. \n\nSending queer love to any kids struggling with a similar situation ❤️🧡💛💚💙💜 it does get better. And don't move in with your online boyfriend if you have a better option.",
            "I like how instead of trying to find an alternative green to try (one better than lettuce because lettuce is boring and crappy anyway), she just gave a snarky parent response. Like at least offer different things instead of the typical \"you'll eat it and like it\" answer.",
            "Meanwhile, so many parents today tell me their kids won't eat this, will only eat that.\n\nDo they not realize they're training their kids to be intolerant and ungrateful dinner guests?",
            "Save the polar ice cap. Stop consuming iceberg salads.",
            "Are you a US senator?  Because this level of deviousness is absolutely brilliant.",
            "What are 8 year olds doing on reddit, yikes",
            "If I talked back my mother punched me in the face.",
            "Raw onions at that age, awesome. I bet you eat everything now. Or you could be Andrew Zimmern",
            "Meanwhile, I just shut my mouth and eat it. That, or vomit upon instant taste.",
            "> My response was, \"Well, Mom, when you make dinner, you can make it how you like it.\"\n\nThis story is so white, LMAO.\n\nIf an Asian kid tried that he'd be [sleeping on the balcony for the night.](https://youtu.be/dZabye0YJGg)",
            "Lucky, I’d get beat if I had the tv a bit too loud.",
            "When i was growing up,  it was always that same line... when you grow up, blah blah blah.   Fast forward to im 23.  Mom says to me,  you shouldnt be driving while on your cell phone.   My reply: well, when you make my car payments and insurance payments,  then you can tell me what to do when I'm driving.   She never said anything like that again lol",
            "Glorious",
            "Frankly I am a bit sad that the salad was so lacking in cheese, but at least you won!",
            "Greek salad?",
            "sounds right, parents are just abunch of hypocrites.",
            "LOL, well-played!",
            "You had me right up until the onions",
            "Epic!",
            "That actually sounds like a pretty bitchin' salad to me.",
            "My mother’s idea of a salad was 1 leaf of lettuce, carrots, onions, cucumbers and in season, tomato",
            "r/usernamechecksout",
            "Who doesn't like lettuce?",
            "Wait wait wait, is OP 8 now? Does reddit have 8 year olds now?\n\nOr am I too tired and this is a \"fast forward and I'm now 8\" type thing?",
            "My parents never let us have any pets. They said, \"When you have your own home, you can have any pets you like, even an elephant.\"\n\nWell, we did not get an elephant. But when my sister left home, she adopted a couple of cats and my parents tried to talk her out of it. She reminded them of what they had said.",
            "I didn’t eat salads up until my 20’s when I discovered the reason I hated them was Iceberg Lettuce because baby field greens are awesome. So is curly red leaf and romaine. I could have saved HOURS sitting at the table, alone, long after dinner was finished and the dishes cleared if I had known there were other options. Ruby Tuesdays salad bar is my absolute fave. Yes, it’s mostly chopped egg, bacon and cheese but I’m getting my greens!",
            "Genus lol",
            "Did you eat the same salad?",
            "I like iceberg best out of the lettuces, but that sounds like my kind of salad. Also I like your MC.",
            "That sounds like an amazing salad, I would love to eat that salad over a lettuce focused salad. Your mom is WRONG, you don't need salad to be lettuce, it just needs to be primarily cold chopped vegetables seasoned with a vinegar-based or oil-based dressing. 8 year old you was a visionary. I bet you love traditional style Greek salad now.",
            "Fitting name u/cheeselover80",
            "Onion, cherry/grape tomato, and Persian cucumber is the basis of my go-to salad as an adult, ngl. Lettuce is never something I put in the grocery cart. Iceberg especially has so little nutritional value, it's only good for adding bulk. (I might use lettuce if it stays hot, though. Iceberg *is* good for adding a ton of water content without making the salad soggy.)",
            "I am cackling, your 8yo self was an absolute boss. I hope it stayed that way!",
            "AHHAHAHAHAHAHAHAHAHAHAH!!!!!!!!!!!!!!!!!!!!!!!!!"
        ]
    },
    {
        "post_id": "7ifmyo",
        "author": "Nerdyhusband88",
        "title": "\"Send it to someone who cares\", Can do!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7ifmyo/send_it_to_someone_who_cares_can_do/",
        "score": 17212,
        "num_comments": 330,
        "created_utc": 1512746781.0,
        "selftext": "Going to be slightly vague about my company.\n\nI work for a company that has service contracts with lots of different municipalities across the country. Essentially we go to their town and service important equipment to make sure everything is running smoothly and things meet regulations. The department I work in is to call and email the heads of departments to have them renew their agreement so we can keep coming to service the equipment.\n\nWe send a lot of reminders because some places it takes a while to get things approved and people tend to forget about the agreement. Recently I had a gentleman, we can call him Bill, respond to one of my emails saying he doesn't need a reminder unless the contract expires. Okay easy enough, well two days after the contract expires, I send Bill an email. He is very frustrated and says he asked me not to email him unless it expired. I tell him it expires two days earlier. \n\nWe email back and forth for a bit and it becomes clear he cannot find what he did with the contract. So I ask him if he would like me to send it to him again, he responds \"send it to someone who cares.\" Okay, so I call the main line of the municipality and find out who is above Bill when it comes to decision making. They give me the email and I send it off. I get an email back very quickly asking why Bill hadn't handled this. I respond explaining I've contacted Bill a few times and he said he would handle it but then it never got taken care of. He then asks me to forward my email chain with Bill over to him so he can take a look at it. I was so excited he asked for this. \n\nAbout ten minutes later I get a phone call from a very upset Bill. Asking me why I would contact his boss and now he is in a bunch of trouble. I responded \"Bill, it was not my intention to get you in trouble but I did what you asked. I sent the contract to someone that cares.\" \n\nI don't take a lot of pleasure in getting someone in trouble at work but I did what he asked so it really isn't my fault, right?\n\nEdit: okay before I get more comments about it. I have explained a few different times in the comments that my last statement isn't totally accurate. At the time I didn't feel 100% great about having to go to someone above Bill but as the day progressed I got more and more pleasure out of it.  Bill was preventing me from getting my job done. Bill was risking the safety of other people by not taking care of this. Bill got what he deserved and I'm glad that I could be a part of that. Mainly I was trying to say that my goal is never to make someone's day worse or get someone in trouble but in this case it needed to happen and yes it felt good.",
        "permalink": "/r/MaliciousCompliance/comments/7ifmyo/send_it_to_someone_who_cares_can_do/",
        "comments": [
            "Hah, that’s great. I always think to myself “would my employer get angry if they read this email I am about to send?”\n\nIf the answer is yes, then I need to adjust my wording\n\nMaybe Bill will learn that same lesson",
            "This reminded me of an emergengy my SO responded to.\n\n   My SO mentioned to a department head(DH), that their elevator service contract would expire that year.  DH likes my SO as their service guy, said he'd make sure to renew the contract, but to remind him again closer to expiration date.\n\n   They go back and forth like in OP's case.    \n   Elevator company doesn't hear back from DH guy and contacts DH's boss.    \n\n*Later that very night...*    \n\n\n   My SO is on-call and his phone rings at 2am.  The DH guy is stuck in the elevator.  Before my SO leaves the house, he calls his own supervisor at 2:15 to check if DH's business is a current client.  \n\n  DH's ignorance caused the contract to lapse.   \n\n   My SO calls DH back and says, \"I'm sorry, but I can't get you out.  My boss said your contract expired.  I *can* get you out if it is okay'd, but it's 2:30 am. Your options are: You can have your boss call mine and I'll be able to get you out. Or you can call the  Fire Department..\"    \n*DH hangs up*\n\nDH's business did give the O-K for my SO to get him out.  However, by the time of the next monthly service, the DH guy no longer worked there.\n\n",
            "I think this is the best thing I’ve read in this sub. Bill didn’t just shoot himself in the foot, he drew a target on it first.",
            ">I don't take a lot of pleasure in getting someone in trouble at work\n\nI agree with the general sentiment not to stir shit. But I used to try not to get people in trouble at work *even if they were very bad at their job to the point of not doing it*. I have since found that outcomes are much better if you inform their management.\n\nIf you don't tattle, nothing ever gets fixed. And the bad worker remains in a job that is a bad fit for them. Nowadays, I wouldn't say that I find pleasure in getting them in trouble, but I can feel good that I tried to do something to fix a bad situation.",
            "It's fucking madness that he'd be so upset and call you asking why you got him in trouble when he was so ridiculously rude to you! You just did what he told you to do!",
            "Someone who would tell a vendor to send the contract \"to someone who cares\" deserves any punishment they receive. I don't understand how someone could represent their company so unprofessionally.",
            "[Here's a phone, call someone who cares.](https://frinkiac.com/video/S06E20/wrdpHukfd0-Xf7D4kzlIbkQVzis=.gif)",
            "Perfect...he got exactly what he asked for! And what he deserves!",
            "Deliciously malicious.\n\nWell done.",
            "You lier, you know you took pleasure in it. I certainly did.",
            "I had a similar experience at my last job! Dude placed an order, but everything was wrong. I forget the details, but it was just a mess. I think there was one item, but the descriptions didn't match at all. The order said absolutely no calling. I emailed the guy to ask about the order, and he sent a very nasty reply. I asked one more time, explaining the problem and that we absolutely could not proceed unless we had an answer. Another nasty email. Blah blah blah, why am I bothering him, blah blah, never email me again.\n\nSo I went to their website and found literally anybody else to talk to. There was only one email address on the site, and it wasn't his so I went for it, explaining the problem and why I couldn't talk to the original person who placed the order.\n\nTurns out that email went to his boss. Cue another nasty email \"WHY DID YOU CONTACT MY BOSS?! NOW I'M IN TROUBLE!\"\n\nI had a fun time explaining that I didn't know it was his boss, and that I had only needed a VERY simple question answered. Instead of apologizing and answering the question, he canceled the order.\n\nWe were a wholesaler and he was a distributor. So in addition to being in trouble with his boss, now he was likely going to have an angry client too, since he canceled their order.\n\nEverybody in my office was reading the email chain and cracking up at how ridiculous he was being.",
            "He’s making your job hard, you tried your best, he’s an asshole, you tried to be nice, he’s upset, you apologise for the inconvenience. \nTop job friend, at every turn you did well",
            "Considering your job sounds like it keeps people who use equipment safe I'm gonna go with yeah. He was an ass for no reason. Paid the price.",
            "You are a far kinder person than me.  I would thoroughly enjoy getting someone in trouble if that was how they were acting.",
            "> it really isn't my fault, right?\n\nThe true motto of the maliciously compliant. Good show.",
            ">  I was so excited he asked for this.\n\n...\n\n> I don't take a lot of pleasure in getting someone in trouble at work\n\nBUUUUULLLLSHHHIIIIIT",
            "Nobody who works for council gets into trouble, no matter how incompetent they are!",
            "This gave me feelings. It's perfect!",
            "Perfect story. This is why I come here to read.",
            "Hahaha well he gave a very unprofessional response. Deserves what came of it.",
            "Man, in my time in IT I've had to deal with many government employees. Some of them are very good, others not so much. I think it's easier to put that incompetent employee in some far off corner and not given much responsibility than it is to fire them due to unions. Anyway, you do get that incompetent employee that just doesn't care and they are super frustrating to deal with from time to time. ",
            "“Send it to someone who cares.” I hope Bill was just having a bad day and doesn’t treat people like this on a regular basis. Pretty rude.",
            "I will never ever ever *ever* understand people who act like this at work, especially when they're accountable to someone higher up. \n\nI work as a subcontractor for a large company and the amount of their customers (largely managers of multifamily properties) who don't want to cooperate with us is baffling since they actively purchase services and enter into contracts with the company we subcontract under. Surely that is part of their job, to do things in order to keep the contract and service going for their residents. I sure wish I could pick and choose what I do at work, at any rate. Maybe I should work as a property manager.\n\nEdit: Should mention the company's customers don't know we're subcontractors so that's not the reason they won't deal with us. A lot of them bluntly state that they just won't do what is needed to keep the service going despite what we are requesting being mind-shatteringly simple.",
            "Fuck.  Saying \"tell someone who cares\" in person or over the phone is one thing.  But Bill is just asking to get fucked it if he puts it in writing.",
            "This compliance is malevolent AND benevolent. Imagine how much trouble Bill would have been in if the contract was lapsed when the municipality needed it..",
            "I've worked in areas of Customer Service where this story could easily fall into and 'fit'... and all I can say is *tips hat, and slow claps*  Well played.  If \"Bill\" still has a job after this, I'm sure that these negotiations as well as any other similar tasks that require, 'someone who cares', will be reviewed in a more timely and professional manner. ",
            "I mean, Bill was being an asshole. And folks, if you’re gonna be an asshole, you’re gonna get fucked.",
            "Sounds like Bill is a fucking moron.",
            "This is why I subscribe to this sub.",
            "My god, that was fucking delicious.",
            "This is beautiful.",
            "Bill was unnecessarily asshole-ish. ",
            "Sounds like they know very well that Bill sucks.",
            "\"My name is Bill and I am so upset at this situation that was entirely in my control and the consequences of which are now my own fault!\"",
            "He was so rude about It, definitely deserved it.",
            "Right ",
            "HO HO HO! Way to go, my bro!",
            "Fuck Bill!",
            "Oh that's so beautiful I feel like there should be an interpretive dance piece about it.",
            "I would do that in a heartbeat and from what I guess a lot of other people would do the exact same thing\n",
            "100% the correct response",
            "Not at all relevant to the point, but I just realized I have never sent an email ever in my life and don't really know how to even if I wanted to.",
            "I haven't read anything but the title yet, but a while back we had a shitty interim manager at a ski resort I volunteer at. Now, I could at least respect him 90% of the time, but he for some reason insisted on cutting safety corners that absolutely didn't have to be cut. Maybe your average guy wouldn't have cared, but I didn't join [NSP](https://nsp.org/) and become an [NR](https://www.nremt.org/)EMT so I could ignore things that put people in danger for no reason.\n\nI brought them up with this manager and he said, quote, \"Talk to someone who cares.\" So I talked to OSHA, he got fired and I think convicted of some misdemeanor, though I don't know the details.",
            ">it was not my intention to get you in trouble \n\nThat almost disqualifies this, but your comments confirm the malice. ",
            "This is now my favorite post in this sub. Thanks OP.",
            "outstanding",
            "Oh, I love you submitter. This is great.",
            "Bill asked for it!\n",
            "Lmao, love it when a person fucks themselves over.",
            "You service street lights dont you?",
            "Turn it up Bill.  ",
            "Epic.",
            "That’s cool and all  but what was his response to your call with him?",
            "\"I don't take a lot of pleasure in getting someone in trouble at work\"\n\n-Nerdyhusband88 in r/MaliciousCompliance",
            "Juicy sweet",
            "This is precisely the type of stories I visit this sub for. Oh my god this must've felt good.",
            ">\tI don’t take a lot of pleasure in getting someone in trouble at work but I did what he asked so it really isn’t my fault, right?\n\nI think you are wrong. You have the agency to choose your actions. If he said, “Go kill your self” you would have ignored him.\n\nThat said, I love this story and would have done the same thing. I think going to a supervisor is what you should have done.\n\nBut it is your fault that you reported him.\n\nIt’s his fault he did that crap.",
            "Oh this is perfect! ",
            "Normally I'd say going above someone is a total dick move. But when someone acts this shitty to you, when you were just trying to help them, they deserve all they get.\n\nAlso had you not done it you could have got in a lot of trouble over being negligent about not escalating the problem. I mean there's the chance that the contract was for something unimportant, but I suspect not given the boss' fast reply.",
            "That was SwEEt !!! High fives!😅😅😅",
            "LMAO! You did the right thing. ",
            ">I don't take a lot of pleasure in getting someone in trouble at work but I did what he asked so it really isn't my fault, right?\n\n[Nope.](https://m.popkey.co/0b1a16/R4GNp.gif)\n\n",
            ">I don't take a lot of pleasure in getting someone in trouble at work\n\nWhy are you lying like this? You clearly took pleasure in it. Do you just need some kind of validation that you're not a bad person or something?",
            "You potentially cost someone his job over semantics - not the \"someone who cares\" remark he made after he was already frustrated, but the \"unless it expired\" portion. Obviously he meant he wanted the reminder only when that renewal-or-cancellation date is impending and not after it had expired. That's certainly malicious compliance, but the malice is unwarranted.",
            "Are your services necessary and irreplaceable? I feel like my clients would find another vendor if I were to throw them under the bus, even if they did deserve it."
        ]
    },
    {
        "post_id": "yep94s",
        "author": "pappagall0",
        "title": "Charging me for something extra that never existed? Fine, I'll pretend like it did",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yep94s/charging_me_for_something_extra_that_never/",
        "score": 17193,
        "num_comments": 723,
        "created_utc": 1666869413.0,
        "selftext": "I was using a storage company to keep my stuff over the summer, and they already fudged up the first part of the delivery so I wasn't having high hopes for the time when I was supposed to get my stuff back. I had sent seven boxes to the company but received a quote for eight boxes instead, and the surplus they charged on it was quite a lot. I wrote to them asking why there's this extra box and they never replied to me to say that they'd look into it or to cancel the charges for the eighth box that didn't exist. I called them every week and the line was bogged up every time, and emailed them near every day because the situation was just so stressful. They kept saying the extra charge was because I stored an extra box and they can't do anything about it, despite me being explicitly clear in all my correspondence that there was no 8th box. \nNow that they've asked for confirmation that I received all my boxes, I said that after two months, I still haven't received the final box. I got my delivery charges refunded as a goodwill gesture (not that I would go back to them ever) but the satisfaction now lies in the idea they are tramping around the warehouse trying to find a box that doesn't exist. If they still haven't found the non existent box by Month 3 I might just as well demand reimbursement for no loss on my part (aside from the extreme annoyance I suffered throughout this unpleasant ordeal).\n\nEdit: I'm so happy that there are people who can find catharsis in unfortunate situations like this! It almost makes the stress of losing money to a faceless corporation worth it. On a side note, I really enjoyed you guys guessing what would be in the 8th box, I also am eager to know what it would be :) \n\nEdit 2: Added clarity\n\nEdit 3: I have no intention of committing insurance fraud.\n\nUpdate: Yayy!!! they finally admitted it didn't exist and refunded me.",
        "permalink": "/r/MaliciousCompliance/comments/yep94s/charging_me_for_something_extra_that_never/",
        "comments": [
            "Not quite the same thing, but:\n\nBefore I bought my house, it was rented out, and the rental was managed by some management company.  Moving day comes, and the house was still full of furniture (it was rented as a \"furnished unit\").\n\nLegally, that furniture was mine, but they begged to have an extra day to get the furniture out, so I let them.  When I finally moved in, there was still a washer and dryer.  \n\nSo, I called them to come and get their stuff, and they said \"no, there's no washer and dryer in there.\"  I said \"I'm looking at it right now.\" and the woman on the phone _insisted_ that I was mistaken, and that they had taken the W/D when they got the other stuff.\n\nLong story short:  My house came with a free washer and dryer.  I fully expected to get a call one day asking for them back, but that day never came.",
            "Plot twist - you get an 8th box.",
            "\"Can't find the last box? Darn... and that was the box with my Kruggerand collection. Well, if you can't find it, I guess we should just report it to your insurance company\"",
            "So... what's in the nonexistent 8th box?  Grandpa's war medals?  HDD with your Bitcoin wallet on it?  Beanie Baby collection?",
            "One of our boxes was lost during a move. I had meticulously documented all contents of all the boxes and knew exactly what was in the missing box. The removalist company were not much help and told us to put in a claim with our insurance company. We decided it wasn’t worth the excess to put in a claim, so just accepted the loss. Weeks later the removalist company contacted us and said they were dropping off a box for us! It wasn’t our box, but while they were looking for ours, they found someone else’s box, full of books, and thought we might like it , “because you had lots of books”! So I got to enjoy reading some new books, and someone else got my teapot.",
            "Oh this reminds me of a story of my own.\n\nBack in the late 90s I worked at a company where we had colocated a host in a local datacenter.\n\nNow there were various issues with this company so we removed the server from the datacenter and cancelled the contract.\n\n3 Months later they call looking for money on that cancelled contract.  We told them they could keep the server to cover the missing payments.  Awhile back they called saying they couldn't find the server.  We were like not surprising you have been terrible about everything around hosting servers.\n\nThey might still be looking for that server to this day.",
            "I love this. I once had difficulty getting a contractor to remove a lockbox and return my key from a public stair railing in my condo complex. I was being harassed by the complex management to have the box removed, and I also wanted my key back. The contractor kept saying they were going to come and retrieve the box and give me back my key, and then they kept not showing up while I was waiting at home for them. After a couple of months, they stopped returning my calls. They had also refused to tell me the combination (I suspect they had forgotten the combination). I spent an entire Saturday morning sitting on the step drinking coffee and trying combinations. I assumed that they had probably used someone's birth year, so I started at 1900 and worked my way up. I eventually got it open, got my spare key, and removed the lockbox, which I later donated to a charity.\n\nI then called the contractor and left a message thanking them for finally coming and removing the lockbox, and said that they could keep/throw away the key as I had changed my locks.",
            "I’d insist they refund every charge for the 8th box",
            "Not fraud if you just ask questions:\n\n\"You charged me for storing and shipping 8 boxes. You only shipped me 7 boxes. What are you going to do to make this right?\"",
            "After watching the movie Seven, I’ll never look in an unknown box again.",
            "I got a museum shipment mixed in with my stored household goods. It wasn’t insanely valuable, but it was an original watercolor by a somewhat well-known artist. We contacted the museum it was being shipped to (had been on loan somewhere, I think). It took almost 2 years for someone to finally take it back. Nobody seemed that bothered.",
            "Oh no, they lost your box of ipads? Oh well, guess they will just have to refund them!",
            "Years ago when my kid was small I ordered a platform bed from a very large family-owned company that treats their employees poorly. The bed was several hundred dollars and shipped in two packages, which arrived on time and in good condition. The boxes were apparently tracked as two completely different items, with the total price split between them. When we picked up the two boxes, only one box was scanned as \"delivered\" by the store and I received an email confirming delivery of that single box. Over the next couple of weeks I kept getting emails reminding me to pick up the second box, which I ignored since we'd completely assembled the bed with no missing pieces. I finally got an email saying they'd refunded the purchase price of the second box since I didn't pick it up. So I got the bed for half price because of their processing mistake.\n\nEdit: typo",
            "Lol I ordered a mattress and platform from the big O shopping website and the mattress arrived just fine but the platform was stuck in a loop in California...on the tracking info you could see that it had bounced back and forth between 2 different warehouses 6 or 7 times..so I called customer service and they looked at it and said \"huh that's weird\" and they ordered a new one. Got that one no problem.got my bed all set up it's awesome...about a week later the original bed platform arrives and I call customer service to get it back to them....they send a label and it gets picked up....and then I got a credit for the \"returned\" platform. Whatever... Free platform.",
            "> I really enjoyed you guys guessing what would be in the 8th box, I also am eager to know what it would be :) If they ask me what was in it, I would probably say college textbooks since they're one of the most expensive things per unit of space, and it's a totally believable answer\n\nIt contained the 7 other boxes.",
            "Too bad that 8th box had a stack of Action Comics #1s in it...",
            "[deleted]",
            "My family and I moved from a rental to a house we bought about 10 miles away. We hired this small-time moving company to assist us. They showed up at our rental house, and we discussed what needed to be done only for the entire crew to pile into their truck, and other accompanying vehicles and race off to the destination house. My family, including my in-laws, and a couple friends moved all our stuff with a box truck we had rented ourselves and our personal vehicles. The moving crew essentially stood around the house, chatting us up and asking if we were planning on getting rid of the \"vintage\" appliances.\n\nWe didn't pay and as a result, the owner of the company who is part of the moving crew, left my wife, several very unprofessional phone messages. I, in turn, sent him a letter, explicitly detailing what we had hired them for, and what had actually transpired. We had calculated some amount in regards to, what time it could be argued, they actually did work, and in my letter, I said he could either except this substantially reduced amount, or if he insisted on the full price, I would have every right to leave, honest, unfiltered reviews about his company and its service wherever I wanted. We never heard back from him. That was four years ago.",
            "I had a similar situation moving. The company showed up a day early without warning, so a few things still needed to be boxed and taped. They did this for me and of course charged a premium for those supplies. I disputed the charges with the company and they wouldn’t budge, so I disputed the charged with my credit card AND filed a formal complaint with the DOT for failure to provide proper notice, as well as having noticed they only had 1 DOT registered driver but 3 separate drivers hauling the load. \n\nAbout 2 months later I got all my money back. It was a lot of headache, but a free move is a free move.",
            "Schrodingers cat is waiting/not waiting in your existing / non existing box while quantum physics tries to figure out if it’s still alive or if it’s just a different cat not occupying the same superposition. Hope that clears it up.\n\nEdit:spelling",
            "> If they ask me what was in it, I would probably say college textbooks since they're one of the most expensive things per unit of space, and it's a totally believable answer\n\nI just remember this episode of Married w/ Children where Al loses his car and Steve is trying to convince him to commit insurance fraud. \n\n\"Al, listen to me... you had **two** sausages in the trunk, you understand?\"",
            "[deleted]",
            "I'm sorry, but I seriously doubt they're trying all that hard to find that last box.",
            "[deleted]",
            "Nice! No winning for them here.",
            "What's in the box? Pain! Where is my gom-jabbar?",
            "This reminds me of the “letting loose 3 pigs in the school with #1, #2, & #4 written on the pigs” story",
            "One time UPS lost a package I had shipped that contained two bottles of champagne and some other gifts valuing around $150. I shipped it from a mail/office store and had receipts, etc. total shipping cost was $81. When I called ups to report the package as lost they asked for the claim amount and I said $231 but they said I should request a full refund. Confused I asked what they thought the total was and they said over $700 in shipping fees plus the $150 value. Over the course of several weeks I determined that the package got mixed up and put on a freight truck and they adjusted the cost to their freight rates. I waited and waited and never got a bill. Ups never actually had my card info because I paid the store directly. I requested the “full” refund and several more weeks later received a check for almost $900. I cashed it and didn’t look back.",
            "WP: You Received the Eighth Box",
            "Is there any chance this company is running insurance fraud? Claiming they have extra boxes. Claiming in the insurance and then just keeping the money?",
            "About 6/7 years back I bought a new home and had to furnished the place. I saw some really nice stuff at JC Penny. They had a line of furniture which I liked. Bed frames, night tables, cabinets for bedroom and living room.  Bunch of really nice stuff, towels pots and pans, kitchen stuff the works. I made a bunch of orders totally $10k which just covered a new empty house.  Anyway 2 of the bed frames I ordered went from $1200 to like 40% off 5 days later and before delivery. I called and they adjusted.  However 3 days later they sent me at 25% coupon which allowed discount for furniture / home decor.  Anyway I ended up canceling my o orders  and redoing them again online with a bunch of smaller orders.  Because of the coupon I had online order days prior to only be cancelled and new identical order with the savings.  I made a spreadsheet because I confused myself and wanted to make sure i got my refunds correctly.  For some strange reason they refunded me too much.  $1000 too much.  I called them a few times to let them know but they said the accounting would balance out later and not to worry.  At the end of it, my $10000 of items ended up costing me like $5000 with the extra refund.  Strange win.",
            "Good job! Were the waived delivery charges more than the extra charge?",
            "[deleted]",
            "It is a shame that your desktop computer and Xbox were in that box.",
            "You should get your 7 boxes then demand the 8th box,  when the can't produce it demand reimbursement for your PS5, XBox, and gaming computer that were in that box",
            "I LOVE this because it's super obvious that someone mis-counted, wrote down that you had 8, and the company isn't willing to admit someone made a stupid mistake.",
            "The 8th box is the one that you had your gold bullion in, yes?",
            "How would that be insurance fraud if they have confirmed numerous times that you had 8 boxes? For all you know they split your stuff up from 7 to 8 boxes to make it fit better. Or, maybe you sent them 8, but forgot about one. Nobody is perfect, after all. Whatever the case may be, they charged you enough for the box that it must be real. Otherwise why would they charge you. Surely they did not miscount to the number 7 while loading. Sounds to me like the box fell off the delivery truck. Or was sent to the wrong recipient. You deserve proper reimbursement.",
            "FUCK EMMMMM. Hell yea this is the sort of fucking justice that I love",
            "You're playing a dangerous game, OP. Brad Pitt once had a free box delivered to him. It did not go well...",
            "So, what's in the box?",
            "Tell them it was filled with new printer ink cartridges.",
            "That 8th box had your 3090ti in it correct? ;-)",
            "These storage companies suck, I had to store my things for about six months one time. When it was finally delivered to my new place they dropped off my couch missing four of the five cushions",
            "OP, if you're still checking replies, here's an idea you should run past /r/asklegal but might be worth the time. \n\nIf you have time, take the company to your local Small Claims court for the total value of whatever you're out and claim that was the value of the content of Box #8. Technically correct, \"Box #8\" is worth what they've charged you for it. If asked what the contents are, yo ucan say you're not sure and don't recall. \n\nIf they don't show, you get a settlement in your favor for that value anyway. If they do show, their options are limited. They can commit perjury to say there was an 8th box and say that they lost it and thus potentially commit insurance fraud themselves, which you then report to your insurance company as attempted fraud, which their lawyers may love. Or they may admit there was no 8th box all along. After which time you then have that as evidence to get a real lawyer and sue them for real money including legal fees. \n\nAgain, check with people that might give you a reasoned response, but seriously, fuck these people so hard for this. Not for you, for everyone else they've done this to and didn't have the chance to fight them back.",
            "This case reminded me of a high school joke.. student bought 3 chickens, labelled them 1,2 and 4. Teachers couldn’t find the missing chicken.",
            "damn poor 8th box.. that one had all your gaming consoles, your Picasso, your vintage Rolex collection",
            "I think the 8th box is the tardis",
            "Plot twist: the woman in receiving used to date the guy in delivery. Whenever she remembers how he treated her,  she adds fictitious boxes to orders knowing it'llcause him pain and suffering.  The thought of him fruitlessly tracking the imaginary storage theif and the pressure of unfulfilled orders gives her the satisfaction he never could.",
            "That reminds me of a friend who was diagnosed with paranoid schizophrenia. She wasn’t schizophrenic, she had PTSD after the council moved a violent nutter into the house. In a clinical setting it looks identical. The only difference is, with PTSD the story you are telling is true.\n\nMost people would fight that diagnosis. Not her. She said ‘ok, I’m a lunatic am I? Give me Disability money.’\n\nAnd they did. Plus a free bus pass. I made the council give her somewhere of her own to live too. Now she spends her money going from cake shop to cake shop via bus.",
            "More plot twist-the box had something unbelievably valuable in it.",
            "If you collect enough of them, replace your dining room chairs.\n\nOr, put them in the TV room so the guys don’t have to leave the room during football season to duke it out.…",
            "That 8th box had a one of a kind signed first edition of the book war and peace. It is a museum quality edition that is priceless. Normally you would have it displayed on your shelf behind a acrylic case however you placed it in storage as your ex spouse had threatened to steal it and send you a video of her tearing it apart page by page while blaring Celine dions “my heart will go on” now for the true secret that makes the book even more valuable your late father had secretly left you a large cash inheritance how did he do it, each page of that first edition had a crisp sequential $100 bill in it. Which equals out to roughly $122,500. \n\nThat should really get their cardio going trying to find it!!!!",
            "Brad Pitt voice from 'Seven': C'monnnnnn What's In The Boooooooooox?",
            ">, I really enjoyed you guys guessing what would be in the 8th box, I also am eager to know what it would be\n\nSadly, it contains an eldritch horror. The company saved the world by losing it.",
            "when a mummy box and a daddy box love each other very much and get locked in a dark room together...",
            "“WHAT IS IN THE BOX!!!”",
            "Tell them it’s a Black Lotus in mint condition 👀",
            "The 8th box will never be delivered so you can demand compensation for the contents: three gold bars.",
            "It's Schrödingers box!",
            ">I might just as well demand reimbursement for no loss on my part\n\nTell them you won't sue them for the missing box if they give you a full refund.",
            "\nr/lifeprotips\n\nEdit: I look forward to your Tedtalk!",
            "Return for store gift cards.\n\nEdit: this isn’t unethical life pro tips?",
            "\"oh no my 8th box full of ancient manuscripts worth an incalculable amount of money has disappeared? what a shame!\" then just wait for the money to roll in lol",
            "Please, let them find a box with a rotting horse head inside. It might not be your box... but anyone who's watched the Godfather is now gonna be scared of you.",
            "They charged you for 8.  You should get 8 back.",
            "I would keep calling and emailing \"its been 8 days, its been 9 days, its been 42 days\" since you have refused to return my property to me.",
            "The only thing more valuable than college textbooks is printer ink. If you get an 8th box and it has Xerox written on the side, you can probably retire.",
            "There is a large moving company with a name beginning with U that I will never use again. There were many screw ups with my storage/moving units (their version of pods) over the course of a couple of years and billing that made me want to scream. Plus the billing issues. My stuff is now in a storage unit and I simply won’t use the U company ever again. Or say nice things about them. \n\nExcept for one guy who worked at the location where my boxes were; well, the location they were connected because they put my boxes into long-term storage without telling me and when I wanted to come in and unload them, they couldn’t find them, then they misplaced them, then when they were supposedly at the location and I came with movers for my stuff … the wrong boxes were waiting in the unloading area,and they had to go back into the warehouse and search. The one guy who was helpful had been at the location when the worst of the mess was going on, but had left and a year turned. He remembered me and was speechless that it was still happening. He took charge and figured out where my boxes were, found the right boxes for the movers, etc. (Two people with my last name were picking up their stuff the same day, but it never occurred to anyone to notice that two customers wanting two boxes each meant four boxes.)",
            "I hope their reimbursing you for the missing box full of diamonds doesn't cause them to go into bankruptcy.",
            "Love this so much 🤣🤣\n\nI mean, you did your part by looking into it for this long and their customer service really sucks, so it’s well deserved for sure. Really hope you get that 8th box. It’ll be like a Kinder Surprise egg 😅",
            "Schrödinger’s Box",
            "Schrodinger's Cat maybe?",
            "Reminds me of the time when our internet company billed us for \"repair and installation of equipment\" out of the blue. I contacted them and they said that a technician came to the house on May 5th, at 5:15 pm. This was not true, nobody came to do anything, we had everything in working order. \n\nThey were so adamant that I thought they'd ask for proof that no technician came. But at the end, the rep put me on hold and then came back saying, sorry, we'll reissue your bill without the incorrect charge...\n\nI was prepared to send them a photo of the empty driveway with no technician present or something",
            "Definitely want an update on this",
            "What’s in the box? What’s in the box? What’s in the box? (My best Shane Mills voice)",
            "What's in the box!",
            "could it be Jimmy Hendrix' Guitar used at woodstock 1969?",
            "The 8th box will be delivered with Gweneth Paltrow’s head in it.",
            "When they ask what would have been in the 8th box just tell them priceless art, some jewellry, gold, diamonds or rare stuff that is worth a fortune... \n\nSee how they start to rotate to find it breaking into huge sweat \\^\\^",
            "Well. Done. \nI don’t know you but I am very proud of you.",
            "To me, this is like talking about religion. \nThe emporer is wearing no clothes.\nThere is no box.",
            "I'm pretty sure the 8th box has an Xbox series x in it as well as a brand new iphone 14 pro. Oh and don't forget the $1000 in cash!",
            "Wild ride! Thanks for the fun story, so glad your frustrations have finally come to an end!",
            "OP are you aware a site called BoredPanda just wrote a news article on this post?",
            ">there was no 8th box.\n\nI worked as an election judge at a middle school the other day, and I had to laugh when we set up our tables next to the stage in the cafeteria.\n\nUp on the stage were about 20 boxes.\n\nEvery one of them was labelled \"8\" or \"8th\" :-D",
            "Why not take the assumption that the 8th box is real to 11. File a police report for theft or property damage resulting in the loss or destruction of the 8th box. \n\nIf its real and undelivered, and cant be found, in theory it has some value that you are being deprived of, and your hypothetical box may have suffered a hypothetical crime",
            "Am I the only one who pictures Brad Pitt screaming \"WHAT'S IN THE BOX\"?",
            "Plot twist: OP is a math major and counted their boxes beginning with zero",
            "i know you didn't want to, but i love that you conned them with their own con....  you should feel good lulz.",
            "I may have your box.\n\nThe last time I moved, a mysterious extra box full of children's beach toys somehow appeared among my belongings.",
            ">\tlooking for a box in the warehouse. \n\nHate to ruin your satisfaction but I can absolutely, beyond a shadow of a doubt, tell you they aren't looking for a damn thing.",
            "What an an incredible hypothetical scenario that we're all speculating on. Good creative thinking OP ;)",
            "College textbooks get new editions regularly making them worthless after a while.",
            "hello from vietnam\n\nhi",
            "Why would you tell them you were waiting for the final box? Is there some sort of legal reason",
            "Petty revenge. You aren’t complying with anything.",
            "This sounds like stealing with extra steps",
            "Well, time to check what books your kids need for college... 😉😆"
        ]
    },
    {
        "post_id": "igbjs3",
        "author": "Hooked_on_PhoneSex",
        "title": "May I see your ID Please?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/igbjs3/may_i_see_your_id_please/",
        "score": 17191,
        "num_comments": 806,
        "created_utc": 1598359880.0,
        "selftext": "When I was in high-school, I had the typical minimum wage cashier's job. It was store policy to ask for a legal government ID when a customer purchased cigarettes or alcohol. We had to ID every customer who looked like they could be under 35. If you didn't, and they turned out to be under age, you could be fired (if caught in an in-store quality check) or arrested (if caught by a regulatory agency). There was no way in hell 16 year old me was going to risk getting fired or arrested for a shitty minimum wage job, so I ID'd EVERYBODY.\n\nNow 99% of the time, the person reacted amicably, handed over their ID, and went on their way. But on occasion, I would end up with some Karen or Chad who had left their ID in the car and wanted me to proceed without the ID check.\n\nOne particularly Kareny Karen (who looked to be in her late 40s) would come in to buy cigarettes, and never had ID. So I refused to sell her cigarettes, she'd pitch a fit, and storm out.\n\nAfter doing this three or four times, I guess she had enough and bitched to my manager. I had to go on a break at this point, so didn't have a chance to actually look at her ID that time either.\n\nThe following week, Karen returned and once again tried to buy her cigarettes without ID. As usual, I requested a DR License, and the usual circus ensued.\n\nManager asked me afterwards why I still asked for an ID after he had completed her purchase himself the last time. I pointed out that I had yet to actually see the ID myself. Therefore, as per company policy, I couldn't assume that he had done his job and confirmed her ID. I had to keep asking until I confirmed her age myself.\n\nShe continued to come to the store and throw the same tantrum for a few more months before I moved away. I never saw her ID, and I refused to sell her cigarettes for a solid 6 months (I think?)\n\nEdit, wow thanks for the awards and comments everyone!\n\nAlso, for those of you concerned that this lady didn't have / couldn't afford ID, she was driving a brand new BMW Z3? finances were not at issue.",
        "permalink": "/r/MaliciousCompliance/comments/igbjs3/may_i_see_your_id_please/",
        "comments": [
            "I used to ID everyone I thought looked younger than 25(that was kinda the company guideline/policy). This one woman looked like she was in her 40s and I didn't bother IDing her. She then told me off for not IDing her for cigarettes, so I asked her for ID. She left it in her car so she went to get it. Turns out she was 20. I was 21 at the time and I was so shocked she was that young. \n\n\nMoral of the story; if people don't ID you for stuff when you're around that ambiguous age, you should probably quit smoking.\n\nETA: this was in the UK, where you only have to be 18 years old to buy alcohol/cigarettes atm.",
            "And she never caved and just showed a license??  I guess the addiction to being a Karen can overpower the nicotine addiction. \n\nHere's hoping that you helped her quit smoking... so she'll live longer... and, ummm, can be a Karen to more people?\n\nOn second thought, screw you OP.  /s",
            "Ya know, getting ID’ed isn’t a big deal and I don’t get why people make such a fuss. I’d not expect someone to go to jail or be fined because they sold something to someone underage. \n\nI get ID’ed for everything. I’m just used to it. The only time I got annoyed was when I was in the supermarket and went through self check forgetting I’d bought some red bull. Cashier comes over, who has seen my ID multiple times and we went to school together ten years ago and asks to see my ID. I get it out and give it her, she scrutinises it as per usual and hands it back confirming my age on the machine. \n\nNot two minutes later, I go to buy cigarettes and she ID’s me again. THAT I was annoyed about. Not because I was getting ID’ed, but because she seemed to get off on that little amount of power.",
            "I just tell everyone unless you're as old as Moses I have to see your ID.",
            "Did she pay with a platinum card?",
            "If i were in your shoes, and I couldn’t risk a job,  I’d put on the greatest act of all time. \n\n“Hiiiii ! Oh my gawsh! You’re skin looks soooo goood! Are you sure you’re over 35. Can I see some ID!”",
            "What the fuck? Jeez, people are so entitled. \n\nI take out my ID everytime, even if the cashier HAS seen it before until the cashier tells me not to worry about it(even then I still sometimes do it instinctively). I'm well over the legal drinking age, but people often mistake me for a teenager. Why risk causing problems for the cashier just trying to do their job?",
            "Doesn't matter even if you've seen the ID in the past. The requirement is that you have proof on you. Also, I have no idea why people over forty get touchy about being ID'd. As a 40+ year old woman I love being asked for my ID. I'll take that as a compliment any day. I know you don't think I'm under age, but at least I know I don't look as old as Moses.",
            "Did she drive to the store? If her car's outside and she says she doesn't have ID, I'd call the cops and report her for driving without a lisence",
            "Good for you. Managers try to force their employees to be \"reasonable\" by trying to visuaLly judge whether someone is of age or not. The much better policy for everyone is to ask for proof of age every time. Why? Because the store will probably at worst get an administrative fine if they sell to a minor but you, the clerk, can be charged with a misdemeanor in many places.",
            "The most interesting thing I ever saw was a sign in a Canadian convenience store. It was a picture with a bunch of people in it. The youngest looked 25, the oldest in their 40s. The sign asked how many of those people looked under age, and under the picture the caption said that they were all under 18, and I think youngest was 14. It was something of an eye opener.",
            "I worked at a convenience store for 2 years. Quickly found out that carding women past a certain age usually resulted in one of two reactions:\n\n1. \"OMG you really think I look that young? You're so sweet!\" (Yeah, they've got their ID.)\n2. \"Oh you have got to be kidding me. Don't you see my three kids here, and these wrinkles?! Find your manager. They'll tell you I can have it.\" (Nope. No ID, no sale.)\n\nAnd that's putting it mildly. I've had some much wilder ones on both ends of the spectrum.",
            "About 7 years ago IDed a woman for a cocktail. She was part of a group of tourists and was sat on a table with three other people in their late teens. I was pretty sure she was over 18 but not 100% so gave her the speel about it being policy to ID anyone under 25 and my personal responsibility for the fine if she was underage and blah blah blah. She pulled out her drivers license and it turned out she was born in 1961.",
            "That's not malicious compliance. That's just covering your ass. You should always follow ID laws even if someone tells you it's dumb. You have absolutely nothing to gain by siding with your boss over the law.",
            "You are going out to buy stuff that requires ID.  You have to be a mega level of stupid not to have your ID with you. \n\nMy ID is always in my wallet along with money and credit/debit cards.",
            "Your malicous compliance is actually *non*-compliance. Read another way, the policy is that you should not check ID for those who look over 35.  \n\nI'm a manager with the same policy in my store and I have reprimanded clerks for carding geriatric customers.",
            "[deleted]",
            "You did right. There is nobody worth losing a job over.",
            "Plot Twist:\n\nShe was just lonely and liked a good argument.",
            "This is so weird to me... Any time I see anyone over the age of 40 get ID'd, they're delighted that they look young enough to be questionable",
            "When I worked as a waiter, the restaurant's policy was to ID anyone who looked under 40. Because looks can be deceiving, I made it my own personal rule to ID everyone. 99% of the time it wasn't a big issue, as most older people found it flattering when I asked (i.e., \"I haven't been carded in 10 years, thank you!\"). \n\nOne day, an older couple each order a beer, and I ask for their IDs. They seemed a bit upset, but handed over their cards regardless. Well, they were so pissed that I asked, they went up to the hostess stand (which was inside- so they had to go out of their way for this), and demanded to speak with a manager. And since this was a chain restaurant, the visiting quality manager Went With The General Manager!! to their table so to hear their complaints. \n\nSince neither could displine me for following the law, because technically I didn't do anything wrong, the GM just verbally reprimanded me later. \"Just visually judge next time.\" Yeah, and get fired for thinking a 20 year old is really 40? Pass. \n\n\nNever got people who found any and every reason to complain. You're ordering a beer, buying cigarettes, or otherwise wishing to purchase something that requires ID. Just quit your b*tching, show the darn card, and move on with your life. Ya bunch of toddlers...",
            "What's the problem showing your ID? It's a quicker than argueing.",
            "I used to always get carded when I went to buy alcohol at Circle K.  When I was in my late 30s.  By my brother. 😒",
            "In CA, you can't sell cigarettes or alcohol if you're under 18. What state was this?",
            "I remember working at a petrol station back in the UK behind the till. I distinctly remember these two lads that couldn't have been much younger than me asking to buy cigarettes and having a laugh about me ID'ing them, which was nice. I usually liked it when people were light-hearted about getting ID'd. Took a lot of the stress away.",
            "How is it that a 16yo can sell cigs and beer?",
            "Texas sends out secret shoppers to discover who is carding and who is not.  And WILL yank licenses from the employees and fine the company for the violations.\n\nThere ARE signs everywhere in any store that sells smoking products and/or alcohol, be beer, liquor or wine.  If the clerk does not card you, it's best to help them stay on their game.  You will never know when the state will come to evaluate your compliance.\n\nIt's your job folks, and your life.",
            "The irony is that she'd be better off without the coffin nails anyway...",
            "As a smoker i always have my Id no matter what. I grew up bein taught its illegal to be without it so yea! Murica",
            "I worked at a bar for 10yrs, doing IDs almost exclusively for ~8yrs of that.  The number of people that threw a fit over having/not having an ID were rediculous.  We had to have a state issued ID card or Drivers license, or Passport.  The ID couldn't be cracked, chipped or broken. And the ID couldn't be expired.\n\nMan the shit we dealt with doing that was crazy.  \n\nI'm plenty old enough ot not be questioned when buying, but i always get it out and am prepared to show it regardless, anytime i buy alcohol.",
            "I get my ID out and offer it before they can ask for it. It makes it easier and if there is a line it speeds up the transaction.",
            "Doesn’t matter if she can or can not afford an ID. The law states they must have one to buy certain products.  And they need one to legally drive. \n\nShe can hold off on buying something and get an ID, they are not that expensive.",
            "When I worked the door at a bar, I had to ID everyone, even if they were obviously old enough. Some folks who have had several DUIs will actually have a restricted status on the back of the ID. This is to prohibit them from being served/ drink in public. So many old people would get so mad that I had to turn them away. It's not like they weren't aware that they had been to court and a judge had told them they weren't allowed to go to bars anymore.",
            ">Manager asked me afterwards why I still asked for an ID after he had completed her purchase himself the last time.\n\nBut did he _really_ see her ID, or just cave in to her Karen-ness?  I agree that you did the right thing in continuing to ask for it.",
            "\"Miss it is store policy we ID everyone under 35, and I'm pretty sure you are\".",
            "I had to deal with this from time to time when I used to work retail. Some people flip their lid when you ask for ID because they interpret it as an accusation that they're untrustworthy.\n\nYou also have the ones who start something and try to intimidate you into doing what they want.\n\nThen you have the real pieces of work who think they're higher up on the social ladder and therefore superior to you just because you work retail. Those are the ones who get outright offended at doing something a \"pleeb\" told them to do.",
            "I don't understand people who don't just have their ID on them. If you've got your money, your credit card, and so on, how do you not have your ID? How is it not just there as part of the overall package of \"stuff I carry in my pocket/purse\"?",
            "Jesus it's not even that hard. I look like I'm underage, so the only place that doesn't *regularly* card me is a gas station five minutes from my house, because I've been going there for four years so most of them know me. But I still bring my ID just in case. It doesn't even take thirty seconds.",
            "The problem with asking for ID is its only the ones who can't be assed to carry it who kick off. Its not hard to carry the appropriate ID it literally fits inside your wallet 90% of the time and if it doesn't everyone has a jacket/coat pocket",
            "I used to work in a bar and looked pretty young. This one time a family came in. Son came up to bar to buy a round and I ID’d him. Dad came raging over and said he was with him so I should serve him.\nHard nope’d and told him I would be fired and get a £5k fine. He then proceeded to ask me how he knew I was 18 and could legally serve drinks? And demanded my ID 🤣🤣\nI just laughed and said that was checked when I was employed here, have a nice day",
            "If you’re in the US I believe that it’s federal law to not sell someone with an expired ID any tobacco or alcohol products since the ID becomes invalid. So age isn’t always a factor either since they can have a regulatory body check for that too.",
            "I'm terrible at judging ages so when I worked at a theater that sold liquor I was relieved that policy was to card everyone. People would push back all the time. Once when someone asked \"Do I look 21?\" I said, \"No you look like a compliance officer from [state liquor board] doing a spot check.\" They didn't, but that did shut them up.\n\nAt the same job I carded someone for an R rated movie who turned out to be 35. So yeah. Terrible at judging ages!",
            "ngl I'm impressed she was so determined to keep doing that for 6 months",
            "Used to work at a drugstore and I did the same thing, mostly out of principle and for following the rules/law. I was always hassled because out of everyone else that worked with me, I was the only one who asked for ID ever. Even when I moved up to management position, I still ID'd everyone. I feel you.",
            "You'd think after all that time, this Karen would finally comply and show OP her fuckin ID. Good for you for protecting yourself from being fired, fined or even imprisoned for not holding your ground on this.",
            "No cashier likes to check IDs. It's a boring but stressful part of job. Boring because it is just reading numbers. \n\nStressful because of sting operations by government and/or employee also stressful because customers are scum and throw a fit if they don't get their way.\n\nMy job requires to check ID for tobacco for anybody who looks under 40 and everyone's ID for alcohol. So that's what I do because it pays my bills.",
            "It was great fun dealing with stuff like this working at the campus bookstore in college.  Only place on campus that sold cigarettes, and the rule was ID *everyone*.  I lost count of the number of times I was told \"I'm in college, I must be 18!\"  3 of my coworkers could pipe in with \"I was 17 when I started college.\"\n\nEven better was on Friday afternoon.  Since this was back when you could still chalk a NY ID to change the birthdate,  we lost a ton of cigarette sales because we told them that we can't accept an altered ID.  Of course, we also jacked up the prices ($9, back when it was still $6 or so a pack anywhere else), and people still got pissed, mainly because they had to walk to the gas station across the street.\n\nStill came back to bite me though, when I turned 21.  My birthday is in November, and my new ID was sent home, so I just figured I'd pick it up when I went home for Thanksgiving.  At that time, NY ID's looked the same for everyone, they just had \"Under 21\" on them if you were underage. Couple days after my birthday, I stopped at a gas station to pick up a 6-pack, and this was the conversation:\n\nCashier- No sale. ID says under 21.\n\nMe- Is this a valid ID?\n\nCashier- Yep.\n\nMe- Has it been altered in any way?\n\nCashier- Nope.\n\nMe- Does the birthdate show that I'm over 21?\n\nCashier- Sure does.\n\nMe- So, can I buy this beer?\n\nCashier- Nope.\n\nMe- Why?\n\nCashier- ID says Under 21.\n\nTechnically right, but still a little payback for denying all those college kids their Marlboros though.  Of course, the next place I went to sold me beer without even carding me, so whatever.",
            "I remember my grandfather flipping out and saying that he would never shop at BJs again because the automated checkout said \"ID required\" when he tried to buy beer.  \"Do I fucking look like I'm under 21?\"\n\nNo amount of explaining that it's a machine and has no way of knowing what age he looked like would convince him.  I even tried simplifying it by saying \"this is like arguing with the washing machine, do you really expect it to see things from your point of view?\" but still nothing, he seemed to think this machine should know exactly what age he was when he walked up to it and that it's entirely the store's fault that it didn't.",
            "\"Also, for those of you concerned that this lady didn't have / couldn't afford ID, she was driving a brand new BMW Z3? finances were not at issue.\"  \nFuck that, this bitch can come in to buy cigarettes on a regular basis. She can go fuck herself.",
            "I worked at a place where the policy was to ID EVERYONE no matter what. The amount of times I had to point to the sign on the cash register stating that because some elderly woman was annoyed that she couldn't buy wine was astounding tbh.\n\nI had to refuse alcohol sales several times to people because of it.",
            "6 MONTHS?! And she couldn’t be bothered to bring her ID even just once? Damn.",
            "I work in a store where we have to ID absolutely everyone. I watched a lady throw a fit and scream at my store manager because she didn’t have an ID on her. Dude was amazingly calm and told her he couldn’t help her if she didn’t have a valid ID. I see the same guy literally daily and have his birthday and expiration date for his ID memorized but I can get fined and/or fired if I don’t ask for his ID every single time",
            "I get happy if I'm carded. Makes my day",
            "You should always check ID regardless of whether you've seen them before. You don't know if secret shoppers are watching.",
            "If she was driving she should have had her license on her.",
            "In Sweden you have to be 20 to buy alcohol in the store, (which also is a special, government run store and the only place you're allowed to buy alcohol to bring home). Now I'm 30, my husband is 31, and I always get ID'd, my husband doesn't, so when were in the store together and I get ID'd my husband just says to the cashier: \"I married a young wife 'smirk'\", and we all laugh about it :p I mean, come on, it's not like it's gonna kill you to show ID, and besides, I just take it as a compliment when I get ID'd since the cashier is supposed to ask for it if you look younger than 25.",
            "I told people frequently when they got mad I didn't magically know their exact age by sight that appearances were deceiving - I wasn't even going to mention carding this one woman for booze... She was 25. Looked 90+. Multiple hard drugs is my guess.\n\nCarded a lady, she laughed. \"I'm sorry, ma'am, but I'm supposed to card if you look under 40.\" She laughed again and handed it over. \"... WOW no way! Happy early/belated birthday!\" (I forget which, it was a week off.) She was 60 and looked *maybe* 30, if that!\n\nHad a man throw a massive tantrum... He was about 41ish?\n\nWas at a gas station in Arizona one time (06?) and saw a placard at the register: \"We regret to inform you that if you are fortunate enough to appear under 40 we will need to see ID for cigarettes/alcohol.\" Good way of handling it.",
            "I once had a semi-professional rugby player who looked about 18 refuse to show me ID for an 18-eater product, but he did show me his Wikipedia page as proof of age. Gee that’s so reliable, good job nobody can edit those pages, right?",
            "I am 39F and was ID’d last week at a restaurant. YES YOU CAN SEE MY ID. What a compliment. I can’t believe people get mad about this stuff. If I can still pass for under 21 to someone, I’ll take it!",
            "I’m 33 and by UK laws, if the cashier thinks you look under 25 you need to show ID. \n\nI get upset when they DON’T ask me for ID ffs.",
            "I sometimes get carded in a liquor store even though I'm a grandfather (100% ID policy). I just laugh, show my ID, and say that maybe next time I'll send one of my kids to buy for me.",
            "The grocery store near me growing up had signs that said \"it's a compliment when we ask for ID because you look young\" or something like that.",
            "I feel for your younger self. Spent two long years managing a store like that and people were absolutely atrocious in regards to the ID policy. I feel for anyone in those positions because the public is fucking VILE",
            "At the begining of the lockdown I took at job at the village shop which is part of a big chain the the UK. The If the person looks 25 or under the law is to ask for ID for energy drinks & lottery (16 and up), and Alcohol & Cigerettes (18 and up).  \n\nI recenctly quit the job because of emotional duress. One of the main contributing factors was dealing with antsy customers all day of which there are plenty. Because I'm new to the area I don't know anyone so I'd ID everyone who looked under 25 which gave me a reputaion. People whould frequently make snaky comments and take the piss when I was working the till. The amount of abuse I got for trying to follow the law is unbelievable.",
            "When I was a kid I used to work at a grocery store.  We had to ask for ID for pretty much the same reasons.  If I wasn't sure, I pulled my manager over.  Let them take the fall if it goes sideways.\n\nOne Sunday morning I had a particularly nasty woman come through my line, started berating me, etc.  It was 11:55 in the state of NC and I politely asked her to step aside to make her beer purchase at noon per state law.  10 minutes later she was up at the front talking to my manager.  Whatever fuck they could fire me and I'd have another job 5 minutes later.\n\nI ended up getting an accommodation.  She was from the Alcohol control board and they tried to get me to break the law.\n\nWhat a waste of taxpayer resources.",
            "This reminds me when I was working in a supermarket. The legal drinking ago in the UK is 18, and I was checking out the shopping of a mum who was with two teenage daughters definitely under 18 years old. She was buying bottles of alcohol, but as the alcohol section was right by the tills, I heard her daughters pointing out what drinks they wanted.\n\nSeeing as the alcohol was for the daughters, I asked them for some ID. The mother quickly interjected with \"These are for me, I'm paying\".\n\n\"Okay,\" I told her. \"May I see some ID please?\"\n\nI wouldn't be posting this story if she had had ID, so I refused to sell her the alcohol as she couldn't provide proof of her age. She left huffily, and although I know she probably went to a different supermarket, ours was the cheapest for booze so she probably would have had to pay more. Just doing my job, lady!",
            "At a higher level its a way of weeding out selling alcohol to the homeless who often do not have ID. Also do not get me started on people and their only selling alcohol to people who live in the same state crap. I understand the CYA of the clerk but the powers that be that create this situation have bigger agendas. The USA is so puritanical when it comes to booze anyway.",
            "I have a friend who is a complete bum. Hasn't had a valid license in years but pretends that he does and we pretend we don't know he doesn't. He always throws a hissy fit when he is IDed. Luckily for him, the local liquor store doesnt look too closely at the expiration date or really care that much tbh (they don't really card people once they've seen them a few times). Anyways, we all went downtown to go to the bars and they deny him based on expired license. His go-to is an exasperated sigh, shocked look around at the people watching him get denied, say \"come on man\" and then finally giving up. Like, dude, you know where we were going, you know you need an ID. Don't be shocked when someone wants to see your ID at an age restricted place.",
            "I worked at a chain grocery store for a year when I was 16 and I REVELED in my MC to require ID for cigarette purchases. Customers got SO MAD bwahahahaha",
            "I had someone like this when I was a cashier. Some guy was buying alcohol and an 18 movie (r rated). I asked him for ID as he didn't look close to being over 21(the age they had to look over to not ask for ID. Legal drinking age is 18).\n\nHe didn't have any so I couldn't sell him the stuff he wanted. He said that's fine I'll get my mum to come in and buy them. Now, we are not allowed to sell alcohol to someone if we suspect or know it's for someone else unless correct ID is shown.\n\nHe and his mum came back in 5 minutes later and came up to me. She was all smiles as she said she was here to buy his items. I told her that unless he produces ID then I couldn't as I would be breaking the law.\n\nShe asked to speak to my supervisor. Who also explained that I couldn't sell her the alcohol for her son as it's breaking the law. She left looking angry but lady it is not worth my job, the risk of a hefty fine and/or jail time to sell your son some shitty Budweiser.",
            "This is the worst, I know it. Working at the big yellow general store we were required to have ID on literally EVERYONE who bought cigarettes, and they actually had people randomly reviewing the register cameras to make sure the cashier checked or they'd get some kind of disciplinary action. So many people complained, especially the older ones who were clearly in their 60s at least.",
            "Stuff like this always confuses me. Whenever I buy something age restricted I will put my ID on the counter before they even ask for it. Allows me to get in and get out with a minimum of human interaction.",
            "That reminds me of my story that’s similar but not as good. \n\nI my area you have to be 18+ to buy a lighter... I guess because of tobacco laws? Anyways...\n\nA kid that looks 16 or 17 comes in (I was also about that age so I would know) comes in to buy a lighter and absolutely nothing else. Doesn’t have an ID. At this point I didn’t even realize you needed one for a lighter and I was as surprised as he was. He claimed he didn’t have an ID, gave me a hard time, and left. \n\nTo this day I still kind of think it was a sting - a ploy by police where they get underage people to buy stuff without showing an ID. I would’ve lost my job and possibly(?) had to pay the fine myself at that time which was several hundred dollars AKA a few weeks worth of work. Not worth it pal. Throw a hissy fit somewhere else. \n\nThe funny part was we had matches that I offered him for free!! Wasn’t good enough for him.",
            "When I was working at a gas station, the laws were that not only could you not sell to someone underage, but you had to see an ID for every sale.  You could sell a pack of Marlboros to your own grandfather, but if a liquor & cigs agent didn't see you check his ID then the store could lose their tobacco and liquor license.\n\nAnd people would get pissed if you asked for their ID for the third time that day they came in for a can of Schlitz.  \"Your malt liquor is not worth my job or the stores existence\" was something they were somehow not able to understand.",
            "Used to work in retail and I can't begin to tell you how much this chives my spuds. The worst ones were the ones who kicked up a fuss but had valid ID. Like bro fine your 28 but you have ID so its no drama just show me and move on, no need for the tantrum about being well over the legal age",
            "Sweet sweet stubborn person! Good job!",
            "Why did you ask a woman you took to be mid 40s for ID in the first place? You said the store policy was for people who looked under 35?",
            "I was carded at the ABC store in Hawaii for buying beer. I was 55, and looked at least 50. Must have been a store policy :-)",
            "At the store I used to work at you had to ID EVERYONE even if they looked 90. I think that’s a much better policy. I’ve seen too many 20 year olds who look 40.",
            "Former convenience store clerk here: Good for you. Always ID. Even if you've seen it before because it might be expired.",
            "Meanwhile you have the inverse occasionally. Friend was 25, we went into a liquor store where if you look over 35, they don't card you. If you are under 25, ID checks are also double checked by manager.\n\nHe had his ID held out but the cashier didn't take it. When he asked her why, she just pointed up at the \"If you look over 35, we don't card\" sign.\n\nMy friend (who has been balding for a while now) died a little bit on the inside that day.",
            "Also went to a club once in Chicago (I’m from England) forgot my ID as I was used to getting in in UK. Doorman asked for it, said I forgot it and was prepared to be kicked out. He let me in cos of my accent 🤷🏻‍♀️",
            "Who is over 40 and can’t find their ID?!",
            "Some places it is the law. in Quebec. To buy the legal weed at the SAQ, you are required to have your Id regardless of your age. You could be 85 years old, the province mandated to have ID shown. At least it is security at the door that does it. They know me enough I just flash it they briefly look. At first it was a real look. It is just a rule province mandated so they follow it for every single person.",
            "I worked for a big box store once and we checked ID if you used a credit card.  I was new to the area (and the state for that matter) and I asked for ID without fail.  I had one gentleman get rather annoyed with me because I didn't know who he was.  He had to go out to his car to get his ID, the other customers informed me of who he was, someone higher up in the government for that state.  Another time the local weather man came in.  I didn't watch the weather and had no clue who he was.  Asked for his ID, he was amused but didn't make any fuss.  After he left my coworkers laughed at me.  Management thought I was crazy but agreed that I did in fact follow policy.",
            "My GF works at a bank and there are multiple people a day who get mad when she asks for their ID when asked to move thousands of dollars, like they have a private client system where if you recognize them you don't need their ID (which is kinda a lot of customers idk) but even if I went there regularly I wouldn't want just any dude who looks like me have full access to my bank and these people apparently never think of that.\n\nShe actually gets more people mad about showing ID than wearing a mask",
            "It's a compliment, it means you look young",
            "It's her own fault",
            "My local grocery store's computer system will not complete the purchase of alcohol unless the customer's ID has been swiped like a credit card to prove it's valid (at least in my state, there's a strip on IDs).\n\nOne day the lady in front of me in line was fussing about how having to swipe her ID was a violation of her privacy and she would just go buy alcohol elsewhere.\n\nShe was like in her 50s so it's not like she was trying to be sneaky. She just for some reason thought swiping her ID was more invasive than letting a cashier look at it.",
            "Did your store do the sneaky sting operations too? Ours did. Cops would send in people who were or just looked under-aged for the sole purpose of catching us in failing to ID them. You were lucky if you got fired, the punishment for that I was told was a $1000+ fine. Whether that was true or not I don't know, and I was not going to risk it for a job that only paid $9 an hour. \n\nI got petty myself. Typically if I've sold to someone enough, seen their card and recognized them, I wouldn't ID them. This was practiced and taught by my manager. But if at any point in the process of my asking they got nasty about it? I'd ID them every. single. time. My manager fully had my back, so if they tried to go all Karen and demand to talk to him, even if he knew them he'd go, \"I didn't ask you, she did. ID or leave.\" It was absolutely a power trip on my part, but only for the wicked. Just carry your ID if you're buying cigarettes/alcohol. It's not hard? You should have it anyway? Why are you driving without your license!?",
            "Can relate.",
            "Worked at a bank, right on the first day someone was furious I asked for their ID and ended up complaining about me to higher ups while also slandering my name at their company as well.",
            "When I was 18, I walked into a liquor store with my 30+ year old aunt.  We both put a bunch of booze on the counter.  She got carded and I didnt...we were both flattered lol.",
            "What baffles me was that she was still trying after that long.",
            "I used to card this girl who i knew was over 18 for cigarettes. And everytime she had to go back out to her truck and get it. Why, you might ask? She would park her big ass truck on the side of the building and block view of the gas pumps",
            "Those times where someone gives an excuse and wants you to proceed without the ID, could be a sting operation.",
            "Why would anyone drive without a license? I'm assuming her license was with her purse so how did she pay?",
            "I'll never understand the people who get irritated about having to show ID for restricted purchases.. you know it's the rule..\n\nI used to work at a gas station and I would just card everyone unless they were clearly over age.    Basically the only people who got pissed were co-workers and younger people. \n\nI don't care who you are. Your convenience is not worth my job.",
            "I'm with you here brother.\n\nEven if the bitch looked 60... no ID, no sale.\n\nHow many times does she have a fit? How fucking long does it take for her to learn to show an ID.",
            "> Also, for those of you concerned that this lady didn't have / couldn't afford ID\n\nProlly shouldn't be smoking if that was the case.",
            "When I worked for Walmart in the electronics department, I would even card people over mature video games. I even denied a sale due to lack of ID.\n\nAnd when I would be called to work a front-end register, I would make sure to card for alcohol. The store had gotten busted by the local town over an alcohol violation before I started working there, so they required everybody to be carded. Thankfully I never had to work the single register that handled tobacco sales.\n\nThe only other sale I denied was an ammunition sale due to a damaged Firearms ID card, but that was more of an assistant manager denying the sale.",
            "I checked the ID of a woman on her 94th birthday to serve her alcohol. Company policy was to check every ID regardless of how old they looked and I really needed that job. Fortunately she was a very sweet woman and blamed her “youthful face” for me having to check.",
            "I don't understand people, no matter how old I am or look, I always bring id because I understand some cashiers just ask for it from everyone. It should not be a problem. Just bring your ID people! The self importance of some folks is astounding.",
            "Wait you were able to sell alcohol and cigarettes at 16?? I’m 17 and I can’t sell either! I work cashier at Walmart, you gotta be 19 to scan/sell them, so I have to get someone who can do it for me.",
            "I'm over 27 and I get ID'D EVERYDAY.  For things such as energy drinks (age is 16 in the uk) and paracetamol on top of alcohol etc.\n\nAt this point I have my passport out ready and don't give them a chance to ask.  My co-workers think it's hilarious when customers ask if I'm on work experience at school etc.  I hate looking like a 15 y/o",
            "i can't tell ages so ya i id everyone",
            ">There was no way in hell 16 year old me was going to risk getting fired or arrested for a shitty minimum wage job, so I ID'd EVERYBODY.\n\nWhen I was at a concert in America, I went for a beer. Had ID in the form of my UK Government issued Driving License. They wouldn't accept, and I'd left my passport in my hotel room.\n\nThey were ID'ing everyone too, even guys in their late 50s that were clearly of age. Slowed the whole process down and all that did was piss off everyone. Common sense right out the window. Don't do this.",
            "You my friend are a dick...and I salute you.",
            "I get that. For the first time- for camera purposes. But the second time?!? She knew I wasn’t under 25, she’d just seen my ID. \n\nI am unclear on what the policy is because there have been occasions where once someone has seen my ID (in that shop) they don’t ask for it again as they know I’m over 25. I suppose policy may be to check ID every time. But she still seems like she gets off on it to me.",
            "It’s insane that you can get arrested. If I mess up it’s the stores fault and I can get a warning (from the company not the law) 3 warnings and they “could” fire you. They don’t since we only get checked once a year.",
            "When I was early 20 me and my roommate would regularly have beer after work. The liquor store was literally on the same block and I was most always the one to go buy for whatever reason. This one lady there ID'd me everyday, (yes I went too much, I don't really drink at all now) until one day her coworker said why do you ID him every freakin day? I never saw her again to know if she would have continued lol. It wasn't that busy theee that she couldn't remember a regular, I was usually the only customer in there.",
            "Used to do till work and having to ID people made you see them at either their best or worst. \n\nGreat to hear you kept your integrity.",
            "Usually, the addicts who were old enough acted old enough when you carded'em, but some of'em, particularly those having a niccy fit, could be really childish about it.",
            "As a military wife who worked in a small town bank where everyone grew up together, I feel your pain. I’ve been cussed out so many times for IDing people it became comical. The particularly nasty customers I made sure ALWAYS got IDed. If someone was just not having it, my go to was “I can put a note on your account to never ID you but a fair warning, anyone can withdraw from your account at that point”. Only one person obliged in the few years I worked there.",
            "“Kareny Karen”=amusement",
            "She couldn't possibly have had an ID.  If she actually had ID... I've seen severe head trauma victims with better memory than her.",
            "Where do you live that a 16 year old can sell alcohol and cigarettes; which are for 18 and 21 year olds in most places?  In other words you have to be 18 years old to sell cigarettes in most places or 21 years old to sell alcohol, at least in the United States. That's why I'm asking the question.",
            "There was this store some years ago that refused to sell tobacco to anyone without an ID. This changed quickly when the elderly that might not usually walk around with their IDs were denied to buy their cigarettes and even energy drink.",
            "Why didn’t see just go to self checkout or go to a different lane",
            "Not MC, that is CYA. They don't follow the rules they don't get the smokes. I ask people, if I get fired are you gonna pay my bills?",
            "Am I the only one that just has the ID out with my credit card to pay? Why make them ask and then open your wallet again just have it in hand no big deal!?",
            "Yay for you! Nothing more unnerving than being a 16-yr-old selling alcohol and tobacco. I know, I was back in 1979-80.",
            "I had one of these once.  Guy buying liquor with EBT (state assistance card), never had ID, would flinch if I asked but made a big deal out of it because all the other cashiers at the shithole I worked at never asked.\n\nThen I saw the card, and it wasn't his.  He said it was for his girlfriend and that she was in the car.  Sure buddy.  I could have called the cops, should have kept the card.  I don't remember what happened exactly other than him not getting any merch, but I soon made manager and that shit did not fly anymore.\n\nI put in a bunch of improvements (moved liquor behind a counter instead of leaving it by the front door, I am not kidding; computerised scheduling instead of using photocopies and white-out).\n\nThen I quit and they went back to their shenanigans and now they're out of business.  Sorry for the ramble, but I'm still salty about a lot of things from there.  I've had jobs pulling rotting carcasses from crawlspaces that stunk of that and old cat pee, and this was worse.\n\nEdit: to answer a question I can't seem to see the comment for, this was in Michigan about 10 years ago.  Looking at cards now, EBT wouldn't work for tobacco/booze but it's possible they were using cash back from a Bridge card.  Bridge doesn't allow smokes or booze directly but you can get cash from some cards and then buy whatever you want with that.  Totally not an obvious loophole to be exploited.",
            "\"May I see your papers Comrade?\"",
            "I thought you had to be at least 18 to sell cigarettes and alcohol at least in the us",
            "the problem w/ this is the manager knows you are just straight up costing the store sales w/ this. So he will probably screw you over.",
            "Another possibility is that her id/license was expired. Regardless of whether the age is accurate, if the ID is out of date, it's not legally considered a legitimate form of identification, and is subject to the same punitive measures. Some cashiers don't care about the expiration, but the government and those sting operations designed to get people in trouble do.",
            "I smoke. And being ID’d is just part of the process.\nThe only time it really bothers me is when I go to the same place all the time, and a staff member that has sold to me multiple times asks. I generally go at 11 or 12 at night. It’s not like it’s busy. Ever. We’ve talked even. What the hell. Even then it only rises to the level of minor annoyance except one time I forgot my ID at home (only had a passport at the time) and this guy ID’d me and I just kinda looked at him and said something along the lines of “really? You’ve seen my passport a million times” and they replied “yeah I know but it’s policy”.\n\nI get it. And it is my fault. But still.",
            "I think your teen self was my spirit animal.  Umm wait, that sounded odd. Urr, yeah, so awkward.  Nevermind",
            "Why is it that women smokers age faster than men?",
            "Back when I cashiered, the state would change the rules regarding IDs all the time, so it would get confusing for clerks and customers used to previous regulations. At one point the state said we could accept Drivers Licenses from any state, but not plain ID issued out-of-state. It made no sense, but like the OP, not following the guidelines could result in jail time. \n\nAnyways, one day this woman came in trying to buy a six pack, and I asked for her ID. Unfortunately it was out of state ID (not an actual Drivers license). I refused her and she was disappointed, but I explained the issue and she understood and left. \n\n3 minutes later her boyfriend/partner stormed in all red faced and mad. He immediately started yelling at me, demanding that I sell her the beer. I ask him for ID and he says he doesn't have any. I then re-explain the problem, that I was following the guidelines. \n\nHe yells back, \"well 6 million Jews died because the Nazi's were just following orders!\" then tried to spit on my. Thankfully I was about 8 feet away and his spit just came out as a shower of spittle, but the intent was there. I called the cops and he ran out the door like a coward.",
            "But well pulling out your ID when you turn 18 and you're order beer for the first time in a bar well that does feel epic so yea. ID me please, and I actually like that when people ID me and be like \"You're 18???? Howww\"",
            "This story is so similar to that Karen video posted a couple days ago where she was trying to purchase wine at a CVS....",
            "Admittedly I was very lax with the ID rules when I was selling cigarettes.  I almost definitely let a lot of teenagers buy a pouch. Just as someone ‘misread’ my ID and let me get away with buying ciggies from their shop while I was 16",
            "This thread makes me feel old.  When I was a young lad, no one cared about carding for cigs.",
            "And, incidentally, I did ask why, yes. Her response to that was ‘because I said so’.",
            "Worked at a gas station where we sold beer, smokes and lotto. Had some lady come in with her friends and they all got whatever. ID'd the first two since I just asked out of habit from being there long enough. The obviously past her 20s Karen came up and asked for whatever, and I didn't bother asking. \n\nShe then jokingly asked if I was going to ID her to, so I said sure, can I see your ID please. She went to take it out and then realized she didn't have it on her. \"Oh sorry I must've left it home, but it's fine you can still ring me in\". Walking up behind me I hear a stifled laugh as the supervisor on shift with me at the time calmly says to her \"No, sorry. After we've asked for an ID we aren't allowed to sell any restricted products until we've seen it.\"\n\nAnd she sprouted the best expression I'd ever seen while working there, while stammering and trying to convince my supervisor otherwise. Was a great experience.",
            "You could of ended that with one smooth set of words \"I can't believe you're a day over 21\".",
            "To be honest, I take it as a compliment when I get ID'd.  It's like they're telling me that I look younger than I am.",
            "Where can you sell cigarettes/alcohol under 18?",
            "I always had ladies be offended. Like, I couldnt win. “I’m definitely over 40 and you know it *harumph*”\nOr the gem where I decide the lady looks over 40 so I don’t ID her (she legit looked 50ish), and starts bemoaning that i Didnt ID her so say wails, “I must look ooooold!😩”\nAwkwardly I just shook my head and said, “Nah, you look honest.”\n\nAt least she laughed.",
            "Did the same thing when I worked at a gas station. Fines and other penalties were our responsibilities passed on by the store. ID'd everyone.",
            "What state? I know in IN, state IDs are free. Only ones you have to pay for is your driver's license, and it's still not very much.",
            "> Also, for those of you concerned that this lady didn't have / couldn't afford ID\\[...\\]   \n\n\n  \nThe US and A impresses me each day. A supposedly first world country where it is a perfectly logical thing to be too poor to have an ID",
            "That title just reminds me of Benrey. “Can I have your passport?”",
            "My concern is that she driving without a license",
            "How do people can't afford ID???? I thought you have to have an ID to be considered legal citizen, isn't it?"
        ]
    },
    {
        "post_id": "8j739b",
        "author": "None",
        "title": "You're fired....now give us all the passwords",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8j739b/youre_firednow_give_us_all_the_passwords/",
        "score": 17187,
        "num_comments": 797,
        "created_utc": 1526246510.0,
        "selftext": "I already posted this story to r/pettyrevenge and someone said I should post it here....\n\nTo cut a long story short, I got fired from a managerial position in retail because I was technically the highest ranked person on duty when a minor security breach occured, despite the person who carried out the breach fully confessing, absolving me of blame and I was doing admin stuff at the time. \n\nBefore my disciplinary I knew I was getting fired. I had put everything the company did on Google Drive and I also had the social media passwords etc.  So just before the disciplinary hearing I used Lastpass to change the passwords to as long as possible (Google allows 100 characters) and made them random letters, numbers, symbols with interspersed capitals. \n\nIn my disciplinary I was told I was being fired with 4 week's pay as is standard as long as I followed procedure, including handing over the passwords. So I did.\n\nI copied the passwords into a Google Doc on my phone, changed the font to lobster bold italic, and took screenshots of them (so they couldn't copy and paste), then emailed them to the owners.\n\nNot all of them were 100 characters, but I had to give the passwords for PayPal, Google, Facebook, Twitter, and Instagram.\n\nThey didn't ask me for the WiFi password as that was still set to the same as when I started, but I did change it along with the router password, and inside the shop is a 4g blackspot. \n\nEdit: to those asking if they could have just reset the passwords....the Google password was linked to what I think was the owner's old number. The social media accounts were recoverable via the a Google email. And they have since updated their social media about 10 days after this happened so they must have got it eventually.\n\nTo those asking if I was an arsehole who deserves to get fired....well I never said I wasn't. But I didn't want to get onto the details of why the owners and I hated each other. But in my eyes, I was in the right, and in theirs they were.",
        "permalink": "/r/MaliciousCompliance/comments/8j739b/youre_firednow_give_us_all_the_passwords/",
        "comments": [
            "My favorite part of this was the use of lobster bold italic font.  I had to look up to see how truly ridiculously evil it is.\n\nHilarious name for a font as well :P\n",
            "What did they say when you gave them the passwords?\n\nYou had any issues with them since (ie trying to withhold your final pay) etc...?",
            "As a software developer I can say I approve of what you did. \n\nThe format and length of the passwords are sufficient for password security. And you should never store/transmit passwords in pain text... so he encrypted them before transmitting.\n",
            "why not lllllllIIIIlllllllllIIIIIIlllllllIIIIllllllllllIIIIIIlllllllIIIIlllllllIIIIIIlllllllIIIIllllllllIIIIII in arial ?   ",
            "[deleted]",
            "I would have used Wingdings. They'd need to make a cypher and decode it by hand.",
            "I hope you used both l and I, as well as 0, O and Q in your passwords.\n\nHowever, you missed an opportunity to strike a deal: easier passwords if they give you a blow job.",
            "[deleted]",
            "[deleted]",
            "Sorry maybe im a bit slow here, but couldnt they like, use forget password to reset password? Maybe im missing something here haha",
            "I hope you realize you made life hell for people who had zero to do with your firing, all the while kind of making me think you were fired for a very good reason.",
            ">So just before the disciplinary hearing I used Lastpass to change the passwords to as long as possible (Google allows 100 characters) and made them random letters, numbers, symbols with interspersed capitals.\n\nNo diacritics? \n\npfff. Amateurs. ",
            "This reminds me of the guy that owned the anonymous email server that Snowden used.  He got a national security letter and was ordered to provide the government the encryption key for some servers.  He printed it out and brought it to court.",
            "for the lazy/curious, [this is what bold italic lobster looks like in google docs](https://i.imgur.com/kwvYVIU.png)",
            "As a Security Awareness professional...I not only approve of, but *heartily endorse* your actions. ",
            "...This isn't Malicious Compliance. This is, at best, Petty Revenge. They didn't tell you to change the passwords. They didn't tell you to screenshot the passwords. And I'm guessing there are no rules or regulations at the work that would require you to do those.",
            "Why though? I mean I guess I'd get it if you just didn't give them the passwords, although they'd probably have cause to sue you at that point, but just making some intern go through 500 characters of passwords and waste a day of their life trying to make the accounts work again? What does that really accomplish? Not like the management will spend more than a minute of their lives fixing this mess. ",
            "[deleted]",
            "Sysadmin here... what you did (while hilarious) would get you blacklisted from ever worked again in my field. Possibly even have legal action taken against you if you didn't comply with the follow up email of \"these aren't readable, please forward us an editable document with passwords contained immediately or your pay will be withheld and we will begin legal proceedings\" that would have been a near instantaneous reply.\n\nI mean like I said.. it's funny, no argument there. But fucking with company passwords gets really ugly really fast. People have legitimately been arrested over this stuff.\n\nThat said all your probably did was fuck over the IT department who would have been forwarded your images and told \"change these\". So... yay?",
            "What's your next gig?  I'm guessing your last employer won't give you a good letter of recommendation.  Does this concern you?  Only curious on the off chance I'm terminated for some bullshit reason in the future",
            "So .. let me get this straight. You were chillin' in the office when one of the employees you're supposed to oversee messed up. Then you got them to take the blame. The employer was nice enough not to fire you on the spot and offer you one month's pay without requiring you to do pretty much anything but hand over the keys. But you decided that wasn't good enough, you weren't at fault and messed with them instead, to prove who the real child is. Did I get it right?",
            "so you weren't too good to take a month's pay, but they're the assholes",
            "This is awesome. When I was f'ed over in a job I had to return the company issued iPhone. It was password protected and the IT guy set it up for me when I initally got it. I was a super easy code (0000 or 1234) when I got it and I was instructed to change it which I never did. Couple weeks pass and the IT person who gave me the phone messages me on Linked In asking if I could give him the password. This was after some false pleasantries. I gave me so much pleasure to tell him no. ",
            "Don't burn your bridges.  ",
            "But every major service has a 'forgot your password' feature...",
            "You’re a dick. Sounds like your employer made a good choice overall hahaha. ",
            "Something tells me they fired you for being an asshole and were just looking for an excuse.",
            "is there a butter font to drizzle on that lobster font????",
            "> well I never said I wasn't. But I didn't want to get onto the details of why the **owners** and I hated each other. But in my eyes, I was in the right, and in theirs they were.\n\nYeah, I'm going to go out on a limb and definitely back up the assertion that you were indeed deserving of being fired lmao. Crazy story though.",
            "You could've also done one letter repeated  a different amount of times for every account. I.e.:\nlllllllllllllllllllll x 97\nlx95\nI x 96\nAll different amounts of times for the different accounts. And of course throw in some capital i's (I) along with the l's\n Muahaha",
            "Should have used one of those fotns that has no difference for lowercase and uppercase.",
            "OP is a dick. Also an aspiring writer of fiction. ",
            "I remember an employee tried something like this with me several years ago, I was going to be nice and pay him out etc even though he was useless and disliked by his team and managers, he tried this shit with the admin passwords so I terminated him for misconduct, no payout, then set the company lawyer loose on him for everything from industrial sabotage to theft of IP.  We  were just amusing ourselves while he spent a fortune on lawyers, we let him off after he paid our costs.\n\nIf fucked his career in the industry as well.\n\nSometimes it's best not to be a dick to people who can fuck you right back.",
            "Wow you are really mature and you are handling a rough situation very well. I can't see why they would let you go for something where you weren't responsible. /s\n\nMaybe you're a shitty person and they used that security breach excuse to fire you, and your attitude may very well prove my point. ",
            "I was on sick leave, and got a redundancy letter in the mail from a place I used to work. I sent them an email from my personal email address telling them to ensure all further correspondence is sent to that email, as I do not check my old work email address. About a week later, they emailed me asking me to send them a bunch of files that only I had  \"Sorry, as soon as I read the letter saying that I was terminated, the first thing I did was delete every bit of data, and shred every document I had in my possession that were related to that company. My employment contract mandated that as soon as my employment ceased, I had to hand over or destroy it all. It's gone\".\n\nI've been laid off from other jobs, and willingly given great handovers to the company. Provided all of the documentation, and even built extra documentation before I left. But this place sent me a fucking letter in the post, to make me redundant, while I was on sick leave for bullying.. I mean, weak as fucking piss.",
            "This is something you do when your peak is a retail management job. Im sure you were exemplary right before that admin issue you got fired for and they werent just WAITING to get you with the first thing that could send you on your way....",
            "Should’ve sent it in wingdings ",
            "Wouldn't they just go through the \"Forgot Password\" flow? They likely will be changing them anyway (since somebody who knew them left the company, and on poor terms at that). ",
            "Lobster Bold? Shoulda went Wingdings...",
            "That's some next level petty right there.  Nice work.",
            "I hope you mixed up lots of Is and ls in there, as well as 0s and Os, just to make things more frustrating",
            "You should have just used a small font size, saved it as some lossy conversion image, and continuously opened and saved it through paint",
            "You should have also witheld the usernames and for which sites they are. You want passwords? Great here is a long list of some long ass passwords and nothing else.",
            "Should've made it wingdings, they would've had a fun game to play before accessing their paypall",
            ">To cut a long story short, I got fired from a managerial position in retail because I was technically the highest ranked person on duty when a minor security breach occured, despite the person who carried out the breach fully confessing, absolving me of blame and I was doing admin stuff at the time. \n\nPeople like to bitch at CEOs for the insane money they make, but they are where the buck stops, and they are responsible for things like this. It is reasonable to pick on mid-level-managers, but firing is a bit extreme I agree.\n\n>Before my disciplinary I knew I was getting fired. I had put everything the company did on Google Drive and I also had the social media passwords etc. So just before the disciplinary hearing I used Lastpass to change the passwords to as long as possible (Google allows 100 characters) and made them random letters, numbers, symbols with interspersed capitals. \n\nCFAA \"password-trafficking\" anyone?",
            "If you can use Unicode in passwords, I cooked up a couple ideas to have fun with that.  \n* Cyrillic letters that just so happen to look identically to Latin letters  \n* An indic script (Preferably Devanagari, Eastern Nagari/Bengali or Kannada) but don't forget to create a lot of ligatures using the script's respective virama character  \n* Thai, but in Sukhumvit Set for great-looking illegibility  \n* Mongolian script  \n* Chinese characters, if possible, use the ones from plane 2. Install Hanazono Mincho, so you can see them  \n* Any ancient script (Cuneiform or Hieroglyphs recommended), if, again, supplementary characters can be used",
            "*googles lobster italic font*\n\nYou monster. I like you.",
            "And here we have an example of why managerial positions are let go without warning. They are able to do massive damage to companies when givin the chance. Thus they usually have access revoked and are escorted off property and told then.",
            "Sounds like they did the right thing by firing you. You sound immature",
            "Well good luck putting them as a reference for future jobs. \n\n",
            "Yeah good luck every using them as a reference “they were fired and they changed all the passwords to gibberish causing us problems for weeks”\n\nI’m sure when you tell your new employer “but they fired me unfairly!” They will care about that ",
            "I would have used \"fuck <company name>\" \"<boss name> suck d*cks\" etc\nalong the lines in passwords",
            "[Bold Lobster in Italics](https://imgur.com/0cRY2eA)",
            "Make the password nothing but uppercase I's and lowercase L's in a sanserif font.  \nOr give them a combination of !i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i!i",
            "> in my eyes, I was in the right, and in theirs they were.\n\nPretty much how most humanity is as far as I can tell. I love your self-awareness to go along with the Malicious Compliance. ",
            "the best part is that i didnt had to read OP life and a wall of text of people I dont care about before getting to the juicy part."
        ]
    },
    {
        "post_id": "mrdxnd",
        "author": "TheBreakUp2013",
        "title": "Short me $70,000 in Violation of our Written Agreement? It'll Cost you $1.8 million.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mrdxnd/short_me_70000_in_violation_of_our_written/",
        "score": 17171,
        "num_comments": 1066,
        "created_utc": 1618490856.0,
        "selftext": "**EDIT 1:**  Thank you for the awards. I appreciate them all. \n\n**DISCLAIMER:**\n\nThe names and some of the situations have been changed to protect the identities, but the dollars and general nature of the situation is completely true.\n\n**BACKGROUND:**\n\nA year out of school in the early-1990's, I procured a job as a business analyst for a large, family-owned tech company. This business was located in the booming heart of technology at the time and was very profitable. As tech took off over the next decade, the company thrived and remained family-owned. What was a rich family and company became exceedingly wealthy with a valuation/net worth in the high 9/low 10-figures.\n\nThe family that owned it was quite neurotic, very moody and had a reputation as very ruthless (greedy) when it came to financing, deal-making, employees, etc. I truly believe this is what held them back from ultimately becoming a household name as a company.\n\nAs I progressed in the company, I gained more and more face time with the owners. I worked on some projects directly with ownership that really paid off and gained me even greater access to their inner circle. Now, like a lot of people at the time and particularly those who worked in tech, I was heavily invested in tech stocks. I discussed some of my investments and gains with ownership as casual conversation, though investing had nothing to do with my role in the company.\n\nThat is until one day in late-1999 when the owner came to me and asked me if I would invest some of his personal money. He wanted me to take big risks to see if they would pay off using 1 million dollars of his personal money. I was a bit hesitant, but still being in my late-20's and wanting to prove myself, I said I would. I asked for a written agreement where they acknowledged this wasn't my role in the company, was a personal matter between the owner and me, and to document my compensation for this side arrangement (20% of all profits).\n\nAround this same time and by working in the industry I started to notice the weakness associated with a lot of tech companies. They just weren't living up to their hype and stock price and some seemed like they were starting to run out of money. I had no inside information, just a strong sense of which companies were struggling based on my work in the business.\n\nBased on this sense I started using both my money and the owners money to short tech companies just after the New Year in 2000. For anyone unfamiliar with shorting, it means if the value of a stock decreases, the value of the investment increases. I had a few long positions, but my overall position was very short.\n\nSince the owner wanted big risk and big reward, I used his money and obtained leverage or margin from the financial institution where I maintained both his and my trading accounts. The accounts were separate, but both under my name (again, I documented this and gained consent).\n\nWell, both my account and his suffered some moderate losses in the first two months of 2000 before the bubble began to burst and both accounts, but his in particular, began to skyrocket.\n\n**OWNERSHIP'S PETTINESS**\n\nIn June, the company began to suffer a downturn. We were still profitable, but since we provided tech services and products we were not immune to weakness in the broader market. I had not informed the owner of my short strategy. He came to me one day and asked how his money was doing, saying he suspected it was way down like the general market. To his surprise, I informed him that while we still had some money tied up in options (puts) and shorts, but based on the positions I had closed, there was $1.35 million in cash sitting in the account that belonged to him. Again, I still had a bunch of open positions which, if memory serves, were worth about a million on that date, but the positions I had closed had yielded $1.35 million in cash just sitting in his account (which was in my name).\n\nThe owner, either through ignorance or lack of attention, said \"Great, $1.35 million. Fantastic work in this down market. Will you please wire it to me?\" I responded that I would, but would be taking my 20% of the $350,000 profit, or $70,000, before wiring him the $280,000. I also reminded him I still had open positions that had yet to pay off or close, but I didn't state the amount. He, once again, appeared not to understand or comprehend the open positions statement, but instead totally focused on and became incensed about my rightful claim for $70,000. He went on and on about how times were tough, I should be grateful for a job, particularly at my young age, and the entire $350,000 was necessary for him and the company. I knew this wasn't true based on my position within the company. Worse, this was my first time personally experiencing the greedy and corrupt nature that served as the basis for ownership's reputation.\n\n**THE REVENGE**\n\nNow comes the revenge. Since, after two separate conversations, the owner didn't seem to grasp that the open positions would yield at least some income, and thus additional profit, I decided not to mention it again. I sent him back the entire $1.35 million and continued to manage the open positions to the best of my ability. And here's the kicker, the owner never brought it up again. He seemed to think the $1.35 million payment was the entire value of the account and never understood or remembered that open positions still existed. He never asked for records, tax documents or any time of audit or financials. Given the fact that he was dishonest with me, I didn't feel the need to disabuse him of that notion.\n\nUltimately, after a bit more net gain, I covered all of the shorts and exercised all of the options (puts in this case) for an additional $1.8 million. I worked for the company for 3 more years and owner never asked about it during my tenure, after I gave notice, or since. I know it's a bit crass and even shady af, but given his dishonesty with me over the $70,000, I felt justified in keeping the additional $1.8 million. I paid taxes on the gain (long term cap gain), and went on my way with a fantastic nest egg. Nobody has asked about it since and I have only told the story to a few people (and even then only after the statute of limitations passed).\n\nThe final ironic cherry on top of this sundae is that during my remaining 3 years I gained greater influence with ownership in position within the company because they considered me loyal for giving the $1.35 million back and not making too much of a stink about the $70,000 profit. Little did they know I got the better of them. The company eventually folded due to family disputes, but my understanding is that ownership walked away in very good financial position. They likely could have been a much better and greater company had they not practiced the same dishonesty that they showed me with their vendors, clients and employees.\n\nThanks for reading and hope you enjoyed.",
        "permalink": "/r/MaliciousCompliance/comments/mrdxnd/short_me_70000_in_violation_of_our_written/",
        "comments": [
            "I personally wouldn’t post this no matter the time being passed . Why bother risking a loop hole just for Reddit clout",
            "[removed]",
            "ITT: lots of tomorrow's lawyers with specific knowledge about a 20 year old case.",
            "Is it shady? I mean, it's seems shady in general to have a money manager that isn't officially licensed or whatever, but you guys were consenting adults with an agreement. If I understand it correctly, the current account value was $1.35M, and that's what you gave him. Perhaps had there been a real dispute over the $70,000 he would have forwarded the records to a real financial professional, who would explain to him the other potential gains. But he was happy with the current account value, and it seems like he was in a cash-strapped position personally.  \n\nI'm always surprised at people who demand loyalty like this - like, you're trying to explain to him how much more he could make, and he just won't hear it.",
            "If this story is true you should take this post tf down because I imagine on the off chance you're caught it will be a shitstorm",
            "I liked the story, thanks for sharing.",
            "Startups and even established businesses taking advantage of quality workers costs them so much in the long run. Oh well, their loss.",
            "This is how we know the 2020 Presidential election wasn’t stolen. At least one of the hundreds of people required to make it happen would have posted about it on Reddit by now...",
            "A lot of people here seem to be concerned with the legality of all this, which seems strange as firstly the law changes from state to state and country to country (i am based in UK). Also a lot of time has passed and the law has doubtless changed many times since all this transpired.\n\nLegally i don't know where you stand; to be honest, i don't believe anyone, even a lawyer could determine the legality without a lot more details.\n\nThis for me is a moral issue and as far as i am concerned, i will behave in a morally appropriate way as long as anyone else does. If however, they breach any moral code with me, then i will consider that a revisal of the working parameters of our relationship and will behave towards them in the same (albeit morally bankrupt) manner. In other words, I believe in behaving morally, but i also believe in reciprocation when it comes to relationships.\n\nThey broke the moral code first, all you did was do to them what they did to you. Enjoy the money and feel no guilt :)",
            "A lot of people are talking about civil/criminal liability but missing the big picture: crazy owner broke contract first. For all we know OP lawyered up at some point and is well aware of what they were allowed to get away with. Owner wasn’t even totally screwed over, they made 35% profit on their initial investment by screwing OP out of OP’s own commission. It’s much more gray than people seem to be reading.",
            "Delete this post.  I'm happy for you, but delete this ASAP.",
            ">I have only told the story to a few people (and even then only after the statute of limitations passed).\n\nFWIW, the statute of limitations has not passed, the tolling starts when the fraud is discovered. The statute of limitations also runs longer than you seem to realize, it will exceed your lifetime.",
            "[removed]",
            "How did you get that much money in your name without any tax or legal consequences?",
            "The part that bugs me is that for people that do shit like that, that's just a cost of business. The amount they'll save by fucking people that don't or can't fight back will outweigh the bit they lose to those who do.",
            "Bruh you could go to prison for this. Delete this post, your account, and tell your lawyer. Holy shit.",
            "Everyone is ragging on OP for taking the 1.8 million but no one even considers that if the guy didn't want to pay 70k commission for the 1.35 million he definitely wasn't going to pay commission on the 1.8 million either.\n\n\nSo OP should have given all the money to his boss and made nothing for his hard work, even though it was agreed upon, on a paper contract beforehand.\n\n\nYeah OP why didn't you just sue your boss and go through five years of court while your boss tried everything in his power to crush you and lose your job during a bubble in your industry??? /s",
            "If anyone ever asks, just tell them that the 1.8 million in profits came from the success of your $70,000 that you invested after paying the owner what he was contractually owed.",
            "I hope you then rolled it over into bitcoin and have since become a multibillionaire tycoon?",
            "This is on the same lines as the Shawshank Redemption but without the risk of daily gang-rapes.",
            "damn dude, but aren't you afraid somebody will read this and set off a red flag? They couldn't link this account to your actions easily, but they could inform the dick owner of the situation, and ask him to inquire as to the status of his money.",
            "You do realize you just admitted to perpetrating a MASSIVE fraud right?",
            "This was fun to read, I wouldn’t post about it personally but definitely fun to read. 10/10",
            "[deleted]",
            "Excuse my confusion but one of your previous posts says that you were 39 about a year ago which puts you at 40 in 2021. Now you’re saying that in 1999 you were in your late 20s which would put you in the 26-29 range, add 22 years and by today you should be in the 48-51 range. I’m starting to feel a little lied to OP",
            "This isn't a case of malicious compliance. None of this story was even any part compliance. It was lying by omission, and taking money you rightfully knew was not yours but forgotten by the rightful owner. ESH. But hey, at least $1.8 million is a sizeable chunk to risk things over. Not like people who risk fraud charges over a few hundred dollars. Go big or go home.\n\nEdit: some spelling. Currently on mobile.",
            "OP if this is true I would delete it",
            "Definitely theft, but I don't blame you OP if the story is really how you've told it.\n\nIt's not like anyone lost money.",
            "Dude... delete this right away. Not sure about criminal charges but civil claims based on fraud.. the clock only starts ticking once the basis of claim is recognized (by perhaps a Reddit post) and not the fat of the original fraud... just a word to the wise",
            "Damn. God. Damn. That is some sweet revenge, a classic you screw me over I’ll screw you over and then some. But as some have mentioned, if completely true, which I have no reason to doubt. I should take it down even though statute of limitations has passed both criminal and civil. \n\nBecause like you said yourself they were greedy af and they likely still are. Just by checking the amounts you name, they could make a real educated guess to whom this story belongs to. \n\nThey might not be able to come after you through court, but you’ll never know what they’re capable of if they learn this. They’re big numbers, chances are that if he or they find out they will not just sit back and have a laugh at it. \n\nI for one would like to see you enjoy life to the fullest without being harassed or worse by greedy mcgreed & co. \n\nBeautiful story nonetheless but please give it some thought.",
            "You had a **written agreement** and you didn't demand that all parties stick to the agreement?!?\n\nSorry, IMO you are just as morally challenged as your ex-employer.",
            "Doesn’t matter how you look at it, it’s theft. Well done for walking away with a win but don’t tell anyone",
            "Good story but I'm a little lost on the Malicious Compliance?\n\nIs it that you wired him his money when he asked which meant you could make $1.8m for yourself instead of $70,000? \n\nThe way OP had written this I feel like this would fit better in r/prorevenge",
            "I would delete this post mate.",
            "i'm confused - why does this sound like theft?",
            "Put an S on this mans chest!",
            "I kinda like watching arrogant people get their asses handed to them",
            ">I have only told the story to a few people (and even then only after the statute of limitations passed). \n\nGood idea on waiting for the statute to run out first.  Btw, don't you owe me like $100k?",
            "Yeah, this is theft that you are admitting to & securities fraud. Should ve remained quiet n enjoyed yr revenge, but now are exposed for karma hunting. Hope that owner doesn’t read this or someone from sec and decide to investigate.",
            "\"And that, kids, is how I wound up in federal prison.\"",
            "[removed]",
            "If this is real you need to take this down, or pretty soon you will be writing \"TIFU by posting on Reddit.\"",
            "Business stole $70k from him. Business had all the money in his name. He complied with all the owners wishes. As far as I'm concerned he's in the clear. Legally, I have no idea. \n\nMy guess is even if he could get in trouble its been 20 years and the boss seems like the kind of guy who couldn't give a shit about his subordinates. He's probably forgotten OP exists",
            "This is not malicious compliance. It is malicious non-compliance. You specifically did not comply with the terms of the deal.",
            "Theft is not malicious compliance.",
            "I'm not really feeling sympathetic to someone who made a 35% profit and then tried to stiff the person who made it for them out of their fair share.  You did *work* to make those profits, and ditto for managing the open positions after the owner demanded the $1.35 million be wired to them.\n\nIt looks like the owner wanted to be shady, you wanted to do things legitimately... and then they tried to screw you.  It's ironic that the owner would have ended up with $2.72 million (including the initial investment) if they hadn't been so shortsighted.  And you would have netted $430k for your 20%, instead of $1.8 million.",
            "Nobody smart enough to run a successful tech company is dumb enough to hand over 1m, let you keep everything in accounts under your control and in your name and never check on his money.  His CPA, bookkeepers, atty, any number of people would be monitoring his finances and checking those accounts meticulously. You're 100% full of shit, most likely some dumb kid from WSB with 'diamond hands' who just lost his life savings (all $1500.00 worth) with calls on GME.  In the unlikely, nearly impossible, case that this is true, you have committed a felony that is likely to see you in prison for the next 30 years or so.  Even if the owner is dead, this would have been caught in probate.",
            "Damnit I wanted to read this one.",
            "Saw this over at /r/ProRevenge and now it's down. Hope you're okay, OP",
            "Teach me your ways!!",
            "Holy illegal fun. Technically he is still investing the money with a guaranteed 20% profits. Sooooooooooo. \n\nShit",
            "Excellent story OP and I am glad it worked out for you. But take it down - even if the statutes are exceeded you certainly don't need a random crapstorm.",
            "ummmm",
            "You had a contract to invest 1.3mill which you did... they broke the contract so you returned 1 million plus 30%\n\nAll done in your name... contract broken... how have your broken any law.... second they broke the contract you could say you gifted them 300k for looking after their money....",
            "Didn't you post the exact same bullshit yesterday?",
            "Did you not have to pay any taxes on the initial million dollar investment the owner gave you to use?",
            "Holy crap OP, this was a great story not so much of malicious compliance but I enjoyed it very much",
            "This might be my favorite story from this sub. Well done!",
            "I’m not even going to touch the moral / legal ramifications to just say damn that’s so ballsy. Like, I’d be paranoid of some serious repercussions.",
            "The greatest trick the Devil ever pulled was convincing the world he didn't exist.",
            "Please please get a carbon monoxide detector!",
            "Man fuck what everyone else is saying. This dude gets it. Hell yeah brother. Get paid",
            "Hi it's me ur boss",
            "The perfect malicious compliance. I applaud you sir and hope I can live up to that beauty one day.",
            "Why would you post this? Pride comes before the fall.",
            "I may be wrong, but I believe that the statute of limitations only comes into effect after law enforcement is aware of a crime, yet fails to file or act on it.",
            "I’d delete this.",
            "Sweet. You stole from the guy.",
            "What's the statute of limitations?",
            "Loved reading this totally true and not all made up story. I too love it when people ask me to fradulently trade a million dollars for them under my name and taxes (due under my name) don't even play into the equation until after the entire amount has been returned to them. I especially knew it was 100% legit when I got to the part about him just taking your word on how much money was in the account. Lol, seriously tho, was entertaining.",
            "A little shady on both parties, but juicy story👌",
            "Bad WSB fanfic is bad.",
            "What a legend.",
            "I know it’s a year after this was posted but what did you do with the money? Did you become richer and invest or did you just put it in savings?",
            "In response to all the other comments,  if this arrangement was legal then everyone would do it lol.  Just give your money to your broker and they put it on their name and give you some money back eventually maybe less some fee.  Or not.",
            "[removed]",
            "I have no issue with you helping yourself to the money after the owner breached contract.\n\nThe unethical thing here is investing someone else's money in shorts when they obviously didn't understand enough about finance to fully realise the risk of that.",
            "He's a douche for sure but you basically robbed him 1.8m.",
            "This is not malicious compliance.\n\nBasically, you stole 1.8MM because you were upset that your boss (and client) made an unreasonable demand that you waive your fee.  You were in a position to simply take the fee that you were entitled to — but instead you used the request for a fee waiver as a rationale for stealing $1.8MM.\n\nIn other words, you are a criminal and you breached fiduciary duties to your client and boss who trusted you.  Moreover, you know that what you did was wrong — because you refer to passage of time as a reason why you aren’t criminally and contractually liable.",
            "Oh this is great! Excellent job",
            "Good, there’s nothing immoral about robbing from the billionaire class. ESPECIALLY when they are trying to fuck you out of money.",
            "Guys.  Do you really think a family who has no idea about their money is going to have “heirs” log in and do a background search for a random Reddit story because their multi million dollar trust fund baby lifestyle will definitely have them guessing.  God damn it Reddit enjoy the fucking story.",
            "This is less \"malicious compliance\" and more \"outright theft\".",
            "It’s crazy the amount of people trying to crucify this guy. Y’all need to get a grip.",
            "Didn’t you post this yesterday too?",
            "Deja Vue or did i see this on r/ProRevenge",
            "I read this yesterday somewhere, OP has posted it in 4 different places.",
            "OP enjoy the money, take down this post and keep this to yourself. Not woth the headache for Reddit karma/Internet recognition IMHO. Bravo on the situation though",
            "Crass, shady, yet Maliciously Compliant. This embodies the spirit of this sub. What a great read and what a great story.",
            "seems pretty illegal dude.\n\nI would have held out on the legal 20% since you had it In writing.",
            "Nephew, delete this",
            "Everybody telling OP to take down the post but would a Reddit post equate a confession? Omegakek gj my dude you get ‘em",
            "Maybe they would be still be around if they hired ethical employees....",
            "[removed]",
            "lmao why are people on this sub if they’re gonna be such scolds",
            "I’ll be damned everyone in here a lawyer.",
            "Nothing wrong here at all.  A contract that is broken in part is broken 'in toto'.   The money was in accounts in the OP's name, and he can do whatever he likes with it after the agreement has been broken by the other person.",
            "You gave him the amount he asked for, which was at the time the total available. Nothing shady about that. And he tried to screw you so screw him.",
            "[removed]",
            "Love it, great great MC... can i borrow a couple of bucks!!",
            "Can’t believe the ninnies telling OP to be careful or take down the post. Do you want to read dirt or not?",
            "Based as fuck.",
            "I feel like this could be r/prorevenge worthy.",
            "This story isn't even remotely true, but it looks like there's plenty of people out there who want it to be.",
            "[removed]",
            "[removed]\n\nWhy",
            "Wall street bets lol",
            "Good story! Hope you used the money in a better way than he would",
            "If I'm being entirely honest, I don't see anything unethical about what you did. Since he breached your initial contract, I'd consider it voided. And since he gave you all the money, and it was in your name, and there was no longer a valid written or even verbal agreement regarding any of it, at that point I'd just consider it your money.",
            "tl:dr",
            "This is so slimy. I need a shower after reading this. Ick.",
            "I wouldn’t have posted this.",
            "The OP is not the hero of this story. Nothing more than a thief. . ."
        ]
    },
    {
        "post_id": "d98k12",
        "author": "MikeSass",
        "title": "Emergency Room demanded a review. So I gave them one.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d98k12/emergency_room_demanded_a_review_so_i_gave_them/",
        "score": 17140,
        "num_comments": 540,
        "created_utc": 1569441073.0,
        "selftext": "Early August 2018, I tried to break up a late night fight between my cat and my parents' dog, and I lost. Didn't realize at the time just how bad cat bites are, so the next morning when my hand swelled up I went to the emergency room, where they gave me antibiotics. I'd been on antibiotics twice already that year, for pneumonia and a UTI, so despite knowing my allergies to both penicillin and sulfa were on my chart, I made sure to request ones I wasn't allergic to, you know, because duh.\n\nThey gave me sulfa antibiotics and I almost died. Two days later I'm back in the ER and get different antibiotics. I have good credit and would like to keep it that way, so paid off all my bills as soon as I received them. Drama with getting additional bills later to the point where I called and asked the registrant to go through my account to make sure I had paid everything, and if I hadn't, I would like to pay it over the phone. Cut to months later, when I get some very angry calls from a collections agency trying to collect on the bills I had already paid. It took a three-way phone call between the ER, the collections agency and me to figure it out, but we figured it out.\n\nCut to the past two weeks, where I have gotten 10 different emails asking me to review the ER. \n\nOne email, every business day, \"How Did We Do?\", \"Reminder: Give us Your feedback!\", \"Don't Forget to Review!\". \n\nSo I did, on Yelp, Facebook, and Google, just like they asked. \n\n\"This place almost killed me with antibiotics that my medical history clearly states I am allergic to. Then they had the nerve to send my already-paid bill from their attempted manslaughter to a collections agency - I'm likely not the only person they've tried to bully into double paying a bill. Now it's a year later and they've suddenly decided to hound me for a review.\"  \n(paraphrased)\n\nYou can call me Karen.",
        "permalink": "/r/MaliciousCompliance/comments/d98k12/emergency_room_demanded_a_review_so_i_gave_them/",
        "comments": [
            "Yummy medical malpractice.\n\n  \n\n\nIn other news, while medical bills can be sent to collections, creditors are effectively not going to use them as a determining factor when deciding if they want to extend credit. there are some more in specific details, but in general when I'm running someone's credit I essentially ignore anything that says medical payment data.",
            "I had a hospital run by a famous HMO send me a bill (for an ER visit, followed by surgery to put a pin in my arm) that had been paid months earlier, and send it to a collection agency after about a year. I was fortunate in that mine was one of 11,000 bogus bills spit out after a computer upgrade, and it pissed their collection agency off so much they offered to testify against their own client.\n\nI ended up with a private number for the head of non-member billing for the west coast that she personally answered, and three days later I had it in writing that I owed them nothing and that they'd take care of the collection agency.\n\nAccountants do not like explaining to juries why they did something illegal. Not one little bit.",
            "Lil update: I got a canned response on Facebook aka “please take this off social”\n\nhttps://i.imgur.com/hxozOqY.jpg",
            "Did you have to specifically pay for the antibiotics you told them you couldn't have? Did you have to pay for the treatments needed to stabilize you after your allergic reactions?",
            "I had a workers comp claim that required an x-ray for a workplace injury.  \n\nFilled out the insurance info with my case number, and registration said \"yup, well process these bills with your case worker\"\n\nSix months later I got a call from collections, and they had bought my workers comp bill as unpaid.\n\nI turned them over to my case workedr, and never heard from them again \n\nThree weeks later, the hospital sent me the original bill, and a final demand for payment for a bill they had already sold to collections, all because they screwed up the initial bill to W-C.",
            "Ugh, this is the worst. A similar but thankfully not so life threatening thing happened to me once. I went to urgent care after throwing up all night and not being able to hold down liquids. I showed up in my pajamas because I was tired. They left me waiting in the waiting room for something like 45 minutes, and in the office for another 30. Determined I needed IV fluids for a stomach flu. I have never been treated more rudely by medical staff in my entire life than I was that day, and I assume it's because I looked bedraggled. I asked how long the IV would take. They ask why I want to know. Told them that the reason I was in town was that I was set to be a bridesmaid in a wedding that afternoon. It was ONLY when they heard this that they decided to treat me like a person and actually were nice to me.   \n\n\nSix months go by and I get a bill from them for $800. I call and ask what's going on, and they tell me my insurance doesn't cover urgent care so I need to pay the full cost. So I call my insurance and they tell me they only just received the claim from urgent care ONE DAY BEFORE, and they'd already agreed to pay 80%. So not only did they treat me like dirt for not looking presentable at urgent care when I got three hours of sleep and was dangerously dehydrated, but they also tried to get me to double pay the bill and steal an extra $800 from me.   \n\n\nI left them a Google review at this point, and a day later i got an email from the owner asking how he could \"make it right\" with me. I told him that the time to make it right was when I was a sick and vulnerable person at his clinic, and nobody made it right then.",
            "Wait....American hospitals ask for people to leave Yelp reviews? What!? Like a restaurant? \n\n Just every story I hear about healthcare in America seems WILD.",
            "In Australia, they put a different coloured band on your wrist and lost your allergies on it before they give you any medication or treatment. \n\nThey also don’t charge you.(for the ER visit) 🤷‍♂️\n\nYou get charged for the meds.",
            "No, today you are \"Karina.\" You aren't taking shit and it is awfully justified.\n\nI can't believe they had the nerve to even charge you for the second visit. If I almost died from an ingredient on a pizza, I'm fairly sure the pizzaria would offer one on the house, at the very least.\n\nAlso, where the fuck was your pharmacist on that one?",
            "Double billing is illegal, demand to speak to an administrator and state you have statements being pain already and if they do not quit, You will not only call your lawyer, but the State Attorney generals office. This has become a significant problem in the last few decades where your state may have a small group of people dedicated to these types of claims.",
            "I think Karen is justified this time around.",
            "Did you get a response or reaction from them?",
            "My late brother-in-law received a \"How'd we do?\" questionnaire from the hospital he'd died in - mailed to the home of his parents.\n\n\"Ten out of ten, would die here again!\"",
            "Wow America truely is a shithole. A cat bite can put you in collections.",
            "My hospital keeps calling me for a review. I'm too sick to deal with their bs so when I told them it wasnt a good time, they asked when would be. I said morning (so I can sleep through it, I have an odd schedule.) They insist on calling in the late afternoon instead and I made the mistake of answering the phone the last time and this was midway through my most recent week of 102-103 degree fevers so I *really* wasn't feeling good and I may or may not have begged them in tears to stop bothering me. Low moment. They haven't called back.",
            "Hello!! I work for a company that sends these surveys through many different formats. I don’t know which company sent you the survey as typically medical facilities, like this ER, are technically OUR customers and clients. \n\nMy job is to transcribe these comments. I block out PHI and “code” surveys (not medical coding) based on positive, negative, both, and the different things it involves like doctors, nurses, ER, cardiology, radiology, housekeeping, dietary, respect to patient, emotional support, all kinds of stuff. \n\nWhen we see these comments, they get checked as a “service alert” IMMEDIATELY. We send the comments DIRECTLY to whomever handles customer relation type things for the facility it’s from. It also impacts their score negatively, obviously. It’s important to report malpractice and misdiagnosis if you receive a survey but also with the facility itself if you can. \n\nI can’t speak for our clients who actually do the medical stuff but dawg, MY job is to NOT take those comments lightly. Hell no!!! I’m very glad you sent a response saying all of this. I hope it gets sent up. I almost hope to god the survey was from my company because I know it would get sent immediately to that fuckin ER. I’m so mad for you and all the other patients who write comments just like yours. Ugh!!",
            "I had a hospital decide to drain my entire account, in essence they did check fraud.  \nYou see, I had paid by check and was spacing the payments out into chunks I could afford.  \nThe hospital wasn't satisfied with this, so they took the routing number and account numbers off the check and basically \"re ran the check\" through until my account was empty.  \nThen they had the balls to call me and complain that the account was empty.  \nSo I called my bank, alerted them to what amounted to fraud, got my money back.  \n\nThen I closed the account.  \n\nMonth later, the bank calls me up.  \n\"Your account is five hundred dollars overdrawn. What are we going to do to straighten this out?\" they said.  \n\"Absolutely nothing as it's not my problem. That account was closed.\" I reminded them.    \n\"Any activity on the account will reopen it..\" the drone went on.  \n\"I closed the account because you people allowed a third party unfettered access to my account to the tune of fifty dollars a pop every three hours..\"   \n\"If there's a summary judgment..\" the drone cut me off.   \n\"There was no summary judgment. If you want to claim one existed, I defy you to prove it. Show me the summary judgment. You people basically aided fraud. That account was closed. Look at what date it was closed. It's not my problem. It's your problem.\"  \n\nThe manager eventually got on the line, pulled his head out of his forepoints of contact and apologized.\n\nAbout two years later and six months before they were bought by First Union, the bank called me up and wanted to know why I didn't bank with them anymore.  \nIt was no surprise when they were absorbed.",
            "Had the same thing happen. Emergency room stay. Paid the whole bill off with my HSA, and since I paid in full I got 30% off, and the billing department said I was all paid off. Got a call from a collections agency saying I owed like $400. Never once saw that bill before. It was only like six months after my hospital visit too. They didn’t even try to collect it before passing it to a collections agency. Pretty sure they didn’t apply the discount for paying off in full correctly and were billing me the difference. Sharks. I have a credit score over 800 so I’m going to let that $400 go and see if it makes a difference.",
            "Had almost the same experience a few years or so back (luckily no bills because Australia and was a minor)\n\nSevere appendicitis, parents hadn't taken me earlier and I'd actually been going to the school for a few of the days. It had gotten to the point where I had to say that \"it hurts too much, I can't breath\" \n\nBy the time I was in the operating room (had apparently been very full) my appendix had completely ruptured; could have been the big bust of pain when I was in the hospital, could have been the huge burst of pain when I was in the bath earlier that day. Either way I was subjected to several hours of having a high risk of septicaemia. \n\nSeveral weeks later, original doctors and nurses had turned me over to others and I was deemed fit enough to leave. New doctor prescribes me penicillin and tells me I have to take it for 4 weeks. Chances are if I had accidentally actually taken it I would have died from my severe allergy towards it and otherall poor state.\n\nStill occasionally get severe pains where they operated whenever I'm stressed or anxious",
            "You're not a Karen. You're a Hero.",
            "Oh man I've had a similar thing happen with them trying to send me already paid bills in different amounts. I reached out immediately and asked them straight up how much I had left to pay because I should've already had everything paid off and they said that was correct....then why the fuck are you going through a collecting agency like I'm late or like I fucked something up and trying to make me pay more? Told them how that was super shady and they got very defensive and pissed about that.   \nTurns out I did overpay a little and they had to send me a check to reimburse me so that felt great lol. They were not happy.",
            "You really should be suing for medical malpractice",
            "I'm so sorry. Years ago my sister was a frequent visitor to the ER. Anyway she is allergic to most drugs, refuses painkillers etc..\n\nSo I was with her once and they wanted to give her codeine and i said she can't have it, she reacts poorly. They listed other meds and I said she cant have codine or morphine for sure, I don't know the rest but her file was filled with all the info they needed. \n\nThey gave her something and in about 5 mins she was shaking, red splotches on her face and body and unable to breathe. \n\nI was maybe 18 and I laid into her Dr, He had given her morphine. I was so mad. I ended up sending in all sorts of emails and reviews as I'd never been more angry.  This was years ago so there wasn't the same options as now. And it would have never occurred to me to sue back then",
            "Had a very similar thing happen to me. It's mindblowing that they don't leave well enough alone.\n\n*  Did malpractice to me. Alright, I can let it go, mistakes happen and I'm alive.\n* Charged me for treating the results of their malpractice. Alright, I'm pissed, but I'm not litigious so I'll let it go.\n* Having the bills trickle in over months, telling me I need to pay more every time I calm down a little. You guys need to stop.\n* Caused additional lifelong health issues as a result of the malpractice. Am I outside the statute of limitations yet?\n* Harassed me to review my care on social media. Are you kidding me?",
            "*FREEDOM INTENSIFIES*",
            "I'm at hospital now for a day procedure , allergy to Asprin resulting in an Asthma attack, hospital doesn't think an Asthma attack is fatal so no red band, there's a good reason  my Dr hates sending me here",
            "I had something similar happen to me. \n\nI'm allergic to opiates, it makes my whole body feel like it's on fire and my joints are being smashed with ball hammers. I wear a medicalert bracelet these days, after what happened. \n\nI had to go to the ER after some laparoscopic complications. I told them I couldn't have opiates through gritted teeth during admission, I was in absolute pure agony. I kept passing out and they kept giving me morphine and Oxycodone while I screamed in agony between bouts of unconsciousness. \nThey finally gave me ketamine and I was just paralysed but still in pain. I think they did that just to stop listening to me scream. \n\nThree days of that horror. \n\nThey finally treated the actual issue I went there for after they got the opiates out of my system and then sent me home. Pretty sure I've just been in shock ever since.",
            "[deleted]",
            "When my father died his bills were forgiven and we got a \"congratulations! your debt had been forgiven due to the following reason: DEATH\"\n\nDeath was printed in bold letters in different font like it was generated out of some auto print system.  Damned if they didn't get a half sobbing angry phone call that day.",
            "Well, they wanted the truth, they got the truth. Sometimes, it hurts lol.",
            "There are 100 lawyers who would love to sue their asses off without costing you a dime.",
            "Call your insurance company next time this happens, file a complaint for quality of life. This should be investigated.",
            "I like how the review is also a low key tl;dr",
            "Yeah, they didn't try to get you to double pay the bill. They sold your non existent debt to a collections agency. They couldn't give a shit at that point. I would also report them. That's shady as fuck.",
            "Sue them - sue them into fucking oblivion, when they're begging for a settlement, turn it down - sue them and make them hurt.",
            "I think you're only a Karen if you try to wrong a right, not right a wrong.",
            "I feel like a lot of lawers would jump to help you in exchange for a percentage of the winnings. It's no tree law, but it's still pretty serious stuff.",
            "Sulfa antibiotics nearly killed my mother and my sister. I tell all my doctors not to give them to me because I don't want to find out if I'm allergic or not. They won't list it as an allergy because I've never been tested. But it's in my chart notes to keep them the hell away. I'm sorry they messed up your meds so badly. That's awful.",
            "This shit is just normal in the US. It's a fucking travesty.",
            "The details of that story dont make you a Karen",
            "Are you suing for almost being killed by a known drug allergy? This is crazy. Glad it all worked out, for the most part.",
            "My favorite is when my kids were on Medicaid. We were out of state and my son got sick, so we took him to the hospital.\n\nTwo months later I start getting medical bills. Call Medicaid in my state and they tell me I have to have the hospital apply for an out-of-state provider thing. Call the hospital, and they laugh at me.\n\nEventually ended up with collections and took months to get fixed.",
            "When dealing with a hospital **question absolutely everything they want to do**.  Incompetence is endemic in the medical profession, especially at hospitals.  If you are not careful they will kill you, and then they will find a way to blame you for it.  Remember, they are also going to be the ones performing the autopsy, if one gets done at all.",
            "You’d only be a Karen if you demanded to speak to a manager for daring hurting your child by giving them a flu shot or something equally ridiculous or asinine.",
            "It sucks that people with genuine complaints are worried about being perceived as Karens. A real Karen doesn't care what people think, as long as she gets her own way.",
            "you must live in america",
            "> You can call me Karen.\n\nNo ma'am, that is not a Karen at all IMHO.  If anything, they're a bunch of Karens.",
            "The fact that emergency rooms need reviews on the internet in the US is plain sad.\n\nWhen did the U.S. lose it's drive to be better?",
            "It's not the feedback they wanted, but the feedback they deserved (and needed, if they will heed it and change their procedures).",
            "Cat bites. Did you take rabies shots too?",
            "\" You can call me Karen. \"\n\nI will call you awesome.",
            "you're not the karen here, you're the manager",
            "Been there, though thankfully not as severely. I had a nurse tell me it was totally ok for me to be bleeding that much....you do not want to know how much it was.",
            "NTK",
            "Did you send them links to your reviews?  You know, to let them know you obliged their request?",
            "You must be in the US",
            "You're definitely not a Karen.",
            "I pay bills 3 and 4 times so the Doctor's office will really like me.",
            "Not Karen :)",
            "What a way to start the narrative...",
            "I hope people reviewing doctors becomes commonplace. So many people spend precious time on some of these quacks that don’t give a shit.",
            "This sounds awful, but I’m glad you left those reviews. I just had an allergic reaction to Sulfa antibiotics 2 months ago. I didn’t have any trouble breathing (thank god) but was SO hot and broke out into terrible hives. Not fun. I would cry if someone gave me those pills again.",
            "They nearly killed you after you informed them you were allergic then they still made you pay for that?",
            "Weird, I'm allergic to these two things as well.",
            "Yikes, I had to go to the ER last month for a cat bite as well. After everything was said and done, I owed $500 after insurance.",
            "What do you do to pay it off and not want to deal with a lawyer to win something they did wrong?",
            "...no, you're not a karen, unless that's your real name...",
            "I do t get Americans love for antibiotics. I see everyone getting it for everything, even if it isn't a bacteria! Here in Norway doctors barely ever give antibiotics, and when they do it's the bare minimum amount, to prevent the bacteria from growing resistant to the antibiotics.",
            "Double billing is a common practice with some hospitals. We've had insurance companies tell us that the local hospital will most likely reach out to us again for payment, and to not pay them because the insurance is covering it. I can't imagine the amount of elderly and inattentive they screw with these tactics.",
            "From a country with free hospitals it seems like a human rights abuse that you have to pay for health care!!!!!\nLike what if you cant afford it?!?! You just fuckin die?!?",
            ">Medical bills\n\n*Laughs in british*",
            "\"You can call me Karen\"\n\nThat's a statement with some raw power for sure. Every place with truly bad service deserves a Karen",
            "Next time y’all vote, consider voting for better healthcare. Medicine like the rest of the first world enjoys.\n\nSorry you had such a shit experience, I hope you cut their metaphorical nuts off.",
            "There's just so much that's wrong with this scenario. Medical bills. They sound awful, why do you Americans shun universal health care? Reviewing a hospital. Can't imagine.",
            "As someone coming from a country with actual healthcare rather than the American shamozzle.  \nThey ask you to give reviews?  \nDo you get discounts if you're an instagram influencer and can post from there for exposure?  (That's how crazy this sounds to me)",
            "Couple of things\n\nI want to call bullshit so hard, but errors happen.  I just want to clarify, did you almost died because you took the antibiotics which you knew you were allergic to or because you did not fill those antibiotics?  \n\nIn any event I am sorry that you were prescribed an antibiotic which you were allergic to, and this is certainly something ERs are continually trying to prevent, and it can be difficult in what can be a very chaotic environment sometimes it gets busy and provider can be seeing i dunno 10-12 patients at the same time; none of this is a justifiable excuse though.  Next time please point this out to the nurse or provider before leaving the ER, and so we aren't going to be mad if you point out an error, and everyone in the ER is human so we do make mistakes.\n\nIn regards to the billing.  Unless you are in a very odd system the providers, nurses, and staff in the ER have nothing to do with that.  It has benefits and it has downsides.  I don't have to worry about cost in the ER cause I really have to know nothing about that and so regardless of your ability to pay I will provide the same quality of care to you.  The downside is what if for something that might be more medicolegal than medical I might want to get testing or provide treatment that will incur significant expenses to patients and I cannot provide adequate answers to these questions.\n\nLastly to the survey.  Sorry again.  Staff have nothing to do with this, and is actually at the behest of your wonderful government and CMS and hospital administrators who have no medical training and do nothing but suck up resources because without it they would look like they do nothing instead of looking busy while doing nothing.  It affects the payscale of the hospital for medicare and medicaid reimbursement, before long it will be used in private pay. again, staff and providers have nothing to do with this.",
            "Yeah, you should have sued the shit out of them lmao.",
            "Wait, not only did you have to pay for health care you have to pay for the wrong health care?",
            "Yeah but USA health Care better guys",
            "I am always so shocked at the idea that you could have any kind of bill to pay after going to the hospital. Its beyond comprehension.",
            "You don't get a Stevens-Johnson reaction when you get sulfa, do you?",
            "NTK-aren",
            "Thank you for your service Karen.",
            "Was this by chance a Banner hospital? They are the absolute worst with trying to stick people out of money",
            "I’ve seen your posts on FB. Pretty sure that you are the petty we ALL long to be.!❤️",
            "Heads are going to roll as soon as higher ups see your reviews. Whoever treated you is in deep shit.",
            "I don't get the Karen thing. This name literally just means everything?",
            "hmm\n\nHMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM",
            "......reviewing an emergency room?",
            "Lawyer",
            "Nah, i’ll just call you u/mikesass",
            "My dentist tried to make me pay the pill double every half a year.",
            "I don't understand how such a medical system is OK (I am a privilaged person who lives in a country with free health care)",
            "I finally called patient services after nurses tried to place an IV in my inner bicep but instead hit my nerve. I asked them sternly to look at how my hand was contracting and to stop. I was fully conscious and able to revoke consent but the problem is they didn't stop until I was begging them to and the heart rate monitor started alarming from how high my heart rate was. Now I cant fully straighten my arm without it feeling like the nerve cant extend that far. \n\n\nAnother time I was in there for a migraine. Most anti nausea meds are anti psychotics that they found helped nausea. For these class of meds a side effect that can happen is Akathisia. Its described as one of the worst feelings in the world. For me it feels like my skin is trying to remove itself from my body, extreme dread/anxiety (not just an anxiety attack Im talking the level of dread of death), physically unable to sit still, shuffling or rocking back and forth and the imminent need to get the fuck out of the hospital. Ive literally had to hold my own hand down from ripping the IV catheter out and running out of the hospital. I was promised that if I started to feel this side effect they would try to mitigate it right away but I was left in a small room for two hours while I was just begging for them to help. I cant even describe this feeling right but if someone offered to shoot me in the head, I probably would have said yes.",
            "Do you mind if I xpost this to /r/ShitAmericanSay ?",
            "Or they're fucking tired of you coming in to the emergency room... a day after the incident instead of just seeing your personal care physician or urgent care",
            "Funny that the antibiotics \"almost killed\" you, but you were not hospitalized."
        ]
    }
]