[
    {
        "post_id": "efi81n",
        "author": "lipwiggler",
        "title": "you can cancel at no cost",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/efi81n/you_can_cancel_at_no_cost/",
        "score": 17017,
        "num_comments": 388,
        "created_utc": 1577290395.0,
        "selftext": "Last year my wife and I got married. My parents and sister live halfway across world, but that didn't stop them from coming over to celebrate. Since neither my wife and I get to spend much time with them, we decided to rent a house for a couple of days in a nearby wine region. You know: hang out, drink some wine, eat some cheese and have some quality family time. It had been 3 years since we last saw them.\n\nA month or so before my parents and sister came over I got an email from the owners of the vacation house saying that they had sold the property, but the new owners were going to continue to rent out the house and they were going to honour the booking, so not to worry. All good. Two weeks later I got an email from the new owners saying the booking was still okay, but they were going over their records and said I still owed them $100 for the booking. I replied back with the receipt and booking confirmation that I was all paid up. Turns out the new owners unilaterally decided to increase the price of the accommodation, and I had to pay up. But they were gracious enough to say I could cancel at no cost but they'd rather we'd keep the booking and pay that little extra.\n\nNo cost for cancelling the booking you say? Within 5 minutes I had found another vacation house in the same region, there's literally dozens of them. I sent a quick email back to please cancel my booking and process the refund.\n\n\"We'd like you to keep the booking. Can we split the difference?\"\n\n\"No thanks. Please cancel the booking.\"\n\n\"If you keep the booking, we'll throw in a bottle of wine!\"\n\n\"No thanks. Please cancel the booking.\"\n\nGood thing the refund came back with days.\n\nTheir reviews have been less than stellar on tripadvisor. I wonder why...",
        "permalink": "/r/MaliciousCompliance/comments/efi81n/you_can_cancel_at_no_cost/",
        "comments": [
            "I had a similar experience. My wife and I booked an AirBnB and a month after booking, 1 week before the trip, the owner said they had increased rates and wanted us to pay more. I said no so they asked me to cancel, I once again said no. Airbnb charges a penalty of $50 to bnb owners for cancelling on guests and if they do it enough times Airbnb will delist them. I also think that if they cancel on a guest they can't rent to another person during the same timeframe. They were trying to get me to cancel to avoid any negative repercussions.\n\nThey then offered me $40 to cancel the booking. I replied I would cancel the booking for $100. They said I was being unfair so I explained that they were in fact the one being unfair and that I knew they were trying to circumvent Airbnb rules. They cancelled within minutes of my reply.",
            "Idiots... It's not honoring a booking if you change the price post facto!",
            "Definitely better to cancel even if they came back and said ignore the request. I did an Airbnb where I booked a room with a shared common area for a semester of school, they accepted. The next morning I had a message from the person saying her husband accepted the booking but since it was long term I needed to pay a higher cleaning fee - there’s a $15 cleaning fee for the booking but they need to get that every week and I’d only be paying it once (previous guest stayed for a weekend or whatever). (The wife would come over and clean allegedly)\n\nI said I don’t understand. The cost of the listing should incorporate any maintenance the common areas required and I didn’t need her coming in and cleaning my room while I was there.\nThey dropped it.\n\nEnded up being a booking from hell. Both I and another guest canceled before the end of our bookings and received refunds (for the time we didn’t stay). I had to get Airbnb involved to get anyone over to clean the common areas (I cleaned up after myself but there was serious dirt and dust everywhere it was disgusting). Eventually my king size bed broke - they tried to blame it on me, I said I weigh 150 soaking weight and it’s a king size bed. They said they didn’t know what I “got up to with all my porn stuff.” Apparently they went through my things and found my vibrator. They also took some of my school notes (which I discovered in the dumpster as I moved out)\n\nAirbnb did not refund me for any of the drama I endured. The other guest said they had never seen someone be treated so horribly before in his life. \n\nMoral of the story- the *second* someone starts nickel and diming you... bail hard.\n\nEdit: a typo",
            "I really can’t decide if expecting someone to pay a price increase on a reservation booked before it was enacted by people who didn’t even own the property at the time is just inherent stupidity or gross entitlement.",
            "I read the title “you can cancel at no cost” and then the first sentence “last year my wife and I got married”. I thought well, this is going to be interesting.",
            "Some people will step over a dime to pick up a nickel",
            "They'd have to throw in a lot more than a bottle of wine, for me to keep the booking.  I'd be afraid I'd show up and that they would be in the house and our \"accommodations\" were out in the barn or something.",
            "What's ridiculous is once they offered to split the difference, they're now willing to lose you over $50. If they really wanted you to keep the booking, they should have just folded after you said no the first time.",
            "They wanted to offer you a wine for just 50 bucks? Lol. \n\nGood on you, after that I wouldn't want it if I got it at half price.",
            "For people that pulls this stunt you might as well say the price is now a gazillion dollar.  \n\n\nThe market will decide the volume of your future guests, as for the people currently already booked you're knowingly and shamelessly screwing them so why not go hard?",
            "\"But we'd reeeeeeeally like you to just pay more!\"  \nYeah, I'm sure you would, but it ain't happening, so suck it up.",
            "They should have kept your booking at the agreed upon price and every booking after that would be at the new price. Buncha freaking geniuses.",
            "TripAdvisor is the lifeblood of the agri-tourism industry. A couple of bad reviews there, you may as well close up shop.",
            "Sounds like they were cash poor after their purchase and were trying to squeeze you for some revenue. I imagine it was just an asset sale and not the sale of the whole business.",
            "#economics",
            "> \"Can we split the difference?\"\n\n\"Between us renting it and not renting it? Well, if you want to change it to half-price, I suppose the extra $50 wouldn't be too bad.\"",
            "My friend booked a quaint little Airbnb in Shanghai in January. It looked exactly like it did in the pictures, but was completely inaccessible despite it being advertised as \"easy to get to\". \n\nIt took me an hour to find the unit at night, because it turned out that the actual unit was behind a series of wooden doors in pitch black darkness. \n\nIt was completely dark and devoid of lampposts, rubbish strewn all over the floor in alleys and it was so creepy that when I finally found the unit, I couldn't stand being in the place let alone sleep in it for a week. \n\nAirbnb apparently didn't let us refund and we paid about 300USD for a place we didn't even spend an hour in.",
            "In Australia this kind of bait and switching is extremely illegal",
            "STONKS",
            "Hon the lads, ya love to see it",
            "Hahaha sounds like Niagara Region.",
            "Good for you, I don't know why they didn't honor the booking, but where's the MC?",
            "So they tried to squeeze $100 out of you, then had to refund the entire reservation?\n\nDid the previous owners get the money or does payment go through afterwards?",
            "Since you had a receipt that confirmed the booking and that you were already paid in full, you could have used it to your advantage.  I would have been like, \"Oh you're increasing the price by $100?  I'll be sure to keep that in mind for next year, so thanks for telling me.\"  When they try to push for the extra $100 this year, be like, \"It's illegal to raise the price after something is already paid for.\"\n\nOn the side, find a lawyer who does free consultations and explain the situation.  If they refuse to honor the booking over the $100, that lawyer may be willing to represent you and get a lot more out of them than they were trying to get from you.  Not only teach them a harsh lesson about their greed, but you get paid for the work of teaching them that lesson.",
            "[deleted]",
            "I would have cancelled the day before you were supposed to be staying there",
            "Moses, Joshua, etc. with no discernible reason.",
            "Don't forget the opportunity cost of 4 months.",
            "Probably never sold the property...",
            "Delicious MC! Bwa Bwa Bwa!",
            "I don’t understand why some people jump the gun even before they have had a start to their business, they just bend over backwards until their spine snaps for them to even understand they messed it up , you did well",
            "[removed]",
            "Cool story but struggling to see the malicious compliance here."
        ]
    },
    {
        "post_id": "10zz3a1",
        "author": "Meekly-Enthusiasm",
        "title": "Entire class skips optional early start to lab, we were given an hour for lunch and we’re going to take all of our time",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10zz3a1/entire_class_skips_optional_early_start_to_lab_we/",
        "score": 17008,
        "num_comments": 603,
        "created_utc": 1676152601.0,
        "selftext": "TLDR: surgeons wants us to come to a lab scheduled for 12 and hour early at 11. As a class, we decided to come at 12. Got reprimanded, then the dean backed us up.\n\n&#x200B;\n\nI’m a second year veterinary student. This is the time when we start our live surgery labs. We work in teams of three students (a surgeon, an assistant, an anesthetist), and are obviously overseen by certified specialists (anesthesiologists and surgeons) and many experienced vet nurses as well.\n\nWe have lectures 7am to 11am. Lunch is 11-12. Our lab begins at 12pm sharp. However, we were told we have the “option” to come to lab early and begin. It became VERY clear after the first week this is an expectation (not an “option”) that we will skip lunch, or eat during lecture, and come straight to the OR.\n\nDuring one lab, at 11:50am the anesthesiologist yelled at a student for a few minutes in the pharmacy area, while getting drugs for lab, for not having his patient ready and waiting in the induction room… 10 minutes for lab even begins. And this group was set to induce during the last wave (normally 1 to 1.5+ hours into lab). There’s no reason to be an hour early when your group is final wave, being on time is sufficient, and they were actually still early.\n\nOur class has been getting berated by this anesthesiologist as well as some of the surgeons in this lab. Just as one example, a student surgeon asked for help. A surgical resident came over from another patient to help, and she was now not sterile. The resident told the student she was holding her forceps wrong, proceeded to grab them from her hands, and then made the student leave her patient on the table to re-scrub, re-gown, and re-glove, and open a new instrument pack. All because she wanted to ask a question. This is a common technique they will use on us when we’ve done something incorrect to “get us to remember it next time.”\n\nWell, the entire class is fed up with this. Our class called a meeting about it, and we all decided we are all going to start showing up to lab at 11:50 to 11:55am. Only 5 to 10 minutes early. Not for petty reasons either, but it’s a matter of patient safety as well. Several students have fainted from skipping lunch to go and operate instead. We were given 11-12 for lunch and we’re going to take all of our time.\n\nSo, that’s what we did. At 11:40am one of the surgeons came to our lecture hall, where the majority of us stay and eat lunch, and asked us why we’re not in lab yet. A student at the front of the room said simply, “lab begins at 12 noon.” The surgeon gave us a long spell about professionalism and how we are being inappropriate and putting our patients at risk, and she left. The OR is a 2 minute walk from the lecture hall, so we finished lunch and all showed up around 11:55.\n\nThe clinicians were very mad about it, and reported our class to the dean, and so the dean called a school wide meeting about it. Some of our classmates spoke eloquently about our reasons and our actual patient safety concern, turning it right back on the clinicians citing patient safety. And, the school claims to care immensely about student mental health, since this profession has one of the highest suicide rates and our own class even suffered a loss, and cutting our break/lunch is no way to support us. Beyond that, the schedule says we begin at 12, and we are still showing up a few minutes early to ensure we can begin right at 12.\n\nUltimately, the dean just released a statement saying they cannot force us to begin lab an hour early, and we will start at 12 when the deans office scheduled lab to begin. It’s a small win for us, certainly we will face backlash, but we have a break to eat at least. Our class is known for not putting up with bs from the school, we got a dinosaur of a professor fired for racist comments she made to a student in the middle of lecture, after she had terrorized students at this school for decades, she forgot out lectures were automatically recorded on zoom during COVID. We’re hated by the clinicians, but at least the classes behind us are having a slightly better time.\n\n&#x200B;\n\n**Edit**. About the fainting thing. Yes, from skipping a single meal most healthy adults shouldn't faint. Add on top of that the mental stress of operating for the first few times, the heat from the surgical lights, being covered head to toe in a non-breathable sterile barrier which traps in your body heat, a mask putting that heat back on you face, having to stand relatively still in one place for hours, no access to water for hours, you can't move your arms out of the sterile field so limited/no stretching, plus the sight of blood being a common trigger of vasovagal syncope, and you have plenty of lightheaded or fainting students. Skipping food is added insult to injury, when you last ate at 6am, its now 4pm, you haven't had water since noon, and you're overheating, and stressed.\n\nNot to mention vet school is a concentration of type A high achieving perfectionists with chronic stress from constant high stakes exams (fail you're out of the program) some of which are right before you go off into operating or maybe occurring the next day, rampant anxiety and depression, sleep deprivation from our schedule and/or insomnia, I know several classmates with disordered eating or full blown ED's. It's not merely an isolated incident of skipping lunch one time.",
        "permalink": "/r/MaliciousCompliance/comments/10zz3a1/entire_class_skips_optional_early_start_to_lab_we/",
        "comments": [
            "My best friend is a Veterinarian.  Its a God awful career with so much work and heartache. Set those precedents now and stand by them. I have so much respect for vets. You guys really are the MVPs.",
            "When you live by the clock, you enforce the activities to the clock.\n\nYou were being professional by showing up a few minutes before 12.\n\nThey were being unprofessional, demanding, and entitled.",
            "Same in medicine. Suicides and the continual domineering attitudes of some older teachers. It is ingrained, some are compassionate but to a bully everything is a hammer.",
            "Good for you all!! The old way should die and stay dead, patient care should always be #1. I can’t imagine my wonderful professors and clinicians acting this way, especially with the already incredible stress of doing surgery your first few times. They demanded we eat first to avoid the fainting! F those guys! Makes me want to ask what school you go to…\n\nThis culture of standing up for yourself and your patients will serve you well in practice, especially in a large one. Don’t get used to accepting abuse now or you’ll get it for the rest of you career! I wish I had known that at your stage. Good luck! Not all schools/practices/mentors are like that!",
            "It amazes me how many industries want to address the toxic  attitudes but then bully everyone",
            "Be The Change.\n\nI graduated as a vet tech in 2002. There was a critical horse in my equine rotation, none of the DVM students wanted to page the resident because she was such an uber bitch. Well, technician students have our own rules and hierarchy, we don't answer to the residents. So eff it, I paged her. Since tech students didn't have pagers, I didn't do it by protocol. She busts through the double doors to the ward, high heels clacking (yes, high heels and open toes in horse stalls), lab coat flowing like a cape behind her and says \"ALL RIGHT WHO DOESN'T KNOW HOW TO USE THE FUCKING PAGING SYSTEM??\" I raised my hand,gave a little wave and said \"that would be me\", and you could see her visibly deflate, because she had no power over me and she knew that I knew it. Was a proud moment. \n\nSame doctor lost a stylette in a expensive racehorse's jugular when it bucked and lifted the DVM student off the ground, it was just her, him and me outside the stall passing stuff. Boy was she syrupy sweet to me after that.",
            "I've always thought students have *way* more power than they realize. If students actually unionized - not necessarily with a formal union and union dues etc, but acting cohesively as a group, they'd be able to very quickly see changes.\n\nThings like math programs that require a one use access code per 'book' purchased for an obscene amount? Decide that no one buys the book. If professor makes a stink about it, everyone drops the class. \n\nRequiring a phone app that tracks location and attendance in class - if everyone acted together to refuse to download, that goes away pretty quickly.",
            "“We’re gated by the clinicians, but at least the classes behind us are having a slightly better time”\n\nI love that you realize the impact you’re having on the future classes",
            "This happened in medicine when they decided to limit the hours the interns and residents can be forced to work. All the older Doctors lost their crap and would say they wouldn't learn enough or get enough experience. The truth is the students are learning just fine and they are hitting their learning goals and expectations just fine on the reduced hours.   \n\n\nThe older generation was just jealous that the newer generations do not have to suffer as they did.",
            "I love this and this ties into my experience in the veterinary industry. I was a recruiter for one of those big veterinary management agencies that's buying up hospitals nationwide.\n\nEven though the company that I worked for was great, the veterinary industry is a very unique world. I remember we were at a sales presentation where we were talking to veterinarians about our practice model and giving them advice on various aspects of the business even if they didn't want to partner with us. All of the old school vets, I would say age 50 plus and even some of the 40-year-olds were complaining over and over and over about how the newer generations of veterinarians were obsessed with work-life balance.\n\nThey were mad that they had the audacity to only want a 50-hour work week and to demand lunch breaks and to charge enough to survive on. It was everything in me to keep my mouth shut. \n\nGen Z and millennials are really changing entire industries for the better. They will not tolerate bullshit and they shouldn't.",
            "This epitomises the awesomeness of the Gen Z \"We not me\" attitude. \n\nWell done. Keep it up. \n\nThis elder millenial is cheering you on.",
            "I don't get it. Why don't they want you to eat lunch? Are they just so miserable that they have to spread it to you?",
            "Good on you and your class! This culture of clinicians/nurses/doctors/who ever \"eating their young\" needs to end.",
            "Change is change, and in your corner of the world, you're making things better",
            "This reminds me of my manager. She tried to remind me the other day that I needed to clock in 2/3 min earlier so I could by at my desk ready for work at the exact time Im supposed to be in. I politely reminded her that my contract states my clock in time, which is not those 2/3 min earlier. Also those 2/3 min arent paid and thats free time Im giving the company. We did the math, it like $200 a yr aprox that Im giving them for free by clocking in every day earlier. She didnt like my answer 🤷🏽‍♀️😂",
            "My dude that edit shouldn't be necessary, even working in a chem lab for a few hours on an empty stomach can make you extremely doozy and make people faint.\nNo shit people faint in your position, it's like a 3times worse environment.\n\nPeople saying fainting in such an environment isn't normal should try it.",
            "Clearly you will never be an adequate clinician if you refuse to perpetuate the cycle of hazing and abuse that created the dysfunctional individuals who are behaving like pre-pubescent school bullies. /s\n\n9/10 chance they also complain that no one wants to work any more, and fondly tell stories about \"the good old days\" that contain elements that would now be considered grounds for permanently losing their license.",
            "Sometimes being a hard ass and letting the shit flow around you is the only way to get the changes you need.  Bless your class for stepping up and being those hard asses!",
            "Scheduling things for one time, and expecting something else, is called lying.\n\nLying is always unprofessional, even when people do it in fancy clothes.",
            "“Being professional” is often just code for “you’re going to be exploited and you better like it”",
            "Leadership and solidarity. Well done",
            "I am sorry this happened at all. I am proud of you and your compatriots for dealing with it and in doing so in such a professional and calm manner. *HUGS you all!*",
            "Heres a strat, everyone boo them out of the lecture hall if they start berating you guys. I would love to see the reaction. Peaceful student protests are a real strategy aswell.",
            "Is it MSU with Dr Shitley ummm, Shivley?",
            "We had an old curmudgeon of a teacher giving the class on high voltage electronics (engineering degree). Material he used was all copied, by himself, from pamphlets of electrical components, and what little wasn't, was his own devised formulas and charts that were inaccurate to the industry standards. And unless we used the incorrect values he provided (and we had to memorize for the tests), points would be docked.\n\nThe guy had tenure, because he had been in the university from the time when they still offered tenures - which at the time had already stopped 20 years ago. We studiously complained about every single class and every single shit he tried to pull. Even from the dean of our discipline told us that she'd been getting complaints about the guy for decades at this point, but because tenure, couldn't fire the guy.\n\nBut we raised such a shitshow about his poor teaching skills and nonsensical practices that on our third year - when we no longer had any classes by him - the dean came around to let us know that he's been moved to a newly minted research capacity where he no longer interacts with any students. Fucker got a small office in a cellar and zero classes. Good riddance to bad garbage.\n\nGood on you for not letting that bullshit fly from shitty teachers. If no one tells them no, they will just continue tormenting the next class.",
            "I hate it when my line Manager does this.\n\nSends me an invite for a Teams meeting at 12. Grand, popped into calendar, remind me 2 min before so I can log in. Fuckin 5 min before , I get an IM \"hey are you joining the meeting?\"\n\nYES! I WILL! AT 12 , U FUCKIN BAGUETTE",
            "Hello soon-to-be vets, I want you to know that a whole bunch of real live veterinarians found this post and are hailing you far and wide.\n\nMany of us are still trying to fight against \"I suffered through it and so will you.\" It seems to be dying out as younger folks take over the profession but I just wanted to say\n\nI AM SO PROUD OF YOU, VETLINGS\n\n/u/Meekly-Enthusiasm WE SEE YOU and WE ARE WITH YOU.",
            "Good for you",
            "I have friends who went through medical school or vet school.   Both of them when they hit residency were forced to do 12 or even 24 hours shifts.  \n\n\nI asked them why?   Got the same old \"Cause that's way it's always been done.\" or \"During emergencies you may have to work long hours.\"  \n\n\nI ran into the MD a couple of years ago and reminded her of our conversation.   \"So how often have you pulled a 12-24 hour day?\"  \n\n\nNever.",
            "A friend who was a veterinarian committed suicide a few years ago.  She was a bright and vibrant woman.  It was only after her loss that I learned about the high rate of suicide in the veterinary field.  Your class did the exact right thing.",
            "Aren't you paying them? What country is this? What school is this?",
            "> Edit. About the fainting thing.\n\nOF COURSE you will see some fainting from having to stand up straight for hours, not having eaten a good lunch, being young adults, maybe people are on their periods, or in pain, and anxious to do things well and to take care of these animals.",
            "This is why collective action is so important! Thank you for fighting the good fight and I hope you get all of the good things that you deserve.",
            "The only person I’ve ever known to go to vet school died by suicide in her final year. I’m so here for any and all of your efforts, as a class, to advocate for yourselves. I hope you have the support you deserve!",
            "It's shocking to me that society hasn't fully recognized that a significant amount of the bullying that happens in school is from teachers / professors.  It is completely possible this kind of behavior is, at times, learned in class, watching those who take pleasure in the humiliation of those they control.",
            "Setting boundaries now is vital to your mental health. Good for every one of you",
            "“Those who can’t do, teach’ is a truncation of the line ‘Those who can, do; those who can’t, teach’ from George Bernard Shaw’s 1905 stage play Man and Superman.” This is not always true, but it explains incompetence, frustration and anger in some teachers.",
            "Amazing job, this is the shit that forces real change. Bravo!",
            "Legends! You are there to learn, not to be demoralised. Legends all of ye!",
            "God damn there’s a lot to unpack here. Gen Z strikes again though! Fuck those bastards. Straight up sadistic shit.",
            "TIL that veterinarians are at high risk for suicide. The vets at the practice that cares for my pets are wonderful people -i wish they worked on humans, too - and it's sad to think of them in danger that way.",
            "I love that this generation actually stands up for the important things.  We would have never dared.",
            "Pro tip for students becoming professionals: cover your ass. Have everything written down or emailed. Any decision or action taken by your teachers. Record everything",
            "Most people don't know just how abusive vet school is.",
            "As a CVT I say thank you for advocating for less stress and more patient safety. Again as a CVT I beg you please to remember that when working with your own vet nurses. We need to be a team and help stomp out this toxicity in Vet med.",
            "Best of luck with your profession.  I read it can be very tough on mental health.  Animals can’t tell you what’s going on unlike people sadly.",
            "As opposed to other medical professionals that are forty-five minutes late.",
            "Good for you. Get in the habit of looking out for each other. A day in vet med, even in school, shouldn’t be something you have to “get through.”",
            "fuck those people",
            "The fucking power of collective action!",
            "Medical colleges are notorious for this behaviour. The seniors abusing and expecting overwork from the juniors.\n\nI see the practice is worldwide and in vet schools too.\n\nHope you treat your students better when *you* become the residents and clinicians..",
            "I feel so proud of you and your class. This is how change is made.",
            "\\> this profession has one of the highest suicide rates\n\nThat honestly breaks my heart.  As a random stranger, I just want to let you know how valued you are.  We had to put our beloved cat down a couple of weeks ago, and the only thing that made it remotely bearable was our vet and how she handled it.  She was so thoughtful and compassionate through the entire process, and we appreciated her so much.   You have no idea the kind of difference people like you make for pet owners, especially when it comes to end-of-life care.  We took her a thank-you card when we picked up our cat's ashes, to let her know how much we appreciate everything she did.  And, of course, left her a glowing google review.\n\nThank you for choosing this profession.  I am so grateful for humans like you.  I know this is super random and I am a total stranger, but if there is ever a time where you are struggling mentally/physically/emotionally, please feel free to DM me.  I would be more than happy to lend a listening ear and remind you what a difference people like you make in the lives of pet owners.\n\nAlso, as a small aside, when I was in law school, they also emphasized how much they 'cared about our mental health.'  And then promptly drowned us in 80 hours of classwork every week.  It's all just bullshit lip-service.",
            "I'm an RN and the attitude exists here too. I'm a charge nurse now. Last week I had another nurse tell me \"you need to stop saying you don't know something, you've been charge for too long\" and I just like, do you want me not to admit when I don't know something? That's not safe for the patients.",
            "As a recent grad veterinarian, this post causes me no surprise. Only way I can tell it's not my actual school is that our surgery lab was third and not second year. Cue the *shock* from administration when students express how school is crippling their mental health and then they continue to allow BS policies like this one. Good on your class for standing up. In my experience, it gets worse the further into the program you get.",
            "Man that's not even malicious compliance, that's treating the profession and academic environment with more grace and professionalism than your supposed betters.",
            "I'm far from a medical expert so correct me if I'm wrong, but isn't making a surgeon unsanitary so they have to leave their patient open on a table for a longer duration of time causing harm to patients?",
            "Once a semester, a random smattering of students should be issued with a poker chip that says \"we're paying for this shit.\" That they can deliver to any academic staff, and follow up with an open handed slap with zero reprecussion. \n\nI guarantee the attitude of entitlement educational establishments have in their business transactions with students disappears in a single academic year.\n\n/s but if you need this seek help.",
            "\n>About the fainting thing. Yes, from skipping a single meal most healthy adults shouldn't faint\n\nEvidently most of reddit forgets on more students are not typically healthy adults....",
            "Good for all of you!! Your class is being very brave and standing up for what's right despite the blow back, you're paving a better way for the classes who follow you.\nGood looking out. \nIf no one has told you, I'm proud of all of you. You should be also.",
            "Gig em",
            "That rasict teacher is also why One Party recording should be legal in all the world. If you are recording a conversation that you are participating in then it should be legal for you to record it without warning the other person the recording is happening. After all, what is the difference between having a really good memory and a recording other than you can whip out to recording for others as proof it happened?\n\nI understand not being able to record third party conversations that you are not necessarily privy to. But if it's YOUR conversation then it should be 100% legal to record silently.",
            "That comment about the classes behind you really hits. Thanks for what you're doing here, stranger.",
            "Sounds like the school is in needed of being audited, they seem to be missing a lot of little details",
            "The \"we had to do it this way and suffered for it so they should too\" sounds like the result of a mental or personality thing. \"I suffered and so shall you\" when there's a better for everyone option available is advanced stupid.",
            "Some commenters are forgetting vet school is *medical* school. Good on you lot for standing up for yourselves",
            "Im a  veterinarian and have been out of vet school for almost 9 years now...I still remember being denigrated by residents and attendings alike for not knowing things or doing things incorrectly. Also being the perfect student on rotations and the attending who was barely there giving me a B- for no discernable reason. I can only say....thank fucking god Im out.",
            "Vet school sounds miserable",
            "Props to you and your class for standing up. I'm proud of you. Both veterinary medicine and medicine have a perpetual vicious cycle that is so toxic. I'm sure dental is like this as well. For medicine, this toxic culture is so apparent on subreddits like r/residency or medicine and it makes me sad that it will be \"passed on\".  I know that's a small sample size but alas\n\nAnyway, I didn't have the strength to stand up to voice my opinions so I just left the field instead. Cheers. I will be rooting for y'all",
            "Go you all! Collective action and forward thinking for the win!\n\nI honestly think the millennials and the Zs are the ones that will change the world for the better, and a big chunk is they refuse to accept \"this is the way it's done\" as a reason for anything.",
            "I don't see how they could expect you to skip lunch. Like in the workplace it's law that you get a lunch break. That's insane...",
            "I can't believe you had to explain people fainting in your edits lol. Otherwise good on you! I'm glad that everything is working out for the better",
            "Wanna bet the lecturer’s and associated staff had a proper break?",
            "this is what unions do",
            "St. George's?",
            "I'll bet your Lab Professors want you to show up early to start early so you will FINISH early, and the professors get to go home early. Good on your class for putting them in their place.",
            "Proud of you and all your classmates- our profession will only benefit from veterinarians* setting BOUNDARIES for ourselves \n\n\n***and other vet staff members",
            "oh yes bravo burn that toxicity to the ground please.",
            "Way to go! You give me hope for the future of VetMed!",
            "I am proud of you and your class, for standingup and being done with their bullshit. Everything is scheduled for a reason.",
            "Veterinarians have one of the highest suicide rates?",
            "Psst. Hey kid. Listen. You're a uni student right? You paid six figures to go to med school yeah? Well guess what. You're a customer and can demand to be treated as one. Times a changin. The power has shifted to you via social media. Get to it.",
            "Dude!  I am so freaking pumped for yall!  You stood up to the bullies!  Yall are going to be awesome in your work, because you will never put an animal at risk for work drive or ego.  Let everyone in your class know I think they’re going to be the best in field!",
            "Out of curiosity what school was this? I'm getting ready to select the school I'll be attending and would like to decrease my odds of running into this kind of thing as much as possible.\n\nIf you'd rather not say on here for risk of repercussion totally understand, would you mind shooting me a PM?",
            "Since the dean said you're in the right, the professors have no right to give \"backlash\" ...In fact if anyone gets less than an 85%, or noone gets above 90%, I'd have all students individually report to the dean accusing the professor of unfair grading (yes, even those who got good grades). It won't be hard to manage since your class is a united front against Professor Compensation.",
            "I don't think I've ever brought my pets in to the veterinarian for anything and had them seen right away. Granted they've never needed surgery. But I hardly think this is an occupation that needs to agonize so much over punctuality, much less being a full hour early. Who would bring an animal to be operated on an hour early, knowing their beloved friend could possibly die on the table?",
            "I'm a vt student clapping over here. Good.for.you! 👏🏼👏🏼 Thank you.",
            "Oof. I too went to Mizzou for vet school. Good on you for not putting up with that crap",
            "That’s a lot of words to say “WSU sucks ass.” Let me guess, Dr Carrie? \n\nFuck vet school in general, only about 20% of what they teach is relevant to clinical practice.",
            "You can’t skip lunch.",
            "For what it’s worth, Millenials are in general happy to support your generation in setting better work/life balances than the Boomers had. \n\nEveryone that I talk with that is my age sincerely hopes your generation continues to fight back against the overworking that prior generations have accepted as normal. \n\nKeep up the good work!",
            "Healthcare is the most unprofessional profession there is",
            "My dad has told me stories about what med school was like for him, and it was hard to listen to. It was a dark time. They lost several people to suicide. The students of the future will be grateful for your class standing up for themselves. Way to go :)",
            "Glad to hear you all stood together.  People forget that and a one person crusade, against unjust rules, falls on deaf ears.  However an entire group can make a difference.  I'm sure they will be petty because you beat them at their own game.",
            "Thank you.",
            "Absolutely love the dean for backing you up",
            "Good for you!",
            "My sister in law is a vet. I think she’d love your class.",
            "Kudos to all of you for working together to make your corner of the world a better place—not just for yourselves, but for everyone behind you as well.\n\nIf everyone had this attitude, our world wouldn’t be such a shithole in the first place.",
            "Thank you for being a voice to many that don't have one.",
            "I am so proud of y’all!",
            "Go y’all!",
            "I’m gonna be a first year vet student💀 i hope this doesn’t happen in my school if its not the same one already",
            "Good for you. Stick with it.",
            "This is rampant in professional schools worldwide. Only the student can ever be unprofessional in these situations and the faculty sits at the right hand of God himself",
            "this is a major slay",
            "OVC ‘96 here: good for you.",
            "Sorry if this has already been answered in the comments, but which vet school was this? I’m currently applying to vet schools and I’m curious",
            "I misread that as \"a surgeon, an assistant, and an atheist\" and thought it was a \"walked into a bar\" joke",
            "What vet school is this?",
            "/r/WorkReform would love this story!",
            "So I worked in vetmed, albeit as an assistant who could do anything non drug-related as a tech could. I worked at a teaching hospital. The behavior of the people running the class (and even the dean for saying he cannot force you, instead of being supportive of indifferent) is not becoming of those who want their students to become exemplary vetmed professionals. While I'm sure you will deal with these types of people in your professional life, especially if you're working at a corporate practice, this is not something you or any I'd your classmates should endure.",
            "What kind of school is this holy shit. Suicides, people fainting, racist teachers. What the hell.",
            "Sounds like you should take this higher than the dean.  Completely unprofessional setting to be productive towards learning.   \n\nVet tech patients are pets and farm animals.  Not people",
            "Veterinarian here. Unfortunately this sort of mass \"civil disobedience\" is the only way to actually push change in academic veterinary medicine. I tried doing things the polite-and-proper way in school and saw how nothing will change in academia unless you force it. I put together a \"clinical year student bill of rights\" petition and gathered ~150 signatures from students, house officers, and professors, asking for relatively reasonable things: Capping the student clinical work week at 70 hours/week, a limit of no more than 36 hours of clinical work in a 48 hours span, and a 30 minute guaranteed break every 12 hours of work.  \n\n  All of that work landed me a meeting with the Dean, a half-assed promise to \"look into implementing some of these things\", and ultimately no tangible changes made by the time I graduated. That Dean's term ended a year later and to the best of my knowledge that petition never ended up accomplishing more than feeding the Dean's secretary's shredder.  \n\n  Veterinary medicine has work-life balance issues across the board, but nowhere worse than academia - which unfortunately is where most of us have our sense of \"normal\" shaped, further perpetuating that toxic culture.",
            "I feel this type of thing is a generational thing and it’s on its way out. I’ve experienced this type of thing numerous time in my life. Currently in paramedic school and experiencing similar situations to you.",
            "My daughter started studying towards later medical studies, and she finished her degree with flying colours. Said she had something serious to tell me. That she was really interested in a different career. - Great! Found the passion. ... That medics get stressed and she didn’t think she’d deal with it well. ... eventually I realised she thought I’d want her to pursue medicine regardless. Heck no. Those professions seem to kill their young. A pity, but to be avoided. Sure, I supported it while she wanted it but heck I see the point of noping out.",
            "I ended up not wanting to go to vet school because of stories I heard similar to this. I know I wouldn't handle the stress of everything like that well, and I was so done with school - luckily i found a job in a related lab-based field that I enjoy. But, glad your class stood up for your right to have a break. I hate when students or employees are expected to give up their breaks for something that can wait.",
            "Hah yeah that edit explains the perfect storm for fainting, even just sitting in place for a long time and nothing else can make people faint it they don't actually know how to do it properly.",
            "I get low blood sugar and will feel nauseous and will faint if I don’t eat. Add the stress to it, I think more common than people think.",
            "Is this Guelph,?",
            "Congratulations for forming your first union!",
            "I’m glad that y’all are using sterile technique though. I work in proximity to and “old school” vet that barely wipes his exam table between patients. I can’t stand it.",
            "Are you in India?",
            "If you want me to wear 37 pieces of flair, like your pretty boy over there, Brian, why don't you just make the minimum 37 pieces of flair?\n\nIf they want you there at 11, make the start time 11.",
            ">and so the dean called a school wide meeting about it\n\nI don't get why a school-wide meeting is needed about the teachers using some bizarre unofficial schedule.",
            "Yo tell us about that racist professor on zoom though",
            "Punctuality means being on time. Imagine if a train or a plane arrived and left early! It's the same as being late.",
            "Sometimes classes need a student that's in their 30s and knows how to deal with BS. I went back to school after doing 4 years in the Infantry, 3 years as a vendor stocking food machines and 2 years as a union armed security officer.\n\nPlay stupid games, professors earn stupid prizes. What are they going to do, yell at me? Lel",
            "Nice work! Set your boundaries! I will question something though… You had people faint from skipping 1 meal?",
            "Some life advice, switch to people medicine. Not sure if you have read up on market oversaturation for vets, low pay, and high levels, depression with vets. \n\nFemale vets die by suicide 2.5x more than the general population.",
            "Why is there always some dean causing problems? It's like a bad frat movie.\n\n\"The Delta Cubes will never die. We've only just begun to fight.\"",
            "Won’t the clinicians just fail all of you and have you kicked out of school?\n\nIs that not how it works there?\n\nGenuinely confused as I assumed most grad/postgrad/professional schools/programs operated pretty much the same.",
            "Vet school is definitely harder than med school - they abuse vet students way worse.  You're lucky you have a class that stands together - that's not common. I would encourage you to take this win as the first of many as this won't be the last time they abuse you..",
            "Bend em over and break it off in em. Gotta do what ya gotta do.",
            "Thank you for your service",
            "[deleted]",
            "Malicious Compliance is my new favorite!!!!",
            "didn’t read but why would you do that to those poor labradors",
            "The bullying is not on. And there is no excuse for that. There needs to be a polite professional interaction and the culture in medicine and vet needs to be better.\n\nBut, independent of the bullying, you're in for a rude shock if you think you're going to get an hour for lunch every day at work. You can definitely manage to have some lunch in half an hour or less and get to theatre. Especially if the supervisors are giving their time to be there at that time also.",
            "Several people fainted after skipping a single meal?\n\nEdit: why is a question downvoted?",
            "I would’ve simply started knocking out the “professors”. That shit is for the birds and they would’ve found that out very quickly",
            "We are all in big trouble if this is the next generation of people who will be running hospitals.",
            "Love the story but I sincerely doubt several students have fainted over missing lunch.  My eyes rolled so hard when I read this.  Why do people have to embellish good stories?\nLooking at the edit OP made people are fainting from heat not from missing lunch.  This is expressly why most ORs are kept really chilly. I have worked in CV surgery all scrubbed and gowned and it can get really hit and uncomfortable.",
            "Real med schools don't have a lunch hour. Gets you ready for residency, then real life",
            ">plus the sight of blood being a common trigger of vasovagal syncope\n\nsmall nitpick but you shouldn't be a surgeon if you have syncope. that's just common sense.",
            "Fainted after not eating lunch during the day 🤣",
            "\"Several students have fainted from skipping lunch \" Thats where you lost me. You guys need to skip some more.",
            "Several students fainted from skipping one meal? That's not normal for a healthy person.",
            "How are students fainting from missing 1 meal. I've gone like a week without eating and you definitely feel slower both physically and mentally and weaker in terms of less stamina but I never fainted.",
            "Fainting from skipping lunch?? \nLolwat",
            "I eat a light breakfast, and I eat dinner.  \n\nLunch is something I only eat if I’ve got the day off and someone to eat it with.  \n\nCan’t say I sympathize too much.",
            "[removed]",
            "Just wait until you get out in the real world and decide that you can leave at 6pm because that is your end time. And then wonder why when something goes wrong your state review board revokes your license because 4/5 of your patient notes don't exist.",
            "Im sorry but students fainted because they missed a single meal, seriously?",
            "Students \"fainting\" from missing lunch...dramatic!",
            "Who the fuck fainted though? That seems a little weak in the legs haha.",
            "\nIn human medical care, it’s most common to have the trainees show up hours before everyone else to pre-round on patients prior to procedures, review their relevant history, update paperwork for legal compliance, and identify concerns. \n\nIn the real practice of medical care, you don’t just show up to surgeries as they are happening. There is a process to be followed and a coordinated set of actions to ensure safety, right patient, right procedure, right side, right site, and emergent factors that might postpone or cancel the procedure or require interventions, considerations, or additional monitoring beforehand, and that process has to be learned. There are also interpersonal\nInteractions with the patient, family, or in the case of animals owners in all likelihood. \n\nIf you all are obstinate about missing this part of the training, I’m sure that’s fine as long as none of the class plans to be a veterinary surgeon. Here’s the reality though- surgery doesn’t always happen on the time-clock. Surgery happens when all the coordinated efforts of many professionals coincide.",
            "Learn to be professional and show up early or pick a different career field. You have the privilege of becoming a veterinarian, so don't squander it by being petty and lazy. Eating lunch takes about 5 minutes, so showing up 50 minutes early isn't unreasonable. Be better.",
            "This is awesome! Thank you for sharing!",
            "What an awful way to teach.",
            "Amen you brave soldiers",
            "r/VetTech",
            "You all sound like folks my SO would take her dog to in a minute.  Good job.",
            "Wasn't obvious to me, but hey I'm a brick layer",
            "Be kind, be courteous.\n\nThat is all.",
            "I'm glad you all could come together and make this change!",
            "Seriously this place sounds like my worse nightmare.",
            "Why yelling and mistreatment is acceptable? Who the fuck they think they are?",
            "Keep raging against the machine.",
            "Several students have fainted from skipping lunch? Why don’t I faint every morning I skip breakfast?",
            "Can I ask an unrelated question? Where do you get the \"patients?\" I've heard they are shelter animals that are used repeatedly for surgeries and then put down. It's this true?",
            "I can’t imagine why anyone would want to do that for a living.  We’re I in your shoes, OP, I’d have French kissed a shotgun ages ago."
        ]
    },
    {
        "post_id": "d9wjlb",
        "author": "CallMyNameOrWalkOnBy",
        "title": "Want to wake up an aircrew during mandatory crew rest time? Fine, we'll cancel mission-critical flights.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d9wjlb/want_to_wake_up_an_aircrew_during_mandatory_crew/",
        "score": 17008,
        "num_comments": 663,
        "created_utc": 1569566574.0,
        "selftext": "This was ten years ago in Iraq, at COB Speicher. I was part of an aircrew that flew mission-critical nighttime flights. I wasn't a pilot, but I flew in a support role in the backseat. We were lucky enough to each have our own little private rooms (called a CHU). With an air conditioner in each room, and blackened-out windows, it was easy to sleep all day, then wake up at 16:00 or 17:00 and head to work.\n\nWe had big signs on our doors: \"DAY SLEEPER. DO NOT DISTURB. COME BACK AFTER 17:00.\"\n\nThe contractor in charge of safety and maintenance of the CHUs (it was KBR, I think) decided one day they needed to inspect the smoke alarms and fire extinguishers in every room. It's a reasonable request. My boss gave KBR a list of rooms not to disturb until after 17:00. Of course, they ignored the list, and we were all awakened to workers banging on our doors and letting themselves in (\"just doing my job, sir\").\n\nAircrews are required by civil and military law to have adequate crew rest. It's more than, \"hey, get some sleep\". It's a strict number of hours before flying that should be undisturbed. It can become a very big deal, legally, if there's an accident, and it's later revealed the pilot or aircrew member wasn't given a chance to properly rest.\n\nAs inefficient as the military can sometimes be, it's amazing what a single well-placed phone call can do. My boss shamelessly cancelled the evening's flights, and called Colonel Head Honcho to tell him why.\n\nWe never saw KBR again. They avoided us like the plague.",
        "permalink": "/r/MaliciousCompliance/comments/d9wjlb/want_to_wake_up_an_aircrew_during_mandatory_crew/",
        "comments": [
            "Things I learned from military malicious compliance...\n\n1, Always answer the barracks door with a beer\n\nAnd now 2, get a critical night shift job, get guaranteed sleep or not responsible for job",
            "Back when I served in the RNoAF the officer who showed us around pointed out a building with blacked out windows, and told us that anyone even considering playing a prank on those sleeping inside could just head over to the admin building and request a transfer to base maintenance.",
            "It sounds like the Colonel (and possibly a few other people) had a nice and friendly chat with the head of maintenance, to exchange pleasantries, advice and encouragement. Possibly with tea and cupcakes or maybe some cucumber sandwiches. \n\nOr they ripped them a new one, the size of a hangar door. \n\nWhile the second one is slightly more probable, the first one might actually be quite a bit scarier. I'd imagine lord Vetinari would do something like this.",
            "Fuck KBR I never saw a more worthless group stealing millions from the government and still somehow managing to treat us like shit.",
            "Military for 20+ years, aviation Support for the last 12 of it. I really was expecting some high in his pants officer to come knocking on your doors to do a police call. I've seen it done in the past, some idiot read somewhere that a soldier only is required six hours to sleep by regulations and that six hours is subject to extras duties. \n\nI've seen more than one asshole with shiny on their chest disappear for waking the air crews to do extra shit.",
            "same kinda rules apply to commercial truck drivers, and it's ridiculous what some employers will try to get away with to make them drive more than they sre legally allowed to do",
            "I’ve lost friends in two helo crashes. Both times the investigators heavily attributed the lack of adherence to crew day for the crashes.\n\nOne was straight up the skipper’s fault. Had the crew (which included himself) at early morning PT, event briefings during the day, then a lowlight flight at night. \n\nRIP Wally.\n\nThe second was similar but off the boat. An entire day of briefings and planning that members of the crew needed to attend. Followed by a long flight over water, then lowlight overland, then back overwater to the boat. I am so glad the Airwing doesn’t care about the 3710 when they do their scenarios.\n\nRIP Sean, Purve, Aaron, Grant and Oubre",
            "[deleted]",
            "> Of course, they ignored the list \n\nClassic KBR. I had a similar situation in Iraq. Those dudes would visit my CHU numerous times a week. One day, they'd check the fire extinguisher, the next the light fixture, then the day after that, they'd look at electrical outlets in the room. If only there was some way to do all of those checks at once rather than returning every day, waking up soldiers supporting operations.",
            "[deleted]",
            "I wish they had the same type of mandating for other jobs. During my time in the army, we were in Iraq doing field artillery ops. I was stuck on a base of 50 people, only 5 of us were E4 or below. I was the only medic and crosstrained to operate a RAID camera. \n\nInitially the shifts were decent, 8 hours on, 4 hours medic duty, and 12 off. It changed about a month in when they needed the other lower enlisted to drive or do other duties.\n\nThey had me on that camera for 42 straight hours. No break time, meals brought to me and I was reamed for getting up to go take a piss. Asked the NCO in charge and explained that I had been on it for something like 36 hours. He told me \"you'll be alright\" and went to sleep.\n\nNothing got done until after 40 hours when I let the Colonel know.\n\nSeriously fuck the military.",
            "Ahh. Always cover your ass (CYA). If you'd have done the missions and something happened, you're going to be screwed because 'why didn't you inform your superiors?'\n\nThis way, you informed your upstream and *they'll* be the ones to take the blame for anything.",
            "Me, rubbing shit out of my eyes, in pajamas - 'Sure SSGT I can help you with these extra tasks, but I need you to run it past ( COMPANY COMMANDER ) as I was one of the two crewchiefs in her aircraft tonight'\n\n&#x200B;\n\n\\*wide eyed E6\\* - 'Nope thanks SPC wrong room go back to bed'\n\n&#x200B;\n\nI only got to do that a few times in my career, but yeah. Everyone involved took it seriously and people would routinely sit out for illnesses.",
            ">We never saw KBR again\n\nHa ha haaaaa but I bet they still billed you for their time that you didn't see them. \n\nSource: I work for them",
            "[deleted]",
            "COB? CHU? KBR? For anyone here who doesn't speak jarhead:\n\nCOB: Can Of Beans  \nCHU: Charizard's Hiking Uniform  \nKBR: Kenyan Breakfast Rice",
            "Ah Speicher, where I had to burn poop. Don't miss it.",
            "Holy shit, I was a tanker and there were absolutely no requirements for minimum rest. Mission first. Sometimes we were up for days, especially if your tank had mechanical issues. It’s difficult commanding three guys, being responsible for a killing machine and its operation, and firing off rounds when you’re so sleep deprived that you’re seeing witches in the air and big cats running along beside you.",
            "10 years ago? When exactly? I was out in COB ~~Spencer~~ Speicher and FOB Brassfield Mora from Spring of 08 till Summer of 09.\n\nEdit: stupid autocorrect.",
            "Well that explains why they kicked me off the base when I was doing door to door sales when I was young.\n\nWoke up quite a few soldiers, they did not seem happy, but I was a kid and my boss told me to do it.",
            "Haha, I think we were in the same unit.  TFO?  I used to fix your comms.  One of your buddies was responsible for that whole incident that got USB ports turned off DoD-wide.  ;)",
            "Dont fuck with night shift especially",
            "If you haven't been by yet, r/militarystories might also appreciate your contributions.",
            "Former load master here. Crew rest was basically untouchable time, and there was good reason for it. It wasent uncommon for me to flop my sleep schedule 3 or 4 times a month, just part of the life. \n\nJust dont fuck with those guys during thier time, they need it. As I'm sure you know. \n\nAlso I had a number of similar incidents just in the 6 years I was in.",
            "/r/militarystories",
            "I always thought this rule was a little OTT. I Was in Afghanistan in the British Military, living in squalor sweating my balls off in a tiny FOB pulling guard after patrols working 18hour days and trusted with all kinds of weapon systems and to drive large ass vehicles. All good, its what I expected and enjoyed it most of the time.\n\nGo back to the larger camps for a flight out or something and not only do the flight crews need aircon tents and mandated rest etc, which I can understand...But the guy who operates the camera on a UAV? He counts as flight crew. So he spent 6 months moving from Airconned box to Airconned box, mandated rest. Same pay, same medal.",
            "Be nice if all vehicle operators got mandatory rest, but in my unit they got the least sleep. I fell asleep at the...wheel?...at least a dozen times in iraq. Not as dangerous as someone flying obviously, but still not good to do lol.",
            "As long as the fire equipment was subsequently tested.",
            "When FAR 117 was implemented for civilians, we had quite a few flights get delayed or cancel because crew scheduling tried to all them during their rest to notify them about something that could've waited, resetting the rest clock",
            "Ah... KBR, the little known acronym for \"Keeping Bums Rich\"",
            "Ahhh crew rest",
            "For all we know they were also being maliciously compliant",
            "You get sleep?!",
            "Civilian contractors were called Feather Merchants in the old days. Feather Merchant is a bird that shiatts on the troops and gets protected by the government.",
            "Task force Odin?",
            "I was Flight line hydro, I can absolutely vouch for this. Also, don't piss off the Knuckle Buster's, we will ground you.",
            "Pretty sure they have that regulation for vehicle operators as well but that didn't stop them from making us drive all day up hwy 1 in Iraq, going 35 mph with three hours of sleep.",
            "KBR and their shitty ilk are a large reason we ended up in Iraq. Fuck them completely.",
            "As former aircraft maintenance in the USAF, my cares and concerns for the crews' mandatory crew rest was categorized somewhere between one and waaa you poor babies. The guys actually doing work, actually fixing your plane get no crew rest and are working 14-16+ hour shifts to make sure your plane was in working order while you all complain if you don't get a full 10 hours. Y'all would bitch if it was a pretty day and no clouds just so you could go golfing instead of doing your jobs and fly around the flagpole for a few hours. Crew rest is the most bullshit nonner excuse ever.",
            "I was at spiecher almost 10 years ago. Closer to 8 or 9. Was there with 1st cav and we closed down the base to turn over to the IA",
            "ABM?",
            "AF AF",
            "I didn’t know you guys have mandatory rest, I’d think sleep would be treated as a privilege and that was a scary thing to me.",
            "Yeaaaaa, they just set up a transient tent for us day sleepers because they REALLY wanna inspect the AC and extinguishers now."
        ]
    },
    {
        "post_id": "egrkog",
        "author": "arialani_freespirit",
        "title": "Taking advantage of someone on his last day in the military? See how that goes for you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/egrkog/taking_advantage_of_someone_on_his_last_day_in/",
        "score": 17000,
        "num_comments": 588,
        "created_utc": 1577544707.0,
        "selftext": "This happened to my Dad a long time ago but he loves to tell us the story:\n\nMy Dad was literally working the last day of his enlistment in the Navy. He worked in communications, but his supervisor decided to get some manual labor out of him on his last day by making my Dad put down new tile in one of the mess halls. Since it was a direct order, he had to comply and do the job. \n\nHe carefully laid down perfectly spaced tiles  in the entire room. It took him the rest of the day, but he made sure that it was as perfectly lined up as humanly possible. Supervisor looks in the room, approves the job, closes the door and tells him he can go home. What he didn't realize is that my Dad used absolutely no glue of any kind. I don't know what happened the next day when someone actually discovered what he did, but I am sure it didn't go well for the supervisor.\n\nHe never heard anything about it, but was planning to play dumb and say he didn't know it needed glue, after all, it was a job he was never trained for.\n\n\nEdit: This was in the US in the 1970's",
        "permalink": "/r/MaliciousCompliance/comments/egrkog/taking_advantage_of_someone_on_his_last_day_in/",
        "comments": [
            "\"You told me to put it down, you never told me to glue it.\"\n\nLol in all honesty though, what could they do about it?",
            "When I was in the Navy we found out about a flooring that wouldn't need to be waxed and buffed.  It cost $50,000 to put in a test floor in one of the officer mess spaces (we had one in the middle of the carrier for most officers and one up on deck 2 forward that was mostly flyboys, the latter got the special tile).\n\nIt didn't last a day before a Master Chief asked one of the FSAs if it had been waxed lately, and when he heard no, said FSA was told to wax it.  CS1 knew about the special flooring and tried to explain it, but \"a 1st class doesn't explain anything to a Master Chief who has been in the navy longer than the lubber has been alive.\"\n\nOnce you wax the flooring it destroys the special coating that keeps it shiny without wax.  50k down the drain, sigh.",
            "Always love hearing military stupidity stories like these.. When my dad as getting out of the Army he went to outprocess and they \"lost\" his paperwork so he would just have to go back to his unit and keep working. He said \"fine, I will go back.. and sit down and do absolutely nothing whatsoever the second my contract ends.\" Magically they found his paperwork within a day and he got his discharge.",
            "Bet supe was floored next day.",
            "That could have gone horribly  if the supervisor took one step in the room.",
            "Not MC, just basic military NCO idiocy.\n\nI like to tell the story of the time my fiance fell out of a coast guard helicopter and lived. It was parked at the time.\n\nCO told him to service the tail blade. Not certified. Fell off the ladder and shattered his cocyx. \n\nVAs response was give him enough oxy for a three month long bender.",
            "Must of been a real dick of a super.  Most guys don't do squat the last month.  \n\nI was getting out and my supervisor was getting out six months after me.  The last month I came into to work and one day he asked why and told him \"I work here, kind of thought you guys would want me here.\"\n\nHe replied \"No one is going to see me here the last month.\"  That was the last day I ever went in.  No body ever came and arrested me.",
            "Holy fuck this is amazing. Like it's a small world amazing. I worked with an old guy a few years back, and I'm like 99% sure he has the missing piece to your story. As in I think he was the guy that had to glue all the tiles down. He said he had to go back over a tiling job somebody did before they left. He says it was easy though because the guy before him did a spectacular job laying out the tile, all he had to do was glue and grout it.",
            "When I got out of the army  in the early 2000s, I got signed out of everything and cleared that I had turned all my stuff in and my room was ready to turn over. This was Friday, and I was officially out on Monday. \nThey kicked me out of my room and said I wasn’t their problem anymore. I had to sleep on a friends floor until I left Monday. \nOne thing I discovered about the military, they don’t give a fuck about you. \nOne thing I discovered about the VA, they don’t give a duck about you.",
            "A similar situation happened to a teammate of mine a few years back. He had got in some trouble and landed UCMJ action (punishment of 45 days extra duty, rank loss and pay). They made him lay down concrete, which took all day. The very next day, he had to rip it up because he wasn't trained to do it.",
            "I was a Crypto Tech rider and during down times, usually transiting back home, the PCS'ers (ships company) would give the riders shit jobs before we got off the ship in the next port.\n\nOne day the PCS LPO (leading petty officer) assigned an 0-4 level bulkhead for painting. Painting was usually the plan of the day to cover up all the rust before getting home with a pretty pretty ship.\n\nWe had our orders, with the only supervision being \"Go to the paint locker and get the materials you need and paint that bulkhead\". Okay.\n\nAt the paint locker \"What kind of paint do you need\".\n\n\"I don't know, we're painting on the 0-4 level\"\n\nThey gave us heavy rollers and ... [nonskid paint](https://imgur.com/smH4U97).\n\nWe got the entire bulkhead done before he could check our work, and when he did saunter up there, he was none too happy.",
            "Must've been somewhere in Floorida",
            "I can respect this type of petty compliance, the air force here in the UK tried to screw me on my very last day (technically the day after my last day).\n\nMy march out date for clearing my accomodation was the day *after* my service ended, I was leaving because I'd eventually grown to hate being in the forces due to all the bullshit. Despite paying for the accomodations \"professional clean service\" which they said was a guaranteed inspection pass, they said my room wasnt to standard and tried to sell me the service again, when I told them how I'd already paid for that service they claimed to have no record of it. \n\nWhen I kicked up a stink they got the CO for accommodation to come over, he looked like a brand new officer fresh out of training and he was clearly not prepared to deal with insubordination, he \"ordered\" me to either pay the cleanup charge or clean it myself again I laughed and said \"fuck no\". He stood there sputtering and eventually managed to blurt out \"How dare you speak to me like that, I'm an officer and you will address me as Sir\". I laughed again and said \"As of midnight last night I'm a Mr so you should be the one calling *me* Sir\". \n\nHe stormed out and got into his car, I called out after him \"I'll just leave the keys here shall I?\" and forged his signature on the clearance form.",
            "Specialist first class: hey pv1 dicknuts, go get the chemlight batteries and drill pad keys from 1sgt. \n\nPv1: alrigharoony specialist blue falcon",
            "Mine wasn't compliance but was still military.\nWhen my last months in service arrived my commander tried to make me sign a new contract to keep me in service for another 2 years since I was the best APC mechanic they had. I refused because while loving my job and the people working with me, I hated the system and officers working in said system.\n\nSo from that point on the commander decided to show appreciation for my years of service by making my life a living hell. Waking me up early in the morning for odd jobs, calling me back from home early for no reason at all, planning raids on my room to look for ilegal stuff etc etc. \n\nEntering my last month of service his treatment of me peaked when he decided I should now do guard duty 3 times a week every week until I'm released (standard is once every TWO weeks) including weekends which means I won't get to go home for a full month. Well I had enough and simply refused. He threatened me, yet I kept refusing. It seem like the guys I worked with started to notice and so as a \"good bye gift\" they split all of my guard duty for the month (including weekends) among them selves making it so I don't have to do any of them. I remember quite clearly bursting into tears when they told it to me because I was so incredibly touched, and I still believe it's the kindest thing anyone has ever done for me.",
            "Wow. I didn’t know how common that was. Tiling is something that people need to be trained for. \n\nThey had me put that rubbery lining thing that goes above the tile floor and sucks up to the wall. \n\nI said, “Sergeant, I don’t know how to do that. And all those pieces have been used, I don’t know where each piece went.”\n\nDude was like “shut up it isn’t hard, do it.”\n\nSo I did it. I used chapstick and Elmers glue. It looked like absolute dog shit. \n\nCap asked me what the fuck. I said, “Sir, I’m not a carpenter. You want me to kill? I’ll kill. You want me to collect intel? I’ll collect intel? You want me to walk reeeeeeally far away with a stupid heavy back pack? I can do that. But I don’t know anything about installing a floor.”",
            "A former instructor of mine did somethinf similar, but it was when he first hit the fleet. He was getting a bunch if stupid jobs, since he was the boot, and one of said jobs was to clean a huge hallway with a scuzz brush.\n\nSo he complied, and proceeded to start right outside the OIC's office, who promptly told him to get back to real work.",
            "I just got out of the Navy a couple months ago. The story of the mislaid tiles is still told. Because of OP's dad, personnel getting out of the Navy are now afforded weeks, of not months, to prepare for their transition back to civilian life. The only work allowed on their final days is to complete their check out processes. \n\nYour dad was the impetus for a Navy-wide cultural change.",
            "Haha. My friend filled a conex box that was headed to Iraq with office chairs in a similar story as he was set to leave the marine corps.",
            "Lol on my dad's last day, he swiped the CO's mug from his desk and still has it to this day. This was over 40 years ago.\n\nEdit: The CO's have specially made coffee mugs. I guess he spent a week searching for it. A couple of years ago, my dad met up with him, and before he went, he took a picture of himself drinking from the mug with a thumbs up and the \"CO\" text visible on the mug. When they met up, my dad showed him the picture and yelled \"I KNEW YOU FUCKING TOOK MY MUG!!\"",
            "Chances are this never went above the NCO. He would have been too embarrassed to admit someone pulled this over on him and would have just ordered another grunt to put the glue and re-set the tiles.",
            "A guy I used to work with was one day away from getting out of the guards and his unit was called up. He spent a year overseas.",
            "Y'all realise his NCO probably laughed his damn ass off, used a whole bunch of 4 letter words, then told someone else to do it while still laughing?",
            "On my last day there was a supervisor that had it in for me. He tacked on other people's tasks for me to do by the end of the day.\n\nI said I'll do it. And then I just... Walked off the ship. What were they gonna do, call me back? For 3 of the remaining hours of my enlistment? Nahhhh....",
            "Your dad is a troll. I like him.",
            "Knowing government stuff, this probably only bothered someone for 10 seconds, they curse and swear a bit, then ask someone else to fix it.  \n\nNobody cares because it's not coming out of their personal bank account, so they can be super wasteful and not accountable for it.",
            "Don't worry. People do this on the daily in the navy and marines.",
            "Sounds like he didnt use up his leave days for terminal leave.  I had two months I saved up for separation and they for sure would have ordered my ass back and cancelled it if i pulled something like this.",
            "Your dad is a genius.  You can't do better than to follow in his footsteps.",
            "As an electronic technician for comms this makes me all warm and fuzzy inside\n\nBeautiful compliance",
            "It's probably just how he left it, to be honest.",
            "As someone who is about to go cranking after the holidays in the Navy, this gives me such joy.",
            "See, he's always trolling.",
            "Nice one,  the supervisor is proof that military intelligence is an oxymoron.",
            "As a Navy Vet, I salute your dad. Epic!",
            "For anyone wondering, this shit doesn't happen now-a-days. I mean hell, technically your last day is out-processing, getting your paperwork checked off that shows you out-processed where you needed to, have your plane ticket/plan to get home, and then that's it. I guess some supervisor \\*could\\* ask you to come in after that, but it just doesn't make any sense. The only reason they'd do that is to see you off and wish you a good one.",
            "A better fuck you would've been to heap a fuckton of cement on the edges of the tiles (I'm assuming these weren't 1\" tiles and are instead 6-10\" tiles) and not a drop in the center. \n\nEvery tile will crack or come up in short time.",
            "Quite a risky move because if the guy would have just walked on the tile then he would have noticed it wasn't glued down.",
            "[removed]",
            "INFO: were the tiles laid down touching, or like 1/8 inch apart for grouting?",
            "I don't know what it is about getting over on an authority figure, but it makes me feel all warm and fuzzy.",
            "Taking the entire lane, it's safer for everyone",
            "Your dad's a real jerk here.  He was paid (by the taxpayers) for a day or work.  And because he had commo training and felt manual labor was beneath him he basically stole a day's wages from us."
        ]
    },
    {
        "post_id": "udywnf",
        "author": "Super-Monkfish",
        "title": "Phone must be off during Work? You're the boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/udywnf/phone_must_be_off_during_work_youre_the_boss/",
        "score": 16995,
        "num_comments": 431,
        "created_utc": 1651163099.0,
        "selftext": "Happened back in 2015 roughly.\n\nI was working at a betting shop, pretty large one that anyone from UK has probably heard of. We were open from 8am to 10pm.\n\nOne big rule was mobile phones were to be turned off during work hours, no ifs or buts.\n\nCue the morning of the Epsom Derby, a big horse racing event and the start of my 12 hour shift. During setup, we had a problem with our Internet. The tills, FOBTS (fixed odd betting terminals) and internal phone line were all connected by the Internet, meaning until it was fixed we could take literally no money.\n\nI waited and waited, about 3 hours had gone and nothing had improved and I had no way of letting anyone know, my phone HAD to be off.\n\nAt about 5pm, we eventually had Internet back.\n\nNot long after, I eventually got a call from my area manager, as to why there was no money taken.\n\nAfter a lot of huffs and puffs, he hung up.\n\nI was just following the rules.\n\nA short while after, maybe about 20 minutes, I get another phone call from said manager, asking if I could take pictures of the marketing screens to make sure they had loaded correctly and then send them to him.\n\nNo I can't, sorry, my phone needs to be off.\n\nHe had to do a 3 hour drive to the shop to check himself.",
        "permalink": "/r/MaliciousCompliance/comments/udywnf/phone_must_be_off_during_work_youre_the_boss/",
        "comments": [
            "Sending an email saying to use proper discretion would solve literally all of his problems surrounding this.",
            "I worked at a place that allowed phones, but banned cameras. The only camera allowed on site was kept in a locked drawer.\n\nSo what's the owner of a fancy Sony flagship with spiffy camera gonna do? Leave it in my car? Hell no! I'll muck with the firmware and delete the camera driver! \n\nVoila! Camera phone without a camera.\n\nOne night there's an accident, and I have to take a pile of pictures for the report. Out comes the company camera and.. The batteries are dead. I get half a dozen underexposed blurs before it blinks out for good and has to go on the charger.\n\nI email the bosses; Camera dead, oh so sorry. You'll have to wait until the photos from the one use camera I had to buy with the company credit card are developed.\n\nAfter a couple of days I got called up on the carpet.\n\n>Boss: About the other night.. I know that cell phone you just bought takes pictures, so why didn't you use it?\n\n>Me: I'm not allowed to carry a camera, so I have it disabled.\n\n>Boss: Sure you did. Give it here. \n\nTry as he might, all could get from my phone was \"Camera Error\".\n\nBefore I'd even left the room I had a shiny new email waiving the rule on cameras.\n\nTwo months later I got the rules on personal email and company laptops changed by wasting two hours driving back and forth between the office and a job site. Can't take measurements unless I'm there, and can't email my responses to you from anywhere else but the office, so.. :)",
            "So he needs to buy a back up cell for the shop for times like this. :D",
            "Had a similar supervisor institute this rule. \"if i find you on your phone I'm sending you home for the day.\"\n\n\nShe denied my time off request. I lightbulbed ten minutes into my shift. She sent me home. Called me three hours later asking me to come in bc they were swamped, she'd even be so gracious as to pay me the full day, nah i had tickets to a concert i was already on the way to.",
            "What is great about this is that all the manager had to do was admit there are times when using a phone at work is appropriate and but he is so soft he couldn't admit it and just lit time and money on fire to save his paper thin ego. \"I'm good at business!\"",
            "Well played.  Had you taken that picture and sent it, he or someone at Almighty Corporate would have used it to give you the sack.\n\n\"It was a test.  You failed.\"",
            "> Female Bookie: All bets are off.\n> \n> Sol: I'm not in here to make a ****ing bet.\n> \n> Female Bookie: 'preciated, but all... bets... are... off. If all bets are off, then there can't be any money can't there?\n> \n> Sol: I ain't ****ing buying that.\n> \n> Female Bookie: Well that's handy, 'cause I ain't ****ing selling it. It's a fact.",
            "Having worked in betting shops in the uk they are 100% this petty. Loved the job at times, hated it at others and the browner your nose the higher you fly regardless of ability, intelligence or general work ethic.",
            "Sounds like the shift leader should have had a company phone. lol",
            "Let me guess, one or 2 people were on their phones too much (in the manager's opinion, not mine), and instead of punishing them, they decided to punish everyone.\n\nYes, because that always works well and never backfires.... \n\nIn my experience, it seems to be somewhat of  a generational thing in regards to people doing things other than work while at work.\n\nI'm a Xennial and of the opinion that as long as you're getting your work done, who the fuck cares what else you're doing, as long as you're not hurting yourself or others.\n\nThe whole idea of you must stand/sit there quietly and do nothing or the old stupid BS: \"time to lean time to clean,\" especially when you literally just cleaned the same thing 5 minutes before. I never understood the point other than it being about them controlling people.  So dumb.",
            "Sure, I'll go buy a disposable camera, find a store from 1998 that still does 1h photo development and fax the pictures to you!",
            "Good. If they want stupid rules then they'll have to work stupid hours.",
            "i once worked at a place where we had to sort letters it was a pretty easy job and everyone was listening to musik one day the leadership said phones and musik was no longer allowed the next day 3 ppl didnt come back (we were 8 at each shift) a few days later another guy just left mid workday after an argument with the boss and they didnt hire new ppl after about a week i said i was sick (this was a short time befor pay was due) and once i was payed i just ignored their calls",
            "“I’d be happy to take pictures.  Where’s the company camera?”",
            "I hope they disclosed this during the hiring process. What if you're a single parent or something and God forbid they need to get a hold of you? It isn't fair to pass up on other (better) offers if they're this strict.",
            "I used to work at Ladbrokes head office back in the day, designing and programming the screens and creating the on-screen marketing. Was a blast and a bunch of amazing colleagues. Worked with other departments too such as IT and marketing. That was without doubt an area manager problem, no way anyone above would have let the shop go more than an hour without internet without some form of intervention, ESPECIALLY during a major event such as Epsom or Cheltenham.",
            "I love it.",
            "All. Bets. Are. Off.",
            "Well played",
            "This reminds me of a the rule of no phones with us during our shift. Well they now have no way of contacting me to jump on the tills if things go chaotic. Apparently they tried to find me one day and couldn't. They figured I was hiding somewhere slacking off. They checked the cameras, turns out it was an unknown game of cat and mouse and we just never crossed paths. It wasn't a big store either, but there were two staircases and enough of a hike up that it made it hard to catch up with me because I would zoom around without thinking. They could have just let me have my phone but no. Customer needs to know if something is in stock, sorry, no can do, can't check my phone anymore as we aren't allowed them. Go pester the supervisors to find out and tell them their new system sucks as I used to find stuff quickly for them. \n\nThen there was the time the test area needed to borrow my sim. So I ran upstairs, grabbed my phone then left it in my pocket, simless. Someone noticed, snitched and I got in trouble. The store was packed, queues going out of the door and they wanted me to take four trips up and down three flights of stairs when my phone wasn't even usable because it wasn't connected to the stores WiFi. No. Luckily the guy in test verified he'd asked for my sim. Last time I let them use it though. Wasn't worth the hassle. Need my sim, sorry, can't, I got in trouble for letting you use it last time so I'm obeying the rules. Not touching my phone during work hours apart from break.",
            "Perfection!",
            "Sometimes it sucks for the company when their rules are stupid.",
            "Hoisted by his own petard, very nicely done",
            "When you implement crappy rules,  you need to sometimes expect crappy results.  His six hour round trip is the direct result.",
            "Good for you.",
            "Nice",
            "Oh you work for betfred I’m guessing. (I have met the actual owner once) \n(Don’t confirm or deny). Good on you for doing what you were told and leaving no room for punishment",
            "exactly, stupid rules.",
            "Bad rules are good. When you can use them for your own purposes!",
            "Just give me the camera and ill take the picture...my phone is at home",
            "Fuck Ladbrokes",
            "So there was no office phone? \n\nWhat would you have done in an emergency, let’s say there was a fire, you wouldn’t have called the fire brigade?",
            "What about the shop phone???",
            "So were you allowed your phone after that?",
            "I used to work at a bookies also (lets call it Billy Mountain), and if we were opening the shop at 8am we got paid from 7:45am. It would take at least half an hour to set up the shop as we had to put up all the forms on the walls for the days racing, we had to close and set up all the FOBT's, and we had to transfer the money from the safe and count it all to make sure it matched with the previous days figures. I started to get there and sign on the EPOS at 7:44, and when we opened at 8 I still had to finish putting all the forms up etc. The DOM (District manager) wasn't happy with this and tried to make me get there earlier, but after asking him if there was a law regarding forcing people to work without pay he soon shut up and asked that I focus on getting all the forms up first so it looks presentable for when we open. I only lasted another 4 or 5 months after that, as the hours were ridiculous (sometimes I was working nearly 60 hours a week, 5 days a week because we were short staffed), the pay was terrible (so even though I was doing all these hours I was salaried at 37.5 hours so wasn't getting paid for them), and some of the customers would really kick off if the amount they got paid differed from what they had worked out (I once spent 35 mins with an elderly gentlemen explaining that he only received £8.70 instead £9.10 because the odds were in face 6/4 and not 7/4 on his last horse in his lucky 15).",
            "You could have just said you didn’t even bring your phone to work, since you’re not allowed to turn it on.  It would make sense and further reinforce that they did this to themselves with their rule.\n\nIt would sound better than just refusing to turn it on.",
            "Ah I love when companies stupid rules back fire on them it's fun sweet carma",
            "My wife works for the local school district and management keeps bugging her to apply for a different position.  It pays $2 more an hour for 5x the work/stress as her current job.  She keeps telling them \"no.\"\n\nThen they complain they can't find people to work there.",
            "Out fucking standing!!! You are an absolute star.",
            "In the boss's face! Bwahahaha! You Lose.\n\n🐾🐺🐾",
            "[deleted]",
            "How you weren’t fired is beyond me. I am certain that during that phone call, he told you it was okay to turn on your phone and use it. There’s no way he would rather drive six hours round trip than to give his employee permission to break a rule during extenuating circumstances.",
            "This is a weird one. \n\nIt’s malicious. ✅ \nIt’s compliance. ✅ \n\nYet no satisfaction. It sounds like this scenario *could* involve obnoxious bosses, but nothing in the story really indicates that. Just a phone rule, albeit a strict one. \n\nI guess I prefer my Malicious Compliance to have some vindication. Some well-earned revenge. I will keep searching.",
            "I understand there are people who come to work and just spend hours swiping on their phones, it pisses me off too, but banning phones in the workplace outright, where there is no real need is not practical in today’s world. If you want to ban someone from using their personal phone in the workplace, then you should at least provide a work phone with limited capabilities. Most people just want to be able to communicate with spouses for emergencies or issues at home like organising who’s picking kids up etc.",
            "This should be cross-posted on r/antiwork. It would fit perfectly there.",
            "Ooh, this one. I like this one.",
            "This is the best story I’ve ever read on here.",
            "Stupid rule gets sweet justice laid down upon it repeatedly.  Good. Goooood.",
            "Not as satisfying when there’s no stated reason for being malicious. Reads more like being a jerk for the hell of it just because you could get away with it.",
            "Wow you are so cool man",
            "How did you get a call from your manager if your phone had to be off? I thought it might be a landline in the shop but you also said you had no way of contacting anyone.",
            "[removed]",
            "Nice!!!",
            "Employees who are on the clock shouldn’t be on a cellphone for personal reasons unless it’s an emergency. \n\nNo customer or associate or client wants to have to wait for you to finish watching a TikTok before they have your attention.",
            "You sound like a shitty worker.",
            "I believe ur actions are mean and lame\nI can understand their rules but i dont understand ur behavior\n\nFrom ur manager point of view, u should be a phsycho who enjoys getting at any figure of authority to enjoy ur self",
            "[removed]",
            "Very nicely done 👍",
            "Nicely done!",
            "Im more interesting in betting shop, wow",
            "You worked in a betting shop man why would you expect anyone there to not be scum?",
            "I love the ending.",
            "I used to work at a very large betting shop in the UK, that was blue and ran by a guy called Fred. \nThey scheduled me to do a 8am - 10pm despite knowing I had a hospital procedure the night before that needed anesthesia. \nNeedless to say I took my Dr ordered time off, used my PTO and never went back to that big blue hell hole.",
            "How did he call you 🤔\n\nAlso did they remove the rule?",
            "Nice how they enable you to make exceptions to any rules at your own discretion."
        ]
    },
    {
        "post_id": "dmtvik",
        "author": "Classy_Pyro",
        "title": "\"Sorry boss, I don't speak spanish\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dmtvik/sorry_boss_i_dont_speak_spanish/",
        "score": 16953,
        "num_comments": 513,
        "created_utc": 1571988087.0,
        "selftext": "**TL;DR is available at the bottom of this post.**\n\nI work at a hotel as a night auditor, and this malicious compliance begins with a small bit of information I was told when I was initially hired for this position. When I interviewed for the position, and this is very important later on, I was told by the HR lady that the hotel paid a bonus ($100) for each foreign language I spoke well enough to serve our guests. Management cleared my $100 for speaking english after I passed through their evaluation period (my main language is portuguese).\n\nAt first, I was glad to be working in the night shift, mostly because my colleague then, Mr. Castillo was from Guatemala, so whenever any guests that spoke spanis showed up, he handled it and in turn, I handled any english speaking foreigners. Naturally, he did a lot more work since the amount of spanish speaking guests we receive is significantly larger than our english speaking ones. Meanwhile, Mr. Castillo was in the process of learning english and I had taken an interest in spanish so we helped each other out.\n\nNot long after, Mr. Castillo got himself a job paying several times over what the hotel did and sadly, left me. My new colleague, a newly promoted bellboy didn't speak english (though he could understand some) and didn't speak spanish at all. In fact, he didn't even try to improve any of his language skills while I slowly kept improving my spanish, trying to use more and more of it everyday to serve our dear guests. As of the start of this month, I spoke to our frontdesk manager and asked him in plain spanish, what did I have to do exactly to receive the $100 bonus for speaking spanish. He was surprised but said nothing more since the front desk got busy with check-outs and my shift was up, but a few days later he mentioned he spoke to HR and informed them I was speaking spanish well enough to receive my bonus, and now he was just waiting to hear back from them.\n\nA few days later, the HR lady asked me what size shirt I wore since they were going to be ordering new uniforms in the coming weeks, and took the opportunity to ask her about my bonus for spanish and she mentioned they were talking with our director about it. A day later she informed me they wouldn't be paying me the bonus for a foreign language since it was on file that I was already receiving it. I replied I was receiving a bonus for english, not spanish and she said she would speak to the director again and within a few days, all would be made well. Now I'm not really in a hurry to get my bonus, but it would be nice if they had cleared it already, as it would show up in my next paycheck, but guess what? They didn't. Our director talked to HR again, and my boss and told them that, even though I am serving our dear spanish speaking guests, in spanish, I don't in fact, speak spanish.\n\nI'm far from fluent, but I can explain how the hotel works, direct guests to where they need to be and assist them with what they need, be it finding a pharmacy at 3am, getting a cab to go out and get drinks, or even hire an escort (yep), but apparently it isn't good enough for our director and my manager said he can't really afford to fight him on it. Okay, no biggie I guess, maybe we'll try again next year when I can speak a little better I thought. However, the cruel and unforgiving gods of the hotel industry gave me the perfect opportunity to strike back...\n\nEarlier last week we received a large group of 30+ spanish speaking tourists, which in addition to our normal occupancy, meant we were effectively sold out for the week. Big groups are usually a minor incovenience when you're checking them in, but an even bigger problem when checking them out. Especially if they're 1 person per room, which means you basically have a huge load of rooms to check-out, one by one, while an endless line forms in front of the front desk. 80+ checkouts aren't unsual for our hotel on friday mornings, but 110+ is a problem. Normally when the morning shift has a workload this big, our front desk manager comes in early to help, but he couldn't this time since he took a personal day since his mother fell ill. That left our director with only one choice, to ask the night audit to stay late and help until our reservations people clocked in and could then replace us at the front desk.\n\nSee, my colleague doesn't like staying late, especially since he works at a second job with his father in the afternoon, meaning he only has the morning and early afternoon to sleep. I don't like staying late on fridays because of the amount of check-outs, which means it'll be forever before you can take a breath and even more so before you can leave. However this time our director didn't even ask my colleague and instead told me to stay late because we would have a sizeable workload and about a third of it would require someone that spoke spanish, or it would slow down everything to a crawl. I told him I would not be staying late that morning and before I could get another word him, he started yammering about how I'm wrong and I should be more of a teamplayer and the he would be very grateful for it. Wanting to get back to my sleep, I told him to ask my colleague and he said he couldn't, that they needed me and when I asked him why, he clearly stated \"We need 2 spanish speakers that morning to make sure everything goes OK with the checkouts.\" Not one for missing an opportunity to get payback, I replied \"Sorry boss, I don't speak spanish\", turned off my phone and went back to sleep.\n\nUPDATE: Sorry for holding out on the aftermath. I wrote this during my shift and as I was putting on the finishing touches, we had a server crash and I spent the next hour and a half trying to restore our backups and get the camera system up again.\n\nUPDATE - Aftermath: After I woke up and turned my cellphone back on, I had several missing calls from the hotel and two missing calls from our frontdesk manager (good guy). I called back the hotel but the afternoon shift picked up and they didn't know anything so I called my manager's phone. He answered and asked me what was going on because the director was furious about me \"hanging up on him\" and that I was \"refusing to work\". I explained to him the situation in regards to my bonus for speaking spanish, and since the hotel was trying to hold out on me, I was going to withhold performance. Anyone who's ever worked costumer service know how much damage withholding performance can do, even if it just a little. In the end, my manager begged me to stay until our reservations people came in at 8AM (my shift ends at 07:20AM). I agreed on the condition that I would not check out anyone who spoke spanish. He reluctantly accepeted and said he would back me up in the following shitstorm that would happen.\n\nWhat happened was that the group came down for breakfast precisely at 6:40AM, finished at 07:10AM give or take and went back to their room to collect their belongings. At this time, the two front desk attendants of the morning shift had arrived, as well as our bellboy, plus, there was me and my colleague waiting to punch out and go. We had already started checking people out and this day was particularly busy, we had 3 or 4 people waiting to be checked out, and it doesn't help that we only have 3 computers for 4 people to work with, with another computer for us to check the cameras. When 07:20AM came up, my colleague quickly picked up his things and left and I took over his spot. At this time the first few people in the group started coming down and they already had to wait since we were all checking out other people. A few minutes later I got the first one but I told them I couldn't check them out since I don't speak spanish and asked them to wait for my colleagues to become available. In the end I ended up refusing service to 10 or so people, which started forming a line right in front of the front desk, which only grew since other guests assumed they were all in line to be checked out. My colleagues on the morning shift were not happy at all, the guests were less than satisfied, and when the first of our reservations people showed up at 8AM, I logged out, punched out and went home. By that time, there was a 20+ line of people waiting to be checked out by 2 overworked recepcionists, only one of which spoke spanish.\n\nIn the ensuing shitstorm that happened, the hotel's director arrived at 8:30AM in an attempt to minimize the anger of the human centipede who formed in the front desk, started chatted with the guests and otherwise trying to distract them so they would be less angry and avoid giving the hotel a poor review. I got a mild chewing out by my manager for \"poor work ethic\" instead of being written up. True to his word, he backed me up when the director called him and HR for a meeting regarding my actions (you can't demand someone speak a language that you know they don't right?). I still haven't got my bonus for speaking spanish, and I let my manager know that I will not be speaking any spanish while on the job until they give in and give me my hard earned bonus.\n\nUPDATE 2 - TL;DR: Management denies my bonus for speaking spanish, demands stay I late  to help check out spanish speaking guests. I agree, but refuse to speak  spanish since management themselves said I don't speak spanish so they  wouldn't have to pay me a bonus for speaking spanish. I refuse service to lots of guests, chaos ensues in  the front desk, I clock out before the hotel implodes.\n\nUPDATE 3 - So due to the number of comments asking about how the bonus works, I'll just post it here. It is a monthly bonus, and the way to hotel pays it out is by adding it into the base salary, instead of specifically outlining it on a separate item on our pay stub. This means that it is straight up a pay raise, and as such it interacts with other things that go into our paycheck that use our base salary to be calculated. This means that the $100 bonus easily snowballs into being $150 - $160 when you take into account the +20% we get paid for working nights, +10% for handling live money, + overtime, + paid time off, + vacations.",
        "permalink": "/r/MaliciousCompliance/comments/dmtvik/sorry_boss_i_dont_speak_spanish/",
        "comments": [
            "Why is it that we have to fight to get people who hire us understand that we can get them more money... You're bringing a skill to the table that they didn't even pay the training for, and they try to squeeze you instead of enjoying it... Sad sad story.",
            "I think r/TalesFromTheFrontDesk would enjoy this story aswell!",
            "Your boss is an arrogant dicksniffer.",
            "Would've been even better if you said \"no hablo espanol \" but you're right, you shouldn't work for free.",
            "I'm far from fluent, but I can explain **how the hotel works, direct guests to where they need to be and assist them with what they need, be it finding a pharmacy at 3am, getting a cab to go out and get drinks, or even hire an escort**\n\nsounds pretty damn fluent to me!",
            "shoulda said \"sorry, I don't get paid to speak spanish\" just in-case your boss is too thick (in the head) to know why you aren't being a team player and instead just thinks your just not one or mean in some way.",
            "> poor work ethic\n\n\"I was just matching the poor compensation ethic.\"",
            ">Not long after, Mr. Castillo got himself a job paying several times over what the hotel did and sadly, left me.\n\nHere's where their cheating you out of the $100 starts you on your path to getting a higher paying job.\n\nMeanwhile, they save $100 today and those inconvenienced guests (and their organization) never show up again.",
            "But what was the result after that?",
            "[deleted]",
            "I thought Spanish and Portuguese were similar. My dad can basically understand someone speaking Portuguese and vice versa.\n\nCongratulations on being multilingual! I am forever stuck trying to learn Spanish. My grandma is the only person in my family that I will attempt to speak it to.",
            "This is the best incident of malicious compliance I have seen yet. Most of them are basic and petty, but no. Not you. Long lead up, great ending, true justice served. I hope this didn't impact your job negatively, you have a need, like everyone to be recognized and compensated for your efforts.",
            "Be a team player and poor work ethic is always code for let me take advantage of you.",
            "Start looking for another employment opportunity. This will not be forgotten by management. I would interpret withholding the earned bonus that management is already looking for an employee who “better fits the role”. One thing this money grubbing dystopian society has taught me is to trust no one. Good luck OP.",
            "Among the more malicious compliances I've read.",
            "It seems that these days a lot of businesses worry too much about bottom line and forget that talented, loyal staff are one of their biggest assets",
            "Is your bonus a one shot or it's 100$ extra every month?",
            "....you are smart enough to earn us money but not smart enough to be paid.",
            "I had a similar job where you could earn extra money by speaking other languages. To qualify, you had to take a simple test, which most could pass if even halfway fluent. Until you passed the test you weren’t “approved” to be conversing with customers in another language. Generally the customer service reps would wait to see the bonus amount on their HR pay file before they would begin to use the language with customers.",
            "This story is perfect malicious compliance. God I want to be your friend. This was amazing. Keep doing you.",
            "So.... you gonna tell the rest of the story or nah?",
            "Well done on standing up for yourself and the right thing. The right thing is giving you what you were promised. They promise you something when you start then go back on their word",
            "You did the right thing, companies will also try to take advantage of you. Standing up for yourself is not \"poor work ethic\"",
            "Wow, for a second language, your English is extremely good! However, just trying to help out, I noticed just a couple typos. \"Satisfacted\" should be changed to \"satisfied,\" and \"chattered\" could be changed to \"chatted,\" however I am not so sure about that one. Otherwise, your English is superb!",
            "Is that a one time $100 bonus? That's honestly super cheap for another language. I agree, stick to your guns but make sure you keep practicing and hopefully get a better job elsewhere later",
            "Is it $100 a paycheck (weekly?) or a one time payment? That sounds very petty to not pay you.",
            "Wait. Portuguese people don’t understand Spanish? I thought since they’re pretty similar Portuguese speaking people could understand Spanish to an extent. Like English and Jamaican-Creole",
            "Great story and well-executed and quite malicious compliance.",
            "Good job setting boundaries and not giving into working without proper compensation!",
            "Stay strong OP. I admire your tenacity and strength in the face of blatant unfairness and injustice in your workplace. Get that mother fucking bonus.",
            "All that for a $100 bonus? This is what being cheap gets you. Good that your manager backed you, though. Seriously, they need to just pay you the dang money.",
            "If I were the director or manager I would have just handed you 100 dollars",
            "While I agree with you, I'd also be cautious moving forward if I *were* you.  Businesses and the people that work for them can be and are fickle, vindictive and psychotic.  Don't be surprised if they plot to fuck you over at any chance they get in the future.  It sounds like you have experience enough to get a better job elsewhere.  Maybe look around for something better, because then you'd be in a position to leave should they decide to make your work hellish.",
            "So for $100, they create mayhem, irritate and poorly serve scores of guests, and try to hold you responsible for the mess.\n\nWere I the manager, I would have paid you double that out of my pocket.  What does the hotel charge for a single guest per night, and how many guest-nights would they have to sell to make back the $200?\n\nOne, two, maybe?\n\nBut, no.  Flush the reputation of the hotel and he/she who managed it so poorly.",
            "$100 for learning an entire language is incredibly cheap and fuck the company you work for. You are going places OP, much higher than that shit hotel.",
            "What happened after? I HATE it when people leave stories unfinished. Couldn’t you wait a few days?",
            "[deleted]",
            "Rarely see someone get so completely rekt",
            "They did all this to avoid giving you 100$? What a bunch of morons",
            "Why in the hell does a one time $100 bonus need a director’s approval? That should be a line manager approval at highest.",
            "A good manager would've paid you out of pocket and waited on the reimbursement himself.",
            "this is a GREAT story. Thank you for sharing. I totally approve.",
            "I work in a restaurant and I do something similar. I live in a city with a high Spanish speaking population, and many of my coworkers are native Spanish speakers. I, on the other hand, speak Spanish at about a 3rd grade level. I understand better than I speak it, but I can generally get my point across. \n\nSo used to be when a guest asks if I speak spanish I replied \"Yes, but not very well.\" And the guest is generally willing to work with me. Flash forward a year or two. \n\nWe have a few refillable options, and many guests know this and take advantage by trying to share. We have policies against this, obviously. So I had a spanish speaking table and I was trying to explain in my fairly poor spanish about the fact that there is an extra fee for refills if you share.\n\nApparently the method I used to explain was offensive, (I said \"si mas de uno persona comen, usted tiene que pagar\".  Yeah yeah I'm a monster. Like I said, not a native speaker) and the mother complained that I was rude. I explained to my bosses what I had said, and WHY I had said it in that manner, but I was still given a write up. So now, whenever anyone asks I respond \"Sorry , I don't speak Spanish\"",
            "| Not long after, Mr. Castillo got himself a job paying several times over what the hotel did and sadly, left\n\n&#x200B;\n\nThis is what you should do!\n\nThanks for sharing :)",
            "Fucking hell, all over a 100 bucks.",
            "$100 once for speaking Spanish forever? And they couldn't even manage that? Wow, but not surprising",
            "You get my upvote once there is an update on the fallout.",
            "My parents who are from a Portuguese speaking country always say play stupid, be smart when it comes to people and it has saved me so many times from getting taken advantage of.",
            "Since you are outside the USA, are you getting $100 USD extra, or 100 pesos/real/bolivar?",
            "How much talking do you actually need to check someone out? As a guest i usually just drop off my keys get a receipt and leave. No words exchnged other than check out.",
            "My coworker from my last job had a similar experience when they worked at \\[National Technology Retailier\\]\n\nHe's a Mexican guy, but grew up in the US, so he's fluent in both English and Spanish. This obviously helped as there are a lot of Spanish speaking people around. I'm not sure if he was the only one who spoke Spanish, but he was important enough that they relied on him a lot. Since he's a smart guy, he knew his value was more than what he was being paid. So he talked to his boss about a raise. They pushed back a lot and so he basically said \"alright I don't speak Spanish anymore\".\n\nThey said something along the lines of \"you can't do that\" but he wasn't changing his work ethic or anything. He just decided to lose a skill they found valuable since they wouldn't pay him for it.\n\nShortly after he found an opening at my last job.",
            "Muy buena historia, amigo un consejo no desistas! Mereces cobrar por el servicio que brindas a los clientes y eso el encargado y HR tendrían que saberlo. Saludos de Argentina!",
            "I think I would have negotiated and said that I would do all these guys checking out if they gave me $200 instead off $100 and have it in writing.",
            "bien hecho",
            "My mind went to an unfortunate place when I got to \"human centipede\"",
            "Look for a new job friend, you are not getting that bonus and possibly looking at options to get rid of you.",
            "Fucking idiots",
            "Is the $100 a weekly bonus or a one time bonus?",
            "I barely understand my own language, English is a pain, and I often see those who have English as a second language surpassing the understanding of many of our rather under educated people here in the US. Learning a second or third language is a talent in and of itself and should always be respected as such. I hope that while you are holding out on speaking Spanish while at work that you are still taking the time to learn it on your own, I can see having the ability to be fluent in Spanish as well opening up much better job opportunities.",
            "Shame on corporations for trying to screw their workers out of fair pay!",
            "The really annoying part of this is that usually you make a continual bonus for speaking more than one language. Not just a one-time bonus. The hotel was getting off easy by paying a one-time hiring bonus of $100.",
            "That's fantastic, good for you.\n\nThis happened to me as well, i used to work for a large chinese airline in the united states. we constantly have chinese passengers coming in to check in for the flight. we were told that we'll get a $0.50 raise if we spoke chinese which totals to about $75 extra a month.\n\nafter a few months of me using chinese on the job and not getting my raise. i stopped using it, and only spoke english. eventually i got my damn 50 cents.",
            "If you have a box for comment cards, next time do your Spanish thing and ask them to leave comments, in Spanish, dropping your name as \"the wonderful Spanish speaking front desk worker\"?",
            "This is a great story, but I really hope you're going to find another job. These people are really going to hate you and they already didn't respect you.",
            "Damn, if only I can upvote this thrice..",
            "$100? All of this rigamarole over $100? That's pocket change to a business like this. Unreal.",
            "This is phenomenal. Good for you for refusing to be exploited.",
            "Tell them IN SPANISH you've been told by management you don't speak Spanish and aren't allowed to help....\n\nBonus points if you leave for a better job if your resignation letter is in fluent Spanish....",
            "I need to be updated on this!",
            "Title should be “Spanish motherfucker, do you speak it!”",
            "When you told your boss you don't speak Spanish you should have said it in Spanish.",
            "I love it.",
            "Me gusta esto",
            "How often is the bonus paid?  Once?  Monthly?  Once per check?\n\nIf it’s just once or once a month, $100 is too low of an amount for the hotel to be fighting you.  If you can do the job, they should pay the bonus it’s not going to break them.",
            "Sorry, it’ll cost a bit extra.",
            "Even though I’m sure HR would love that",
            "This is fucking amazing",
            "Nice",
            "What country is it that you can ask information about escorts in the front desk hahah",
            "[deleted]",
            "I love you internet stranger. Keep fighting the good fight.",
            "This made my morning. Thank you for sharing.",
            "Jesus.  All over $100?  Absolutely ludicrous.  I absolutely applaud you for standing up for yourself.  They were idiots to refuse you.",
            "Okay this makes me feel bad because when we travel abroad from the USA, we know 3 languages between us. If we're in a country where none of those 3 are the main language, we approach the desk or maitre d or etcetera and give that person a choice of the three languages we DO know. Almost 100% of the time that person knows one of those three.\n\nSo we would approach you or your buddy, because we don't know Portuguese, and offer in French English and Spanish do you speak any of these languages? \n\nSo I feel bad because I might be losing you money by giving your buddy the choice to choose HIS language instead of passing us off to YOURS lol.",
            "This was such a treat to read, love it!",
            "You're telling me that you speak Portuguese and the bellboy made no effort to even learn spanish? It's one of the easiest languages to learn when you already speak Portuguese.",
            "Thats real impressive human spirit man! you stick to whats right, well done man",
            "[deleted]",
            "que bueno, que se jodan esos pendejos lol",
            "Thank you for mentioning that he was true to his word",
            "^indubitably",
            "Wait you only worked 40 minutes?",
            "Idiots. All of them.",
            "i agree, poor work ethic",
            "Well done!\n\nI wish we had that bonus at the hotel I worked at. It's one of the big National Park ones, where a night is $500 before tax, and we got people from all over the world. But such extra skills were only taken for granted there.",
            "I must say, with you not being a native English speaker you wrote this wonderfully . Good job.",
            "I hope you eventually get the bonus and if you do you will let us know cause I am now invested in this",
            "Damn, you get a 200-350 bonus from knowing 3 languages (base language + English, and Spanish) If someone born essentially trilingual and learned a fourth or fifth language they would earn a lot of money",
            "I think I would have gone with \"HR says I don't speak Spanish.  I would not wish to take a chance that I said something wrong.\"",
            "While this is sweet revenge, I think you missed out on an opportunity to get that bonus.\n\nTell them that you will take care of the Spanish guests but in doing so they should acknowledge you speaking Spanish. If not, you might have to restrict yourself to Portuguese and English in the future...\n\nAbandoning them in a moment of need might not have given you the best foundation for future pay negotiations.",
            "I can only imagine the reactions of the guests to your \"Lo siento, no hablo espanol.\"",
            "Ever get that bonus in the end?",
            "Im excited for the update 😁",
            "Estamos todos na espera pela continuação da história, we are all waiting for the follow up, todos estamos esperando la continuación de la historia, stiamo tutti aspettando il finale della storia.",
            "I can’t believe they are this uptight about $100, it’s not like you’re getting a permanent raise.",
            "\"Lo siento, señor, pero no hablo español, ¡ni una palabra!\"",
            "Si puedes negociarle a alguien una puta en español, hablas español.",
            "is this 100$ per paycheck, or 100$ once?  Because if they are holding out on you 100$ once, they are being ridiculously stingy.",
            "Anyone got a tldr?",
            "You get $100 as a one time bonus?  Or every paycheck?",
            ">my main language is portuguese\n\nPortuga ou Brazuca?",
            "I feel there will be other updates, because a shitstorm like this does not just \"die\".\n\nOffer no quarter, give no mercy.\n\nIf they don't want to pay what they owe you(which I believe is illegal), then they have no power to force you to use a language they say you \"don't know\".",
            "Bá tchê, que história guri!",
            "The correct answer to the boss should have been \"lo siento, no habla Español.\"",
            "Sorry honey, you need to be highlighted.",
            "Sorry honey, you need to be highlighted.",
            "How is this post written in absolutely perfect English? I've taught ESL and there are almost no grammar or punctuation mistakes in this entire post.",
            "Sorry honey, you need to be highlighted.",
            "i can't wait to hear this  from my brother's room later at night in a monotone voice.",
            "Do you only get a one-time bonus of $100; or is it each paycheck?",
            "Seems like the hotel's company policy is actually that you get only one bonus for speaking a foreign language, no matter how many languages you speak.",
            "You are not withholding service or anything. You are avoiding a situation whereby you give the hotel a bad name. They want you to be better at Spanish before they pay. So you can't use it. They basically said that.",
            "I don't understand why people need to check out. You already paid for dates X through Y. Why wouldn't you just leave?",
            "You clearly deserved the English bonus; your writing is impeccable. I wouldn't have guessed it's a second language.",
            "TLDR?",
            "I would just like to clarify. you said company would pay a 100 bonus for every FOREIGN language. And then you said you were already receiving a 100 bonus, and that was  for english, but not for spanish. does it mean both english and spanish are your second (and third) languages?",
            "Who the hell \"checks out\" from a hotel? You just get your shit, close the door and leave..."
        ]
    },
    {
        "post_id": "g3ns1t",
        "author": "ack1308",
        "title": "You won't pay out my annual leave while I'm on vacation? I won't take vacations.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/g3ns1t/you_wont_pay_out_my_annual_leave_while_im_on/",
        "score": 16945,
        "num_comments": 489,
        "created_utc": 1587217714.0,
        "selftext": "I've been doing security for about sixteen years now, and about ten years ago I was doing on-again off-again shifts at a particular site (not relevant where). Anyway, I had a decent amount of annual leave hours under my belt, so I decided to take a vacation in a city down the coast, visiting a friend. The understanding was that while I was on vacation, my annual leave hours would pay out as if I were still working (but with 17% leave loading, woo).\n\nSo, about halfway through my vacation, the day after I'm due to get paid, I casually check my account, and the number is nowhere near what it should be. I go okay, maybe they're a day late.\n\nFour days later, after I get home, no improvement. So I ring up work and ask them what's the deal. \n\nWhat I get back is that when I'm on vacation, annual leave pays out on my regular roster hours. But I wasn't getting regular roster hours, so they were paying me for about one hour a day, instead of eight. I said, \"Uh, I went on vacation to use up annual leave.\"\n\nThey said, \"Well, that's what the rules are.\"\n\nSo I stopped taking vacations. My annual leave hours built up. And built up.\n\nThe company doesn't like anyone holding a huge number of annual leave hours, because if someone decided to quit out of the blue, the payout would be AMAZING. (Saw one guy do this; he had enough hours to take the *year* off. Then he retired).\n\nSo about six months later they came to me and said, \"Why aren't you taking vacations?\"\n\nI said, \"I can't afford to. You guys don't pay out my annual leave hours while I'm off.\"\n\nSilence on the other end. Then, \"We'll see about that.\"\n\nAll of a sudden, the policy changed. I took a nice long vacation.",
        "permalink": "/r/MaliciousCompliance/comments/g3ns1t/you_wont_pay_out_my_annual_leave_while_im_on/",
        "comments": [
            "We had a guy at my work who did this. He had over 700 hour of paid time off saved up. They told him he had to use it cause they were making a cap on hours so he asked how long her could take. They said a month then you ha e to come back or your job can be given away. \n\nHe took a month off, came back for one day, and took another month off",
            "That is the dumbest policy I've ever heard. Good for you!",
            "My company reorganized a few years ago. If any high ups wanted to leave, they would get a buy-out of their full salary for ten percent of their tenure. \n\nOne guy had started as a stock worker at 13 in his brother’s franchise and worked his way up. He had 51 years in. They paid his full salary for just over five years. His retirement got magically better overnight.",
            "Worked for the government.  Policy up to the 70s was that you can accumulate unlimited annual leave.  People were saving over a year's worth then either retiring with a huge paycheck or taking the last year off (this was before my time).  Anyway, they changed it to 30 days; anything over was lost the next year.  Which is why they have \"use or lose\" in December when people used up the excess leave.\n\nSick leave accumulation was unlimited.  When you retired, any unused sick leave as added to your years of service (in monthly amount) used to calculate your retirement benefits.  They changed the civil service program in '84 and eliminated adding it to years of service.  A decade or so later the government was wondering why people were using up their sick leave.  Turned out people didn't want to leave any on the table before they retired as they wouldn't get anything for it.  Sick pay was your current pay; the retirement calculation turned out to be around a quarter of this amount.  It thus cost the government more money for the change.  They changed it back.  So when I retired I had a year of sick leave which increased my service years by one year.",
            "[deleted]",
            "[deleted]",
            "Semi-related story.  I was assigned to a US base in South Korea in early 80's.  There had a fire which destroyed the base Command and Control Bunker and they were in the process of repairing/upgrading the facility.  We had a technician who excelled and had been performing the vast majority of critical installations/documentation of the new facility.  He came due for rotation back to the US when the command suddenly \"involuntarily\" extended him for his mission critical work.  The extension was for 90 days (the maximum the local command could extend personnel for \"mission essential\" duties). To say he was unhappy was an understatement.\n\nAdded into his extension was the fact the command did the extension two or three days prior to his departure.  He did not develop a \"short-timer's attitude\" and was planning to work up to the day he was flying out.  He out-processed during the day, then work in the bunker after hours.  Essentially pulling double shifts for 30 days prior to his original departure date.  He emphatically insisted that he could not be extended and should be allowed to depart.  The command was unmoved.  Bam! 90 days.\n\nQueue Malicious Compliance:  He did nothing, but work on the bunker.  He had turned in his TA-50 field gear and refused to get it reissued.  Morning formation? Nope, he needed to go to work.  Physical Training?  Nope.  Range Qualification, PT test, odd ball house mouse training and briefings?  Nope, they need him to work in the bunker and that was all he was going to do.  He worked eight hours and that was it.  At the end of 90 days, they ~~screwed!~ extended him for a second 90 day period.\n\n\"But Farstone, where is the Malicious Compliance?\", you ask.\n\nTwo days into his second extension, he disappeared.  Gone from the Unit; gone from the base; gone back to the Great USA.  The command failed to understand the Service Member's Situation.  He had been the Winner of the Pentagon Dirty Tricks Assignment Branch.  He was assigned to Korea, just prior to his retirement.  In fact, he had to extend in the Army to complete the assignement or else he would have been discharged 60 days short of his retirement.  His original plan was to complete the assignment and then transition out of the Army, directly into retirement (he got retirement orders as part of his original out-processing).  Turns out you can extend a Service Member's Overseas assignment for \"Mission Essential/Critical\" reason.  You can, almost, extend a Service Member's contract to keep him in the service past the end of the contract for, you guessed, \"Mission Essential/Critical\" reasons.  However, you cannot extend a Service Member's service period once they have their retirement orders.  Mission Essential/Critial not withstanding, it took an Act of Congress or Declaration of War to stop his retirement.  On the effective date of his retirement, he went from Active Duty to Retired.  His 90 day extension?  He was declared a \"contractor\" for payment purposes.  He was awarded his full pay, Overseas Service Pay, and a daily rate as a special \"contractor\".  The Bureaucracy \"discovered\" something was wrong when he didn't arrive at his transition point.  The Bureaucracy automatically assigned him the \"contractor\" status, while they attempted to \"find\" him.  Finance changed his pay-status and it was automatically approved.  On day 91, The Bureaucracy \"found\" him, working at his \"Mission Essential/Critical\" job.  Day 92, he was flown out of country and into retirement.  During his 91 day period as a special contractor, he earn the equivalent of two years pay.  Special Contractor + Overseas Service Pay + Contract Extension Penalty.",
            "I guy I work with has been pooling his time since he started on the job 32 years ago.  Vacation time and personal time carry over is capped at the beginning of each fiscal year, but his sick time, earned leave, differed OT>PTO is all unlimited.  They refuse to change it because they can’t afford to cash people out if they put a cap, so instead he’ll get about 3 & 1/2 years of paid time off before he retires.",
            "[deleted]",
            "I had a situation where I wanted to change locations and the boss wouldn't let me because we didn't have enough staff. I'd been there for years before he came on and flat-out told him we'd never had that many.\n\nHe refused to budge so I quit, got paid out 100+ hours of leave and got rehired at the other place the next day because it was one of the bosses I'd worked with before.\n\nThe best part was because I'd quit and been rehired so fast my pay still said I had all that leave owing. I left it and didn't say anything, figuring they'd catch it at tax time, but they didn't. And when I left 2 years later I got paid out again.",
            "Left one job at a uni to go to school full-time, I had been using my vacation time for things like studying for and taking midterm exams. The hours piled up and I got a payout for them close to $1K US. That helped pay the bills while living on student loans. \n\nNext outfit I worked for capped the number of vacation hours they would pay out. I started using mine when getting close to retirement and got just below the cap. It was still over $1K. Nice chunk of extra change. \n\nOddly, the sick time they wouldn't acknowledge still figured into my state pension, adding a number of months of time on the job, and boosting their health insurance to 75% coverage of the cost.",
            "I'm currently on 9 weeks of leave for this exact reason. Still got 6 in the bank, and long service entitlements.\nIt wasn't that they didn't pay leave properly, they never approved any applications. Then had the audacity to complain I had too much...",
            "[deleted]",
            "Usually when someone says \"We'll see about that\" they want to fight you in that situation. Turned into a positive in your case.",
            "This is the dumbest thing I’ve ever heard. Annual leave pay is a liability for the company. To let you accrue it then never let you use it... stupid!",
            "Did they debit you the number of hours of annual leave that they paid you for?",
            "You’ve completed your trial version of America.",
            "That's how my husband quit his job. He accrued 2 months of vacation time and just never went back.",
            "My dad saved up over a decade of leave and had a nice long vacation while waiting on retirement. He was done with their bullshit and he got full pay until then.",
            "In  Australia, this is not a good idea.\n\nAnnual leave is earned as a proportion of hours worked. We get 4 weeks leave a year; for every day/hour worked you earn 1/12 of that as annual leave.\n\nSo what about holidays? If you worked 11 months and took a 4 week holiday, would you not accrue your full leave that yer?\n\nNo. Because you still accrue annual leave WHILE ON ANNUAL LEAVE.\n\nSo a guy who saves up 12 months of leave and then takes it all at once....cheats himself out of 1 month of annual leave.\n\nThere's another problem. The tax office does not \"care\" what year the annual leave is from.\n\nSo if at some stage you take a year of annual leave as a cash payout...your tax will be high. Because to them, you got paid for 52 weeks + 52 weeks of annual leave...yet for the rest of the year you were only taxed as if you were earning 52 weeks of pay. So your tax was too low for 52 weeks...and they make up for it by taking it out of your leave cash payment.\n\nThe fact that the leave is from previous years ..even from yen years ago..is irrelevant to them.\n\nDisclaimer: I used to work in payroll, but it was 20 years ago now. I think this is still correct though.",
            "A full year at my work is 2080 hours. How do you build that up? It would take two years of 12 hour days.",
            "That reminded me of a hydro station I did security for, I worked there in 2019, but they had their own guards who were hired before 2003ish, so they were all over 45 and got paid each more than 100k a year (meanwhile all the guards from my company were lucky to make more than 35k most making minimum wage).\n\nBut before a certain year (dont know exactly) they allowed for paid vacation days to be saved over the following year, so most of the original guards (there was maybe 6 of them) had each between 100-200 days saved each, and one of them even had over a year of vacation days, so she just said the year before she retires she is going to go travel while getting paid over 100 grand not to work.",
            "Man America is so backwards.",
            "Nothing malicious here.  They tried to screw you, and after you gamed the system they treated you reasonably. You shouldn't have to fight for every scrap of common decency.\n\nIt's important to keep track of how far the goalposts have been moved.",
            "What does it mean, \"pay out my annual leave hours\"? I don't understand...",
            "Wait, is this the Worm famous u/ack1308?",
            "Yeah, most companies I’ve worked at actually have paid time off as hours to prevent stuff like this.",
            "LOL imagine being at a place where not taking a vacation for 6 months is unusual. lmao",
            "8 hour shifts on security? I always worked 12 hour shifts. 0700-1900 days or 1900-0700 nights, in blocks of 84 hours.\n\nWeek 1\n\nDay, Day, Day, Day, Night, Night, Night.\n\nWeek 2\n\nOff, Off, Off, Off, Day, Day, Day.\n\nWeek 3\n\nNight, Night, Night, Night, Off, Off, Off.\n\nI could take two weeks off by booking one weeks holiday, booking Week 2 Days and Week 3 nights as holiday.",
            "This is obviously America. This would be illegal in a civilised society",
            "Surely there's a better way to solve this than working without any leave?",
            "Someone didn't think that policy through!",
            "I try so hard to understand these policies. I've never had  more than 1 weeks vacation for the whole year. It blows my little American mind that your company would ask you to take a vacation and that it could be a long one.",
            "My grandad did this when he worked on the docks, he worked every bank holiday and extra shift available and accrued months worth of leave. When my grandma got sick he just cashed it all in and spent her final few months together.",
            "I know, right? The whole point of going away is to RELAX! He's getting a little more assertive about taking actual vacation time instead of a day or two here and there, which is wonderful. He's had coworkers and family members get sick and die without ever being able to enjoy time off or retirement, so he's pushing back on their need for constant access.",
            "As a German all of those comments are unbelievable. You are telling me you have to save hours to take on sick days?",
            "Sounds like you’re in Oz mate, what they did I’m pretty sure is illegal, talk to your union - if you’re not a member join up, the fees are fully tax deductible. Plus they have access to damn good lawyers to help with this sort of stuff.\n\nConsidering the amount of hours that you’ve built up, take some random days here and there, see if they’ve actually changed.",
            "Accountants and managers not understanding human nature... yup.\n\nWhich is why when I hear of a policy being proposed I ask... how will people game this to their benefit ?\n\nAnd if the answer is “They won’t “ then I ask ... “so you say you deliberately hire incredibly stupid people ? That’s not what your advertising says...”",
            "I used to get leave loading but now I don't.\n\nEnjoy it while it lasts.",
            "i don't get it.  you brought an issue to their attention, they changed the policy..",
            "'don't pay out my annual leave hours while I'm off.'\n\nwhat does this even mean",
            "The next year your company is going to go to the system Smithfield has, 1 week of vacation time a year, only available as an entire week off, scheduled at the start of the year and only one person off in a department at a time. Use it or lose it.",
            "r/TalesFromSecurity would probably enjoy this and any other stories you have from the job- encounters and management/coworker idiocy/incompetence",
            "My old job had a very generous PTO policy. Every 9.3 shifts I would get a full day of PTO, which came out to just about 5.5 weeks a year. It didn’t cap and thy paid out 100% upon quitting or firing. I wrote my own schedule so I would work Sun, M, Tu, W, Th, F, M, Tu, W, Th one week, then take F, Sa, Su, M off for regular four day weekends where I would take little vacations. Other than one two week vacation that I took, I never actually used PTO in the thirteen years I worked there. I used to joke that it was my built in severance package and they’d never fire me because they’d have to pay out. When I quit after that thirteen years I had about 1.25 years of PTO accrued and took the longest vacation of my life. They changed their policy shortly after.",
            "At an old job when I left I had over 500 hours of PTO they had to pay out.  Management was NOT happy...one that I was leaving and two that they had to cut me that check.  Same thing happened 3 years ago when I got laid off...had over 400 hours saved up.  The taxes were brutal (40%) but I got most of that back later.",
            "\" What I get back is that when I'm on vacation, annual leave pays out on my regular roster hours.\"\n\nWhat does this mean?",
            "[deleted]",
            "\"What I get back is that when I'm on vacation, annual leave pays out on my regular roster hours. But I wasn't getting regular roster hours, so they were paying me for about one hour a day, instead of eight. I said, \"Uh, I went on vacation to use up annual leave.\"\" \n\nI don't understand what this means. Could someone who does understand explain it, please?",
            "Holy crap that’s even illegal in the US.",
            "Um, so they were just being jerks for no reason, and faced no punishment?",
            "What is a roster hour",
            "My first proper job, started in a restaurant when I was 16. I left when I was 19, not realising the whole time I was there that I was accruing annual leave at a pretty outstanding rate.\n\nI only worked two shifts a week during school term time, but usually six days a week in the holidays (restaurant was in a tourist hotspot) a lot of them doubles, so averaged over the year it was nearly a full-time gig.\n\nWhen I left to work overseas for a year before Uni, the payroll lady phoned me up and asked me what I wanted to do with the leave I'd accrued. I could take a lump sum (and be taxed on it heavily) or take it at right below the tax bracket. So every month for the next year, I was paid enough to live on, hilariously.",
            "This is why I wish I was in a union",
            "[deleted]",
            "You could have just gone to fair work. What they did is illegal.",
            "Sorry, but your story makes zero sense to me.  \n\nWhat is annual leave?  How is it different than vacation?  What are roster hours?  Are you saying you would only get paid leave on hours worked or something?  A lot of people seem to understand the story, but I don't follow you at all...",
            "That is confusing. What is the point of \"annual leave hours\" other then for vacation/time off? So what did they think those hours would be used for?",
            "I work for a city and all of our sick time carries over, vacation doesn’t. I’m on the fire/EMS department. None of us use sick time unless we have to. When we quit/retire/get fired or whatever, we get paid out at our per hour when we leave. I’ll have 25 years of sick time built up by time I retire. So I’m getting sick days at current pay, but get paid at my rate when I leave. I’ll get close to a $100,000 check when I’m 55. \n\nThe rest of the city employees use their sick days all the time. Seems like throwing away money to me.",
            "The 17 percent thing gives this an Australian feel.  And that shit is straight up illegal.  You should report them.",
            "Labour laws in the US are insane. It's so pro business, it seems like employees bent over a barrel at ever turn.",
            "I can't follow this. You had a bunch of paid time but when you were off they didn't pay you? Or they paid you an hour a day? Which means that you would have used up basically none of your paid time. So whether you took vacation or not they were gonna have a problem with your time building up, right? Or were you supposed to take six months off while three weeks paid leave is doled out out one-eighth the rate?\n\nCan anyone explain what I'm missing here?",
            "I dont understand how they call it annual leave but don't allow you to use it. How are you supposed to be using it if you are not allowed to be paid for days you take off?",
            "Prime example of form over function.\n\nYou get vacation pay!\nExcept you can't use it.\nBut you also can.",
            "I just cash all of mine out. I have canceled three vacations because something came up at work. I am done with it. Give me my money and I will just keep working.",
            "My brother had worked for a large instance company for over a decade. Last year he told me about a woman who has worked for the company for 39 years. One day, she packed up her desk and he figured she was retiring. He says good luck and best wishes to which she replied, \"I don't retire until next year. But I'll see you before then.\" She recently came back, worked one final day, and retired. The branch had a huge party for her.",
            "So wait, they made your PTO basically not PTO?",
            "In America some people don't get any vacation; paid or otherwise.  Think of the service industry for instance.  Paid Vacations injure company profits and since Wall Street rules the American government, there will NEVER been any laws mandating paid vacation.  \n\nBut even if you do have paid vacation; it is understood that you must work through it.  When I'm on Vacation I have to log in every morning to do some work; otherwise don't bother coming back.  The complaint department is down at the unemployment office.",
            "It is a bit double sided when they put a cap on. E.g. they put that you can transfer only 5 workdays to next year. Question is what to do if you want to take vacation longer than 5 days at the beginning of the year:/ they could put a cap on 1.5 year expiration, but no, exactly at new year.",
            "I worked at a company that had no cap on accumulated sick leave. When my daughter was born I took 6 weeks off and used it all up.  A month later, the company was bought by a larger company and they changed the policy: if you're sick, stay home.  there is no accumulated sick time, just stay home if you're sick.  OK except for two other guys whose wives were expecting and had a bunch of sick time banked to do what I did and now they couldn't.",
            "I'm not sure I understand the policy. What is annual leave for if you can't use it to take a day off?",
            "Did they repay the money you loose on that vacation ?",
            "Be careful, federal law generally doesn’t mandate the payout of paid time off except for given rent contracts, and not a lot of states do. This could result in not getting any of it.",
            "This doesn't seem like something to be proud of. You should be ashamed that its so hard to take a holiday in your country. Your life is more important.",
            "M"
        ]
    },
    {
        "post_id": "wmduij",
        "author": "PsychoMouse",
        "title": "I didn’t take the Lords name in vain.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/wmduij/i_didnt_take_the_lords_name_in_vain/",
        "score": 16933,
        "num_comments": 529,
        "created_utc": 1660284975.0,
        "selftext": "So, I just had an old Facebook memory pop up and it made me remember a hilarious story, at least to my wife and I anyways. \n\nWe were dating at the time and decided to go watch a baseball game as a nice date. Well, this happened to be a special baseball game. \n\nBy around the end of the 4th inning, I’d say there were a good 8 or so foul balls that went into the crowd and audience. After like, Ball 9 I loudly exclaimed \n\n“JESUS CHRIST!” cause of the amount of pop flys was insane. \n\nThis lady, who is one row in front of us turns around and says \n“DO NOT take the lord’s name in vain. Say anything else but that” in a very upset tone of voice. \n\nSo, not 5 minutes later, there’s another fly ball. I shout, like loudly shout,\n\n“FUCK MY CUNT SIDEWAYS, ANOTHER ONE!”\n\nShe just turned around to face me, gave me a look of pure anger and disgust. \nShe ended up never saying another word to me, she just took off after the game. \n\nNot as epic as some people’s stories on this sub but it’s a story my wife and I still talk and laugh about to this day, ten years later.",
        "permalink": "/r/MaliciousCompliance/comments/wmduij/i_didnt_take_the_lords_name_in_vain/",
        "comments": [
            "I was fortunate enough to attend a George Carlin performance before he passed away. It was about two hours long and he made us laugh the whole time. After a standing ovation, he did an encore routine where he discussed his famous “7 Dirty Words” you can’t say on TV, how he came up with it and how it was now famous. He then explained how the list was much much longer now, and he proceeded to recite *every* dirty word in existence in alphabetical order. It took about 10 minutes to recite. We all roared. \n\nA couple sitting in front of us, however, took offense. They huffed, exclaimed their outrage, and left almost immediately.",
            "Funfact:  Using the lord's name as an exclamation or invective is not what the bible meant by \"using it vain.\"  What the bible means by using the lord's name in vain is claiming to know the will of god or claiming things like \"God wants me to be wealthy.\" or \"God has blessed us\". \n\nPeople like Joel Osteen and Creflo Dollar are the people who take his name in vain.",
            "\"Please be more accomadating to other religions ma-am, I am a satanist and you dont see me forcing my rules on you\"",
            "Also not what taking the Lord’s name in vain means. It doesn’t mean don’t swear. It means don’t do evil in the name of God. She couldn’t even get the sin right smh.",
            "Thanks for the laugh",
            "Maybe not epic but pretty damn malicious. Nice one!",
            "Wow, you know how to strike a nerve.",
            "It's nuts that people want you to limit your words because of their superstition.",
            "HAHA! That's great",
            "Unexpected Australian",
            "This unlocked a memory for me. \n\nA few years back I worked as a substitute cook for a local school district. I was working an extended stay at one of my favorite kitchens except for this one employee we will call Brenda. Now most days Brenda and I got along just fine  besides when she would get on her religious high horse. (She is a staunch Mormon and I am EX Mormon) \n\nOn this particular day we had a rough go of things and to put a cherry on top I knocked a stack 100-150 plastic cups on the floor. (For reference our local health code requires them to be thrown out or washed before use after touching the ground) upon doing this I exclaimed “oh my lord!” Out loud. Brenda instantly snapped at me with “don’t take the lords name in vein!” I will admit I can be caddy at times and said back to her that Lord is his title and God his his name, so therefore I wasn’t taking his name in vein. This of course offended her even more so she ran to our manager. Our manager is cool as hell but she pulled me aside and explained that Brenda is super sensitive about religion and asked if I could find an alternative to oh my lord to avoid the ensuing drama that Brenda would to cause if I continued using the phrase. \n\nNow I am first to admit I’m a petty person and I wasn’t about to let Brenda fully get her way with this. I decided to further drive the point that lord is a title. So from that day forward every time a situation called for an oh my lord I would say  “oh lord Voldemort” or whatever lord I could think of that day. I eventually got the rest of the employees saying the same thing. Brenda could never claim we were taking her lords name in vein because now we were specifying what lord we were talking about. She wasn’t happy but never complained again.\n\nEdit: missing word",
            "I love these \"Lord's name in vain!\" things. :D\n\nFirst: YOU are the christian, YOU do not take the \"Lord's name in vain\"\n\nSecond: The \"Lord\"'s name is not \"god\" it's Jahve, or Jehovah. (Originally it was written only as JHVH.) Edit: for english native speakers it is more like YHVH, because of the consonant's pronounciation. In my language J is pronounced as Y in the name of the town York.\n\nThird: It doesn't mean you can't say it, it means you can't take any evil act in his name.\n\nSooo... christian fundamentalists... so much better than islamic fundamentalists, lol. :D",
            "Saying \"Jesus Christ\" or \"Oh (my) God.\" are not \"taking the Lord's name in vain.\"\nThey are simply exclamations to show that something is piquing a strong emotion response.\n\nKenneth Copeland, Joel Osteen, Creflo Dollar, Jerry Falwell, etc. using religion and the Bible to make themselves obscenely wealthy and to push a political narrative are using the Lord's name in vain. Politicians citing scripture or \"God's word\" or \"biblical law\" to pass legislation that strips rights from their constituants are using the Lord's name in vain. \n\nBasically, anyone using God, Jesus, and religion to enrich themselves financially or to gain control over others is using the Lord's name in vain.",
            "I know this wasn't likely to be in Australia, but as an Australian, I read this in an Australian accent for extra laughs.",
            "Oh dear.  Another Christian wannabe who doesn't understand what taking that lord's name in vain actually means.  It's nothing at all to do with using it as an expletive.",
            "Oh my goodness, this actually make me belly laugh.",
            "\"I have not yet begun to offend!\"",
            "\"Sorry ma'am,  it's a goddamn free country.\"",
            "Story time.\n\nWhen I was dating my now wife, in the middle '80's, George Carlin had a special on HBO.  Her parents had HBO, so after dinner on night, we all gathered around the TV to watch - me, the girlfriend, her Dad (career Navy, worked his way up, ultra conservative), her Mom (SAHM, also really conservative), and her 8-year-old brother.  We sit down, the HBO logo comes on, George walks out on stage to an extended ovation, it slowly dies down, and he delivers his first line.\n\n'Did you ever notice that women who are against abortion are women you wouldn't want to fuck anyway?'\n\nThere was a half second of time where both parents had a seizure trying to get to the remote to turn it off.  It was like they were being electrocuted and the remote was the off switch.\n\nGood times.",
            "Thanks for the good laugh xD",
            "I love your substitute exclamation. Just that alone, without the lady, without the game, is more than enough",
            "Well done. We approve.",
            "Not really the same situation but kind of in the same vein. Last night as I was laying in bed with my wife and 2 dogs. I reached down and moved one of my dogs up to be away from my legs. I had said \"come here you butt fucker\" to my dog as I was grabbing her. My wife immediately says \"dont call her that! Be nice to her!\" So I said \"I am being nice! Its a term of endearment!\" She says \"i dont like that word, call her something else!\" So i call my dog \"butt intercourser\" now lmao\n\nEdit: spelling.",
            "Typical religious idiot does even know what the Bible means.\n\nTaking the Lord's name in vain actually means use his name for selfish purposes, you know like all those evangelical preachers with private jets.\n\nIf you want to know the truth about the religion then ask an Atheist.",
            "Goddamn that was funny.",
            "Taking \"the lord's name in vain\" actually refers to people abusing that name to push their ideas and agendas that have nothing to do with the teaching of Jesus... Basically all pro-life movement for example is taking the lord's name in vain",
            "taking the lords name in vain isnt so much shouting “jesus Christ!” as it is saying “jesus christ says to hate gay people” (or whatever bigotry)",
            "Oh man, that's a keeper",
            "Well played! Pure genius.",
            "This gave me the giggles",
            "For all she knew, you might have actually been praying.\n\nYou responded the right way, anyway.",
            "If you weren't Australian already, you are now.",
            "People are so self absorbed. Does she think people don't curse when she's not around? Why she feel like she needs to control what other people say when she is?",
            "Nah, you didn't. SHE takes the lord's name in vain anytime she practices modern Christianity.",
            "\"Ma'am I don't have to live by your religious beliefs.\"",
            "I’ve never understood why it’s in vain. It’s a prayer.",
            "Gotta love when religious nut jobs try to make you follow their incredibly stupid rules lol",
            "I love this so much. Wish I’d been there - I’d of bought you a beer!",
            "Their god is named after a useful light cuss phrase.  Too bad.",
            "WELL PISS IN MY EAR AND CALL IT A HANDSHAKE what a funny story",
            "Did you know there are jails in stadiums? My pal found out the hard way when he went to a Cardinals game. He was there on a bus trip sponsored by his office. He was using some salty language, dropping f bombs, the group in front of him asked him to stop because they had kids. My buddy apologized and thought that was the end of it. Apparently the people had complained to the staff earlier and he was approached by some authorities who didn't know about de-escalation. Right away they started threatening him and he drunkenly asked, \"For saying 'FUCK' at a ball game?\" \"Alright buddy you're coming with us!\" Right in the slammer in the bowels of old Busch Stadium, he had to run to catch the bus with no shoelaces. To add to the embarrassment he was management.",
            "OMG!  That's HILARIOUS",
            "👏👏👏👏",
            "I honestly thought the phrase \"don't take/use the lords name in vain\" a myth like something you hear on TV only until I moved to the south and said \"God damn\" and one of my coworkers said \"please don't do that\" I was confused and said \"do what?\" \"Please don't use the lords name in vain\", I stared blankly for 5 seconds then I apologized and assured him it will not happen again.",
            "This reads like a made up shower scenario.",
            "Well, blasphemy IS a victimless crime, after all.",
            "Saying \"Jesus Christ\" isn't taking the lord's name in vain. Most \"Christians\" don't understand this.\n\nSaying \"Jesus Christ commands you to intentionally walk the next batter\" is taking the lord's name in vain.",
            "A favorite line from Heinlein's **Stranger in a Strange Land** was when the angry crowd was rising up against Michael, led by a man who yelled, \"G0d d@mn it - let's STOP this taking of the Lord's name in vain!\"",
            "If you don’t wanna hear “strong language” I don’t know if the sports crowd is for you. 😂\n\nPlus once you leave your house any expectation of the rest of the world adhering to your beliefs should go out the window",
            "Would've told her the definition of \"taking the Lord's name in vain\" and then would've told her to stick it up her bum.",
            "When I moved to a new town at the age of nine, I said, \"Oh my god!\" in surprise. I grew up in a non-religious household. My teacher then penalized me for taking the Lord's name in vain -- in a public school.\n\nMy family is pretty atheistic. I didn't get why I got in trouble.",
            "I can hear my mothers voice; NOT JESUS DAVID!!😂😂",
            "Flies is the plural of Fly.",
            "The idea of \"taking the Lord's name in vain\" is outrageous. The situations in which someone says \"Jesus Christ\" or \"God Dammit\" are when you're shocked or angry at something, thus asking for Jesus's help or god to damn the situation. Plus getting mad at people for talking about your imaginary friend is kinda cringe.",
            "I wish Christians would realize that saying “Jesus Christ” when angry isn’t taking the Lord’s name in vain. What is though is hurting people in the name of their god.",
            "Reminds me of that one line from “Girlboss” (the Netflix show):\n\n“Fuckk me in the dick!”.  - “Young ladies should t take like that!”.\n\n“Oh really, what age would it be appropriate for me to say ‘Fuck me in the dick’?”",
            "Awesome story, and if it helps, that’s not taking the lords name in vain. \n\nTaking the lords name in vain is using his name to sell tshirts and stuff. You know, stuff a lot of churches do all the time",
            "Shouldn't this be in #trashy?",
            "Hilarious and also good advice.  Sideways is always a hit.",
            "lmao",
            "That sounds like a pretty normal amount of foul balls in the stands at a professional baseball game. Fine nonetheless!",
            "LOL, but you did what she requested!",
            "I remember in sixth grade hitting my foot on something and saying, \"Ow, my heel!\"  \nOne of my female classmates looked at me with wide eyes and said, \"What did you just say?\"\n\nShe thought I said, \"Oh, my hell!\"",
            "Side note, \"Goddamn it\", isn't taking the lord's name in vain, it's a prayer.",
            "I squealed out loud in delight!",
            "🤣🤣🤣brilliant 🤣🤣🤣",
            "Fuck that reminds me of when I was serving in this elementary school for AmeriCorps. This substitute for my class heard a kid say “jesus” and went on a long loud tirade against the class about “using the lords name in vain” \n\nThis is a public school in Seattle. Im like bitch you are absolutely not allowed to be doing this lmao",
            "On the flip side, I remember Penn Jillette (of Penn & Teller fame) once saying during one of their shows (and I'm paraphrasing), \"We don't use any vulgarity in our show; we use a lot of blasphemy though.\"",
            "\"I didn't take the Lord's name in vain, it was very useful to me.\" -The Nice Guys",
            "I am sorry about that.  We try to keep my mom at home away from the public but occasionally she sneaks out...",
            "Reminds me of that time when I felt an insect crawl on my back. I shouted goddammit as I try to stand-up to remove it. An old man in front of me told me much the same as you. I was still trying to make sure the insect waz off my back and I am feeling some phantom itch and he kept on nagging how non-religious or has no knowledge about the bible are the younger generation. In my frustration, I just mentioned “gramps, yahweh is the name of your god not “god”",
            "Bible thumpers smh",
            ">  “DO NOT take the lord’s name in vain\"\n\nI don't understand why anyone would be offended by this. What, do these people think it's going to *hurt* him?",
            "It’s not using the lords name in vain if he isn’t lord, which he isn’t",
            "Jesus Christ, that’s *fucking* awesome",
            "She didn't even know what taking the lord's name in vain means",
            "Naa, I'd give a sermon. \"Ma'am, in the name of God the Christian church has killed how many people? THAT is taking the lord's name in vain. Sit the fuck down, God dammit.\"",
            "When someone does that to me, I just ask them why they think I'm taking the lord's name in vain. You're just asking him in all sincerity to intervene and fix the foul ball problem. I mean right?",
            "🤣🤣 Reminded me of this\n\nhttps://youtu.be/XLTnacYvvg4",
            "Top-notch swearing *and* causing vexation to a leaky God-botherer!  This post has everything I need from life. :D",
            "\"Don't take the Lord's name in vain\" in _her_ rule, not yours.\n\nBut then again she _is_ a Christian.",
            "This post was an extra base hit.",
            "a vivid and colored idiomatic expression. i am not native, but I suspect it is an aggravated profanacy.",
            "I hate when people use that phrase,  because it absolutely does not mean what they think it means",
            "“You just took the lord’s name in vain”\n\n“No I didn’t, Janice. I found it very useful actually”",
            "That reminds me of a story my brother told me. I don't remember what it was, but he got surprised by something and yelled out JESUS CHRIST right as his ultra religious friend happened to be walking near him, and as soon as he realized his friend was within earshot, he looked at him and went \"...my lord and savior.\" I think his friend just kinda half glared at him, half shook his head in exasperation.",
            "I like this one because it’s short and neat, not four pages long.",
            "I have learned that religious people don’t especially like it when you confuse Groundhog Day with the time Jesus came out from behind a rock to check for his shadow so we’d know if winter was over.",
            "I yelled Jesus Christ at work with a Pentecostal coworker once and she scolded me so I told her I was praying for my sanity.",
            "*unzips*",
            "Just got me thinking.... What would qualify as \"in vain\" anyway? Even a superfluous purpose as \"i wanted to express my surprise\" is a purpose nonetheless...",
            "No, no that was fantastic. I'll think happy thoughts all day remembering this story.",
            "Most swears are references to the human body and to deity.  Do with that what you will.",
            "Should have just repeated yourself.  I'm done pretending to respect their cult.",
            "who cares",
            "difficunt to do, if you're a man.",
            "Title is a lie",
            "This belongs on r/AmITheAsshole where the answer is yes.",
            "Are you older than 14? I hope not!",
            "[you took the lord's name in vain...](https://clip.cafe/the-nice-guys-2016/jesus-christ-s6/)\n\n\nApologies for whatever site that is, only clip I could find",
            "I had an idea where the language might be heading, but I was really hoping it was your date that did it :)",
            "Brilliant",
            "Made me laugh out loud. Thank you!",
            "Thanks for making my morning!",
            "One of my favorite song lyrics: I dont take the lord's name in vein a lot, but when I do it's the only goddamn thing that hes good for\n\nClever.",
            "Amazing!  I love how that shut her up",
            "> JESUS CHRIST!\n\nThat's not his name anyway. It was *Yeshua*, or more commonly known as *Joshua*.\n\nIf you're gonna be a judgemental prick to others, at least be an *accurate* judgemental prick.",
            "I would have said \"Satan!\" the second time.",
            "nah I;'d say this is a different take of the sub's content. usual malicious compliance here are work related, kinda stale to read at when it's too frequent.",
            "Yeah this isn't a completely made up story from the depths of ratheism to get clicks.",
            "You’re clearly not remorseful for your offenses against God and your neighbor. I’m glad I’m not there to hear it.",
            "I like the cut of your jib!",
            "9 foul balls through 4 innings isn't even a lot",
            "Thank you for showing respect to the Lord and this lady.",
            "you an aussie? sounds like one lmao. reminds me of butcher from the boys",
            "That is fuckin' great!!",
            "Hahaha!  Priceless!",
            "Nice!",
            "I think it's like a real life comedy template when someone gets offended and you weren'teven trying to push buttons. It's like a Bill Burr invitation to **innocently** figure out what else offends them.",
            "I would have said \"Satan fucking christ, NOT again!!!\"",
            "I would have just looked at her and said, “what? He’s not my lord.” 🤷‍♀️ lol",
            "I mean I’d marry you after that, too.",
            "This reminds me of the time many years ago as a teenager when I was browsing in a Walmart with a friend, looking at cds. I sneezed and said \"bless me\" jocularly because I knew it'd make my friend laugh. And this random woman nearby just gave me the absolute UGLIEST look of deepest disgust when I said that. Like blessing myself was horrifyingly offensive. I've never stopped laffing about it. My bad!!! I'll wait for somebody else to bless me next time! [I won't actually I've blessed myself ever since because of this experience]",
            "Hahaha!",
            "That literally made me laugh out loud. Thank you for that!",
            "But if I did, really, what’s it to ya?",
            "Glorious!",
            "I say ...HOLY MARY MOTHER OF CHRIST AND  A SIDE OF PICKLES!",
            "I didn’t take the lords name in vain, Janet. I found it very useful, Janet.",
            "\"It's not in vain, I'm praying for him to save me from the foul balls!\"",
            "I'm taking this for future use, it shall serve me well.",
            "Even if fiction this is pure gold.",
            "Jesum Crow!",
            "With the title capitalisation I thought you were desecrating [the cricket ground](https://en.wikipedia.org/wiki/Lord%27s) or something!",
            "Ima steal that line, so good.",
            "There’s no way this guy isn’t Australian",
            "Reminds me of taking my sister to Bill Cosby show back in 1973 - Rufus with Chaka  Khan was the opener. We owned every Cosby album, loved him as kids. This was grown up filthy nasty Cosby. Motherfucking best comedy stand up show ever!",
            "Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL Literal LOL"
        ]
    },
    {
        "post_id": "t70613",
        "author": "None",
        "title": "You wanna enter my room without knocking because you're my parent? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t70613/you_wanna_enter_my_room_without_knocking_because/",
        "score": 16920,
        "num_comments": 768,
        "created_utc": 1646450081.0,
        "selftext": "This story begins when I was 13 (F). I am now 18F. We had recently moved to a new house at this point and my door no longer had a lock on it. Because of this, I requested my Mom and my Step Dad knock before entering to avoid any awkward scenes. No dice. My Step Dad's words were \"I'm your parent so I don't NEED to knock. What are you hiding?\" This made 13 year old me very angry as I cared about my privacy a lot. I went to my Dad's the weekend after and he said this to me, that sparked inspiration. \"If you don't want your Step Dad to enter your room, make him never want to enter your room without knocking again.\" Cue the MC. When 13 year old me got home from school one day, I proceeded to strip. I sat on my bed playing my 3DS and waited for the moment to come. Of course, about 30 minutes into Pokemon Super Mystery Dungeon, my Step Dad barges in. \"Hey I need you to take out the- WHAT THE FUCK.\" He slammed the door at that point. \"WHY THE FUCK AREN'T YOU WEARING CLOTHES?\" 13 year old me, being a smartass, decided to say \"Well, it is very hot in here.\" (I'd like to point out at this point that I live in a southern state of the US and it gets VERY hot during most months) \"And I did ask that you knock.\" \n\nObviously, knocking was a frequent thing for every single room in the house at that point. And oh yeah, my Mom bought me a hook lock for my door after that. Sorry if this was short, I have more stories but I figured my first should be something i'm sure we've all gone through at some point.\n\nEdit: Wow I did not expect this many people to see this. I don't know whether to feel embarrassed or proud, lol. To clarify because someone asked and I realise it could have caused confusion, No it wasn't the original Pokemon Stadium, it was called something and then Pokemon Stadium. Maybe Ultra Pokemon Stadium? Something along those lines. And also, no, my Step Father never had any sexual reasons for this, my entire life he just enjoyed being a controlling manipulative ass.\n\nEdit 2: It was Pokemon Super Mystery Dungeon, not Stadium\n\nEdit 3: Obligatory Thank you for the rewards edit!\n\nEdit 4: I've seen a few people doubt the validity of my post or compare it to PH content. Granted, there is nothing I can do to prove I did this, I do have to say if you didn't go through this with your parents, I envy you. Being a teenager for me was quite the battle with privacy! And of course when you first hit puberty, privacy is of the upmost importance.\n\nAnd also, because i'm still getting comments about it after my edit, i'm going to go ahead my mistake in saying \"Pokemon Stadium\" to the correct game. In the five years after this story I stopped playing Pokemon, and there are so many titles out there sometimes they tend to run together. And also, yes my Step Dad really did cuss like that. He prided himself on being a parent that \"Didn't give a rats ass\" about cussing. Oh but if I were to cuss back then i'd be in big trouble. It's just one of those cases of \"Do what I say, not what I do\". \nAlso grammar fixes\n\nUPDATE: My Mother saw this post. She was upset I would post this on Reddit. Lmfao! Hi Mom, I guess.",
        "permalink": "/r/MaliciousCompliance/comments/t70613/you_wanna_enter_my_room_without_knocking_because/",
        "comments": [
            "Knocking on a door before entering a room is one of those decent-person-proper-manners kind of common sense things that should be drilled into everyone. There have been so many occasions when I'm in a room (i.e. the bathroom) and people immediately try to open the door. I've had the misfortune of forgetting to secure the lock on the door. Extremely embarrassing for me, but I've noticed that those people will knock more often afterwards.",
            ">And oh yeah, my Mom bought me a hook lock for my door after that. \n\nYou'd better believe mom and step-dad had a LONG conversation about The Incident. Hopefully everyone can look back on it and laugh.",
            "In college I shared an apartment with a guy who either never knocked or would knock but not wait for an answer. I myself had a habit too - after a shower, I wouldn't get dressed right away.\n\nSo there I am at my desk, back to the door, completely naked, and I hear a knock and the door opening. I spin around in my chair and make eye contact. He slowly backed out, closing the door behind him. That was the last time he entered without knocking.",
            "My mom always knocked on the door except for that one day my girlfriend was over and she was bringing my clean clothes up to my room and her hands were full and when she walked in her eyes were full of me buried face first between my girlfriends legs.  She screamed excuse me and ran down the stairs.  Need less to say it killed the mood and my girlfriend was embarrassed and left.  But later on that night when me and my stepfather were sitting at the dinner table. He looked at me and said he heard that I shouldn't be hungry because my mother told him that I had already eaten 🤣😂",
            "When I was a young teen, my mom refused to knock as well... until she walked in on me rubbing one out.",
            "My daughter (14) told me that not only am I one if the few moms in her friend group that knocks but I am the only one who waits for the okay to enter. I told her that I did not need to interrupt the personal time that I refuse to believe is happening and never wants proof may occur. I also told her that if I was concerned I still have the right to search her room. So far I've never been concerned.",
            "My parents took the locks off the doors because us siblings kept locking each other out of our shared rooms(the 2 boys in one room, us 3 girls in the other).\n\nOn the flip side, my paternal grandparents had to remove ALL door locks in the house because great grandma had dementia and it got to the point she'd forget how to unlock the door. It made knocking on the bathroom door at their house EXTREMELY important",
            "40m here. I don’t even knock on my stepdaughter’s door. I just text her if I want something.  It’s just more comfortable for everyone that way. Her privacy is respected and I don’t have to be grossed out by the sight of the goblin cave full of week old dirty dishes that is her room.",
            "My husband is a super private person and has told me how awful it was growing up in his family home because no one evet knocked.  Now we have an 11 year old son and 8 year old daughter.  I watched my husband just walk into both their rooms the other day.  At the end of the evening I mentioned how he should start knocking as both kids are at that age, especially our 11 year old.  He was so thankful for pointing that out because he saw how he was turning into his parents, thinking he didn't need to knock.  Now he knocks, thankfully without any embarrassing situations helping to teach the lesson.",
            "Mom took away my door when I was 15 and told me I could hang a sheet over the frame when my sister beat my door to hell and refused to get me a new one. What did I do? Masterbation furiously, frequently, and loudly. Having no shame is a super power that can get you almost anything.\n\nI got a new, thicker door with a lock within a week. I have no shame, I can make you",
            "I'm a step-father to a girl.\n\nI made it a particular point to always knock and be extra careful about this exact kind of thing with my step-daughter, because doing anything else would make me a huge ass (*not to mention open me up to potential legal problems*).\n\nLike, I don't know what he expected.",
            "I recall my girlfriends kids were very young when their mother and I started dating. We were all good friends both the mom and her kids and myself. The youngest  was seven. So even after we stopped dating we stayed friends. (Hmmm, their mom is the only person I dated that I’m still friends with today.) Anyway I saw her kids grow through grade school and high school go off the join the service and head to college. When I was visiting one day we were all going out to celebrate the youngest’s 16th birthday (I think. It was long time ago). Their mom was getting ready to go and asked me to tell the girls to get moving. There were two of her kids two sisters and their female cousin up in their bedroom. So I went upstairs, the door was open so I walked in saying let’s get moving your mom wants to go. Then I froze. The youngest kid, the one I had known since she was seven was standing facing a mirror with no shirt or top on of any kind just bare from the waist up. Her cousin and sister were standing next to her. I quickly said excuse me loudly. I didn’t see anything other than the back of her torso. Thank god! And she didn’t even turn around she said that’s ok. She didn’t even flinch or react. Like it was nothing at all. Her sister and cousin giggled a bit and I quickly left and headed back downstairs. I reminded their mom to make sure the girls shut their door when changing and told her why. She just laughed too. Man I was really embarrassed.",
            "Our kids ( six of them ) were really bad about walking into our bedroom without knocking so my wife and I made a sign for our door that said “Please knock before entering. We can’t afford therapy for all of you.”",
            "My 10 year old stepdaughter has 5 siblings at her Moms house, shares a room with 3 of them (all girls, the 1 boy has his own room even though he's 4) I come from a shockingly similar family with tons of kids and no privacy.\n\nThe first thing we did after moving into this house was get her a doorknob with a lock. One that COULD be opened from the outside if an accident happens.\n\nI know all too well how much a little privacy can mean to a child that had none. Knocking is the bare minimum level of respect, no matter the age of the person.",
            "I did this with my new neighbors recently. Nosy fuckers kept looking through my bedroom window (front room of ground floor) when entering their front door, so I took to just sitting there stark bollock naked which actually solved two issues:\n\n* Them looking into my room\n* Me giving a fuck about what they see",
            "I was a step dad to girls. I would never enter their room w/o knocking.",
            "I'm over 50 years old and have been out of my parents house for years. When I visit, I ring the doorbell and then use my key. My mother once asked why I rang the bell (which caused one of them to get up and head for the door) if I was just going to use my key anyway. I told her, \"You don't have kids at home and can do whatever you want in your entire house. How do I know you and dad aren't chasing each other around the house naked? Ringing the doorbell gives you time to hide before I walk in.\" \n\nThey thought that was hilarious and told their sisters and brothers what I said. 😏",
            "my dad had this bad habit of knocking but then going ahead and coming in immediately, regardless of the fact that i had no time to respond. i don’t think he was being purposely rude, he just didn’t think about it. he’s a good guy but he’s not thoughtful. this was also annoying because my mirror was on my door so if i was doing my makeup and he came in, it knocked right into me. all it took was him barging in on me ONCE without clothes on and me screaming that he needs to wait for a response before he just comes in for that to never be an issue ever again.",
            "using your knockers to inspire knockers",
            "I don't know who needs to read this, but if you don't want to walk in on your child masturbating, please knock. Every kid does it at some point, just save yourself the embarrassment and knock.",
            "Southerner not knocking before going into someone's room? Must be from out of state jk. I'm glad you got that figured out though, without too much family strife. Good on you.",
            "Even Timmy Turner's dad was slightly better about this!",
            "I’ve heard some parents will just take the door off…good luck",
            "My sons are 14, 12, and 10. I know what I was doing in my room at 14 and 12, and that is something I really don’t want to see my kids do. (Let them do what they want - I just have no need to witness it directly.)",
            "My parents always knocked. For that I am great full. Loved the story",
            "I always have a hard time wrapping my head around these Kinds of posts. My parents have never not knocked before entering my room.",
            "When I was little, I would constantly lock my bedroom door. My dad got tired of it so he reversed the doorknob.\n\nThis wasn't an issue until the one time the baby sitter and my brother locked me in my room until my parents came home.\n\nThey put it back after that.",
            "I just bought a rubber door stop and put it on the inside.",
            "Good on you. Growing up, my dad gave the following explanation for why I had no right to privacy in my room (I was about 10 at the time):\n\n\"I work to pay for everything you have, including this house. This room is part of the house that *I* pay for, so this is not *your* room, it's *mine*, along with everything in it! I will enter my room as I see fit, and you will leave your door open at all times!\"\n\nAnd that, boys and girls, is how you force your kid to devise every method possible to hide their life from you and desperately cling to whatever shred of privacy and dignity they think they can find. Suffice it to say, my teenage years went downhill pretty fast. If your kid is figuring out at 14 that they can hide their stuff by creating a secret compartment inside of their boxspring, you dun' fucked up. I didn't even use it for contraband at first, just regular books and CDs; hiding everything basically became an instinct, and \"trust\" remains an alien concept decades later.",
            "I never realized I had it so good as a teen , two story house , kids rooms up stairs , mum and dad down stairs . our clean cloths were left on the stairs to take up . one of my jobs for pocket money was to clean the bathroom up stairs , so no adults ever ventured up stairs.  siblings raiding each others rooms was a common occurrence though .",
            "Thirteen year old me would have looked at you and asked, \"You have a door on your bedroom?\"  53 year old me, looks at 13 year old me and acknowledges the abuse I suffered.",
            "For me knocking is secondary, but not because I enter without announcing. I tend to just call out my kids' names through the door. It's not like it's some steel exterior door. If they don't respond (cause headphones or sleep) then I knock, since it tends to get their attention when calling doesn't.",
            "I'm twenty three and my mom doesn't knock on my door, which also doesn't have a lock, yet my boyfriend (who I've intentionally been naked in front of) does knock. It doesn't make sense.",
            "This could have backfired badly. Glad it worked out for you, but not a strategy I'd recommend. Source: had a creepy step-parent and a sister.",
            "\n\nFor a wake up for school/we have to go somewhere I always cracked the door to my daughter's room just enough that my voice would carry through clearly. I spoke her name until she answered me. Then I closed the door. Further checks were done with a knock and wait for response. If she didn't answer me I repeated the first process.",
            "I work in Cyber security. The amount of parents, that do not generally understand the concept of privacy and what that can do to your mental health blows my mind.\n\nYou have a basic human right to privacy, what's yours is yours. I have every software and knowledge in the book for my kids to never be able to hide anything from me without them knowing via technology. But I will never do that to them.\n\nI will teach them concepts to be safe, that's it. If they want to bring something up to me, that's for them to decide.",
            "Parents barge in the room acting like we are cheating on them with another set of parents",
            "This is gonna be a great family story when you are older to make your SD feel awkward during thanksgiving",
            "Great example of MC!  Good job!",
            "\"What don't you want me to see?\"  \n\"I don't know, what are you trying to catch me doing?\"  \n\n\nThey never have an answer for that.",
            "My doorhandle would randomly lock when it was closed, had to push the lil button in the handle many times to open it up when it locked behind me. But parents didn't believe me, woke me up beating on the door many days shouting.   \n\n\nOne day they removed the handle. Broke a lot of trust.   \n\n\nIf you're a parent chill out a bit. Let your kids have privacy.",
            "My mother was the same way and still believes that children do not deserve privacy because she is the parent and everything is her business. I still have these weird hang ups about not telling people things or keeping things a secret because I was forced to tell her everything as a child. I am friccen married and still in the back of my mind get anxiety when something happens that my husband and I choose not to tell her about and I feel like I'm lying to her even tho whatever it is isn't any of her business At all.",
            "LMAO!  Good for you!  When I first moved out my parents'd come over w/out warning as well.  They'd just let themselves in with their 'emergency' key.    I broke them of the habit but switching to full and complete nudity inside the house at all times.   Two 'events' later and they ALWAYS call now.",
            "My step daughter used to just walk in to me and my wife's bedroom.  She still regrets what she had seen 4 yrs ago and knocks on every door.",
            "When I was about 12 I was really jealous of my older sister who had a door lock. So I learned how to prop it closed by putting my desk chair underneath the handle. Well one day my little brother had a friend over and they were *obnoxious*. They kept barging into my room every 5 minutes to annoy me. So I not only put the chair against the door, but barricaded it with my furniture to keep the door from wobbling and the chair in place. Instead of just giving up, the broke the doorknob off my door. I got a lock after that.",
            "I was always conveniently naked whenever my parents asked if they could come in.\n\nHad to stay with them for a while as an adult and they'd randomly go into my room without asking to drop stuff on my bed while I was at work. Started leaving my dildos and BDSM manual out. Nobody went in after that.",
            "That definitely would stop someone from bursting into your room without getting labeled a certain way.",
            "Good.\n\nThis should be the response of every kid to every parent putting video cams in private areas or otherwise not respecting privacy (to the extent of even knocking)\n\nPS. Though before emulating this, one should make an assessment on whether the parent presents other dangers (e.g. the degree of \"step\"ness) Otherwise, unforeseen unwanted consequences could occur",
            "As a step-father, I don't understand why he \\*wouldn't\\* want to knock.  I've always wanted my kids (whether they're blood relation or not) to have their privacy.  I've even encouraged my son to lock his door because, for some reason, sometimes I forget to knock with him.",
            "Same thing happened to me. I just stopped knocking myself. When he was taking a shit I'd just open the bathroom. \"oh sorry\".   \n\n\nOnly took a few times; Told him you don't knock. I don't knock. I also installed a new lock and kept the key to myself. Pissed him off. But what was he going to do about it?",
            "I have a teenager and i don't enter without both knocking and hearing it's ok to enter. Yes i have the authority to enter but it would be stupid of me to do so unless it were an emergency (for example there's a house fire).",
            "Door open = no knock just a voice announcement \n\nDoor closed = knocking until there is a response\n\nMy kids know this. We live by this idk how many times they caught an eyeful of their dad or I naked before they learned. The only exceptions are the call of shame for toilet paper from the toilet or for a towel after a shower and bed checks before my husband and I go to bed.",
            "That was absolutely brilliant and reminds me of a similar story.\n\nWhen I was 21 still living at home my parents were finally able to buy a house like they'd been wanting for like, six years at that point. My door did not have a lock, for some reason. I ask my dad if we could get a locking handle and he could switch them out as the resident handy man.\n\n\"You don't need that, nobody's going to enter your room without knocking.\"\n\nI tried pressing the issue but it really wasn't worth it with my dad. Fast forward a few weeks and I wake up for work, go about my routine. I hear footsteps coming towards the back rooms which isn't strange since my parents' office is back here. Next thing I know dad is opening my door to make sure I'm awake *while I am changing.* He quickly pulled the door back shut and I just call out:\n\n\"This is why I want a lock on my door!\"\n\n\"... Yep, you got it.\"",
            "I can't even tell you how many times I'd knock on my stepdaughters door & she'd say hold on, I'm naked/changing. Ok, take your time. Pretty sure it's just common courtesy but parents are weird",
            ">but I figured my first should be something i'm sure we've all gone through at some point.\n\n...No, the behaviour of your stepdad was in no way normal nor healthy. I'm sorry you had to grow up with thinking it was normal not to have your privacy respected...",
            "Hell yea make them pay for their lack of boundaries.",
            "I like this woman! I wouldn't have had the nerve at that age. Well done!",
            "My dad kept barging into my room even after walking in on me putting on clean clothes after a shower or just changing in general multiple times because he’d forget to knock, or he’d knock and not wait for a response. I finally convinced him to give me a lock on my door. He’d still try to open it without knocking.",
            "I knock on my kids doors because I personally don't want to see that shit",
            "Had a roommate that would do this. I stripped down buck naked, bent over to touch my toes as he was opening the door. He never did that again.",
            "Always knock on your kids door. Additionally, knocking as you’re opening the door and walking in doesn’t count. Knock and give a few courtesy seconds.",
            "Parents who think they have the right to barge into their kid's rooms at any time are foolish. I was a straight laced kid all through my childhood, but I lived with 4 siblings and my parents, and a ton of pets. My room was the only little bit of control I felt like I had in that house. My parents generally respected that, but did barge in a time or two, and of course I was just playing video games. But it still rankled me to the point I put my own hook lock on the door.    \n   \nSometimes kids just want to feel like there's one thing they have control over in life, let them have it.",
            "I knocked on my kids doors from the time they were old enough not to be cutting their own hair with safety scissors or grinding play dough into the carpet. Kids call the shots with privacy. I'm noticing it now with my 7 year old grandson.  I want you in the room next to me while I'm going to the bathroom (because I don't want to be alone), but I don't need you to watch me anymore (which i did until I was about 6). People who disregard children's need for privacy puzzle me.",
            "I will never understand the need for control over your child you can’t afford them basic manners. \n\nKnocking is basic manners. You do not suddenly get to dismiss peoples privacy and autonomy when they are your child. They are still their own person.",
            "I lucked out.  I'm the baby of six and by the time I came along about the only time mom or dad came in my room was either to drop the laundry off or let me know I was in trouble for something (that didn't happen very frequently and usually was for things like using all his shaving cream to make a flotilla of ships in the bathtub.  I was a good kid, just a bit strange).",
            "I am closer to 30 than 20 and at my parents house helping take care of my disabled mother for a few weeks and this is a regular occurrence. Or \"KNOCK KNOCK KNOCK as the freaking door is opening and my balls are hanging out. Next time Im just going to spread my cheeks.",
            "I'm confused.  3DS, but Pokemon Stadium?",
            "Whats the point of knocking without waiting for an okay to enter!? Someone enlighten me",
            "Oh god, my mom never knocks and barges in. I used to have locks but ever since diabetes… no lock. 13-30s reeee rip",
            "One of the advantages in living in a house that creaks a lot on movement is you can hear your parents coming long before they get there...as such I never had any problems with privacy (though I did have a lock on my door, unused)...",
            "Good for you! Not so impressed with stepdad though.\n\nThe only person I live with is my wife of 20 years and we still knock for each other. It's just a matter of respect and courtesy.",
            "Good work! It seems like you should be the parent, You are certainly a good teacher!",
            "Your first story was good. You trained your SD to follow a simple basic request.",
            "People try to barge into the (single toilet) bathroom at my work all the time. It has a lock, but people skip the \"knock\" part. I've wondered if I'd get in trouble for \"forgetting\" to lock the door. \n\nSometimes when people do knock I'll mess with them and say \"come in!\"",
            "That wouldn’t work with my son, he walks around naked as a Jay bird esp after bathing. He’s 12, lol.",
            "That is ballsy af, OP. Wow, 13 year old you. So courageous, so creative 😭",
            "I have an ex that used to work nights and she lived across from a Mormon church. They would ring the bell in the afternoon when she was sleeping and despite her telling them to stop coming they kept doing so. One day she intentionally answered the door completely naked and they never came back again.",
            "Luckily that stopped the step dad. Some of them are disgusting and would constantly barge in to actually try to yet a view of you naked.",
            "In my house we don't knock.\n\n\nMy roommates and I stand outside each other's rooms and make goose noises.",
            "Good for you! Be proud of this!! I always knock on a closed door. Even when my oldest was 2 and younger, I knocked if his door was closed or mostly closed. Guess what, my kids always knock on doors now. \n\nOne of my friends refused to knock on her kids' doors even after they were adults living at home. Her kids got tired of this. So they quit knocking on doors too. Imagine her surprise, and her husband's, when the kids started just walking in every time they were having sex!!! That started a family rule about knocking, lol. I learned about this when my friend called to complain. Apparently my oldest gave her oldest this idea one day at school. Her oldest isn't creative in the slightest, but my oldest is very devious (it runs in the family). My only comment was asking her why she wasn't knocking on her kids' doors before this?",
            "My mom's husband used to get mad at me for having my door shut during the day if I was in my room, for similar \"my house, my roof\" reasons. I'd still close it out of habit because I'd never had to keep it open before (they married when I was 15). He'd just barge in, say \"Door. Open.\" and walk off.  \n\n\nI wish I had some malicious compliance story to go with it, but instead he decided to take the door away for like a week or so. It didn't work though. I kept shutting it, he kept being an ah.",
            "My aunt quickly understood why I needed her to knock. \n\"what are you hiding?\"\n\"my bare ass\"",
            ">\tstep father\n\n>\t13 year old girl\n\n>\tthe south\n\nYou dodged a bullet there.",
            "Father of a son and two daughters here, I made it a point to stand in the hallway, call out their names, then knock on their closed bedrooms and ask. 'Are you decent?' \n\nThen I waited for their answer, with the expectation that they would reply 'yes' or some form of 'no, just a moment.'\n\nAfter a few unanswered queries outside the door, I'd knock once more,  then enter slowly.",
            "Sad it required you to do this but glad things eventually worked out.  Parents thinking their children don't get any privacy is a gateway to long term issues.  It's one thing to keep them safe, it's another to attempt to establish excessive control over them.",
            "I was only allowed to close my door if I was in the process of changing clothes. My door had no lock. While I was at school my mom would “clean” my room - hoping to find I have no idea what. There was never anything to find. I’m glad what you did worked for you, but, if I had pulled that stunt, I would’ve just gotten by butt beat and my door removed entirely.",
            "Every time I read on subs about insane parents when they barge in or even take away doors I wonder why more kids don’t do exactly this. Parents want to play games, play chicken with them.",
            "This is not something everyone has gone through. My mother would knock. When I asked who it was and she said it was her, I would invite her in and she'd enter. However, my dad would knock and wait. When he responded to my \"Who is it?\" and I said come in, he wouldn't. I could say come in until the cows came home and he wouldn't. He waited until I opened the door. It seems a bit odd to me because I wouldn't have invited him in if I wasn't comfortable with him coming in as soon as I invited him, but it was out of respect. \n\nI'm not bragging - my family had shitloads of big issues, this just wasn't one of them. And I'm grateful. I'm glad you figured out how to fix it and I do hope you are proud of it. Had you just argued, your situation would not have changed.\n\nAnd I love your dad for being so thoughtful about his suggestion.",
            "Oh, I remember those days all too well. \"Why would I need to knock in my own house?!\" Gee, Mom and Dad, can you think of any reasons a 15 year old boy would be pretty insistent on you knocking before you come in? Go ahead. Don't knock. But you're gonna see some stuff you REALLY don't want to see.",
            "Dominance Asserted Successfully",
            "Good post for r/raisedbynarcissists",
            "Lmfao, my stepdad tried to pull this shit too. At first, he was very respectful, but as I got older he got more comfortable and bolder and would just... walk into my room, which pissed me off.\n\n\nI dont hide _anything_ from my parents. I just didnt really ever feel the need to. If they want to know, they'll ask; if they find out something they wish they hadnt, then thats on them. \n\n\nAnyways, _my_ way of getting my stepdad to knock was by placing all of my sextoys out on my dresser for \"cleaning\", and then waiting for a bit. Sure enough, he barged in after a few minutes. I have never in my life heard a grown man sound like a squeaky-toy before then. He makes sure to knock now.",
            "I slept topless once when I was 17 for this exact purpose.  My dad never again walked into my room without knocking.",
            "YOOO!! I did a similar thing with my dad & step mom. They took away my door (fully removed it from its hinges) as a form of punishment. \n\nI ***LOATHED*** this. Not just bc of privacy but it was also very hard to fall asleep at night bc they would leave hallway lights on and it would poor into my room.\n\n*Any whooo~* maybe a week past and I had enough of it so I started stripping naked the second I heard anyone walking past my room. They'd recoil saying- **\"PUT SOME CLOTHES ON\"** And I'd retort that I had just gotten out of the shower and it's not my fault I didn't know they were out there. \n\n3 tries later my door was nicely secured back on its hinges 😌",
            "I know the feeling. My father used to purposefully barge into my room in an attempt to catch me doing something embarrassing so he could make fun of me for it. Then he cried and was in shock when I moved out on my 18th birthday.",
            "I remember I was 13 or 14 and straight up yelled at my dad at one point because there kept being close calls of him opening the door and me just finishing dressing right then. I think I said something like “you’ll be scarred, I’ll be scarred, we’ll all be scarred if you don’t start knocking first”",
            "He'll definitely always knock, but was your dad really suggesting to strip down for your step dad?",
            "now to take this to the next level, you should have walked into their bedroom at night and said there is no need for privacy per their instructions",
            "My husband was always going into my teen daughter’s room. It’s just force of habit, since that’s the way it always was when the kids were little. I’ve finally gotten him to stop doing it, and my girl is thrilled!",
            "I'm 24 and stuck living at home even though I make decent money because my mom is basically dependent on me at this point. Basically if I moved our, she's told me she'd have to get rid of the pets and move into a housing authority place. Even though her mortgage is in the 600s\n\nI'm essentially forbidden from closing my door all the way even. If I ever do I get a \"why was your door closed?\"\n\nThe main reason for it are \"the animals like to wander; they love yoy and they scream at the door until you let them in\" and \"I want to talk to you from my room and don't like yelling through closed doors.\"\n\nThis woman literally yesterday went through the room of her 24 year old son because she lost her bottom teeth and was looking everywhere for them. They ended up being in a case that she thought she shook and heard nothing. Which I found when I got home that evening.\n\nI'm this close to purposefully traumatizing her. But if I did I'd never hear the end of it for being inappropriate in her house or whatever.",
            "Goddamn that brings back childhood memories, they never opened the door like a normal person, they always fucking barged in and immediately starting talking. It’d scare the shit out of me.",
            "My dad would or just took the door off and then said well looks like you don’t need that lock now",
            "I’m over 30 and my parents still don’t fucking knock when I’m home. When they walk in on me getting dressed they just go “Ope sorry” and tell me what they need out of sight. But I guess no body fucking cares anymore for the most part.\n\nI always knock before entering their room, always.",
            "As a father of 2 girls under 11\n\n\nAlways knock...... unless you want to be scarred",
            "Heck, I gently knock before entering *our own room* if I know my husband is inside with the door closed. Not because I think he’s doing anything I don’t want to see but just the respect of his time and space when he needs it. And vice versa. We all deserve some private space and time to ourselves.",
            "“Why aren’t you wearing clothes?”\n\n“Because it’s my room and I don’t have to.”",
            "When my children were in the 11 - 13 year old range, they *POLITELY* asked me to knock on their bedroom doors before entering. I had absolutely no problem with this. They were of an age to need privacy.                      \nMy biggest issue was getting the same respect in return.                   \nAs I was a single mom, not dating at the time, they didn’t seem to think I needed my privacy…                            \nUntil the day my son barged in right after I’d gotten outta the shower and was getting dressed…                                                \nBoth my children knocked on *ANY* bedroom door that was closed after that!!",
            "I would have been doing Way more...yes. even at 13.  Live this story.",
            "I'm surprised stepdad couldn't figure this out on his own. Great win for you!",
            "Are locks in rooms inside the house normal for people? Except toilets. I find it odd. Knocking just seems normal to me.",
            "I did a similar thing as a M in highschool. Well done 👍🏻",
            "Well played,girl. Well played. This mom is lmfao.",
            "I remember I was changing and I blocked the door because my mom kept walking in on me. So one day she tries to come in and the door is stuck. So instead of getting the point she started pushing harder and yelling at me (???). Now I change behind the door.\n\nEdit: Also, I remember her knocking once and it was super annoying (hear me out). So I was chilling playing video games and she starts knocking. I say 'yes?' and she starts repeating my name in a baby, high pitched voice over and over again. I kept telling her to come in and she wouldn't. When she finally did, after around a couple of minutes she sat on my bed, and did nothing except stare around my room. I asked her what was up, she said 'nothing' and kept doing that. I eventually left the room and she yelled that she was going to search it while laughing. I just kinda went 'okay??' because I knew that if I protested she 100% was going to make a mess. Super weird.",
            "Absolute fuckin' legend.",
            "My mum used to knock briefly on the door and then barge in 🤦‍♀️",
            "No knock = see my junk 😉🤯🤯🤣🤣🤣",
            "Girl... so proud of you, that was baller.",
            "NTA.\n\nYou know you're a Pokemon fan when you know the post isn't accurate, lmao.",
            "Lololol this is exactly how my dad started knocking and I got a lock too",
            "Honestly I think my patents cared more about my privacy than I did when I was a teen, it was my mother that suggested she should always knock before coming into my room",
            "**🤣🤣soooooo funny, love it! 🤣🤣**",
            "You’re his female STEP child.. no, he doesn’t have a right to barge into your room when ever. Yes, step parents are a blessing, but there are enough shitty people out there that no step child should be without door locks. (I realize not  every step parent is a POS sexual predator, but enough of them are. Protect the child before the ego.)",
            "\"I'm your parent\"\n\nNo, you're not. You're the person in a relationship with my mom. My dad is my parent.",
            "I'm pretty sure your dad never meant \"show yourself naked to your step dad\" and he was most likely saying \"Do something more normal like being in a towel\".\n\nBut oh boy if it didn't work.\n\nI'm pretty sure if I was your dad I would have kicked the shit out of your step dad.",
            "What kind of mother let’s a *step-dad*, enter her daughters room without knocking….. that’s really gross honestly",
            "I want to read more stories.",
            "Your dad is a legend and so are you 😂😂😂😂",
            "Well that's one way to do it.",
            "Don't feel embarrassed! You're a champ!",
            "Well played",
            "Power move. I'd never have balls to pull off.",
            "Ah, if you like Pokémon Mystery Dungeon you should check out the new Pokémon game. It has a similar plot.",
            "Yeah, from a place originally where this is the norm, parents are king in the house. Mom only learned to knock last year I was living with them still. Somewhat in their defence, it went both ways. No repercussions for going to my parents' room or even taking something from their drawers without them present unless I planned to straight up steal it",
            "That was the perfect revenge. Hell, as an adult, I still knock on doors before opening them. If the door is closed, you never know what is happening on the other side of it.",
            "Psst the game is pokemon stadium 3",
            "Oh Timmy! I'm both respecting your privacy by knocking but asserting my authority as your parent by coming in anyway!",
            "Haha very nice!  This wasn't ever discussed when I was growing up, but my dad learned one day when he opened up my door while I was changing and I just absolutely lost it on him.  I don't even remember what I said but I was definitely swearing, and it never happened again lol.",
            "And a friend of mine did the same thing. She walked butt naked a bunch of times in her room and her mom stopped walking in there without knocking \nAnd her mom was always looking in her stuff so one day she put her vibrator in her drawer and her mom also stopped after she found the vibrator",
            "I used to sleep naked when I was 15ish. Mum just had my bro and my aunts came over to help cleaning - at around 7am on  a Saturday - guess who they barged on to clean his room - morning wood and all.  \n\n\nfirst and last time it happened loool",
            "See Timmy Turner's dad had it right\n\n*I'm both respecting your privacy by knocking but asserting my authority as your father by coming in anyway!*",
            "I find it funny on murder or crime tv shows that a person who doesn’t live in that house will knock and then see if it’s locked if it isn’t they just walk in.",
            "I can't say I have much if any experience with that, thankfully, but it's so messed up that some parents are like that.",
            "Sadly not 100% effective against weird house mates.",
            "I feel like I'm the only one that knocks. To the point people chuckle at me when I come into the room like when I knock on my managers door before entering. What if he's talking to someone privately?! Don't laugh at me 😡",
            "What a good way to teach your children that you don't have any autonomy, bodily or otherwise, until you're an adult. Great lesson! Glad they learned afterwards.",
            "Parent of three with two that are adults. The only time I can remember opening my kids door without knocking is when I needed to check on them at night with illness (didn’t want to startle them awake).\n\nI don’t even knock on closed doors. We just give a shout when it’s dinner time and the kids came a’runnin.",
            "Yeah, I cured my mom of that in the exact same way, except not on purpose",
            "As the parent of a daughter I can tell you throughout her entire life I always knock prior to opening for door if it were closed. Having decency even as a parent is a good thing it teaches your children to also have decency. \n\nNow I'm sure that at times knocking Gave her an advanced warning which is fine too. Kids will do things and you do not want to catch them doing everything. At one time I was also a kid so I know the things I did that my parents never found out about. Some parents are just fucking absurd.",
            "I’m glad OP found something that worked for her but I’m very disappointed that she didn’t get more creative. Not sexually, especially because of gender, but make it weird or uncomfortable AF. Naked and pulling out a used tampon with one foot propped up on the bed? Naked miming, wearing nothing but the face paint, beret and gloves? You could mime peeling him a banana and offer it to him, and then mime crying when he doesn’t take it.\n\nI love that some people were deeply concerned about the precise name of the DS game.",
            "The part of your story that confounds me is the hook lock. It’s just as cheap to buy and install a new doorknob with a lock. Your step dad should’ve been capable of unscrewing the old one and installing the new one.",
            "Pokémon mystery dungeon sky? My favorite game even after nearly 15 years",
            "Pokémon Stadium is in the 3DS?!",
            "My Dad use to barge in on us too; “my house, my child, I do what I want.” That worked until the day he walked in on my 15 yr old sister mid-naked leg raises😱. Lmao, he politely knocked from that point on.",
            "I loooooove showing my ass to people I know won't knock. The best part is the stuttering over their words while you just casually keep doing what you were doing lol.",
            "As a someone who was caregiver/ medication aide in a long term care center. I knock before going into rooms at my new job",
            "Do grown ass adults not know that privacy locks exist? Like, it's so easy to swap out a door knob and get one that has a little push button lock. Drilling into the door and frame to install a hook lock seems so unnecessarily complicated and ineffective.",
            "Well played",
            "I have the same problem with my mom. She NEVER knocks no matter how many times I've told her or how many signs I've put up on my door. She also never closes the door fully when I ask her to close it.",
            "Same thing happened to me. I managed to get through my whole life as a teenage boy with people just walking right in. When I was in my first year of college I came back home for Christmas break, and it was difficult living with roommates cause you couldn't do the deed ya know. So I got home, and made sure to only wank reeeaaallly late when everyone was asleep. Of course, my parents are fucking ninjas, cause at 3:30 in the morning, my mom decided to come in to say goodnight if I was still up (my lights were off and door was closed). Needless to say, they never enter my room without knocking first",
            "Yeah my mom learned the same lesson when I was a teenager, although wasn’t playing with video game 😂 but did have buttons and a joystick",
            "I made my entire family practice knocking even if they think the room is empty.  You have to learn boundaries.",
            "Amazing",
            "I yell my kid's name from far away while approaching the door, and wait for a response. (It's typically 'Maaaaa' said in the same yell as mine when it's okay to enter.) If I don't hear the child yell back, I will knock and ask if it's okay to enter. Privacy matters.",
            "I have a little bit of the opposite problem where people would knock, I’ll say that I will be there in a second, and then they walk away before I can get to the door.",
            "Bloody brilliant",
            "I know OP said it was in the south but be careful doing that in Alabama.",
            "I don’t enter a private room without knocking. If I need something from a roommate I wait for them to say I can come in or if they get the door themselves.",
            "Damn I wasn’t even allowed to close my door",
            "Kudos to you and your bio dad",
            "Be sure to subject offending parents to extreme humiliation on their death bed.",
            "Only time that I can recall anyone ever not knocking and walking in on me is when I was babysitting this cute little 4 yo neighbor girl, years ago. She, for some reason, found it funny to walk in on me when I was using the restroom. One day, she soon found out why that was a bad idea, and stopped doing that afterwards, though.\n\nIt's usually just a common courtesy type of thing, he was definitely power tripping.",
            "This is EXACTLY why my dad knocked on my door as a kid, he didn’t want to see me naked. I hate when parents power trip like this!",
            "As an adult, I realize i was pretty lucky to have a room with a lock my whole life. I don't get why a parent would want to \"catch\" you in the place where you sleep and change your clothes though...",
            "The worst is when they open the door, see you standing there *clearly* in the middle of changing, make eye-contact, close the door, **and then** knock... glad you've had a much better turnout.",
            "Ask, and it shall be given unto you. Knock, and you won't see things you don't want to!",
            "My brother-in-law's room doesn't even have a door! Yet I always say knock knock and waits for his response before looking or entering. So yes, regardless whoever it is living in the house.. if it's your room they should knock or ask for permission before entering",
            "Better than my idea, I played a lot of Lego on the floor, so one time when I heard my step dad coming I put my head behind the door, planning for it to hit me and say I was just playing Lego. Well the dick slammed the door open so hard he dented my skull, still have the dent now 20 years later. Had to go to hospital and had police and child services involved, nothing happened though, was chalked up to an accident. Though he never did burst into the room again.",
            "Lol, how did your father reacted to your step dad's reaction",
            "My parents did the same thing accused me of hiding something when I just wanted privacy. I ended up barricading myself in every time so they couldn't come in",
            "My dad let all of us (my sister, brother and I) each have a lock and key for our own rooms. He kept a copy for emergencies, like one time I fell asleep with my TV on super loud and I somehow slept thru the pounding at my door to shut it off, so my dad used his key. That was the only time. My brother had his door taken away once for about a month because he got in some trouble.\n\nI can't imagine not having any privacy in your own home, yet I know how common it is to have invasive parents like that.",
            "My parents didnt want to buy a lock for me either, until my dad walked in on me changing when he misheard me tell him not to come in. Dad bought me a lock that very day and apologized",
            "My parents' house was old and the locks weren't working when they moved in. They didn't fix them cause the doors shut solid, so who cared.   \n\n\nThey frequently took my door off my hinges as a punishment for everything from reading bad books (highly conservative and religions and they were \"Your body and puberty\" kind of books, but they were graphic), to mouthing off. I liked to poke the bear too. Untreated ADHD didn't help, but I didn't know that's what it was at the time. Once, they left if off for a long time; six months plus if memory serves, but it was a long time ago. I think I was about 16 at the time so it was nearly 20 years ago.\n\n&#x200B;\n\nMy room was right across the hall from my parents' room. The door doesn't face theirs, but it's easy to look into my room, even if by accident. There had been some awkward, hurried look aways when I'm getting changed and my dad is leaving the room. Nothing pervy, but a lot of \"Keep your head and eyes down and walk quickly\" moments. My bed was a former bunk bed that they'd taken apart for 2 individual beds for me and my sister. It was high-sided and had long bunk framed sides. If you were putting on pantyhose for church, you just couldn't get the angle you needed. So I often went to the living room and put them on on the loveseat. My dad was usually right there in his recliner, complaining that I was hiking my skirt up too high and that I wasn't being modest. I knew what I was doing when I said, \"Does it matter? You can see right into my room and watch me get dressed after I shower at any point!\" It didn't occur to me until I wrote this, but I am a sexual...*something* survivor. I don't have a word for what it was but it made me hate being naked in my house for long. It went away when I moved out on my own for school. Context.\n\n&#x200B;\n\nIt took some convincing from my mom, who heard but wasn't present for the situation, but I had my door back in 2 weeks. Given how stubborn and absolutely pigheaded my dad was and still is, that was fast.",
            "This is such a good idea! One time during an argument, my dad and mom broke my door down. I should’ve done this after that",
            "Heard this on rSlash and he’s making step daughter porn references about a naked 13 year old girl. Even used a “DaddyHub” thumbnail on YouTube. What a creep.",
            "I know that you said we all went through this, and truthfully only my abusive stepmother did stuff like this.  Luckily this was all before my teen years.  My dad only came in without knocking if he was waking me up (I’m an extremely heavy sleeper so he was my alarm haha) and the one time I started screaming and crying (I had a Charlie horse)."
        ]
    },
    {
        "post_id": "l55gj9",
        "author": "vampyrewolf",
        "title": "Downsized, and told to take all my personal stuff. Will do boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/l55gj9/downsized_and_told_to_take_all_my_personal_stuff/",
        "score": 16920,
        "num_comments": 394,
        "created_utc": 1611632863.0,
        "selftext": "I worked for a multinational company 10 years ago, as the regional management running a 2-way radio repair shop, on the customer's main site.  6 direct report techs, and an admin assistant.\n\nThe techs rotated but the admin assistant and I were there every day.  Because I worked 205-250hrs every month in that office, for 160hrs of salary, I had a few things there as you can imagine.\n\n2.5yrs into working there, I had annoyed my boss and lost the company lotto, so I was 1 of 4 people he downsized that year.  I expected it months earlier when he let the first one go, but wasn't going to work worrying about it.\n\nOne Monday my fresh tech was late and not answering his phone...  and comes in 90min late with my boss and HR in the vehicle.  Guess today's the day.\n\nAs part of the exit interview, they get to \"all personal property\"...  oh boy, time for some fun.  Most people have 1 box, I ended up with 5.  Coffee pot, toaster oven, microwave, my coveralls and boots (they tried to keep those, but I never submitted a bill)...  oh, and my shelf of notebooks (nothing was ever filed physically in my desk)...  my toolbox of electronics tools, soldering iron...\n\nBy the time I was done boxing my stuff up, there was 2 well equipped desks (of 4), no microwave, a 40 cup coffee pot, and no usb-serial cable to connect to the battery conditioner.\n\nFound out from my admin assistant that my boss had to spend just shy of a grand to re-outfit the shop that week, before going home.\n\n\nTL:DR Boss failed to realize how much I had brought to outfit a shop that I spent 50-60hrs a week at, had to buy it all himself before he left the site because the techs were pissed off.",
        "permalink": "/r/MaliciousCompliance/comments/l55gj9/downsized_and_told_to_take_all_my_personal_stuff/",
        "comments": [
            "Good. Hope the morons felt that one",
            "I quit my job as a service tech at a small town Buick dealership.  Here’s the kicker, it was over coffee.  Boss interrupts be 7 minutes before shift, as I’m getting a cup of coffee: \n\n“If you want coffee, you’re going to have to get here earlier” \n\nMe: “it’s not even 8, and I’m not clocked in”\n\nWell, a lengthy conversation ensued, and I was finally done with their bullshit.  When I started work there 5 years prior, they were still using windows XP computers in the shop.  These machines were barely hanging on, and far over the unsupported date by General Motors.  After 3 years, they were unusable.  I brought in two of my personal laptops, loaded all the diagnostic programs, interfaced them with the network, updated their routers with some of my old routers.  The only way we could diagnose anything new, or program these cars was with my tech.  The service department was down for weeks because of a dispute over coffee, before work even started.  ( this was a small shop with only three service techs, so two computers for diag/ programming was plenty. )",
            "[deleted]",
            "It's sad that you gave them thousands in unpaid work. I hope you aren't doing that for your current employer.",
            "I work at a school and my office talks about what they will lose when I leave:  \n2 mini fridges, Microwave, Toaster, Coffee pot, Printer, Scanner, 3 monitors, curtains w/tension rods, 13 cameras (I bought and installed them for security measures and yes, we have signs posted about them), 2 webcams, 2 netbooks, 8 hammocks and lots of artwork and clocks. \nI will only take all of it if they fire me or make me mad. Otherwise, I’ll leave most of it for the students (except for the electronics and appliances.)",
            "I did something similar, as part of getting people setup from home I had bought in my own enterprise routers and setup a configuration and test rig for VoIP phones, this would allow them to be setup or faulty ones diagnosed......when I was let go I took it all with me, and I was the only one with the knowledge to replicate it. I have no idea what they did after",
            "Paying $1000 to replace stuff of yours that other techs can no longer use is insignificant next to the savings on your salary.\nAdmittedly losing a productive worker is more likely to cost in the long run in terms of loss of repeat business etc.",
            "$1000? He got off easy. I have maybe $5k of tools at my place of work (all marked). The joys of being one of the first employees at a startup.",
            "I've only been made redundant and marched out immediately once. I was working for a company run on a shoe string by VCs who'd rescued the business intending to sell.\nThey said I could pack my own desk or let them do it, of course I said I'd pack.\n\nMy stuff filled two boxes and my manager had to help and carry one box my car because my access tag was taken when we had the interview. My once busy desk was left with just a monitor.",
            " \n\nI love this, because I did the same thing! Mine was when a recent worldly event first hit. It was a family run company, Daddy and two sons. But daddy and I clashed. He had hired me to turn a profit, something he had failed at for the previous 7 years. When the recent worldly event hit, he thought he was the only one who could navigate it. Since sons had told dad a few years prior to stay away from me, and he did, he decided I needed to go so he could rejoin the company and handle the recent worldly event. Whatever, my job was done, the company was experiencing great profit. They are on the right path.\n\nSince I was let go via email and phone call, because we couldn't be at the office without good reason (non essential business), I sent in a list of what I would be picking up at the scheduled time.\n\nYep, all office supplies, all coffee related items, extra furniture that was in my office. Keyboard, mouse, organizers, adjustable desk, etc. When I started, they couldn't afford anything other than what was absolutely essential, so anything that made my life easier there, I bought, and didn't ask for reimbursement.\n\nIt was a nice feeling, knowing they had to start from scratch. And daddy had nothing to work with when he took over my office.",
            "I did this when I was laid off. Half the furniture in the office was mine. I didnt want any of it, but out of spite, I took it all and gave it away. I left shelves worth of stuff in piles on the floor, all the teleconferencing equipment in the middle of the conference room, took my lights out of the ceiling that I installed myself leaving the office dark, the chop saw they used for fabricating,  all the box fans that I brought to cool the unconditioned back room, my tool box of all the hand tools, almost all the extension cords in the shop. I loaded up a full minivan plus a 4x8 utility trailer. Felt good to pull out of there leaving the place like the Grinch did on Christmas morning.",
            "He gets what he fucking deserves.",
            "I don't understand taking booted and uniforms from people.  How fucking tight are you.  Nothing says I am an unsuccessful business owner like wanting used shoes back.  And to anyone anywhere that starts a job and they give you used boots and uniforms to wear they think you are beneath them, why make money for someone who thinks you are beneath them?  The only reason to even start would be with a plan to destroy their most expensive machine, not for you but for all the other workers that they have mistreated.",
            "I had something similar happen to me.. I had worked for several years at a business. When I started..there was no physical manual on everything we did and were in charge of..including ordering the stock, procedures, etc.. So after having to train new people (we had a high turn over rate) I ended up making one so that new personnel had something to refer to when I wasn't there. A simple notebook containing an extremely detailed description of everything that the job entailed.Then the owner hired someone to take over running the company and he decided to make a head of the department and gave the position to a person ( the Pain) who was the reason many people either quit or transferred to other departments even though I had several years seniority over her..so I went to HR that same day and demanded to be transferred to another department, which was granted. 2 days later, I moved positions and took my notebook with me. Not many days later the Pain did the supply order for that week and let's just say she overshot it by quite a bit and then tried to blame the new girl who had been there just a few weeks.  The owner came to me asking about the screw up..I told him the truth and he said the Pain blamed it on the work manual being missing..He was beyond pissed..this was no small loss for a business this size because it couldn't be returned.  He asked me to return the manual..nope, it was my own note book, not company property and when asked if I would come back to my old job..nope..I liked where I was now. I ended up leaving a few months later but have heard through old co-workers about several other screw ups she made and they still have problems keeping staff.",
            "Who brings their own personal effects into an office? What if they'd tried to claim you didn't own it? They could've called the police and you'd have to sue for your stuff back and somehow provide receipts for each item to show it's yours.\n\nFor anyone reading this, don't treat a company like a family you'd do favors for. Don't miss personal events, don't donate free equipment, and don't work constant overtime for no compensation. If you feel like that stuff is necessary to do your job, then just don't do your job bc you don't have the tools. Spend the day applying to other jobs.",
            "Love this. I worked a job once that required a bit of equipment and it stayed at the workplace too. My boss was mostly happy to let me spend company money when I requested new equipment. I made sure to label that with the position so it didn't end up in another area, but I made sure to put my name on everything I brought myself. When I left though I had been planning a while so slowly started taking my personal stuff home I didn't need on a daily basis.",
            "That's great! this reminded me of when I was laid off once.  I had found a framed piece of art in the surplus bin at work so I hung it in my office because it was nice.  It still belonged to the company though (it wasn't trash, just available for use).  When my boss was walking me out he saw the painting on my wall and asked \"aren't you going to take your painting with you?\"  I started to say \"No, because it belongs to the company\" but he cut me off and said \"Don't worry, I'll carry it for you\" (it's pretty large).  So my Manager walked out of the site with a framed painting owned by the company (with words to that effect on the back!), past security and personally put it in my car.  Thanks boss!",
            "f....40 cups you say?",
            "You worked 80 hours per month for free for around 3 years (so around 3000 hours without pay) and he’s the sucker for having to spend a measely $1000 to get some stuff? Lmao",
            "In my case I saw the writing on the wall a month in advance. Started removing personal item slowly enough that they weren't noticed. Especially anything that may have been confused for being company property. \n\nAlso was there for 10 years and 2.5 years into a new boss that didn't get along with me.",
            "Lol. Something similar happened to me. I was in the process of making a master guide to my position as concierge when no one asked me to do it. Then one day before my last day of work, all my stuff gone. All my files and binder was stolen. I asked first and they said they asked what am I missing. Ummm yeah I took back my stuff and only guide when I looked through the  Ed’s office.",
            "I was in a similar situation and it made me a better boss later in my career.  My goal is no one on my team goes a penny out of pocket for a work related expense and everyone works their hours a steps away.  If anyone working for me me is paying for needed software and hardware, it means I failed to acquire the correct resources.  People working crazy hours means I need to make a case to hire more people.  Shitty bosses were my best teachers.  They taught me all the things to not do.",
            "Never work free overtime. even with a salary",
            "At least they don't call it \"right-sizing\" anymore. That was some audacious b.s. they had going on back in the 1990's.",
            "[deleted]",
            "I had a programming job in the mid 90's, and they fired me for someone else's mistake, AFTER ordering me to sign off on it under threat of being fired.  \n\n\nI had built software to do a lot of the programming for me. Since I built that software at home 100% off of the clock, they weren't able to keep it.",
            "This isn't malicious compliance. It's just compliance. $1k to refit a shop with creature comforts is cheap AF.",
            "This company wouldn’t happen to have its headquarters in Schaumburg would it?  If so this doesn’t surprise me in the slightest!  Way to go!",
            "I always enjoy stories like this, especially when they have to scramble to replace the coffee pot.",
            "50-60hr a week? Are you nuts? 40 a week and no hour more until it's accident paid with proper overtime!",
            "This is such a pathetic post. So you skaved away with unpaid labor and you think this was your sweet revenge moment? Man that is so sad",
            "This is the weird kind of revenge I love.\n\nThis person was basically living at work and just sleeping most nights at \"home\". So they kind of move in. \n\nThen get fired and move out; taking their house with them.\n\nHa. Ha. Ha.",
            "Good on you. I left a lot of shit at my old place because I worked at best buy in college and kept the relationship going, so i outfitted our office with tech I wanted on my discount. I still like my office but corporate can get fucked, so I didn't pull anything from them.",
            "Definitely a difference for sure. Just glad you found something that good for yourself.",
            "And that’s why I buy my own tools.",
            "You did a ton of unpaid work and spent your own money for basic office equipment and supplies. So your stuff gets depreciated while providing a free benefit to your multinational employer. \n\nYou then take the depreciated stuff you probably don’t need. Do you need another microwave or massive coffee machine at home?\n\nAnd your grand win is that your company has to buy less than $1000 in basic office equipment which will be treated as an expense and depreciated which will reduce their taxes. \n\nIt’s a bit sad you think this malicious compliance or some sort of own against your employer. Your employer had to buy stuff they would’ve have to buy anyway, just 3 years later, which actually saves them money.",
            "[removed]",
            "You were fired, and were then open to having sex with the boss? \n\nI mean, according to he headline, anyway.",
            "Is this story related to your deleted posts in this sub?",
            "What do you mean you lost the company lotto?",
            "TLDR;  I work for free, and buy all the office supplies with my own money",
            "You let yourself get fucked, don't be smarmy about taking the coffee pot home.",
            "lol have a little self respect in your next job man.",
            "Bless you good sir. This is a brilliant FU to a white employer.",
            "I used to cultivate insect infestations to punish my foes.  Hint, hint.",
            "Hello Moto?",
            "Peak MC!! I love it!",
            "It still feels like you were the one who really lost",
            "Seems more petty compliance than malicious."
        ]
    }
]