[
    {
        "post_id": "j4ah01",
        "author": "AnonFartsALot",
        "title": "The professor asked me to share info that I did not want to share...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/j4ah01/the_professor_asked_me_to_share_info_that_i_did/",
        "score": 16779,
        "num_comments": 350,
        "created_utc": 1601703388.0,
        "selftext": "*ETA: A genogram is like a family tree, but with extra symbols (e.g. a beer bottle for my alcoholic father!) and lines connecting each person. The type of line dictates the type of relationship- close, smothering, distant, estranged, abusive, etc.*\n\nI studied social work in school... I found myself doing 3 genograms over the course of my schooling, 1 for Intro to Social Work, one for Sociology of Mental Health and then ANOTHER in my last year. I have some not-fun family history and trauma, and so these assignments were never my favorite, but my teachers for the first two didn’t pressure me to disclose only what I wanted and be vague. (One even said I could do a fictional family! Lol.) The last one did not.\n\nSee, one thing we learned was that bringing up a client’s trauma outside of a therapeutic environment can be harmful. We were BSWs, which are not qualified therapists. During intakes and assessments, we learned to tell clients that they don’t have to give more details than they wanted to. There’s a whole host of reasons behind this, but I’ll spare you all the lecture.\n\nI brought this up in class after this teacher assigned an extensive genogram with an accompanying 5 page essay on what we learned about ourselves. A third of the class expressed the same concerns. His reasoning was “You might be doing this with your clients and you shouldn’t ask them to do anything you wouldn’t yourself.” (Not unless I get a graduate degree and become a therapist or psychologist!) The teacher also didn’t give us an answer when asked if resources for therapy would be provided if this brought up any student’s’ past trauma that they needed to talk about.\n\nOh, and of course, he added “This will only be shared with me and is 100% confidential, unless you choose to share.” Literally not any of our concerns, but I don’t want to share any of my deeply personal business with this man. \n\nThe assignment did not bother me as much as the hypocrisy of it all!  I said “Between class assignments and therapy, this will be my fifth one. Could I turn one of those in and be given an alternate assignment?” He wouldn’t budge. He said I didn’t need to disclose anything I didn’t want to, but followed it up with “but I expect you to take this assignment seriously.” And when I turned in a rough draft with about as much as I was willing to disclose, he said it wasn’t detailed enough.\n\nAlright, fucker. It’s show time.\n\nI have a lot of family trauma that is NOT mine to disclose, and I rarely ever disclose it. At least not with anyone who would ever meet the folks involved. My own is embarrassing enough. But definitely not as bad as some. But I put all that shit down on there and wrote about it. Then, the following week, the teacher asked if any students would like to share their genogram, if they’re comfortable. My hand shot up.\n\nI will spare you the details, but I basically gave the class a content notice to allow anyone to leave who may be triggered (a common thing in social work school), and then I just shared ALL of it. All of the relationships and why they were fucked up and why I hate my dad and my sister resents my mom and all that. Cheery smile on my face the whole time. The teacher uncomfortably thanked me for my bravery. A few students shifted in their seats, feeling uneasy. Others smiled.\n\nThen my friend volunteered to share. She didn’t like the assignment either, but she’s not one to argue with teachers. Her presentation trumped mine (girl had a real messed up family), and by the end, she was red in the face and everyone was super uncomfortable.\n\nNext person to volunteer to share was this girl who was in foster care, I’m not even sure if her sharing was malicious compliance? But hers was the most uncomfortable to hear. She started to cry at the end. Another student who also grew up in foster care, started to tear up.\n\nThe teacher cut us off after that.\n\nAnother teacher overheard and the following week, we had some serious discussions in class. I and the other students who shared were referred to the school’s mental health center (Lol). Another teacher I had a good relationship with checked in with me, and I told her what happened. I can’t tell for certain what went on, but it created a stink in their department. It’s been several years since I graduated, but I heard there is now an alternative assignment for the genogram.\n\nSo... lesson is, don’t tell social work students to do something that you tell them to never do to their clients, and you don’t get into social work unless you are traumatized AF.",
        "permalink": "/r/MaliciousCompliance/comments/j4ah01/the_professor_asked_me_to_share_info_that_i_did/",
        "comments": [
            "[removed]",
            "You may have clients that will disclose traumatic events to you but as a therapist it is unethical & inappropriate for you to disclose any of your personal history to a client.\n\nI have shit from my past I can’t even talk to my counsellor about, it’s just too traumatic to share, I’ve dealt with it & put it behind me, I’m not sharing that shit with anyone., the person responsible is dead, I let the dead bury the dead & let it go.",
            "I'm sorry to see what Reddit has become. I recommend Tildes as an alternative. July 15th, 2023",
            "That teacher fails at everything. As a teacher. As a person. Just no. \n\nI'm sorry you had to deal with his crap.\n\nQuestion for us non social workers, what's a genogram?",
            "[deleted]",
            "Something similar was required in a Biblical Studies class. It was an exercise called Exegeting the Exegete (exegesis is the process of analyzing the text to figure out what it means). Certainly it is true that our past experiences affect our interpretation. But to be required to divulge all of our past to a prof with NO trauma or therapy background or training was SO damaging! I had a different prof whom I trusted, and I think after listening to me he at least got a “do not feel pressured to write about anything in your background that you prefer not to disclose” added to future iterations of the assignment. But still. \n\nI still remember listening to this guy who was clearly so clueless about the trauma in some of our backgrounds that he could explain this assignment to us without any hint that he was aware of the Pandora’s boxes he might be opening.",
            "OMG THIS, ALL OF THIS! I did my MSW and the fucking genogram assignments were open season. The professor was this super nice slightly naïve professor who introduced the project and gave a chart of most common symbols for relationships between individuals in a genogram and me and a couple friends are like “so what’s the symbol for divorced then married sibling of ex? How about the symbols for whom abused whom? Anything for multiple suicide attempts?” Yeah, she got REAL real fast and immediately told us that sharing was 100% optional and that if anyone had been triggered to see her after class/go to the counseling center (which, ironically, a group project for social policy class found out that our counseling center had been turning away MSW’s because our Dept has interns there; we brought it to the Dean and forced change, yay social workers!). Needless to say, the professors all heard about the genogram coup and changed how they go about presenting the symbols to show ALL, not just the “normal ones.”",
            "Mental health social worker here. I can confirm that you don’t become a social worker unless you’re traumatised",
            "Stay strong fellow social worker! I just graduated from my program and I had a few genogram assignments as well. I’m sorry you had a professor handle your trauma so poorly. It’s crazy to think some “trained” and “experienced” social workers (let alone professors of social work) can be so ignorant to trauma. Sending you good vibes!",
            "It’s actually really heartening to hear people with last trauma wanting to help others. As an inner city school teacher you guys are sorely needed. Investing in mental health will get you more bang for your buck in successful outcomes for kids instead yet another online platform.",
            "I’m curious to know what effect this oversharing moment had on the relationships your fellow classmates had with each other. Was it positive or negative?",
            "I have this theory, that a majority of people who study things like these, social work, psychology, etc. need help or have needed help in the past themselves. So I don't understand how the teacher didn't see these issues coming. Either he is dumb as rocks or has no empathy whatsoever.",
            "I almost have a PhD (dissertation not finished). My masters is in family therapy and my doctoral education is in counselor education. I am horrified at that assignment for you and anyone else forced to complete it.\n\nWe had a class on those things and had to do one for real, fictional and our own families. No one had to reveal if they disclosed their own family or how much (if any) of their own was real.  We were asked to do some work on our own, but not as an assignment we had to share.\n\nI'm glad you were able to take something that was abusive and make a difference in your program. I hope you and the other students are doing well now.",
            "I was given this assignment in a psychology course while in college. My mother worked at the college I attended. As a Vice President. She worked her ass off to establish a career in which her abusive alcoholic father and long family history of mental illness didn’t define her. I sure as shit wasn’t going to compromise that. \nI submitted a genogram of a fictitious family and told the professor I wouldn’t be disclosing any personal information.",
            "That's awful!\nI like you saying (lol) that's exactly how I respond to stuff like that",
            "So, since it was meant to be such a standard and Prof was so insistent, did each presentation class begin with the Prof sharing their own? Good job with a horrible situation, and thanks for the new vocab!",
            "It's a good rule to never ask for more information than one wants.\n\nI too am inclined to cheerfully share horrific abuse if pushed. The other person is the one who usually backs down.",
            "I am a therapist and went to a CPD training course with various other therapists from different services and on the very first day as an icebreaker the tutor wanted us to get into groups and \"share something you hold shame about\".\n\nThe CPD was about adapting our practice to work with people with long term conditions so this task was nowhere near relevant! We all rebelled and refused and the tutor was pissed off with us. Sadly that reflected the quality of the course. We actually stopped attending after 2 (out of 5) days and our supervisors supported us.",
            "Jeez, that teacher needed a reality check. I assign kinship charts in my intro anthropology class, but the first sentence in the assignment is that students are welcome to substitute a fictional or celebrity family if they aren't comfortable sharing their own. It really has no bearing on their ability to use the method. I've also learned more about the kardashian family than I ever expected ⊙﹏⊙",
            "I would've done a 5-page report on how inappropriate it is to demand this kind of assignment from people. As another commenter said, clients would be sharing in a therapeutic envirnoment. Your sharing to your teacher/whole class is not in a therapeutic envirnoment and I absolutely would not have done it on my own family. Sorry you and your classmates had to go through that",
            ">and you don’t get into social work unless you are traumatized AF.\n\nIn...1990, I first took psychology. #1 thing they said was \"never accept therapy from someone who hasn't completed their own therapy\"\n\nHaving completed my own therapy, I often wonder about the advice I gave my friends before my therapy and how my own trauma coloured that.\n\nJust kinda makes me think, if people in social work really are that traumatised, perhaps there needs to be an entire course of therapy that goes along side your education.",
            "I had the exact fucking same thing happen to me during my social work program! I brought up my concerns and the professor was less than interested. No one else agreed with me though so I made up a fictional family. I had done four other genograms by this project and included everything recommended in my two textbooks which explain genograms. I only got a 71 and the prof commented that it wasn't detailed enough. But I saw four other students' genogram projects (including the papers, not just the map) and mine was significantly better written and more detailed (don't mean to sound rude, but I went back to do this program after completing a diff degree and other students were also younger) , but three of the four of them got 90s or high 80s so. Prof didn't like my attitude, I guess.",
            "That's absolutely batshit. \n\nWhile now it's been years and I'm very comfortable and open and have been forthcoming with my team, I offer information and tidbits willingly now, I can still throw them a curve ball or two with some of the stuff I just DON'T talk about. \n\nI am okay to generalise for an audience. I feel people knowing about what I went through can help them identify potentially children around them being abused and how to help them out. \n\nI do help the cps in my area with some advocacy and support with abused kids, in a here's a nice lady to be with you while everyone wants to talk about the bad stuff, can you talk to this lady cos she knows what your going through with this court decision she can help us answer your questions and help you think of good ones to ask type thing. I go into my past with those kids, especially when I'm the buddy so they have someone they know who get its. They get it. \n\nI baulk at more then those situations. It's not just that it's traumatic to some tho to forget it possibly could be is awful, I don't necessarily become overwhelmed because of it I just get saddened for a while and I choose to be happy, I choose to be healthy and I choose to try and be the best me that I can be, I've done the work with therapy. \n\nYou know why some people become teachers vs actually practice their knowledge in the field. Because knowing what's on paper is a world away from actually using it. Use this guy as the person you learn to pick red flags from. Cos colleagues like this could seriously harm patients/clients.",
            "Wow, that's intense. I would have hated it too. Glad you made them sorry they asked. \n\nAnd I thought it was bad when I had a class assignment to spend the term keeping track of all my energy and water usage at home, and what efficiency measures I was committing to, when I lived in my van and didn't want anyone to know. I said I committed to never turning on the HVAC (heat, ventilation, air conditioning) system, lol, and that I kept going with it even when I got sick, which I sure did",
            "Hugs from another social worker ❤️",
            "As a BSW graduate myself even though no one else will see this, thought I'd share with you how inept other SOCIAL WORK professors can be. \n\nBackstory: My face gets red, frequently. It has taken years for me to conquer going outside without makeup and still feeling okay. It flushes beat red in certain situations, or without warning, and the most awkward thing is when people ask why it's red. Still struggle with it some days. \n\nStory: I was in a 20ish person class and the tables were situated in a circle so we could all see everyone. I was laughing pretty hard, cue red face. My professor stops what she is saying dead. in. her. tracks., looks at me, and asks me why my face is red. She was in the middle of a completely different thing so this was super abrupt, everyone turns to look, face gets even redder. Looked at her eyes wide, didn't even know what to say. Couple friends later said even they felt uncomfortable!  One person kindly said \"oh must be hot in here\" and finally she moved on. Didn't really like her to began with, never liked her after that. Don't understand how social work professors can be so dense to how their own students are feeling!!",
            "You're last line was what I was thinking through your whole story.  \n\nI'm not in Social Work, but I KNOW that people don't go into that field for the fame, glory,  and money. Who in their right mind would think forcing people who chose such a field to share all the dirty little details of their lives would be a GOOD thing???\n\nI hope that guy got raked over the coals by his peers and department head. \n\n(The added part of sharing aloud....What the Fuck was he even thinking?)",
            "\\> A **genogram** (pronounced:  jen-uh-gram) is a graphic representation of a family tree that displays  detailed data on relationships among individuals. It goes beyond a  traditional family tree by allowing the user to analyze hereditary  patterns and psychological factors that punctuate relationships.",
            "HOLY SHIT. I am a therapist and have my master’s in social work. I also moonlighted as an undergrad TA four 4 semesters.\n\n**What your teacher required was incredibly unethical** and had it happened in my university system, a non-tenured professor would be fired.\n\nAt my university, when we did things like genograms, we were **required** to make fictional families. A lot of students (myself included) used the same fictional family in every class. The characters developed over time, with all sorts of dysfunctional behavior and tragic life experiences accruing amongst the family members. \n\nFor example, my senior thesis was on psychosurgery so Agatha, “my” maternal grandmother, had a Rosemary Kennedy-like sister who had a prefrontal leucotomy (early type of lobotomy). In my SA class she gained an abusive alcoholic husband and lost her oldest son in the Vietnam War in my grief counseling class. Agatha really had a traumatic life, poor thing.\n\nI cannot imagine being forced to share personal histories. Frankly, if you *did* share your life history, that would be a cause for concern. And the “your clients will have to do it, so you should too” thing is COMPLETE bullshit. You might have to refer your client for inpatient care - should you get inpatient care as an experience too?\n\n**tl;dr - your professor’s behavior is both mind-boggling and inappropriate AT BEST. In reality it’s completely unethical and almost certainly harmful to the students.**",
            "Yes!! BSW IN HDFS! Currently in MH field. What the actual heck! You go, our class genograms were a text book of PTSD and Borderline PD. I’ve never had a teacher or therapist push more than comfort level. Sorry this happened to you, but maybe you saved a soul!",
            "I always faked these kind of assignments. Not their business and they have no way of knowing",
            "I got a bad grade on this assignment from one teacher because I am estranged from a large portion of my family so there was not much there. I objected and got it changed, because people being dead or missing is a good answer as to why I can't call them and ask for further information",
            "I've done a lot of genograms in my training, but we've always been given fictional families to work on. I can't imagine what they were thinking making you do genograms on yourselves.",
            "I had to do some thing similar once and I simply made up a load of BS.",
            "I had to do this for my CMH masters. I used Peter Parker’s (Spider-Man) family tree and just changed the names and added a couple of my cousins lol.",
            "Oh, I am so sorry. \n\nI am a teacher and I’m the past couple years the  there has been such a push for social emotional learning in the classrooms. As part of the trainings to prepare us, we go to workshops with some of our colleagues and many teachers from other schools. We are expected to drudge up every tragedy from our past—family relationships, childhood trauma, ways we have been wronged, ways we have wronged others, what lasting impacts those things have had on us—in a mix of sharing whole group to everyone in the room and rotating through multiple small groups and one on one sharing. At the end of the day, we’re told to have a great day and take this new experience back to our classrooms. It is such a disaster. \n\nThe first time I went to one of these, I shared as I was asked to. It was so uncomfortable sharing so much horrible past trauma with strangers who really didn’t care. At the end of the day, I was a giant ball of tears and anxiety because all that shit was brought to the surface with no plan to address it. My husband was deployed at the time so I didn’t have anyone at home to help bring me back to “normal”. I was a mess for a few days while I worked on packing all that shit back up. \n\nThe next year I had to go to the exact same workshop (why?!?) and I just kept my mouth shut and thought about my grocery list and other random stuff while others were sharing because I wasn’t doing that to myself again. I took shit from the hosts, but told them that I wasn’t comfortable with what was happening and wouldn’t be doing anything like that in my classroom.",
            "...op, it is a bummer you and the others had to go through that.\n\n...also, fuck that teacher, hard",
            "not a social worker, but have done some Counseling study (and practical) - and my heart goes out to your entire cohort 💕",
            "I'm going this assume this happened years ago,  but someone should've made a genogram of the Lannister's.",
            "I’m gonna throw out a really unpopular thought here...\n\nIf you are not emotionally equipped to be reminded of your own past, but remain professional and unemotional in how you discuss it with other (future) professionals in your field... how are you going to help others who have trauma?  What happens when a patient has issues that remind you of your own past?",
            "ETA:\n\nEstimated Time on Arrival\n\nExtra Transient Aardvark\n\nEminent Tea Angle\n\nErroneous Throne Aerobics\n\n\n\n..nope, none of it makes sense. This is a lizardsperson.",
            "ELI5: what is a genogram and why is it such a common assignment in social work?",
            "Whewwww, I also was a Social Work major. There is a reason people become SW majors... most of my teachers didn't feel the need to poke at why.",
            "This is like a worse diversity day with Michael Scott.",
            "How did that assignment pass the board of ethics?",
            "I’d have dug deep into the teacher’s family tree and created a genogram around his fucked up family",
            "This is disgusting. My prof often assigns a genogram project like yours to their classes, only they make sure that you can do a genogram on a fictional family if you don’t feel comfortable using your own. What sort of asshat does this and then asks you to present them?? Good on the other teachers for calling this one out and for the department for doing something about it.",
            "I’m a social work student and as soon as I read “genogram” I knew exactly what was about to happen",
            "If a therapist asked me to draw one of these, I'd leave and find another therapist",
            "I had a professor use voting as an extra credit assignment. All we had to do was show proof that we voted. Problem was that I wasn’t a citizen then. I emailed her asking if I could do something else and she brought it up in class trying to embarrass me or something and said some shit about how it was extra credit and she didn’t “have” to offer it. But you offered it to everyone else so what I don’t get extra credit because I’m not a citizen?",
            "> I will spare you the details, but I basically gave the class a content notice to allow anyone to leave who may be triggered (a common thing in social work school)\n\nWere you aware of the recent research in to how those styles of trigger warnings are showing, at best, occasional aid in a very short-term way, often no benefit at all, and commonly long term damage by way of cementing a person's trauma as a core aspect of their identity, making it more difficult to successfully deal with the trauma therapeutically? \n\nhttps://osf.io/qajzy/\n\nI'm actually curious to see if you've seen research contrary to this. Or what else you might have heard about it.",
            "I would loathe an assignment like this. Honestly, I’d probably just flat out refuse. I’ve got too many family problems, and it’s stupid to think that blood matters all that much.",
            "I had to do the same for a class. I left out the juicy stuff.  Simple as that.",
            "I hate teachers who won't cut you any slack without knowing what's going on.  \n\n\nOk, I'll detail to you EVERYTHING that's going on in my life that's making it harder for me to do the homework than the other kids who are completely normal.",
            "I hate that assignment. Fellow social worker here, and that assignment infuriated me. It was one of my last classes, so I just lied on it, but I wish I’d been as creative as you",
            "You guys are brave",
            "One thing in this story I wanted to mention was how it’s awesome how, even if motivated by malicious compliance, your openness really let other people feel comfortable enough to be vulnerable. That is something really powerful that we don’t always appreciate.\nThat sucks your teacher was acting so hypocritical.",
            "I've been a social worker for 16 years and I have probably drawn out 5 genograms in my entire career. Maybe a couple eco maps tossed in there too.",
            "Oh my god that teacher was SO. DUMB. I’m sorry you had to go through that! That’s such a big deal!  I got my masters in forensic psych and took a class solely on how to administer, score, and interpret the MMPI, which is a psychiatric assessment that tests for major psychopathology, or mental illness. \n\nOur professor gave us celebrities and told us to fill out the test pretending to be the celebrity. We asked if we could take it ourselves or administer it to friends instead and he said ABSOLUTELY NOT! They did allow it one year, and one girl gave it to her friend. Her friend tested SUPER high on the depression/suicidality scale and us being mandated reporters...she had to report her friend for possible suicide. She got help, but yeah, school learned their lesson to, “Don’t administer psychological assessments to people unless you have the proper tools to deal with the results.”",
            "[deleted]",
            "How was this malicious? It just seems compliant. It's angry and against what you actually wanted, but it's not malicious. You weren't hurting the teacher. You weren't proving them wrong by complying. You didn't say the teacher got in any trouble. You did say there was a stink created in the department, but that's from telling on him to another teacher, not from complying, and that's still not saying he got in trouble for it.",
            "This sounds incredibly invasive and I'm so sorry you and others had to relive family trauma in school. In my own graduate program we did several genograms but all of our assignments were to create genograms for fictional families: movies, TV shows, books.",
            ">My own is embarrassing enough. But definitely not as bad as some.\n\nIn case there is any question, you are still valid in your feelings of trauma in spite of the fact that others may have had it worse. \n\n>Her presentation trumped mine (girl had a real messed up family) \n\nYou know, it is really awful he was allowed to force you guys to relive this shit. Please tell me you brought it up with school officials about how this assignment is harmful? To be honest I'd have refused to do it myself because I wouldn't have done it with a client either. \n\nI'm glad that the genogram is no longer required. I'd understand it as an option but to prevent traumatizing or upsetting someone's Ptsd, there should always be an alternative to sharing your own past/family with anyone. And I say that as someone who technically doesn't remember the worst of my abuse because it was done (and state sanctioned) when I was a baby.",
            "Don’t go into social work unless you are traumatized as fuck? Did I read that correctly? That’s some odd gatekeeping.",
            "Have you asked to look at.",
            "Have you seen the Seinfeld episode \"The Andrea Dorea\"?",
            "They could just have made genograms over knows that shows. The teacher may even choose some to pick from! Why does it have to be personal??? Lave your bravery tho!",
            "Oh, I made mine up. How would they know?",
            "I’m studying English and in one of my classes the teacher has been really passionate about pedagogy of disclosure and assuring us that we do not have to share personal information to do the assignments. Some fields lend themselves to sharing, but there is no excuse for forcing students to disclose information they are not comfortable with.",
            "This experience mirrors mine and every colleague’s of mine who got their degree in social work or counseling. These programs are notorious for expecting you to share your trauma without creating environments that are healthy to do so. Like damn bro, I just met you like 5 mins ago, but I’m supposed to tell you everything about my trauma history and expect you not to use it against me? It’s a no from me.",
            "I wish I could gold this. That’s a totally inappropriate thing to do. Are you American? I’ve had a few friends go through social work degrees here in Australia and I’ve never heard of that before.",
            "I hated this assignment in social work school, too, but we were given the option of not disclosing/being vague/making up a fictional family. I’m sorry you had to deal with it, and I’m glad your malicious compliance led to some changes.",
            "Such an abuse of power. I hope he got some sort of disciplinary action, at least.",
            "For my BSW program, we've made a couple genograms, but not for ourselves. One we had to pick a movie from a list (Precious, Peanut Butter Falcon, Beautiful Boy etc) pick a character and do a genogram on them. Another was on a person from a case study we read.",
            "You should contact the dean and tell him what happened",
            "We had an assignment in one of our speech classes that was to basically tell about ourselves.  Everyone in the class kept it short and vague except one guy.  He talked about how his parents died, his grandparents raising him, and being molested by his grandfather.  It was rough.  I can’t imagine how difficult your class presentations would have been to sit through.  I hope that you have been able to work through any issues that you have had.",
            "Funny enough as a fellow BSW (student) just reading the subreddit name and seeing that you were talking about a genogram gave me a \"of fuck\" kinda feeling\n\nSeriously though, I can second that pretty much everyone who goes into social work has been through trauma of some kind. And so ngl I've gotta wonder what that professor was expecting, even beyond causing harm to the students who were open that still invites a lotta secondary trauma",
            "I have a good friend who has a PhD in clinical psychology. She told me one time that most people who go into the field do so to help them deal with their own fucked up life.  I wouldn't be surprised if this is also true of social workers; at least to some degree.",
            "You handled it so well. I remember in mid secondary (English class) we had a mandatory exercise in which we had to publicly talk about our fears and why we were afraid of them to write a critical essay to \"reflect on them\". I told my teacher I was uncomfortable sharing and he kept on insisting he was mandatory. I had a lot of bottled trauma (I still do tbf, but it was really bad back then) and I had the spider diagram with my biggest fears at the time: Rejection, loud noise (Especially yelling), violence, the dark and cramped spaces (Also trauma related) and so on and explained why I was scared of those things, but very vaguely. And me being vague and having very disorganised thinking/speech (I also have learning difficulties tho I didn't know at the time) the descriptions were very confusing to read.\n\nI presented it and afterwards my teacher put me to the side and told me off for \"Not taking this seriously\" and that I should write \"normal person\" fears like being afraid of spiders. I felt super upset and ended up just doing that, even worse, the essay was themed around the topic of \"We're exaggerating our fears and we should stop overreacting\", I just made up the whole thing.\n\nI really wish I did back then what you did with yours. It takes a lot of guts to do that\n\nBut honestly, these exercises asking invasive questions should stop. In one about \"step forward if this fact applies to you\" last year at uni they were asking questions about if our parents were divorced on you and also one about siblings and for \"Step forward if you have x amount\" I did a hesitating half step and everyone laughed in a having fun way about it because they assumed I couldn't count how many siblings I had, one of the tutors even cracked a joke about it. I did that beause my sister died in a car crash when she was 18. It isn't fun",
            "Love this energy. I would have done the same.",
            "I mean yeah, the assignment was crap to begin with, but he has no way to verify what you write, so why not just make it up if it's traumatic? Great job on the malicious compliance but had I been in your shoes, the teacher would just get some random, made up info about my family to pass the class and I would promptly forget about it.",
            "You missed a good opportunity to call out your teacher. At the end of your genogram, you should have stopped, turned round dead pan eyes and say slightly slower that you have been talking with as well as a colder tone and say, \"Is that enough detail for you\". Then walk back to your seat without saying anything.",
            "How did that teacher get so far without realizing that people go into social work to help those who find themselves in the same shitty situation growing up?  People who grow up in Norman Rockwell homes usually don’t choose social work...",
            "I just love when teachers have ZERO therapeutic experience and just assign crap like this.",
            "It takes people like who with the courage to change these silly psych courses. That's cruel",
            "Especially for a class for social workers that's incredibly insensitive...\n\nAt least it is my experience that social workers and other people that go into psychology and similar usually have their own problems to deal with and often have a disproportionate amount of trauma in their life.\n\nI can't back this up with any data. This is just personal experience that might be very wrong indeed",
            "Oh gosh, this sounds absolutely terrifying. I'm hoping to major in psychology (I want to become a therapist). Is this the type of work I should be expecting??",
            "Wow, good on you.  \n\n\nMine wasn't that bad because I didn't have the mind set to do that at the time, but I also had a family tree assignment in school that I didn't want to share. I talked to the teacher privately to find a work around project but she refused. So I decided to plagiarize work of a person with the same last name (Actual relative) so I wouldn't have to disclose details of the other side of my family that I didn't want to open up about.  \n\n\nGot 0% on that one but I was so furious that a person in a position of power over a child would not listen to reason. If anyone should be compassionate in this world it should be the people who look after the vulnerable.",
            "Has anyone ever called you a beast for this? Cause this was some next level go-fuck-yourself, and I'm so proud of you.",
            "As a kid who has been abused in Foster care.\nThank you guys for the difference you make.\nThe only social worker who cares had a bad background as well.\nSadly there are still too many who are in the job for the wrong reasons in my country.",
            "Honestly I don’t think I would want to live if I was this sensitive.",
            "Alright, fucker. It’s show time.\n         \n           My new motto!",
            "This enrages me. Your professor broke so many ethical rules. One of the first things that I learned while working on my Master of Social Work was to respect each other. I am so sorry you had to go through that. I promise not all social work classes are like that, even at the graduate level. I’m learning how to do therapy now and we definitely don’t give personal details. It’s all made up or very vague past client experiences.",
            "That teacher should be called on the carpet by the administration and the appropriate ethics board. It's completely over the line. If you haven't, it might be a good idea to process this with a therapist, because you shared highly sensitive material in a public and very unsafe setting. I'm sorry you had to do that.",
            "Fuck that professor. Report the fucking bastard. I have no connection at all to your industry but forcing people to display their shit for an entire audience is beyond garage-human level attitude.",
            "Still waiting for the malicious compliance? Sounds like teacher got what they wanted and there were no consequences?",
            "You seem like you cause most of your life problems and blame everyone around you for it but good for you on getting this teacher",
            "If you can't handle even the thought of your problems, how can you help others to do so? Maybe it's not your calling to be doing it",
            "......why couldn’t you just make stuff up?",
            "[deleted]",
            "I had to do this as a client recently. They didn't even make me use my step father's name. \n\nI had started a human service degree many years ago, I definitely would have put my hand up to share, totally relate to the girl crying in the end. \n\nFuck teachers like this.",
            "I appreciate your bravery in putting that teacher in his place. How the hell do you not expect that kind of trauma in your own students? I mean, yes, talking and disclosing can assist with it all but not to a college professor you have a professional relationship with! Idiot.\n\nAs an aside, I too am a BSW with preexisting family trauma and mental health issues. Is that like a prerequisite for this job?? Why are we all like this???",
            "I had a professor (in educational psychology) make us attend an AA or NA meeting and then write up our experience because “we might have alcoholic parents in our classes one day”. I thought the assignment was such an invasion of privacy so I refused to go and  I made up the whole paper. I got full credit for the assignment too!",
            "I've heard of this happening. I think some profs have a masochistic streak. Friends of mine had a very similar experience.",
            "In the end, how did you feel about sharing the deeply personal information? Don’t get me wrong, the teacher was horrible and insensitive, but as someone who buried true feelings and hides behind reimagined personal history I wonder if there was any catharsis in this malicious compliance. I ask with respect and not with a hidden agenda of defending the teacher.",
            "At least you didn’t minor in analysis (or whatever you call it)",
            "Dude, report that shit to your department head. If the department head didn't respond, go to the dean. That shit is not appropriate, for all the reasons you already mentioned, and professors are not supposed to require assignments like that. Knowing the concept and completing one of these genograms may be useful and important for your course of study, but the option of a fictional family or using prepared background info or something should be there.  \n\nIn my graduate program, there was a professor who always did a personal assignment like that, and it was terribly uncomfortable. I mentioned it to another professor who advised me to complain to the department head. Some other students complained too and the department head made her stop giving that assignment. Another issue wasn't do swift to address because the head didn't take it seriously, so students went to the dean to address it.",
            "Seems like he was a voyeur!",
            "Thank you so much for sharing this! I’m obviously not happy it happened, but I do feel normalized knowing that others are having these super not okay experiences. I’m in my BSW program and was just given an assignment to write a paper about the two saddest memories from my childhood. Coming from an abusive and neglectful household I was like uuuhhh???? I said something about it not being trauma informed to my professor and she was like “sorry ¯\\_(ツ)_/¯”",
            "I feel like there should be legal action for this. He is basically breaking HIPPA laws by forcing you to disclose medical information about yourself.",
            "[removed]",
            "TLDR",
            "You must be a real bitch to be around lmao"
        ]
    },
    {
        "post_id": "157y04g",
        "author": "DawnBeaver",
        "title": "Don't want to pay for my ambulance? How about a helicopter instead?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/157y04g/dont_want_to_pay_for_my_ambulance_how_about_a/",
        "score": 16705,
        "num_comments": 851,
        "created_utc": 1690166619.0,
        "selftext": "EDIT: I do NOT consent for this post to be shared, re-posted, uploaded, or used on ANY social media or news platform. \n\nI had an anaphylactic reaction a few months ago and recently received a large bill for being taken to the hospital in an ambulance. Apparently, the ambulance company (while owned by the in-network hospital) was out of network, so the bill was on me. Wanting to avoid this situation in the future, I called my health insurance company to ask what ambulance companies WERE in network. That's when I learned that absolutely no ambulances for a 150-mile radius are in network, except for three helicopter ambulance companies. So I live in a fairly rural area, where many folks are hours away from the nearest hospital, and farm accidents are common, so it makes sense that we have helicopter ambulances. But I live in town, and a ground ambulance is by far the cheapest and easiest thing for everyone. But it's not in network. The insurance representative said that the reason the ambulance wasn't covered was to encourage members to use in-network services. So I said, \"The in-network option is a helicopter, and I live 3 miles by road from the hospital. Are you sure you want me to use the in-network option?\" There was a long pause, and she said she had to check with her supervisor. A week later, I got letter from my insurance company saying that my bill was paid in full. Looks like they did not want that in-network option after all.",
        "permalink": "/r/MaliciousCompliance/comments/157y04g/dont_want_to_pay_for_my_ambulance_how_about_a/",
        "comments": [
            "I used to work for Cigna Health Insurance in claims. If you ever have an emergency service denied for out of network, appeal. Any service rendered in accordance to what any layperson would constitute as an emergency should have this service upgraded to be in network coverage even if the provider is out of network",
            "I went to an in network doctor at an in network hospital who sent my blood work to an out of network lab so guess who got a $600 bill 🙄",
            "Had a similar issue when I went to the ER and got admitted for emergency surgery. Apparently, the anesthesiologist was out of network, so they weren’t covered. Checked to see which one was covered and there are zero in network. \n\nI guess you just have to bring and administer your own pain meds for surgery.",
            "Here’s a little secret I learned by actually reading my policy. \n\nThere was no in network ambulance service, so when we had a 24 thousand dollar invoice for an emergency medical transport between hospitals an hour away, the insurance refused to pay it.\n\nSo I dug into the policy and discovered a little tidbit that they didn’t want to tell me; “If there is no ‘in network’ ambulance service in my area, they are obligated to pay for any out of network ambulance service”.\n\nQuoted their own policy to them and they finally wiped the invoice from my account by paying it at their discounted rate.\n\nNEVER trust your health insurance to be honest with you, EVER!",
            "America, I'm assuming, needs to do better with this kind of crap. An ambulance should be in-network no matter what. It's needed for the emergency.",
            "Health insurance companies are for-profit and don’t actually provide any service that improves health. They are leeches that have convinced us that we need their “services”",
            "Living in Czech Republic, sometimes I need a reminder that free\\* healthcare isn't a thing everywhere. I mean our country has its share of problems, regarding bad decisions at the government level but I'm grateful at least we don't have to deal with this kind of sh\\*t :)\n\n*\\* It's not actually free as we have to pay mandatory health insurrance monthly fee which is either deducted from our wage or you have to pay it yourself if you're self-employed. But the fee is reasonably low (less than 14 % of a minimum wage) and it gives you a peace of mind, knowing that if something happens you'll be taken care of at no extra cost (for most procedures anyway).*",
            "Whenever I read about the US Healthcare System, it blows my mind.",
            "Ahh, America.  Where you can pay a grand for an in network ER hospital that assigns you an out of network doctor to tell you that \"We can't do anything about your arm pain\".\n\nProfit should never be involved with healthcare.  Burn the system to the ground.",
            "Helicopter to travel 3 miles, hahahaha.",
            "Fun fact (in the USA), air ambulances are covered under the NSA (No Surprises Act). This means that when you are being transported by an air ambulance in an emergency situation, the ambulance and your insurance are required to bill you in-network rates regardless of your network status. It is illegal otherwise. Ground-ambulance is not covered under NSA.",
            "I'm in a suburban area, with a city run fire department, but county run EMS. Paramedics and EMS vehicles and crews are stationed at the fire stations in my city (don't know about the rural areas of the county).\n\nOn the county EMS web site, buried deep in FAQs:\n\n\"<county>EMS balances bills for non-Medicare, Tricare, VA, Medicaid, and Worker's Compensation insurers. <county>EMS does not have contracts with private insurance companies; therefore we do not waive the unpaid portion of the bill. The patient is responsible for any copay, coinsurance, and deductible according to their insurance plan.\"\n\nIn another section, they say they don't waive anything or really do much to help with bills, except they'll file with your insurance and would *consider* a payment plan.\n\nI'm glad my insurance will cover EMS and hospitals that aren't in network (it's particularly shitty insurance that only covers my metro area, so I'm fucked if I need urgent care anywhere else in the state), but I still have a $3000 deductible to hit before they cover anything but PCP visits and medications. They also decline all hospital admissions unless the hospital gets authorization within 48 hours - I had a hospital visit the day my insurance went live, but didn't have the card yet, and the hospital had never heard of the insurance (even though the company offering the insurance... owns that hospital), so I have a massive bill from that.",
            "Reading stories related to health insurance in the USA always seem like a fever dream to people from outside the USA.",
            "Our insurance has a new thing where you have to try 3 stimulant ADHD medications before the one that my kid is on is covered. Just went into effect. She's been on it for a year and it's been a fucking journey to get one that works as well as this one does. They asked for a prior authorization. Doctor sent it. Then they sent her the \"medication challenge\" stating that she needed to submit documentation that she's tried 3 other drugs first. None of this was communicated to me until my kid was without medication for a week and the drug store (that has the same name as our drug coverage company, BTW) kept saying they were waiting on prior authorization. I called the insurance company and they told me about the drug challenge. I asked them to bypass it since it was covered the previous months and my daughter was now without medication because of a policy that turned them into doctors, affecting the way her brain works. The first person completely understood my perspective and transferred me to a rep above her.... who suggested I pay out of pocket. I asked her if she would pay $663 for a medication after paying for health insurance and having it covered for months prior. She told me it was a personal choice. I told her that it was a personal choice for her to deny the claim and asked her to give me someone else to talk to. She put me on a 1.5 hour hold, hoping I'd hang up. She checked in with me every 10 minutes asking if I \"still wanted to hold.\" The person who finally picked up did an emergency authorization. Doctor has to write a medical necessity letter to get it covered. I'm so done with US Healthcare.",
            ">the ambulance company (while owned by the in-network hospital) was out of network, so the bill was on me\n\nNothing about this sentence belongs in a civilised society made up of people that have working brains and what we like to call humanity.",
            "What part of the world do you live in where you get charged for an ambulance? That sounds downright dystopian.",
            "I don't understand.\n\nYou have to pay ?   For an emergency ambulance ?\n\nWhat the fuck ?  What insane country does this ?",
            "As a European reading Reddit, sometimes it feels like posts like these are all just instalments in one very long story where the villain is Non-Socialised Healthcare.",
            "For those folks not living in the US, yes our healthcare is absurd. Just the ambulance ride can be crazy expensive.\n\nThink about how much a procedure should cost. All the doctors, equipment, all that stuff. Imagine a very high price for that. The sort of price you would be yelling at someone about.\n\nNow add two zeroes. Maybe three.\n\nMedical debt is the number one cause of bankruptcy in the US.",
            "When my finance rolled her car with our 2yr old in it while I was across the country working, they had to take an ambulance to the hospital. It was about a 22 mile trip to the hospital and everyone involved knew it was going to be expensive so the emt that was transporting them told her, \" were taking your kid to the hospital, and you are just a passenger to be here with the kid\". Turns out by them transporting our kid \"only\" insurance covered the cost 100% instead of having to pay close to $2500.",
            "Imagine the next call to 911 “hi, I’m in anaphylactic shock, please send a helicopter ambulance as my insurance doesn’t cover the regular ambulance, thanks!”",
            "\"I was in anaphylactic shock, and then insurance charged me for ambulance ride\" actually sounds more like a horror story than a malicious compliance to begin with.",
            "ugh what a shithole country",
            "There are ambulance companies? As in, ambulances in the US are actually owned by private companies? I didn't think my option of American healthcare could get any lower.",
            "Many years ago my husband was life flighted for a misdiagnosed heart issue.  The helicopter company the hospital used was out of network.\n\nBlue Cross was unpleasant to work with.  She accidentally sent me internal documents.  My bill was reduced.\n\nOn the bright side, my husband was fine.  I got to ride in the helicopter with him.  Very expensive 11 minutes.",
            "I had an anaphylactic reaction last year and got two separate ambulance bills - One for the actual ambulance and one for the chase car, which was operated by a different agency. Both were out of network and my total bill was around $1600. I called up my insurer and told them that it was an emergency, I was suffocating and throwing up in a parking lot, and I'm not even the one who called the ambulance.\n\nThey reassessed the claim and my new responsibility was $250",
            "I think our US co-redditors elect clowns in their politics. I'm not surprised their healthcare system is a circus.",
            "'Merica!!",
            "Good for you giving a sanity check to the insurance company!!",
            "Its still bokers to me that this is an actual conversation that was had.\n\nAnd how I know exactly what country you're in.",
            "As someone from the UK, however overstressed and busy our National health service is, getting an ambulance merely involves lifting the phone with NO charges attached. And this is anywhere within the country - sorry you Americans!",
            "Here's a fun and exciting reason to hate \"insurance\" even more. I'm on Medicaid and it's literally illegal for me to see a doctor who doesn't take my brand of Medicaid, regardless of how I plan to pay for it. \n\nI'm trying to get a partial denture (something Medicaid doesn't cover any amount on) and I still can't see a good dentist. It would be considered fraud for me to go to someone else, even though I'm paying cash to the dentist who accepts my Medicaid.\n\nCoincidentally I've been waiting eight fucking months for the partial, been back and forth 8 or 9 times.",
            "I was in a bike accident .8 miles from the hospital and the ambulance cost 2300 for that ride \n\nI refused to pay because the accident wasn’t my fault. So the other insurance company offered me a settlement but I’d have to pay the ambulance myself \n\nI told them either include everything, hospital bills, ambulance, new bike, and a little extra or we can go to trial and I’ll get a fuck ton more \n\n2 weeks later I got a check for 33k and everything paid for",
            "I called hospital ambulance for my mom a few years ago. Turns out her insurance uses an ambulance company-22 miles away.\n\nThe hospital argued w/ insurance, 5 minutes away, heart patient, etc. Ins refused. Hospital donated the ambulance service to her finally.\n\nBC/BS sucks. Bunch of 3rd world idiots.",
            "if healthcare was not privatised, this \"in network\" issue wouldn't rob people like it currently does.",
            "This is the most depressing post ever. Ambulances and airlifts should be free.",
            "As an EMT who had a family member take a chopper ride, I think you scared the poo right out of 'em. That was a check mate. But they deserved it, by all means.",
            "My health insurance company, BC/BS of South Carolina, had the nerve to call me recently to offer some nonsense about a healthcare \"mentor\" to help me figure out any health needs I may have.  Then, after the mentor helps to determine what medical issues I need to address, they have a system in place to help me navigate any treatment I will need.  Sounds good on paper, right? Wrong!  They have a long history of abandoning/forcing them to quit due to insanely high rates for any of their subscribers who dare to have health issues.  \n\nThis is the same company who kicked me to the curb about 12 years ago.  Then I had zero health insurance for the next 7 years because they decided I was uninsurable.  I do not trust them as far as I could throw any of them and they want me to take on a ~~spy~~, er, I meant to say a mentor who will snoop into my personal life with the goal of finding out if I have any type of medical problem so they can force me to quit by raising my rates so high that I want to quit, thereby kicking me to the curb again??   I told the woman who called that they are absolutely insane if they think I would buddy up with them for any reason at all.  I told her not to call me again.",
            "It is absolutely ridiculous that ambulances aren't funded by taxes as an emergency service. You don't always have the luxury to say \"I have this insurance plan through this provider. Please send an ambulance that is covered and doesn't have someone from another company riding along so they can both profit.\"",
            "Fuck insurance companies. Every single one of them is Satan's taint.",
            "And Americans wonder why the rest of the world don't want to live there!",
            "USA is so fucked even charging patients for an ambulance ride",
            "American health car is predatory carnage. Makes Canada’s horrible service look competent. And that’s hard to do these days.",
            "It Imade me laugh to see you get one over your\nHealth insurance but at the same time really depressed because of how shitty americas healthcare is. Makes me appreciate my countries healthcare that covers ambulance services and other medical needs. Hell in my state if you live in the country outside of ambulance service they will fly a medical plane to you that is 100% free (I’m Australian fyi)",
            "Yeah, US healthcare and insurance is pathetic. Wife got in a car accident years ago, transported by ambulance. We have 4 ambulance companies that operate in our county, each has an EOA (Exclusive operating area). They bid for these and legally cannot operate outside of their area. Insurance claimed they only covered for 1 ambulance company, which happened to be owned by the mayor of the largest city in our county. The “covered” ambulance company cannot transport within 45 miles of where the accident was, and cannot operate in the area of the hospital where she was transported. It took a week of me fighting with them, and then pointing out that my insurance had a “$0 copay for emergency transport to ER” line in the policy. The hospital apparently didn’t like the pay they got from health insurance, they called and wanted our auto insurance info so they could bill that also. They never got that, told them they needed to deal with health insurance about that.",
            "Compared to Australia, what you Americans get is BS.\n\nIn qld Australia, the state government pays for ambo cover\n\nhttps://www.queenslandcountry.health/cover-options/ambulance-cover/#:~:text=All%20Queensland%20residents%20are%20automatically,live%20in%20our%20great%20State!",
            "Total win",
            "Murica....",
            "I have yet to have someone explain how health insurance contributes to health in the USA.  It's pretty clear that it's devolved to a game of \"just how fucked will people tolerate being and still pay premiums\"",
            "I was on hospital bed rest for a month before my c-section with my twins. Hospital policy was each baby has their own doctor and nurse IN THE OR. When we got the bill from just one of the doctors they weren’t in network even though the hospital was. Was I supposed to ask as they were being cut out of me? I did not get to choose who was there  and I did not have a choice on them being there. I also has a bill from the surgeon, anesthesiologist, and each doctor for the babies. It was $80,000 just for the stay PRE babies.",
            "It infuriates me that so many people take so much of our money to make all of our lives worse when we’re at our most vulnerable.\n\nIt’s inhumane.",
            "There is a law in Florida that if no in-network option is available, then out-of-network service must be covered as in-network by your health insurance. Found this out when there was no in-network option for the anesthesia for my conoloacopy. I got a $4k bill, submitted it to the insurance, and told them there was no in-network option. Bill was paid by them.",
            "Having to pay for an ambulance is wild.",
            "More than likely your insurance provider was actually just participating in illegal activities (claiming EMS are out of network) depending on what state you’re in.\n\nOnly a few left in the country allow this, they’re obviously mostly republican states.",
            "For profit healthcare and especially commercial\nHealth insurance are literally evil. It’s not that these corporations have no conscience, it’s that they willfully and by design let people get sick, suffer, and die so they can make more profit. \n\nThe only goal of any corporation in a capitalist society is profit.",
            "Oh man you guys need to consider what fucking company an ambulance comes from? I though the US health system was weird...it really is",
            "your little disclaimer is very cute, but you have literally zero rights over this content",
            "Well played!",
            "My God!  What an inspiring example of true freedom!",
            "So apart from 'us healthcare is horrible' I conclude starting an ambulance service is a good way to make bank.",
            "One of the few benefits of working for the government (as since we all know, pay is not on that list) is that my insurance is golden. They will not refuse to pay for anything, because if they piss off enough (or simply the wrong) people they lose that sweet government contract.",
            "I knew this was a story from the USA from the first sentence of the title.  No one else in the world is charged for calling an ambulance.  Fact",
            "Why the fuck American's tolerate this in/out of network BS will never make sense to me.",
            "It baffles me that people can pay for insurance and still not be covered",
            "My argument always is that I didn’t agree nor consent to said ambulance ride.",
            "From what I understand, most helicopters that aren’t part of a dedicated ambulance services can still respond to a call for emergency med-evac, and they can more or less name their price for the ride.\n\nI handle car insurance claims, and the rare few that involved such an airlift invoked a six figure bill for the ride alone",
            "God, I HATE American healthcare...",
            "Helicopter for my daughter was $42K. After insurance paid, it was $26K. It’s going to stay $26K because I can’t pay that. \n\nBankruptcy is literally my only option.",
            "Ambulance rides used to be covered via taxes like fire fighters. It changed under Reagan. I imagine that he and Rush and Pat Robertson have a good laugh about it between having red hot pokers jammed into orafaces.",
            "I'm in a major city and our company's insurance broker said no ambulances are in network. She said if it's not a true emergency, call an Uber. \n\nI think John Oliver had a show on this... Towns and cities underfunded their ambulances, so private equity went and bought them up. They still underfund them, but know there is no limit too what can be charged. And air ambulances are even worse. Helicopters are legitimately expensive to operate, but the fees are nowhere in line with that. But if you need it, what choice do you have?",
            "Makes me so happy to live in a place where being ill doesn't bankrupt you.",
            "This is really interesting to me because I live in a similar situation.  I have pancreatitis and had an attack and drove 45 min to the nearest emergency care.  From there they diagnosed I was in rough shape and had to find me a hospital room somewhere.  That somewhere ended up being an hour and a half away and a 10k dollar ambulance ride.  My mom had even asked would it be easier with a helicopter and they straight up told her we don't do that here.\n\nEdit: word",
            "The fuck is a 'network'?",
            "Thankfully Medicare paid the $1,700 bill for my roughly 2 mile ambulance ride to our local medical center in late December, 2019. I would have been so screwed if they hadn't because I'm on a fixed income.",
            "EMS billing rates are already set by schedule by EMS. There's some wiggle room by the agency but not much. \n\nYou can only bill if you transport. So when they go and say work a cardiac arrest but end up calling it, up until recently you couldn't bill. Now you can, and that 150 bucks or so doesn't even remotely cover the cost of time, paramedics and supplies.",
            "Why can't the network ambulance you happen to use send the bill to your in-network insurance company and vice versa? That way it most likely will be a zero sum game? \n\nThat way the USA can avoid the horrors of free universal healthcare but at the same time make sure that patients don't suffer becuase they can't find ambulance or hospitals in thir network?",
            "Glad I don't live in the US.",
            "Not sure if relevant but they changed the law against out of network \"balance-billing\".\n\nhttps://www.cms.gov/newsroom/fact-sheets/no-surprises-understand-your-rights-against-surprise-medical-bills\n\nEspecially useful for those ER visits when most physicians and some services are out of network!",
            "Thank you for the tip, I'll make sure to request a hot air balloon next time!",
            "I worked for a huge insurance company for almost 20byears and I the last 5vyears I was there I survived 11rounds cof layoffs as our profits increased ridiculously year after year. Even with a great job and salary I suffered massive depression and never felt secure despite being very good at my job and having 15vyearsxof stellar reviews even though I suffer from crushing ADHD that my medication wasn't covered by my insurance until id hit my max out of pocket for the year. Paying full rice for my meds every month didn't count towards my max out of pocket total. Constant stress and depression for over a decade while working 50+hours a week. Finally had a stroke. Career over.",
            "My hubster had a heart attack in January.  We finally received a bill from the fire department paramedics for over $3K---after the insurance paid their part!\n\nI called and (very politely) said that I thought more would have been covered, since he was admitted, medicated and surgery was performed.\n\nLess than two minutes of clickity clickity clackity on her keyboard and the nice lady at the other end said, \"We're using a check right now to pay in full.\"",
            "Build your own hospital. Patch Adams that shit. Just not the gf part.",
            "They would not have dispatched a helicopter to you at your request. A helicopter can only be requested by EMS or maybe PD/FD and they are most certainly not going to tie up resources just because you ask them. \n\nSource I’m EMS",
            "Excellent use of implied future malicious compliance, with fallout most satisfactory.\n\nAnd, it's nice to know that at least one insurance company is trainable.",
            "This situation should be covered under the No Surprises Act which went into effect on January 1st 2022. Basically, any service that is reasonably viewed as an \"emergency service\" HAS to be billed as in network, unless you were explicitly told in writing and in advance that it was out of network. So unless your ambulance driver pulled out a waiver and had you sign it while you were suffocating to death, you are off the hook. Even if you did sign such a waiver, I highly doubt it would hold up and be considered valid if you filed a complaint. \n\n\nHere are some useful links:\n\nhttps://www.cms.gov/newsroom/fact-sheets/no-surprises-understand-your-rights-against-surprise-medical-bills\n\nhttps://www.cms.gov/nosurprises\n\nhttps://www.cms.gov/nosurprises/policies-and-resources/overview-of-rules-fact-sheets\n\nhttps://www.cms.gov/medical-bill-rights",
            "USA healthcare is wild",
            "At least there are people at the insurance company who can think beyond their dumb rules.",
            "Shouldn't that have been covered under the \"No Surprises\" Act that went into effect on January?",
            "The US healthcare system is absolutely ridiculous. In network, out of network, why does it matter? I have never had a doctor send a test to anywhere that's not covered. Canada has its problems but healthcare costs are not one of them.",
            "The hassle you guys in america have to deal with in healthcare is insane. My country (Sweden) has been bashed a lot in American media ever since Bernie promoted the Scandinavian model.\n\nThey don't charge for ambulances here... ever. And hospital stay is the equivalent of 12 dollars a night.\n\nI sincerely hope the hospitals stops ripping you off don't prey on the sick. The next person might not be well enough to appeal that stuff and fight with insurance companies.",
            "You know your consent doesn’t matter, right? You don’t have ownership over what you post on Reddit.",
            "LOL omg this worked out brilliantly.",
            "Ha! Well there is a phone call that paid off!",
            "Nice, well played! 😂😂 You sure showed them the beauty of common sense.",
            "Aldo of u live in America the out of net work ambulance  I'll should be covered under the \"no surprises act\" basicly that law said if you were not able to chose who would preform a service (such as what ambulance company you would get in an emergency) then you can not be charged out of network rates",
            "Ambulance company? The ambulances are privatised in that hell hole too?",
            "I'll assume it's US.\n\nI'd love to understand HOW so so many of you are so convinced you live in the best country in the world. No one else is so sure of it.",
            "😂 I work for a dispatch center that can dispatch 911 calls, non emergent ambulance transports and helicopters.  Your response to them was perfect because that ambulance ride depending on the mileage was probably around $800 and the helicopter is usually around $50,000 at least for the state I live in.",
            "In the middle of the second major wave of covid in India, something like April 2021, my then partner's mother needed an ambulance in a very crowded but small town while we were in another city. It took me all of three minutes to not only find her one but have it at her doorstep in another five. They didn't want to take any money from her or the family member that managed to get to her because they had to rush to go save more people. This is in a country with some of the cheapest and most easily available high quality healthcare and excellent cheap insurance.\n\nI personally spend the equivalent of 90 usd a year for the equivalent of 30k usd which is a staggeringly unnecessary amount of insurance if I had to go and try and spend it at even the most exclusive high end hospitals with higher tier private rooms, in a major city like Delhi or Bombay.",
            "What does \"in network\" mean?",
            "My dad lived on the borderlands between the US and Mexico. He had a saw related accident while working.\nThe only emergency vehicle where he lived was a life flight helicopter that required ten grand pre paid which is about what my dad earned in a year, so that wasn’t an option. \nHis neighbor drove him 3 hours to the ER. \nIt was the only time they didn’t see a deputy or border patrol agent while driving. \n\nAmerican doesn’t have health care.",
            "You may have won the argument, but I guarantee your insurance will remove the helicopter in network option now that you brought it up.",
            "I got taken by ambulance (it wasn't my decision as I would have drove but the walk in clinic wouldn't let me due to some EKG reading which turned out to be nothing) and saw a bill over $1,000. Called the town and gave them my insurance info so only had a $100 co-payment.",
            "At least they showed some initiative and common sense once the silliness of the situation was pointed out to them.",
            "Shit like this is why the rest of the developed laughs when Americans crow about their super-duper democracy.",
            "[deleted]",
            "Good on you, fuck these evil \"health\" insurance companies",
            "That reminds me of an episode of *ER*: a doctor had prescribed a patient a certain medication, but they were told their insurance would only cover a version of it that required them being admitted to the hospital while it was administered (I no longer recall the medication or why that was supposedly necessary).  She gets on the phone with the insurance company and this happens...\n\nDoctor: \"It makes no sense!  You are spending eight *thousand*  to save eight *hundred!*\"\n\n(unheard conversation from insurance company)\n\nDoctor: \"Fine.  Fine!  I will admit Mr. Smith, and I look forward to charging your company for every damn cent I can!\"",
            "Not only that, but didn't they also pass a law recently that ALL services related to an in-network ER visit are considered in-network?\n\nI haven't looked at the intricacies of it tho.",
            "Wait, why does an ambulance service go through insurance?",
            "dont think you are out of the woods yet.  They may have paid at in network rates but its based around an \"allowed amount\" based on in network charges, not out of network charges. \n\nThat means the difference between the allowed amount and the billed amount from the ambulance company can be billed to you in the future.  Some places call this a \"write off amount\".  Its also known as balanced billing.  \n\nTypically the ambulance company will work with you on these but its not a guarantee.  \n\nSo keep an eye out for that.",
            "As relieved as I am, it's really, really gross that a significant part of my decision to move into my current house is because this municipality lets you pay about a buck 50 on your water bill in order to get free ambulance service if you ever need it.\n\nI guess that's not really free but you know what I mean.",
            "The ending made me laugh, that was gold",
            "As a European I just have to ask...\n\nWhat?!?!?",
            "I used to work for a psychologist, I did all her insurance filing and whatnot. We had to file all Medicare claims with paper claim forms because any computer claims “mysteriously” never appeared. So we filed via paper and made copies and kept insane records to verify. They will go over every line and do absolutely anything to deny a claim. One line required us to write “NONE” in it. If it was left blank, denied. There were other lines that had to be blank if the answer was none but would be denied if you wrote NONE or NA in it.",
            "I would of just taken an Uber",
            "we prefer you use nothing at all...\n\ndo you think we set it up this way by....accident?",
            "You are on the chopping block.",
            "Lmfao! Brilliant!!!!",
            ">he insurance representative said that the reason the ambulance wasn't covered was to encourage members to use in-network services. \n\nYou can thank [this](https://www.cms.gov/medical-bill-rights) for payers and their brand-specific \"networks\" being somewhat irrelevant to flying medical transport vendors. And this for [an excuse as to why rolling wee-yoo wagon fare meters remain unregulated.](https://www.nytimes.com/2020/12/22/upshot/ground-ambulances-left-off-surprise-medical-bill-law.html)",
            "The fact that this is a thing in the USA still blows my mind.",
            "The reason the air ambulances are in network and the ground ambulances are not is that the No Surprises Act, which went into effect last year, covers air ambulances but not ground ambulances.  If the air ambulances go out of network, they are barred by federal law from billing you for anything above what you would pay for an in-network ride.  If the ground ambulances go out of network, they can bill you for whatever they want.",
            "Jesus fucking christ I'm so glad I don't live In america",
            "I'm sure we have different insurance companies. When it was discovered that I had cancer, a cancer which wasn't covered by ANY in town in network options. I got to pick where I went. I went 500 miles away, the trip and all expenses paid after my deductable.",
            "This past April my wife became incapacitated and I had to call an ambulance for the 3.1 mile trip to the hospital. The bill came in to the tune of $1300.\n\nIf there had been a way for me to physically carry her to her car and drive her to the hospital, I would have. It would have been way faster and a whole lot cheaper.",
            "A 20 minute ride costs my insurance $70k.  I’m sure the 3 miles would have been $40k-$50k",
            "Had a buddy who used to be a flight medic on a helo, he said if they got called to respond, and the pilot touched the start button, the bill started at $7500, then it went up by $700-800/minute (could be off, but i do remember it was a massive number). This was back in 2010. I can only imagine how much it is nowadays.",
            "I've worked in health insurance for over 30 years. It's very rare that any ambulance provider is in-network. They refuse to contract with insurance carriers so they can balance bill YOU. That's not your insurance carrier's fault.  Insurance companies all have a maximum allowed amount for services called the Usual and Customary amount. If the provider's billed amount exceeds the U&C amount, you get to pay the difference.\n\n\nAs someone else already indicated, if you disagree with a claim payment, file a formal written appeal.\n\nMy foot broke off my leg several years ago, and I refused to go by ambulance because it would have cost 3k, and I have a high deductible health plan. 😆 🤣 😂",
            "Yeah it seems like most ambulance services for some reason aren't anybody's network. I went to an urgent care with a what I thought was a minor heart thing which is why I went to urgent Care. Within 5 minutes of me getting there they'd called an ambulance to take me to the heart hospital ER because they didn't like my EKG. Now the urgent care was in network and the heart hospital was in network but of course the ambulance wasn't. So initially it was denied. But on appeal they paid it. It seems like they always wanted to deny everything first. \n\nBtw the heart hospital found nothing wrong with my heart and sent me home later that day.  3 years later I'm back in the ER again and they still can't figure out what's wrong with my heart other than it can't keep rhythm.  Luckily there's drugs for that.  Without the meds it won't go 10 beats in a row without skipping at least one.",
            "Man your system is stuffed. Cost me nil Nada nothing for a ambulance, they are run by the state as a essential service....... but socialism and all the things America is afraid of...... the kicker free ambulances, free hospitals and my country still spends less per person of tax revenue on health then the grand ole USA with their horror \"user pays\" system.........",
            "This is why Merica is a shit country",
            "USA\n\nUSA\n\nUSA",
            "That is the way to deal with ......policies that are \"stooooo-pidddd\"",
            "The USA is the richest 3rd world country in the world.",
            ">Apparently, the ambulance company (while owned by the in-network hospital) was out of network, so the bill was on me.\n\nAh yes--the American healthcare system, everybody.\n\nThe industry's motto should really be \"we're so fucked\".",
            ">EDIT: I do NOT consent for this post to be shared, re-posted, uploaded, or used on ANY social media or news platform.\r  \n\r\n\nBad news.  Add your story to the massive mountain of Reddit content stolen by Cheezburger.\n\nhttps://cheezburger.com/21560581/my-bill-was-paid-in-full-clever-hospital-patient-uses-logic-and-sarcasm-to-pay-for-his-astronomical",
            "The edit on this Reddit post stating this story can't be used in any social media is super ironic.",
            "Awkward moment when I came to this post from another site\n\nIn case you wanna know op :https://amp.cheezburger.com/21560581/my-bill-was-paid-in-full-clever-hospital-patient-uses-logic-and-sarcasm-to-pay-for-his-astronomical"
        ]
    },
    {
        "post_id": "k48ksl",
        "author": "vark4731",
        "title": "Ex Wife Told Me To Remove All My Stuff From Her Storage Unit. So I Did",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k48ksl/ex_wife_told_me_to_remove_all_my_stuff_from_her/",
        "score": 16703,
        "num_comments": 619,
        "created_utc": 1606780136.0,
        "selftext": "My ex wife and I split because she cheated. So our separation was quite tumultuous (she still hasn’t apologized for the act of cheating and still denies it even though I know beyond any reasonable doubt that she did). I was incredibly hurt at the time and I’ll admit I wasn’t acting my best. But I still tried to treat her fairly. \n\n\nWhen she left we agreed that she would take over the payment on our car because she needed it for work. Our other car was totally paid off and I couldn’t afford the payment on the one that she drove. But I agreed to leave my name on the loan because her credit didn’t qualify (tbh I didn’t really have an alternative). I told her that she could keep it for as long as she made the payments. And that off she paid it off I would immediately sign her over the title. But if she started flaking on the payments I would have the car voluntarily repossessed. I also agreed to give her the washer and dryer on the condition that she take over the car payments. I had purchased the washer and dryer but had no use for them because I lived in an apartment at the time THIS IS IMPORTANT FOR LATER.\n\nWell, we inevitably got into a disagreement over the parenting of our children (I can’t remember exactly what it was about tbh). And she randomly showed up with the car. Handed me the keys, and said “have fun figuring out how to make the payments” (she knew I couldn’t afford them). And then ended with a “and get all your s*** out of MY storage unit” (we hadn’t finished untangling the mess of items in our jointly owned storage unit, but she wanted it done immediately because she was mad). \n\nSo I did what she asked. I went over that day to get my s*** out of OUR storage unit. While I was in there I saw the washer and dryer sitting in the corner and immediately remembered that I had only given them to her on the condition that she pay off the car. So I took them. I had absolutely 0 need for them at the time. But she had very specifically wanted MY S*** out of her storage unit. So who was I to argue?\n\nShe called me a day later screaming about it telling me that she had filed a police report. I just laughed knowing they wouldn’t do anything because it was my property. \n\nTHE STORY GETS BETTER: as it turns out she was just angry and actually wanted the car back. Well the day after she had dropped it off on me I got into a freak accident and totaled it (everyone was okay). So she ended up without a car and I never had to make a single payment on it. The universe wanted to maliciously comply with her demands.",
        "permalink": "/r/MaliciousCompliance/comments/k48ksl/ex_wife_told_me_to_remove_all_my_stuff_from_her/",
        "comments": [
            "Once watched my brother's ex throw a big frozen roast at him, was her last act of desperation as he and I moved his shit out of the house, damn roast bounced off the door and he caught it in stride and walked out with it as well (we ate it for dinner later that night back at his new place).",
            "When I saw the title I was hoping all the _boxes_ were yours so you left the storage unit with an absolutely chaotic pile of her stuff.",
            "If only the freak accident would have involved the washer and dryer somehow totalling the car.",
            "Reminds me of when I split with my ex and was on the hook for the payments on her car. She totalled it a week later. Cheque came to me since I had the house. Insurance company never sealed the envelope, cheque had both names on it. Was great to pay it off with $4K leftover. Still had to split that with her after but a 20K sword dangling over my head was gone.",
            "Perfect. She tried to make a big stink not thinking you would follow through. She lost her car and the washer/dryer because of her temper tantrum and she's the one to blame because you did everything but the book!",
            "Sounds like you were better off w/o her.  What happened with the car insurance payment?",
            "There’s a comedian that has a joke for divorces... Guy gets a divorce and the court finds in the wifes favor and she gets 70% of all the assets but he gets first choice for his 30%. So he decided to take his 30% but only if his 30% directly affected her 70%....he started by taking the oven, refrigerator, and dryer...doors. He wanted the big screen and the remote controls and power cords of all the electronics. She can have the truck, he just wanted the brakes.",
            "Totaling the car was a good idea.  Shhhh.",
            "You don’t have to make car payments if you totaled a car?\n\ngenuine question",
            "Sorry, but the only thing I can think is “those poor children”. I hope life has settled for you and them.",
            "Don't know if this is the correct way to use  this, but play stupid games, win stupid prizes.",
            "I like being the universe siding with people sometimes",
            "Did the freak accident involve a rather Wiley coyote a washer & dryer, an anvil, and or a piano falling from the sky and destroying the car?",
            "Not nearly as intense, but reminds me of when an ex and I broke up, she still had a bunch of stuff in my apartment.  She told me to just toss it all or donate it to Goodwill, but refused to listen to me when I tried to ask if she meant her Wacom tablet as well, which I knew she wanted, instead insulting me with something about not being able to listen.  \n\nSo, I followed her instructions and put it in my car ready to take to Goodwill.  She did remember last minute and asked if I still had her tablet, but I lied and said I had already dropped it off; I donated it the next day.",
            "“Freak accident” we are not your insurance company you don’t have to lie to us",
            "I understand where you're coming from and part of my gets significant satisfaction from the story. But TBH since you split custody 50/50 there's no way your kids don't suffer from having one parent lose access to a vehicle and washing facilities. So I'm mostly just sad for all of you right now.",
            "Did the insurance paid for the car?",
            "Karma",
            "I feel kinda bad for your kids.",
            "\"There was a freak accident on the 405 today. Three freaks in a car crashed into seven freaks in a van.\"\n\n-George Carlin",
            "Glad it turned out well for you. \n\nI let an ex use an air mattress right after our breakup cause he didn't have time to buy one before a planned trip and he never gave it back. Kept telling me, \"well let's meet and talk about things and you can have it back\" I did not want to talk- there was nothing to talk about, but he wouldn't give it back without that condition... I just blocked him, if he wants an almost 10yr old air mattress then so be it.",
            "The epitome of “cutting off your nose to spite your face.”\n\nLose lose for her.",
            "She wanted the car back after the agreement that if she flaked on the payment it would get repossessed, and then her stating she wouldn't be making them anymore?\n\nDoesn't seem like much ground to stand on to begin with, even without the accident.",
            "Who would have thought having a car accident was good karma?",
            "My snoopy ass wants to know how a parenting disagreement led her to return the car, as if the two were somehow related. \n\nImpulsive - cheating, keep the car, storage unit - the unexamined life of a cheater.  They burn themselves.",
            "I bet she's terrible at chess.",
            "Your ex sounds like a narcissistic POS, so I think you’re winning in the long run here, to be honest.  I feel sorry for your kids that have to deal with her, though.",
            "Not gonna lie, this story bummed me out. My parents had a bad split too.",
            "A friend told me about a divorce where ‘the half of everything’ meant taking a chainsaw to everything, including the house.",
            "[deleted]",
            "Ooh this is a good one.. I like this post",
            "“Freak accident”\n\nI’ve been there before man.",
            "OP: at the first sentence, let me save you about a year of anguish. \n\nShe. Will. Not. Apologize. \n\nEver. \n\nDon’t wait for it; move on and better your life. I say this because I flushed easily a year on this. A decent person apologizes and understands the damage they’ve done. But a decent person doesn’t cheat. Ergo, don’t wait on an apology, friendo.",
            "Love this. You’re definitely better off 😬",
            "Even mother nature and shit was on your side so they totaled your car.",
            "closest i ever got to that was when my ex (girlfriend) cheated (also no signed confession but overwhelming evidence) i moved out of our apartment and took all my stuff. including the Playstation she bought me. she didnt like that and said \"give me MY Playstation and ill give you the things you forgot\". she would never tell me what i left. which is weird. i think maybe it was a lie or that she thought i would value the Playstation more than what i left behind. but after 2 years id think she would know id value MY toenail clippers over our Playstation she bought for me that i rarely played on.",
            "Malicious and delicious. Nicely done",
            "I’m curious, can you tell the story of the car accident?",
            "Had an very elderly man in ICU experiencing chest pain which was thought to be a possible heart attack. While carefully evaluating him the attending physician, who supervised, noticed dark bruising over the center of his chest. After further investigation and inquiries, the man said his wife threw a can of dog food at him and it hit his chest. Chest X-ray showed broken ribs. A few minutes later the wife called on the phone checking on her husband. I told her he had broken ribs from the “dog food” incident. She said yes, that was very unfortunate. \nA couple young docs told he needed to defend himself and could use his cane against her. Even more strange, one elderly Italian nurse said “Poison her!”  I never looked at her quite the same.",
            "The car getting totalled is definitely the best part. Mu. Wah!",
            "A “freak” accident",
            "Here in the UK we have gap motor insurance which, if you write off your car in an accident, ensures the entire loan is paid off. \n\nGuy I worked with had a very similar situation with a girlfriend in which he was handed back the car with very expensive payments. He spent a day cursing it, and on the night must have realised about the gap insurance.\n\nThe next day he arrived to work on his bike and, through bouts of laughing, recounted to us how he had to “swerve to avoid a cat in the road” and wrapped the engine around a telegraph pole. \n\nHe was fine, luckily, just a bruised stomach from laughing so much at getting out of the payments and stiffing his former lover of her transport for work.",
            "If not for the fortuitous crashing of your car (whether or not providence was guided along, who can say? you certainly shouldnt : ) I was hoping that you were going to sell the washer and dryer and use the proceeds towards making car payments, would definitely tied it up neatly and used her words against her.",
            "I'm a little surprised she didn't try and tell the insurance agency that you caused the accident to get out of the payments",
            "How do the kids get around now? This is short sighted.",
            "Insurance Fraud",
            "[deleted]",
            "I’m so curious, how was he certain she had cheated?",
            "If she gets the police to actually give a crap to show up, I hope you'll update us! She should have known when you play stupid games, you win stupid prizes XD",
            "When the vehicle gets totalled , the bank doesnt lol. You still have payments, they will be looking alot closer if your going through a seperation and cannot make the payments at the time of the freak accident ...alot closer",
            "this is comedy at its finest. bitch got what she deserved. im proud of you dude",
            "On today's episode of Play Bitch Games, Win Bitch Prizes, iiiiiiiiiiiiiiiiiiiiiiiiiiiis! Your ex-wife!",
            "Everytime I read things like this where the ex is crazy, I'm always left wondering how ex husband's/wives can even ACT like that, do they just forget all the years of being in a relationship???? \n\n Like the audacity of her CHEATING on you and her being angry at you just makes no sense omfg\n\nGOOD FOR YOU",
            "Ah, Karma. Gotta love it. \n\nSometimes is quick to come to fruition, sometimes it takes years...",
            "This story seems so one sided - you forgot what the dispute with your kids was about?\n\nThis seems more vindictive revenge than malicious compliance.",
            "[deleted]",
            "[removed]",
            "[deleted]",
            "This is great.",
            "This is awesome!  I enjoyed reading it very much.",
            "Man, I’m sorry for the bs you dealt with but awesome story. My ex wife cheated too, still won’t admit it to me though I’ve heard it directly from others. She had me committed to a mental hospital and took literally everything from our 13 year relationship, left me with nothing but an air mattress.",
            "This sounds like a shit situation and everyone here is awful.",
            "My god, situations like this make me believe in karma more than anything else! I would say that’s a perfect dose of karma for her. So satisfying to read!",
            "best karma in the world  \nits almost as god was like \"this bitch wants to be a bitch, well ok but i can be a bitch to\"",
            "Why would you purposefully antagonize someone you need to co-parent with? Just sell the car.",
            "Looks like the universe pitched in on your MaliciousCompliance with the car thing. Glad you’re OK.",
            "As  sad as it is when relationships break down, sometimes the universe gives you a pat on the back for being the bigger person.\n\nI work for a site called Not Always Right and our readers really appreciate stories like these. Would it be okay with you if we shared your story on our site? Please let me know if that's cool?\n\nThanks again for the great story!",
            "OP: you are a sad individual.  Every relationship has 2 sides, that must work together.  IF (big if there) she cheated on you, there were reasons.  I wouldn't expect someone of your... um... 'quality' to admit you had any part in that though.",
            "Rentaspouse.com",
            "I wish you had taken your name of the car loan and never even given her anything.\n\nWhat’s the update? I hope she is struggling to make ends meet.",
            "[deleted]",
            "My buddy is going through this shit right now. His soon to be ex is a fucking nut case and thankfully is getting rail roaded by karma right now. So far she's \n\n1. Totalled a van\n2. Bought a new car then immediately hit a deer on the way to a booty call\n3. Blew the engine in said car on the way to a 2nd booty call (that ghosted her at 3am)\n4. Dropped a tranny in her brother's van while trying to run over my buddy\n5. Lost car #3 that my buddy bought for her after he caught her screwing a guy on his couch (she broke into his house while he was away)\n6. Charged with DV after she tried to wreck them with their 2yr old in the back seat\n\nBitches be crazy"
        ]
    },
    {
        "post_id": "b264gn",
        "author": "ludwig19",
        "title": "You want my insulin pump? You got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/b264gn/you_want_my_insulin_pump_you_got_it/",
        "score": 16689,
        "num_comments": 568,
        "created_utc": 1552835616.0,
        "selftext": "Excuse any errors, it's my first time posting.\n\nI'm a Type 1 diabetic, and I have an insulin pump. When I was in 6th grade my pump was wired, ie it had a tube that went from the pump, which looked a bit like a cell phone, to me. So, I have to take insulin after I eat and I had pretty explicitly told all of my teachers that I was diabetic, but this teacher was a bit thick and a stickler for the rules.  \n\nMy class had just gotten back to class after lunch and we were reading a book out loud. My pump beeped to remind me to take insulin after lunch, and I noticed Teacher give me a bit of a dirty look, but I ignored it and whipped out my pump to deliver insulin. \n\nTeacher: /u/ludwig19 stop texting in class! You know the rules. Please bring your \"phone\" to the front and report to detention (my middle school had a very strict no cell phones policy).\n\nI was about to protest, but realized this would be an excellent opportunity for some MC. \n\nSo, with a smug grin on my face, I walk up to the teacher with my pump in my hand, and it still LITERALLY attached to me, I hand her my pump. \n\nTeacher: what's this cord? Why do you have a chain for your cell phone. \n\nMe (deadpan stare): I'm a diabetic, and this is my insulin pump. \n\nAt this point, her face goes sheet white, and I unclip my pump from my body (a bit of a maneuver because it was on my arm and slightly difficult to reach) and walk out of the class before she can say anything and go directly to detention.  When I arrive I tell the detention officer I was sent for using electronics in class. Before I even finish, a student from my class walks in and says I can come back to class, and the teacher apologies profusely and never messes with me for beeping or using any device. ",
        "permalink": "/r/MaliciousCompliance/comments/b264gn/you_want_my_insulin_pump_you_got_it/",
        "comments": [
            "oh you're lucky you didn't get the true idiot teacher. My uncle is principal who had to deal with the aftermath of a teacher that decided to yank the pump off a student. ",
            "I had a kid in one of my classes with a pump. We got a sub and the sub tried to take it. Did not end well for the sub. ",
            "I wish I was as brave as you in 6th grade. I also have type 1 but was recently diagnosed so I went to the nurses whenever I needed to test or use my pump and teachers knew that I may leave in the middle of class if I needed to go. I left my music class once and then when I came back the teacher yelled at me for leaving and I was too scared to explain and when I finally tried he said he didn’t want to hear excuses, he made me sit in front of a mirror in the front of the classroom to “reflect” on my mistakes until the nurse came in because I forgot my pen to prick my finger. She blew up on the teacher when she saw what was happening. ",
            "Our five year old daughter is T1D, and we are insanely vigilant in advocating / protecting her.  We worry less about school (mainly because of how much time we've spent educating her teachers), but things like airports, etc. - sheesh, you can get some real power-hungry diptards who like to assert their authority",
            "When I was in high school, there was a girl with T1 with a pump like you describe. We had a substitute flip on her when she refused to relinquish it. He wouldn't listen to the rest of us about it and was sure we were fucking with him or trying to pull one over on him. Eventually, in the chaos (it was near physical with some of the guys forming a barricade around her) one of the kids calls up to the office and gets them to back us up.\n\nFucking absurd power-tripping dick.",
            "Which one did you have that looks like a phone and how long ago? My Medtronic still looks like a beeper.",
            "This happened to my friend Swanny in 7th grade. Ms Mac (who is a cunt) asked him for his phone which was actually his pump. When he refused she **PULLED ON IT** and it almost completely pulled out. He had to go to the nurse and call whoever you call to fix an insulin pump. ",
            "[deleted]",
            "My friend was once chewed out by the owner at work for wearing a phone on his belt on the job. The owner was a nice guy, he didn't try to take it or anything, he just took my friend aside and explained that it didn't fit with the image and was against policy, and he expected him to go put it away next chance he got.  \n\n\nMy friend, for some reason, never actually said anything. The owner came back, apologising profusely, after he'd told the (more knowledgeable) manager what he'd done.",
            "The most shocking thing is that [this is not the first story like that here](https://www.reddit.com/r/MaliciousCompliance/comments/aoj7e4/i_dont_care_if_it_is_tied_to_your_body/) \n",
            "Just out of morbid curiosity (and the one person I know irl with one of these is kinda shy and doesn't like questions):\n\nHow exactly are these \"wired in\"? Like, I know there's a tube, but where does it go exactly?",
            "Even better would have been \"It's my insulin pump... It's attached to me. So either you can have it, or I can go to detention... but no both\"\n\n&#x200B;\n\nAnd just stand there...",
            "I've read this basic story before... is this a repost or, horrifyingly, does this happen more than once??",
            "This has got to be the penultimate experience of like. Every diabetic who had a pump in school. I had the same issue ",
            "I had a teacher take away a snack (chips to be specific) that I was eating for a low. Which I was eating them between classes so it wasn’t like I was crunching on chips in class. He told me to go to the cafeteria and get an apple on his tab. So I went to the cafeteria... and got chips. ",
            "My T1 kid has been given dirty looks in class for giving herself insulin, or responding to texts from the nurse to tell her to have juice. She's been told once to stop. All teachers aware. It drives me crazy.",
            "Type 1 diabetic here as well. One time a teacher asked me if I could wait to leave class while my sugars were low because I would miss \" very important work\". We were in geography. I was at risk of passing out and potential death. Teacher wasn't real wise",
            "Something similar, yet the opposite, happened to me. For 2 weeks my school was run by teacher students in their last year. My class had 4 students teaching us and none of them knew I had diabetes. I just assumed they knew when they never reacted to my pump or tests.\nThe last day they brought cake and soda, none of which I could eat, and I told them so. They told me they thought I was playing with my tamagotchi and phone! In class! That fad had faded years ago and was not permitted in class! Jeebus. \n\nMy parents did not like that nobody told anybody at school about my diabetes. Kinda important. ",
            "Something similar happened to me during a practice (for an upcoming state-mandated) test. All phones are shut down and taken up and all backpacks are at the front of the class.  Gave the “all electronics must be shut down or you may face suspension if it goes off during testing” speech. Before the test begins, a phone starts beeping in a backpack. I start to lose my shit. “This is what I mean about shutting down your phone.  This is the kind of crap that will get you into trouble. Whose phone is that??!!”  A student quietly says, “That’s my heart monitor. If I move out of its range it goes off.”  Ugh. Felt like crap, so I apologized profusely. The kid was fine with it. This info would’ve been nice to know BEFORE testing begins. ",
            "I've done this before as a type one!! I laughed so hard when the teacher told me to put it back on. I didnt get detention though. \n\n\nI also had try to steal it thinking it was an ipod and screamed when insulin site tore out of my stomach and blood was covering it. He was taken the the office but he didnt get into serious trouble. Just detention/iss. \n\n\nPeople are stupid. ",
            "One of my best friends had a similar situatation but instead just quickly explained it was an insulin pump. Was also in the 6th grade. ",
            "I had a music teacher in intermediate school who was a bit nutty, and I had very recently been put on an insulin pump. I was sitting in class while we watched the sound of music, which she was treating like a very important lesson. She suddenly started yelling about how the person sitting in front of her needed to stop listening to music, now I was sitting in front of her but wasn’t listening to music so I sort of looked around for a second and went back to resting my head on my hand trying to remain conscious. Eventually she stopped complaining and went quiet again. According to my classmates she’d been yelling at me (I’m oblivious, genuinely couldn’t tell that) and my best guess is she thought I had an MP3 player or something and was hiding the earbud in my hand. She could’ve thought the tubing was the wire or something I guess, but I had literally just gotten the pump like a week prior so all my teachers had been sent alerts about it, meaning she didn’t read mine and if I had passed out or something in her class she wouldn’t have known what to do. I don’t know how people keep confusing insulin pumps with other devices, they don’t really look that much like an MP3 player or a phone or whatever. ",
            "My mother (also type 1) was one of the test cases for the pumps from medtronic. She now has one that also has a blood testing sensor that sends alarms to her phone when she's low. She lost the ability to \"feel\" when she's crashing so these pumps are amazing and life-changing little gadgets.",
            " \nTo be honest the teacher doesn’t seem too bad ",
            "I always announce to the class if they need to use any device in class to please show it to me during break so I don’t call them out for cell phone use.  Easy to do.",
            "This happens so often!! I've been thrown out of exams for checking my blood sugar 😂😂",
            "Hey c: fellow t1 here as well. I actually had kind of a similar story but without the MC. The country where I live (Austria) still has mandatory military service so once you turn 18 you are required to get a medical check up to see if you're suitable for service or not. It was a pretty crazy process but sometime during the process I had to measure my blood sugar with a glucometer that could also be easily mistaken for a cellphone. Mind there was a strict no cellphone policy..\nWhen I was done measuring my blood sugar I held the glucometer in my hand. Some time passes and a presumably very high ranking officer (was dressed completely differently than all other personnel and looked kinda fancy) comes out of his room, sees me holding my glucometer, goes up to me and says in a dead voice \"how much do you value your cellphone?\" as if he was going to destroy it on the spot. Being the little shit I am I replied, in the smuggest way:\" That ain't a cellphone, I'm a diabetic and need this device to survive\". That's when his face turned red and he simply just said \"Oh!\", turned around 180 and went back into his office. The remaining 3 hours I was there I never saw him leaving his office again :D \n\nToday I use a sensor thats actually connected to my phone via bluetooth. So never let you tell anything what to do or what not.\n\nTl;dr: similar situation at mandatory military health check up. Fancy military officer mistook glucometer for phone, told him otherwise, never saw him again that day.",
            "Sounds like she would have been cool with it right away had you just told her what it was instead of getting up to give it to her though. ",
            "I know this is kind of old but I had a friend who had diabetes and the teacher saw it and assumed it was a phone and tried to take it by grabbing it and he just fucking throat chopped her. He didn't get in any trouble except a good talking to.",
            "Why not just correct her? It seems like an honest mistake. From what you wrote, it’s not like the teacher was being mean or unfair. She thought you had a cellphone and followed school rules. All you had to do was correct her. You choosing not to correct her, walking to the front of the class to embarrass her, and then walking to detention as some sort of power moves makes YOU the dick. ",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/itoldyouiwassick] [You want my insulin pump? You got it!](https://www.reddit.com/r/IToldYouIWasSick/comments/b27pzm/you_want_my_insulin_pump_you_got_it/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Eyy we’re pump buddies!",
            "Omg as the mother of a 6yo with T1D, I cringed reading this... but also delighted at the thought of the opportunity to school them afterwards. Kudos to you for your fantastic MC!",
            "Wow I never really thought about how many other redditors were type 1 diabetics. I'm just wondering if you guys would recommend getting an insulin pump? I've been thinking about it for a while but the thought of having a tube stuck under my skin for a while is kind of off-putting.",
            "I have a pump too and had a similar situation when I was taking a class at a different School. While waiting in the the office for class to start I would use my pump to check the time. The secretary kept telling me I couldn't use a phone even after I explained to her what it was. After she was told it was a medical device that I had to have, I would always make a point of checking the time with it in front of her. At one point she told me \"you know there is a perfectly good atomic clock on the wall.\" I ignored her.",
            "One of my teachers told me a story where he was in the middle of giving a test and some kid starts talking on what seems to be a phone with his foot on the desk so he walks over to try to get the phone from the kid but then the kid says here you talk to him and shoves his foot in his face turns out it was an ankle monitor and his parole officer was talking to him through it",
            "I have a similar story from my junior high days, but the teacher took it upon herself to sneak up from behind and yank the “cell phone” out of my hand which obviously ripped my pump site off of my stomach. The amount of people who think pumps are cell phones are shocking ",
            "I'm a type 1 as well!! Had this happen so many times. They forced me to take my SATS in a room alone because my beeping might distract other students ",
            "This really makes me smile.  My daughter is a Type 2, but she is insulin dependant.  I would destroy any teacher that tried to stop her taking insulin,  getting water or going to tt th he ladies.  Thankfully,  she has a permanent pass and the school doesn't play.  ",
            "Well, at least she apologized profusely, and it was more a case of misunderstanding. Good on you for showing her the deal, though.",
            "Ngl, I have definitely tried to do something similar to teachers who are just awful to embarrass them....",
            "Kind of a dick move, tbh. I’m sure you could’ve just said something right away instead of making a scene with your teacher. ",
            "In the teachers defense, they probably deal with 100+ students making it difficult to remember everybody's special needs. Sending for you right away was a good thing.",
            "Dude, that's not MC. You didn't try to communicate well at any point. This is just a story of how you were an asshole that one time because your teacher made a reasonable mistake.",
            "I mean she just assumed it was a phone because there are probably a shitton of students with phones. She probably felt shit after realizing it wasnt a phone, so no need to make it even more awkward by getting tf out. Im a diabetic myself and got a fair share of comments and confusion by teachers colleagues and even cops, but it was always caused by them not knowing the instruments and confusing it for drugs or sth., but  a brief explaination always made them realize and the reaction was always kind and sometimes apologetic and at most followed by some questions about it. Had i reacted in a shitty manner like asking a cop to take away my insulin, it would've just made it worse for everyone involved.\n\n",
            "This exact same thing happened to me, in sixth grade and everything! It was so embarrassing. I also had a watch that went off to remind me to check my sugar.",
            "You should have collapsed in the hallway shaking. That really would of sent a message.",
            "She was probably worried about some type of ADA lawsuit too. ",
            "Wow I can’t believe someone actually had an almost identically experience as me. That’s crazy ",
            "That was a cool move my friend. ",
            "Pumps are great! I have the T-flex myself! They’ve got their own downside compared to Pens such as refilling,sites, and the bunch of things you need to maintain it. But when your out and about it’s easy ",
            "Lmao I have the T:Slim and pretty much everyone thinks it’s a cell phone, way worse than the old animus ",
            "[deleted]",
            "Why not just nicely explain that you are a diabetic, and it is an insulin pump?\n\nTeachers are overworked and cannot remember every minutiae of every student's lives. They have to act fast, and stay alert or else kids will totally take advantage of their weekness.\n\nThere is no need to be an asshole.\n\nAlso, who the fuck has detention during class time? That doesn't make any sense. ",
            "As a Type 1, I can relate to your story. A lot of people think my various devices are either phones or pagers. My 6th grade self would probably pull the same stunt as you. So no judgment. But nowadays it's just easier to politely explain that it's an insulin pump. Some people are genuinely fascinated by it.",
            "Really highlighting the malicious part of MC. They made a mistake, and you don't bother to attempt to explain. Instead you make a big display of it, immediately heading to detention without being told to as if to imply they had sent you there. Martyring yourself, you poor baby.\n\nThey made an honest mistake and instead of informing them you behaved dramatically. Which is understandable, a kid dealing with a condition, we can forgive some amount of shitty behavior. But that's what this is, shitty behavior. You manipulated them into feeling bad about a mistake. It's clear from the story the situation was over with after you said what it was, but instead you drag it out pretending like you were being punished.",
            "[removed]",
            "[deleted]",
            "[https://www.reddit.com/r/MaliciousCompliance/comments/aoj7e4/i\\_dont\\_care\\_if\\_it\\_is\\_tied\\_to\\_your\\_body/](https://www.reddit.com/r/MaliciousCompliance/comments/aoj7e4/i_dont_care_if_it_is_tied_to_your_body/)",
            "Sounds like an honest mistake. Not everyone knows about insulin pumps.",
            "r/iamatotalbadass",
            "Definitely would have yanked it off and handed the whole thing over... If it weren't expensive for new infusion sets.",
            "Good for you being a savage OP. As a T1d as well and someone with a pump like yours for 10 years now, it boggles my mind how many teachers, professors, professionals etc still don’t respect pumps. Like yeah my cellphone is both tethered to me and looks like a freaking pager. Ignorance about pumps from “people of authority” is the worst, especially in a situation like yours where you informed your teachers of your diabetes and your pump. Such BS from that teacher!",
            "My boss used to wear one and some dumb ass thought it was a pager and started fiddling with it.  People are so stupid",
            "Oh god. The beeping. It never ends does it, I understand it’s for my safety but I cringe whenever I hear any beep with a similar pitch ",
            "Or this kid actually did use his phone all the time",
            "Repost?",
            "I am pretty sure I have read this here before except at the end diabedik kid bleeds",
            "I searched for insulin pumps on google and I still don’t understand how they look like phones",
            "I’m a new diabetic and don’t have a pump. But what pump do you have that’s does on your arm?",
            "To your teacher's credit she apologised profusely. Usually in MC of this kind they refuse to \"lower\" themselves to admit being retarded",
            "Unrelated to the compliance: you should be bolusing 10-15 minutes before you eat. Young kids with Type 1 are taught to bolus after eating because they might not finish all their food, and you don't want them to go hypo. (I was just at a Medtronic training on Friday.)",
            "Maybe now you can use your phone and she will think it's your pump.",
            "Bravo!   \nMy story isn't quite as dramatic as an insulin pump but still definitely in the same vein of thinking.   \n\n\nSet the stage with a pirate-themed halloween dance. \n\nI'm taking pictures with my new ultra-slim fuji camera and the dancers are showing up without heads or ghost bodies.   \nQuite fun with a wrong setting of slow sync flash and looked really cool but could get creepy quick.\n\nA lady chides me for messing about on my phone instead of going out on the floor and having fun.   \nM'am, it's a camera, not a phone, I'm taking some pictures... ",
            "Back in the day it was no problem. This shit is retarded. \n\nStep one. Ask.\n\nStep two. Say okay.\n\nStep three. Appologies.\n\n",
            "Honestly, you are coming off as the dick here.\nIt seems like this was a simple misunderstanding and you escalated the situation without giving the teacher not only a chance to apologize but even a second to react.",
            "Idea: get a pump that's also a cell phone so if the school tries to take it you can sue. \nProfit.",
            "[deleted]"
        ]
    },
    {
        "post_id": "102acou",
        "author": "TheBreakUp2013",
        "title": "UPDATE: Short me $70,000 in Violation of our Written Agreement? It'll Cost you $1.8 million.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102acou/update_short_me_70000_in_violation_of_our_written/",
        "score": 16675,
        "num_comments": 706,
        "created_utc": 1672758217.0,
        "selftext": " **UPDATE:** The original post is below. Only this \"update\" paragraph is new.  There have been no negative consequences from the below, and no consequences (other than a few people DM'ing me with incorrect guesses). In fact, the remaining family members have reached out a time or two about some consulting work.  They have no clue. \n\n**DISCLAIMER:**\n\nThe names and some of the situations have been changed to protect the identities, but the dollars and general nature of the situation is completely true.\n\n**BACKGROUND:**\n\nA year out of school in the early-1990's, I procured a job as a business analyst for a large, family-owned tech company. This business was located in the booming heart of technology at the time and was very profitable. As tech took off over the next decade, the company thrived and remained family-owned. What was a rich family and company became exceedingly wealthy with a valuation/net worth in the high 9/low 10-figures.\n\nThe family that owned it was quite neurotic, very moody and had a reputation as very ruthless (greedy) when it came to financing, deal-making, employees, etc. I truly believe this is what held them back from ultimately becoming a household name as a company.\n\nAs I progressed in the company, I gained more and more face time with the owners. I worked on some projects directly with ownership that really paid off and gained me even greater access to their inner circle. Now, like a lot of people at the time and particularly those who worked in tech, I was heavily invested in tech stocks. I discussed some of my investments and gains with ownership as casual conversation, though investing had nothing to do with my role in the company.\n\nThat is until one day in late-1999 when the owner came to me and asked me if I would invest some of his personal money. He wanted me to take big risks to see if they would pay off using 1 million dollars of his personal money. I was a bit hesitant, but still being in my late-20's and wanting to prove myself, I said I would. I asked for a written agreement where they acknowledged this wasn't my role in the company, was a personal matter between the owner and me, and to document my compensation for this side arrangement (20% of all profits).\n\nAround this same time and by working in the industry I started to notice the weakness associated with a lot of tech companies. They just weren't living up to their hype and stock price and some seemed like they were starting to run out of money. I had no inside information, just a strong sense of which companies were struggling based on my work in the business.\n\nBased on this sense I started using both my money and the owners money to short tech companies just after the New Year in 2000. For anyone unfamiliar with shorting, it means if the value of a stock decreases, the value of the investment increases. I had a few long positions, but my overall position was very short.\n\nSince the owner wanted big risk and big reward, I used his money and obtained leverage or margin from the financial institution where I maintained both his and my trading accounts. The accounts were separate, but both under my name (again, I documented this and gained consent).\n\nWell, both my account and his suffered some moderate losses in the first two months of 2000 before the bubble began to burst and both accounts, but his in particular, began to skyrocket.\n\n**OWNERSHIP'S PETTINESS**\n\nIn June, the company began to suffer a downturn. We were still profitable, but since we provided tech services and products we were not immune to weakness in the broader market. I had not informed the owner of my short strategy. He came to me one day and asked how his money was doing, saying he suspected it was way down like the general market. To his surprise, I informed him that while we still had some money tied up in options (puts) and shorts, but based on the positions I had closed, there was $1.35 million in cash sitting in the account that belonged to him. Again, I still had a bunch of open positions which, if memory serves, were worth about a million on that date, but the positions I had closed had yielded $1.35 million in cash just sitting in his account (which was in my name).\n\nThe owner, either through ignorance or lack of attention, said \"Great, $1.35 million. Fantastic work in this down market. Will you please wire it to me?\" I responded that I would, but would be taking my 20% of the $350,000 profit, or $70,000, before wiring him the $280,000. I also reminded him I still had open positions that had yet to pay off or close, but I didn't state the amount. He, once again, appeared not to understand or comprehend the open positions statement, but instead totally focused on and became incensed about my rightful claim for $70,000. He went on and on about how times were tough, I should be grateful for a job, particularly at my young age, and the entire $350,000 was necessary for him and the company. I knew this wasn't true based on my position within the company. Worse, this was my first time personally experiencing the greedy and corrupt nature that served as the basis for ownership's reputation.\n\n**THE REVENGE**\n\nNow comes the revenge. Since, after two separate conversations, the owner didn't seem to grasp that the open positions would yield at least some income, and thus additional profit, I decided not to mention it again. I sent him back the entire $1.35 million and continued to manage the open positions to the best of my ability. And here's the kicker, the owner never brought it up again. He seemed to think the $1.35 million payment was the entire value of the account and never understood or remembered that open positions still existed. He never asked for records, tax documents or any time of audit or financials. Given the fact that he was dishonest with me, I didn't feel the need to disabuse him of that notion.\n\nUltimately, after a bit more net gain, I covered all of the shorts and exercised all of the options (puts in this case) for an additional $1.8 million. I worked for the company for 3 more years and owner never asked about it during my tenure, after I gave notice, or since. I know it's a bit crass and even shady af, but given his dishonesty with me over the $70,000, I felt justified in keeping the additional $1.8 million. I paid taxes on the gain (long term cap gain), and went on my way with a fantastic nest egg. Nobody has asked about it since and I have only told the story to a few people (and even then only after the statute of limitations passed).\n\nThe final ironic cherry on top of this sundae is that during my remaining 3 years I gained greater influence with ownership in position within the company because they considered me loyal for giving the $1.35 million back and not making too much of a stink about the $70,000 profit. Little did they know I got the better of them. The company eventually folded due to family disputes, but my understanding is that ownership walked away in very good financial position. They likely could have been a much better and greater company had they not practiced the same dishonesty that they showed me with their vendors, clients and employees.\n\nThanks for reading and hope you enjoyed.",
        "permalink": "/r/MaliciousCompliance/comments/102acou/update_short_me_70000_in_violation_of_our_written/",
        "comments": [
            "That’s why you don’t screw over people handling your money for you",
            "Bravo, and some jealousy too haha.\n\nBut for any others reading this, be careful. There are a lot of laws and rules around investment advising. I’m not sure if those would apply to this specific situation, but it’s always going to be murky and especially if it’s a personal or professional relationship.",
            "Morally I don't see an issue with this one. Could view it as a mutually dissolving the agreement based on delivering all closed positions, and giving them back the agreed upon commission.\n\nThe party who the funds belonged to was notified of the open options and chose not to pursue them. Once the commission was returned despite being legally owed, it's no longer OP's job to notify the other party.\n\nNow assuming the other party never mentions the open options, never asks about the account, there's no moral obligation to remind them of this. If the other party asks and the OP lies? Then I'd agree it's morally wrong. However the OP wasn't asked, told no lies, paid all the proper taxes. Eventually the funds are theirs with no legal recourse. That's on the other party for not asking.\n\n---\n\nLegally? Almost certainly illegal as all hell, but the statute of limitations has most likely passed by now. But I'm not a Lawyer so I wouldn't know for certain.",
            "Here is the original https://www.reddit.com/r/MaliciousCompliance/comments/mrdxnd/short_me_70000_in_violation_of_our_written/",
            "As noted in the top, this is a repost.  It’s a decent one if you haven’t seen before, if you have, there’s nothing new.",
            "So...if the account was in your name, weren't you on the hook for the $1.3 million you paid him? Wouldn't that have been taxed as short-term gain?",
            "Based on OP's posting history, I'm 99% sure this (and every other post) is just creative writing.\n\nLike, this didn't happen. Nobody has this many crazy stories that don't mesh with each other, and for that matter nobody does this at all without finding some way to get in legal trouble over it. 20 year old kids aren't embezzling millions, and they'd find a way to make the government suspicious if they were",
            "[removed]",
            "This is perfect example that money make money and that it's a lot easier for millionaire to make more money than for regular poor person from scratch.\n\nMillionaires don't work harder than regular people. They just have money which they invest and gain more money without much effort.\n\nSo even if this is not really malicious compliance, I stand behind OP.\n\nHe's just a regular person that got opportunity to make money like a millionaire. And why should I blame him he took it? Why should I take side of a greedy millionaire?\n\nOP just did what should be possible for everyone.\n\nMillionaires have so much money they don't even know what to do with it. While other people work in their companies for minimal wage.\n\nSo fuck them.\n\nThis poor millionaire gained less money than he should? Poor millionaire can't afford another yacht? Whatever. I don't pity him.",
            "Damn, I need to have you invest for me lol 😆 definitely learned to not short you the $70k lol",
            "You would have owed a lot of taxes on the 350k profit as you transferred the money out of the account in such a short period of time (I believe it's taxed as regular income in the first year, and as capital gains after one year). How did you pay income tax on 350k? Why would you put ANY of this in your name as that makes you liable for all taxes? This doesn't add up. I think OP is just making up some story for karma.\n\n\nEDIT: OP is 100% full of shit. He goes from late 30s, to early 40s, to mid 30s, father of a daughter, then child free by choice, then father of a son, works in tech industry, then works in real estate, then works in legal, etc. His post history is littered with contradicting information - and that's just the stuff that still visible. He's deleted a bunch of his old posts.\n\nSee some example contradictions below (and pay attention to the dates):\n\n[74 days ago OP is in his late 30s](https://freeimage.host/i/HAzpXdF)\n\n[This post is a bit over 80 days old and look at the next screenshot... ](https://freeimage.host/i/HAzylvn)\n\n[OP is suddenly in his early 40s](https://freeimage.host/i/HAzyw37)\n\n[229 days ago OP was childless by choice ](https://freeimage.host/i/HAzyvTb)\n\n[But 3 years ago his wife was getting creepy texts while pregnant with their baby ](https://freeimage.host/i/HAI9HFI)\n\n[3 years ago OP's wife delivered a baby boy ](https://freeimage.host/i/HAI9aMQ)\n\n[3 years ago OP was also 39? Guess he ages backwards and forwards ](https://freeimage.host/i/HAI9aMQ)\n\n[74 days ago this magical boy child of theirs was still somehow 3 years old ](https://freeimage.host/i/HAzpXdF)\n\nOP is a chronic bullshitter.",
            "[removed]",
            "How is this not embezzlement?  Or am I missing something?",
            "I remember reading this about an year ago.",
            "Only 3 days in the new year, that's a very early harvest from the karma farm",
            "[deleted]",
            "[removed]",
            "Nice. \n\nOnly a few revisions from when it was posted last year.\n\n\nFWIW, the older version was more interesting.",
            "Both of these people are pieces of shit.",
            "I want to believe the company involved was Fry’s Electronics.",
            "[removed]",
            "I’m not an attorney, but isn’t this exactly the definition of commingling as well as wire and securities fraud? \n\nAccording to Rule 10b-5, promulgated under Section 10(b) of the Exchange Act of 1934, individuals may be civilly liable if the plaintiff establishes the following elements: (1) that the individual misrepresented a material fact; (2) that the individual did so knowingly, i.e. scienter; (3) that the plaintiff relied on the individual’s material misrepresentation; and (4) that the plaintiff’s reliance on the material misrepresentation caused their loss. If the SEC establishes those elements, then the individual may be criminally liable.",
            "I've seen this exact post somewhere on Reddit within the past two years or so, I just can not remember exactly where.",
            "[deleted]",
            "Regardless of the truth of this, I don't see any malicious compliance.  You gave somebody $70,000 you didn't owe them and stole (regardless of whether you think it's fair or not) $1.8 million but those are two distinct transactions.  Maybe it's even legal depending on how your money and his money were aggregated when they went in, I don't know, but it doesn't matter for the purposes of being MC.  If you had told him you would distribute your $70,000 fee in exchange for the open positions and he had agreed because he needs all $350,000 to run the company that would be malicious compliance (and legal) but it doesn't seem like you did that.  You just turned over what you were owed and kept what he was owed.",
            "The original OP just embezzelled money, which isn't really malicious compliance.",
            "Just so you guys know this story is definitely not true.  If you go through OPs post history there is another post in aita that says he and his wife are in their late 30s.  OP says he was in his late 20s when this happened, meaning he would be in his late 40s or early 50s today.\n\nTLDR: op is lying",
            "Need you to convince HBO to add this as a major plot in S3 of Industry. Inject it into my veins.",
            "Don't you need a license to charge a fee for managing assets?",
            "Doesn’t statute of limitations begins with discovery?",
            "I feel like I've read this post before. OP, did you previously post this in a different subreddit?",
            "So OP is a common thief in a suit.",
            "I very much appreciate you taking the time to share this, and excellent composition.  There is a lot to take in and learn from.  Much appreciated.",
            "Legally, it’s questionable\nMorally, it’s justified\nPersonally, I’m jealous",
            "I feel like I read this post before.",
            "I waited with baited breath and then smiled. ‘The statute of limitations had passed.” \n\nWell done, sir. Well done.",
            "This whole story sounds familiar. I want to say I read an almost exactly the same story a few years ago here on Reddit.",
            "To all of you, OP didn’t steal from anyone. Because this didn’t happen to OP. This story has been here before.",
            "??? You had a written agreement on your portion of the profits. So instead you took advantage of his negligence and stole a massive amount of money from dude rather than just suing him or simply taking your money owed to you regardless of his bitching. Being an opportunist does not always mean your good at revenge. All you did was steal from someone. Who cares if they didn't wanna pay you, they had to legally",
            "[removed]",
            "This is an old story.",
            "Now everybody knows.",
            "Damn, that's amazing to have someone with that much money have such a little understanding of the stock market.  And to also, give you such free reign with ZERO oversight.  That's pretty remarkable.",
            "I read this story a year or two ago. I wonder if it's the same author.",
            "Not illegal, took your 20% and turned it into a sizable best egg",
            "This is an old post someone find the link. Word for word",
            "Good for you.  !!!!!!",
            "Nice.",
            "I don't understand this one bit. Could someone please enlighten me as if I am a five year old?",
            "TLDR?",
            " Owner received his $1M principle, plus $350K profit, owing OP $70K. All monies were in OP's name, agreement was in writing, Owner settled the agreement when receiving payment, OP made his $70K and then a lot more, so all is legit.",
            "Damn I wish you could sit me down and help\nMe get 1.8milllion on investments",
            "[removed]",
            "This makes for an interesting story, but your age doesn’t line up with the timelines of your other posts. You claimed you were in your 30s recently, making you a child when this event supposedly occurred.",
            "I've only told a couple people...and all of Reddit...",
            "So….you robbed the guy pretty much. You had complete control of the money. You could have wired the correct amount, keeping your 70K as per your contract. He couldn’t have stopped you. You made a choice to send him the full 1.35 and to keep 1.8 million of his money, that you deliberately kept him in the dark about. That is theft. \n\nI doubt the veracity of this story completely. Nobody who successfully steals 1.8 million dollars is going to be making Reddit posts about it. Ever.",
            "This was a delightful read",
            "Standing ovation for such pro revenge! \n\nIt also takes a lot of sophistication, savvy,and knowledge to short the market. \n\nBravo!",
            "I can’t say I blame you, but is this “malicious compliance”? First there’s some obsequious compliance, then some malicious non-compliance.",
            ">He went on and on about how times were tough, I should be grateful for a job, particularly at my young age,\n\nTranslation: I'm a crook.",
            "So do you believe your dishonesty was honorable/justified but theirs was dishonorable?",
            "> I asked for a written agreement \n\nI love that you documented your illegal broker activities. I would laugh my ass off when the judge threw out your case if you tried to present that agreement in court.\n\nMaybe you shouldn't post publicly about breaking US securities laws. (If not in US, basically all companies have the same laws.)",
            "that sounds like some major fraud",
            "You're my hero today!",
            "This isn't malicious compliance. It's theft. And also a great example of why you should never invest money through anything but a registered investment advisor.",
            "Great story, thank you .",
            "From a moral point of view in think you are off the hook. You told him he was up and he wanted to cash out. He legally owed you money and has never paid you. \n\nHe merely left you with some (potential) capital to cover the legal debt *and* the future interest charges for non-payment.",
            "I remember reading this before. Still a good story.",
            "Bro you an absolute gangster. Love this story. One of the best stories get-back I’ve read.",
            "This person and that company were made for each other.  Neither side has any integrity.",
            "You let their dishonesty and greed turn you into a thief.\nCongrats I guess :/",
            "This may be illegal, not even malicious compliance. But fuck em. Good Job OP.",
            "Theft.",
            "The FinCrimes analyst in me is going insane right now. Thanks.",
            "But… what about capital gains taxes?",
            "Yeah, mate.. That sounds like admission of fraud. Using their ignorance to profit is scummy\n\nKinda hope they figure out it's you and sue for the sum.\n\nEDIT: imagine if someone that gained profit from you trusting them with your money was bragging online about how they kept most of your profit because you \"didn't ask\". Do you ask for every penny of change separately when going to a shop?\n\nThis guy just flipped a dude and is bragging about getting away with fraud because 'they are bad people'",
            "Either this story is a lie, or you're a thief.  Either way, this isn't a good look for you, OP.",
            "Fuuuuuck yeeessssssss. 😂😂😂😂😂😂",
            "I dont understand ... did you steal this guys money?",
            "Pretty sure you committed some serious crimes.",
            "Account was in your name should have wired him the amount less the 20%",
            "ITT op admits to fraud",
            "So you stole money?  Nothing about this is malicious compliance.",
            "Thats fraud\n\nMf just made a claim of fraud for internet points",
            "Great story, interesting read for sure!",
            "Anyone else here from the unfinished tiktok video???",
            "I don’t know if I believe it but it was a fun read",
            "If this is real delete it immediately for your own safety",
            "Great work. Now take down Gates, Zuck, Apple, and Musk.",
            "Great fictional story. Nobody ever said it had to be true. Well written",
            "Getting 20% of the profits with 0% of the risk was already pretty huge and not very reasonable.",
            "OP: I stole 1.8 million dollars. I felt I was justified because I wasn't paid 70k. \n\nMe: Ok.",
            "And the IRS hasn't asked you where you got the original, unreported money?\n\nYeah, okay.  Totally real, OP.",
            "Please delete this. You basically admitted to fraud and provided a lot of details.",
            "The drawback to this is, they don't know. Revenge isn't really revenge unless the target knows about it.",
            "[removed]",
            "I don’t understand the morality gymnastics people are doing so it’s “not stealing or not amoral”. It is stealing and given that you kept $1.8M it is a terrible crime, one which you knew is bad and this waited to brag about. Why didn’t you just keep the $70K and return the rest? Now I know the sub to post in when I commit heinous crimes against my employers. I guess Pinocchio isn’t the only one without a conscience.",
            "You (OP) and your former employer both stole from each other. And according to your own words you both felt your own actions were justified. You appear to believe your actions were less wrong because they did it to you first, and because they forgot/didn't realize the money you stole existed, but you're both just dishonest thieves unless I'm missing something. In any event, your actions were malicious, but not \"compliant.\"\n\nSummary: Your story isn't one of malicious compliance,  you're just bragging about being a more underhanded thief than your boss who at least told you he wouldn't pay you what he owed you.",
            "[deleted]",
            "u/RepostSleuthBot",
            "Im calling bullshit. You would have had a tax bill for the entire set of profits.",
            "You need a tldr",
            "A common thief hopes for forgiveness. But thieves should be hanged.",
            "And....capitalist greed.  Thanks for giving birth to Elon.",
            "So you not only fucked a lot of companies with shorts but you also stole $1.8 million?  Man what a feel good story. You're garbage.",
            "Well I applaud your screwing over of a rich person, you becoming rich yourself is something I cannot agree with. You didn't become Robin Hood, you just got the bag and moved on. Eat the rich.",
            "You belong in prison",
            "This is great. More power to you. Very frustrating trying to explain to people when they simply can’t or won’t hear it (in this the case that boss man).",
            "Assess\nAs\nY\nẞyyWA",
            "Have you posted this before?",
            "Theoretically, since there was a written agreement for 20% fee, would OP be able to go to court and win?",
            "Did I first see this story posted in the comments section of The Register?",
            "This is a copy-pasta, I'm pretty sure I've read this story in the past...",
            "This has been posted before.",
            "I swear I read this almost last year"
        ]
    },
    {
        "post_id": "a90ium",
        "author": "-Pesticide-",
        "title": "You want your fries now? OK!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a90ium/you_want_your_fries_now_ok/",
        "score": 16644,
        "num_comments": 383,
        "created_utc": 1545615560.0,
        "selftext": "I work at a french fry stand during my free time to earn some extra money. Last week, we had this customer that was REALLY impatient. There was an old lady who paid before her. She wanted her fries to be first. I said \"Sorry can't do that\". She said she's going to be late for something. As I cook her fries, she asked me how much time does she have to wait to cook. I said 6 minutes. Only two minutes in, she asked me again! And at 3 minutes she wanted the fries. I told her that it's not yet cooked and is still cold inside. She said she didn't care. I told her to give me the money first. She gave the money, I gave the fries still cold inside. She took a couple of fries and ate them at the same time. She spat the fries into the little paper bag the fries come with. She wanted a refund I said \"Sorry can't do that\".\n\nTL;DR: Impatient lady cant wait for her fries to cook. Gave it to her it was still cold inside.",
        "permalink": "/r/MaliciousCompliance/comments/a90ium/you_want_your_fries_now_ok/",
        "comments": [
            "Give me a refund because you gave me exactly what I asked for! \n\nClassic ",
            "Exactly the content that belongs on this sub ",
            " What did the lady think was going to happen? You cut the required cook time by half and chances are it won’t taste great. ",
            "The classic “I’m clearly an expert at your job even though I have no experience doing your job”",
            "Revenge served cold with a side of fries",
            "Impatient lady: fries! gimme!\n\nOP: They're still cold\n\nIL: I want fries!! Gimme!\n\nOP: Pay up\n\nIL eats fries, spits\n\nIL: Refund! Gimme!\n\nOP: No\n\n[IL's face.](http://imgur.com/gallery/BU8YJ03)",
            "I used to work at a glorified snack bar, which is a snack bar with a deep fryer and a grill. At the place I worked, Fridays were insanely slow; we usually served 250 an hour Monday-Thursday but on Fridays we served 50 *all day*. Just me and the manager on duty. Him in the back doing manager stuff, me out front helping the occasional customer.\n\nOn Fridays, a particular lady would come through, and she was always super picky about her food. What's in this, how long does it take, wheres it come from, how much is it, can I get it for less than that, etc. It usually didn't bother me because it was so slow on Fridays, I'd just humor her and give her food and she'd be on her way. She was never particularly rude, just 20 questions about the food. She rarely complained about the food once she got it.\n\nOne day she came in, and she asked for fresh fries. \"No problem, let me go drop some for you.\" She asked me if I was absolutely sure she was getting fresh fries. Usually she wasnt *this* picky. We'd been doing this circus act every Friday for a couple years at that point. *She knew she'd be getting fresh fries*. But, to humor her, I open a new big bag of fries, and put an order's worth into the fryer right in front of her. The fryer is easily visible from where customers wait at the counter - more visible than your local Five Guys, for instance.\n\nA few minutes goes by and I walk over to the fryer. I grab a tub for the fries and pull the fries up. She watches me do this from the counter where customers wait, and as the fries are still sizzling as they make contact with air, she asks\n\n\"Are those fries fresh?!\"\n\nI'm flabbergasted. I'm never even snippy with customers ever. But, I do this Seinfeld head jerky thing and I'm like \"are you freaking serious-you literally watched me pull them out of the grease!'\n\nShe throws her hands up and goes \"Okay, okay, I was just being sure.\" Gave her her fries, she paid, and that was the end of it.\n\nYour story made that memory pop up in my head. Not MC but, just a funny similar story.",
            "\"GIVE ME MY FRIES NOW\"\n\n\"they're going to be cold\"\n\n\"I DON'T CARE ANYMORE JUST GIVE ME MY FRIES\"\n\n\"uhh okay here you go they are cold though...\"\n\n\"HEY THESE FRIES ARE COLD ARE YOU SERIOUS?\"\n\nWhy can't we shoot these people?",
            "I love you",
            "I mean, whats up with your fries that people are gonna be late for appointments? Are they that good? \n\n\"I gotta job interview in 15 minutes, *but I just gotta get some fries fist!\"*",
            ">I told her to give me the money first.\n\nGood man.",
            "Women thought she’d like flaccid fries. No one likes those!",
            "Baby its cold inside?",
            "I worked/still do at a mcd's and I've done this once. It's wild and amazing ",
            "Omfg.  Like how about getting fries *after* your damn appointment if you’re in that much of a hurry?",
            "French fry stand? I’m intrigued. Does the stand only sell French fries? Are there toppings?",
            "I would say r/DeliciousCompliance, but this is about an untasty experience.",
            "I worked as a line cook for many years.  Last place I worked at was a family owned place where everything was cooked and prepared to order.  It was the kind of place that would honor any food request as long as we had the ingredients to make it.  \n\nPeople would ask for the most ridiculous shit.  When someone requested something we knew was going to be horrible, we would have the server go confirm the order and if the customer confirmed it, the server would tell them, \"The kitchen staff says they can make it, but they advise against it, because it will not be good.\"  If the customer insists, they were then told, \"Ok, we'll make it for you, but if you don't like it, we will not be removing it from your bill.\"  \n\nIt was fun when they didn't like what they insisted we make them. ",
            "I have the same story with chicken fingers and I did not comply.  I get the order and they are immediately in the deep fryer.  Nothing to do but wait 6-7 min.\n\nThen I get notified that the customer wants them fast.  Good thing they are cooking already.   I pour some frozen fries into a fryer basket to wait.  Fries take 2-3 min, so I grab a drink. \n\nCustomer sees me grabbing a drink and \"asks\" \"WHAT ARE YOU DOING OUT HERE??? YOU SHOULD BE IN THE KITCHEN MAKING MY FOOD!!! **I'M IN A RUSH!!!**\"\n\nI inform them what I just told you.\n\nThey go and peek through the window at the fryer. \"THEY LOOK DONE! GO AND GET THEM!!!\"\n\nI inform them that there is no way they are done yet; they are probably still frozen in the center, let alone cooked.  They will float when they are cooked.  I go into the kitchen and drop the fries into the fryer. \n\nThey are frantically leaning on the counter and jumping like a gorilla. Yelling \"THEY ARE FLOATING!!! GIVE ME MY FOOD!!! I HAVE TO GO!!!\"\n\nI look into the fryer and see that they are not floating.   I shake the fryer baskets.  No floating. I mention it to the customer, but they can't hear me.  I don't want to shout, so I walk back out front.  This lying asshole is really pissing me off by now.  I get that he is in a rush, but shouting and his tone is just rude, but him lying that he can see his chicken fingers floating makes my teenage minimum wage smartass a little malicious.   He's still yelling from where he was looking into the kitchen. I'm 20 feet away.\n\nHe's ranting, shouting, and still jumping and flailing around comically. Not only do I not want to shout like him, but I decided to do the opposite.   I spoke slowly, deadpan, and very very quietly.   I maintained eye contact and he could see my lips moving,  but he just couldn't hear me saying I can't send out raw chicken over his shouting and 20 feet.  After several \"WHAT?\"s, he lowers his voice to try to hear me.\n\nNo good, I'm still too quiet and too far away.  I repeat myself as necessary, but he can't hear me.  He's getting really pissed off; his face is red and I swear I can see blood vessels popping out of his head and neck.  He is torn between watching his food cook while yelling or quietly come to hear what I'm saying.   Eventually he relents and comes closer to me, a little at a time.   I think he knows what I'm doing, but he also clearly thinks I'm incompetent.   I continue,  getting even quieter each time he gets closer until he is leaning over the counter and I'm almost whispering, still leaning against the wall so he can't get very close.  He's awkwardly leaning over the counter and I finally speak loud enough for him to hear me.  \"I can't send out raw chicken.\"  No emotion.\n\nI walk back into the kitchen and watch him pace and huff and puff through the window.  When his fingers are ready, I wait 15 extra seconds, smiling at him like that daft punk album cover as I deliberately waste his time.  I serve up the food into the window and wave at him cheerfully, encouraging him to get his food quickly because he doesn't want to be late.  He can't take his food yet because the front staff need to pass it to him.\n\nHe fucking loses it.  Shouting at me, shouting at the front staff to pass him his food (the front staff are helping another customer), flailing around, pacing and jumping more than before.  I started to wonder if I pushed him too far.  Would he resort to assault or vandalism? The front staff give him his food and I watch closely in case he snaps.  He grabs his food and shouts a little bit I couldn't hear.  He wants to berate us more than he wants to be on time.  I tell him to hurry so he won't be late as sweet and over-the-top cheerfully as I can.  He storms off.\n\nThe next few customers asked what his problem was. The customer after him explained to them.  They laughed loudly and he looked over his shoulder as he walked away.\n\nBeing in a rush is fine; I'll help as best as  I can.  I could send out a cold sandwich and salad/soup in less than a minute if asked nicely.  I can't change the laws of thermodynamics though.  Acting like an asshole can result in getting treated like an asshole. \n\n",
            "“they’re still cold inside”\n\n“don’t care, give them to me NOW”\n\n*gives fries*\n\n“WTF THEY’RE COLD INSIDE”",
            "Wait by fries do you mean french fries? And if so there are actually places that dedicate themselves to it? Please someone point me to a place thats like this, I need it in my life.",
            "\"Baby, they're cold inside.\"\n\n^^^Sorry.",
            "This post has everything, malicious compliance, justice served and you did it in less than a 20,000 word novel",
            "just an observation, not a single upvote for 77 posts",
            "God I hate customers. This is a daily exchange at my store:\n\n\"Okay and it will be ready in 45 to an hour.\"\n\nFifteen minutes pass and customer enters screaming about their food and how we told them it would be ready now even though we never tell a customer it will take less than 30 for this exact reason. ",
            "She paid for what she wanted. I see no problem in that",
            "> She said she's going to be late for something\n\nI had a customer like this when I was a barista. Would complain when there was a long line in the morning because she was going to be late.\n\nI never told her this (because I liked having a job) but I always wanted to say \"What a shame that you couldn't wake up earlier\"",
            "REALLY IMPORTANT customer eating fries from a fry stand right before an IMPORTANT meeting because REALLY IMPORTANT people do that kind of sh!t all the time.  LOL.  Good on you for getting the money first.",
            "They were still probably better than reheated fries.",
            "Who doesn’t like their fries al dente? /s",
            ">a french fry stand  \n  \nWhat the hell is that? Are we talking a fast food place that got rid of  all the food except for french fries?",
            "\"Baby, they're cold... inside!\"",
            "\"first time poster go easy on me\" why do people say this? What do they think is going to happen???",
            "That's what she gets for being a jerk",
            "bitch where in life are you going that you can't wait for fries?",
            "r/Deliciouscompliance",
            "That is one stupid lady",
            "Terrible business practise to cook the food before they pay. Almost everywhere I go (in the UK) it's always pay first then they start cooking (fast food obviously, McDonalds, fish and chips, fries).",
            "r/undeliciouscompliance",
            "And now you all know what it's like working in BOH with servers\n\nEdit: \"How much longer on that well done steak!?!?\"",
            "perfect!  \nI do wonder if there are health code violations though - also not caring if there is",
            "welcome to r/maliciouscompliance, where exactly this is whats supposed to be here. GG m8!",
            "Six minutes to cook fries? Assuming you're frying them, they must be pretty thick.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/deliciouscompliance] [A not-so-delicious compliance](https://www.reddit.com/r/deliciouscompliance/comments/a932ui/a_notsodelicious_compliance/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Is it that Heavens Angels French Fry place? That went belly up 3 to 6 mo after it opened at themall. The bored lady was still at Dippin Dots.",
            "She literally asked for them cold then demanded a refund because they were cold.",
            "r/TalesFromYourServer",
            "She must be so much fun to live/work with if she doesn't understand that you can't always get everything you want (I know many people like this).",
            "Just the fact that you work at fry stand is the best thing about this. I love French fries. \n\nP.S.  that lady is a douche ",
            "You can have it now, or you can it cooked. Which is it?  \n\nAs a GM I feel comfortable enough asking that question to guests who re-ordered something else because they didn’t like the first whatever. \n\nWe made a mistake and under/over cooked that?  No prob, right on it. \n\nYou ordered chicken fingers and didn’t like them so you re-ordered a well done steak and have to be to a movie in 5 minutes?  Not our problem. \n\nHow do you not like chicken fingers anyway?",
            "I secretly really love still frozen french fries.",
            "Just curious: if the old lady had consented would you have given the impatient woman her fries? If I were the first person I would've let the impatient person have my fries unless I was in a major rush...",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "kfobft",
        "author": "RumBunBun",
        "title": "Boss doesn't want my help unless she specifically asks for it",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kfobft/boss_doesnt_want_my_help_unless_she_specifically/",
        "score": 16625,
        "num_comments": 227,
        "created_utc": 1608308928.0,
        "selftext": "A few years ago I took a customer service job and my boss, Shirley, was the laziest, snarkiest person I've ever worked around.  She spent her day on social media and personal calls while her in-box grew. Shirley's boss rarely came around and was happy as long as Shirley didn't bring any problems to her, so of course, Shirley didn't; she buried any problems.\n\nAfter I'd been there a couple weeks, Shirley was showing us some new procedure.  I don't even remember what it was, but it was something I'd done in a previous position and there was a much easier way of doing it.  I asked if I could make a suggestion.  Shirley instantly shot it down.  \"No. I don't want suggestions or help unless I specifically ask for them. Just do what I tell you to do.\"  It was embarrassing and demeaning to say the least.\n\nWhen Shirley went to lunch, the gal who had been training me asked me what I was going to suggest and I showed her.  She agreed it was much more efficient and she showed the others.  She told me they just worked around Shirley. They all disliked her and just waited until she was away to discuss problems and came up with solutions and left Shirley out of it.\n\nA year later, the lady who trained me retired.  Before she left, she showed me how to run phone statistic reports...they showed how many calls each rep took, how long the calls lasted, how many rings before each call was answered; typical call center stuff.  She asked me to take over putting together a report including email statistics each month to send to the ecommerce manager.  Shirley was to give me the email statistics.\n\nAfter the first month, I emailed Shirley asking for the email stats.  She ignored it.  After the second month, same thing.  I decided if it wasn't important to her, then I just wouldn't do it.  I figured if questioned, I would show the emails I sent Shirley reminding her so my butt would be covered.  Nothing ever came of it.\n\nSo things went for the next couple of years. Then came the announcement that Shirley's boss had been fired and while they searched for a replacement, Shirley would be reporting to the president of the company. She was terrified. He had her jumping through hoops. He had her submitting reports to him, attending meetings, answering questions.  She returned from one meeting frantic. She told the senior rep Angela that he wanted her to bring him phone statistics that afternoon and she had no idea where to get them.  Hmmm... I knew.  Angela knew I knew.  While Shirley sat at her desk trying to figure what to do, Angela came to me and said, \"You aren't going to tell her, right?\" I said, \"Well, she once told me she didn't want my help unless she specifically asked for it, right?  Well, she hasn't specifically asked me.\"  We grinned at each other.\n\nShirley went to her meeting empty handed.  She ended up getting fired a week or so later.  I don't think it was because she didn't have the phone statistics, but that was probably one of many things that made it apparent that she didn't know what she was doing.\n\nEdit: Thank you all for your comments and awards. Happy Holidays to all!",
        "permalink": "/r/MaliciousCompliance/comments/kfobft/boss_doesnt_want_my_help_unless_she_specifically/",
        "comments": [
            "A fine example of \"Silence is Golden\". I hope you got a nicer person as a replacement for Shirley.",
            "[deleted]",
            "My friend “Rita” once has a useless manager be assigned above her. She was removed from a great manager with 5 people and given to this useless manager - mostly because having people actually *under* you means you get paid more - and the manager was a friend of a big boss in the company - which is why the manager was hired. \n\nShe would micromanage “Rita” while taking her away from tasks to gab about her camping trips and BF. “Rita” hated these superfluous meetings and she was always getting chewed out because the manager *also* wanted to look like she was working.\n\nWell... one day the manager called “Rita” into the office and started gabbing and showing pictures of her camping trip. Then she accidentally swiped to a photo of her BF’s erect penis.\n\nManager was like “oops” and “Rita” ran to HR and told them what happened. She asked to have a representative of HR at all future meetings with this manager OR for her to be re-assigned back to the good manager.\n\nThe useless manager was given two strikes, had to attend a sensitivity class, and had my friend “Rita” removed from being under her.\n\n“Rita” went back to her good manager.\n\nUseless manager got downsized shortly thereafter.\n\nEdit: gave “R” a name",
            "My worst boss was in a customer service job. One time I asked her what she wanted me to do and so I did it and then she proceeded to ask me why I had been undermining her. Uhhh what. I did exactly what you had just told me to do 10 minutes ago.\n\nOne time I forgot to clock out and instead of asking me about it she instantly said, why did you leave early yesterday... I was like.... I didn't, I was here until 4:30. Here are my outgoing emails and call log to prove it. She then proceeded to tell me she thought I had left since I hadn't clocked out. Like I was trying to deceive her or something.\n\nPeople continually left under her management and eventually they called all of the csrs into the ceo's office to see how we all felt about her and her management style. They apparently after 15 years (and new upper management) got tired of having to hire new csrs every 4 months when everybody inevitably would quit.\n\nI now run the department so maybe she just felt threatened by me, who knows.",
            "Gotta love it when you can use their own words as a shovel, then hand them that shovel and watch them dig themselves into a hole that they can't get out of. She should've never been in that position in the first place.",
            "Don’t call me Shirley!",
            "Sometimes you have to step aside and let someone get hoisted on their own petard.",
            "Sounds like Shirley succumbed to the Peter Principle.  Glad your MC could help her on her way.",
            "I don't understand these managers that want to be absentee.....and in control. Like, pick one.\n\nI've had good absentee (for good and bad reasons) bosses before.  Basically \"handle it, i trust you, and you officially have my delegated authority in writing\".\n\nIn the rare cases its needed they back you up or reply \"Approved\" to an email without reading it.  (And they trust you not to ask or warn you if they shouldn't rubber stamp it.)\n\nThat can actually work well...especially when they make sure you later get their job whenever possible.  Combining it with \"I don't want suggestions or help\" and being an asshat is...the opposite.",
            "Here's the extra rope you wanted.  Try not to hang yourse...oh...",
            "Sad fact was she’d still be ruining your day if it wasn’t for her boss leaving",
            "While she was packing her office up you should have told her you knew exactly what she was looking for but waited for her to specifically ask you for them",
            "\"You get what you fucking deserve!\"",
            "It makes me so angry people can get away with it for years. Like so I just have to lie to get a better job? I don’t understand. My dads boss didn’t put out a single report in 4 years yet was required to do one monthly. Never finished a single project and stole code and lied that she knew how to program yet took 4 YEARS to get rid of her?",
            "I once had a manager named Shirley, also.  All my Shirley did was smoke cigarettes, drunk coffee, and play solitaire on her computer...",
            "Surely Shirley needed to go.",
            "Nice!",
            "A boss like that can go hang.  I wouldn't have volunteered anything to her either, as it wouldn't help the job but just protect Shirley's ass.",
            "might be considered slightly petty but in this case, no f is given as manglement is in full force.",
            "Shirley you can’t be serious",
            "I mean, surely you can’t be serious?",
            "it's nice to see when someone's laziness finally catches up to them",
            "I once had to do a report to the board of directors for the hospital I worked at. Once a month I'd let them know how we were hitting targets in Radiology, with any patients who missed the NHS 6 week turn around highlighted in red. Having run my boss out by being a gigantic arsehole, the report now went to the head of the department prior to the directors. This gave us a week to get the patients in red seen, and make us look better.\n\nSo I emailed the head of department the report. Nothing. Sent a follow up email. Nothing. I received a chase email from the directors and thought there was no way I was being blamed for late work, so sent the report, red lines and all. The head of department stormed in our office after what I assume was a thorough bollocking and demanded to know why I hadn't sent the report to him. I replied I had, twice. He then snootily said something about being far too important and busy to read my emails. Oh well, that's a shame, enjoy getting bollocked because I'm not delaying the report again. Funnily enough the report was acted on promptly the next month.",
            "Sue Ellen! Where are the QED reports?!",
            "Bc the good developer is going to do about 20% of the time. The other day she said \"it is my right to have 15 minutes breaks every hour because I smoke.\"",
            "This story has warmed my cold heart a little, cheers.",
            "Legendary",
            "You write delightfully well. How may pages do you read a week?",
            "This is just what I needed on a Friday",
            "My grandma Shirley passed away earlier this year. Now she did leave some big shoes to fill, but your boss is doing a terrible job of keeping up the reputation for the name \"Shirley\" by any standards.",
            "OP, what's shit about this is that the woman got paid for YEARS to do shit work. It is disappointing that it took YEARS before somebody realized she was useless. \n\nI mean, if they would have caught it earlier, they could have either saved money by getting someone better, or train her properly to do the job and tell her not to screw up.",
            "Sweet, sweet justice!!",
            "Sounds like john doesn't know how to math.",
            "I have met more than one Shirley, and more than one \"Fred\" like this in my work life.",
            "Just so glad Shirley got fired. I've been in this same situations with crappy managers.",
            "I picture Shirley like she was middle-aged, single, still stayed at home and had cats 😂😂",
            "A typical Shirley for ya",
            "I kind of feel bad for anyone that loses their job, even this Shirley person, but she kind of brought it onto herself.",
            "I feel this in my bones. I’ve got 2 chicks who are super heifers and I just let them both do everything the hard way. They think because they’ve got more tenure HERE that I must be completely ignorant. Little do they realize, I got the job for a reason.",
            "Yesssss! Very satisfying to read.",
            "Shirley you must be kidding",
            "Fuck you Shirley",
            "What was the turnover rate before Shirley left vs after? They say people don’t quit a bad job, they leave a bad manager. So was turnover high?you said the company on the whole was bad, but was she just not bad enough to make the difference, the straw that broke the camel’s back?",
            "Is that Costanza over there?",
            "Revenge is a dish best served cold indeed.",
            "This one isn't really compliance Tai Chi so much as just a description of an absolute ass who couldn't get out of her own way.",
            "Surely you can’t be serious",
            "[deleted]",
            "She didn’t ask for your help. Don’t stick your nose in or at least talk to her alone with your suggestion. Your Malicious Compliance was wrong and childish.",
            "incompetent middle managers should never be allowed to feel safe in their jobs. they will sink a company and everyone else with them.",
            "That's just petty of you, OP"
        ]
    },
    {
        "post_id": "9ug08t",
        "author": "FutureLights",
        "title": "Nasty HR claims “policy” and then it’s used against them",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ug08t/nasty_hr_claims_policy_and_then_its_used_against/",
        "score": 16630,
        "num_comments": 438,
        "created_utc": 1541441831.0,
        "selftext": "I used to work for a big, global company at one of their many big sites as an operations manager. Loved the job, hated the company.\n\nI hadn’t gone by my legal name in about 12 years at this point. Everyone knew me by another name; I used it everywhere, all my clients used it, and my name badge even used this name as there was a section for “preferred name” when I started right there on my application. I had zero problems up until the new HR manager arrived.\n\nShe was a nasty cow and especially disliked me. At around eight months working there, I still hadn’t received any business cards and had put in many requests for them over the time. I think maybe the new HR thought she was going to pull one on over me as she did indeed get my business cards printed and delivered all 300 to me...all written with my legal name.\n\nI questioned this and was told it was “company policy” and that I would need to write my preferred name on each card if I wanted to keep using it. Even though there were several other managers who also didn’t use their legal names and yet had their business cards printed as they wished, I was singled out. She was so d*mn smug about it. And at this point, “malicious compliance” is really my MO.\n\nI had never worried about changing my name legally as it had honestly never really been an issue. People will generally call you whatever you introduce yourself as. But, well, opportunity came knocking at my door, didn’t it?\n\nI spent $160 and a full day at the courts changing my name legally and hell, while I’m there, I’ll just change my last name, too! I was never attached to it and this one is much better. I also went and applied for a new driver’s license and spent the rest of the afternoon faxing my new documents off to the many places that would need them. It WAS a lot of work and it did end up costing me about $200 all up, but walking into work the next day was the most satisfying day of my time there.\n\nI was able to hand over my official Change of Name certificate and I personally handed the HR manager back all 300 brand new, completely unused business cards with my now-previous name. And to top it off she had to update all my files and my contract, send everything to Head Office to be completed, and then had to come crawling back to my office for me to sign each one with my NEW name. It probably explained the vindictiveness she displayed later but I ended up quitting not long after.\n\nI doubt Head Office would have liked having to fork out for another set of business cards, either. And sure, I had to spend a bit of time and money doing it, but it was something I should have done a long time ago, anyway. I just got a little shove in the right direction and the payout was so satisfying.",
        "permalink": "/r/MaliciousCompliance/comments/9ug08t/nasty_hr_claims_policy_and_then_its_used_against/",
        "comments": [
            "You changed your WHOLE NAME for this malicious compliance. That’s some dedication. I think you deserve an award. ",
            "please tell me you changed your legal name to be [\"Trogdor the Burninator\"](https://youtu.be/90X5NJleYJQ?t=152)\n\nEdit: URL to original thanks to u/Redbird9346",
            "That’s really cool, although business cards are only about 15 bucks. ",
            "What other vindictive things did she do after this? ",
            "May I ask if you're trans? This seems like something that happens a lot to trans people. (Feel free to ignore me if you left that out on purpose.)",
            "Was it Princess Consuela BananaHammock? Please tell me your new name was Princess Consuela BananaHammock! ",
            "This is a textbook example of malicious compliance!! “Because it’s always been that way” is the most destructive thought in our society. I hope your new (legal) name fits you better!",
            ">She was so d*mn smug about it.\n\nIs your legal name Ned Flanders?",
            "Why not change back your name to old legal name again after you get your card to make a point?",
            ">I ended up quitting not long after.\n\nRight after they delivered your new business cards, I hope.",
            "Reminds me of [this](https://www.independent.co.uk/news/uk/student-changes-his-name-by-deed-poll-because-it-is-cheaper-than-changing-his-ryanair-booking-10299657.html) story.\n\nWell done!",
            "What state do you live in? That seems surprisingly easy.",
            "Did you change it to something awesome like \"Dick Package\" or \"Captain Awesome\"?",
            "What head office of a global company cares about a $20 box of business cards?  If that’s causing them stress I think maybe they’ve stretched themselves a bit thin. ",
            "[deleted]",
            "Good for you. It's people like that that make this world shit to live in.",
            "Can’t you get 300 business cards for about $10? \n\nI would have rather had my day back then spend it and $200 in court. ",
            "You vastly over-estimate the amount of work this was for someone in HR.",
            "First time I’ve ever seen the word d*mn censored. Why you do this?",
            "Would have loved a middle name of \"saymynamebitch\" ",
            "I'm very fond of this.  Though I'm also very fond of \"please show me where that policy is written.\"  That one sometimes gets you a long way.",
            "Are you Max Power now? I got it from the hair dryer! ",
            "What a ride this was. As I'm reading I thought, this dude(for some reason I gendered you as male, could be a subconscious bias, not sure) is super petty and super awesome. Then I read the comments and felt bad because I assumed you were a guy, then I read deeper into the comments and realized you were actually a dude. Congrats on your transition by the way. I love the level of petty/malicious compliance.",
            "“Oh, I know what it is Susanna. It is you who doth noth know what I ith, for I am Manbeast. Hunter of elk, lover of women, sovereign of the moon. Oh cat got your tongue? We’ll cook that cat in a salty broth, Manbeast!”",
            "To be honest seemed more trouble for you than her. If I was her I would be laughing my head off and posting this on reddit dude went and wasted his time on getting a name change and other documents and wasting all his time mailing to everyone else just for some business cards. \n\nIts not like she did more work either. She has to do what she did for you for any new employee. But for you man... and you didnt even get the business cards!\n\nBut i do think its good you left. Not fun to hang out in a toxic workplace. ",
            "What was some of the vindictiveness she displayed later?",
            "What would have been even more awesome is after all this was done, and you had your business cards, you then change your legal name back to its original.\n\nAnd still use the old business cards.",
            "Hello,  Mr. Optimus Prime.",
            "300 standard business cards especially in bulk is about $5-20 depending on quality. ",
            "I was hoping that this part would lead to the MC.\n\n> *Even though there were several other managers who also didn’t use their legal names and yet had their business cards printed as they wished, I was singled out.*",
            "/r/pettyrevenge material right there",
            "Streetlamp LeMoose , is that you?",
            "Malicious compliance of the year tbh. Legally changing your name is above and beyond, I love it",
            "A real name-changer right there",
            "Was she a transphobe?",
            "[deleted]",
            "Also you can change your legal name for free in the UK, just need a notable person to sign as witness",
            "You should have gone all in and changed your name again, both first and last, but just by one letter so it’s spelled different but pronounced the same and this dick has to go through all of it again",
            "This needs to go on /r/prorevenge as well. ",
            "Crap Bag",
            "Bravo. This is peak malicious compliance. 10/10.",
            "Chad? Chad Ochocinco!?!",
            "And thus, Brock Thruster had many business cards provided on the company dime.",
            "r/madlads",
            "As someone who goes by a different name then their legal name I applaud you.  I however really like my legal name so I couldn't go that far.",
            "I am not really sure that you inconvenienced her that much, and 300 business cards is chicken feed to a company. I think she won more than usual.\n\nAnd it seems strange that so many people in your company use a different name than their real one?",
            "Here take my card, this isn't my real name either. ",
            "Princess Consuela Banana Hammock!",
            "\n>I doubt Head Office would have liked having to fork out for another set of business cards, either.\n\nWere these American Psycho quality business cards? Because you can get custom business cards at Staples for $15 per 500.\n\n",
            "Streetlamp LeMoose , is that you?",
            "> I doubt Head Office would have liked having to fork out for another set of business cards, either\n\nEh? To head office, it would look like an employee just changed their name. It wouldn't look like some feud between you an HR. Unless they already knew you.",
            "This was awesome. Not only Malicious Compliance, but all Pro Revenge considering the time and effort you took to change your name, and not only that, it's Petty Revenge too because after you forced her to get your cards re-printed, you quit the company soon after. Well Done.",
            "MC equivalent to a rounding error for a “big global company”",
            "Business cards are cheap. You could've printed your own.",
            "I had an HR name change issue, too.  But not my name.\n\nHR demanded our computer accounts and the \"display name\" match their records and we complied in creating them as such.  I had requested exceptions for people, but they wouldn't budge.  (I work in a hospital, and we did have 1 place that required not the legal name, but the name on the medical license for obvious reasons.)\n\nUntil a c level executive didn't like her name.\n\nSo, when I received an email from HR telling an exception had been made, I collected all of the emails from people who had asked previously, cc'd them all the email from HR saying an exception would be made, and told them HR was now processing requests for the exception.\n\nI had to change about 50 accounts, but so be it.  Made a lot of people happy.",
            "You had to deal with HR?! I only deal with my boss. He can deal with those cunts himself. Since he's their boss there never is any problem.",
            "We had an issue where IT wouldn't believe someone could have a single letter first name...it seems it was a issue as some of our software blocked people from using initials.\n\nAt first they tried to put in as (making this up) \"Kay\" instead of \"K\".  HR eventually forced them to make it work.\n\nI later learned this caused him all sorts of similar problems dealing with websites and things in the real world.  But it had become a bit of a personal pride thing at that point.",
            "I've heard of people putting immense effort into being lazy\n\n&#x200B;\n\nBut this much effort into Malicious Compliance? Holy fuck...DC wishes they could write a supervillain this good!",
            "300 business cards are like $30",
            "Nice work OP, this is so satisfying to read. I have to deal with HR at one of my jobs and one of the ladies there is a complete jackass like the one you have to deal with. Love it.",
            "HR Manager just got RHONDA'd! ",
            "All that for a piddly 300 business cards?  That's not even at the typical price-break.  Someone's paying through the nose to order so few at a time.",
            "300 business cards costs like $8. That's a lot of time, effort, and work over $16 worth of malice. Just saying.",
            "Jesus. Getting 500 business cards cost me about $20 at vistaprint. You just swam through a mile of turds to give her a poopy hug. This was not a win. Edit: spelling",
            "To me this seems like a “Hey, I got a splinter. Let’s chop off my finger!” kind of thing. I think it would have been more malicious compliance if you were able to make them reorder new cards for the other guys with *their* legal names on it. Instead, you spent $200 to fix a literal $10 problem. \n\nEdit - just saw where you said that you intended to change your name anyways. With that, *true* MC would have been getting HR to reorder the correct cards for the other guys not going by their legal name, then handing HR your name change papers and saying “Since your ordering for them, order mine too!”",
            "This here is the \"self-immolating-Vietnamese-monk\" of office politics. (Unless you were already planning on getting your name changed).",
            "Censoring d*amn lol",
            "wow you really stuck it to them by altering your family name and shelling out $200 instead of getting them to reprint some $20 business cards. ",
            "This is another level of MC. Good bloody job.",
            "This title is the opposite of titlegore.",
            "A legend",
            "Last name too??",
            "Question: what sort of a different name was it.  Was it a shortening, like Nicholas to Nick, or a different name entirely?",
            "He is the superhero- *Malicious Complier* ",
            "Who all do you end up having to notify legally about your name change?",
            "Wait, do I know you in real life? I have heard this story from a close friend.\n\nNM. My friend is male, and recently did this to get them to stop using his much hated family name. ",
            "New Mod checks out",
            "100 business cards costs what... $10? A order of 300 for a company of this size probably cost $15 tops.\n\nJust saying.",
            "Where I work we sew names on shirts, and some boss saw a (mildly) offensive joke name on somebody's shirt and decreed that **no nicknames will be tolerated.**\n\nOK, so what about the team leader who goes by 'Smithy' because he's called Dave Smith? Should we put 'Dave' on the shirt? Sorry, can't do that, his real name is actually Clarence. So yeah, maybe we'll just use his preferred name, which everyone knows him by, rather than embarrass the dude.\n\nYet another arbitrary rule that was more or less completely ignored..",
            "I don't use my first name at all. I use my middle name. I've done this since I turned eighteen. I even had a Social Security card issued showing my name as *Middle-name For2fly*. \n\nIt never has been an issue. I use my full name on legal documents. \n\nEvery place I've worked has allowed me to have all my communication and correspondence utilizing my middle name.\n\nThat HR lady was on a power trip. I hope you explained in your exit interview her behavior was a major reason you decided to work elsewhere.",
            "This sounds SO much like Lowe's",
            "You must be one of those recruiters with names like Kyle Carter and Indian accent.",
            "That's petty as hell, great job",
            "Hm, interesting, any reason you didn't like your name (more specifically last?)",
            "aren’t business cards like $10 for 300",
            "I've thought about changing my name to get rid of some detritus in the middle-name section... like having my dead-beat father's name in there.\n\nShould've had it removed when I was 10.",
            "You win. This has to be the malicious compliance of the year!",
            "You are a badass. ",
            "Since she works HR, she must be a female Toby",
            "The hero we all need on this sub ",
            "SUPER F",
            "This, this... is Awesome! Lol",
            "This should also do well in /r/unexpected. \n\nCongratulations on your dedication to the cause!",
            "Did you change your second name to Maliciouscompliant?",
            "How does one go about picking a new last name? ",
            "And this is how charles ridenour became Chuck D. ",
            "I had hoped you found out her real name and used it or something, but this is pretty good too.",
            "holy moly that commitment to burn, enjoy your new name! and the new cards! \n\n&#x200B;\n\n&#x200B;",
            "Fuck Amazon. ",
            "Hahaha, brilliant way to one-up her. ",
            "In what big global company does Human Resources handle people's business cards? ",
            "That’s awesome. Cheers ",
            "I have the opposite problem at work, I prefer my given name but everyone uses the short version.  I only find it mildly annoying so it's really far down the bitch list.  ",
            "So you spent $200 to get a new set of $50 business cards?  ",
            "This is a Herculean feat of Malicious Compliance for this one.  \nI'm sure to this day, she will never forget that one individual who CHANGED THEIR LEGAL NAME just to spite her.   \n",
            "Did you just censor the word \"damn\"? This is not kindergarten you know.",
            "Is your name now Max Power?",
            "This is like PRO revenge ",
            "Give this person a metal",
            "This is very impressive and very sad at the same time.",
            "...that was a waste of my time. ",
            "Why did you censor the word damn?",
            "Malicious Compliance and Pro Revenge had a lovechild and it's name is this story.",
            "unless your previous official name was Euphrates Dingleberry why the fuck go through all that trouble\n\nedit:\nah, you're trans. that explains a lot.",
            "Uhh, how can you even get away by not using your legal name in goddamn legal documents. That is several layers of very illegal, also shady, when your name on the ID card doesn't match with what you say.\n\nSomething is very, very fishy.",
            "Ah, the old Ochocinco trick!\n\nhttps://en.m.wikipedia.org/wiki/Chad_Johnson#Name_changes",
            "This is a little bit of an overreaction there buddy.",
            "[deleted]",
            "I'm a bit skeptical about the truth of this.\n\nI literally just changed my name legally, was finally done about a week ago.\n\nI had to pay 400$ to file the name change with the courts, was given a court date set 2 months later.\n\nThen I got the approval from Court, needing to pay 25$ for a copy, and was told I needed to go to the social security office to get it changed. Appointment was scheduled a month later.\n\nGot it approved and would receive my new social security card a week later, then taking it to the DMV to get a new license costing about 30$. License came about 3 weeks later.\n\nAll in all it took about 4 months once I officially filed it to get it done. I highly doubt you were able to just walk in to the court and get it changed in one day.",
            "I support this.",
            "r/prorevenge material? ",
            "Bahahahahaha!! I LIKE YOU! ",
            "Usually you have to submit fingerprints to change your name. How did you get away with that?",
            "[removed]"
        ]
    },
    {
        "post_id": "pe9s3u",
        "author": "PGLiberal",
        "title": "\"Apparently your dead\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pe9s3u/apparently_your_dead/",
        "score": 16619,
        "num_comments": 471,
        "created_utc": 1630292946.0,
        "selftext": "I used to work for AAFES (Think Wal-Mart but on US Military bases) and I worked at the customer service counter where people would come to do various things, such as pay their star card (store credit card) bill. During this time the causalities coming in from Iraq/Afghanistan were pretty constant and shortly prior to this interaction I got briefed on what it meant if I saw the \"deceased\" card. I got the feeling we had several customers who died in Iraq and the policy was put in place as AAFES likely didn't want the bad PR on trying to collect debt from widows. Which, I mean is a good idea.\n\nIt meant the card was closed, all debt was written off, and all automatic payments were canceled.\n\nWell if you've ever worked or dealt with AAFES you understand they are incredibly incompetent. \n\nWell one day I'm working and a woman comes up to me and says \"I'm Mrs. Jackson I would like to make a payment on my star card\" I said \"That's fine, can I see your ID or star card?\" she gave me her star card and I asked \"And how much will you be paying today?\" to which she said \"$1,500\" \n\nI opened her account, and in big bright red letters her account status was \"DECEASED\" her balances were zerod out confused I ask her how much she owed on the account. She said approx $4,000. \n\nThinking maybe I opened the wrong account I asked if she had her star card so I could enter the exact account number. She gave me her starcard.\n\nSame status, she's dead, she's owes us no more money.\n\nAnd I said \"Miss Jackson I have good news and bad news\" to which she gave me a frustrated look and said \"Whats the bad news\" I said \"Apparently your dead\" she laughs and says \"I feel very much alive\" I nod my head and go \"I agree, you do appear to be alive\"\n\nSo she goes \"So whats the good news?'\n\nI smile and say \"You don't owe us anymore money\" she goes \"what?\" I go \"Per our policy if a customer dies we close their account, and write off their debt\" concerned she goes \"Well is this going get sent to collections?\" I ask \"Were you past due?\" she goes \"no I wasn't\" I go \"let me call my manager\" so I call my manager and I ask my manager \"If a customer is declared deceased, do we send their debt to a collection agency\" he goes \"No, its written off\" so I relay that information.\n\nShe starts to smile, and then she goes \"So can I use my star card?\" I go \"No, its been closed but if you want to open another account you can\"\n\nSo we opened another account (yes it worked and she was approved)\n\nI dealt with Mrs. Jackson several times over the next year as she liked to come in person to make the payment. I nicknamed her Zombie a nickname which she embraced. When she would approach me I would go \"Ah the Zombie is back\" and she would smile and joke \"Be nice or I'll eat you\" we kept it as an inside joke my co-workers were always confused.\n\n**Edit**\n\nThe Malicious Compliance is I allowed the system to say she was dead, and did not attempt to correct it.",
        "permalink": "/r/MaliciousCompliance/comments/pe9s3u/apparently_your_dead/",
        "comments": [
            "This is a story of good MC, not evil MC.  :)",
            "Good on you. AAFES doesn't hesitate to fuck people over on the regular. Always nice when they get fucked back a little",
            "So she died and was resurrected by the glory of AAFES?",
            ">laughs and says \"I feel very much alive\" I nod my head and go \"I agree, you do appear to be alive\"\n\n\nAnyone else read this and see Data?",
            "Hey, even zombies gotta get their supplies.",
            "What about my dead?",
            "Our dead",
            "I used to work in a bank that was inside an AAFES and was close friends with a couple of managers.  From what I've heard and experienced... this story 100% tracks.",
            "She might want to look into that.  Being declared dead, and it getting around to various agencies can be a HUGE pain in the ass.\n\nShe might want to find out why AAFES thought she was dead and make sure it isn't incorrectly reported to places like Social Security, and the credit bureaus.",
            "That’s adorable",
            "Yeah I had a star card when I was a young Marine PCSed to another unit and thought my star card was paid off but somehow was off by like 11 dollars or so... They never sent me a bill but they did send one to my commander and I was called out in front of formation over 11 dollars. Went and paid it off and closed the account never signed back up again until after I retired!",
            "How do you think she ended up as \"DECEASED\" in the first place though? \n\nA glitch? Maybe someone mistyped something?",
            "For a moment there I thought she was using her spouse's card and she wasn't notified by the military yet, but the store system was automatically updated.\n\nI've been in similar situations in the past where I had people call the help desk because they couldn't login, only to see their account was terminated as part of the offboarding procedure. Had to tell them there is an issue with their account that is out of our scope and that they need to contact their manager. At one point entire departments were moved offshore so there were so many cases like this that people figured out what it meant when we said that and instead started packing up their desk waiting for HR to get to them.",
            "What about my dead?\n\nJokes aside, this is more wholesome that I would have expected from this subreddit. Thanks for sharing!",
            "\"I'm gettin' better.\"\nEdit:My bad. Need to rewatch.",
            "* you’re",
            "*you're*",
            "This is probably one of my all-time favorite post on this sub. Good on you OP.",
            "You’re",
            "My dead?!",
            "You're a good soul.\n\nYou're.",
            "\"be nice or I'll eat you\"\n\nWhat a gal :-)",
            "“I’m sorry, Mrs. Jackson.  I am for real.  Never meant to say you died.  I apologize a trillion times.”",
            "Omg. I was worried the entire story that this would be how she found out a family member died in Afghanistan. I cringed when you said “I have good news and bad news!”",
            "I really thought this was going to be:\n\nGood news: you don't owe $ anymore.\n\nBad news: Your deployed husband whose card you are trying to use/pay is KIA and for some reason I am the first one telling you about it.",
            "*You're",
            "I'm ignorant,  so please understand that this is an honest question.   If her spouse is in the military and possibly deployed, and she a dependent,  would she be eligible for a AAFES card in her name?   If so, and her spouse was KIA, would it say Deceased on her card?",
            "You're a good person.",
            "Worked for VA, many mistakes over\nthe 10 yrs I was there. \nThey once sent a man $7,000., he was on Social Security, u can’t have two Federal Incomes. Told him to keep, get the interest till VA found their mistake. They never did!\nAnother time to get rid of a very \nvery annoying foreign widow,  I put together a case and sent to VA \nfully expecting it to be denied. I\nmade the  case, because of a brain\ndisease, he didn’t take his meds\nproperly. (He was in a VA hospital!).\nShe got $32,000., and widows pension!😳 Was too good!  VA\ndidn’t question my claims!   Felt\nbad, but got her out of my office,\ncomplaining about her “Merican”\nhusband, and how she had “rights!”\nAnother woman got $32,000. the\nday she died, I told her son to put\nIn night deposit, no one checked\nto see if deposit was before her death!  Just a few examples🤨",
            "Your dead what?",
            "I love this",
            "Sorry Ms. Jackson\nooh\nYou are deceased.",
            "Her dead what? I don’t get it. \n\nHer dead WHAT?",
            "The AAFES was notorious for it's issues when I was Active Duty.\n\nThey had a program with the STAR card that you could use to purchase uniforms interest free.\n\nI was going to a leadership school so I took advantage and bought about $400 in uniforms.  I also had a balance of about $200 on the credit side.\n\nGet back from school and found that I had lost my check cashing privileges and was facing UCMJ actions for not paying my bills.\n\nThey added the uniforms to the credit side, didn't give me credit for the payments I made, and quickly reported my non-payment to my chain-of-command.\n\nIt took me three months to fix everything.\n\nPart of the \"fix\" resulted in my having a balance of -$5.00 (basically five dollard credit on the card).\n\nBy this time I had swore off using AAFES for any type of credit, but kept the balance for the next 10 years.\n\nEvery time they would \"clear\" the balance (usually by sending me a check for $5.00). I would destroy the check, make a card purchase, then immediately pay off the balance =$5.\n\nThis led to events like:\n\nBeing called into the Commander's Office for non-payment of bills.  Cleared this by asking, \"How do I wrote a check for -$5?\n\nTwo Security Clearance updates where I had to provide a written explanation as to why -$5 could not be an unpaid bill [I had to get a letter from both my Commander and JAG on that one].\n\nHaving my account \"accidently\" closed, twice.  After re-opening, I promptly worked back to the -$5 balance.\n\nFiling a harassment complaint about unsolicited calls to \"use\" my credit.\n\nOver all it was well worth the -$5.  Very entertaining.",
            "Sometimes the best feels happen in retail.",
            "How did she designated as dead in the first place? There’s a real problem if wrong accounts are getting changed like that.",
            "It's like I always tell my fiancee: never, ever, ***ever*** feel bad about about (legally) screwing over the government or a big corporation - because they can, will, and do screw everyone else over as hard as they possibly can at every single possible opportunity - up to and including ~~inventing~~ ~~buying~~ lobbying for new ways to screw everyone over. ***FUCK THEM.***",
            "Nice story. Now to annoy you. It's You're, not Your. You are = you're.",
            "I loved this story! I actually smiled! But (and I’m sorry, I really can’t help it): “Apparently YOU’RE dead”",
            "> Bring out \"your dead\"",
            "> Miss Jackson\n\nnever meant to make you up and die  \ni apologize a trillion times",
            "I thought this was going to go in the direction of “I regret to have to inform you that your active duty husband has been killed in action.”",
            "plot twist - you see dead people.\n\nYou're the only one seeing her.\n\n- Night Samamamalayalanamayan.",
            "All I can here from this is Tennessee Ernie Ford, 16 Tons.\n\nYou load 16 tons, what do you get? Another day older and deeper in debt. St. Peter, don't you call me 'cause I can't go. **I OWE MY SOUL TO THE COMPANY STORE.**",
            "I'm glad it was just your store who thought she was dead.\n\nIf she had actually gotten onto the national Death File, she'd be dead for life which is a REAL pain in the ass.",
            "I worked for AAFES in the 80s at HQ.  The reason the are so incompetent is they don't fire the bad employees, they just shift them to other departments.  They also hired to fill quotas instead of the best qualified.",
            "not my dead",
            "Man fuck the star card. When I got out in 2014 I closed the star card. It was somehow active until 2019 despite numerous calls to them. Finally I challenged the account on my credit report. That made it go away",
            "Military 101, never never never EVER get that stupid card...  you get into financial trouble or something happens and you owe on it guess what?  Commander notified and wages will be garnished eventually.  Not saying this so ppl don't open one because they are bad at money and know they'll probably miss payments or something, but stuff happens.  With civilian cards you can at least settle for a reduced amount if you get into a financial crisis...",
            "Fuck the Star Card. We had to get one at a remote base overseas to get fuel off base to avoid paying exorbitant fuel prices. When I was just a month late on payments, they notified my First Sergeant about my massive financial blunder, and they forced me to show that I could pay it off in front of the commander and the First Sergeant. Never going back again!",
            "Damn, I have no idea how AAFES work but for a moment I thought Mrs. Jackson didn't know about what just happened to Mr. Jackson ...",
            ">\"Be nice or I'll eat you\"\n\n\"Promise?\"",
            "Uhhhh sorry, I'm not from the US and to me (Germany) this sounds super weird. Could you please clarify a bit? I know what walmart is but how on earth could you spent 4000$ in a supermarket? How often do people pay their balance? Once every year? I seriously am baffled that someone just doenst pay their bills until they are that *high*",
            "When I was ETS'ing (almost a decade ago) I was also moving my family from Europe back to the USA and looking for a job... very busy.  I *thought* that my STAR card was configured for automatic payments, and if you looked at my bank account it seemed like they were... since payments were being made to them.\n\n:-/\n\nBut they were taking payments *after* they were late... so I ended up with a \"late payment\" on my credit report for three consecutive months before I figured out what was happening.  That was an albatross around my neck for YEARS because other than that I had PERFECT payment history on my credit report.  I tried everything to get them to \"adjust\" my history to no avail, they were steadfast... and TBF I *should* have been logging in to verify the payments were being made correctly.\n\nThe positive outcome is that *now* I track *every* monthly bill on a spreadsheet that keeps track of all this stuff... even if the accounts are set to automatic payment I still log in every month to verify the balance and payment information.",
            "My FIL was in the army when he was a young man. They transferred him to Texas and promptly lost his records. He was considered AWOL while collecting his paycheck the entire time. Then, some man was found dead that \"matched his description.\" They called his mother and told her he was dead. He continued collecting his paycheck, y'all. Some time went by and he got married, and his now ex-wife called his mother to tell her that they'd gotten married. His mom was PISSED and asked how she could play such a cruel joke because her son was dead. Well, obviously my FIL was VERY confused and his mom nearly had a heart attack when he got on the phone to see what was going on.\n\nA little later, he was dishonorably discharged for supposedly stealing a piece of enormous equipment that would have been impossible to steal without being caught, and impossible to steal without help.\n\nY'all the army paid a \"dead\" man his paycheck for at least 6 months before anyone (my FIL) noticed. Then I think they tried to cover their ass by making up some bullshit story about the equipment. Like....at least pick something that would have been possible to steal?",
            "AAFES was/is a joke. I worked there for a little while at my wife's first duty station. I was stoked when I got a better job of base.",
            "I'm sorry Ms. Jackson , i am for real",
            "Always be friendly if rendering service to wayward zombies.",
            "AAFES took my IRS return one year because they said I had an outstanding bill.  The years for the charges was 4 years after I got out of the Army. Also they were made in Puerto Rico a place I have never been in my life.  Needless to say once I disputed it I got my money back.",
            "Man I thought this story was going to end up with him breaking the news that her husband was killed in action and she didn’t yet know.",
            "Whose dead?",
            "I've heard of zombie debt.  But, a zombie debtOR?  That's a new one on me!",
            "Waiting for the mad lad to say “you’re*”",
            "[deleted]",
            "[deleted]",
            "Props to you and her.  The nickname is hilarious.",
            "Now this is a genuinly funny and cool MC.",
            "How do you run up 4 grand in debt at the px? Lol",
            "I'm sure that's fraud but whatever",
            "Big Commander Shepard energy there.",
            "Grew up on military bases overseas as an Air Force brat. This brought back a lot of memories. Anybody remember Anthony's Pizza? The GOAT!",
            "as someone who has 60k on collections you probably made this ladies decade",
            "Love it.",
            "I hope she didn't have any issues handling other business. Seems like a nice lady",
            "Damn I would’ve been happy if that was me",
            "it's nice to see when woeful incompetence benefits the little guy for a change.",
            "best story ever. The zombie bit was my favorite part",
            "This story made me smile, which I very much needed today. Thanks for being human.",
            "My first job was for an accounting firm as an auditor. AAFES was one of my clients for three years. I enjoyed working there because the people were nice and it was pretty laid back. Their systems were so bad though. So, so bad. This story didn’t surprise me one bit.",
            "I’m a VASCO and one of the most baffling issues I’ve ever fielded was a veteran not getting their GI Bill BAH because they were marked deceased in the system… except they tried to collect the newly established debt for not completing a term from his poor confused mother. Took moooonths to sort that shit out. He was told he needed to provide proof he wasn’t dead (wtf)",
            "You my friend, are a good person for doing that.",
            "For once, being deceased’s pays off",
            "“You’re”",
            "You're*",
            "This is great, I love the Nickname. Lol.",
            "Your death? You're dead? Native speaker with that crisp low American iq <3",
            "Hell the military 'lost' 80,000,000,000 worth the equipment...doubt they will notice 4k",
            "I still have pogs i can't spend from 2013. Ty aafes.",
            "I'm sorry Ms Jackson oooohh but you are not reeal",
            "So, is that pronounced AH'-FESS for short?",
            "I take it her husband wasn't in the service?",
            "This probably means there's another Mrs Jackson who really is dead but her debt is not written off. And when they realise the mistake they will fix the error and come after this customer again.\nShould have tried harder to fix it...",
            "> I used to work for AAFES (Think Wal-Mart but on US Military bases)\n\nOn US Army and Air Force bases. Navy and Marine Corps have NEX (Navy Exchange), which is a department store, not Walmart. Groceries are handled by the post Commissary.\n\n-former Navy kid whose worked at the Miramar NEX\n\nEdit:\n\nAlso, the Mrs. was probably not the deceased party, but her husband. I grieve the number of newly minted gold-star wives, particularly the one wife about to give birth to their first son.\n\nI didn't deal with the store credit card when I worked at the Miramar NEX, though we did have a number of retiree wives and a couple of widows come through on occasion. Including a later middle aged Vietnam War wife (I worked there in the 90s). We cashiers got to know our regulars.",
            "So cool to have your husband die! You get free shit!",
            "[removed]",
            "If the original post had pickup only I would have written this.\n\nI'm sorry\n\nCB; so are you going to drop it off?\n\nNo, im sorry you can't read you illiterate fucking peasant, the ad specifically says local pickups only, I am willing to expedite ship though, expedite my foot up your ass!",
            "Include a tldr please. Jesus.",
            "r/wholesomecompliance",
            "This is so cool, you've got a great story to tell and you've got a great inside joke. :D",
            "I think it's great how your manager didn't even question why you were asking or that the system didn't chine up on a deceased person being re-entered.",
            "A wholesome MC! Glad she took it well and could joke about it.",
            "I did taxes in a military town back in 2005-09. In 2007 a widow had a delay on her taxes and couldn’t figure out why. She came a couple of weeks later to tell me they dinged her an old DPP charge (before Star) that her husband had had before he died.  He had been dead for years. She chuckled and said it was owed, and now it’s not. She made me smile.",
            "We are always offered a star card, and we continually decline. I've never seen the point in one, other than the times they offer extra savings on gas, which for some reason, they never do on the base we live on.",
            "My star card has a negative balance on it, has had one for the past 5 years. \n\nI opened one, bought two things, paid it off and returned one thing. \n\nSo the credit card owes me money, and maintains an open status. This I get paid on time marks on my credit every month from it.",
            "Ok this is now my favorite story. I was laughing so much!",
            "This is such a cute story!",
            "\"I got better. \"",
            "[This is my headcanon for what happened](https://youtu.be/25XyWhfpSiM?t=141)",
            "I wonder if this works for student loans",
            "I hope you said this with the best Rowan Atkinson impersonation you could muster!",
            "Apparently, the screening process for a new credit card doesn’t involve checking for a pulse…And I though dead people could only vote!!!",
            "Had a good chuckle at this! \n\nAlso its good to know - because most people dont;  it's actually not a family member's responsibility to pay off a deceased person's debt. The collection agent will harass them until they pay, just to get rid of the harassment. But nobody is liable for a deceased person's debt. Collection agents are evil hey.",
            "Nice!",
            "Heck, this is wholesome",
            "Omae wa mou shindeiru!",
            "I love this. This is wholesome.",
            "Ha. I just got hit with a wage garnishment from AAFES to pay down my starcard balance from over ten years ago.",
            "Damn, that’s one of the best outcomes I’ve seen in a while. Good job on making sure she was taken care of!",
            "Did her next account say deceased as well?",
            "What a wonderful malicious compliance!",
            "I'm sorry miss Jackson.",
            "Blessed Compliance?",
            "I love this story but the compliance is far from malicious",
            "Great for her, but probably a big problem for the family of the actual deceased they confused her with.",
            "Military red tape! Good on you.",
            "I'm sorry Miss Jackson!",
            "I have a question, as I’m totally unfamiliar with this: was she allowed to open a new account with the exact same information as the previous one? That wouldn’t raise any red flags?",
            "hell yes bud",
            "I love this story ❤️❤️❤️",
            "In pretty simple terms, how would a clerical error like this happen when the account holder is clearly not dead?",
            "Absolutely hate AAFES Star Card. Seriously, they were mailing my statement for 10 years to our home address then suddenly it was mailed to my dorm room I haven lived in since August 2002 when I got married for a 2.12 bill that they charged an inactive fee for in 2018 then sent it to collections and caused me to have delinquencies on my credit. Of course this was before I was monitoring that too so I didn’t find out for 3 months and when I did they refused to correct their mistake. I paid their frivolous fee and disputed their address error. I was able to prove it because it was held at our base post office since they couldn’t figure out if it was a new airman coming in!",
            "Spoiler alert: They hooked up",
            "What a cute story, made me chuckle",
            "The wholesome interactions at the end are gold. I loved this!",
            "r/UnexpectedlyWholesome",
            "...i love both of you for this! outstanding fun had by the both of you. w o o t!",
            "That's fucking hilarious.  What a great way to game an incompetent system.",
            "I was a senior buyer procuring parts for AF One. Part of the reason shit is so expensive is the ridiculous amount of red tape I had to contend with. It got so bad that I quit after 28 years. Retired, technically. Just couldn't deal with the DoD anymore.",
            "My husband was Army for 18 years. AAFES sucks.",
            "What if she really *is* dead, and we are all just figments of her imagination as her life flashes through her eyes?",
            "How was she marked DECEASED? Did another Mrs. Zombie die on the battlefield & they just got the two personnel records conflated?",
            "This reminds me of an Army veteran I shared a few classes with when getting my Associates.  One Friday he came in and declared, \"Hey guys guess what?  I'm dead!\"\n\nWe all give him a WTF look, and he pulls out a letter from the VA that read something like \"We are sorry to inform you that...\" and sure enough, the letter said the guy was recently deceased.  We had a good laugh about it, joking that he should go vandalize the department head's office or steal some stuff before having the VA correct his status since dead people don't(?) commit petty crimes.",
            "\"Be nice or I'll eat you\" Am I detecting a certain, shall we say, tension, in the air? The kind that goes with statements like, \"Whatcha gonna do about it?\", or \"Make me\", or \"Scared, Potter?\"",
            "4K.  That would take my family a year to run up a grocery debt that big.  What is in that place that people can have a debt that big that’s outstanding?",
            "What a heartwarming story",
            "I wish my credit card thought I was dead",
            "AAFES is the Devil. The Star card is Mephistopheles.",
            "AAFES:  This person is dead.  \n\nPerson:  So do I need to pay?\n\nMe:  *pulling out phone & queing up song*  https://youtu.be/V4jUZ-Ex1k0",
            "I joined the Navy credit union when I was stationed in Japan. When I got out of the  navy I closed my account. I ensured there were no outstanding transactions before I closed it. When I got out of the navy I ended up immigrating to Australia. Fast forward a few months and I start getting notices from the credit union stating that there is an outstanding debt of 25 cents owing to the account. I am warned that since there is not enough funds to cover the amount I will be charged an overdrawn fee of $5. The date of the supposed transaction was after I closed the account so did not think anything of it. About 5 years later I am talking with my dad on th the phone and he randomly mentions that he has a stack of envelopes from the Navy Credit Union that have been sent arriving every 3 months since I got out of the navy. He wants to know what I want done with them. I get him to send them to me. There were close to 20 statements. It appears that the bank kept applying that same overdrawn fee to my account and accruing a progressively larger debt. By that point the $5 fee was now $25 each time. I don’t remember the exact amount but it was somewhere between $500 and $600.\nI tried to contact the bank to sort it out but was told that I would need to talk to the bank where my account was held (Yokuska Japan). In the end I finally was able to contact someone to sort it out. I never found out how I was able to accrue such a large debt on an account that had been closed before the fee was applied."
        ]
    },
    {
        "post_id": "hrqdr4",
        "author": "Thornpudding",
        "title": "Don't want to spell correctly my name? Ok, I'll stop paying taxes.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hrqdr4/dont_want_to_spell_correctly_my_name_ok_ill_stop/",
        "score": 16617,
        "num_comments": 596,
        "created_utc": 1594829303.0,
        "selftext": "So, this one dates back from years ago, when you would fill your income statement manually, like with a pen on a form. In those days, in my country, we didn't have a withholding tax system, but you would pay in year, say 2007, the taxes on your income of year 2006.\n\nOf course the form would come by mail pre-filled, with name and details, and also some quite accurate amounts, because the state knows already pretty well how much you make. \n\nMy family name is a bit complex, being multipart and with unusual letter clusters in the middle. Mistakes are understandable, but you would expect the Revenue Service to be exact on that matter. Unfortunately, they weren't. They kept misspelling it every year on the form, and on all the subsequent forms (tax statement, tax returns etc) they would mail me, despite my correcting it manually every year on my income statement. In black. Then in red. Then the following year with neon red Sharpies. Then one year later adding a sticky note. Then adding a whole letter. Then adding a letter and copies of my ID as proof. Etc. But they weren't budging.\n\nIt was quite irritating, because the tax statement has to be shown on several occasions when you interact with the State administration or justice. Everybody would notice the discrepancy. Everyone was understanding that it was obviously a mistake from the Revenue Service, but it was still annoying on so many levels, the most basic of which being a matter of respect for my identity.\n\nAfter ten or twelve years of them not taking notice of my notes and corrections, upon receiving a payment notice still misspelled, I went in person to my local Revenue Service office and asked to speak with someone about that issue. I made it very clear to the clerk that they were wrong. He was adamant that they were correct (like I wouldn't know my own name...) and added, for good measure, that he couldn't change my name in their systems because he didn't have access to that blah blah. I was having none of it, so: cue malicious compliance.\n\nMe: So, you said you were positively, absolutely right, about my name's spelling?\n\nClerk: ....\n\nMe: I shall therefore stop paying my taxes. I am not the person on your forms. And there's no way you can come to me asking for that tax money, since the person on your forms doesn't live at that address, and in fact does not exist.\n\nClerk: *mouth is gaping, eyes are so wide open they're going to pop out*\n\nMe: But in case you need that tax money, you know how to write my actual name.\n\nAnd I left with a smirk.\n\nI actually did not pay that tax installment (in those days, you paid your taxes in three installments over the year). 2 weeks later, I got a reminder letter, without the 10% penalty normally owed for late payment, and with my name correctly spelled. Shouldn't have wasted so many Sharpies over the years.\n\n(Edit: added the mention about the payment notice for clarity.)",
        "permalink": "/r/MaliciousCompliance/comments/hrqdr4/dont_want_to_spell_correctly_my_name_ok_ill_stop/",
        "comments": [
            "[deleted]",
            "This is great MC - nice job. Did you have to pay that 10% penalty since this was technically your first notice?",
            "My last name has an apostrophe. Some systems will allow for it others won’t and while it can be annoying it’s just something I’ve earned to accept and deal with.\n\nSeveral years ago I broke my arm while at work so L&I covered it thankfully. Everything comes and goes and a year later I get a phone call from the hospital telling me my L&I is refusing the claim. So I have to call the hospital then L&I to find out that because my driver’s license did not have the apostrophe (when I got it they said they couldn’t add that in) but all the other paperwork had it. \n\nThankfully all I had to do was tell the hospital to resubmit the claim without the apostrophe but I felt like that should be a very easy thing to figure out.",
            "Name misspelling is the worst. I'm in the US and my last name is from my dad's family when they emigrated here.\n\nYou think that would get screwed up all the time, but no one ever messes up my last name. It's my incredibly common first name that gets screwed up. All the damn time.\n\nIt's as common as Melanie, but no one can get it right. My gynecologist once sent me a bill with a boy's name instead of my name. It's a running joke with me and my dad now though. Anytime someone screws it up and misspells it, I've *discovered* one of his illegitimate daughters since he wasn't creative enough to give them different names, just variations of my name.\n\nEven when I was first born the US government sent my social security card with my first name misspelled.",
            "I once bought property from someone whose first name was misspelled on his birth certificate, and he just went with it his whole life. Think “Fred” misspelled as “Fres” (QWERTY keyboard, s is just to the left of d). The sales contract says we’re buying from “Fres Smith” (not his real name), and it wasn’t until closing that we met “Fres” and learned the story behind his name—and the fact that he was a “he” even.",
            "I have had people ask me if I spelled my own last name wrong. LIKE No I did not it has an A Not an O in it. Good God REALLY",
            ">Of course the form would come by mail pre-filled, with name and details, and also some quite accurate amounts, because the state knows already pretty well how much you make. \n\nOf course. That's how any decently run advanced country would do it. Who says they wouldn't? I mean, it would be pretty redicoulous if you had to do it all yourself, then get penalized for mistakes when they already have the information. That would be silly.\n\n\\*Sobs\\*",
            "It’s amazing how people get a preconception in their minds of how a name should be spelled. When our first daughter was born, we spelled her name with an “ea” combo of letters, where the common spelling is “ae”. The teacher she had for grade 5 AND grade 6 (same teacher) INSISTED that she was spelling her own name incorrectly, and kept trying to correct her. We sent several notes to the teacher explaining that our daughter’s name was, indeed, spelled with an “ea”, not an “ae”. This all had no effect.\n\nFinally, we went in for a parent-teacher interview one evening, and took her health card, and birth certificate, with us, and showed them to the teacher, with a firm message that she is to stop harassing our daughter over the spelling of her name.",
            "Well, I have an uncommon last name. There are exactly seven people in the world with that last name, all from my branch of the family, and that's it. It stems from the fact that my Italian great-great-grandfather was registered by the invading Austrian forces, which spoke poor Italian and misspelled it on the adoption certificate.\n\nNow, for the kicker. \n\nWhen I was a kid, back in the 80s, one of the parents was allowed to have also a page in the passport for each children, since back then they weren't releasing separate documents for under the age of 14 years old.\n\nSo, my father received his brand new passport, ready to go on vacation with his family... And his last name is spelled wrong. Well, no biggie, back then you would just shrug, and still pass the border by car. Flying by plane wasn't common, nor were computers, let alone the internet for border control officers to check your identity.\n\nThen he flips the pages. And my last name is spelled wrong. And my brother's.\n\nOnly, it's spelled wrong *in three different ways*. You just waited 3 months and wasted what now would be around 80 EUR on a document that wouldn't even pass cursory scrutiny.\n\nTo this date, we are still wondering if the officer compiling the passport was drunk, indecisive, wanted to maximize his chances of getting it right at least once, or a prankster.\n\nOf course, when my father asked the passport office, they just say they rectify it by re-issuing another. In 3 months, for another 80 EUR.\n\nWe still went on vacation. The border control to Slovenia was fun, but back in the day it seems documents were not that accurate for a lot of people, so they were inclined to let it slide.\n\n*For Arstotzka!*",
            "My legal name on my birth certificate has Roman numerals. I’m the 3rd. I can definitely relate. I’ve run into issues at the DMV and with the IRS. Luckily my social security card with the Roman numerals usually speeds things up.",
            "My last name is not only constantly misspelled its mispronounced. Honestly idk how I think its pretty phonetic and theres a famous guy with the same last name and he doesn't get it misspelled. Anyway I used to be in sports and as a child I can not tell you how enraged I'd get at a coach or referee saying it wrong. Like I'm proud af of my last name because of my heritage so people messing it up is beyond annoying. So there were multiple times where this little 12 yo is standing on the side line waiting to be announced before Volleyball or Track and Field and you just hear in my fairly loud voice \"ITS NOT BLANK ITS BLANK!\" My coach even spelled it wrong first and last on my certificate or greatness at the end of the season and never made me a new one like....its in the roster, it's in the school records HOW DO YOU NOT DOUBLE CHECK",
            "It's super effective when you threaten to withhold payment how people decide to react. \n\nMany years ago my grandfather passed away. Almost all the bills and utilities were in his name, so as part of sorting everything out - notices were sent to those companies with a copy of the death certificate, and requesting the account holder be changed over to my Grandmother.  \n\nEveryone complied. Except, of course, for the power company.  Every month, along would come a new bill with my grandfather's name on it, and give another jolt/reminder. Calls were made, promises to sort it out were received, and broken.   After about a year of calling and trying to get it sorted, my grandmother gave up. She was still working at the time, and busy with work.  Every 6-12 months, there'd be some sales rep who'd call up asking for Mr X, wanting to sell him on some new power plan, only to be told he's dead, and slink away. \n\nTen. Years. Later. As my grandmother is sorting out things for her retirement she gets another bill from the power company, with as usual, my grandfather's name on it.   For some reason, she'd already had a bad day, and this made it worse - so on the phone to the power company. \n\nGran: \"I'd like you to change the name on the account. \"  \nRep: \"Certainly, can we speak to Mr X?\"   \nGran: \"Not without a Medium, he's dead.\"   \nRep: \"Oh, I'm sorry to hear that. In that case, we need you to send us a copy of the death certificate.\"  \nGran: \"I did that, 10 years ago when he died. I also called you for a year asking you to change it.\"   \nRep: \"I see.  I do see notes on your account that reference this.  In that case, what we can do is close this account and re-open a new account in your name.\"   \nGran: \"Fine, whatever you need to do to change it over.\"   \nRep: \"Excellent. So there's just the matter of the $150 connection fee and $600 security deposit. That will be payable on your first new bill.  Is that okay?\"   \nGran: \"No, it most certainly isn't okay. \"  \nRep: \"I've spoken to my manager, and since you've been a customer for such a long time, we can reduce the security deposit by half, but the system won't let me alter the connection fee.\"   \nGran: \"I don't care about your system. I'm not paying you to change a name on an account.\"   \nRep: \"Then I can't help you\"   \nGran: \"Then you can tell your manager that I won't be paying any further bills in my Husband's name, nor any connection fees. You can try pursuing his Estate, but all the money has been distributed long ago and nothing is left - good luck with that.\"   \nRep: \"Unfortunately non payment will result in disconnection of your service\"    \nGran: \"Do that and I'll be onto the media to tell them about the power company that keeps harassing the little old retired grandmother about her long-deceased husband and wants to charge hundreds of dollars to just change a name.\"\n\n\nBy some miracle, the power company rep managed to find the right people to change the name on the account without charging even a dollar.",
            "I love this story and I've got one kinda similar. I have a suffix at the end of my name, which means my name is John Doe III. My father is John Doe Jr. The first two years I had moved out on my own I would get all my spam mail with the correct name but when my taxes and things like that came up (you know, critically important government documents which need to be correct) they kept sending my forms with Jr. instead of III. Worse still was that my tax returns got sent to my father despite a clearly marked different address and name. So dad would get two different tax returns and have to figure out which one was his and then send me the other one. I got them to stop by asking the guy who had helped me fill out the forms if he could fix it. He directed me to the IRS who told me they couldn't. They decided they suddenly could after i informed them that my next call was going to be a law office to see how much money they owed me for not sending me my tax returns directly and with the correct name. Never a problem again.",
            "There is a Canadian with the surname TallBear, who ran into some government jobsworth who wouldn't fix the recorded name 'Tallbear', since \"the system doesn't handle mid-word capital letters\". TallBear then pointed out that it had no problems recording names like McDonald...",
            "I love this malicious compliance. It reminds me of my own malicious compliance. About 2 or 3 years ago, at The last apartment I lived at. In the U.S we are taxed by both local, state, and federal government. \n\nWell I took care of state and federal but I happened to live on the border of a tax district for my city and the much larger city nearby. Well my city told me, after filling out all necessary information and calling to pay, that I was not part of there tax district based on my address and I needed to redo the process with big city. \n\nSo, I did. Well big city turned around and told me that I was a part of my city and I don't need to file there. So... I maliciously complied and filed no where for local taxes. \n\nNever recieved a late fee or any local tax info requesting payment. No wonder neither city has released the ability to file and pay online yet. They can't even get their districts figured out.",
            "Do you have some sort of ID number assigned by the gubmint?  That’s what the US really goes by.",
            "As a German with an Armenian first name and an English last name, I feel this all too well.\n\nMy name is commonly misspelled, mispronounced, or otherwise trampled on.\n\nMy first name is also the reverse spelling of a particular personification of evil, so it gets shit on a lot.\n\nEdit, apparently my first name is also Lithuanian.",
            "My BiL’s last name is Dutch and is not pronounced the way it looks in “American” (s/). When someone calls asking for Mr. ‘Wrong Pronunciation’ he knows it’s a telemarketer and just says ‘Nope. No one by that name lives here.’",
            "Well, try to be an immigrant from a german-speaking country in practically any other country. While having “Umlaute“ in your name.... Most systems (even IN the countries that use them...) still can't process these letters and you get very strange symbols anytime you try to use such a letter...",
            "I changed my name a few years ago and had no problems except with my work, which included my dental and health plans, they took my old name and my new name and create a entirely fabricated name, think  Kormen and Raymond and they created \"Raymen\"  serious.  like WTF!!!! and it wasn't easy to get it fixed, I kept calling and emailing and they kept saying they would update my file, I would get direct deposits, but my online cheque stub would have the wrong name.  Some people.",
            "Sounds like it a combination of \"whoever receives and processes the form isn't the person that makes corrections\" (so essentially \"not my job!\") and \"I could correct this issue while I process the form but I'm don't care enough\" (so too lazy). \n\nNow a days, [this.](https://www.irs.gov/faqs/irs-procedures/name-changes-social-security-number-matching-issues/name-changes-social-security-number-matching-issues) But god knows how long you'll be put on hold.",
            ">Like I wouldn't know my own name...\n\nI am suddenly very reminded of *The Looking Glass Wars*. The protagonist is \"Alyss\", and early on, she gets hurled from Wonderland into the \"real world\". She's adopted by the Liddell family, and at one point her schoolteacher basically *forces* her to start writing her name as \"Alice\" instead of \"Alyss\".",
            "My favorite story was at the college registration desk. A kid fills out some form, signs them, and hands it over. \n\nAdult: I see you printed your surname as GONZALEZ with a Z at the top of this form, but on this form you filled it out using GONZALES with an S. Which is the correct spelling? \n\nKid: Yeah. No problem. Whatever. \n\nAdult: No, one is correct the correct spelling and that is the spelling you should use. \n\nKid: There is really no difference. Use one or the other. \n\nAdult, gathering the papers: Look. Take these home and and ask your mother how to spell your name.",
            "My first name is a double name. My last name is also a double name. And my middle name? Thats a simple very international name. Does people remember my full name? Nope. Do a lot of people butcher the order of my names when they try? Every time. Do I let english speakers use my first name? Hell no. It sounds weird and they cant get the correct pronunciation. Foreigners get the easy name.\n\nAnd dont get me started on how small the signature boxes are for most papers. It's even worse in Japan.",
            "My name was misspelled on my original SS card from when I was born and I didn’t notice it until I got married! I was never from the Admas family. SMH",
            "Only way to get shit done is threaten to not pay them.\n\nOur realtor ignore our requests for an oven repair for 9 months and only fixed it when I said we wouldn’t be paying rent anymore on a house that wasn’t properly functional.",
            "> Of course the form would come by mail pre-filled, with name and details, and also some quite accurate amounts, because the state knows already pretty well how much you make.\n\nThe US could do that.  But we don't.  Because a few software firms that make money in tax prep lobby hard against it to seek their rent.",
            "To get my passport I had to send my birth certificate and social security card along with a form. I pretty much expect my first name to be butchered, it's hard to pronounce and sounds nothing like it's spelled (think Saoirse for example). My middle and last name are really simple with my middle having a couple extra letters (so something like Saoirse Sarah Jones). \n\nI get the passport and...my MIDDLE name is misspelled. My MIDDLE name. You know, the one that was on all THREE documents I had to send in. The one that was fairly easy to say and spell? That one. To get it fixed I have to send, you guessed it, ALL my documents back. Why? You didn't read them the first time\n\nSo what I'm trying to say OP is, welcome to beauracratic hell. You sound like you might make it.",
            "My mom did the same exact thing. Her forms all said Ruth, even though her name is Kathi...? They refused to fix it until she said something along the lines of \"Huh. Well since I'm not Ruth, I guess I don't have to pay these taxes.\"",
            "France? When I was living in France they misspelled my name too. Middle name Lewis, they insisted on it being spelled Louis.",
            "I live in a Spanish speaking country in South America. It looks like even the simplest name John is difficult for some people. I’ve encountered the following variations: Jhon, Jon, Yohn, Yhon, Yon, Joon, Jonh...",
            "My name is a three letter name with V in it. So many want to spell it with a W instead. It's a common enough alteration in this country sure, but if I spell it out and you still get it wrong? It's infuriating!!",
            "I think my favorite thing about this story is that the first couple paragraphs are basically there up make fun of how old and backwards the American tax system is. Lol",
            "I feel like the way the government works (assuming this is the USA?) that this could have really backfired and ended in even more headache for you... but good on you for spurring on the corrections to finally happen and getting a bit of sweet satisfaction in the process!",
            "The one things that the US tax system *does* get right is the withholding. I can’t imagine having nothing withheld, then having to pay thousands, maybe tens of thousands, in one lump sum each year.",
            "Wonderful job. Superb execution all the way to the end.",
            "I wonder what I could do with this knowledge. I never bothered to change my info through two marriages, and nobody seems to care. It's still my birth name on my driver's license, which I obtained 33 years ago.",
            "Just curious, but what country are you from? The way your revenue service treated you was quite atrocious...",
            "Brzenczyszczykiewicz?",
            "My first name is a word. An actual, in the dictionary, English word. Not an obscure or oddly-spelled word either. No one ever spells it right. I have a weird last name too with multiple capital letters, so I'm just eternally fucked when it comes to anybody trying to spell my name. I feel your pain!",
            "I work with insurance companies submitting claims to us and I’m slightly horrified at how many people’s names come over misspelled. Claeb was the last one. I had to confirm with the insured his name was, in fact, *Caleb* and tell him he had to contact an adjuster to get it fixed for the paperwork.",
            "Misspelled/mispronounced names - UNITE!!!",
            "We always get other people's mail and we would write wrong address on the envelope but the mail carrier would just ignore it and leave it in our mailbox.\n\nSo our parents would just take the mail and toss it in the recycling, envelope and all without opening it, since it's not our mail and someone else's mail",
            "\\*applause\\*",
            "Any time someone says 'I can't do it because blah blah blah' it's just a polite way of saying 'I'm too uninterested in the problem to actually do my fucking job, even if that means going to my boss to get the necessary access to get this corrected'",
            ">Clerk: mouth is gaping, eyes are so wide open they're going to pop out\n\ntf does the clerk care for?",
            "This makes me happy that i have a simple ass name",
            "Fuck that. I wouldn’t have paid from day one.",
            "My last name is Richmond but some people write richman",
            "10 bucks says this is France",
            "Where I work we have to search for people with DOB and surname. If there is a hyphen in there it will accept that. If someone has a double surname with no hyphen just a space it will not accept that at all. I have to add a hyphen to take it out at the next stage. It always confused new startes though!",
            "Decent of you to warn them so you didn't later have to make that argument in a trial.",
            "A very satisfying story, /u/ThomPudding!",
            "Oh my gosh that’s PERFECT! My boyfriend has an Americanized polish last name and no one spells or pronounces it correctly, he also has a very common first name but spelled without the E and people are ALWAYS butchering his name. So this sounds like something he would do!",
            "I don’t use the toll road much but I have, by mistake. I now get a toll bill with my first name as my last name. I refuse to pay it because that is not me.",
            "Similar here. It's just stupid why your name appears correctly on ID but not tax form as both are issued by the government. They really need to build one big system to store the data.",
            "I have a double-barrelled surname which is hyphenated. The name themselves are both very common, but the concept of a double-barrelled surname seems to be lost on so many people. Dropping the hyphen, dropping one part of the surname, entirely different names replacing the entire name, you name it (seemingly what they do), it's probably happened. \n\nMost things I can just ignore, mistakes happen, whatever, move on. But with my name I find it infuriating that people seem to be lackadaisical with what I feel is one of the most basic things. It's feels like my existence is in some way being disregard, which seems to be juxtaposed with the primary offender in this case, the NHS.",
            "My youngest is named Martha Lucia. But we call her Luci. (Unless she's in trouble, and then she's called variations of her name depending upon severity of her actions)... Many times when registering her for school and spelling her name LucI, I've gone into the classroom and her name is spelled LucY. I mean the teachers can read, right? And they were teaching her how to spell her name and were spelling it wrong. Thankfully I caught it day one the first time, and now I know to check for it.",
            "I'm really disappointed the government finally got their shit together for this, i was rooting for you to not have to pay taxes for a year, or more if lucky.",
            "My mom is immigrant in my country, and her name always trips up people. If I ever need to give her name, I simply get my ID card and say that it would be easier to copy. I struggled enough that I learned my lesson over the years. Funny thing is, that while her first name is more difficult than her last, it's always the last name they have more problems with. In many settings, where people get called by their last names for politeness sake, she is the only one who gets called by her first name.\n\nAlso, for years, different IDs had different spellings because it was translated from a language with a different alphabet. Offically my mom has no idea which is the right one, she just started sticking to one of them.",
            "Yeah, usually my tactic too when someone cuts off part of my name is to ignore them until they actually use my full name. It's something like the local equivalent to John Adam Smith that is regularly shortened to John Smith. That's. Not. Me.",
            "I got a speeding ticket once. The cop wrote my name wrong. Wrote my social wrong. Wrote my bday wrong. Like he was drunk or some damn thing. Went to court. Couldn't find myself on any docket. They suspended my license for not showing up, but when I went down there they couldn't find me in the system. They couldn't figure out how the misinformation on the ticket translated to my actual license. License got canceled out. Charge got canceled out. It was a ckusterfuck. I never got another license due to health issues but damn it was a mess.",
            "My aunt (uncle’s wife) immigrated to the US from Thailand. Immigration removed 22 letters from her last name because it was too long.",
            "r/unexpectedIRS",
            "I swear these actions are a copy paste of my experience with MILL Life insurance that I shared through FB a decade ago.\nSharpies, post it's,  everything. \nThey finally got the address right on the cancellation notice without cause.",
            "I love it!",
            "This title got me dying",
            "You'd be surprised how often my first, middle, AND last name get misspelled.",
            "> Of course the form would come by mail pre-filled\n\nI'm Swedish, so I agree, but you know America doesn't do this, right? They have to do it all by themselves. It's stupid.",
            "My name is spelt weird so everyone always spells it wrong! It’s so annoying especially when you need it for important documents and you have to chase them to correct their mistakes",
            "Over here when you have a company car, you pay taxes on it (a lot, like in 4 or 5 years you have payed for the complete car). Unless you don’t use the company car for private travel. Now my job switched offices and I had to travel over 400Ks a day to get there and back, so the company gave me a car for this. And after some hassle I got a letter from the tax office, stating that I don’t have to pay the company car taxes and I should contact them if I should get a disadvantage because of it. So, 2 years later when I moved and got a company car I did use privately, I saw no need to knform the tax office. So until I switched jobs, I had a company car more or less for free. Saved me a lot of money."
        ]
    }
]