[
    {
        "post_id": "7xko6g",
        "author": "Inri137",
        "title": "That sure is a good excuse for speeding",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7xko6g/that_sure_is_a_good_excuse_for_speeding/",
        "score": 16609,
        "num_comments": 378,
        "created_utc": 1518637147.0,
        "selftext": "I originally posted this in as a comment in an askreddit thread but it was removed, so I'll repost it here because it's a pretty cute form of malicious compliance by a police officer.\n\nI was a physicist at an engineering school and the older faculty liked to tell the story of a long-gone graduate student who tried to get cute with a police officer. He was speeding (going some 20 over the limit on I-95) and gets pulled over, and the cop asks him why he was speeding, etc. etc. Being a physicist, he explains that the sudden cold snap overnight caused his tire pressure to fall and he was speeding because the faster rotation of the wheels increases the heat and pressure within the tire and it was safer to be driving slightly faster on pressurized tires than at the speed limit on underinflated tires.\n\nThe cop, amused, asked if what he said about tire pressures and speeding was true, and the young grad student replies \"yes, absolutely, I'm a physicist at MIT.\" The cop then goes back to his vehicle and returns with two tickets: one for speeding and one for knowingly driving with underinflated tires (\"driving an impaired vehicle\" or something like that).\n\nNeedless to say this poor fellow became a very good example of times when intelligence is not a substitute for wisdom, and why it's poor form to flaunt your education to get out of being an asshat in traffic or otherwise.",
        "permalink": "/r/MaliciousCompliance/comments/7xko6g/that_sure_is_a_good_excuse_for_speeding/",
        "comments": [
            "This one reads like a modern day Aesop’s Fable",
            "Intelligence: Knowing that mushroom is poisonous  \nWisdom: Knowing not to eat that mushroom",
            "The definition of malicious compliance. Even asks him if he's sure. Love it!",
            "Wait so does OP go to MIT?",
            "Similar excuse did get me off of a speeding ticket. I told the state patrol I had new tires installed, which I did, and they were bigger then my old one. The dealership was unable to calibrate my speedometer the day I got them and I didn’t realize how much off it really was. \n\nHe explained the reason behind it, and to have a nice day. \n\nI was also only doing 13 over. 68 in a 55. ",
            "Intelligence may not be a substitute for wisdom, but deception is a charisma check anyway",
            "Isn't the speed limit on most of I-95 (around MIT) only 55mph? Lots of people go 75",
            "My grandfather was a scientist he always used to tell a story about getting out of a speeding ticket by telling the cop that the faster that he got home the less time he spent on the road therefore making it safer. Apparently he was so convincing or entertaining the cop let him go. Not sure if it was just a tall tale. Here he is very accomplished guy. Proud to call him my grandfather Discovered the Calvin-Benson cycle for photosynthesis \n\nhttps://en.m.wikipedia.org/wiki/Andrew_Benson",
            "Hahaha great story.\n\nTypical Physics student, too, both for making up explanations and for trying to show off their education. Source: am Physics undergrad.",
            "Better off just saying the inflation messes with the speedometer because you travel a different distance per revolution. At least that way you can say you weren't trying to speed.",
            "This is why I don't talk to police other than the required stuff. In 99% you are making it worse. I don't know about other countries but here they ask you \"do you know why we pulled you over?\" and if you know why and say it they _can_ presume negligence which doubles the fine.",
            "Yeah. My brother in law is a cop and the first thing he told us about dealing with a cop is “if they ask you why they pulled you over, say no. Even if you do. Because if you say like “yes officer I was speeding” they’ll probably go “no actually it was because of your broken taillight. But since you admitted to speeding take a ticket for that as well”",
            "I've heard another funny story about speeding, it happened in the UK.\n\nCop stops a man for going a bit over the limit. He asks the driver why he was speeding. The man says, \"You see, I found out today that it takes 7.5 minutes for alcohol to get into the blood stream after drinking. I just downed two double whisky's because I live not far from here and, *'looks at his watch'* I still have four minutes to get home.\"\n\nThe cop laughed, did the whole licence check stuff, gave him a breathalyser test (which showed zeros) and let him go, because it was a good joke. ",
            "Only 20 over? On I-95? That's basically keeping with the flow of traffic. Looks like he was just hit with some bad luck there.",
            "Kind of like the guy who gets pulled over for not using his turn signals.  Cop originally going to be nice and just write a fix-it ticket for a broken signal, until driver states and demonstrates that they work.  Cop then changes the ticket to failure-to-signal, which ends up being a moving violation that adds points onto the license, whereas the fix-it ticket wouldn't.",
            "I thought the cop was going to ask if he knew how fast he was going, to which he would reply \"no, but I knew exactly where I was\".",
            "Reminds me of the time I got a ticket many years ago when I was young and thought I was smart. A friend who was a lawman had told me about the quota they needed for tickets per shift. So I got pulled over by a highway patrol and had no luck talking my way out of the ticket. So trying to be a smart ass I said your just trying to get your quota. He said \"nope ,I got my quota on the last ticket I'm just giving you one for the fun of it.\"  :/  should have kept my mouth shut.",
            "I was expecting him to reply \"No Officer, I don't know how fast I was driving because I know where I am.\"",
            "I once got a speeding ticket dismissed because I was clocked on a curve while the cop was stationary, so I sent them a page from a physics book on how to calculate velocity on a curve from a stationary point using calculus. Now, had they actually been able to do the calculation, it would've revealed I was necessarily going faster than what the ticket said, but I was confident that no one in the clerk's office knew jackshit about calculus. I was right. ",
            ">Intelligence is knowing a tomato is a fruit. Wisdom is knowing not to use it in a fruit salad.",
            "I heard another story of Californian police with a slightly different take on intelligent speeders. The four colour map theorem had just been proved after thousand of hypothetical configurations had been ground through computer simulations. The first such mathematical proof dependent on computers. The mathematician responsible achieved some fame for the proving the conjecture and this was enhanced by the novelty of the use of computers.  Not long after publication the mathematician responsible was caught speeding by the highway patrol.  On handing the officer his licence he was very surprised to be asked  if he was responsible for proving the long standing  4 colour map conjecture.  It emerged the officer had recently learned of the proof at night school.  The mathematician was let off with a warning",
            "Cop here: I responded to a collision one time and when I arrived found that it was a simple rear-ender. There’s typically no argument out of the at fault driver, but in this case the woman who was at fault claimed her brakes “went out every now and then”. My response “Oh that’s terrible. Well I won’t cite you for following too close then, but I’m going to have to cite you for operating an unsafe vehicle. And I’ll go ahead and get our tow service on the way since I can’t let you drive the car until the brakes are fixed. The tow bill is only $200.”  Needless to say, she started backing of of the “bad brakes” story and gladly took the following too close ticket. ",
            "I had something similar happen to me. \n\nI was young and stupid and got pulled over and thought I could get out of it if I said my speedometer was broken. \n\nWell he ended up writing me two tickets just like this guy. When I went to court I told the judge I lied to the cop and my speedometer worked fine. Judge asked the cop if he had any proof my gauge was broken and the cop replied \"other than what he told me, no\". The judge threw out that ticket and I only got the speeding. \n\n",
            "/r/iamverysmart should like this",
            "Cops aren't there to judge whether you were wise or not. They're not even supposed to judge whether or not you were safe (unless there's a law about that). They're there to judge whether or not you followed the laws.",
            "I love this.",
            "r/TalesFromTheSquadCar",
            "As they say in the land of Senioritis, \"there's a time and a place to be a pedantic ass.\"",
            "Gordon freeman late for class again I see...",
            "r/therewasanattempt to get out of a speeding ticket",
            "Speeding ticket on I-95? Must have been in Virginia. ",
            "https://youtu.be/9UUWl3tKY_I",
            "You can tell it's fake because no one's going 20 over on I95.\n\n",
            "In my experience, going 20-over on I-95 is just keeping up with the flow of traffic. ",
            "I once got a bogus speeding ticket. Apparently “my girlfriend just started having an allergic reaction in the car and I’m going to the hospital” is not a valid reason to go 10 over.",
            "You can tell it's fake because no one's going 20 over on I95.",
            "This is why lawyers don't announce themselves to cops when pulled over for speeding.",
            "So what you’re saying is... you were a physicist at MIT.",
            "This did not happen.",
            "This would also fit in nicely with r/iamverysmart",
            "I think you meant to say \n\n''wisdom is not a substitute for intelligence''\n\nStudying made him less ignorant, but he was still stupid enough to implicate himself in another ticket. \n\n",
            "Being a dispatcher, I have this one deputy who does this all the time when people try to say their speedometer is messed up or some other excuse. He is such a smartass though that it really never surprises me.",
            "Also, slightly underinflated tires will have more traction on dry pavement because of the increased surface area of the tire making contact with the road.\n\nNot a physicist but, I used to drive SCA rallies, and most drivers would run their tires at about 28 psi.",
            "This helps explain why my incredibly intelligent rogue makes stupid-ass decisions. ",
            "Love the cop’s response. “Okay douchebag, I gotcha now...” lol",
            "r/iamverysmart",
            "r/Iamverysmart",
            "I had a co-worker get out of a ticket in a small town in Missouri.  We were field technicians for an engineering firm and regularly carried nuclear densitometers, which are used to test for how well soil has been compacted.  They have a small piece of thorium in them, and he claimed to the judge that the radioactivity interfered with the cop's radar gun.\n\nHe actually got out of the ticket, which was good news for the rest of us, as we were always going through that town, and it was notorious for its speed traps.",
            "You should cross post to /r/talesfromthesquadcar",
            "And that cops are assholes. “You’re smarter than me but since I’m in control I’ll use my ‘authority’ to give you a spite ticket.” \n\nHope the MIT kid would do it again. ",
            "[removed]",
            "I would say wisdom is not a substitute for the intelligence. He was not even a bit intelligent in this situation, an intelligent person wouldn’t dig their own grave.",
            "> Needless to say\n\nIf it's needless to say then don't say it. If you have to say it then it isn't \"needlesss to say\".",
            "Loved this. "
        ]
    },
    {
        "post_id": "1296lij",
        "author": "Totknax",
        "title": "Forced prayer? You asked for it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1296lij/forced_prayer_you_asked_for_it/",
        "score": 16601,
        "num_comments": 1199,
        "created_utc": 1680401082.0,
        "selftext": "Some info for context. I have less than zero religiosity. I'm not saying god(s) doesn't exist. I just haven't seen credible, replicable and verifiable evidence that proves his/her/its existence. On to the story.\n\nMy wife and I attended her sister's house warming party earlier today. Her sister's mother in law, whom we are just meeting for the first time, is apparently a devout, outspoken and annoyingly preachy Christian. The father in law is chill.\n\nThe mother in law, let's call her Caryn, asks for all of the guests' attention and for some incomprehensible reason, orders me (as in no polite request, no please, etc) to \"pray for the food in which we are about to partake in\". I guess me holding the fine cutlery while chopping up some Costco rotisserie chicken = leader of men in prayer (WTF?).\n\nWife's sister interjects \"Some of our guests don't share the same faith that we have. If it's alright with you, can we just have a moment of silence so we can all offer thanks in our own personal ways?\"\n\nBefore she can finish, Caryn cuts her off and says \"It is only right to offer thanks and praise for our lord and savior, blah blah blah\"...\n\nCaryn promptly points to me with her index finger and sternly commands:\n\n\"u/Totknax, LEAD THE PRAYER!\"\n\nI say to myself silently \"MC Jackpot!\"\n\nThen out loud: \"Praise be to Allah, for he has given us all of this delicious food to consume and enjoy. Except for the dishes with pork in it and all of the alcoholic beverages, for Allah doesn't allow their consumption\"...\n\nAt this point in my \"prayer\", Caryn turns around, grabs her husband by the arm and leaves the shin dig, mumbling something about all of us being heretics and such.\n\nNeedless to say, everyone was giggling at her theatrics. Obviously the drinks and food tasted waaay better after they left.",
        "permalink": "/r/MaliciousCompliance/comments/1296lij/forced_prayer_you_asked_for_it/",
        "comments": [
            "\"I offer a prayer to the God of Costco for this delcious low cost rotisserie chicken. It is indeed one of his miracles.\"",
            "\"R'Amen!\"",
            "So. A long time ago I was with some friends working in another country. I was asked to bless the food. Cue MC; in my own language, that the priest didn't speak, I start \"dear lord... of the Rings, please let Frodo destroy the Only Ring and grant him safe passage to Mount Doom, blablabla\".\nMy friends were struggling not to let any laugh burst out. The priest thanked me afterwards. Fun times. God bless the priest.",
            "I once started a large family Thankgiving with \"Lord of flies, father of goats, hear our plea...\"     I was excused and my Uncle Rick took over.    And on a positive note, I've not been asked again.",
            "Atheist of Norwegian extraction here, and I have a deep booming voice that carries a fair distance even at low volume.\n\nI'm also a Navy Vet who, because of that voice, was designated as Cadence Caller for our drill team, and my high volume got the drill instructors attention.\nAfter one performance at a Memorial Day event at Soldier Field in Chicago, a Marine DI came up, asked my DI to speak with me and complimented me on my \"very nice full rolling bellow\"\nThat sets the stage.. \n\nThe one time a preachy Xtian (who knew full well that I was a dyed in wool Atheist) \"designated\" me to lead the meal prayer... In front of her pastor. \n\nNow, I'm not what anyone would call a prayerful guy by any stretch, and in fact I learnt this prayer at my Norwegian grandfather's (also an Atheist)knee because he used it to run off the \"proselytizing pests\" as he called them, and he thought I might find it if some use one day. \n\nCue Barry White deadpan serious \n~Volume 11~ \n\nHail Frigga, wife of Odin, queen of the Aesir, mistress of the gods, we greet you, Frigga! \nWe ask you to accept our oaths and to bless our unions. To you, we wish for children who will grow into good people and make our kinship prosper. May their lands be prosperous!\n\nNeedless to say that I was never invited back. Um.. darn it? \n\nOh.. the pastor also knew I was an Atheist and the poor man just about pissed himself at the table laughing.",
            "Pastafarian Prayer\n\nOur pasta, who art in a colander, draining be your noodles. Thy noodle come, Thy sauce be yum, on top some grated Parmesan. Give us this day, our garlic bread, …and forgive us our trespasses, as we forgive those who trample on our lawns. And lead us not into vegetarianism, but deliver us some pizza, for thine is the meatball, the noodle, and the sauce, forever and ever.  R’amen.\n\nMay we all be touched by his noodly appendage.",
            "I don’t believe in any religion.  I am also a pediatric nurse of 25 years.  My experience has been pediatric cancer, pediatric trauma and pediatric ER.  \n\nMy Bible thumping sister did that nonsense to me at a largish family gathering.  Her smug look was “let’s put the heretic on the spot”.   I happily obliged.  \n\n“Thank you Jesus for taking time out of your busy schedule of giving little kids cancer to bless us with this food.  Amen”.  \n\nI didn’t look up.  I immediately started eating.  You could have heard a pin drop in that room.  Even my social norm conforming wife laughed about it later.",
            "Was expecting \"rub-a-dub-dub, thanks for the grub, YAY GOD!\"",
            "I've quoted word for word the prayer from Talladega Nights before. \n\n\"Dear 8 pound, 6 ounce, newborn infant Jesus, don't even know a word yet but still omnipotent\"",
            "I'm a preacher's kid and an atheist.  Thankfully my dad isn't a religious nut and we've had several meaningful conversations about why I'm an atheist and the faults of the church and he's been supportive of my beliefs.  Anyway, when I was a teen in the youth choir, the director told me to pray once which I absolutely did not want to do.  So I spewed out the most generic Christian word vomit possible and of course the choir director loved it.  Picture a southern black woman saying \"HOO! THE BOY CAN PRAY!\"  Thus further cementing my embarrassment.",
            "I like to bust out my Skryim prayers\n\nTalos the mighty! Talos the unerring! Talos the unassailable! To you we give praise!\n\nWe are but maggots, writhing in the filth of our own corruption! While you have ascended from the dung of mortality, and now walk among the stars!\n\nBut you were once man! Aye! And as man, you said, \"Let me show you the power of Talos Stormcrown, born of the North, where my breath is long winter. I breathe now, in royalty, and reshape this land which is mine. I do this for you, Red Legions, for I love you.\"\n\nTerrible and powerful Talos! We, your unworthy servants, give praise! For only through your grace and benevolence may we truly reach enlightenment!\n\nAnd deserve our praise you do, for we are one! Ere you ascended and the Eight became Nine, you walked among us, great Talos, not as god, but as man!",
            "[deleted]",
            " Crom, I have never prayed to you before. I have no tongue for it. No one, not even you, will remember if we were good men or bad. Why we fought, or why we died. All that matters is that two stood against many. That's what's important! Valor pleases you, Crom... so grant me one request. Grant me revenge! And if you do not listen, then to HELL with you!\n\nSpeak with the proper accent for maximum effect.",
            "I think if Jesus were alive today he'd be cracking up at that story!",
            "The best response to this is Matthew 6:5-8\n\n\"“And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. 6 But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. 7 And when you pray, do not keep on babbling like pagans, for they think they will be heard because of their many words. 8 Do not be like them, for your Father knows what you need before you ask him.\"",
            "We are Christian, and stepdaughter - who has been a church leader and preacher in her time - has dared me to say “rubadubdub, thanks for the grub” for grace at a big family meal before now.\n\nNever understood these mega-uptight people like the MIL here. Life is for living and having a bit of fun along the way.",
            "I love it! Gawd, I hate those types of 'christians'.",
            "The only thing that disappointed me is that you didn't thank Satan for the sin of gluttony you were about to partake in.",
            "My uncle's second wife used to go around the table and make everyone say a prayer before eating. First holiday we went up to their place my little brother was 2, she made him say a prayer which was basically making him repeat her doing the \"god is good, god is great\" prayer. \n\nOnly prayer for food I knew goes \"humble our hearts and make us truly grateful\", because that's how my grandfather does Grace at holidays. When I still went to church our preacher just had a moment of silent prayer before church meals. Aunt tried to tell me that it wasn't a proper prayer but shut up pretty quickly when I told her my mom's dad prays like that. She didn't enter the family in a very Christian manner so I guess she didn't want to dig herself in deeper.",
            "[deleted]",
            "So after a hugely traumatic event, I have asked my parents to let me transfer schools and indicated a very liberal and science focused Catholic boarding school. (It was ran by the Jesuits with teachers having more PhDs between them than the uni I've graduated from.) Somehow this has translated into a fundamentalist, right wing Dutch Reformed boarding school where sciences were treated as if they were the work of the devil. Also, I don't remember a single day when someone wasn't making highly antisemitic comments which to me was quite funny, considering where Christianity stems from. Cue to me deciding to lead mandatory morning prayers by reading out the Shema, all the Biblical passages where Jesus confirms his jewishness and a short concise history of Christianity's relationship to Judaism.\nWhich led to much shock, horror, hysterics and getting a dressing down by the principal. Needless to say I didn't last for long at that school.",
            "Hail Satan for he seduced Eve into eating the apple, granting us all the ability to think for ourselves and enjoy this meal.",
            "I would have straight up started with \"Hail Satan\"",
            "Sounds very much like lawyer basics...never ask a question you dont already know the answer to!",
            "\\*cracks knuckles\\*\n\n\"*Ash nazg durbatulûk, ash nazg gimbatul, ash nazg thrakatulûk, agh burzum-ishi krimpatul.*\"",
            "ironic that jesus is middle eastern which is where islam originated from.",
            "Roger Zelazny's Agnostic's Prayer from *Creatures of Light and Darkness*:  \nInsofar as I may be heard by anything, which may or may not care what I say, I ask, if it matters, that you be forgiven for anything you may have done or failed to do which requires forgiveness.  \nConversely, if not forgiveness but something else may be required to ensure any possible benefit for which you may be eligible after the destruction of your body, I ask that this, whatever it may be, be granted or withheld, as the case may be, in such a manner as to insure your receiving said benefit. I ask this in my capacity as your elected intermediary between yourself and that which may not be yourself, but which may have an interest in the matter of your receiving as much as it is possible for you to receive of this thing, and which may in some way be influenced by this ceremony.  \nAmen.",
            "Someone politely asked if my mom and I say Grace at dinner, knowing my mom goes to church. Without any hesitation, both of us said, \"Grace!\", then cracked up.",
            "May the sauce be with you.\n\nRamen.",
            "Thanks be to Imhotep for bringing fertility to the lands and providing the animals we have slaughtered for today's feast.",
            "This happened to my uncle at a thanksgiving, my family being 90% catholic, did not approve of “Rub-a-dub-dub thanks for this grub, so let’s eat.” Unironicly grandma (his mother) yells “What was that shit?!” And someone else is made to give a less memorable prayer.",
            "I’d have done the Selkirk grace\n\nSome hae meat and canna eat, And some wad eat that want it; But we hae meat, and we can eat, Sae let the Lord be thankit.",
            "I deal with this differently.\n\nI'm an atheist now but attended plenty of evangelical services when I was a teenager. I've witnessed those rambling prayer group meetings, where people don't want to give back the talking stick and waffle on interminably, blessing everything they can think of.\n\nSo if you ask me to pray I will, and I'll happily free form for ten minutes about anything that comes into my head. And god will strike you down if you even *think* of looking at your watch.",
            "I always give thanks to the farmers, the pickers, truckers, and grocery employees for ACTUALLY making the meal happen at thanksgiving.",
            "I did this to my very Christian MIL when she asked me to say the family Thanksgiving dinner prayer one year. My prayer began like this: \"Oh Lord Satan, Master of the universe, we call on to bless this food with your evilness and...\" That was as far as she let me go. I was never called on to say the prayer again. \n\nJust to be clear, my MIL and I had a good relationship. I appreciated her efforts to \"save\" me from an eternity of hellfire. She was a good person with a good heart who just happened to be a little confused about the nature of reality.",
            "Sounds like a good time for the Generic All-Purpose Prayer!\n\n\"To whom it may concern,\n\nPlease let us do, or not do, whatever it is we should do, or not do, in order to gain your favor and/or not gain your disfavor. Unless, of course, by so asking we gain your disfavor, in which case please disregard all of the previous.\n\nAmen.\"",
            "“Good food, good meat, good Lord, let’s eat!”",
            "There’s something seriously wrong with Caryn. Forced prayer is not even part of the Christian religion",
            "As chief Prophet and bottle washer of The Church Of Spam, I would not have a problem. I'd just recite The Spam's Prayer:\n\nOur foodstuff, which are in kitchen\nHormel be thy name.\nThy dinner come cooked well done\nAt home as it is downtown.\nGive us this day, our daily Spam\nAnd forgive us for wanting bologna\nAs well as those who feed us such.\nAnd lead us not into dieting\nFor thine is the meat and the gel and the gristle\nForever on my plate.\nAmeat",
            "Well done!\n\nAlthough...I might have done the prayer differently, something like:\n\n\"*Lettuce pray. Dear lord, please banish from this food that has been left out, festering, all traces of Salmonella, E. coli and all traces of pesky bacteria and such that might cause unto us projectile vomiting and explosive diarrhea.  Amen.*\"",
            "I'm pleased by this, but also slightly displeased that no mention of the Flying Spaghetti Monster, long may Their noodley appendages wave, was made.",
            "You could also do the Shepard’s Prayer:\n“Dear Lord, please don’t let me fuck up.”",
            "I was part of a youth organization in a rural town in Canada where there's a large Christian population. Every year this organization would have a Christmas dinner and the youth leader (me)would be asked to say a prayer before eating.\n\nI am agnostic and honesty was one of my top values, so I awkwardly invited everyone to pray to \"whoever they believe\". The crowd was not amused.",
            "Blood for the Blood God! Skulls for the Skull Throne!",
            "Good Food\n\nGood Meat\n\nGood God\n\nLet's EAT!",
            "\"Public prayer is forbidden and will no longer be tolerated.\" (Matthew 6:5-8).",
            "I do Simpsons\n\n“Dear god, we’re supposed to be thankful for this food, but we paid for it with our own money, so thanks for nothing”",
            "True pagan prayer: \n\nMay the body of our Lord bring health to our bodies and life to our souls. \n\n&#x200B;\n\nAnd I've seen this pass at Christian tables who didn't know I was pagan, which amused me greatly.",
            "You sound like an agnostic, welcome to the dark side.",
            "The turtle moves.\n\nJob done",
            "I've had a similar story happen to me once.\n\nSo I was standing in a rather large line at my local Wal-Mart today behind a couple families that I know from when I went to church with my family in year younger. It was the only register open so there wasn't much of another option to get my 12 pack of Mountain Dew for a party I was heading to. I was wondering why the line was going nowhere when I decided to poke my head up front to see what the holdup was. It was a little old lady who didn't have enough for her groceries and she was trying to talk the cashier into letting her get away with being short. This struck me as odd until I found out she was a mere $0.21 short of her purchase. Now all these families were just staring and there was even two making fun of her. I walked up and handed my soda to the cashier, handed him a $5 and told her to keep the change. One of the middle aged women (I knew these people, so I also knew that they all make over 6 digits) grabbed her kid and yelled very loudly, \"See that man? He's acting just like Jesus wants us to.\" For some reason this set me off, so I turned around. I haven't shaved in awhile so I'm rocking some nice scruff, a Slayer shirt, and gym shorts, so it must have been a nice sight. Very loudly, I said \"Like Jesus? Ma'am I'm an atheist who makes minimum wage and I was the one who stepped up to help her? Your hypocritical Christianity is an inspiration to us all.\" As I stormed out, a couple of the cart boys started to whistle and cheer, soon shoppers joined in and even the cashier. I gave a wave and went off with a feeling of accomplishment.",
            "I was sent to catholic school, so I can, unfortunately, recite the Hail Mary. I therefore present to you the Satanist's Grace:\n\nHail Satan, full of snakes, evil is with thee. \n Damned art thou amongst hellfiends, and the fire of thy loins, Lilith. Condemned Satan, revel in this our feast in your honour, now and when thou claimest our souls. Ave Satanas.",
            "I went to a Christian college and have multiple theology based degrees, but have since deconstructed and don’t identify with any religious system. My mom had a hard time accepting this and would constantly ask me to pray before holiday meals despite being reminded every time that I’m not Christian. \n\nWell, one time I had enough and decided I would absolutely lead prayer when asked. Sure enough, I was asked to pray before the meal. I did decide to give my family one last chance by reminding them I don’t share their belief system, but it was waved away as expected. \n\nI began, “DARK FATHER IN THE DEPTHS, I BESEECH THEE TO SUFFER THIS MORTAL’S INSUFFICIENT SACRIFICE -“\n\n-and was promptly cut off and never asked to pray again.",
            "I give you much credit for your tact and kindness. I would have started with \"Hail Satan, the giver of all things enjoyable which the unenlightened call sin\".",
            "The last time my extended family asked me to say the blessing on the food, I borrowed from the movie \"My Girl\" when Jamie Lee Curtis says \"Rubba-dub-dub, thanks for the grub, yay God.\"  \n\nThey never asked again.",
            "[deleted]",
            "If this ever happens to anyone else here, remember the FSM's Prayer:\n\nOur pasta, who art in a colander, draining be your noodles.  Thy noodle come, Thy sauce be yum, on top some grated Parmesan. Give us this day, our garlic bread…and forgive us our trespasses, as we forgive those who trample on our lawns. And lead us not into vegetarianism, but deliver us some pizza, for thine is the meatball, the noodle, and the sauce, forever and ever. R'Amen.",
            "Nice. Way to handle miss \"pray my way or not at all\".\nI hate those devout Christians. They give us normal Christians a bad rep. I mean my personal viewpoint is: Your religious views are not mine so live your life and be happy.🤷‍♂️",
            "I need to figure out a prayer for Arceus, the God of Pokémon, if this ever happens to me.",
            "Honestly any non-xtian prayer would probably set those people off. I could go into a full Hebrew one that’s totally valid, and it would probably upset the xtian",
            "Oh mighty Arkleseizure, thou gazed from high above. And sneezed from out thy nostrils, a gift of bounteous love. The universe around us emerged from thy nose. Now we await with eager expectation, thy handkerchief, to bring us back to thee. Let us pray. Oh mighty one, we raise our noses to you blocked and unblown, send the handkerchief O blessed one that we may be wiped clean.",
            "Hail Dionysus, patron god of wine and parties...\"",
            "My reverend is Al Bondigas.",
            "Or as the young subaltern in the UK army said for grace, in front of some very senior people from the Royal Army Chaplains' Department.\n\n\"God bless this bunch\n\nAs the munch their lunch\"\n\nWords were said afterwards.",
            "“Lord, on this day of thanks we would like to extend our DEEPEST gratitude for this INCREDIBLE BOUNTY of green beans you have bestowed upon us. And though you for some reason found it necessary to take our son from us, and though you for some reason find pleasure in watching us suffer... Still, we give thanks... Amen.”",
            "My favorite one I have heard was:\nShove it in, shit it out. That's what food is all about. Amen",
            "Been accosted a couple of times by well-meaning, but mildly annoying Mormon kids back home, asking if we could pray together.\n\nSo, I made up a little \"prayer\" to The Dread Lord Cthulu, so next time I can be like: \"Sure! I'd love to!\"\n\nAnd immediately (and loudly) start with: \"Hear us, Dread Lord Cthulu, and welcome us into your Dark Embrace!...\"\n\nUnfortunately (and predictably), once I was prepped for it, I haven't been approached a single time.",
            "Lovely story. As a theist myself, I always get a kick outta the fervent need for the religious to have their beliefs ratified. I mean dudes, C’mon! If you’re so sure of God’s existence you’re ready to fight with other people then you’re really just fighting with yourself and your own doubts because obviously an omnipotent omniscient being doesn’t need YOUR help in the PR dept  \n\nLike the church ladies who deflect praise by saying “it wasn’t me, it was the Lord working through me” and I’m thinking to myself, “nah if it was the lord I’d imagine it’d have been a bit more tuned “. \n\nAnyway, thanks for listening. \n\nAmen",
            "Make sure to greet her with 'As-Salaam-Alaikum' in the future.",
            "I would like to thank jesus for this meal\n\nthe immigrant who worked his ass off to grow this food, who were you thinking of?",
            "My great grandfather once lead this dinner prayer:\n\nBless the potatoes,\nDamn the meat. \nAll you little devils, \nStart to eat. \n\nI’m told he was quite the fun guy.",
            "Deer god, thank you for the venison. \nOnion god, thank you for the onions.",
            "it’s likely buddha deeply appreciates this story.",
            "thinking yall dodged a bullet there.",
            "Dig up some obscure Polynesian deity. Praise be [Tangata-Manu](https://www.godchecker.com/polynesian-mythology/TANGATA-MANU/)!",
            "I do the demon prayer from Devil in Ohio when I really wanna piss people off. They always look twice when I thank the lord of demons",
            "Bless the father, son, and holy ghost\nThey who grab the fastest eat the most.",
            "An Australian saying used as a prayer:\n\n 2, 4, 6, 8. Bog in don't wait. If you've finished, help your mate. 2, 4, 6, 8.\n\nWe say that over dinner tongue-in-cheek sometimes.",
            "I feel bad that the FIL was dragged away and deprived of that tasty Costco chicken…",
            "\"Our father, who art in Calgary. Bobsled be thy name. Thy kingdom come, gold medals won. On earth as it is in turn seven. With liberty and justice for Jamaica and Haile Selassie. Amen.\"",
            "\"I thank you Jésus for working hard in the fields and for allowing us to eat these crops you have harvested with your own bare hands, and graciously sold to Costco where we bought them.\"",
            "And lead us not into Temptations for we are tired of their dancing",
            "“Dear God: We paid for all this food ourselves, so thanks for nothin’.” — B. Simpson",
            "\"As we prepare to devour this chicken, we pray to you, unholy, dark Cthulhu, that you may slumber long before your inevitable rise to devour the souls of all who ever existed. Ia ia Cthulhu fhtagn\"",
            "Praise be to Herne the horned warrior, god protector of the Saxon people",
            "Fantastic. I’d probably go with:\n\n>\tGod isn’t real and organized religion is one of the most evil things ever invented. But here’s some food, so dig in.",
            "Normally, I tell people that prayer doesn't really do much of anything, but it looks like you were blessed.",
            "You could of did the scene in Christmas Vacation. 😂",
            "Praise be to the Flying Spaghetti Monster who touched the void with His Noodly Appendage and created the bounty before us. Ramen!",
            "I have a coffee mug that says, “Thou shall not try me. Mood 24:7” I think you deserve it. I’m not worthy.",
            "one time someone asked me to say grace and being a little kid i didn’t know what that meant, so i said “GRACE!” and dug in to the food",
            "If I was in your shoes, I'd probably have just said \"itadakimasu!\" Like the anime/manga nut I am. Lol\n\nI have seen 'Itadakimasu' translated a few different ways: thank you for the food, let's eat. Similar to Bon Appétit.",
            "No one ever asks me to pray out loud. I am a believer, I even go to church sometimes. Still, if asked, I have no idea what I will say.\n\nLord, thank you for the good sex my girlfriend and I had last night. Thanks for condoms, neither my kids or grandkids had an unplanned birth. Thanks for Taco Bell, it cleared up my constipation. And please stop the burning in my friend Todd's penis. He refuses to stay away from the streetwalkers in Cincinnati.",
            "\" Dear overlord Cthulu, thank you for not rising from the depth today and smiting out humanity. May your slumber be evermore\". Let's eat",
            "Good food\nGood meat\nGood god\nLets eat\n\nIs my favourite\nTaught it to my son who used it at age abt 13!",
            "Let us all give thanks to the Flying Spaghetti Monster, for it is His Noodliness that has provided us with this wonderful meal. May all of the non-believers see the light and join the Church of His Noodliness of Latter Day Pirates.\n\nR'amen!",
            "As an edgy 15 year old I did something similar where I started just listing off angels from Evangelion (At that point I had them all memorized) and talking about them. I actually made it quite a ways through the list before people started figuring out I was full of shit, I guess I sounded confident.\n\nWell except for my cousin who I watched like a hawk because I knew he'd be silently dying of laughter (he was)",
            "I think Bart Simpson said it best..\n\n\"Dear God. We paid for all this food ourselves, so thanks for nothing!\"",
            "Ironically your prayer was completely inkeeping with particular books of the current Christian Bible.",
            "Surprised you didn't pray to the Flying Spaghetti Monster and his transcendent noodly appendages, may his meatballs be fresh",
            "“Good bread good meat good lord let’s eat” was always the one I did under pressure when I had to. I usually gets some giggles from the older people.",
            "What I don’t understand about these is that if these people asking were Real Christians^TM , they would *know* that they are indirectly committing a form of blasphemy by even *asking* a known non-believer to pray.",
            "Lettuce pray",
            "Praise be to Lucifer, the Light bringer, the Morningstar...",
            "I like you're sense of humor. You'd fit well in our Parish.\n\nI'm a minister of religion, so I'm often asked (*not* told) to offer such prayers. People who know me are very careful and polite about *how* they ask, lest I start chanting in some ancient language.",
            "I was asked to say grace by my Methodist parents several times after I came out as atheist. I usually hit upon the same beats each time, offering glory and thanks to whoever cooked, whoever drove the produce from the port to the store, the farmers who grew the feed for the chickens, the chickens who gave their lives for our nutrition, etc. \n\n\nThey were faster to accept my atheism when compared with most accounts of coming out as atheist that I've seen, but still the process took a couple years.",
            "Thank you Louis, who discovered pasteurization, and Jonas Saulk who created a vaccine for polio, and Dr. Fauci who pushed for covid vaccination and for the ACLU and freedom from region foundation who work to protect our rights!",
            "rub a dub dub\n\nthanx for the grub",
            "Now that is some delicious compliance.",
            "Jesse’s car god prayer from Fast & Furious \n\nThank you for providing us with the direct-port nitrous… uh… injection, four-core intercoolers, an’ ball-bearing turbos, and… um… titanium valve springs. Thank you.",
            "Praise be to our Lord Imhotep",
            "Son of Ia, Slayer of Tiamat, praise be to our Sun God MARDUK!\n\nEDIT: OMG MY FIRST AWARD! Thank you  kind stranger! And thank you, Marduk Slayer of Tiamat for living within me.",
            "Ah, nothing more tolerant and loving than Christian hate.  I'm sure you all had a better time without her there anyway.",
            "I do something similar to religious evangelists on my college campus, they’ll stop and ask me if I know God loves me or something and I’ll start talking about the All Father or something and they get really uncomfortable.",
            "I would have just let her do whatever the hell she wanted while she was praying but the moment she pointed at you, good work. She gave you the stage and you showed her that they're different fucking humans living on this planet. Hopefully her brain melted a little and reconfigured in a way that accepts more baffling garbage without evidence, I mean acceptance.",
            "LMAO that' is how you deal with a \"Bible Thumper!\" Okay I'm going to steal this next time I'm asked to lead prayer!",
            "I pray for compression, spark and good burn, because the V8 is eternal, and we welcome those with compression ignition, and lesser cylinders, becouse these are people of faith too! And let the heretics of wires and pedals burn in hell untill they cleanse their soul and get their first machine spirit cranked.",
            "Jimmy Stewart in 'Shenandoah' FTW:  \n\n\n>Lord, we cleared this land. We plowed it, sowed it, and harvested it. We cooked the harvest. It wouldn’t be here, we wouldn’t be eatin’ it if we hadn’t done it all ourselves. We worked dog-bone hard for every crumb and morsel, but we thank you just the same anyway, Lord, for the food we’re about to eat. Amen.\n\nhttps://www.youtube.com/watch?v=IzzyZ1M-kVU",
            "\"Praise be to the Flying Spaghetti Monster, who has blessed us with his Noodley Appendage! We give thanks for him for this bountiful feast. R'Amen!\"",
            "\"Jesus Christ this food looks delicious! God strike me down if I'm not gonna try every fucking thing here! I'm telling you Lord, I'm gonna eat the holy fuck out of this bird! Jesus fucking Christ I'm so goddamn thankful to Costco and all these peeps for this Hella great food! Christ on a bicycle let's dig in! \"\n\nSomething like that, Sister Mary Inclusive?\"",
            "I’m a little disappointed I didn’t find this one, so for all you Gen Xers:    \nHey there, Lord, my name is Ashley Banks.    \nMy family and friends want to give you some thanks.    \nSo before this dinner’s all swallowed and chewed,    \nThank you, God, for this stupid food.",
            "We adopted this from the children's story Madeline: \n\"We love our bread, we love our butter, but most of all, we love each other.\" \nWorks well in our mixed family crowd.",
            "Never be rude to the person holding the knife. Never ends well.",
            "You could also have offered a eulogy and prayed for the repose of the soul of the Costco rotisserie chicken.",
            "Everything that reddit should be: [lemmy.world](https://lemmy.world/)",
            "My prayers would have been to Odin and Freyja, so...",
            "[Let us praise God](https://www.youtube.com/watch?v=6GkK8wS2WWc). Oh Lord, Oooh you are so big, so absolutely huge, gosh, we’re all really impressed down here I can tell\nyou.\n\nForgive Us, O Lord, for this dreadful toadying, and barefaced flattery, but you are so strong and, well, just so super.\n\nFan – tastic. Amen.",
            "I'm in training for the priesthood, and I'm *still* on OP's side here.",
            "Such an awkward situation. If someone wants to pray when I am a guest at their house, I'm willing to respect their tradition, bow my head and go with it. But I think it's rude to impose your traditions when you are a guest in someone elses and incredibly rude to call on someone else to pray not knowing their beliefs.\n\nThe family dynamics going on here. Yikes. Sister-in-law presents an incredibly non-confrontational message that probably needs to come from her own son. Then Caryn's  husband leaves with her instead of standing up to her. Seems like this dominant personality seldom gets challenged by her immediate family.",
            "Most important question...how were the pork dishes?",
            "The girl scouts taught me to sing my prayers. The following is one of my favorites, sung along to The Addams Family theme:\n\n> We thanks the Lord for giving\n> The food we need for living\n> Because we really need it\n> And we like to eat it\n> Da da da da (clap clap)\n> Da da da da (clap clap)\n> Let's eat!",
            "Hail Mary full of grace hit the ball to first base",
            "I'd like to quote from the scripture of He Who Abides:\n\nOur Dude, who art in Los Angeles,\n\nHallowed be thy handle.\n\nThy rug will come.\n\nThy chill be done\n\nAll over Earth, as it is in your bungalow.\n\nGive us this day our daily caucasian,\n\nAnd forgive us our stresspasses,\n\nAs we forgive those who stresspass against us.\n\nAnd lead us not into Simi Valley,\n\nBut deliver us from real reactionaries and human paraquat.\n\nFor thine is the lane, and the ball, and the what-have-you,\n\nDown through the ages, across the sands of time.\n\nFuckin’ A man.",
            "I think short graces are always appropriate:\n\n*Good food, good meat, good Lord, let's eat.*\n\nor *Rub-a-dub-dub thanks for the grub. Yay, God.*\n\nIf the born again, washed in blood, prideful penitents expect someone to blather for 3½ minutes it's best to disappoint them and invite them to do it themselves—out in the driveway.",
            "Praise the lord Guillaume Fierre, the great Flavor Dragon, for providing us this righteous grub, and my he continue to provide us with peace, love, and taco grease",
            "\"Yum, yum, yum. Hail Satan!\" Is what I would've said.",
            "Praise to Cthulu for this delicious food I'm about to cut into slices, unlike how glorious Cthulu will one day devour the entire universe in one bite!   *crickets chirping as Caryn leaves. Thank you, Great Cthulu, for taking the loud mouth first",
            "I laughed out loud and scared my animals. Excellent work!",
            "“I’ll go ahead and pray to the aliens that run our simulation”",
            "\"u/Totknax, LEAD THE PRAYER!\"\n\nGood food,\n\nGood meat,\n\nGood God!\n\nLet's eat!\"",
            "I love it.  It reminds me of the first Thanksgiving dinner after my mother died.  I was already cooking for my dad, my brothers, my husband, our daughter and myself, so it was no big deal to add four extra places at the table and invite my husband's family to dinner.\n\nFoolish me.  This was where I learned that his parents were devout Catholics and were deadly serious about their prayers.  My family is best described as MB Methodists, as we only were in the presence of a preacher for marrying and burying.\n\nSo, the in-laws show up just as the rest of the family is wondering id we are ever going to eat.  The turkey and ham were both rested and ready for carving, all the sides were on the table with covers, so they would keep warm.  We head for the dining room, and this is where dinner makes a left turn.\n\nMy father-in-law, turns to my father and says, \"As the head of the house, will you lead us in saying grace?\"  My dad looks at each of his children in turn, we all bow our heads and in unison, a single word is spoken - \"Grace\".\n\nAt that point, my in-laws stood up, told us we are making a mockery of their faith and left.",
            "ALL HAIL THE MIGHTY LORAX, SPEAKER OF THE TREES!",
            "I would have gone with the throat-singing thing the Sardaukar were doing in Dune, for that \"vaguely Satanic but not in a way I can explain\" vibe.\n\nhttps://youtu.be/qWK3nkJhneE",
            "She needs to learn her own religion. Heretics? It's the same god 🙄.",
            "\t\t\t\t\t\t\t\n\nPastafarian Prayer\n\n\nOur pasta, who art in a colander, draining be your noodles. Thy noodle come, Thy sauce be yum, on top some grated Parmesan. Give us this day, our garlic bread, …and forgive us our trespasses, as we forgive those who trample on our lawns. And lead us not into vegetarianism, but deliver us some pizza, for thine is the meatball, the noodle, and the sauce, forever and ever. R’amen.",
            "\"Good food, good meat, good God, let's eat.\"",
            "I've been known to use, \"Yo, godly dude.  Thanks for the food.  Let's eat.\"",
            "Did everyone who didn't leave clap?",
            "You beat her at her own game! Hilarious",
            "My go to: Bless the meat and damn the skin. Grab your fork and cram it in. Amen.",
            "Yuummmm I bet that Costco rotisserie pork platter tasted even better you agnostic heathen 😊",
            "\"Dear eight pound, six ounce, newborn infant Jesus...\"",
            "when I was a kid my dad used to do stuff like this all the time. It was really embarrassing. He has since quit, but good lord... I wish his manic episodes had been medicated. Good lord. Sometimes I still get mad when I think about it.",
            "i laughed harder than i should have lmao",
            "As a Christian, I would never dream of pushing my beliefs on others. Reading this, I was shocked at how rude this person was, and how she thinks her beliefs rise above others. She is not a Christian, she is just a bitch.",
            "Ooga booga! Might space Lizard; come down from Jupiter…",
            "In monotonous even-spoken voice: \"Ob's stürmt oder schneit, ob die Sonne uns lacht...\"",
            "I would have just done what my Dad says which is \"Rubba dub dub thanks for the grub, yay God.\" And that'd be the whole prayer.",
            "GOOD VEG  \nGOOD MEAT  \nGOOD GOD  \nLET'S EAT",
            "This is hilarious! You made my day OP.",
            "Anyone who ordered me to pray would got flying spaghetti in the face.",
            "I used to work for a well-known salad dressing company in high school, and the owners would make us all pray before every meeting. Even though at the time I was slightly religious, it still felt very weird. Being 15, I had no idea it was illegal. I tried asking my uber religious parents about it, but they insisted it was wonderful and that all businesses should do it.",
            "In a boarding school, a designated student was regularly  assigned to read a Bible passage for Sunday Dinner in the dining hall. One day, a student chose Isaiah 22:13, \"13 And behold joy and gladness, slaying oxen, and killing sheep, eating flesh, and drinking wine: let us eat and drink; for to morrow we shall die.\"\n\nWe students snickered and laughed. The teachers were not amused, lol 😆.",
            "Praise Jesus for this food, because he’s the migrant worker who picked it all day long, out in the hot fields",
            "\"Dear Bealzebob, cheers for the grub mucka.\"",
            "Would have been much funnier and more affective at getting the point across if you prayed in Arabic! \n\nShe would've shit herself right there.",
            "Good wine, good meat. Good God, let's eat.",
            "> let's call her Caryn,",
            "My dad always said \"Rub-a-dub-dub, thanks for the grub, yaaay god!\"",
            "I usually go with the classic \"rubba dub dub thanks for the grub, yay god\"",
            "All hail the Flying Spaghetti Monster and his servant here on earth the 9th and 9th Sacred Whale who has brought us this bounty of food and alleviated our drought.  R’amen",
            "[Obligatory valhallelujah](https://youtu.be/S9WWz95ripA)",
            "Too bad the meal was not pasta.",
            "Thank you, brave warrior for your service! Let's push these cultists back to the fringe where they belong!",
            "Ah yes, fight fire with...MORE fire.",
            "Has anyone suggested Aleister Crowley's Thelemic version of \"saying grace\" yet?\n\n\"Do what thou wilt shall be the whole of the Law!\n\nWhat is my will?\n\nIt is my will to eat and drink.\n\nTo what end?\n\nThat I may fortify my body thereby.\n\nTo what end?\n\nThat I may accomplish the Great Work.\n\nLove is the law, love under will.\"",
            "In the middle of Ramadan, too. \n\nIt’s all calculated.",
            "I’m not saying leprechauns don’t exist. I just haven’t seen credible, replicable and verifiable evidence that proves their existence.",
            "Imhotep protect us, and Ra guide us.",
            "ALL HAIL OUR LORD AND SAVIOR ZUES FOR HE HAS BROUGHT US A PLENTIFUL BOUNTY TO FILL OUR STOMACHS!",
            "As a Christian, I’m sorry on her behalf. That was rude.",
            "Good food, good meat; good God, let’s eat!\nRub a dub dub, thanks for the grub,\nYaaaaaaay, God!\n\n\nSaid at many a family gathering!",
            "OMG.\nDamn this is hilarious.",
            "I love this, that is perfect!",
            "You sir, are my new hero. Well done!",
            "I’d just break out a karakia at that point, if they don’t speak or understand any te reo Māori even better, I’ll say the whakataka te hau karakia and really get them going. (For those that don’t know reo Māori pronunciation, wh is pronounced f, so ‘whaka’ sounds pretty close to ’fucker’ for a non-speaker haha)",
            "Oh wow. I'm so jealous! You definitely hit the jackpot.  I would LOVE the opportunity to lead a group of devout Christians in prayer.  Here's what I would have said:\n\n\"All praises and glory to the ones who provided this feast in front of us. Today we honor everybody who contributed to buying and making this food. All of our minds came together and created this amazing selection of foods in front of us, not some magical dude in the sky, so let's give credit where credit is actually due for once. Thanks everybody.\""
        ]
    },
    {
        "post_id": "qfpurq",
        "author": "Bobdehn",
        "title": "Wash your half",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/qfpurq/wash_your_half/",
        "score": 16591,
        "num_comments": 237,
        "created_utc": 1635194397.0,
        "selftext": "I have three older sisters, and the middle one, Pat, passed away a few years ago. I was thinking about her this weekend, and remembered a story that I believe fits here.\n\nWhen we were kids, we had chores that we had to do around the house. The oldest two, Judy and Pat, had to do the dinner dishes (this was back when dishwashers were a luxury item most families couldn't even dream of).\n\nJudy, being the oldest, would try to manipulate things so she got off light. Generally, this meant Pat would have to wash and rinse, while Judy would dry and put away. The washing, and particularly scrubbing of pre-Teflon pots and pans, was a real task, and finally Pat complained enough that Mom and Dad stepped in, and said the work needed to be equally divided. If one washed and rinsed one night, the other would the next night.\n\nWell, Judy didn't like that, so she offered an alternative: each of them would wash, dry and put away half of the dishes. That was deemed acceptable, so the first night Judy went first, doing barely enough to qualify as \"half\", and leaving all the heavy scrubbing to Pat.\n\nThe next night, Pat went first, and the malicious compliance began. With Mom watching, Pat carefully washed and dried exactly half of the dishes: the bottoms of all the plates, the handles of all the utensils, and the outsides of all the bowls, glasses, pots and pans. When she finished, Mom smiled and agreed that she'd done her half, and sent for Judy, who had to wash all the tops and insides. And if some soap and water got on the part Pat had cleaned, well, that was Judy's fault; she had to clean what she messed up.\n\nAfter that, they did the dishes together, and alternated who washed and who dried.\n\ntl,dr: Oh come on, this is really short. Take a minute. Sheesh.\n\nEdit: Holy crap, never expected this to blow up like this. Thank you all for the awards, comments and kind wishes. We lost Pat to breast cancer at 70; the best thing you can do in your life is see your doctor regularly, and take good care of yourself.",
        "permalink": "/r/MaliciousCompliance/comments/qfpurq/wash_your_half/",
        "comments": [
            "Ah yes, sibling squabbling!  \n\nWhen I was 10, my sister, cousins and I all  shared a room on a vacation. My sister and one cousin were older (both around 14) and my other cousin was closer (11) to my age. Of course we quickly formed age-based alliances, with the older ones trying to boss us younger ones around. When they complained about the state of our shared room and insisted that we at least clean up our half, the malicious compliance was cued. After tidying up our own things, we  carefully swept only our exact half, leaving a clear demarcation line of dirt down the middle. The best part  (to my 10 yo devious mind) was that we took the hand-hooked round rug in the middle of the room, straightened the folds and wrinkles out of our side, and added a few to their side for good measure. \n\nActually, the best part of it was that those alliances still hold, although we are all now in our sixties. Hahah.",
            "I smiled when I read your story.\n\nI'm sorry for your loss.",
            "I had a friend whose parents had all the nice toys. I used to help her load the dishwasher when I stayed over. I asked my parents if we could also get a dishwasher. My mom told me that we had very good dishwasher—me. Hardy har har, Mom",
            "[removed]",
            "I read the title and then it was relating to dishes and thought immediately of washing only half of each item. Though I was thinking more of the left and right vs the top and bottom.",
            "Reminded me of a story about my sisters. One would have to wash and the other dry. My older sister would wash and my younger sister would just wait for everything to air dry and just put them away. This annoyed my older sister so she would pour cold water over the dishes in the drying rack to make her little sister have to actually dry them. Gotta love petty sibling behavior.",
            "This is exactly the type of petty sibling tomfoolery that permeated my childhood with my brother. We are so much better now but it makes me laugh to think back on it.",
            "This was a great read. Glad your mom was on Pat's side. And hard agree on the tldr, why are you even in subs like this if you're not going to actually read the posts? Seems pretty silly to me.",
            "I may have a dishes story myself, not sure it's malicious compliance, but it's definitely karma and petty\n\nWashing dishes was my chore growing up, it took like a few hours daily since there was Six of us. Also at the time we didn't have a dishwasher. After my Fiance now wife started living with me at my parents house while we looked for an apartment, for several months waiting for the keys to our apartment, we would keep the kitchen clean. I would even run the dishwasher just to be nice and courteous, my father would complain he was the only one who ever cleaned up anywhere and that people should stop putting dishing in the sink and in the dishwasher. He even said if the dishes are clean in the dishwasher, to just empty it and put dirty dishes in it. That's the general bases of where this story takes place. \n\nNow my mother left to visit my Grammy(mom's mother) and took my sister and fiance with her. I don't remember if both my brothers were there or not, but they are irrelevant to the story. However I had loaded the dishwasher and ran it as my mother was finishing getting ready, she even thanked me for cleaning the kitchen while she was getting ready to go. You see a little context, my Pop Pop(mom's father) had died months back from where this story took place, but she would constantly go up to visit Grammy to make sure she's alright and everything. It was hard on everyone really. Literally the next day my dad complained that the kitchen was dirty...\n\nMe:I literally cleaned it yesterday and the dishes I washed had not been unloaded yet\n\nDad: doesn't matter, besides I've done it almost every day\n\nMe: you didn't do it yesterday and my fiance and I have been cleaning the kitchen like four times a week. If not at least a third of the time still living here. \n\nDad: I highly doubt that's true\n\nMe: in that case it shouldn't matter if I don't do any cleaning in the kitchen all week\n\nDad: yeah it won't, I'll just end up doing it\n\nAfter the dishwasher finished doing it's thing, I took a picture of the inside and left the door to it shut. Now a little bit more context, at this point I was still working and I don't eat a lot. I just snacked and did my own thing the whole week. To even make my point across, I didn't use a single dish. \n\nWhen my mother finally came back, I was calling into the kitchen, so I went from the bedroom I was sleeping in to the kitchen where my mother was. For this next part, I should mention we had two houses on the property. One with a functional kitchen and bathroom, the other without one. I was living in the one without the functional kitchen and bathroom.\n\nMom: I want you to do the dishes\n\nMe: has the dishwasher been emptied\n\nMom: no, but I need you to clean your dishes\n\nMe: I haven't used dishes all week, so they aren't mine\n\nMom: they were from the other house, from your room\n\nMe: they were definitely not, who told you that?\n\nMom: your father\n\nI then open the dishwasher and chuckled slightly. I pulled out my phone and showed her the photo and the date. The dishwasher had not been emptied since I did it a week ago. Funny how my Dad complained about it yet, didn't do dishes all week. And before you comment about my Dad, we are still on good terms, but putting a one up on him was a pretty nice feeling.",
            "I wish I could upvote your tl;dr.",
            "Sounds like it could have been out of Malcolm in the Middle.  The episode where they're sharing a large fry, so they're measuring each fry so they can divide it equally.",
            "That’s a really great memory! Score one for the middle child!",
            "That's great :D",
            "My aunt told me this story about when she and my mom were kids.\n\nThey had to wash and dry the dishes.  They'd get in a fight, always instigated by my aunt, the baby.  She would get sent to her room for starting the fight, but she'd talk to my mom while my mom continued for wash and dry the dishes, through the grate in the ceiling of the kitchen/floor of the bedroom.  My aunt would always say \"ha ha, you have to do all the dishes.\" and then when my mom was done, my grandmother would tell my aunt to come out of her room.  My mom would get mad but there wasn't much my mom could do.  Then she discovered that she could go places that her sister could not.",
            "I just lost my sister a few weeks ago.  This closely described our nightly chores.  I am smiling with a tear in my eye.",
            "I love this story and it reminded me of a somewhat similar story from my childhood. \nEvery Sunday my mum would make a big roast dinner and it was the job of us three kids to wash up, dry and out away all the dishes/pots etc. My brother, who hated this task and was maybe around 6 or so at the time, could have been older but my memory is lacking, decided he needed to go to the toilet first. Off he goes and five minutes later my sister and I are wondering where he is. He was in the downstairs toilet, lying on the floor, sleeping. “I was tired.”",
            "This is some Solomon-level shit! What a great story.\n\nI'm very sorry for your loss. Thanks for sharing this memory. :)",
            "*tl,dr: Oh come on, this is really short. Take a minute. Sheesh.*\n\nthe story was great but this one deserves its own \"vote\" button!",
            "Hahahaha! This is was sheer genius! Thank you for sharing!",
            "Nice and wholesome",
            "OMFG, I died!  That is too funny.  Exactly something one of my siblings would do.",
            "Reminds me of when my sister and I were kids.  We had about 1.5 acres.  Dad would mow weekly and wanted us to rake up and put the cuttings into the compost bin. \n\nThe property had the house positioned near the front corner--so large backyard and one larger side yard with the \"front\" yard and smaller side yard making up less than 25%.   Only the front and smaller side yard had trees.   \n\nMy sister was amazing at crying her way out of chores and things not being \"fair\".   So after weeks of trying different ways to divide things up,  I volunteered to do the larger side yard and the whole back yard.   All she would have to do was the little bit in the front and the little bit on that side of the house.  She quite smugly agreed that was a good plan.  \n\nDealing with the trees involved picking up sticks before dad mowed which wasn't a lot of additional work--esp. since there was less to rake up due to the trees.  Unfortunately for her, that was also the only part of the yard that the neighbor's dog used as a potty.  She wasn't so smug once she realized that...",
            "Your tl:dr is my favorite malicious compliance",
            "We had a policy that whatever kid had the worst grades, did dishes until the next grade card.  This meant you might even get stuck doing them all summer.  Well, in 10th grade that was me.  I did those damn dishes almost every night for a year. \n\n (I later figured out how get better grades and that put an end to that.  Also, my mom said I was the only one that didn’t do a halfassed job of it, so when it became my brothers and sisters turn came about, they did such a shitty job, my mom did them.  Crap. ). \n\nAnyway, I did the dishes for a year.  The local AM rock station (this was a long time ago), played the same songs at the same time of day.  I’d learn what time a song came on and would go tune in for 3 minutes.  Every night, when I was doing dishes that winter for several weeks, Come Together by The Beatles played.  To this day, when I hear that song, I hark back to having my arms up to my elbows in dirty dishes and hot soapy water.  In fact, today, I’ll sometimes have Alexa play it while I’m doing dishes nowadays.",
            "What a great memory. Thank you for sharing this.",
            "Trying to remember if my Grandma Pat who passed a few years ago has any family in Reno..",
            "Growing up my older brother and sister alternated nights washing while I rinsed every night. They complained a couple times that I never had to wash, but when I pointed out I was working every night instead of every other night, they'd stop griping. We only dried and put away when company was over and there were too many dishes to leave in the rack. But they would pitch in to help.",
            "I was watching some reality show about newlyweds. One of them comment that their absolute least favorite chore was emptying the dishwasher and putting dishes away. Times have sure changed from when we had to wash everything by hand.",
            "The last part of this reminded me of an experience I had several years ago. My boyfriend at the time moved in with about 4 roommates. I never understood why the handles and bottoms of everything felt greasy.\n\nThey let the dishes soak in a full sink until they get washed; it was full of food floating in it etc. When they did wash them, they would literally only wash the part that they 'dirtied' while cooking - the inside of the pan, top of the plate, end of the fork. Everything else that had been in the kitchen cesspool just gets a rinse with water.\n\n\nI always washed the dishes before I used them after that.",
            "same thing happened with rubbish bins with my brother. Except one week, my bin was empty and for some reason, it was a race. \nThe following week we both took them up to the road (we lived on a mountain), but he brought mine back down to make up for the week prior, wtf?\nOur parents made him put it back up again.",
            "oh that reminds me of being told we had to dry a certain number of dishes and the first sibling doing the cutlery 🤣",
            "We were a family of 4 children, 1 too young and got light dusting duties mostly. We would rotate nights and the person who was up next got to check the cleanliness of the dishes that were done because they had to put the away before doing the next nights dishes. We were all tasked with washing our own dishes during the day (some were better at this than others). I found out who was leaving their day time dishes for night clean up and wouldn't wash my day time dishes because if they told on me, they were telling on themselves.",
            "\"Pre-Teflon pots and pans\"... Teflon cookware was commercialized in the 50s... meaning OP is.... wow... while my mom can't even hang up a WhatsApp call, OP here is a redditor.",
            "Sibling rivalry at it's best. My parents squashed all that by simply having the alternating week of chores.",
            "Our job was dishes.  My sister would \"go to the bathroom\" after supper and stay there till she heard the sink draining.  Then would come out and claim she had wanted to wash the dishes that time.  Dad finally made her do the dishes all by herself (he told her if she missed one more shared chore she would do it alone) and after that she joined us to get it done.",
            "This is a great story. A great memory.",
            "That's awesome!  We had the same kind of issues when we were growing up and it was solved by requiring each of us to take a turn at something for an entire week. So we got to wash, rinse, dry, and put away for the five of us.",
            "With my brother and I it’s the other way around, I’m the oldest but he’ll skimp out whenever he can",
            "Pat was brilliant and devilishly compliant. I love your mom.",
            "Pat was a boss.",
            "Wow. We never cooperated to the point that it was decided a dishwasher was actually an affordable thing because it would stop the squabbling, which often started during or even before dinner. Once the dishwasher arrived it was discovered in short order that nobody wanted to load or unload it; my parents rebelled by washing only their dishes. An acceptable routine involving regular clean dishes for all began in less than a week.\n\nCheckmate.",
            "Haha this is awesome! I'm sorry about your loss of your sister",
            "Classic squabbles... \n\nI haven't had to deal with that... but when it came to washing I would do it before I ate most times as it was so much easier to do it before it cooled and dried to the items. \n\nEven now it is something I do, anything that builds up wasn't used by me.",
            "I can envision this happening with my sisters. I am the middle sister and we had a chore rotation. One would be in charge of doing dishes and cleaning the kitchen, one ran the laundry and cleaned the bathroom, and one folded the laundry and cleaned the living room. \n\nIf I was mad at my sister (almost always), I would absolutely wreck her with the amount of laundry I would make her fold during my laundry/bathroom week.",
            "Thank you for sharing this lovely, and malicious, memory!",
            "That's hilarious and did not see that coming.",
            "This is the first post on my TL after I finished washing my dishes all by hand!",
            "I'm laugh crying hahahahahahah OMG I LOVE THIS",
            "It’s 1015am on a Tuesday at work. You can’t be getting a man teary eyed like this.",
            "Best tldr ever!",
            "I love it!  A true genius at work 😻☺️🤣",
            "That's great! And your tl;dr was malicious compliance itself (or it would be if someone actually asked for a tl'dr).",
            "My grandpa worked at an oil refinery and his job involved driving around the tanks with a co-worker and checking something or other. One day his boss told him to wash the work truck so Grandpa washed the driver's side only.",
            "Upvoted for the TL:DR",
            "Lol",
            "What a great story. I know what it is to lose an older sister and moments like these make me smile. Glad you have a good memory like this.",
            "This made me smile. Excellent MC!",
            "This is a great story, I hope you can use it on many new people for many years to come.  Cheers!",
            "This is wholesome as it gets!!! Thank you, I needed this!",
            "This is a fun story. Thank you for sharing your memory with us.",
            "This really made me smile",
            "Happy memory. So sad time pass so quickly",
            "Way to go Pat! I hope you encounter her energy often as you live on without her  Sorry for your loss",
            "Great story",
            "Lmao that was funny",
            " Thank mm mm mean",
            "I’m sorry for your loss. Pat sounds like she was one smart cookie!",
            "Sheeeesh! Love it.",
            "Living in an old house with no dishwasher, I can attest to how much hand washing dishes suck. I envisioned your family in my kitchen, bickering and washing. Thank you for such a warmly told tale.",
            "dishwashers being luxury\n\n1950's?",
            "Well done, and good on your parents as well. I tried something similar with my sister. My reward was a whooping and the prize of more chores, while little sister did less.",
            "I’m sorry for your loss. Also what a coincidence I’m also Pat.",
            "I love this!",
            "Love it!",
            "I approve of this",
            "I love that your mum was on board with this",
            "Well done! :)",
            "Your mom was brilliant!",
            "Glad I took the time. Xoxo",
            "Had to do this when I was younger but it was slightly different in that my sister would insist on washing because it was done first and she didn't have to put away. I'm meticulous with drying and hate having even a speck of water on a plate or a cup, so it always took me ages.",
            "This warms my rotten soul. 😀",
            "The specifics didn't happen to me, but I can attest to such times. I had 6 older siblings and such negotiations were always happening.  My mother loved to tell of overhearing one of my brothers insisting that he'd already dug half the hole and it was now the other's turn. My mother, being the cheeky broad she was, let them know that there was no such thing as half a hole. It stumped my brothers for a bit.",
            "Sometimes I don't get tldr, if the story is interesting then the whole point is to read what happened",
            ">tl,dr: Oh come on, this is really short. Take a minute. Sheesh.\n\nThank you! Someone with half a brain to realize not everything needs a tl;dr. You come here to read the stories ffs.",
            "Best tldr ever!",
            ">tl,dr: Oh come on, this is really short. Take a minute. Sheesh.\n\nSorry, I was thinking about another post and somehow scrolled to the bottom without reading.  Thank you for putting me in my place, people that demand tldrs are the worst.",
            "Why do people hang out on story subs if they don't want to read 5 short paragraphs? Good tldr.",
            "tl;dr was not helpful at all. Read the whole thing and it wasn’t even close!",
            "Thank you. Will use this on the wife later this week after dinner.",
            "Your TLDR made me properly laugh 😂 \n\nThese are the kinds of stories that get us through the loss of a loved onea and keep their memory alive.",
            ">tl,dr: Oh come on, this is really short. Take a minute. Sheesh.\n\nBrilliant. Best use of tldr I've ever seen.",
            "Your tl;dr was what made me decide to give you an upvote",
            "I'm so sorry for your loss. This is a great story that reminds me of growing up with my sister. I especially liked your TL/DR.",
            "Upvoted purely for your tl;dr. (The rest was good, too.)",
            "Touché on the TLDR",
            "Best. TL;DR. Ever.",
            "Best. TL;DR. Ever.",
            "Love that TLDR\n\nEdit: TAKE MY UPVOTE for that TLDR",
            "tl; dr:! win!",
            "Your sister sounds like she was a hoot. And I love your \"tl;dr\"",
            "Wash dry and put away. Put away\n\nPut away",
            "10/10 TLDR",
            ">tl,dr: Oh come on, this is really short. Take a minute. Sheesh.\n\nNo.",
            "The TLDR 🤣🤣🤣",
            "“Take a minute” says the boomer who’s probably retired and has all the time in the world to remember stories like this. Sheesh.\n\nEdit: I read the stupid fucking story. Sisters washed dishes in the 70’s and it was hard. Young sister is smarter than the older one. Whoo hoo. \n\nI just hate the pretentiousness of the “take a minute” like we all need some lesson on the internet from an elder to “slow down” in the world he helped create and perpetrate. Y’all some fucking nerds and I can comment on anything I want.",
            "Downvote for your shit tldr.",
            "Cool story, downvoted for the tldr though.",
            "tldr",
            "I like your tl;dr.\n\nMay Pat's memory be a blessing.",
            "cn you write a shorter tldr?? its too long"
        ]
    },
    {
        "post_id": "ds34g9",
        "author": "Skonisk",
        "title": "Want me to create the employee schedule when I know I'm getting fired? You got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ds34g9/want_me_to_create_the_employee_schedule_when_i/",
        "score": 16585,
        "num_comments": 560,
        "created_utc": 1572977774.0,
        "selftext": "This was about 20 years ago.\n\nI was working as an hourly manager at a popular american fast food place (franchise, not corporate).  I had been there several years and had accrued some vacation time. I requested a week off (months in advance) to go on a hunting trip a few states away with my dad (who taught me to shoot and hunt). the vacation time was approved by the general manager of the store and I booked the trip (non-refundable).\n\nA week before I was due to go on vacation, the head office decided to replace my general manager with one from a different store they owned. The new general manager decided he had to assert his dominance by rejecting my vacation time and stated that he didn't have enough managers available to cover the shifts. I argued that the trip was already booked but he wasn't hearing any of it.\n\nI liked my job and didn't want to leave but there was no way I was going to miss this trip. I tried everything to get him to approve the time off but he scheduled me to work that week anyway.  He said if I didn't work, I'd be fired. I told him I was going.\n\nI liked my coworkers and didn't want to screw anyone over by having shifts that needed covered so I got them all covered a few days before I left. The general manager wouldn't approve them working for me and still said I had to work. I was working the day before the trip (friday) and he knew I was leaving the next day no matter what. Part of my job was to schedule the crews shifts. It typically needed to be done by sunday for the following week, but on this day he said I had to  have it done that day.\n\ncue the malicious compliance:\n\none additional thing to note, this was about 15 years after the most popular girls name was Ashley and the most popular boys name was Michael. that means we had 8 Ashleys and 6 Michaels working there. It was normally trouble to keep from having more than 2 of them there at the same time because of labor laws.\n\nThat saturday, from 11am-2pm (lunch rush) on the general managers shift, **Every Single One** of them was scheduled at the same time. I can only imagine the chaos when he wanted one of them to do something.\n\nWhen I picked up my last check, another shift manager confirmed that it was as glorious as i had imagined.\n\nEdit: labor laws had nothing to do with 'making me' schedule them together. It restricts their availability due to school and what time they cant work before or after so its hard to schedule them all at different times.",
        "permalink": "/r/MaliciousCompliance/comments/ds34g9/want_me_to_create_the_employee_schedule_when_i/",
        "comments": [
            "I expected the schedule to read something like:  \n8:00-4:00    Ashley, Ashley, Ashley  \n4:00-10:00 Ashley, Ashley, Ashley \n\nWith no surnames",
            "Small company with 10 people.  11th person shared my first name.  He was on the software team and I was on the hardware team.\n\nI became Hard Tim, he became Soft Tim",
            "I have a male coworker with the same first name as me. People will call him Trace-he and me Trace-she",
            "Many years ago I worked at a company that two young women named Eilleen. We ended up referring to them as Eilleen to the left and Eilleen to the right.",
            "Disappointing that the head office wouldn't defend your approved time off. You might have had a case with the labor board too.",
            "I teach at a college.  One semester, in three classes, I had five Ashleys, and the five of them, across three classes, only sat in 2 desks.  That's right, each section had an Ashley sit in the same desk, and then in two out of three, the other two Ashleys set in another desk.\n\nAbout 20 years ago, when I first started teaching, I had two students sit next to one another and their names were \"Nicole Victoria Jensen*\" (Names changed).  They were both engaged to guys with the last name of Christiansen.   They were both from the same city, but went to different high schools before college.  They looked nothing alike, so I called one \"Nicole Rubia\" and the other \"Nicole Pelirroja.\"",
            "I don't quite understand. Your time off had already been approved. Did this new jizzrag retroactively deny your vacation you had already been approved for?",
            "I was hoping you were going to make the schedule with only first names, then let the GM figure it out.",
            "It's hilarious to me that managers treat all requests off as actual requests. Sure, some of my requests off are actually requests and can be changed. However most of my requests are more me extending them the courtesy of informing them I'm not going to be available.",
            "This made me think of the time I got fired from this pizza place in high school. Shit job busing tables literally constantly while being treated like a telemarketer by the patrons because I was forced to be that pushy prick saying \"you done with that yet?'.....but I deserved the firing because I had kinda already quit effort wise. Anyway, he tried to fire me in a middle of a shift......but he expected me to finish my shift for some reason. We leave the office and I just head for the door. He says where you going...you got 4 more hours on your shift? I just kept walking while I raised a middle finger and said \"home\". The fuck you mean you fire me 4 hours from now?",
            "Did you manage my dairy Queen?  Cause we had a manager that would hire any woman named Ashley just because he thought it was funny.  We had 6 Ashley's on at one point.",
            ">that means we had 8 Ashleys and 6 Michaels working there. It was normally trouble to keep from having more than 2 of them there at the same time because of labor laws.\n\nWhat do labor laws have to do with people's names?",
            "> This was about 20 years ago.  \n\nJesus my first thought is always the 80s!",
            "I work with 6 other people. My name is Tara, which is not a super usual nor unusual name. I've also been at my place for 4 years. They hired another Tara. Spelled and pronounced the same. I thought maybe they'd refer to her as New Tara as I did or Tara S (her last name initial.)\n\nNo. They started changing *my* pronunciation and then called *me* Old Tara and her Tiny Tara bc she's like 5' tall.\n\nSeriously, guys?!\n\nShe quit recently so I figured they'd go back to calling me just Tara.\n\nNo. I still get the changed pronunciation. Not a big deal, but still. Lol",
            "I’ve got an angie, Ashley, annie, and Agie working for me currently.\n\nI’m confused all the time.",
            "why is it that when any new management happens, they always feel the need to change things up?",
            "In my original D&D group, we ended up with another person joining with the same first name as mine. We ended up calling him \"New Chris\", and me \"Classic Chris\".",
            "Smells like....\n\nIndiana?",
            "My alma mater required all freshmen to stay in on campus housing their first year, and the rooms were set by the student affairs director (with some exceptions obviously). \n\nHe was widely known to place all guys named Matt or Matthew on the same floor every year. I lived the floor below the Matt floor, and it was very entertaining to go up there and call out to my friend Matt and get half the floor answering.",
            "I'm so confused on the too many people of the same name clocked in at the same time is a labor board deal.\n\nShit today we had 3 Sam's clocked in at the same time. Some days we get the triple whammy of 3 Sam's and, 3 Gage's, and 2 Dewayne's. We use last names alot especially in the Kitchen, or a weird nickname.",
            "I have two Ryan's at my work and one is 8 years older than the other and the manager. So they're big Ryan and little Ryan",
            "I would have sued the fuck out of this place. I’m pretty sure earned time is counted as wages and they couldn’t just disapprove your vacation time. I feel like a lot is missing from this story.",
            "When I was a kid the popular names were Jennifer and Michael. In 2nd grade we had 4 Jennifers and 6 Michaels in just one classroom. (I think putting them in any of the others wouldn't have helped.)\n\nThe second most popular name was \"David\". When we were grown I'm told that MIT had a student club called Daves And Mikes at MIT - DAMMIT.",
            "I once worked worked with a husband wife manager combo who had the same first and last name so for example Tina Tina, since they both had the same first name and were married.. It was interesting",
            "Ashley!!! Not, not you Ashley. I want Ashley!!!",
            "Should have rearranged your trip to hunt the most dangerous game, man... agers",
            "I know that this was 20 years ago and it's far too late to care / do anything about it, but I'm pretty sure firing someone for taking already-approved vacation time is illegal.\n\nStill, well played OP.",
            "In my highschool class there was another guy with my name. He was way taller than me, so he became Steve Tall and i was Steve Short.",
            "I wonder how many years you have to work for 1 week of vacation time and then have to go trough the bullshit of getting it approved. I call that slave labor OP.",
            "[removed]",
            "I had a manager who hated anyone he didn't hire, so he automatically hated me cause I was there before he was. So during spring break I took a week off to go back home, I had planned it 4 months in advance cause I taught dog classes and set them up 3 months at a time. I had no classes going that week, he signed off on my leave, all was in order the other trainer had to work one hour on Saturday just in case we had a walk in potty class which I offered to cancel but he said no. So I work my shift Friday 1-10 and then drive 10 hours to my grandpa's in another time zone arriving around 9 am. I go to bed and get a call at 12 pm and he is screaming at me, \"where are you? You need to get here right now for this potty class\" \"um im in Michigan, it's 10 hours away, call S she was scheduled not me I'm on vacation, which you approved\" so he hangs up. I get a call from a second manager saying he was sorry I got yelled at and it wasn't my fault and he'll talk to the store manager, I get a text the next day (Sunday) and it's my hours for the week I'm a full time employee and that mother effer reduced my hours to 4 hours just the hours I was teaching, the other managers freaked out cause this means their departments were now short as they depended on my floating abilities as I was the only employee who was store wide cross trained but he was petty and said deal with it and it was a shit show lol. So my petty ass who sets the training calendar maxed out my hours so I had somewhere around 15-20 classes I was teaching classes with 2 dogs in them and he hated it and the other managers were like bro you did her dirty your not technically her boss so you just screwed us all for 8 weeks and now we have to hire another part time in three locations just to cover her. And I didn't stop at 8 weeks I kept that shit up for a year and I took all the other trainers people cause people would come in wanting to sign up on a Sunday, Monday, Thursday and I would talk them into, Sat,Tue, Wed, Fri cause I had like 4 classes a day and she only had 1 cause \"well I don't know if she'll actually show so she only gets one class a day so I don't have to call all those people\" and the boss couldn't do shit cause I made the training calendar the shift managers were like you are our type of petty and we love it. I should note she called in all the time or would just not show up  and I would get a call to cover her on my day off. Shoot one time he called me at my other job and my boss there was like \"hold up, you know she's working and you called her to cover for someone else, so who am I going to call to cover her shift here if she leaves?\" He did let me leave under the rule if I did I couldn't change out of my work clothes, and I laughed and went into work in pin stripped pants, high heels, a tank top with a blazer over it, to a pet store where they all wore kakies and a polo my boss was so mad \"Oh it sounded urgent so I didn't change and rushed right over\" and then at 9 on the dot \"oh I can't do facing in heels I could get stuck on the ladder, I did you a solid and now I'm leaving\" clocked out and left him to clean his own store.",
            "Similar bullshit time off revocation, I just went to my doctors appointment then went to his boss.",
            "\"this was about 20 years ago\"\n\nI just upvoted at that point because I knew this was going to be good",
            "Identity theft is not a joke, Jim! Millions of families suffer every year!",
            "I work with a mat, a pat, and a nat (natalie) once a week and it's hilarious",
            "Anytime there's someone with the same name as me I always try to be called by my last name to avoid confusion, as i was always called by it by my coaches at wrestling practice so I got used to it, yet I'm always called Ian at times when there's another Ian",
            ">The new general manager decided he had to assert his dominance by  rejecting my vacation time and stated that he didn't have enough  managers available to cover the shifts. I argued that the trip was  already booked but he wasn't hearing any of it.\n\nGoogle \"estoppel\". Actually, I'll do it:\n\n[https://en.wikipedia.org/wiki/Estoppel](https://en.wikipedia.org/wiki/Estoppel)",
            "Had to reread the beginning of the story to make sure this wasn’t at an Ashley’s or Michaels",
            "In my high school Italian class of 12 or 13 boys, there were 6 Daniel's and 1 Danyen. The greek Daniel was Daniel, because his last name was the hardest/longest to say, and the rest of us were referred to by our last name.",
            "Are there really managers that much of a dick to do this to people? I hope that guy learned some empathy.",
            "How could she know he doesn’t compare",
            "While I don't know why.",
            "I know how it is to work with someone with the same name\n\nSo what we did is that we called her Cassie and me Cass (one of my coworkers called me Cass and I honesty liked it. Sounded more grown up.)\n\nSo we rolled with it. :D",
            "My manager at my store shares my name, so people call him Jish while i get called josh",
            "So...you already had time off approved and scheduled by the first manager,  but somehow the new one was able to unapprove it?",
            "Michael!",
            "[deleted]",
            "[deleted]",
            "The only qualification needed for being a manager in fast food is that you are fully prepared to shit on your own (socioeconomic) kind even though you are also stuck on minimum wage. Nothing. Else. At. All.",
            "I was on one job site where one of the contractor's names was the same as mine.  he was onsite first so he got to keep being \"greg\" and I became \"greg 2\"\n\nif i were more narcissistic, I might have been annoyed, but i found it funny.",
            "How was the trip though?",
            "Honestly, if you were getting fired anyways you should have scheduled the shifts empty. That way nobody would be there to tend the store. That or manager did the schedule himself. Win/Win IMO"
        ]
    },
    {
        "post_id": "dvxql0",
        "author": "treize_k",
        "title": "How my father got out of so many speeding tickets they had to change the law",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dvxql0/how_my_father_got_out_of_so_many_speeding_tickets/",
        "score": 16568,
        "num_comments": 710,
        "created_utc": 1573676910.0,
        "selftext": "My father has been a lawyer here in BC, Canada for more than 30 years. When he was starting out in his 30's he was hustling hard to support a stay at home wife and me, his young son. \n\nAs he was very much a type \"a\" personality with not much patience he sped on the highways, often. And he got speeding tickets, often. However, he took every single one to court and had every single one overturned. The reason was quite simple. At the time Canada was in the process of switching over from Imperial MPH to Metric KPH and all of the road signs had to be replaced. \n\nNow the BC legal code specified that a \"road sign\" was legally comprised of two signs on a pole. SEE BELOW FOR A BETTER EXPLANATION OF THE WAY THE SIGNS LOOKED\n\nApparently at some point someone in charge of replacing all the signs with the new metric ones decided that they could save a considerable amount of money by printing all the information on ONE sign. But this no longer complied with the specifics of the legal code. So he would go back to the exact sign that he was ticketed because of and take a picture of it, and then bring the picture to court along with a copy of the laws in question. \n\nHis defense was very simple. He would allow the arresting officer to take the stand and give his testimony regarding the issue of the ticket, and then show the officer the picture he took and ask them to identify whether that was the sign that he had sped past. They always agreed saying that it was in fact the very same sign. He thanked them and then dismissed them with no further questions. \n\nHe would then bring the picture to the judge along with the bookmarked page of the BC Highway Act and present the judge with the exact wording of the law, followed by his factual argument that since there was only a single sign posted, it did not constitute a legal \"road sign\" as defined in the Highway Act. As I said before, every single ticket was dismissed and all my dad lost was a half an hour of his time.\n\nThis worked for almost a decade, with him overturning literally thousands of dollars of speeding tickets until the law was changed.\n\nHe still speeds btw.\n\nTL;DR - bureaucrat cuts costs on road signs but they no longer fit the legal definition so my dad sped like a fucking madman for years with 0 consequences.\n\nEDIT: an explanation from a friendly Redditor as my telling of this story was from a recollection of several years ago:\n\nI'm old enough to remember when Ontario put the new signs up. At that time, they were a white sign with black lettering that said \"MAXIMUM\" up top, the speed in (obviously) giant font below that, and then, on a separate piece of metal below that, same width as the above sign but 1/4 the height, with black background and white text, \"km/h\". Maybe that's where the \"two signs\" part comes from. Over the years, the two signs were merged to become one piece of metal, and appeared to be two because the sign shop drew outlines around both parts of it as it had been when it was two. - from u/Jay911",
        "permalink": "/r/MaliciousCompliance/comments/dvxql0/how_my_father_got_out_of_so_many_speeding_tickets/",
        "comments": [
            "I got a friend who works as a traffic investigator for a county.  That's literally the subject of his job.  \"Is the sign lawful?\"\n\nThings like is it the proper distance from the last sign?  If it's a speed change does it give proper warning?  If it's a stop light is it visible for a certain distance approaching the intersection.\n\nHe said if I ever got a ticket to ask as part of a discovery motion to have the road investigated.  He said there's almost always something wrong with the signs versus what's required.",
            "One time they were switching the road signs around here because they had lowered the speed limit for a considerable chunk of the highway. Apparently they weren't paying very close attention because one side of the road was 55 mph and the other side was 45 mph. The kicker was that on the 45 mph side there was still a yellow caution sign advising you to \"slow down\" to 50 mph for the turn.. After calling the traffic department and complaining about this I was told that a whole bunch of speeding tickets had to be tossed out because even the officers couldn't figure out what the speed limit was supposed to be, and they assured me it absolutely wasn't supposed to be different on each side of the road. About a week later they fixed the signs after months of it being this way. I assume I wasn't the only one that called and the state police complaining added a bit of \"oh shit we better fix this\" to the equation.",
            "My dad got out of speeding tickets for years in the same area all because tree branches were somewhat blocking the sign. The sign was still absolutely readable but there was a law stating that the sign had to be 100% unobstructed. When the city decided they were over his shenanigans and cut back the tree, he did what any reasonable person would do. Took a latter out there and took a picture of the sign from above so it *looked* like it was still obstructed. The judge asked him how he could possibly not be aware of the speed limit after being stopped there so many times. My dad's reply was that was hardly the point, the law was very clear. Got out of that ticket too.",
            "There was an issue like this in the US with construction zones a decade or so ago. They made a shit ton of orange speed limit signs for use in construction zones.  Then someone pointed out in court that the MUTCD specifically says that speed limit signs must be black numbers on a white background. A bunch of tickets for speeding in construction zones got thrown out. \n\nNow the speed limit signs are big orange signs, with white rectangle in the middle with the speed limit. So it's both an orange construction sign, and a speed limit sign that's black on white.",
            "This is pretty clever, but theres no way the time he saved speeding outweighed the thousands of trips he had to take to the sign and then to court. He probably wasted days of his life doing this",
            "That is brilliant.  The only hole I can see in this is if the jurisdiction had a default speed limit for unmarked roads -- many do, even if they're not often enforced.",
            "I'm a lawyer.  Your story is a perfect illustration of the maxim that courts have to apply statutes strictly according to what they actually say, not what \"everybody knows\" the legislature intended or what \"makes sense.\"  \n\nI'm going to save your post and cite it to the idiots I encounter on reddit who do not, will not, can not and staunchly refuse to understand that the law is what it says and not something else.  I've all but given up sharing what I know on account of the abuse I get in return from graduates of the Reddit High School of Law.  \n\nHere's another case in a similar vein:  [State v. Kolisch, Oregon Court of Appeals \\(2002\\)](https://law.justia.com/cases/oregon/court-of-appeals/2002/a116109.html).  It says that a statutory mandate to cops to post a sign warning that photo radar is in use doesn't have to be aimed at the traffic being monitored because the statute doesn't specify that.\n\nE: \"to\" and 'is\"",
            "The bureaucrat was not lazy. He did his job and save taxpayer dollars. The part that messed them up was the lack of communication between the department in charge of signage, the lawmakers in charge of keeping the laws updated, and the courts responsible for enforcing the laws. \n\nThe bureaucrat was jumping the gun and sounds like someone we need working in government. \n\nUsually someone will come up with an idea, a law or change in laws will be proposed, lawmakers will pass the law or change, then the law or change will be enforced or acted upon.",
            "[deleted]",
            "I think you meant to say your dad has a type Eh personality",
            "I feel like he probably lost a lot more time doing that than just...leaving earlier and not speeding and endangering others.",
            "[removed]",
            "As it should be. It's the judge's job to point out inconsistencies between enforcement and the letter of the law and the legislature's job to fix it.",
            "I once got a parking ticket for parking in a no parking zone. Problem was I was parked on the other side of the street in a legal parking area. \n\nThis was 30+ years ago. No simple popping out my camera phone and snapping a quick photo. I had to go all the way back to my apartment and grab my camera and take photos of the sign, where I was parked, clear view of the street that there were not any no parking signs on the side of the street I parked. A bunch of different angles to make it all perfectly clear I was legally parked. \n\nThen, I had to take the film to the drug store and have the photos developed. \n\nThen, I had to fill out the paperwork that I was contesting the ticket—go to the courthouse on the date printed on the ticket and get a “trial” date—trial in quotes because I don’t know what else to call it—but a date where the judge would hear my argument. \n\nIt was all a huge huge hassle over a $30 fine. But, it was the principle of the thing. So, I got my court date and totally spaced it. Just plain forgot to go. \n\n$30 fine, plus probably another $30 in fees and penalties for not showing. I don’t remember I was very pissed at myself and the whole situation.",
            "I can't imagine judges taking kindly to this.",
            "It would have been cool if your dad just stopped speeding instead.",
            "[deleted]",
            "Dads a dick. He was wrong just good at it.",
            "This is a great story and all but I hope your dad doesn't cause an accident one day with his selfish driving. Don't think he'll be able to get that dropped.",
            "this is a very fun read.\n\nbut it's not really compliance, nor does it feel particualrly malicoius.\n\n r/cleverloophole ?",
            "Speeding around isn’t so funny when you have had friends who were killed from it.",
            "So he sped, risking injury or death, but saved time. \nHe was ticketed repeatedly, fighting every ticket in court to avoided fees, costing him only time.\n\nSeems like a lot of effort for nothing in the end.",
            "I’m sorry—who is the lazy bureaucrat?\n\nThe guy who was trying to use your tax dollars more efficiently?",
            "But wouldn't he save more time in the overall process by not speeding? Hilarious as it is, I fell like he could have saved all that time going to court for each ticket, as well as the time it takes for the officer to do his/her routine ticketing process, by simply doing the limit.",
            "My sister got pulled over for speeding right as we came out of a school zone. Now, normally we don’t use the road that the school’s on, but we’re pretty observant about signs and we didn’t remember seeing the school zone sign as we went through.  \nSo we went back down the road to find where the school zone began, and lo and behold, the sign was being heavily obscured by a telephone pole. It was hard to see and react to quickly enough unless you happened to know its exact placement.  \nThe judge threw the ticket out, and now they’ve changed the sign so that it blinks on either side of the pole to warn you, instead of it being vertical.",
            "This is a beautiful story",
            "Your dad sounds kinda like a fucking dick. Don't speed.",
            "Does Canada not have a maximum specified speed for road type? \n\n&#x200B;\n\nCurious here.",
            "I want to know how much time he saved by speeding vs. how much time he spend in court fighting his speeding tickets.",
            ">lazy bureaucrat\n\nonly because they didn't \"do their homework\" to research and update the relevant codes",
            "I got a speeding ticket dismissed by challenging the accuracy on the grounds that I was clocked on a curved part of the road, sent in a print out on how to measure speed on a curve from a stationary point trusting that lawyers are shit at math. The gamble paid out.",
            "Let me get this straight.\n\nHe sped to save time.\n\nAnd paid by wasting time.\n\nThis is still karma.",
            "The Motor Vehicle Act in BC says in section 146 that the speed limit is 50km/h in a municipality and 80km/h outside a municipality, unless changed by a sign. If the sign isn’t legally posted, then those speed limits apply, it doesn’t become a free-for-all. \n\nI find it hard to believe that in all those years your father was never charged under section 146, which doesn’t depend on a posted sign, given that his defense must have become somewhat known among the RCMP and municipal forces.",
            "Sounds like he spent more time defending his speeding then he actually gained by speeding.",
            "In short: OPs dad was a dick, and still is a dick. And that dick is going to cause a serious accident one day. So that's cool...",
            "Not to be a total dick, but your father is the most irresponsible man out there. I have absolutely NO respect for his actions. \nHaha, look how he managed to overturn all those tickets, what a man!!! \nBut all he did was endanger himself and everybody else. Those limits are there for a reason. \n\nBut hey, instead of telling him to quit driving like an irresponsible teenager, youve got a nice story to tell at Bday parties right?",
            "[removed]",
            "[deleted]",
            "[Your Dad's theme song](https://youtu.be/oKdRLlOq9nU)",
            "Can someone do the math regarding how fast he would have to have sped to save more time than it would take to go to court and defend it? r/theydidthemath",
            "Lol I’m guessing he’s some kind of solicitor; if you’re a barrister it would not be worth annoying the fuck out of all the judges in your community just so you could flagrantly speed all the time. You want the judges to like (or at least respect) you because your entire job is to convince them to do what you want.",
            "So if there isn't a legal road sign there that means he's allowed to go (was allowed) whatever speed he wants? I think in my state if there are no speed postings it's defaulted to 55mphs. Not sure what the exact law states but that's what I've always heard.",
            "Here in the Netherlands a guy once claimed that we were required by law too use metric units. And km/h isn't. The metric unit for speed is m/s.",
            "[removed]",
            "[removed]",
            "Speeding tickets aren't issued because you were not in compliance with the speed limit sign.   They are issued because you were not in compliance with the speed limit on the highway.    \nThe speed limit applies sign or no sign (ignorance of the law is no excuse or some variation of that).   \nThe only time a sign comes into play is when you are ticketed traveling over the posted speed limit that is not the regular speed limit.      \nTo put it another way, the absence of a speed limit sign does not give the driver legal right to travel as fast as he wants.  \nThere is likely more details to the story.",
            "[removed]",
            "It pays to know your laws. In my state, the police can’t legally ticket you unless you’re going more than 10 MPH over the speed limit.",
            "Wouldn't it have been easier and cheaper to only reprint the top half of the sign and leave the old bottom one up where it was?",
            "In Iceland, the traffic law clearly states the *maximum speed* within a city, outside a city and on gravel roads if no other signs indicate a lower speed. \n\nSo, not going to be able to copy his style even if the signs were in Chinese.",
            "Wow, that is... wow.",
            "Your honor, no where does it specify that speed is the \"upper\" limit.",
            "> they had to change the law\n\nWhere's that part?",
            "If I was the judge in my state, I would ask the person to turn to the page that states: \"unless posted otherwise, all roads are 25 mph.\"\n\nIf the argument was that was not a speed limit sign, then OPs dad would have had to go 25mph, atleast in my state.",
            "I call shenanigans. Any good judge or cop could've turned this back on your dad. This may have worked once, maybe twice but there's no way he was able to get away with it so many times so as to false a law change.",
            "So bureaucrats’cutting of corners, which isn’t that bad in this case and makes sense, are bad, but your dad who endangers lives is the hero? Just want to make sure I’m reading this right. My family hasn’t gotten a single speeding ticket in years with one easy trick: not speeding.",
            "Could someone please explain to me in good faith why is it okay to \"still speed\"?.. Isn't it endangering people?",
            "I'm curious as to how much overall time he saved by speeding vs. how much time he spent getting pulled over, then getting a photo of the sign, printing it, then going to court. Seems like he'd at best be breaking even on time spent, if it was as \"often\" as you make it sound. So unless he was just doing it for funsies I don't really get it",
            "I once got a speeding ticket that listed the physical address of the court room to appear in as a PO Box. Sometimes I still wish I had challenged it...",
            "All the time \"saved\" by speeding was eventually wasted when he had to go take pictures of the signs, print them, and then show up to a \"30 minute\" court hearing",
            "Your dad deserves an AITA post",
            "I'm old enough to remember when Ontario put the new signs up. At that time, they were a white sign with black lettering that said \"MAXIMUM\" up top, the speed in (obviously) giant font below that, and then, on a separate piece of metal below that, same width as the above sign but 1/4 the height, with black background and white text, \"km/h\". Maybe that's where the \"two signs\" part comes from. Over the years, the two signs were merged to become one piece of metal, and *appeared* to be two because the sign shop drew outlines around both parts of it as it had been when it was two.\n\nHere in Alberta right now a large number of them are just the \"MAXIMUM\" and the speed.",
            "No one owned a sheet metal shear to just make all the signs into two?",
            "I got out of a ticket for being in a park after hours because it wasn't posted. We took pictures of all the signs, and they didn't even need them! Case dismissed.\n\nThe next time I went there (during the day) the new signs were there stating the hours.",
            "You can change the number lol",
            "That sounds like way too much of a hassle just to save a couple minutes of driving. Having to go take a picture of the sign and having to go through the court appeal doesn't sound like \"just losing 30 minutes\" tbh.",
            "As someone who visited British Columbia over the summer have to say that you're speed limits are incredibly slow on the highway.",
            "I'd have to do.. big fail on apple.",
            "At one time in Alberta we used to have the maximum sign and below that the speed limit and below that a night-time speed. The nighttime speed was also the maximum speed that the trucks could go to. I don't know when it all changed but it is now one sign.",
            "I once got a ticket for speeding in the village next to mine called \"Wolfenhausen\". On the ticket it said I was going 65 in a 50 area in \"Wofenhausen\".\n\nWrote them back that there had to be some mistake, that I have never in my life been to \"Wofenhausen\" and actually never have even heard of a place of that name, thus it was impossible that I had sped through that place and there was probably some mix up with the licence plate or something.\n\nNever heard of them again.",
            "One would think this would be a \"letter of the law vs. spirit of the law\" kinda thing.",
            "He should make sure whether working 30 minutes and having to pay the ticket costs money.  If he does make more money working 30 minutes and paying the ticket, it actually costs more apealing to the court than just paying the ticket.",
            "Here the signs are just a black number on a white circle with a red outline, or a white circle with a black line",
            "Your dad has big dick energy.",
            "no mischief rule?  canadas a common law system no?",
            "Ironic that he saved a few seconds/ minutes by speeding but lost half an hour of his day because of it",
            "He definitely wasn't saving time by spending \"only\" half an hour in court. Speeding was probably getting him to his destination\n like 1 minute faster at the cost of having to go to court.",
            "He would've lost a full day of work fightingthose tickets in MD",
            "This wouldn't work in Virginia, for two related reasons:\n\n1. I've been told using similar defenses that the court looks more at the \"spirit\" of the law rather than the explicit technical \"text\" of the law. Which is probably bullshit because it really boils down to,\n2. VA *loves* speeding ticket revenue and the GDC will never ever let you off the hook.",
            ">he still speeds by the way\n\nThe story is top class malicious compliance, but like... also maybe just don’t speed ? Why put lives at risk to get somewhere 10 minutes earlier. I don’t think it should be lauded or something to be proud of tbh",
            "In Oregon a lot of the speed limit signs just say \"SPEED\" and omit the \"LIMIT\" (Although on the Interstates they say SPEED LIMIT for the most part) and it turns out a past governor wanted to change the law such that the number on the sign wasn't the maximum speed you could go, it was the speed you had to go.",
            "Many years back I was in traffic school and the cop giving the class told us a story.  He did traffic enforcement and was sitting under a speed limit sign with is radar gun.  The sign said 35mph.  He'd given 6 tickets so far and everyone kept saying the speed limit was 45.  He was in the process of writing up ticket number 7 when a city truck rolls up...takes the 35mph sign down and puts up a 45mph sign.  He tells the person he pulled over they could leave and proceeds to the chief's office.  Drops the 6 tickets on his desk and tells him that he has to fix all 6 tickets because they're invalid.\n\nTurns out the speed limit on that road had been changed...but nobody bothered to tell the police.",
            "Did they not have a law that stated what speed you could drive if no sign was posted. For example, in Ontario, if there is no speed sign posted the speed limit is 80Km/h outside of town. I don't understand how this would not apply if he is calling the sign invalid.",
            "In the US all you do is put not guilty then call and reschedule. There's like a 1% chance the officer shows up.",
            "If you add up the time he saved speeding (and putting people's lives in danger) and measured it against the time spent in court and the cost of not being at work, I wonder if it was worth it?",
            "Reckless driving is never cool or okay, even if your country is too cheap to change signs to those they should be. Your dad could have killed someone. But it’s cool cause he got some lols out of it?",
            "Wow. I thought (in England and Australia at least) that there was a default speed limit for the road unless otherwise signed. In which case, that wouldn't work.",
            "When my dad got caught speeding he stole the sign and threw it in the river. And contested it that way. Not sure if he won though.",
            "Hey but fuck everyone else on the roads that those speed limits are protecting ...",
            "Maybe your shithead of a father should try to drive at a reasonable speed and not endanger everyone else and then jerk himself off to a moronic technicality.",
            "Reminds me of a similar story...friend of a friend used to get out of tickets all the time...this was before radar guns were ubiquitous so i doubt it would work much now...what used to happen is the cop would see you speeding by from his speed trap, fall in behind you and verify your speed based on what his speedometer read\n\nAnyway dude was a mathematician so he put his skills to good use. He'd bring one of those easels with the paper sheets on it with to do the math on so everyone could see, but he's only break it out AFTER questioning the cop. Basically what he would do is ask them at what point they first identified him as speeding and establish a 'starting point' ask them how long they followed him for and where he was pulled over.  The case is months after it happened so the cop doesn't remember exact details, how long did I follow him? oh 90 secs maybe? oh really and we only traveled 1 mile in that period? Hmmmmm, [breaks out easel, does math], that's only 40 mph officer, and that's a 55 mph zone. Dismissed everytime :)",
            "This is absolutely fantastic! Especially that he was so organized.\nMakes me think he must enjoy the Coquihalla ~~raceway~~ highway",
            "[removed]",
            "That was a fantastic tl;dr",
            "He still speeds?\n\nSo what's his current trick to get out of tickets?  Since he seems to be speeding everywhere does he just bill the client he's speeding to?",
            "This would kinda work in California because if there is no valid speed limit sign it defaults to unposted 55 MPH.  So I'd you got written for 53 in a 35 it would save you.  But if you were doing 78 in a 65, arguing the sign is invalid actually works out against you.",
            "If I was a cop and I pulled your dad over I'd just be, \n\n\"You know man, I could write you a ticket but we hear about you at the office all the time so I'm not gonna waste my time, just slow it down man.\"",
            "\"I'm self-centered enough to flout the spirit of the law and get away with it due to a loophole because getting to my destination five minutes early is more important than anyone else's lives on the road.\"",
            "[Have I got a 2. He sucks.",
            "Yeah but a half hour for a lawyer could mean around $100 dollars in wages, depending on specialty.",
            "Couldn't they have countered with \"speed limit is 50 km/h unless otherwise posted\"? Or was that not a detail back then? If it was, I would assume that once it's been determined that a \"one piece sign\" is effectively not a sign, it could equate to not being posted and therefore default to the 50 km/h rule.",
            "This happened a few years ago in my (Australian) state. One of our freeways was being widened and had roadworks for long distances, for super long periods of time.  These areas had reduced speed limits on temporary sign posts. \n\nA university law student got a bunch of tickets,  and fought them based on the temporary speed signs not meeting the required sign standards, I think for height.  They won.",
            "Heard a story about my brothers mate, he kept taking his tickets to court and getting off without any points by saying \"if I lose my licence, I lose my job, then I cant pay tax and have sign onto weflare\" Apparently if he'd actually got the point's he would of lost his licence more then 4 times.",
            "Are there notnunstated maximums in Canada? In the US, if there is no sign (or I guess no valid sign), there is a default speed limit determined by the type of road. We have to memorize them in drivers Ed. Even if the sign wasn't legit, I'm sure your father was breaking the natural speed limit.",
            "One of the many times  that I got pulled over for speeding, I took it to court and challenged it by contacting the FLDOT and getting a copy of the most recent speed survey that they did on the road. I was ticketed in a 55 zone, but the speed survey said that the speed limit should have been 70 or higher. By law, they have 180 days or something to change the limit on that stretch of road. It had been much longer than 180 days, and by law that speed limit was not lawful.\n\nThe judge reviewed the information I provided, considered it, and upheld the ticket because fuck me right?",
            "Loophole abuse is good?",
            "This is a great story but it's really not malicious compliance. He wasn't complying with anything, just making a pedantic argument that worked well because of the letter of the law",
            "My dad has “road rage”, but doesn’t usually get in trouble for it because the police in my area like my mom because she makes them cookies",
            "he probably lost more time in court than he saved speeding",
            "Your father is a great liar lol",
            "So the time he saved while speeding was spent in court? Dunno if that’s a good deal.",
            "\"He still speeds\" had me dying hahaha",
            "Since when do courts only take 30 min out of your day?  Driving there and back probably takes 30 min minimum then signing in and waiting to be called can take hours.",
            "So that's why everyone speeds in BC haha. They're all used to miles per hour.",
            "I have heard this story from about 24 different lawyers.",
            "What's his current trick to get out of tickets?",
            "He;s a hero until he kills someone. T",
            "Tbh speeding laws are there for a reason, unless they’re somehow drastically different in Canada, you have to be really reckless to get pulled over that much. Somehow your dad saves time by...revisiting the sites of his tickets on his own time and taking pictures? He wastes everyone’s time and money, risks lives, and is proud of it in order to be a pedant for a couple minutes of a commute?\n\nThis just feels wack man. I wouldn’t brag about this. Like, nice compliance and fun use of loophole, but the malice is from him man",
            "Don't you guys have a general speed limit for roads that are specified in the drivers code? Like anything above 60 is automatically illegal ?",
            "This is hilarious. What a legend"
        ]
    },
    {
        "post_id": "k75lac",
        "author": "jayda92",
        "title": "Was told that I was too uneducated to perform my job.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k75lac/was_told_that_i_was_too_uneducated_to_perform_my/",
        "score": 16531,
        "num_comments": 244,
        "created_utc": 1607166007.0,
        "selftext": "When I was a teaching assistant, I used to work as a substitute teacher for very unruly classes (aka, the classes licensed teachers wouldn't accept). I had full responsibility, worked all hours, and my numbers showed that my class was making great progress. I just had some bad luck, that caused me to not finish teaching college at that time.\n\nBecause I didn't had my license, my boss came to me one day and talked about how I was actually 'too uneducated and inexperienced' to teach and that I 'must have had someone telling me what to do' behind me. I told her I didn't, but she didn't believe me and told me she'll be watching me like an eagle to see if I was fraudulent (changing grades and stuff).\n\nI never did anything to my students, I'm not a cruel person and I didn't want anyone implying that I wasn't  doing my job as expected (they all got to the next year with scores higher than we would've expected beforehand).\n\nBut. I started to behave like a beginner student teacher, to my boss only! Asked really stupid questions like 'how can I make my class quiet? I'm really too uneducated to know so can you please help this teacher out by showing it?' (knowing fully well that my formerly disruptive class wouldn't ever listen to her). I called her for everything; a parent wanting to talk to me, a kid who fell down and needed a bandaid; anything. I made sure to tell her I was too uneducated and inexperienced to handle such a task and I needed to observe a true pro work. My colleagues got in on it too. They started pointing out everything I wasn't allowed to do, but expected to do and told my boss that she was being very fraudulent by expecting me to do so.\n\nIn the meantime I was discussing gamification, the need for programming and English in primary school, showing older colleagues new teaching methods and digital assistance... All the goodies.\n\nAfter 6 weeks; she was done. She called me to her office and apologized to me for saying that I was too uneducated and inexperienced. And how she was renewing my contract and got some budget to pay for half of my studies.\n\nI was happy to tell her I got a new job that would pay everything to get me my license and I would get full creative freedom, without being watched like an eagle. \n\nThis was two years ago. I almost have my license and I still work at that awesome school that hired me, after the allegations of being 'uneducated and inexperienced' at my old job. I even got a reward and a trophy from the board for doing exceptional work and obtaining goals with my students.",
        "permalink": "/r/MaliciousCompliance/comments/k75lac/was_told_that_i_was_too_uneducated_to_perform_my/",
        "comments": [
            "When the person acting the stupidest is making the most progress in work 😂\n\nProps to you for having a passion in teaching and making the education system better",
            "I was like that. Expected to know and do everything without the qualifications. I was studying while teaching. But the company I trained with went bust, when I told my boss he said he would sort it. He never did and started telling people I was just too lazy to finish studying. I think he did it on purpose to me, to use me as the scapegoat when anything went wrong. I left 6months later.",
            "At least your old boss apologized and and offered to help pay for part of your studies.  That puts her a standard deviation above the bosses we usually read about in this sub.  Most of those are never wrong and learn nothing.  But glad it still ended out best for you.",
            "people don't quit bad jobs, they quit bad bosses.",
            "People don't leave companies, they leave managers.\n\nI recently (2 weeks ago) left a marginalizing and very unfit manager.  Three weeks ago after an uncalled for reply I'd had enough and said \"Well hows this for an opinion, I QUIT\".  I was followed across the entire facility getting \"Hey, come on talk to me ..... Just give me a min to talk about this....\"  I did, just to give myself a min to calm down.  While I was being \"bamboozled\" into staying I decided to at least get something else lined up before leaving.  Which took about 96 hours to get an interview, 104 hours to get a call back for the second round and about 3 days more for the offer letter.  Which the starting offer was significantly higher than I would have ever seen at the place I was with.  Official letter hit my personal inbox about 10:30AM and I announced I was going home.  Asked when I was planning on coming back my response was that is none of your business.  Later that day I called the company HR manager to report one of their area managers was harassing a former employee and I would be pursuing further action if it ever happens again.",
            "Years ago, when I was a teachers aid as an alternative to fitting in another subject, I was in class when the regular teacher was suddenly out.  The replacement teacher was from an entirely different subject, had taught me previously, and was an alright teacher and person.\nHe came in, saw me, said “You know more about this than me, you’re in charge, I’m just going to sit in the corner and read my book so the insurance regulations are covered.”\nAt 16 years old (with the regular teachers lesson plan), I led my first class (and covered the desk with chalk dust because the simple experiment notes didn’t mention putting down a cover)\nThe replacement teachers only comment was “You still did better than I would have.”",
            "I feel bad for the students you left behind but if they ever find out what happened to you then its valuable lessons that you've taught them.\n\nMainly never stay in a job you are not appreciated in and undervalued and that they can (and are) better than others tell them.",
            "Fuckin A. Good job",
            "I had a previous boss tell me I was t qualified to answer the phones. So I quit on the spot and he started stuttering and stammering saying \n\n“well, well, well uh a professional thing to do would be to give a 2 weeks notice!” \n\n“You just said I wasn’t qualified to answer the phones and you could have someone in here tomorrow morning. Do it.” And walked away. Fucking best day of my life",
            "Good work.   \nThe world needs more dedicated teachers like you.",
            "I'm glad it worked out. I had to do something similar with my last manager. She was a super big micromanager and seemed threatened when I suggested ideas or gave feedback, I think in part because I was more experienced in the industry.  \n\n\nI stopped presenting my ideas in our meetings and just started saying \"Yep everything is going great!\" and not really talking about anything with any depth. Eventually I got promoted and moved to another manager who was just shocked at all of the ways I was being underutilized",
            "You rock!\n\nI retired early from a major urban Texas Independent School District.\n\nI did 22 years in the Navy (6 ships,  13-1/2 years sea duty)-- no PTSD.\n\n13 years with the school district--PTSD. I could not handle the caustic,  abusive, and vindictive management.\n\nI am happy you have found a school that values, understands, and respects your love of teaching, and working with children.",
            "I'm sorry.  This post is too well written and coherent.  Who did you have write it for you?",
            "A person who can admit they were wrong and give you a pay raise is good. Shows they can at least admit it and then try to keep you which is important.",
            "Wow. \n\nYou know I have a full formal teaching education, ten years of experience, presented at state conferences, blah blah blah. \n\nI still feel like I’m just now getting the hang of teaching, so mother freaking kudos to you for having those skills and being able to impress your superiors to the point where they thought you were pulling the wool over their eyes. Bravo. We certainly need people like you in the field.",
            "I am so sorry you were treated so poorly by that administrator. I was a fully credentialed teacher and had plenty of classes that challenged me in every way you can imagine. It wasn’t for lack of preparation or qualification; it was because most of the time, teaching is incredibly, impossibly hard. A person can be wholly “qualified” and a terrible teacher. A person can be wholly “unqualified” and be an amazing teacher. I am a teacher educator now and many of my teacher candidate students are better teachers than so many of their counterparts, because they have the compassion and ability to connect with kids. To be discounted in your skills simply because you didn’t yet have the state paperwork is bullshit. I am glad that administrator came around. I am also really glad you are still teaching and doing an outstanding job and didn’t let that naysayer discourage you. Congratulations on almost finishing your certifications — you are amazing!",
            "Well played! Curious in what country do you live? \n\nIn the US I tried to get some jobs in the public schools and library systems. I have my university degree but not the teaching certificate so they basically would only give me horrible pay and no responsibility.",
            "I hate to say it, but I was briefly a substitute teacher that would have warranted this administrators skepticism.  I mean, I was just filling in for teacher's sick days, and generally wasn't given a lesson plan, so it was hard to want to try to be good at my job and I was depressed, barely treading water, and being a teacher wasn't my end goal, just a way to get some cash during the 2008 recession.  Sounds like you were in a position that required much more responsibility than me, and you excelled at it.  Sorry for being part of the lazy group that makes administrators suspicious!",
            "Many administrators either forget what the classroom is like, or were so bad at actual teaching they had to move into management.",
            "You are going to be one of those teachers that save lives, only a few teachers in educational career really cared and those are the teachers I would do my work for they are the ones that would give up their lunch to make sure I did my homework for a DIFFERENT class without teachers like you I’d prolly of dropped out and be dead or in jail. Fuck school love your teachers",
            "As a student-teacher, how do you make a class quiet?",
            "I fear that in the United States, instead of getting your contract renewed, you'd be fired.",
            "Sounds like [every teacher friend I have]’s boss. Way to go for playing them and getting out to further better yourself!",
            "Malicious compliance with a happy ending. You love to see it!",
            "How blessed and fortunate every child will be who has you as their teacher!  \nNot only will you teach them their lessons, you will be an honest and hard working teacher, as well.   \nA child could not ask for a better example of a good human being.\n\nCongratulations on your studies!",
            "Your story demonstrates the differences between the teachers that live for having their summers off and those that teach because it is a labor of love.\n\nThe latter are farther and fewer, in my experience. \n\nKeep up the great work!",
            "It's unfortunate that students lose out on good teachers like you because the higher ups make their lives miserable",
            "Kudos to you. Keep up the good work, students need teachers like you. Now that class will be missing a teacher that made a difference for them all because of admin stupidity.",
            "Omg THE BIGGEST SATISFACTION IS THAT SHE CALLED YOU TO SAY SORRY 😭😭 \n\nLIKE IT'S ONE THING GETTING REVENGE, but it's another to actually hear it straight from the horse's mouth omg. Beautiful 😭",
            "I was a bad kid in school and hated my teachers, they resented me, fully Of course my fault but some one of my english teachers really got through to me, this story makes me think of those times, thank you. I hope you can continue to be an amazing teacher because i know she changed my life and i’m sure you’ve changed countless of children’s lives.",
            "I dunno if this fits; but I worked IT for 2 years. After 2 years I moved city and got a job elsewhere as a contractor for a top company. After 5 months of the position being vacant we got a new boss. Literally 1-2 month later I was ‘made redundant” by her with 1 month left on my contract, with her literally telling me to ‘maybe look into a new career’\n\nI was destroyed. But I’d dealt with her type before in a previous job for Admin. I was unemployed about 2 month. It’s now been 3 years later and I’m smashing it, albeit on a lower wage.",
            "Thanks for the story. Your boss reminds me of how frustrating I found my lecturers during my teaching degree given their disconnect with teaching practices and their weird obsession with only being academic all the time. I will always remember this quote that kept me sane throughout my training \"Those who can teach, teach. Those who can't, teach teachers.\"",
            "This is fucking fantastic, thank you for this.",
            "Worked at a restaurant that serves pseudo mexican cuisine who's logo resembles a famous symbol of american history. So my manager asked me what my goals were. My response \"work hard, do a good job, hopefully work my way up the ladder to management!\" She looks me dead in the face and says \"never gonna happen!\" Ummm bitch say what?! I say \"excuse me?\" She smirks and says \"A man can't do this job properly!\" (For reference all the management there were female and related to her) I threw my uniform shirt at her and walked out with my middle fingers in the air. Got a job at bk next day and 3 months later am promoted to breakfast manager. (She and her minions all got shit canned and replaced shortly after.) Went back there 4 years later worked a month and a half as crew before being promoted to shift manager!!!",
            "Congratulations on finding a place where you are appreciated fully, you deserve it. That said, it would not surprise me if ye olde boss was instructed to do this by higher-ups or 'concerned parents'. Some places carry diploma-fetishism to wild degrees, though I reckon they'd be better off keeping a list of things a teaching assistant is expected to do rather than fling these wild allegations around. Trouble is, sometimes only on-the-job-training isn't enough, hence why making said list and walking new hires through it is a good thing.",
            "Success is the best revenge!",
            "You're a teacher that actually tries.\n\nSomething that we're in short supply of.\n\nThank you and keep at it. Don't let the bureaucracy wear you down.",
            "Your success is the best revenge. Congrats on your efforts and work!",
            "Well done!",
            "This must be in the good old USA.",
            "I love your story! Thank you for sharing your experience.",
            "Where is this geographically?",
            "Well done and good for you. Keep it up!",
            "Where did this happen, if you don't mind me asking?",
            "Teachers like you are awesome.",
            "'Didn't had my licence'\n\n\nMaaaaybe your boss had a point",
            "It took SIX WEEKS??!?!?",
            "I think it had to do with liability instead of ability",
            "Good teachers are responsible for helping students be successful, not the system.",
            "I wish you were my teacher",
            "We need more educators like yourself. Thanks for all that you do, and please don’t let them get to you!",
            ">allegations of being 'uneducated and inexperienced' at my old job. I even got a reward and a trophy from the board for doing exceptional work and obtaining goals with my students. \n\nStupid",
            "My question is: If this principle thought you were so unqualified, why did she offer you the position? Her accusations say more about her pride in her position and school. Why would she set these kids up for failure when they are already struggling? Those kids, and all the others you teach are better off because, you actually care. Thank you and keep up the fantastic work. ❤",
            "Gotta give em the taste of their own medicine sometimes",
            "Playing dumb can be so fun.",
            "You did wonderfully, and I think we should also give a shoutout to your awesome colleagues who got in on the act! They seem really supportive!",
            "Wonderful story. I’m also really glad you could help those kids who needed it most. And for future reference, the phrase is “watched like a hawk” - not eagle.",
            "Certificates and licenses just mean you got through the course and could keep it together for the test, they don't mean shit in the real world.\n\nLook at how many people managed to get a driver's license but have no idea what they are doing behind the wheel",
            "I'm not trying to come off as mean or rude. I just find it kinda funny and ironic how the second paragraph begins. Reading about how they think you're uneducated and then I see \"I didn't had my licence\".",
            "Wait, she admitted she was wrong and offered to pay for half your studies and she's the bad person here? You are a teacher and your passive-aggressive method worked. You should at least give her some credit for learning from her mistakes. Or explain why she is still a bitch.",
            "This is a great story! Thanks for sharing!",
            "Cool cool cool. I was a  Grade B student and in 11th grade a teacher had such an impact that I started getting better marks and got into medical school. Good teachers can do that. I'm sure you'll be that teacher for many of your students.",
            "A good snapshot into the shite politics destroying our instituitions. What qualifications did your boss need lol",
            "My mom does SPED on nightmare difficulty, so I'm not sure if you do the same thing, but I am incredibly thankful for you also going into that area of teaching. Just because they have issues doesn't mean they aren't allowed to learn.",
            "I’m in pretty much the same situation currently. I’m not certified but I’m acting as a long term consultant teacher (I’m only technically considered special ed) and I’m fairly proud of my results.\nI’m hoping to take next year to get my certification but for now I’m just doing my best.\nThankfully my fellow teachers and even the administration are very supportive of my efforts.\n\nGlad you were able to overcome this. Nothing feels worse than nobody having faith in you to do your job.",
            "Oh maaaan. Your first paragraph hits HOME. I also subbed and eventually taught classes unlicensed cos no one else wanted them. Teaching is so fucking hard. Ty for your work. 💞",
            "Can someone explain to me how OP asking their boss stupid questions, and saying how uneducated & inexperienced they are made OP's boss offer OP a promotion?  Wouldn't that just feed into boss' pre-conceived opinion?",
            "You are worth more than 1,000 mediocre ‘educated’ teachers who teach.  Teachers like you make all the different in a child’s life! ❤️❤️",
            "I'm still not convinced gamification doesn't have long term negative benefits for us as a whole (or even for the individual).",
            "Congratulations on your achievements!",
            "I love the way this turned out. Good for you! Keep up the great work!!",
            "[removed]",
            "Well done you, that pissed on her chips! 👍",
            "“Because I didn’t had my license”\n\nYour grammar and syntax tell me she was on to something...",
            "[removed]",
            "Sweet!"
        ]
    },
    {
        "post_id": "84s3c7",
        "author": "HanzoShotFirst",
        "title": "Taking advantage of a poorly worded question on a music History test",
        "url": "https://i.redd.it/aeee7ew2b1m01.jpg",
        "score": 16524,
        "num_comments": 455,
        "created_utc": 1521166366.0,
        "selftext": "",
        "permalink": "/r/MaliciousCompliance/comments/84s3c7/taking_advantage_of_a_poorly_worded_question_on_a/",
        "comments": [
            "One of our History mock exams contained the question \"What happened in June 1950\" the expected answer was supposed to be the korean war started but due to the vagueness of the question some people gave answers like \"my nan was born\" which still got the marks ",
            "The best part is that you got the marks.",
            "I once asked rather involved word problem about the price of a sale item. I ended with “I have budgeted x dollars for this product. Can I afford it? One student just wrote “yes.” Dammit. I had to give him full credit because it was my own damn mistake, but I was irritated. ",
            "[deleted]",
            "When I instruct EMS training I give extra credit for calling me out on badly worded questions.  \n\nGive an example of a patient for whom an automatic defibrillator would be ineffective.  Looking for asystolic or nonshockable cardiac arrest heart rhythms.  Got \"paper cut\" and \"rectal bleeding\".  Gave extra points for humor and calling out my bad question.",
            "My math teacher has done things like this a couple of times (worded a question in a way that the answer you can give if you follow the instructions in the question is not the answer she wants) but whenever I do what you do there’s about a 30% chance that she’ll accept it. Otherwise she just says something like “You know what was meant”.",
            "Had a professor give a pop quiz. I got half credit because I \n\na. Admitted I didn’t know the answer\n\nb. Drew a picture of a dog and cat. \n\nGotta love it. ",
            "Technically correct is the best kind of correct. ",
            "What kind of teacher uses two different pens to give out scores and comments on tests?",
            "A death metal band I listen to has a guitarist nicknamed \"Bach\". On last.fm, someone got confused and [tagged Johann Sebastian Bach as the composer for some of their tracks](https://i.imgur.com/BikNHpE.png).\n\n",
            "I once got asked why Chaucer used specific language in one of the parts of the canteberry tales and I got credit for saying \"Chaucer didn't use that language. This is a translation from old English.\"",
            "During English in my junior year, we had to read a book called “Bless Me Ultima”. Occasionally some of the characters would say phrases in Spanish. One of the tests asked what chingow (it’s been awhile so I don’t remember the exact spelling) meant. I had asked someone who spoke Spanish what it meant, and it was either God Damn it or fuck. \n\nI put “Fuck” on that test, and got a hundred. For high school me, it was a great success.",
            "I fucking hate vague questions like that, it's completely the professor's fault if the question is answered incorrectly due to misinterpretation, it shouldn't affect the student whatsoever ",
            "[deleted]",
            "How is that question poorly worded? It clearly says \"**Owing to the positions this composer held during his career**\"",
            "To be fair, the fact that Bach didn't compose hip hop is not owing to his positions. He would have not composed hip hop no matter his position.  \n  \nEdit: Okay, maybe it's owing to his position in time: in the 17th century.",
            "Struggled to read the comment at first before I realized it's \"touché\".\nRegardless if you're a musician or hirtorian - you should learn how to use it Accent aigu.",
            "I love that they wrote \"touche\" on the paper. ",
            "So glad the teacher gave him full marks. Must be a nice teacher",
            "Too shay",
            "Can't understand the first half of that question",
            "The fact that he did not write those genres of music was not due to the positions that he held, however.  ",
            "Had a maths question once with a grid of 1x1 cm squares with a rectangle drawn on it, asking us to draw a perimeter which was always at least 2cm from the rectangle. In knew what they wanted because we'd been taught it that year, using a compass to draw curved corners to keep it EXACTLY 2cm away, not AT LEAST 2cm. (This was pretty early in my school years)\n\nRegardless I draw another larger rectangle with the perpendicular lines 2cm away and not finding the corners just to stick it to the man and teach them to be specific.\n\nI didn't get marks.",
            "Weird. I had a nearly identical question on a music history test when I was in college. I put “techno rap.“ Got full marks.",
            "I once had a bio professor whose tests had some questions where the multiple choice options were:\n\nA) (something)\nB) (something else)\nC) (another option)\nD) (yet another option)\nE) all of the above\nF) none of the above\nG) one or more but not all of the above\n\nI marked G for every question where the options were structures like this. (Some other questions, option G was \"more than one but not all of the above\"... So I read the options closely to make sure)\n\nI did not get the points, and when I tried to argue it, the professor just told me I should've known what he meant. \n\nI talked about it to one of my computer science professors, and they agreed I should've gotten the points. \n\nIt has been 10 years and I'm still mad that I didn't get those points!!!",
            "Imo if the question is mostly clear but there's still a minor loophole that can be exploited, I think the teacher is within their rights to not give full credit because you can't expect them to go over the wording like a legal document.",
            "Looking for grunge music house and KPop",
            "Touché",
            "Grindcore. ",
            "I am REALLY missing something here I think... What other way is there to interpret this question? ",
            "/u/BubblyWaffo this made me think of you",
            " damn. Now all I can think about is how awesome some Bach Grunge or Ska would be. ",
            "touche",
            "The real answer they were looking for is secular. ",
            "Wish I could read the teacher's comments",
            "This question doesn't make even a tiny amount of sense. ",
            "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r84s3c7?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[2PM \"I'll Be Back\" M/V](http://www.youtube.com/watch?v=jMdofhj9WKU)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/84s3c7/_/dvsrc98?context=10#dvsrc98) - Pretty sure he wrote, \"I'll be bach\"\n[TRANS SIBERIAN ORCHESTRA-TOCCATA-CA RPIMUS NOCTEM](http://www.youtube.com/watch?v=cbsWInTtY58)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/84s3c7/_/dvsobr1?context=10#dvsobr1) - Metal   Fortunately, some have seen fit to address that gap in Bach's repertoire.\n[(TAS) Brain Age \"Art Academy\" in 6:33.51](http://www.youtube.com/watch?v=GOfcvPf-22k&t=33s)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/84s3c7/_/dvsld68?context=10#dvsld68) - Imagine the possibilities.\n[[TAS] SNES Family Feud by Heisanevilgenius in 06:46.28](http://www.youtube.com/watch?v=rrWR5DqG4ZI)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/84s3c7/_/dvtp67f?context=10#dvtp67f) - It's similar in concept to this TAS, abusing the answer/pattern recognition. As long as you included the correct answer in your artwork, it'll accept your inputs.\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r84s3c7?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
            "Reminds me of what my buddy had done on a statics test in college. One of the problems was about a truss and the question was “Circle all the zero force members” it didn’t say there was a penalty for circling wrong ones, so he proceeded to circle every member and got full marks for the problem. The professor likes to tell this story to his current Statics students.",
            "I was recently at a workshop about material science and a professor told us a story about a test he took. He was asked about a way in which Helium could be theoretically Metalized and he had no idea, so he thought about it for fifteen minutes and wrote down what he came up with. Apparently he came up with the original hypothesis of the man who theorized about Metalized Helium in the early 1900s, totally by accident. He said he got no credit though 😑.",
            "This type of stuff makes me miss college ",
            "So what kind of answer were they looking for? Like music from his time that he didn’t participate in? \n\nSeems like an all around poor question, not just the wording ",
            "Your answer is really owing to the time period he lived in, not the position he held.",
            "\"touché\"",
            "Bach kind of sort of hit parts of rock n roll though",
            "Baby's got Bach",
            "touché",
            "Grades with a fountain pen??",
            "All of those are derivatives of Bach's music",
            "he did have a fire trap album come out",
            "False bach rocked the fuck out ",
            "I really like the teacher's handwriting",
            "Genji shot first.",
            "Relevant [Calvin and Hobbes](https://wheelsms.files.wordpress.com/2015/04/calvin-hobbes-loopholes.jpg)",
            "Well, he did Toccata in D minor, which Toydolls made a great punk cover of, so luckily, you didn't list punk.",
            "I'm confused. What was this question *supposed* to ask?",
            "Btw this gets you an F in actual, ATAR/GPA determining exams.",
            "The sad part is your paying 1000s to have someone tell you stuff you can google.",
            "The answer is incorrect though. It wasn’t “owing to his position” that he didn’t compose rock and roll - that’s owing to the time period in which he lived. ",
            "Why'd the teacher comment \"Bach\"? Is he calling OP a chicken? /s",
            "Hate to be the \"I don't believe you\" guy, but...\n \n \n A: What kind of question is this to put on an exam?\n \n \nB: Why did the teacher use 2 pens? \n \n \nC: Why did the examinee use a pencil? \n \n\n \n \nD: Why is there no sign of any other questions on the paper? Pretty big gap to leave between part \"b\" and \"c\".\n \n \n \nD: One look at his account and it's obvious OP is a karma whore (or is \"meme lord\" a more accurate word?).\n\n\n But that's just me being skeptical about literally everything, so I could be wrong."
        ]
    },
    {
        "post_id": "tvf6n7",
        "author": "juicybuttfarts",
        "title": "My job tried to charge me for personal calls on my work phone even though I had an unlimited plan",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tvf6n7/my_job_tried_to_charge_me_for_personal_calls_on/",
        "score": 16501,
        "num_comments": 298,
        "created_utc": 1649008356.0,
        "selftext": "So I need to preface this by saying this happened a long time ago. Like back when cell phone plans had minutes. \n\nI was working as a contractor in a hospital for a medical supply company. I was in a \"team lead\" kind of role in a small department, supervising about 20 people total. Part of my job description was to carry around a departmental cell phone at all times, even though I was an hourly employee. Kind of a bogus deal, but whatever. Employees would call me whenever, 24/7 for troubleshooting or if they were calling in sick. I never got paid for these phone calls, but to me at the time it wasn't a big deal. \n\nThis particular area was also in the mountains, and I didn't always get the greatest reception with my Tmobile phone. I got great reception with my work phone, so every once in awhile I'd use it for personal use. \n\nAfter about a year of this I get an email from my boss's boss's secretary asking me to pay for each of the calls I made. I said \"Sure, send me the phone records.\" After that, I went through the phone records over the past year and saw I'd used it maybe 10% of the time for personal calls. After adding everything up, I emailed her back. \n\n\"I added everything up, and turns out I owe you guys x amount of dollars for my personal calls. Technically, I'm an hourly employee, so I should be getting overtime each time I pick up the phone for work purposes. Will we just subtract the difference for all those hours owed?\"\n\nI never heard back. I didn't push it and they didn't either.",
        "permalink": "/r/MaliciousCompliance/comments/tvf6n7/my_job_tried_to_charge_me_for_personal_calls_on/",
        "comments": [
            "I’d have sent them an invoice after that.",
            "A lot of us do things like this and it blows me away when they try to nitpick...like I get paid gas money for traveling between locations, sometimes its a two minute drive, sometimes it's 45 minutes. If I do a lot of traveling I will record it but if it's a couple short drives per month I won't even bother. If I had submitted these trips it probably adds up to a hundred or two dollars per year. If I did something to \"rip off\" the company would they consider this? Would they consider all the times I've worked off the clock after hours just trying to finish something real quick or get something set up for the next week real quick?",
            "Had the same problem with the company phone. I answered my phone outside work times, no problem. Suddenly got an amount subtracted for personal calls (which is illegal where I live by the way). Fine, after that I turned off my work phone after work. (and got asked about why I didn't answer my phone after work hours)",
            "I call it stepping over dollars to collect dimes!",
            "You should have insisted that they pay you for your hours and then write them a check of the difference. talk about the freeloaders!!",
            "I don't understand this mentality from your (hopefully?) former employer.\n\nIt is usually a given that you'll be using the phone to occasionally make personal calls. While not encouraged, it is understood.\n\nOnly time I got harassed was in the military, when minutes and long distance were a huge deal. I'd turned in a cell phone I was issued to my supply guy, got a receipt after turning it in. Got a call from the Maj who issued me the phone many months later asking WTF all these calls to Louisiana were about (never been, but the guy I turned the phone into at Supply? Louisiana.).\n\nFaxed a copy of the receipt over and asked the good Major to call me back with any questions. Supply Guy, you POS, glad you got busted down.",
            "I had a work phone. This was when text was around 10-30 cent. And calls, I don't know.\nTold my boss that I didn't want to carry 2 phones so I would make my private calls on that phone. Never heard any complaints. \nCouple of years later. New boss. Called me in and said that my phone bill was high. It was around 300$ for a month. She said that the specification was 6 pages, look, and that I should pay half the bill.\n\nNo, i will not look. I don't care, I said.\n\nYou still have to pay, she said.\n\nHere, take the phone. Don't want it anymore. I put it on her desk and went home for the day.\n\nThe next day, the phone was on my desk. Never heard anything about bills anymore.",
            "So many of these excellent stories fall into the same category of petty employers. Almost (but not) worth a separate sub for that.\n\n33 (gulp) years ago, my wife was in a semi-serious car accident while I was out of town on business. we worked at the same company: I was the most senior software guy and she was top sales rep. By \"semi-serious\" I mean she was unharmed but the state trooper who witnessed it kept telling her \"I thought I was watching you die\" (no, she really didn't appreciate hearing that, but).\n\nSo the next day I call the towing company, body shop, et al. to figure out next steps. I use my company phone card, because I didn't even think about it. And we're talking about maybe $10 worth of calls.\n\nA few weeks later, penny pincher in finance calls me to bitch about it. Mind you, this is a 30-person company, so the accident was not exactly a secret. My wife's time is much more valuable to them than mine, too.\n\nI explain what the calls were...and then ask her how she knew what they were. \"I called them\".\n\nSo...you spent more company time to figure out ten bucks worth of calls?\n\nI pointed this out to comptroller and never heard another word.",
            "About 30 years ago I worked in a company that was having financial issues. I learned how serious when one day i was called into my managers office and she asked me who I called at 123-456-7890. I recognized the number, my mother’s. I returned a call to her about something. What was really strange is that it was a local call. I was friendly with my manager and asked if she wanted a quarter. She just rolled her eyes and sighed something about management. I was not the only sinner she saw that day. The company had a major restructuring not long after.",
            "Penny wise; pound foolish.\n\nI once worked in a consulting role that required me to travel around. The company also had some strict cost saving measures, like no business class, regardless of the flight time, cheapest hotel, regardless of distance, just super dumb stuff. All about the face value, but not the overall impact. \n\nI had a client that required me to stay at a hotel, and the cheapest one was substantially further away than the closer one to the office, but $30/night less. The pencil pushers insisted I stick to policy, despite the additional travel time.\n\nThe cost of transportation wound up costing them an additional $50/day, which is basically $20 more a day than if I stayed closer, plus the extra 30-40 minutes stuck commuting.",
            "So many stories in this subreddit of bean counters only considering one side of the equation. When making a financial decision you should always ask two questions:\n\n1. What is the cost of doing this\n\n2. What is the cost of NOT doing this",
            "That’s brilliant.\n\nI had almost the exact same thing happen back in the early 00’s.\n\nThey complained about my “personal calls” on my cell phones. So I spent time at work building an excel spreadsheet that basically took their monthly report and checked it against the entire company’s phone book, cell phone bank, and private numbers that people used to call me.\n\nIt would then color code work as orange, after hours as red, and personal in green, I submitted the red parts with my time sheet. Since I was Union, and hourly, they had to pay me for bothering me anytime outside of normal working hours.\n\nI ended up receiving way more than I had to pay back. \n\nWhen I started sharing the excel macro with other Union workers, the policy of nit-picking calls was cancelled.",
            "Before cell phones I was a contractor at a large company.   Once a month each contractor was handed a list of calls made from their phone.  We had to mark the calls that were personal and reimburse them. In person.    \n   \nWe were in a satellite building so there was only a cashier on site for 3 hours each week. At 1PM on the first Tuesday after the bills came out there would be a long line of contractors, billing at $50 or more an hour,  waiting to hand over checks for 2 or 3 dollars.  Since the cashier closed before processing everyone, so we’d be back at 10AM Wednesday and often 3PM on Friday.    \n   \nI’d like to say that someone figured out that it cost them more to process all these checks than they were worth, but no. A couple of managers even kept track of how much time people spent on the phone and then demanded an adjustment to the bill.    \n ",
            "I live in the Netherlands, but was stationed on a project in Brussels, Belgium. We had a fixed allowance for food when working on the project, but we were also paid for overtime. This project needed a lot of overtime.\n\nIt needed 1 phone call with my manager and HR to convince them that they would not complain about expense reports for restaurant food and we would not ask to pay for over time.\n\nBrussels has some very nice (and expensive) restaurants. Good times.",
            "Last year, we got a new manager who let the power of running a small convenience store go completely to her head.        It was Christmas time and I was still only part-time, so had taken a second seasonal job which added up to about sixty (60) hours a week.\nOfc the new manager of the store decided this was the best time to get everyone up to date on monthly training.       Granted, I was behind but that was because I was scheduled overnight graveyard shifts and weekends where I worked alone and the manager didn't come in.       One day at my other job, I got a text from that manager saying that I had to come in before she left for the day to finish my training.       I text her back that I can't- I'm at my second job.         \nThat night, I work an overnighter, and bright and early in the morning, while I'm trying to sleep - the texting telling me to come in, starts again.\nI ignore it, which offends her majesty the manager greatly and the next time I see her on my scheduled hours at the store- she tries to lecture me on 'my responsibility to the company' to come in on my day off!\nTo which I reply repeatedly, \"I want to see that in writing!\"       A few times she threatened to report me to the General Manager, to which I reply repeatedly, \"I want to see that in writing!\"       \nFinally, a few days later, I show up to the store and there's the GM calmly coming in on his day off to boot the training computer up for me.\n\nEpilogue: What I learned in that training was very interesting.     It said that we could take text messages after hours but only to a certain extent- after 15min. a month, that was considered 'working off the clock' and we could request compensation for it.\nSo, the next time the manager sent marathon messages, I texted her back that she had exceeded her 15min and I would need compensation forms ASAP please.       She left me alone on my days off after that.",
            "In the early 2000s the IRS decided that personal use of employer provided cell phones counted as a taxable benefit, so employers had to start cracking down on that. They were fining not just the employees but employers as well. Mine decided to take away the phones and give us a monthly stipend (taxed) to defray the cost of our own personal phones, because otherwise it was going to be a bookkeeping nightmare. \n\nSo depending on exactly when this was, it might have been tie IRS’ fault, not your employer’s bean counters.",
            "well done you. wherever I work, there’s give and take to a point. If work is flexible then I’m flexible. when work decided to ban smoke breaks, I started recording exactly how much I was working to the minute and ended up with 1 free day off in 10. Also I then claimed every single expense owed to me, even if all I had was a 10 mile round trip to claim mileage for.   \nIf they’re going to nitpick, I’m going to work to rule.",
            "lol, they knew they would have to start paying you for the overtime, and maybe all the way back to when you were hired.",
            "My last job was terrible for this sort of thing.\n\nIt got to a point where I blocked one of the directors from calling my personal phone number as when I was on leave he thought nothing of phoning me.\n\nHis personal best was when he called me at 10 in the morning on the first day of my leave. I was effectively only out of the business two hours, despite having a meeting with him and discussing the project and leaving the project pack on my desk if there was any issues that arose while I was off.\n\nHis view was to take the path of least resistance rather than read the notes. \n\nI eventually was signed off with work related stress and cited this as one of the many issues I had, which coupled with me also being on call 24/7 and the only person in the company with my skill-set, I never had any down time.\n\nWhen I was interviewed at the start of my absence, I was told that all the directors are also on call 24/7. I politely pointed out that I wasn't a director and don't have their finacial and legal obligations....\n\nI was met with silence.\n\nI finally managed to get out of that company last year and have been happier since.",
            "This is why I don’t take my company phone or company laptop home. Neither have anything to do with my personal life after I clock out for the day.",
            "I used my work phone for a month when my personal phone broke. Got a call from my gm saying I use 6 gigs of data. I'm thinking great. 6 gigs in a month is like half of what I normally use so I must be doing great data wise. Nope. Company offers 2gigs per tech. Its 50 a month for unlimited. Fine I'll get the unlimited. I hot spot my personal phone to my work phone all day long. My personal data usage has gone down so much",
            "I salute you, that was a genius retort!!",
            "Similar era, when data was unlimited and there was a monthly limit to texts and minutes, except I never have had a company phone.  Using my personal phone, I sometimes got up to the limit (or over) on calls due to work.  Fortunately, work agreed to pay for a family plan upgrade to allow a few numbers to be added as unlimited minutes.  I think I still had the bonus from work when I changed plans later.",
            "I had a similar with a company I worked at. They gave me shit for occasionally using the work phone(which I had to have with me at all times) as I got frustrated carrying 2 phones, so left my personal phone home when I went out. After that I asked them if I will be getting a standby allowance and OT when I get called outside of working hours, and they said no. Then I said I will no longer be available outside of working hours, and left my work phone at te office from there on. Left the place not long after. And that was not the first time the OT issue has had with said company.",
            "And that's why I make work calls on my personal phone and charge them, even though I have an unlimited plan.",
            "As a guy who managed the company cell bill this is nuts. The only time I looked into it was one user that would rack up like 5k minutes a month. That was just to figure out what he was doing. Not even to charge them.",
            "Early 2000’s, but my father got a work cell phone so he could be reached while on travel or on a job site. He asked if could be used for personal calls. They said no. So he refused the phone. He wasn’t the only one at the company and I guess they all joked about it at work in front of upper management. Loudly.\n\nThree months later he was given a phone but told that NOW employees can use it for personal calls but no texting. I have that number still memorized after nearly fifteen years of him using it before changing jobs in 2016.",
            "I won the boss lottery in my first job. \n\nIf we had to travel, in the evening at the hotel he would give me the company phone so I could use it to make the international call to my wife and talk to her for a bit before going to bed.",
            "Back in the dark ages when we only had landlines it was sometimes necessary to make a long distance call from work. We would just put a note on the bosses desk with the number so he knew. He never asked to be paid back. One employee didn't leave a note and then denied it was him. The boss called the number and he got caught. Almost fired...not for the call, for the lie.",
            "I hate reading stories like this where a person thinks they won when, in reality, it's quite likely the person was misclassified as a contractor, definitely owed on call pay on top of wages for all calls, and clearly taken advantage of by the company.  Why end it with \"sure I owe you $10 but you owe me several thousand dollars, benefits, and repercussions of violating state and federal labor laws to their advantage and your loss\"?  Why not approach state and federal labor boards about the situation and the pay you're rightfully owed?  That's sticking it to em.  If they want to nitpick, turnabout is fair play and that certainly includes leveraging your legal resources.\n\nSorry OP.  Please don't let them victimize you further.",
            "A co-worker had a huge headache when she paid for a stay with her credit card and submitted the receipt to be reimbursed (a company card wasn’t available). Accounting raised a stink because she would get the credit card points, thereby benefiting twice from the purchase (reimbursement + whatever points were given).",
            "There are prople who are employed to worry about this shit. That's crazy.",
            "Had a job try to do the same, but for texting. It was how we communicated with dispatch. They had an unlimited plan before that was the norm. That’s why I texted from it. I’m not paying 0.10¢ a text.",
            "Make sure you charge them for electricity used at home, occupied space at home, and make sure the wage they owed you when you take their calls at home",
            ">back when cellphones had minutes\n\nCries in German",
            "It’s funny how everyone’s headhunting until things get itemized.",
            "I think the Supreme Court (?) ruled you don’t have a right to privacy on the company equipment so anything you do on it can be used against you. \n\nText dirty to your wife on the company phone? It can be used against you as sexual harassment in the work place. \n\nConstantly checking your stock on the company laptop? Even if it’s passively leaving the window open so you can look up every now and then - you might have to explain all those missing hours of goofing off when you should be working.  \n\nThese are just two examples where my last employer tried to separate workers from the payroll. The Union only prevented half of them from being fired. \n\nIn addition, one idiot used to text his gf using the company phone. His wife successfully sued for access to his company’s records to prove divorce reasons and a hefty alimony. \n\nhttps://www.worktime.com/12-most-asked-questions-on-us-employee-monitoring-laws",
            ">Like **back when** cell phone plans had minutes. \n\nTell me you're not Canadian without telling me you're not Canadian.",
            "Chickenshit secretaries are the worst",
            "Company's will never hesitate to bill you for bullshit, people need to start doing the same.",
            "Damn. All your employees worrying about calls. I used to work for MCI (bought by Verizon at some point) back before cell phones were a thing and we had phone banks in the break room where we could all make unlimited free long distance calls in US, Canada, and MX all day long. This was when home long distance calls required a full extra job to pay for. I called my granny a lot!",
            "I get what u did but tbh I think that's lucky. \n\nI don't think there is much work life advocacy in the hospital as everyone is easily replaceable, especially if you aren't one of them bigwigs. \n\nI too have a work phone and the amount of times I'm called even after work is insane. Sometimes I turn that off and they call my personal phone nonstop. \n\nI've called I think with my work phone once where I lost my own phone. So called my own phone to find out where I left it. And they had me go to pay the few cents on the bill lols.",
            "I’ve had to do this. I signed a contract saying if I used my work phone for personal use the calls were .15 cents per call. It was on an honor system but they could audit at any time. Occasionally I would use it if my personal phone died. It’s always smart to not use work resources for personal use and never use personal time for work. And this is with an unlimited plan as well.",
            "If they used the totaled minutes to paid you for time, then it would make since, but it sounds like they didn't and were just jerks. (Totaled minutes via the call log)",
            "I still have minutes on my plan!",
            "Boss once asked if I knew who had the highest phone bill. I told him it must have been me, or he would t be bugging me with it. He responds with yes, and my next line was, “Well, someone has to…”",
            "Another response is to be somewhat snarky do any calculations of how much extra money was added to the bill for each one of those calls that you made on an unlimited plan...\n\nAnd ask them if they would rather cash credit or check for the $0 you owe them... Since its unlimited the company incurred zero extra cost for these calls and therefore you owe them nothing in terms of Dollars.",
            "Before cellphones, each worker had a land line desk phone. To make a personal call, you dial a code then your employee ID number. The cost of the call is deducted from your pay. \n\nEmployer has a phone switch, of course.",
            "Them:  \"Hah!  Got your Queen!\"    \nOP:  \"That is a discovered check.\"",
            "An integer (the number of minutes you used) divided by infinity (the number of minutes available) is undefined.  So I would have told them there isn't any amount of money that is owed.",
            "Using your work phone for personal calls. Sounds like a dangerous game.",
            "What country... doesn't use minutes anymore? What am I missing? Am I in a third world country and didn't know it?",
            "You should not be using the company phone for personal use, unless it is an emergency. Also, you should not be answering the phone off shift because if you do you need to be paid for it. I also work in Healthcare and my company pushes the the policy of answering the phone off shift because they have to pay you in a big way. If they want you to answer off shift they need to pay you on call pay, which in Healthcare is 2 - 3 dollars per hour.",
            "Well played",
            "Send them an invoice",
            "Great story u/juicybuttfarts",
            "My partner had something similarish kinda. So in our country it's very common to have at least a phone plan proposed for his field of work even when they don't really need to make phone calls.. it's one of the things company do to attract developpers and usually you also get a phone. My boyfriend had gotten a phone + unlimited call/text plan and those are btw meant to replace your phone plan, like they transfer your private phone number..  \nBut his boss upon realising that he had only 30min of work calls in a month but hours of private calls tried to tell him it's not fair and he can't use it more for private matters than work ones.. needless to say he had no leverage there XD you can't control private calls as long as they're outside work hours.. Needless to say he didnt stay long at that job and accepted a better paid proposition that also came with a car.",
            "good one, lol.",
            "Shutting people up can be _so_ easy! Well done!",
            "My dad had 23 years with his employer, 2 more years to be eligible to retire at full pay on his pension (if he wanted to, in his mid-40s), when his boss told him they were firing him for overcharging the company on some mileage expenses on TWO recent trips. They figured he defrauded the company... For about 40 cents.  \n  \nHe said \"Fine. Let's go to court over this. You want to make a big deal over a difference of a few blocks? I have receipts to show I returned over $100 the company OVER-paid me for other trips.\"  \n  \nAfter about a week of increasingly hostile interactions, his boss's boss had to fly into town to talk to my dad. He said \"Look. Your boss doesn't like you for some reason and wants you gone. Obviously. He chose a bad hill to die on and it's going to cost the company. If you *resign* instead of taking us to court, the company is prepared to let you keep your pension.\"  \n  \nI don't know if there was anything else involved in the deal, but my dad got what he wanted: a clean work record and his pension.",
            "Step 1: Find new job. \nStep 2: Report them to the labor department for forcing you to work off the clock.\nStep 3: Laugh"
        ]
    },
    {
        "post_id": "aton3z",
        "author": "Onionsoupforthesoul",
        "title": "You want my EMPTY water bottle because it is over 100mL?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aton3z/you_want_my_empty_water_bottle_because_it_is_over/",
        "score": 16492,
        "num_comments": 1146,
        "created_utc": 1550879432.0,
        "selftext": "So about 2 months ago, I went to Cuba with my mother. It was an all inclusive trip so everything was pretty much provided for by sunwing.\n\nWhenever I travel, I like to bring with me this cute 500mL glass water bottle with this rubber pink casing I got while I was in China. NORMALLY this bottle wouldn't be an issue, there would be a few odd times when security at the airport would check it to make sure it was empty because it was clearly over the 100mL maximum. But they would all let us go without a hitch.\n\nWhen we were traveling to Cuba, the bottle was checked and given back to us on our way there, but on the way back is a completely different story.\n\nThere were tons of people flying out of Varedero (where we were) the same day as us, so there were like two hundred people waiting to check in at only 3 check in counters. When we finally checked in, it had been about 2 hours since we got there. We were pretty tired from standing so we wanted to get through to the gates as fast as we could, so we took the shortest line in security.\n\nThere were 2 people working at each bag check area, at ours there was a lady looking through the screen displaying the x ray and a guy in charge of checking suspicious bags. When we put our bags on the conveyor belt, the lady began gesturing to her partner and pointing at her screen. The guy then proceeded to grab my stuff off the belt on the other side and asked us if it was our stuff to which we replied \"yes\". He carefully shuffled through the bag, but really just went after the water bottle because that's what I assume the lady pointed at on the screen.\n\nThe following dialogue is to my best recollection:\n\nHim: \"Is this your water bottle?\"\nMe: \"yes.\"\nHim: \"okay I am going to confiscate this because it is against the rules to bring this on board.\"\nMe:\"But it's empty.\"\nHim: \"Yes, but but it is over 100mL and that is against the rules.\"\nMe: confused, but did not want to make a scene and get kicked out. \"No, that's for liquids.\"\nHim: \"no it's for the size of the bottle, and it's glass.\"\nMe: \"but we have this bottle that's also glass.\" this bottle indicates an 80mL bottle of hot sauce we brought.\nHim: \"that is under 100mL, so its allowed.\"\n\nAt this point I wasn't sure if he didn't know the rules or something because every time he answered, he sounded very unsure.\n\nMe: \"can I see where it states that I cannot bring an empty bottle over 100mL with me?\"\nHim: grabs a nearby plaque that labels prohibited items and points to a wine bottle.\nMe: \"but that's not allowed because it's alcohol.\"\nHim: \"no it's because it's over 100mL glass bottle.\"\n\nHis tone at this point indicated that his real intentions were that he wanted my water bottle because he's really just grabbing arguments out of thin air.\n\nMe: just trying to test his nerves at this point \"so if I had an 100mL GLASS bottle of alcohol, I could bring it with me?\"\nHim: \"no because it's alcohol.\"\nMe: \"so is that! (Refering to the plaque)\"\nHim: \"do you want to take the cover off the bottle before it is sent to be destroyed?\" Handing the bottle back to me for me to remove the casing.\n\nKeep in mind there was some more bantering back and forth, basically saying the same thing over and over again. I was really pissed at this point, I really like that water bottle and it was clear that the only reason he was confiscating the bottle was because he or the lady wanted it.\n\nSo I took the water bottle from his hands (he gave it willingly for me to take the casing off), but since the only problem he seems to suggest it has is the size of the glass, I can take everything else.\n\nSo I stared into his eyes as I removed the lid of the bottle and handed the rest back to him. His face instantly became red with anger and he aggressively threw the rest into the disposal bin.\n\nI have no use for the cap or the casing, but he now has no use for the bottle and that's all that matters.\n\nEDIT: wow thanks for all the likes! So I see alot of comments saying that TSA rules state that bottles over 100mL have to be in the checked baggage. That is only for bottles with liquids. As long as it's empty, TSA has no problem with it. Also I don't believe that TSA is who's in charge in Cuba (correct me if I'm wrong), so Cuba's rules are slightly different in a sense that they don't allow gels or aerosols regardless of the amount. But everything else is the same.\nAnother thing is that some people were confused as to why I thought the person wanted my bottle, but the tone he was conveying (which is hard to express over text) was that of someone who was making up rules along the way.\nMany of you also suggested that I should have smashed it on the ground, but I didn't want to seem like I posed a threat to security and get kicked off the flight lmao. ",
        "permalink": "/r/MaliciousCompliance/comments/aton3z/you_want_my_empty_water_bottle_because_it_is_over/",
        "comments": [
            "Knew someone who would ship shoes to South America one at a time otherwise customs would steal the pair.",
            "Yeah I've seen people do this before, my uncle bought a bottle of alcohol from duty free when he was coming back from Sri Lanka via New Delhi and the security at Delhi didn't let him bring it to his home and the guy made it obvious that he was going to take the bottle for himself later so my uncle just took it to the bathroom and poured it all out so he couldn't have it lol",
            "This happens a lot. I’ve had numerous small items “confiscated” by security or customs in various South American countries. I usually break it before I hand it over if possible. ",
            "I had to sit for 45 minutes while TSA *in the US* tried to figure out if I was allowed to carry on my breast milk for my 3 month old who was traveling with me. I had purposely packaged it in individual bags around 60mL each, but because the overall volume they were \"concerned.\" It wasn't until little dude got hungry and I whipped out my boob to feed him, making snarky comments like \"did you want to confiscate the milk from my breasts as well?\" did they tell me I was okay to continue to my flight... the manager never even got there. ",
            "I had a similar situation when I was going through China. I had a travel cup that I absolutely loved and took it everywhere I traveled. Chinese security checks flagged it even though this is the 5th time I've gone through that airport. They said it was against the rules to take it on board. I asked why and they said it was too big and sealed. It's dangerous. After about 5 minutes of arguing I asked if I could grab my   lanyard that attaches to it. They handed it back to which I put it on the floor and stomped on it as hard as I could completely crushing the sides and handed it back once I took the lanyard back. The man was absolutaly livid. Bought another one a week later.",
            "Coming back from Israel, we went through security and got to our gate. We had a while to wait so we bought snacks and bottles of water.\n\nAs we boarded the plane they had us toss our water bottles because they were over 3 oz. That we bought at the airport. After we'd gone through security. At the shop twenty feet from the gate.",
            "Airport security in Panama tried to confiscate my bottle of Chanel perfume. My “air travel approved” size of Chanel perfume.\nI asked for manager. While waiting for the manager, I called TSA in the US and got them to resend the email which SPECIFICALLY stated this brand/bottle size was approved to fly.\nManager comes over and tries to confiscate perfume, I show him the email. He pretends he can’t read English, I have my Hispanic boyfriend (who speaks perfect English with zero accent) translate it for him.\n\nTSA in Miami asked me to hand the phone to the manager. He turned red, I heard yelling, he handed me the phone back, TSA said I shouldn’t have any more problems and they were filing an official complaint against that manager and airport for abusive confiscation practices and they were going to warn the airlines about it.\n\nI smiled. I put my perfume away. I thanked them. I got on my plane. \n\nEdit: My FIRST GOLD! Thank you!!",
            "Dude, US domestic TSA tried to take my UNDER 100mL contact solution and I about flipped my shit at them. The guy set it aside but no one was coming over, so I grabbed it and took off. Never had a problem at any other airport-- avoid LGA TSA like the plague.",
            "I had the opposite experience flying out of Marseille. I had my then 6 month old daughter strapped to me, and I had forgotten to empty out my metal water bottle. It was the size of a standard water bottle mostly full  of water.\n\nSo they pull the bottle out of my carry on and I'm like \"oh damn I'm sorry\" and the worker said \"that's ok, it's for the baby\" and put it back in my bag. They were assuming it was for her to drink or for formula or something. Neither was true, but I just went with it so they'd let us through.\n\nOhhh yeeeeaaahhh it's totally for the baby, thank you! I mean I needed to keep hydrated because I was still nursing so it's sort of true, but yeah I wasn't gonna argue!",
            "My sister brought italian jerky to Canada in the early 90s, the customs consficated it. She asked for it back to take pictures for court, they already ate half of it. So they waived the $500 fine. Corruption.",
            "Huh. I flew out of Veradero in the beginning of November via Sunwing as well. My girlfriend and I lined up in one of two lines and a third agent opened up. We hopped over and naturally it was the slowest line out of all three lines.  \n   \nWhen we got up to the agent, he looked at our luggage which clocked well under the weight limits, then weighed our carry on. Apparently mine was over the limit. The agent makes a sad noise. My girlfriend and I exchange glances. We've never heard of carry on being too heavy.  \n   \nTurns out he saw my Under Armor sandels which were strapped to the sides of my bag. He tried hustling us for my sandels. We said no. And like magic the weight issue disappeared. Turns out he was trying to hustle every passenger he was processing. \n \nYou might have had the same guy. ",
            "Some of those security staff are on a giant power trip, made more confident by the fact that we will usually cave, because we don’t want to miss our flight trying to settle a dispute.\n\nA few years ago, at security in the Fort Lauderdale airport, my husband went before me with his liquid toiletries in a plastic bag.   No problem.  I was right behind him with my toiletries in the same size size bag and the agent said “That bag’s too big.   Pick your favourites - the rest is going in the garbage.”   I found a smaller bag and managed to put my toiletries in them, including a brand new 100ml toothpaste.   The guy grabbed the toothpaste and said “Too big” and threw it in the garbage.  I said “It’s 100 ml”.  His only response was “Oh well, it looked bigger”.   \n\nI sometimes think this whole liquid thing has gotten way out of hand.   I think if you have TSA pre-check or trusted traveller status, they should allow some larger liquids in your carry-on, or at least allow you to keep them in your toiletries bag without putting everything in a separate, small plastic bag.  It frustrates the heck out of me.   I’m flying out early tomorrow morning so I’m feeling extra annoyed about it all.",
            "I've known foreign security to have strange interpretations of what the TSA allows. This, however, was a pretty clear case where the officer just wanted to steal something under the guise of authority. In the US or Europe, I'd call for a supervisor. In a routinely corrupt environment like Cuba, though, this is probably the best you can do if you're determined not to give in. ",
            "[deleted]",
            "I have cochlear implants. My spares are not allowed through the x-ray machines as it can wipe my \"map,\" the program my audiologist sets that allows me to hear. The right to hear is covered by the ADA (American Disability Act). When I get to check points I have it out in a small box to be hand checked. In Charlotte I was about 5-6 people behind in line and the TSA agent yelled at me to put it in a basket. Yelled back it's medical equipment I need it hand checked. She yelled back \"medical equipment for what?!\" To which I replied \"Medical equipment that I'm not required to disclose by yelling out the reason in front of 20 people. \" (when in reality,  even to TSA, I am not required to disclose the nature of my medical or disability  needs) she went quiet real quick.  \n\nIn Atlanta another time TSA took my box with my spares to put through x-ray. Pulled the box out that he placed to be x-rayed and said no, this is medical equipment that must be hand checked. He took it and again put it in the bowl to be x-rayed. Took it back again, restating it was medical equipment requiring a hand check. He replied \"unless you have a doctors note, it's  going through  x-ray\" told him unless he was willing to violate the ADA and deny my right to hear, it will be hand checked. A manager finally came over and hand checked it, rolling her eyes at her employee. \n\nMy audiologist always loves my travel stories because so few people  understand their rights under the ADA. They are not allowed to potentially destory my ability to hear. ",
            "It’s not just outside of the US, this happens inside of the US as well. I was flying from JFK and TSA stopped me for a premium metal comb. I’m 99% sure the officer just wanted the comb. The catch22 here is, the officer *was the supervisor.* The guy was walking around from line to line being something like a Big Brother (1984). I had the thing for a week, so the people who were traveling with me were way more butthurt than I was.\n   \n",
            "**TL;DR:** Class trip takes a \"If we can't have you no one can\" view of alcohol in an airport.\n\n\nThis reminds me of my last trip to Mexico, as part of a language study program in college quite some thyme ago. I went with a group of other students from my school. There were about 17 of us. Most of us had been in language classes together, so we knew each other and generally got along well enough.\n\n\nAt one point in the trip we found a tequila store that sold countless different varieties of tequila. Most of my classmates were under 21, so they bought lots of tequila as they would not have been able to do so back in the states. Those of us at, or over, 21 did not really buy much as being able to buy alcohol was not really a novelty to us. The majority of it was legitimately to be brought back as gifts, but a good portion of it (and them) got drunk while we were still down there.\n\n\nWhen it was thyme to return home we got to the airport early, and when were were getting ready to check our bags we noticed that \"security\" was going through all the bags to be checked, and \"confiscating\" \"dangerous\" items. All of these \"dangerous\" items were being collected on some tables in a corner.\n\n\nWe also noticed that employees were picking through what they wanted on these tables and taking it for themselves. There was not even the vaguest effort to disguise what they were doing; going through luggage, finding what they wanted, and taking it in the name of security. For the record: This is not the security checkpoint; this is just our checking our bags and getting our boarding passes, and the \"security\" agents were the exact same people working the counter who had nothing identifying them as security like the actual security people we saw elsewhere in the airport.\n\n\nWhen the first person in our group got to the front of the line and security found a few bottles of high-end tequila, you could practically see the security personnel salivating in anticipation. They announced that all alcohol had to be surrendered. Between all of us we probably had at least two dozen bottles.\n\n\nNone of us were willing to surrender it, but none of those who had bought liquor had any other means of getting it back to the USofA. We were being clearly told that if we wanted to check our bags, and fly home, we had to surrender the alcohol.\n\n\nOne of my classmates had a terrible idea that was driven purely by spite, and that terrible idea broke the hearts of those airport employees... The whole lot of us went into the nearby bathrooms (in the appropriate ones). In there, my classmates chugged as much of the tequila as they could stand, and dumped the rest down the sinks. Not a drop was left to bring home. Maybe we should have handed over the empty bottles to the employees, but those got tossed into the trash, so the employees got nothing. All other valuables that could be were not already in people's carry-on bags was transferred over so they would not be in the checked baggage and under the scrutiny of those working the baggage check counter.\n\n\nIt should be noted that the flight was rather hellish for all parties involved. Over a dozen very, very, very drunk students got very rowdy in a small plane, and there was a 12 hour delay that held up our layover... It was unpleasant for *all* parties involved... Even so, to this day, I still think fondly of that spite-filled plan....\n\n\nEDIT: I accidentally a word.",
            "My checked scuba knife got stolen on a flight either to Germany or Israel. It was my first and really nice.",
            "What a jerk. I hate you lost your water bottle, though.",
            "What a prick",
            "Good choice",
            "That’s fucked up, I travel with an empty 1 liter glass bottle all the time and have never had problems with it going through security. If someone tried to confiscate it though, I’d probably break it, because you can order more caps for it online. But I’d also tell them to get a manager because it’s a $50 water bottle that I’d rather not lose. ",
            "I had an old screw driver with replaceable heads similar story but I took all the pieces leaving just the shaft. I had that thing through dozens of flights for work. After that I bought a dozen cheap screw drivers and always have one in my bag. I haven’t had to give one up yet and I know the thing is over the length limit... ",
            "Airport security is thieves. I have had valuables stolen during carry-on check. Fuck security theater. ",
            "I'm currently traveling through Colombia and they have a problem with lighters. In the cabinbag as well as in the check-in.\n\nNo idea how to get a lighter with you in Colombia. So I just gift it to random strangers and buy a new one in every city...",
            "What a piece of crap, good for you.",
            "LPT: Print out tiny labels which say \"90ml\" on them and stick them on whatever bottles, shampoo, toothpaste, etc you have. You can bring a gallon of anything you want on board, as long as it says 90ml on the bottle.",
            "I have the worst time with the TSA. Every time I fly, they search my bags and then pat me down. The one time I flew with body wash, toothpaste and cologne, they confiscated them. I don’t know what it is or why but it’s getting kind of tiresome. ",
            "This now makes sense why I had my item confiscated. (Rant incoming) \n\nLast year I went back to China to see my grandparents and relatives. Now most of you have heard of Sun Goku- which was based off Sun Wu Kong, a monkey humanoid who carries a staff . I went back to my home town and attended a food festival where they also sold toys for children. \n\nNow, I’m no child but have loved the character since I was small  and couldn’t resist buying it.  When i get to the airport to go back they stop me and don’t allow the item across, saying it won’t fit the overhead compartment and saying ranting rules. LIKE WHAT? it’s the size of a walking Stick, if size is an issue I can take the ends off, the insides is hollow !!! I’m not smuggling drugs ( since they asked if something was in it, they even look through the staff meticulously like they’re looking for gold or I’m hiding something in an inch opening)\n\nPretty sure they just took it since they wanted it for their kids. :/\nRant over. ",
            "Sounds like TSA needs to make sure the rules are 100% clear and not up to interpretation.",
            "Man, FUCK the TSA. They don’t even do anything useful.",
            "I bought a snow globe from the Haunted Mansion at Disney World and I got stopped at security because of it. Apparently it was over 100 mL but she let me go because it was a snow globe and I paid way too much money on it. She told me “you should have put it in your checked bag”. Like. Bitch no. I know how y’all treat bags because I’ve had stuff broken before. ",
            "Do you have a link to the water bottle? I want to check it out. ",
            "[deleted]",
            "I asked for a pat down instead of the scanner and one of the TSA guys told me he had been looking forward to seeing me go through the scanner. Sick F'er.",
            "i can't imagine how nice this bottle must have been in order for this situation to happen. OP, is there any way you can link a pic of a similar bottle so we know what you're talking about?",
            "I nearly missed a flight leaving Mumbai once, as security had decided that all women must go through a single specific line for screening. \n\nMultiple channels were open for men, and there was this single endless line for women.\n\nThis had never happened before or since, and there was no explanation for it.",
            "I had a tiny 1” wrench keychain taken once. What am I going to do dissemble the plane? ",
            "Hoo boy, we all know 9/11 was caused by a 100mL bottle of water, boy oh boy those security guys are really saving our asses, huh?",
            "Getting out of Cuba is the ABSOLUTE worst. It’s even worse if you’re actually Cuban. The airport workers get pissed that you’ve moved on to another country and they haven’t, so they check your privilege by rifling through your bags, stealing things, and inconveniencing you at every step of the way. You can always tell a Cuban bag by the way it’s been wrapped in 18 yards of Saran Wrap. It’ll either be too hard to search through, or if they do it anyways at least you know right away. ",
            "When I was a kid, I had one of those switch-combs. Like a switchblade, but a plastic comb came out instead. Despite showing that it was in fact, just a comb, the TSA still took it and threw it away. Thanks, you made my 10 year old self vaguely disappointed for a bit. ",
            "TSA=Tired Shit at Airports ",
            "Sometimes both parties lose, but one loses a little bit less.",
            "For christmas my brother gave me novelty knives and a cutting board shaped like medieval weapons. I didn’t want them and forgot they existed. A TSA agent pulled me aside to search my bag, pulled out the knives and gave me this “*Really?*” look. When I asked if he could throw them away for me it changed to a “Don’t mind if I do!” look and he stuffed them in his bag. \n\nAt least I wasn’t arrested.",
            "A friend of mine traveled to Seattle. He brought his Magic Wand with him for his girl out there. Got to Seattle and no Magic Wand. Someone had a good time that day lol. And it was a Hitachi not a knock off. ",
            "Cuba is weird like that man. Been many times over many years and normally there’s very little problem. But I remember one year they confiscated my nice pack of Windsor newton watercolour sets I use to travel document with. According to them “drugs could be packed in with the colours.” I’m sure it was held onto and given to somebody. Which I guess isn’t the worse case scenario since someone in Cuba gets to paint with some nice materials. ",
            "Good job!!\n\n&#x200B;",
            "You're allowed 100ml of alcohol in bottles. Up to 200ml's I think. Just not 101. Take 200ml of alcohol in those 'for travelling' containers whenever I fly, cos it's always a fortune to buy on the plane.",
            "> So I stared into his eyes as I removed the lid of the bottle and handed the rest back to him. \n\n/r/madlads",
            "should have broken the bottle into a fine powder, took it back in a zip lock bag",
            "Would you like help finding a identical one. ",
            "The TSA is the main reason why I refuse to fly these days - their kind of shit is exactly the kind up with I will not put.",
            "Wait so the X-Ray people can tell if something is filled with water or completely empty?  TIL.  \n\nHow could they have known they wanted it while it was still in your bag?",
            "They were working together to get your water bottle?  ",
            "Not at an airport but a security guy wanted my bottle because he was worried the liquid could be flammable or something (it was a bit incoherent). I simply downed the entire thing in front of him then walked in.",
            "Take off the cap and turn it upside down. Voila! Now it can't hold liquid.",
            "Leaving Varadero, we saw people with 4 litre jugs of water (not confiscated), 2 litre bottles of alcohol (not confiscated), were asked by airport workers if we had any change to give them (pesos or American dollars), and saw people open and consume their duty free liquor on the plane.  ",
            "In Varadero airport I got stolen anything of value from my bags (cosmetics, souvenirs, cables, chargers and so on) and even some clothes. ",
            "Not sure if this helps, but check alibaba for the same bottle if you wanna re-buy it. ",
            "You should have \"dropped\" the glass part and let it shatter on the floor. That way he doesn't get the bottle and now he has to clean up the mess.",
            "TSA doesn't even work anyway. https://youtu.be/QKEdKdgi2hg",
            "[removed]",
            "TSA is shit in many places. Especially in the US. Most of the controls and restrictions are unnecessary and just plain stupid. ",
            "Pfft that sucks. It’s what happens when 99% of the population are shuffled into minimum wage jobs, gotta have that sweet moment of what little power you have.",
            "I was thinking you’d “accidentally” drop it and it’d break.",
            "If it is a Life Factory brand glass water bottle, replacement glass is available, I have had to replace mine twice for just the cost of shipping.",
            "Wow, you're really enlightened. It would never occur to me that someone at security check would try to confiscate something for themselves. But I've never been to Cuba either. What an idiot.",
            "THATS FUCKING ILLEGAL, TELL HIS MANAGER OR SOME SHIT DONT LET THIS HAPPEN"
        ]
    },
    {
        "post_id": "t161i0",
        "author": "BSPINNEY2666",
        "title": "People Fill Up My Marketplace Search with Their $1 posts for things they want $4,000...So I say:",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t161i0/people_fill_up_my_marketplace_search_with_their_1/",
        "score": 16486,
        "num_comments": 765,
        "created_utc": 1645801278.0,
        "selftext": "\"Hi, I'm DEFINITELY interested in this for $1! When can we arrange a pickup?\" I am fulfilled when they ANGRILY tell me that's not the real price and how clueless I am. Often: \"Did you really think you could buy an \\[item\\] for $1?\"\n\nWhy? That's just showbiz, baby!\n\nEDIT: Yes, I have seen people adjust their price after responding to me, which feels like a win.\n\nEDIT 2: I'm not actually trying to buy the object (I'm usually searching for tools and antiques under $100). Just being maliciously compliant that the truck they posted for $1 is actually posted for $1. ",
        "permalink": "/r/MaliciousCompliance/comments/t161i0/people_fill_up_my_marketplace_search_with_their_1/",
        "comments": [
            "Then reply, *that's for 4000 of them right?*",
            "This reminds me of airbnb where I emailed about a room. I was then given a different (obviously higher) price. I texted back saying it was too expensive. The owner followed up by asking me to withdraw my offer. I couldn't be bothered as she can simply refuse. I ignored her message while continuing to search for a different place to stay. \n\nHowever, it would apparently reflect badly on her if she refused my offer so she kept messaging me to withdraw my request. \n\nNope. \n\nYou made the listing. You put that price up. You go on and take the rap for lying, missy. If you don't want to accept for the price you advertised, then you can reject my offer or ignore it - both options obviously earning her negative points on the platform.\n\nNot my problem.",
            "I like the ones posting their rusted out 2004 F-150 with a 5.4 that’s got 3 rods knocking and a cracked exhaust manifold, with $1234 as the listed price and then in the description, they’re all like “The price is $58,000 firm. Don’t waste my time. No low ballers. I know what I have.”",
            "Thank you.  Frankly posting for $1.00 is just stupid.  I like your response.",
            "[deleted]",
            "I hate when someone puts up their place to rent with pictures of the places and list as a 2 bedroom then in the description state you are only renting the room. $1k a month is amazing for 2br where $1k a month for a room is way over priced.\n\nThere are options to list as a room for rent so don't list it as the entire place. Annoying AF...",
            "If reply something like\n\n\"If it's not $1, why was it listed for $1. Why wouldn't that be the real price?\"",
            "I had the opposite problem once.\n\nPosted up a roll around dishwasher, in great working condition (we had finally bought a built in) for free. Tons of responses, but nobody would actually show up to pick it up when we set a time with them. Tried this for a week and had ten or so no shows. Frustrating to say the least. Our solution? Reposted it with a $50 price tag. Not nearly as many responses but the first person who we set a time with actually showed up. Got themselves a free dishwasher too!  Couldn't believe that we didn't want their money...until we told them the story.",
            "Did they somehow expect NOT to deal with people taking them at their word? Such a waste of space.",
            "I put a nice desk on there for $100. Super cute girls make up desk. Sparkly, pink and white. With a cute upholstered bench seat and a mirror. No response but for a couple asking if I'd take $5. \n\nA week later I posted again for $10000 and wrote an over the top description. Sold it for $125 a couple days later.  The fella said his wife said get it. Didn't even look at it or open a drawer. Wife thought she was getting a deal. \n\nIt's a dumb game. Glad I'm learning how to play better.",
            "Either this, or people list 50 items in one post and \"pm for price\"",
            "I always set my searches for prices starting at $2 to avoid this nonsense",
            "If theybadvertise it for $1 ask for more info so you can file a report for false advertising.\n\nIf you are going to screw with someone, go for broke.",
            "There’s so many on fb who list it for free and then put “pm for price” or “obviously not free”. Drives me bananas",
            "If you're going to waste everyone's time with a lie as your price, you deserve to get called on it.",
            "What annoys me on Facebook marketplace is people selling things for hundreds of pounds and not even bothering to put a description or give an indication of condition.",
            "I also do this for items marked as free. Pisses the seller off immensely",
            "I hate those $1 listings on Craigslist and FB marketplace. Your idea is a good way to deal with that crapola. I’ve also seen free listings that have a price on an item/items. Egad, so vexing when searching for things!",
            "Thank you for doing this. I normally avoid these ads on principle. If I'm doing a search, I make sure to include both a max and a minimum price so I can filter out all the stupid $1 listings.",
            "Can i ask everyone to please use the report button whenever they can...\n\n\n\nIf you are frustrated of sellers posting $1 stuff  but asks for higher price, just to bypass filters and be at the top of the list, please USE the REPORT button on Facebook Marketplace or Kijiji for False/Misleading ad. \n\n\n\nDo you part. Report misleading $1 ads whenever you can. \n\n\n\nIts just so frustrating when you try to look around used stuff to purchase then you get all these $1 (or free or false lowball number) ads at the top of the list when you sort by price.",
            "I absolutely HATE when people do this! If I’m in a really foul mood I report their listing as incorrect price.",
            "I see people have listings for free and then it turns out it's a single listing that contains a whole lot of products that all cost $100+. They're too lazy to make separate listings. If I'm looking at free, it should be free!!",
            "You're a hero. Next take on the \"Free\" people that say \"send me your offer\"",
            "Seen $0 prices on Craigslist with \"serious offers only\" and I don't even know what to think anymore",
            "Also listings on hotels.com. Found a small rustic cabin I was going to book, the price was $100 per night. Went to check out, and oh yeah there’s also $1,350 in “taxes and fees” for the night. \n\nAnd just another rant on the same subject, why are Airbnb type rooms listed on hotels.com now, and hotel rooms are on Airbnb? The fuck, I got to a particular site for a particular type of lodging.",
            "As annoying as this is I prefer it to the \"Oh yeah $10 is fine\" then drive half an hour out there and suddenly they want $100 for it.",
            "There is a rule in Denmark that you have to sell the goods for the price you advertised it for, so if they did it there they could be forced by the police to sell the item to that price.\n\nOne of my teachers told us this story. I don't know if it is true: Once a man had advertised his very expensive sports car for sale for forty thousand bananas. It was at a time when a banana only cost a fragment of a krone. Someone showed up with forty thousand bananas and the police made the seller hand over the car in return for the bananas.",
            "Troll longer, tell them their $1 post creates a legal obligation for them to sell at that price. Then, \"You won't sell to me because I'm Black/gay/old/whatever! I'm getting the attorney general involved!\"",
            "This happens a lot on Craigslist.  They require a price, so many put $1.  Then they wonder why they got flagged off.",
            "I'm having the opposite problem currently where I put up 11 PS3 games for sale for $130.  I got ghosted by about 5 people until one guy offered me $50 for the lot. When I said no, he replied:\n\n\"Good luck with that bro. You can buy all those games on eBay for $5 each.\"\n\nI grabbed a random game and checked prices online again (I had already done so) thinking maybe I was crazy and he was right?\n\nI found the game on ebay for about $7... with $20 shipping. \n\nI didn't respond to him, but I'm thinking, \"You can come pick up all 11 games now with NO shipping or waiting for the mail.\"  It is a good deal really.",
            "Offer Up does this too. See washer and dryer on there all the time for $1. Read a little further and it says, \"Not the real price, contact us for details\".  Why tf would you do that? Just put the price so we can stop waisting everyone's time.",
            "This morning, \n\n2001 dodge ram 2500- long bed with 210k miles. They wanted $26k. Hahahaha some guy in the comments said,  \"the price seems a bit low,  can I offer more?\"",
            "My pet peeve is pro eBay sellers offering, lets say, a certain model of trainers in the range £5-£50 so that they show up early in the listings when you sort by lowest price. Then you click through to find the £5 size or colour is coincidentally sold out, leaving just the £50 ones available. I will then just buy from a more honest seller offering the same item for a few pounds more instead of these devious pricks that have tricked me into viewing their listing. Wankers.",
            "I hate when people do that shit. I don't get the mindset of why they think that gives them an edge but it makes me think they are stupid",
            "Shit, I’m sitting here bored at work. I’m going to do this to a few people right now. Sounds fun",
            "Absolutely.  You post it for a dollar, I'm gonna send you a dollar offer.  If I had more time, I'd figure out a way to bombard them with lowballs and report their ad from a dozen different locales to get it removed.\n\nI had a guy once offer me $200 for a set of wheels I had on the market at $800.  I replied, \"Sure.  Which one did you want?\" :D",
            "most ppl in my area just put 12345 into the price so it appears as $12,345 and tell everyone to message about the price, which seems really counterintuitive to me",
            "I wish there was a way to flag the posts that do this shit, and have them suspended immediately or something.   Like, if the price is less than $10 and gets more than 4 flags for \"too low a price\", then it's automatically suspended and maybe enough of those strikes can suspend your FB account..?",
            "Snap pic of $1 posting;\nYou: “Hey I’ll buy that.”\nThem: “Ok.”\nBOOM! legally enforceable contract!\n(According to my tort law class in high school 30 years ago)",
            "Keep it up. We all hate the 1$ posts",
            "Same in FB Yard Sale groups.  \nYeah, advertise a corvette or porsche for 60K-100K in a yard sale page. Isn't that what users go those pages for, exotic cars?",
            "Click on their name, report, \"inaccurate price or description\".",
            "People selling rings and shoes, and not including the size.\n\nItems with no measurements.\n\n5 blurry pics of the same view of one item.\n\nCabinets without a pic of the inside.",
            "I see so many people selling their used, 3 year old broken-ass iPhone for the same price Apple is selling a brand new one. They get fucking pissed when I point that out to them.",
            "*\"Yes, I have seen people adjust their price after responding to me, which feels like a win.\"*\n\nThat's absolutely a win.",
            "I hate \"ask for price\" too. It's like, why did we add another step to this process?",
            "I don't know why they allow that shit. It's the same kind of fuckery that sent craigslist down the crapper.",
            "Maliciously complying with the spirit of contract law. You suggest a price, I accept your price: we have a contract for sale.\n\nAnnoys me no end. I also see a lot of listings for multiple items and the price set is the price of the cheapest item, not all the items.\n\nPeople don't understand, putting a made up price doesn't make me interested in buying or improve their odds of selling because I had to open the ad to see a real price. It makes me instantly ignore the listing to spite them.",
            "You are the hero we need.",
            "Ebay sellers do something similar.  You can list multiple items in one listing and buyers can pick the specific one they want.  But if they include one item for a lower price the entire listing shows as that price.  So I would be looking for pocket watches and see a listing for them for $1 but it was 20 different watches for $15 each and a chain for $1.",
            "This is the wholesomeness I needed to wake up with this morning. Good work OP. You are doing good work out there",
            "You should see foreign country marketplace listing in local currency as well as $/€.\n\nPrice: 2000 RON \n\nDescription: price is in € (x5)",
            "Wish you could do this to the aholes on eBay that put one random cheap thing as a variety on a listing so when you sort by cheapest the list is just crap and you can't see the real price on most of them",
            "you asked a dollar, I have a dollar. play dumb and really let it play out.",
            "“Make me any offer. Really”\n\nOk. How about $100?\n\n“Wtf? Why would I sell it for that?” \n\nI dunno. Reword your ad",
            "I hate that when people and businesses clog the low to high pricing with the $1 crap.  Dude if I wanted a 10k car I would be searching in the 10k zone.  I am looking for a cheap pos.",
            "Yeah I had a friend who was all excited because he learned some basic web skills and was like \"what should I make?!\" and I suggested a filter for CL to take all the $1 posts that then have a price inside the description to be hidden or just relisted in price order.\n\nHe told me he had fun writing it.",
            "I won an ebay lot of Hair supplies, well over $1500 of product for $75 because SHE put pickup only, and no reserve. I asked her for the meeting address. She tried to ask me to pay more to ship it, I let her know that isn't how this works, I will meet her. She brings her boyfriend to the meet, they literally BOTH jump out of their car. I cracked a smile, and told the big ol hubby, can you grab my supplies? He got out, they LITERALLY halted, and then whined like brats as they handed us the product telling me I AM WRONG for winning at that price. 😂😂🤣😂🤣 k.",
            "Don't reply stating the price, leave that for later in the conversation",
            "Stubborn shovel seller - Don’t even reply\n\nhttp://www.dontevenreply.com/view.php?post=111",
            "My friend actually agreed to purchase for $1. Sent the message to the seller, seller invited friend around to view the item.\n\n Friend was happy with item and said as much. Seller was happy until friend tried to hand over $1. Asked what the hell is this?!\n\nArgument ensued as seller had originally messaged accepting the friend's offer. Ended with seller becoming quite unpleasant, chasing friend off property and threatening to call police for \"time wasting and theft\".",
            "We here have a website/app in NZ that allows you to auction off an item. But what pisses me off is that people put a $1 starting bid with a hidden reserve. And when I am searching for something those $1 items pop up first in line and actually wastes my time cause now I have to scroll past all of them to get to the actual classifieds. Also, what pisses me off is when you ask them how much they want they refer back to “will let the auction run”. How am I to know if I am interested in the item as I don’t know the actual price they want? So then I will put all those items on watchlist and right on before they close I will bid an exorbitant amount on them, and then not close. Then I effectively waste a week or more of their time(auction time is usually a week, plus the few days I go non contact)as they have to relist, plus having to log a ticket with the website to have their closing fee refunded as sale did not go through. And usually when they relist it is then at an actual asking price or reserve, not a $1 start auction…",
            "The $1 posts I can ignore, it's the PCs listed at $500, but are actually $1500+ are what I hate. They say it's so they can list it as free shipping, but it's still annoying",
            "Thank you for my new hobby",
            ">That’s just showbiz, baby!\n\nI imagined jazz hands",
            "I'm always suspicious of those insane high prices on Amazon and other places. A simple, recently out-of-print book is not worth $9000. Clearly a method of money laundering that Amazon doesn't seem to notice.",
            "I would love to have a group of 100 or so like minded individuals in my area. We could all agree to do what you are doing. After 100 responses like yours from different people, maybe they would get the message.",
            "$1,234 has entered the chat.",
            "Omg. I just tried it. That’s surprisingly satisfying.",
            "OP, You are doing God’s work. \nHelping clean up these practices, bit by bit! Lets all do this",
            "For sure some countries with strong enough consumer legislation would let you actually buy said product for the displayed price, even if it is crazy low.",
            "Ha those drive me crazy but I love your response to it!",
            "Omg this is fucking genius ! Thanks for the great tip going to start doing this lol",
            "I hate these types of posting as well. \nI usually just report them",
            "While thinking about you I just asked to pickup a Porsche 911 for 1 euro.",
            "The local online classifieds in my area are full of duplicate ads from people making their ad multiple times before they are satisfied. Then they leave them all up so you're scrolling along and all of a sudden you see 4 of the same item. And this happens so much it probably doubles the total overall number of ads. So every time I happen across this faux pas I respond to them asking if they will discount the price if I purchase all of them. They usually give a confused reply like \"what do you mean all of them? I'm only selling one\" or similar. So I apologize and say that since there was x number of ads, I assumed that you were selling that many. The majority try and say there was a glitch with the site, but we all know the truth. Amazingly satisfying.",
            "It's annoying when they do that but the worse offence is not removing the post once something is sold or no longer available. I hate looking for something and messaging 2-3 people who offer it to find all of them have gotten rid of it days or even weeks before. It also clogs the search results up with useless posts that you have to wade through. Once your item is sold or gone take your bloody post down.",
            "I hate it when you see a car listed at what seems a decent price if not a little too cheap only for it to say BREAKING.",
            "So many people post shit for $123,456 too. Like do you not want me to find your item when I set a maximum price? $123,456 is way too much to ask for your 94 Jeep YJ with a wave decal on the side!",
            "Meanwhile my FB marketplace suggests I should buy things like \"milk\" - $150 and \"For sale\" - yes that's the name of the item, the photo is of somebody's blank wall so I have no idea what is for sale, just that it is in fact for sale, for $100.\n\nBetween that and what you're putting up with, I've just given up on it as a platform to buy anything at all.",
            "I hate it when people post stuff for 1 buck.  I also try to arrange pickup for 1 dollar lol",
            "Being a kind-hearted soul I'll usually tell them i feel $1 is too low & will give them $5.",
            "I really hate when sellers do this.  It never makes me want to buy their thing.\n\nAlso setting the price to 1234 is similarly ridiculous.",
            "Be sure to report the listing as “no intent to sell”",
            "In Australia people post \"Expression of Interest\" or \"EOI\" listings. They get upset when I tell them that I'm not interested at all.",
            "Finally somebody that gets this!! I started reporting them because I find it annoying. I’d you’re going to post the price in the listing put it in the price field. Not $1 and not $1234. My wife doesn’t get why it makes me so angry.",
            "That's why whenever I look for something on these local marketplaces I'll always put a min price of 2 dollars. Eliminates all of these 1 dollar idiots.",
            "I was looking to buy a kayak on fb marketplace and there were a ton of listing for $20 but they were not for sale, they were for rent. $20 by the hour or something.\n\nBut fb marketplace is for selling items not services. I even checked the terms and conditions.\n\nSo I'd offer $20 to take it off their hands.\n(according to the T&C if they agreed  I'd technically own it as a purchase)\nNo one took me up on my offer though.",
            "I just report them as false advertising.",
            "Around here a select in-some-way challenged minority tends to leave out the last three zeroes on the price in their car or house ads.\n\nYeah, you are too lazy to push the 0 button three more times when trying to make one of the largest sales these couple of years in your life, that's speaking an awful lot of the energy you have spent on caring, maintenance and upkeep of the item while it was in your possession. I think I'll look for another one.",
            "Its the fast food model. The actual price/product look nothing like what's shown, because \"marketting\" just means outright lying at this point.",
            "\"My dog needs surgery. If I drive to you would you let it go for $0.75? That would really help me out.\"",
            "I hate this. Or “free” with prices in the comments. I will never buy something advertised using lies.",
            "Similarly people looking to buy stuff for $1 will never actually show up. So even when giving things away I always list them as $5 - and then hand it to people for free when they show up.",
            "Can we all team up - form a cabal of people who all request the $1 items at the same time? Sounds like fun! :)",
            "I feel like if there's nothing you can do to remove their post then its worth a few minutes to troll them for their rudeness",
            "you're doing good work. It's my pet-peeve too",
            "smile complete memorize crush unused reminiscent touch sip detail scandalous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I would buy 4-5 of the 500 rtx 30xx series everyday. So many people would write me angry messages saying I didn’t read the post and it’s 2k but Facebook only lists it as 500. I started an automated reply not that explains I will report them for not actually having the product and got blocked busy a bunch of people.",
            "Finally a good way to respond! Craigslist is full of this. People click on it to see the actual price, so the posters think they are getting more views because people are interested.",
            "I’m a big fan of reporting the post as having an “inaccurate description”",
            "Thank you I will now be responding to those posts this way.",
            "Be there if they advertise for that price they are legally bound to sell it at that price",
            "I am currently building a retro computer to get back in time a bit. I saw like 3 parts in one ad listed at 1 dollar, so I reached out to them, they said it was free lmao. even brought them at my house at no charge, fucking legend.",
            "Dude I do this every single time I get a chance",
            "I do this too. I hate those kind of sellers.",
            "I’m with you. That $1 shit really pisses me off",
            "I am someone who posts things for $1 because I actually want .... one dollar.  \nAnd people always write and ask, *how much is this*? And I'm like... uh, one dollar.  \n\n\nWe are getting rid of estate stuff for grandparents/parents.  When I post stuff for free people don't show up, but if they think they're getting a real bargain, they show up when they say.   \n\\*Big Shrug\\*",
            "I report everyone that does that.",
            "Why do people do that? It is so dumb..but I love your response! 😂",
            "Rock hound sellers do this. I hate it",
            "Honestly, this sounds like a public service. I commend you.",
            "I price things for sale very reasonably; it’s used and I want it gone. I ALWAYS get ‘what’s the lowest you’ll sell for’ to which I reply ‘what’s the most you’ll pay’",
            "When people posted cars and bikes for sale with the reg covered i used to message and ask for it to check insurance. \n\nThen I'd leave it on the comments for others",
            "I want to report those listings. List the real price!!!",
            "c'mon   do it right...   \n\n\n*\"Very interested;* ***will you take 75 cents?\"***",
            "There's gotta be a way to report this to Facebook",
            "People do that for housing sales and rentals here. It's so annoying but I've learnt to set the minimum price to two dollars o  the filter now.",
            "If you have a lot of free time, you should reply that you're willing to offer double the asking price after they tell you what they want to sell it for and show up with $2",
            "I hate that you can’t list things for free. The lowest you can list is $1.  Opposite problem of yours though haha",
            "You're cleaning up the trash, you're a hero in my books.",
            "£1/month for an industrial unit!\n\nhttps://imgur.com/a/RIq1SjG",
            "So annoying, I adjust my searches for anything over 5$. Fuckem",
            "Like those clowns that have ten posts for the same antique, painting or whatever. I am always tempted to offer $$$$ for all 10.",
            "Can't forget my personal favorite of $1234",
            "I've seen people list expensive cars as \"free\"",
            "Fucker on CL has had cargo Vans for $4,000...\n\n.\n\n.\n\n.\n\n\n.\n\n.\n\n\nDown. $26,000 to buy.",
            "I know assume if I see a post for free, it is 100% someone selling an MLM.",
            "I love this. I hate the FB listings without the proper price",
            "This is pretty sad.",
            "Based.",
            "Just make it a rule that if you're going to make an offer for $X, that's considered legally binding if someone offers that amount.  That $1 crap pisses me off too.",
            "I've recently had a need to sell a few things on marketplace and the number of ads in the free section saying not free is maddening.",
            "This is my favourite past time",
            "it's time we start posting items worth a dollar and pricing them for 19 grand. \n\n\"I know what I have, no low-ballers.\"",
            "I do the same thing, they usually change their price to the range they want lol",
            "Thanks for doing your part, those weasels piss me off so much!",
            "Your doing Gods work sir 🙏",
            "It’s such a dick move, listing for free or $1 when you want more.  I wish more people flooded them with your malicious compliance.  \n\nYou’re doing good work.",
            "This always annoyed me when looking for cars, like how does it help you to have people who's budget is 6k looking at your 20k car? It makes no sense and just wastes everyone's time!",
            "As a broke college boy to broke adult trying to be adult. thank you. \n\nMy first apartment in the poorer areas didn't even come with a fridge so it may serve as a good example how much i had to shop at a discount. So these types of posts filling up my free/cheap default search engines suuuucked",
            "I hate this on eBay. You do a search for an item and look at the lowest priced item first just to find it’s the price of a sample or another item linked to item you want. Then you discover the actual item you want is listed as three times more expensive.",
            "I used to report those, not sure if it did anything though",
            "I hate the \"keyword jumble\" so that listings show up in unrelated searches. When I have time, I email/message them \"is this an X? The listing says it's a Y, but you also mention X. What's the price for the X? You also mention A. Do you have one of those in a separate listing?\"\n\nLike, if I'm looking for a Sega Dreamcast controller, why do you think I want to see tons of listings that are specifically not for the item I'm looking for?",
            "I've seen houses listed at $1 and the realtors always get mad when I make an inquiry.",
            "I had a group of friends that would “attack” a seller for free items that when  you clicked on them were not free. I am not allowed back into these groups.",
            "I had the opposite issue. \n\nI bought a new couch and needed to get rid of the one I had. I got the old one for free from my parents who had bought it cheap second hand. While passing it through a door frame the back got slightly damaged (but it wasn't visible if you put it against a wall) and I had no idea how much to price it. I figured if I gave it away for free nobody could give me grief about the damage not being visible in the pictures and since I needed it gone fast and hadn't paid anything for it anyway, I wasn't concerned about making money from the sale. \n\nI got got messaged by all the penny pinchers who wanted me to bend over backwards for them, as if letting it go for free wasn't good enough. One lady even messaged me (TWICE!) to ask if I could deliver it to her (100km away) even though the add specified I couldn't because I have no driver's licence. I mean it's free FFS, hire a crew to come pick it up if you can't do it yourself, it'll still cost you less than most other items listed on the site!!"
        ]
    }
]