[
    {
        "post_id": "izlfiv",
        "author": "eatapeach18",
        "title": "I called my patient’s mistress, but I was just doing what I was told",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/izlfiv/i_called_my_patients_mistress_but_i_was_just/",
        "score": 16451,
        "num_comments": 489,
        "created_utc": 1601047383.0,
        "selftext": "This happened back in 2009. I was working part time at a doctor’s office while I was in nursing school. I was one of the receptionists and did all the filing and cataloguing and such. It was boring work, but the doctor (my boss) guaranteed me a job after nursing school so that’s why I did it. \n\nThis particular doctor was an orthopedic surgeon. We had lots of patients coming in for MRIs, CT scans, and X-rays. This one particular patient, Frank, was scheduled to have surgery in a couple days and he needed to come and pick up his MRIs and X-rays from our office and bring them with him to his procedure (yes, looking back at how ass-backwards things used to be is so frustrating... all these things are 100% electronic now, and even back then they were too, but my boss was old-school). So anyway, I called Frank to tell him to come pick up his images but he didn’t answer. I called him again during lunch, but still no answer, so I left him a message. The following day I called him again, but still no answer.\n\nIt was imperative that Frank got his images or else he wouldn’t be able to have his surgery. So I looked in his file to see if he had any other contact information. He listed his home phone number, as well as his wife’s cell. I called his house and left a message, and I also called his wife, Amy, but she didn’t answer either so I left her a message as well. The office manager, Diane, told me to just call whoever was listed in his emergency contacts because if Frank didn’t get his images and missed his surgery, then she would have to do a whole new stack of paperwork to reschedule him and she didn’t want to be bothered. I looked to see if there was an emergency contact, and Frank listed a woman named Helen. Relation to patient?: girlfriend.\n\nI told Diane I didn’t want to call Helen when I had already left a message for Amy, as it would put me in an awkward position. Diane said that as long as the patient listed them as an emergency contact, I could call them. She also said that it’s not uncommon for couples to be separated but still legally married for insurance reasons, and that this could possibly be the case for Frank and Amy, which I guess made sense. I really wanted to believe that no one would be stupid enough to put their secret lover as their emergency contact. \n\nI didn’t want to get fired for being insubordinate, so I called Helen and she actually answered her phone (I was secretly hoping she wouldn’t) and told her Frank’s images needed to be picked up prior to his surgery. She came by during lunch, got the images, and then left. I immediately called Frank again to let him know that Helen picked up his images and to not worry about it, but this fool wasn’t answering his phone, so I left him another message.\n\nA couple hours later, Amy called back and said she wasn’t able to answer before because she was teaching, but she got our message and was coming to pick up Frank’s images now that school was done for the day. I told her that the images had already been picked up. I tried to be as vague as possible.\n\nAmy: Who picked them up? I know Frank is still busy at his office and hasn’t had the chance to come get them.\n\nMe: [again, trying really hard to be vague] We called someone from his emergency contact list.\n\nAmy: Was it his brother, Steve? \n\nMe: [at this point I’m really nervous] No, not his brother.\n\nAmy: Well then who?\n\nMe: Helen.\n\nAmy: Who is Helen? I don’t know anyone named Helen.\n\nMe: I’m not sure, but since she was on Frank’s emergency contact list and no one else was answering their phone, we called her and she already came and got the images. \n\nConfused, Amy hung up. \n\nThe following day was Frank’s surgery. The day after Frank’s surgery, my boss jokingly asked me “What the hell did you do to that guy?? He came in all pissed at me saying that my secretary told his wife about his other girlfriend.” I told my boss what happened and that Diane told me to call the girlfriend, and he understood. Diane tried to throw me under the bus by saying I didn’t tell her that Helen was Frank’s girlfriend, and that I had told her Helen was “just a friend,” and that she never would have given me the green light to call a patient’s mistress, but I reminded her in front of my boss that she had said it was possible for Frank and Amy to be married but separated. This bitch was trying to cover her ass because she probably thought it was some kind of HIPAA violation, but nothing ever happened. I was 18 years old at the time and just did whatever my superiors told me because I was really thirsty for job security after college, but I ended up not working there and went to work at a hospital instead.",
        "permalink": "/r/MaliciousCompliance/comments/izlfiv/i_called_my_patients_mistress_but_i_was_just/",
        "comments": [
            "What stupid guy puts his gf as an emergency contact when trying to ensure wife doesn't find out.\n\nI mean, I would think that in the *how to not get caught cheating 101* handbook",
            "Man, the Diane’s of the world irritate me. That’s the type of superior that takes credit when things go right but passes the buck when things go wrong... aka a spineless coward.",
            "Hey, you totally did the right thing.  You followed your superior's instructions, and the patient's written directives about who to contact.\n\nAnd you exposed a cheater.  He deserves everything he got.",
            "Diane was a tool.  Glad you didn’t have to work with her long term.",
            "When my husband managed a warehouse, he got a call from HR that he had to tell one of the employees that he couldn’t put his pregnant girlfriend on his insurance unless he took his wife off. That was impossible since they were still together and it wasn’t open enrollment. He ended up just adding the baby after it was born. The wife was seriously pissed when she got the new insurance cards the next year and they listed a minor child that she didn’t know about.",
            "My business (insurance) is heavily referral-based, so we send gift cards and thank you notes to clients who refer a friend. I had a guy refer a woman to us, and I asked how she knew him. She said she was his girlfriend. Thing is, we insured this man's wife and kids, their family homes, etc. When the girlfriend was signing her new client form, it said at the top \"Referred by: Wife & Husband LastName\". She asked why his ex wife's name was listed and my assistant simply told her the form fills itself in when we associate a referral to the account that refers them, and left it at that. \n\nSo now comes time to send the thank you cards, which are always worded \"Thank you for referring your friend/brother/mother/boyfriend etc. NAME...\" and a personal note. Well I told my assistant not to send this one out, but apparently the owner didn't see the issue and made her send it out anyway.\n\nCue 3 months later and we are having to split up and rewrite all their insurance cause the wife threw his ass out and was keeping their house. Girlfriend dumped him too, since apparently he had told her they were already divorced. He actually had the stones to blame us and threaten to sue. Obviously that got shut down swiftly, but it was a wild scene to watch unfolding.",
            "Nice! \n\nI accidentally outed a boss' affair in a somewhat similar manner. The thing was I was new and didn't know it wasn't his wife but rather a coworker side piece. The company is large and many of my coworkers were related to each other by blood or marriage. Normally the company only allows relatives to work in different departments, but exceptions have been made. The bad bit was I outed him as having an affair with a subordinate which was a big no-no. He got fired for it a couple of days later.",
            "You were 100% in the right about calling her. I don't know if you should have told the wife who picked them up, your doctor's office should have had better privacy in place than that. But it all worked out in the end.",
            "Is that bitch who threw you under the bus the reason you didn’t go to work there after graduating?",
            "You did the right thing, technically divulging Helen's name COULD have been a HIPAA violation in some circumstances but given that the wife was already authorized to know what was in the files, you would have been clear on that part as well.",
            "telling the person the name on the emergency contact was an interesting move. i would’ve just said it’s private medical information and to ask the husband",
            "Not sure if it’s mentioned here yet but they could also have been polyamorous, or engaged in one of many different kink relationships that was serious enough to put the girlfriend as ICE contact",
            "I’m an OR nurse and on no planet would we ever trust a patient to bring their own images in! Even with everything being electronic, most surgeons just bring a folder with them of any images needed for the surgery day.",
            "Pretty much the same thing happened at my work. Both the husband and wife were patients. She found out about the girlfriend bc the gf was listed on his medical info release form and she wasn’t even his emergency contact.",
            "Fuck that guy.  He actively listed her as an emergency contact. You used it. His fault.",
            "Didn't I read this story from r/tifu several days ago?",
            "I hope there was a moment when she tried to lie and you got to say, “you literally said they may be separated that’s why he might have a girlfriend and wife both listed”",
            "If you are in the US, I'd have claimed HIPAA and stated I couldn't give out that information.",
            "Diane:  https://politics.theonion.com/clinton-written-up-by-total-bitch-supervisor-1819564533",
            "Good story, not entirely sold on it being malicious compliance though.",
            "[deleted]",
            "Poor you; poor Amy! \n\nFrank- you Devil, you! Ya got what you deserved. \n\nOP: If I were Amy, I’d honestly have sent you flowers and a treat. You’re my hero- no WAY would I have made it through the same situation so well. Haha",
            "I do medical billing and had this lady call in one day about her husband’s bill. She wasn’t on phi so I couldn’t tell her anything about it. She was wondering what kind of surgery/procedure he had. I got curious and looked it up. Turns out he had an enlargement done on his penis. He was young enough that his wife SHOULD have noticed that by the third month post procedure.",
            "“I am not allowed to give you details, ask your husband if you wanna know who is on his emerg. List”",
            "You didn't do anything wrong. I'm polyamorous myself and will definitely list multiple partners as contacts on things. If they're listed, you have permission to contact them, lol. He's the unethical scumbag who wasn't honest with his partners.",
            "How is this malicious?",
            "[deleted]",
            "In the early 90’s I used to run the Security Department at a busy DT hotel, we also handled the lost & found. One day a very expensive Patel Phillipe wrist watch was found in the bathroom of a guest room by the maid after the guest checked out. This was in the days before cellphones and email, but our department also had a non contact policy for L&F items to preserve the privacy of our guests.\n\nValuable items in the L&F required an incident report and then they were locked in the safe of the general cashier. The Junior Comptroller did some research and found this watch was worth more than $96 000.00 USD so he decided, all by himself, to contact the guy, perhaps expecting a reward. He looked up the info on the guest folio, called the guest but left a message.\n\nWhen the guest called back his call was directed to me and he was livid. The name on the folio, Adrian, was somewhat gender ambiguous, it turned out that was his secretaries name, but the number listed was his home phone. So the Jr Comp left a message on his answering machine identifying the hotel but using his Mistress’ name, which his wife heard. He had told her he was on a solo business trip to an entirely different city. He was threatening a lawsuit.\n\nEventually he calmed down and didn’t sue us. We shipped the watch back to him via special courier that cost the hotel $2500 and the Junior Comptroller is prolly flipping burgers in Nebraska. Who leaves a watch worth a house behind? Who wears one in the first place?",
            "Honestly it’s not your job to figure out potential scenarios involving patients’ info. He provided the information you needed and you used it. He is the idiot for putting his mistress down in the first place lmao.",
            "I hate it when colleagues lie and try to throw someone else under the bus. Own your mistakes or don't make them.\nI'm glad you got a chance to clear your name in front of your boss.",
            "At the hotel I work at, our head housekeeper once accidentally exposed an affair to a wife that her husband was having. While cleaning a room a housekeeper found a man’s wedding ring that was left behind, so she reported it to her superior right away. Obviously our head housekeeper wanted to return the ring to its owner as soon as possible so she called the number on his file. Well apparently he had put his home number down and his wife answered the phone, who had no idea that her husband had spent the previous night at a local hotel. Although it was never our intention and everyone acted as per policy, I’m really happy we were able to expose the truth to this poor woman.",
            "When I list an emergency contact, I list it in the event that I'm dying on the floor, not that I need to pick up paperwork.",
            "Im amazed at the level of privacy we have here in Europe (soon to leave but we’ll be back) this would get you so fired fined and sued.  \n\nIf it’s not the person named on the information you’re forbidden without explicit consent from the names person to discuss anything.  \n\nCan’t say, data protection is the standard answer to anything about the account.  \n\nYou’d be buried for even disclosing anything other than to say they have been picked up. \n\nA bank in the UK left an answer phone message on a customers phone which was their home number.  They revealed details of the type of bank account not the numbers or other secure information but just the name of it. \n\nThe name of it was enough to signify it had a certain threshold of money in it and the customer sued and won. \n\nOur gdpr rules mean fines for leaking ANY info is up to 4% global profit.  \n\nThis kind of exchange in the UK would open the OP the dentist and potentially the superior open to legal action and fines.  The law is such that you can be held corporately or personally responsible and that determines who pays the fine.  \n\nThe dental practice could also be struck off in extreme data breeches so you’d have had a totally efficient get out clause. \n\nBut as a general rule most people won’t argue with can’t tell you for privacy reasons.",
            "[deleted]",
            "What was malicious about following directions from a superior?",
            "It may have been a HIPPA violation to tell Amy who was on his emergency contact list. They have to have a disclosure form just to be able to use emergency contacts, however that does not usually grant broad permission for the office to give names to anyone else\n\nGlad it all worked out though",
            "Pretty sure it was HIPAA V to give out that name, but you did maliciously comply to calling I guess.",
            "If you had really wanted to bury Diane, you could have repeated that she also said it was too much work to redo the paperwork for that guys new appointment. Thank you for the story!",
            "I once told a patient's wife he needed a preventive procedure to avoid problems in his only eye. Wife was  surprised because she didn't know her husband had one prosthetic (artificial) eye.",
            "\"How DARE that secretary 'out' me for being a cheating skeez after I foolishly listed my wife and mistress as emergency contacts!\"",
            "Serves him right. What kind of fool puts their girlfriend as emergency contact when they are cheating on their wife?!? Though I would think telling his wife who his emergency contact was would be a hipaa violation.",
            "Hard to believe a married man would list a girlfriend as an emergency contact. As it is to believe man and wife were to busy to take a call from the surgeon.",
            "Oooh frank! \n\nGreat story!\n\n I cannot belive how common this is though!!",
            " Frank and Diane deserve each other",
            "I had an MRI that I had to hand carry to a neurosurgeon, but when I went the chiropractor, he was able to download it.",
            "Sounds like he may need a \"frequent Flyer\" card with the orthopedic surgeon after that.",
            "The fact that he was named Frank just makes me picture him as frank from always sunny and that makes this 1000x funnier",
            "This doesn’t sound malicious at all",
            "I took care of a patient while I was a nurse tech while in nursing school. The patient got in a motorcycle accident and was paralyzed from the chest down. A passenger was also on the bike, but not injured. The passenger was at his bedside when the patient's wife came in. Mistress meet the wife. Shit went down. Security was called. The patient was then alone for the next few weeks except his parents stopping by to visit him.",
            "Years ago, I worked in a hair salon. There was a guy. Who used to bring his wife to the shop on Wednesday and then his mistress to the shop on Saturday. It was a very strange situation.",
            "That last line was golden lol \n\n\"I ended up not working there and went to work at a hospital instead.\" haha good for you",
            "I may be dumb, but could this be considered a HIPAA violation? Please don't downvote me if it is, I'm just curious",
            "Not sure if this would actually qualify as a HIPAA violation, but if the wife isn't explicitly authorized to his medical info, it could. Either way, you could have easily used HIPAA as an excuse when you were talking with the wife. Of course, as far as malicious compliance goes, job well done.",
            "“I can’t say who picked them up, but it’s noted here in his records that they were earlier today.”",
            "Nah Frank fucked up when he got the gf then made her an emergency contact. You just did your job",
            "I've worked with several Dianes in my life. The main thing to remember that they can teach you a lot about people. Glad you didn't get stuck with her in your life for too long.",
            "That's so dumb your super tried to throw you under the bus. The guy is the one who left the info, and you guys had to contact him. It's his \"fault\"",
            "I worked at a medical insurance company for a few years. One Railroad employee had two wives listed. One was having a baby. When we accessed the records, we were trying to figure out the wife’s name. We told him we would cover a current wife and an ex wife if legally required but he couldn’t have two current wives, that by the way lived in two different cities at each end of a train line. We didn’t want to blow up his secret by calling the wrong wife.",
            "I am certain this would fail OPSEC protocols on the Adultery forum.",
            "Everything was right but I do think it might be a HIPAA violation to tell the wife of the patient about who exactly picked up the patients results, you could have just said to the wife that for the privacy of the patient you could not inform her of who picked up the results.",
            "First thing you say is its data protection i cannot tell you who we have called",
            "In a situation like that, even if you know that you're cleared to discuss private information (ie, not a HIPAA violation), err on the side of caution and be like, \"I'm not at liberty to discuss who picked them up.\" Tell the person it's something that they will need to discuss with (the patient).\n\nThis puts all the weight onto the patient's shoulders and provides a window of opportunity, where the patient could claim that it's a coworker that had time to do it for him... at least if he's fast on his feet when it comes to realizing what really happened and knowing to cover his ass really quick.",
            "Little ditty, 'bout Frank and Diane!   Frank's a big cheater and Diane's a lyin' ass!    Oh yeah, life goes on!",
            "Fuck Frank. Fuck Diane too😂",
            ">all these things are 100% electronic now\n\nLol, yeah, today the patient has to walk into the office and waste sweet time waiting for a ***100% electronic*** CD of the images to be made, and then carry that over to the other doctor's office where the staff say, \"Hang on, we have to find the one computer that still has a CD drive.\"  \n\n\nWave of the future, Dude. 100% electronic.",
            "I don't think this was a malicious compliance since that is what's supposed to happen. I mean, unless there was a specific policy that prevented the office from reaching emergency contacts, but that would be a redundancy then.",
            "This isn’t malicious compliance but had an amazing outcome. It’s great the cheater got caught.",
            "Depending when this happened a lot of the HIPPA privacy stuff had yet to come into place. The HITECH Act added a lot of provisions in regards to PHI in section D. Since our company handles the IT of a bunch of insurance and medical providers we have to take a few courses/tests a year on what and who are covered.",
            "Man, I knew a Frank around that time who was beaten to death by his mistress’s other boyfriend. But I don’t think he had a wife. Hope your frank made it!",
            "I usually put my sister as the emergency contact since my wife never answers the phone.",
            "r/tsfu",
            "Poor wife, she was married to a piece of shit like that. She had to find it out like that.",
            "I don’t believe this story.  It is a HIPPA violation unless a patient has given written permission to release health information to a third party.  I can’t even talk to a spouse without the permission of the patient.",
            "I SWEAR there was an identical post a few weeks ago about a telephone company or something.\n\nThat or I have some SERIOUS deja-vu",
            "I knew a lady who was the practice manager at a doctor's practice. She was making bank (>$200k a year). She told me she had two roles - manage the office manager under her and keep one of the partner's wife and mistress away from each other. Both women had children with this man, they knew of each other (after a while), my friend's job was to manage this man's time so his two lives never intersected.",
            "So I’m gonna say something not probably what you want as a comment. You were way too involved in this scenario. Call the contact list, whoever answers is not your concern. If the wife calls you just say someone already picked it up. That’s it. It’s a breach of patient confidentiality in anything else. While I hate people that cheat in your code of ethics that is not ok. Health is your job, that’s most important.",
            "[removed]",
            "[deleted]",
            "I've literally read this story before on here.",
            "This seems made up.",
            "I get it, everyone hates cheaters, but this is just fucking gross.\n\na) Emergency contacts are for use in emergencies. Not wanting to do extra paperwork is obviously not an emergency.\n\nb) How does authorization to call people on Frank's list also mean you're authorized to tell one of his contacts about *other people* on his list? It might not be a HIPAA violation, but it's absolutely a violation of Frank's trust and privacy.\n\nc) What if Helen had been Frank's biological daughter who had been put up for adoption and wanted her identity protected? What if she was someone Frank trusted but Amy had problems with? Frank gave you her information for his own health and safety, which is his right even if Amy wouldn't approve. You literally could have destroyed a marriage/family all to save your boss some fucking paperwork.\n\n&#x200B;\n\nCheer all you want that this cheater \"got what he deserved,\" but it doesn't change the fact that OP and her boss behaved unprofessionally and unethically.",
            "There is a 0% chance this happened. HIPPA would not allow you to discuss who you gave those images to. Unless you're not in the US I guess?",
            "That's cool that you were able to finish college by 18. I was 18 my whole senior year of high school and I didn't even have any do overs."
        ]
    },
    {
        "post_id": "cgyhoa",
        "author": "None",
        "title": "Getting all my PTO paid out",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/cgyhoa/getting_all_my_pto_paid_out/",
        "score": 16447,
        "num_comments": 730,
        "created_utc": 1563915971.0,
        "selftext": "Despite working in a high stress, high tech sales role, I believe that when you’re on vacation (paid time off) you don’t work and disconnect. \n\nWhenever I was on PTO and my manager would request something from me I would email “Are you asking me to work on my time off?”\n\nThe answer was always something like “Yes. I really need this done.” After I worked I would re-claim the vacation time in our employee portal. \n\nI saved every email. \n\nLast week HR launched a new portal that allows us to see vacation time, sick time, etc. \n\nMy vacation balance was about 2 weeks short. When I alerted HR to it, they said that they took back a chunk of time I had reclaimed because they felt I was abusing the system. \n\nThen I sent them every email from my manager asking me to work, documenting that it truly wasn’t time off. I also included a link to the state law stating that even a minute worked in the day counted as a full day (I’m salaried). \n\nMy PTO balance was quickly returned.\n\nEDIT: Sorry folks, but I won’t reveal my state outside of saying New England.",
        "permalink": "/r/MaliciousCompliance/comments/cgyhoa/getting_all_my_pto_paid_out/",
        "comments": [
            "I had something similar happen to me.  I worked a high-intensity tech job, which meant no vacation for about 3 years.  Someone must've audited the books and flipped their shit or something, because I got 6 weeks' worth of paid out PTO on top of my biweekly check.  Then the next week they implemented a \"use it or lose it\" policy.",
            "Always good to keep a record of it.",
            "Step 1:  Don't be contactable during during your vacation.",
            "GOOD.\n\nIf you're on vacation you shouldn't have to even so much as *think* about work for the duration. If you *choose* to indulge your boss you should definitely be compensated for it.",
            "This is great, good on you. \n\nI'm currently on PTO and do check my email at night (mobile access) just to see if anything interesting has come through. \n\nI already have three emails asking questions that are of an \"urgent\" nature, even though a) I have an out of office message up with who to contact in my absence and b) they're requests that can easily be handled when I return. \n\nSome people are just incredibly impatient and don't know how to proceed when faced with the slightest hint of adversity.",
            "Awesome. Too bad my company has unlimited PTO",
            "You weren't abusing the system. They were abusing your PTO. The cost of that is your reclaimed PTO.",
            "Good job! More people need to stop being job-scared and get proactive with this type of thing. Unless you live in a \"right to work\" state. Then you could literally get fired for absolutely nothing.",
            "What state was this?",
            "They tried to pull a sneaky on ya",
            "Awesome job!\n\nI never would have thought of saivng the emails",
            "I've always thought the US should adopt 5 weeks vacation for anyone working 40hrs a week. Plus a week at the minimum for sick days. Like Europe. I work to LIVE not live to work. And funny enough I think I'm one of the only ones that doesn't get motivated by OT or working weekends for boosted pay. I'd rather be fishing. Like I'm fine doing the extra work for OT but I won't go out of my way to achieve a certain number of OT hours per week.\n\nLike the fact that I'd get OT for working over 40 doesn't motivate me to want to do it. I'm already at work 40hrs a week why should I want to be there more?",
            "Fuck, sending your boss an email on vacation asking if you have to spend time working on your vacation should count towards that. \n\nIf a boss knows full well an employee is on vacation and decides to contact them then that nullifies their vacation day. You are the LAST person your employee wants to see or hear from.",
            "Good for you - too many times they get away with this kind of stuff only because people just quietly accept it.",
            "> they said that they took back a chunk of time I had reclaimed because they felt I was abusing the system. \n\nThat's super wrong, to just silently reclaim it because they had a gut feeling. They should have demanded an explanation instead and decided afterwards.",
            "Can anyone find the state law? I'm curious to as if my state (Michigan) has that law enforced.",
            "OP: You think *I'm* abusing the system?",
            "My dad would take a day off here or there but never took a vacation for more than that. He decided it 2as long overdue and took a vacation of 2 weeks. He went to visit my uncle in another state. Him, my stepmom, and my other uncle drove from California to Texas. Halfway through his trip and the owner calls him. Tells him I hope you're enjoying your visit and tell them hi for me. I got bad news. We're closing the business down. Having to file for bankruptcy. My dad said well then I guess I dont need to be back so soon. They ended up paying him for the rest of the month his regular salary and gave him 8 months severance pay. He only took that month off before he had another job lined up. Now he has an engineering business he started with his boss. \nHes taking another month off to come visit me. My husband reminded him about last time he took a whole vacation the company went belly up. Asked him if he was sure. My dad laughed and said I'm sure. I'm ready for retirement anyway.",
            "What was malicious about this?\n\nHR thought you were abusing PTO, you showed them documentation, they returned your PTO.\n\nSounds pretty cut and dry.",
            "When I was a young dude—like 22, 23, 24—I was the managing editor of a magazine. I was pretty much in charge of the day-to-day operation of the business and the lives of about 14 editors and designers. Among my non-editorial duties was to file HR paperwork with corporate since we didn't have an HR person in our office (they were all in the larger offices in New York). \n\nHR paperwork included PTO for employees, but I never filed so much as a sick day for anyone on my team. \n\nSee, we were working in a high-stress, high-demand occupation. Deadlines in print media are real, and it wasn't uncommon for my guys to work multiple 18-hour days to make an issue. Hell, I slept under my desk during my tenure more times than I could count, and I could guarantee losing at least one full weekend a month to deadline responsibilities. \n\nThe company gave us \"comp\" time after deadlines, but that was unofficial. If you worked through the weekend to make an issue, you were allowed to take two days off during the week. The idea was ok, I guess, but you can't bank comp time. It was use it or lose it, and since we liked our jobs and wanted to be good at them, hardly anybody took advantage of comp time. \n\nThe company gave us about 10 days a year (you got 15 after five years with the firm) in vacation. There may have been another 5 in sick and personal time. Nobody could ever take a proper vacation—going away for a full week straight—because the job made it impossible. When people took time, it was like a day or two here and there to bridge a holiday like Thanksgiving or to extend a weekend for a short trip back home.\n\nWe were all young guys back then (hardly anybody was older than mid-20s), and most of us were single, but we did have a few married guys on the team. One of them, the lead designer, wanted to take a proper, two-week vacation to an exotic location during a slower time of the year. We were excited for him and envious. He worked hard, and he did everything you could ask a guy do to pave the way for being out of the office for two weeks straight. He had everything in order, including his pre-filled out PTO paperwork. \n\nI could have easily slipped his form into the inter-office mail envelope so he could be square with HR, but I didn't. As far as I was concerned, he earned the time and the cushion if something were to happen to his job.\n\nAnd something did happen to his job. Two weeks after he returned from vacation, management closed the office and moved the magazine to the other side of the country. Some of our guys took relocation packages. Some, like the designer, couldn't. Fortunately, all the guys on my team who watched their jobs move away were paid out with 15 full days of unclaimed PTO upon severance with the company.",
            "[deleted]",
            "HR just fined you 2 weeks of PTO because they ‘felt you were abusing the system’?\nWhy the hell didn’t they talk to you about it, rather than just judging you, and fining you, and expecting you not to notice? That sounds like pretty terrible HR to me.",
            "You're working the system to your advantage by claiming minutes and personally I applaud you for sticking it to a system that would love to exploit you but don't be surprised if your name climbs a little higher on the list when they get the inkling to trim some fat from the payroll.\n\nMyself, I just don't answer calls/emails during vacation time and I let them know ahead of time that I won't be available during those hours.\n\nI often leave the shop on weekends/PTO with the farewell \"Have a great weekend and if y'all need anything just know you can kiss my ass until (scheduled date of return)\".",
            "r/RegularRevenge",
            "Sweet baby Jesus! I love this story!!",
            "That's the main reason I still have two SIM cards. One work and one private. Guess which one gets turned off during vacation...",
            "Even if they thought you were abusing the system - why did they not tell you that they were changing it?\n\nSeems pretty sneaky of them.\n\nAnd if they thought you were abusing the system they should have not been approving them when you originally sent them through.",
            "Nice story, but where is the malicious compliance?",
            "I see this more of a revenge than a malicious compliance.",
            "What state?",
            "Smart.",
            "This is why you save. Fucking. Everything. Companies are there to get maximum work for minimum pay, They'll absolutely fuck you around the law if they think they can get away with it.",
            "My first boss was an \"IT Director\" of a small private college.\n\nHe was also a teacher in this same college, in a country where teachers get three months of statutory vacation time.   \nAnd a workaholic.  \n\n\nAt one point, he accrued over a two years worth of paid vacation.   \nHe was decidedly unhappy when the HR lady told him to take two weeks off during the summer break that year.",
            "Yep. You calling them out was abusing the system. Sure. Good on you with the emails.",
            "I bet Hr then spanked ur managers ass",
            "By chance, would you happen to know what law that is (it'd be BEA-UTIFUL if it was in PA!)",
            "Same thing goes with bosses texting. We get paid for all of these accumulative work related texts, too! 💰",
            "Anybody got a link to that state law?",
            "That's a crappy policy.  For my folks, ESPECIALLY the hourly ones, one phone call on vacation is automatically an hour off PTO. That's THEIR time and not the company. I've never been called out approving time for thsi.",
            "I’m saving this for my husband - he also works a stressful high tech job, and he OFTEN has to work at home or at night because of “emergencies”. I guarantee he’s worked on PTO too.",
            "I don't want to be a stickler to the rules as I enjoyed your story. But this didn't feel malicious at all",
            "How can I check what states have the minute for a day rule?",
            "MAN! I need to check this rule in my state. EVERY JOB I've ever worked has \"required\" me to work during vacations.",
            "thanks for the sweet justice boner",
            "New England Patriots\n#he's from Massachusetts\nGot'em coach",
            "This sounds like regular compliance.",
            "*works in sales*  \n\n*salaried*  \n\nHmm",
            "Great job saving those emails.",
            "Which state? I'm fighting similar",
            "What is the state law you are referring to?",
            "Awesome.",
            "Karma +10",
            "What states have this law??",
            "What's the law?",
            "Best solution is to have an automatic email message replying: Im on holiday, I will be back to work on x date",
            "State? and the law?  \n\nIn my state, you have to work 4 hours for it to be a full day.",
            "This isn't malicious compliance.  This is doing the right thing.",
            "I just don't put in PTO until I actually get uninterrupted time off.",
            "and you feel this is a win? \nYou should quit that job; they clearly don't respect you.",
            "They claim you're abusing the system when it's obviously them abusing your time off.",
            "My boss just implemented a rule that says we'll be terminated if we call off sick the day after PTO.",
            "Exactly! Who was abusing the system???? Now they know.",
            "Which state do you live in?",
            "At a previous job we had a PM who had taken little to no time off in the 15 years she'd been working there.\n\nThis person was forced to work 4 day weeks for a long time.",
            "Unions are a check to large employers. Democracy in the workplace where you work under contract.",
            "What state is this?",
            "Honestly, that's not even malicious; it's just compliance. Good for you.",
            "We had a motivational speaker at our last large sales meeting, Erik Qualman, who said that he went on PTO with an out of office like “email system is down until xxxx date, if important please resend on that date” and only like 3 of 300 emails got sent again when he returned. I can’t remember the specific details but it sounded like a great idea!",
            "My Father in law works for a small company, they allowed unlimited accruing of PTO. He is a pivotal piece of the company so over the ~15 years he's worked there he's build up about 6 months of PTO. They told him they weren't allowing accruing and he was going to lose it. \n\nHe told them he'd see them in 6 months. They quickly amended their policy to allow for grandfathering so he is still allowed to build PTO and says he'll likely build up around a year and then just retire a year early.",
            "and sadly you are likely now a target for being let go. it may not be this month or even 6 months, but you are now a target. HR isn't for the employee like employeers claim, it's really for the employer.",
            "Does the law not allow for half-days?",
            "Your boss sounds like he/she is really bad at their job.",
            "OP which state is this? \nCurious as to the wording of the one minute is a whole day for salaried!",
            "Damn son. You stood up to The Man and won. \\*slow clap\\*",
            "How is this MC? This is just keeping records of what you’re owed.",
            "New England Gang (I’m from NY)",
            "Vacation is just that vacation. What asshats"
        ]
    },
    {
        "post_id": "10xyhdk",
        "author": "wastingtimaway",
        "title": "Picky Karen does not want to listen to my explanation.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10xyhdk/picky_karen_does_not_want_to_listen_to_my/",
        "score": 16441,
        "num_comments": 756,
        "created_utc": 1675958888.0,
        "selftext": "I use to work at a Tex-Mex restaurant, you know the ones that charge like $12 for a taco.\n\nI had a customer come in and she asked for 2 quesadillas that was gluten free, cheese free, Vegan free hell idk everything else free. I told her everything we normally put on it and she said no to everything. So basically, all she wanted was our gluten free wrap with lettuce and tomato. \n\nOkay that is fine, but if I put this like that into the system it will be $12 a piece....... I can just get you a lettuce wrap with tomato and it will be $2.25. \n\nI was even going to heat it up a little (the bread) for her. \n\nI tried 2 times to explain this to her and she interrupted me and said \"I know what I want. I want the quesadilla this way and if you cant understand this, then go the the manager.\" \n\n&#x200B;\n\nSo I understood her, got it made the way that she wanted and brought it out. She gave me a smirk and was like see I knew you could do it! \n\nThat made my blood boil and I was in shock that she was so dense. \n\nOnce the bill came she grabbed it and before I could walk away she yelled \"Um excuse me\" so loud the surrounding tables all stopped. \n\n\"Yes mam what can I help you with?\" I asked.\n\n\"Why the hell is it $24 for my 2 quesadillas.\" \n\n\"Because the price on the menu is $12 each.\"\n\n\"Yeah but I didnt get any of the included items\"\n\n\"Yes but you ordered 2 quesadillas. Therefor that is what you got charged. \n\nShe of course spoke to the manager who sided with me and the lady paid her bill (the full $24 for those quesadillas) \n\nI did not however get a tip.",
        "permalink": "/r/MaliciousCompliance/comments/10xyhdk/picky_karen_does_not_want_to_listen_to_my/",
        "comments": [
            "\\*Insists it be a Quesadilla\n\n\\*Doesn't want cheese\n\nGood grief",
            "You were never going to get a tip. You shoulda called her bluff from go and got your manager the first time she wanted to be a dick. “Ma’am. You are correct I don’t understand what you want. Let me go get my manager.” Don’t break yourself for these idiots.",
            "Order burgers without the bun all the time. Glutens messes me up something fierce if I get too much at any given time. No sense wasting the bun in my opinion.\n\nI worked as a cook in a restaurant during college. Used to get cheese steak orders all the time without the bun. You'd be surprised how little food it looks like without the bun and we'd get complaints I was \"shorting\" their steak. Bitch, it comes in a pre-formed \"steak patty\", I gave you the exact same amount as everyone else. Lol.",
            "I go out to eat a lot and if a server has a suggestion on a better way to order something I listen.  They know the menu and feel that saving the customer a couple bucks now results in a nicer customer and repeat business.",
            "But now she's mad.  You may have lost her business forever ...",
            "Your manager should have tipped you!",
            "Your tip was the fact that she had to eat the cost of her lack of communication skills.",
            "I used to work at an Einstein bagels, and the Sunday lunch crowd was always the worst. \nWe had two different sandwiches with similar names, a deli turkey and the \"tasty turkey\". The main difference was the Tasty Turkey had cream cheese on it, but it cost more. \n\nWith a line out the door, we'd still get most customers waiting to figure out what they wanted and staring slack jawed at the counter. Theyd complain about the wait, but then add even more to the wait. \n\nYou knew you were in for a bad time when the customer would say \"Turkey Bagel\" which isn't on the menu, and doesn't tell you what they want. \nYou'd have to then ask \"Do you want a Tasty Turkey Sandwich or a Deli Turkey, and what bagel would you like that on?\"\n\nFor some reason, I think just the name, people would knee jerk decide on the \"Tasty\". It's shocking how often it would happen that if they'd look at the ingredients they would ask for no cream cheese. Which is a deli turkey. \n\nWhen I first started there I would try to point out the difference. It would save them a little cash, but ALMOST any correction from me was treated with belligerence and immediate hostility. They KNEW what they wanted. How dare I ...\n\nI was there for maybe a month before I completely gave up. I got to the point where as soon as I heard \"turkey bagel\" I'd reply quickly \"Great! A Tasty Turkey? What bagel would you like that on?\" \n\nId deliberately stage that as a question. It really became a defense mechanism to just get people through the lunch rush faster. \n\nI sold quite a few deli turkey sandwiches at the Tasty Turkey price. People should read the menu while they wait in line.",
            "She got hit with that ID-10T tax. 😆",
            "When I was in college, I worked at the dining commons. One of the shifts was \"chargrill\" where you frequently got orders for \"Charburger, no bun.\" One day a girl came up and said, \"Charburger, no\npatty.\" I looked at her and said, \"Charburger, no patty? Really?\" She said yes, and I repeated it slowly, with extra emphasis on patty, adding, \"You only want the bun?\" At which point she woke up and was very flustered. I started laughing and said, \"I , knew you didn't really want what you said you wanted, but we are supposed to give you what you ask for.\"\n\nThat was the grossest shift because you had to completely clean the grill with a hot water spray hose on the back dock when you finished. You went home wet, greasy and reeking. Great times, lol.",
            "As someone who has severe dietary restrictions on top of Celiac, it’s mind boggling anyone in a similar boat would just go eat out without any type of homework. \n\nIt’s these people who make it harder to trust people like me. Fuck this bitch I’m glad she paid $24 for two tortillas lmao",
            "Nice of your manager to take care of you.\n\nAnd this reminds me when I went to a restaurant and ordered a burger without buns. I was trying out some stupid diet :D\n\nThen I hear from the kitchen someone yelling \"What the hell!\" I was so embarassed, haha. Mainly because it occured to me, I could have just ordered a burger and not eat what I don't want from it. Live and learn :D",
            "Quesadilla with no cheese or tortilla, makes sense",
            "This reminds me of working at a movie theater in high school. One time two adult friends came in and ordered two medium popcorns, about $6 each. I told them for $7 they could order a large popcorn and get the free refill right away, saving them $5. They declined and insisted on the two mediums. I just don't get people sometimes. I think about that a lot.",
            "I had to share my office with a co-worker who annoyed me to no end.\n\nEveryday she'd call Po Folks restaurant and order their big salad.  Then she'd say, \"no dressing, hold the cheese, hold the carrots, hold the onions, hold the croutons.\"\n\nEveryday I just wanted to scream at her, \"Lady all you're getting is iceberg lettuce!\"",
            "We had people do this at wendys all the time!! \n\nIdiot: 'I want the bare minimum of this sandwich.'\n\nMe: 'ok. But if I build it-'\n\nIdiot: 'THIS. WAY. LADY'\n\nMe: '....okie...' \n\n-orders. Tells total- \n\nIdiot: 'THAT'S NOT RIGHT. YOU'RE TRYING TO RIP ME OFF.'\n\nMe: 'if you want x sandwich. And remove stuff. It doesn't lower the price. Let me do it this way now.'\n\n-fixes it myself. Builds it. New lower cheaper total-\n\nIdiot: 'see. Was that so hard? Just do this next time. 🙄'\n\nMe: 'right... next time tell the person you want to build the sandwich. Or they may just cancel the whole order. Like I did because I have to go do dishes.'",
            "“Ma’am, what you want is a *salad*..”",
            "With her attitude, you weren't going to get a tip regardless.",
            "Let the idiot spend her money",
            "This reminds of when I was in California a couple of years ago and went to an In-N-Out Burger for the first time. This was when the new meatless burgers (Beyond Burgers) were becoming popular. The counter people didn't speak a lot of English and I asked them if they had a vegetarian burger. I wasn't a vegetarian but I liked the new veggie burgers. They said yes, so I ordered one for my wife and one for myself and then we drove away. Then we opened the bag and found hamburger buns with sauce, lettuce, tomatoes, onions and nothing else. Haha. Next time we'll know better how to order at In-and-Out.",
            "If you ever need a short and sweet reason why tipping culture has got to go...",
            "Worked at McDonalds when Large drinks were $1, and kids, small, and medium drinks were, like, $1.29/$1.50.\n\nCustomer asked for a Small drink ($1.29). I suggested they get a large, because they get more and it’s cheaper. Customer, very rudely, proclaimed, “No, I want a small!”\n\nPaid $0.29 more for a small. Never made sense to me. They were ordering to-go, and they were ordering from inside the building. Like, unless they have no self control to not fill it all the way, they could’ve just filled it as much as a small and saved money. 🤷‍♂️ I know $0.29 isn’t much, but if you do that every time, they could’ve bought a burger with the savings.",
            "News flash: I don't think you would have gotten a tip regardless.",
            "If I were that manager, I would void that check, ring it up as you offered to the customer, and then give you the difference as tip.\n\nBut that’s probably why I’ll never be allowed to manage a restaurant.",
            "What you SHOULD have done is after she paid the bill is cancel the order and put the REAL item (veggie wrap) in and split the TIP with your manager!  LMAO",
            "I’m more impressed by your manager !",
            "Y'all, We can't fix Stoopid but sometimes.. just occasionally.. it's incredibly satisfying to watch them hang themselves if you'll just give them enough stout rope!",
            ">the lady paid her bill (the full $24 for those quesadillas) \n\n>I did not however get a tip.\n\nBut the manager gave you extra cash, right? Because the cost should have been $4.50, so everything over this price should have gone to you. That's how it should work, shouldn't it?",
            "Put a new item on the menu just for her - a nonsensadilla: a quesadilla with nothing on it.",
            "You might not have gotten a tip but you got backed up by your manager and that my friend, is worth it. That customer will not be back and you've got a great story to tell 👍win win",
            "It's not about the money, mostly, it's about *power* specifically the power to make you do what she wants. \n Mind you, you and your manager making her pay full price kind of ruins that little  controlling power trip moment she had going there. Pretty sure she didn't enjoy her sad pathetic little meal.",
            "Sometimes it is 100% worth it to sacrifice the tip to prove a point.",
            "You may not have received a tip but maybe she got a clue.",
            "Never interrupt the person who's trying to explain something you're about to eat!",
            "Your tip was being able to tell this story online and shame Karen.",
            ">\tgluten free, cheese free, Vegan free \n\n...I sure hope your food is normally free of vegans...",
            "Probably another “tik tok food hack”",
            "You should have been given the difference between the lettuce wrap and the quesadilla as a tip for dealing with her.",
            "I love reading stories like this. Remember reading another from someone who worked at one of the big three burger joints. A woman ordered a burger with fries and drinks. Cashier rang it up as a \"meal\" and the woman had a fit. Cashier tried explaining that if she rang the items separately, it cost like 2 bucks more, but the customer wasn't having it, and stated she wanted it as she ordered. Then couldn't understand why the price she owed got higher. Then there's the story I also have heard of someone ordering a cheeseburger without cheese and having a fit when the cashier called it a hamburger.",
            "Eh. She wasn’t the tipping type, anyway, was she?",
            "Cheese with no cheese. Ppl are weird these days. Like a lot",
            ">I did not however get a tip.\n\nI know how people like her are; she wouldn't have tipped regardless.  I'm glad your manager took care of you.",
            "the lesson we learned here is: always listen to the associate’s advice on how to craft your order to save money. they KNOW.",
            "The real tip was that she probably won't ever come back",
            "Totally worth the tip skip.",
            "That's why I hated working in the restaurant business. People are stupid to how it works even if u tell them. Shit, I guess it's like that everywhere honestly",
            "Why is it so expensive?\n\n“*Ma’am, you said you knew what you wanted, so I did exactly that.*”",
            "I mean you prob weren't going to get a tip anyway lol.",
            "Too bad she didn't want to admit that you know what you are talking about. It would have saved her money.",
            "3yo niece: can I have some nachos?\nHusband: sure\n3: but without the beans?\nH: sure.\n3: and without the cheese?\nH: do you want a bowl of chips?\n3: (delighted) uh huh!",
            "I’m surprised to the point of suspicion that a manager would go against a customer when she only got a dollars worth of food.",
            "Ah I love these customers even though they are making me mad beyond belief I know I get the last smile lmao. I'm glad the manager didn't fix it for her that's what she gets for being bull headed.",
            "\"You! Underling! How DARE you try to save me money when I KNOW what I want and won't listen to reason! See if I ever listen to YOU again, stupid person!\"\n\nSome people just HAVE to learn the hard way, don't they now?",
            "My wife and I have to do this all the time because between us, we're allergic or intolerant to red meats, gluten, milk, several fruits, peanuts, and shrimp. The list of things we CAN eat from most restaurants is small. What we've learned, which I'd think should be obvious, is that people are way more likely to acquiesce our unusual requests if we're kind and patient and show that we understand it's asking the cooks to change up how they do thing. We've found that people are usually willing to take stuff off and may even take it as a fun challenge to modify the order to our needs if we're understanding about it. Being condescing is never the route here.",
            "\"Here you go Pearl, *two* ***Sah-lads!***\"",
            "This reminds me of a time I went to a Mexican restaurant with my brother and he ordered a chimichanga. He normally doesn't like fried food so I asked if he knew it was fried. He asked the waitress if he could get it without having fried. She gave him a weird look but said they could do it. Later he complained the tortilla was uncooked and I'm trying not to face palm reminding him he ordered it that way.",
            ">I did not however get a tip.\n\nThere was little likelihood that you were ever going to get a tip. Condescending fusspots with all sorts of dubious food aversions are not entirely rooted in reality.",
            "Were i your manager, i would have given you the difference between the items as your tip.",
            "Reminds me of this:\n\n[https://www.reddit.com/r/KitchenConfidential/comments/ug6jdk/eggless\\_omelette/](https://www.reddit.com/r/KitchenConfidential/comments/ug6jdk/eggless_omelette/)",
            "This mildly reminds me of the scene in Wild and Wonderful Whites of West Virginia and they’re in a Taco Bell drive through and she yells into the microphone “Do y’all have mozzarella cheese sticks?”",
            ">I did not however get a tip.\n\nBut you did get a good story to share.",
            "Obviously not something you can really affect but damn I wish places would reduce the price a little if you take off a bunch of stuff sometimes. I get why it's hard/easy to abuse/not as profitable or any number of reasons it isn't done, but it'd nice if it was like, say, $6 after she took off everything",
            "I want to buy your manager a beer",
            "I can't remember the movie, but there was a scene where a guy wants to order toast and coffee, just toast and coffee. The waitress insists that all they server are breakfast platters, eggs, hashbrowns and toast. So, he orders the platters then tells her to hold the eggs and hashbrowns.",
            "If there was any justice you would've gotten $19.50 out of what she paid for them",
            "LOL -- I knew a girl that ordered a cheese enchilada, without cheese.  She got a shell with onions in it and covered in enchilada sauce.  Decided she wanted cheese in it after all.",
            "[Eggless Omelette vs Cheese-Free Quesadilla](https://youtu.be/9Ah4tW-k8Ao)",
            "The idiot tax lol",
            "Ya kinda did get a tip it just wasn’t monetary!! Priceless story!!",
            "Similar: online system has option for allergies order was for queso and chips (dairy allergy)  they didn't answer when called made it as is no dairy alternative for cheese",
            "That’s a good manager",
            "Like the stern show call where they call the pizza place and order a supreme pie but hold the sausage, hold the pepperoni, hold the onions, hold the sauce. “So you want a plain pie?”. Yes….. but hold the sauce and hold the cheese and hold the…-pizza guy ”fuck you”!",
            "I want a pepperoni pizza with NO pepperonis",
            "Is no-one picking up on the \"Vegan free\" part of the order? I thought that was one of the best parts.\n\nI think we need some more vegan-free options.",
            "See, that's when you change her bill to the lettuce wraps, and pocket the extra $20 for your tip",
            "Manager’s like “We gettin’ payed today, boy”",
            "*do you have anything less MEX and more TEX??*",
            "&#x200B;\n\nI think that the manager should have given you the difference between the cost of 2 cheese and tomato wraps and the price of the quesadillas as your tip. Only fair.",
            "My brother worked at a local restaurant that was a bit upscale. Naturally there were occasionally some unreasonable requests. The most memorable one by far was that a woman asked for a vegetarian scramble...with no egg. So naturally when she was brought a plate considering entirely of steamed veggies, that being precisely what she'd ordered, she was pissed and said the food looked \"gross\". My brother, being stoic and nonconfrontational, just walked away and let her rant to the bartender, who was the one that took her order originally. Not sure what ended up happening because it wasn't my brother's problem.\n\nIt's just ridiculous though how people are so insistent on things being done \"their way\". You'd think they'd eventually learn that they don't know everything, and sometimes other people know better than them. But I think some people are genuinely incapable of seeing fault in their own actions, and will just endlessly blame everyone else.",
            "Smh she could’ve made one with fresh ingredients for 1/4 of the price",
            "Has anyone here ever left a competitor's coupon with the check?",
            "No tip? Once she left, you should have corrected her bill to be two lettuce wraps instead and charged her the $4.50 with $19.50 tip.",
            "I understand her frustration it is kind of ridiculous they want to charge full price. Like you said she could of got a cheaper item. Or build you own menu. I  been to places that charge for everything, i rather make it at home.",
            "I find this easy to fap to.",
            "The amount of interactions I had like this while working in food is amazing. The stupidity of some people knows no bounds",
            "If I was the manager I would have tried to retroactively change the order so that it was $4.50 and then given you the $20 as a tip. Or just give you the $20 without trying to change anything about the order.",
            "I’m sorry, “vegan free?”",
            "I know someone who works for a fast food joint and he took an order from someone who wanted a cheeseburger, NO CHEESE PLEASE! Like, wtf?! He asked, so you want a hamburger? \"No I want a cheeseburger, but no cheese\". Same stuff on both, except the cheese. They were charged for the price of a cheeseburger, which was slightly more instead of paying for just a hamburger! What a maroon! Yes, I know what I said. *See bugs bunny.",
            "The satisfaction is worth more than any $5 tip!",
            "You’re posting this on the same day as posting about psychologically torturing your disabled neighbour until he was evicted?",
            "Vegan free means just animals and their secretions",
            "Quesadilla without cheese, most be a chilanga",
            "Stupid useless idiotic waste of O2. FFS!",
            ">I did not however get a tip.\n\nTo be fair, you probably wouldn't have anyway.  Karens never tip.",
            "lol, it's at times like that, when you wish you could have just voided the sale after she left, then re-rang the items for the price of the lettuce warp as suggested and then just kept the difference as the tip...",
            "\"I want a quesadilla without the tortilla, no queso, no lettuce or tomato or anything that goes in it. Make sure to use a gluten free tortilla that I don't want. No, I don't want the wrap for <$3, I want to pay $24! If you are too stupid to make it the way I want it, and charge me eight times more for it, I will go to corporate and have you fired! You're not going to tell me how to screw myself over!\"",
            "It’s situations like this that are the perfect justification for automatically charging gratuity.",
            "[deleted]",
            "Congratulations, Nickelback. This is now my least favorite order of a quesadilla.",
            "Did OP call a tortilla ‘bread’?",
            "I hope that Entitled BITCH got herself BANNED!  No one needs her business!!!!",
            "If that’s all you’re gonna eat why even bother to go out? I’ll never understand why people with severe food allergies go to restaurants where they have the allergy. Italian if you have celiac disease. Shellfish allergy if you go to Joes Crab Shack.",
            "My biggest issue: On what planet does a quesadilla come with lettuce?? And, being \"nice and warming it up for her\"....... Ummm a quesadilla is literally cooked on a grill or some other device, otherwise it's just a flat wrap..... Not to mention, if there's no cheese..... Hence the quesa, in the dilla, it's not a quesadilla.... But like legit, if you've removed the heat, and removed the cheese, you by definition no longer have a quesadilla. But back to bigger issue, if I didn't sub out everything like this customer, 2 tortilla wraps, with cheese and tomato in the middle, slapped on the grill and browned up, is gonna make that lettuce beyond disgusting!!! Who eats hot lettuce? 😆",
            "Meanwhile you could of been the bigger person and just rung her up for the lettuce and tomato wraps and got a tip. Instead your pettiness resulted in your tip going to the restaurant.",
            "I get that she had it coming but I don’t understand why you’d explain it at all. When I had people order stupidly I just put it in the system in a way that made the most sense without saying anything.",
            "Maybe it’s just me but wouldn’t it cost more if the cook has to go out of their way to make substitutions?",
            "I’m sure I’ll get roasted for this, but what she ordered does not have to be verbatim what you put into your POS. Some other server probably taught her to order that way and that’s the only way she knows now. 🤷‍♀️ She’s not standing over your shoulder watching you ring it up, she just wants the correct food.",
            "It sucks when you have a Karen.  They will never be happy and they will stiff your tip.  Another Leftist with bad attitude.",
            "Yea OP, that lady is dense. But you also showed us how dense you are and how bad you are at your job. you couldn’t put it in the system the proper way to make it cheaper because you like to engage in stupid pedantic arguments.\n\nLol how to be bad at your job & dealing with the public 101"
        ]
    },
    {
        "post_id": "arwmln",
        "author": "et-regina",
        "title": "Can't sit down without a doctors note? Okay then!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/arwmln/cant_sit_down_without_a_doctors_note_okay_then/",
        "score": 16423,
        "num_comments": 443,
        "created_utc": 1550491844.0,
        "selftext": "So since some 11k people liked my last story of malicious compliance at work, have another!\n\nAt the time I worked in a cafe set over 3 floors, so my day generally consisted of 10 hours running up and down stairs.\n\nI had slipped on some spilt motor oil in the car park on my way home and my ankle had bent underneath me; I had initially assumed I'd just twisted it, but several hours later it was still throbbing, as well as swelling up so much that it looked like I was hiding a pair of golf balls under my sock and turning a deep shade of purple. As my next shift started in less than 12 hours and we were short staffed as it is, I didn't want to call in sick, but I knew there was no way I'd be able to stand/walk on it for a whole day. I called my manager to explain and to ask if I could a) switch to the register for a few days, which involved much less walking than my regular role, and b) borrow one of the bar stools to sit on behind the counter so I wasn't putting too much weight on it.\n\nI figured this wouldn't be a problem as we had other staff who could cover the floor and there's no issues with access around the register that the chair could get in the way of: I was wrong. Manager insisted that he wouldn't sign off on me having a chair without a signed doctors note verifying my injury, even after I sent him photos of my wrecked ankle.\n\nAs my GP was already closed, I headed to the 24 hour walk in clinic. An x-ray and a lot of poking and prodding later, the doctor told me I had to ice it every few hours until the swelling went down (which took almost a week) and keep all weight off it for at least a week, and wear a brace for another 2 weeks after that. When I explained what I did for a living, the doctor presented me with a lovely note explaining that I shouldn't be at work at all for at least 7 days.\n\nI wish I could have seen my managers face when I called to explain that I didn't need the chair after all as actually I wouldn't be in work for the rest of the week and most of next week, doctors orders. Funnily enough I was never asked to produce a doctors note again for the rest of the time I worked there.\n\nEDIT: not to be *that* person but this is my first time getting gold so thanks guys! You'll be pleased to hear that several years later my ankle heeled with zero longterm affects and I'm now in management myself, hopefully treating staff a lot better than I was treated. Also as SO MANY of you have pointed out, please go to the doctor if you injure yourself regardless of whether or not a dickhead manager demands it or not.\n",
        "permalink": "/r/MaliciousCompliance/comments/arwmln/cant_sit_down_without_a_doctors_note_okay_then/",
        "comments": [
            "At my last job, they paid for a “career coach” to come and give a presentation to “motivate” the team.\n\nWe were all being overworked and putting in 60+ hours a week, no breaks.\n\nOur career coach explained that you should NEVER kill yourself for a job where you are an employee. Even if you are an owner, you should think twice.  Take care of yourself, you can always find another job, but there is only one you, and you need to be there for yourself and your family.\n\nIt seems so stupid that someone had to sit there and drill that into us for 3 hours but I had never really thought about it that way and just cared that I was making really really good money.\n\nI was also the first to leave.\n\nTake care of yourself OP!",
            "Was the car park at your place of employment?  I don't know what it's like in your country but in mine that could easily be a workman's compensation claim. That would cover the lost wages. \n\nAlso I second the notion that you should always seek medical attention when injured. If you died tomorrow, the company would replace you in short order. You always come first.",
            "I appreciate the MC but talking as someone who is old and creaky you should always seek medical advice on injuries like this and not wait until your manager forces it on you.\n\nIf you had struggled on regardless you could have put your long term health at risk all for a cafe job.\n\nOld injuries I ignored and struggled on through are now coming back to haunt me. Fuck you knees. Yes, both of you, even the \"good\" one.",
            "Gave them just what they wanted, but not what they anticipated. Love it!",
            "Honestly this kind of senseless power play by the manager annoys the fuck out of me. Why does it matter if you sit in a chair? Who would be hurt by this? ",
            "Honestly, bosses are so fucking stupid. I sprained my pinky toe once, and I asked if I could sit on a stool for the day. I didn't think it would be a problem, because I worked at the school bookstore, and the students weren't back yet. She said no because it's \"unprofessional.\" Literally no one was going to come in that day. So I fake coughed, said, \"Oh no, I'm sick,\" and walked out. She had to cover the empty store all day, unable to leave the register, while I went home. I quit like 2 weeks later too.\n\nI don't get why bosses pull this shit, honestly. ",
            "I had one like this one time. I was sick with a stomach bug and was puking and shitting everywhere so I asked my boss's for the day off so I could sleep the worst of it off and is be right as rain the next day. Of course she was on a power trip and said if I didn't have a doctor's not i was fired. So I went to the doctor and he gave me a note for 4 days off. I marched back through the doors of my job and told them I'd be back after the weekend. My manager looked like she was going to explode because we were short handed and this meant she was working 4 doubles in a row. Fuck that bitch too she was one of the worst bosses ever I could write a short story of all the dumb shit she did",
            "I hope you also thanked your manager for insisting on the doctor's note, since otherwise you would have unwisely done your job on your bad ankle. Heh heh.",
            "I have bad circulation and in my old job as stock boy at a supermarket (they had a better name for it, but that was what I was doing)  I had to fill the freezers as one of my duties. I mentioned to my manager that me and a colleague had agreed to swap as the cold was really starting to hurt my hands and making them visibly swell up. Manager said nope. That's your job you do it, then went home. My colleague told me to do my other duties and he would do it, manager found out by looking through the CCTV and hauled me into the office and gave me a bollocking. He told me that I would need a doctors note to not have to do it again. Fine I said, went to the doctors, doc took a good look at my hands and agreed that the cold was doing the damage. Signed me off for two weeks and put that his strong recommendation was that I was either supplied with decent gloves or excused from cold work. \n\nWe had a major audit the next week which I was instrumental in  organising, I took great pleasure in coming in the day before and handing in my doctors note. \n\n&#x200B;\n\nOn the day I was due to come back I gave them another two week note. \n\n&#x200B;\n\nAnd my notice. \n\n&#x200B;",
            "I think doctors are getting wise to this kind of crap. Often providing advice that goes well beyond what’s absolutely necessary and heading into the territory of overly cautious. Not that it’s a bad thing. They’re helping people stand up to bosses like this. Good on your doctor for giving you a documented excuse to tell your boss to shove it. ",
            "I fucking hate people that think they know better than someone else about that persons own body! (unless their a doctor I guess) ",
            "I will never understand why it is such a problem for management to allow someone at a register to be sitting. **The customers don't care!!**",
            "Manager - \"Give me a doctor's note or you'll be written up for sitting down\"\n\nOP: - *Hands in doctor's note*\n\nManager: - \"I'll just stay quiet next time...\"",
            "I have Bursitis (immune problem meaning the fluid sacs around my joints become inflamed) and often can't weight-bear. Many years ago, before I was diagnosed, I was a waitress in a tapas restaurant that also had a general bar area.\n\nOne week I was having a particularly bad flare-up and was limping around. I asked my manager if I could be behind the bar - not even sitting - so as not to carry the very heavy tapas trays (you know, the reeeeally huge ones that carry multiple dishes). They let me for 30 mins then made me go back on the floor.\n\nI hobbled home in tears. Went to a recruitment agency that same day. Got a new job (receptionist/admin for a construction company) before my next shift, went to the pub for a pint and quit my job over the phone. Hahaha. This temp role was actually my first proper office job after uni, and started my career in Construction and Engineering which I am still doing today. ",
            "Excellent",
            "As a people manager, I was told to not ask for doctor's notes, or to even accept them if offered. I do not need to know why an employee is absent or late, only that if it becomes a pattern to keep detailed records of when and how often, and of any conversations pertaining to it.",
            "I work in grocery, and well, I caught the flu. The REAL flu. Of course my boss said no way on taking a couple days off to get better without a doctors note. Well, instead of the three days I was thinking…the doctor insisted I should get at least a week and a half because I tested positive for the super contagious flu. Boy that was a nice little vacation, even though the first few days sucked! Netflix and rightfully prescribed sizzurp helped! ",
            "The next time I am asked for a doctor’s note. I’m planning on walking in and throwing up on the floor in front of our customers",
            "[deleted]",
            "I had a broken foot in a boot last year and got permission from my doctor to work 6 hour serving shifts. I told my boss this and she scheduled me 2 6 hour shifts in a row. Totally messed up my foot doing that",
            "I've posted this in a thread before, but I've had my own MC like this. \n\nAfter having back surgery for a herniated disc and cleared to go back to work, I was instructed to get up and walk around a few times an hour. So, I'd get up once an hour or so and take a couple slow laps around the break room. A few days later, an email goes around saying that \"excessive breaks\" need to stop (clearly directed at me but of course didn't mention my name). I went to the doctors office and explained the situation. The doctor gave me a huge grin and, knowing the shitty company I worked for, wrote me a note saying I had to get up and walk every 15 minutes for 5 minutes each time. So I went from wasting 20ish minutes a day, to wasting over 2.5 hours a day. ",
            "I assume you don't live in the U.S., then?  Here we'd be out a couple hundred bucks for the exam/x-ray, then probably fired.",
            "Your boss was an asshole, but I am kind of glad his assholery led you to getting proper medical care for that ankle. o.o ",
            "Excuse me while I just go curl up in a ball in the corner from the memories of years and years of my life spent ~~being treated like an animal~~ working in retail.  ",
            "Got them good",
            "I bet he expected you to be bullshit and now hes down a person for over a week lmaoooo sucks to suck boss man ",
            "I've seen *so* many stories like this one here, they're always great. I'm surprised managers haven't caught on to this happening. ",
            "I used to run a front end in retail. I had two pregnant women as cashiers a few years ago and gave them chairs because I am not an asshole. You'd have thought I set up a bed let them nap in it with the way my manager reacted. She wanted to make them deal with it because SHE never sat down, dammit. I told her to stuff it and advised my cashiers to get doctors notes to protect themselves (they eventually did and it helped in future dramas with said manager). There was a week period of manager hiding the stools and us having to take time out to find them until finally the store manager came back and sided with me.\n\nShe spent the rest of her time as my manager trying to power play me and losing every time. She eventually got demoted, but I left the front end before that. Without giving away too much personal information, Karma has caught up with her. ",
            "Back in the day, I had just finished 18 months of brutal physical therapy to reconnect all the soft tissue in my leg. (Double faciotomy, mcl, pcl, acl, and tibial plateau fracture).\n\nI got a job at a book distribution warehouse wink wink, as an ADA hire. I was told I'd spend most days binding books, sitting down.\n\nA week in, the boss is strong arming me into picking. Running around putting not books in boxes. I came in the text day with my work release that stated \"very limited walking, very limited standing, no lifting over 5lbs. \n\nBoss tried to convince me that picking orders was part limited standing, and limited walking, and since everything individually was less than 5 lbs it was okay. \n\nI broke my work release by walking out of there, that day. \n\nThe real kicker? I had to get out of my wheel chair to quit because I couldn't get to his office in it.",
            "Similar thing happened to me when I broke my hand. I asked to work the register but instead they wanted me in the kitchen.  I got a doctors note excusing me from work for two weeks. I used that time off to find a new job.",
            "I just love that your ankle “heeled.” \n\nThat EDIT made me happy.",
            "[deleted]",
            "What even makes it better is if you could prove that you were the only person requested to produce a doctor's note for an injury. Its either everyone or no one. ",
            "I feel your pain, I used to twist my ankle abput once a year and it would swell up as big as a grape fruit and turn damn near every color of the rainbow. ",
            "It's sad that this is even malicious compliance. This should be the standard way injures/other health problems are handled. ",
            "My manager directly ignored a doctors note out of spite and passive aggression, even after a noticeable drop in my work quality due to excruciating nerve pain and sleep deprivation. The note was to allow for a partial remote work schedule until I could get my injury and nerve pain under control. Still never called out sick throughout the entire ordeal, and I even stayed hours past when I was supposed to so I could make sure everything still got done that needed to in a certain timeframe. No explanation why there was such a delay in the process, or why my needs were nowhere near met based on the doctor’s note. \n\nLets fast forward 8 months when I have my manager’s inbox (after he left the company) with all of the correspondence between various colleagues and teammates describing  “serious reservations” about allowing the WFH schedule. I had assumed I was just being irrational and overthinking the entire situation. Imagine my rage when every fear and suspicion I had about the situation was true...",
            "To be honest a good manager, after seeing the photo of your mangled ankle, should have insisted you see a doctor right away. Not worrying about whether they'd get in trouble if they let you use a stool during a shift.",
            "Op, you're ankle HEELED lmao",
            "Managers can be so stupid. You said you sent him pictures of your ankle and he was still like \"Nope, doctor's note!\" Like it's a one day accommodation, not a permanent change. I came in the day after getting my wisdom teeth out and I asked if I could have a stool to sit down on between customers. Manager went and got me one within 5 minutes. Augh. Ugh. Fucking people. ",
            "Perhaps your manager is still a jerk but I would have told you the same thing.  As a manager in a very by-the-book company in America, we are expected to get a doctor's note for every accommodation (must sit, can only lift so much, etc) which also includes the duration.  This protects both the company and the individual.  The company can't be said to be showing favoritism by allowing accommodations for one person but not another, and doesn't have a bogus issue milked by a lying employee (normally).  The individual makes sure they are following the most appropriate treatment to heal as fast as possible and may be able to work a different position temporarily to still earn full pay and not burn time off.  The size of business may play a part here (mine's on the bigger side), but I think it would be a smart policy for a smaller business to follow as well.",
            "Love stories like this, Most Managers don’t trust their employees. It’s great when karma helps the workers out.",
            "Someone who is like that didn’t care about you missing a week and just made the others work harder.",
            "I just love how this seems to always blow up in manager's faces, they assume the worker is being lazy and ask for doctor's note and instead the doctors forbid you to return to work in that state, proving you were actually doing them a favor by offering to work when clearly not able to. Sweet sweet karma. ",
            "Not sure if your boss was really power tripping. I have dealt with two hourly employees who had non-work related injuries. Somehow the injuries got aggravated at work and they morphed into workers comp claims. Even though I'm not a manager anymore, I definitely understand making sure your employee is fit to work before your swollen ankle becomes his workers comp claim.",
            "This is one thing that bugs me about retail and other cashier jobs... why in hell do the employees have to STAND all the time? There's no reason why someone should have to stand for 8 hours to ring up groceries. Why don't they have chairs?",
            "Bruh, you were seriously going to go to work like that? Get your priorities straight ",
            "I think some other people have already pointed this out, but I don’t see a problem with requesting a doctors note ( it sounds like they didn’t do it politely or with sincerity which IS a problem). It also looks like OP is in a mgmt position now and probably understands the sentiment I’m about to present. \n\nI used to be a supervisor for a factory line that did not require very much skill to get into, especially on off shifts. And we had people abuse this all the time. They would ask for time off because a doctor said they couldn’t walk or needed to have a break every 30 min making it “not worth our money” to pay them. Then post pictures at bars or parties (don’t ever become friends with your boss on social media unless you really trust them or are honest and have nothing to hide :)\n\nI’m glad you got the care you need, but I think mgmt was also justified in wanting a medical opinion. Not all people are as honest as OP. ",
            "Meanwhile, I broke my fibula and 3 days later they had me coming in on sitting duty only. But nonetheless, at work... In a warehouse.\n\nThen I slipped on some snow on the way into work (using crutches and a boot brace), again, 1 day later, I'm back in... Sitting. Mmmk. ",
            "I've had that exact injury and it took about a year for my ankle to feel normal again. ",
            "I Hope it was also a workman's comp claim. ",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/itoldyouiwassick] [Can't sit down without a doctors note? Okay then!](https://www.reddit.com/r/IToldYouIWasSick/comments/as0nr5/cant_sit_down_without_a_doctors_note_okay_then/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "This actually saved your employer from a workers comp claim when your ankle got worse. That's probably why the policy exists, even if your manager doesn't realize it. ",
            "Hopefully you had some savings and didn't get evicted for missing a week of work!",
            "...Actually really glad the manager was being a jerk. That ankle could have turned out real bad.",
            "I've twisted my ankle really badly before and I am so familiar with the exact scenario you're describing.\n\n&#x200B;\n\nDid your whole foot look like the makeup in one of those zombie movies for like three weeks? Mine was purple and green and yellow all over. ",
            "So many shitty managers in the world...",
            "I have an awesome doctor.. any time in any job I ever got a \"you will get a medical certificate!\" manager, he'd happily give me a week off for a cold that I'd only been planning to take a day to recover from. Cuts down on the requests real quick.\n\nSeriously though, don't ignore injuries.. get them checked out. Even if 99% of the time it's \"you're fine don't worry\" it's worth it for that one time you need attention ASAP.",
            "OP, as I sit here atm with a 24/7 drip in my arm... going to the Dr's is not always bad.",
            "The manager asking for the note may not have been a malicious or exploitative attempt to have OP work with that injury. It may have simply been a way to mitigate risk. Having an injured employee continue to work can be problematic for a business. Even if they did not injure themselves at the work place, working may lead to complications which could be problematic for the business. If, on the other hand, a doctor says the injury is not severe and the employee can continue to work within certain specific criteria, the business risk will be reduced as long as the criteria are met. \n\nIf I were a manager I'd ask for a note too. That has the added benefit of forcing a potentially too altruistic employee to go see a doctor even if they \"feel they don't need to\", thus getting the treatment they probably need.",
            "\"My ankle heeled\"\n\n&#x200B;\n\nAhem... don't think I didn't see that. ",
            ">\"...my ankle heeled...\"\n\nGood pun XD",
            "If you can prove that the chair doesn’t meet the requirements for workplace safety or that it is not a good faith/reasonable attempt to accommodate you, you should have a leg to stand on, so to speak. ",
            ">ankle heeled\n\nI thought your heel ankled.",
            "This post really shouldn't be here TBH.  This wasn't something you planned to be malicious.  If anything, it's a good thing your employer had that policy and didn't violate it; it forced you to go to the doctor instead of soldiering on and doing yourself damage.",
            "Good ol malicious compliance where you also hurt yourself by not getting paid. ",
            "Idk if this is a win for OP...you not going to work for more than a week without pay or benefits....it’s not like you were a salaried employee ",
            "This isn't MC. This is exactly why your manager asked for a doctor's note. \n\nIf you're too injured to do your job, *you shouldn't be at your job*.  Your manager isn't a doctor and if they let you come to work after you told them you're to hurt to work, they're exposing the business to liability and putting your well-being on the line. \n\nAlso, managers can't just move you to another job because you're hurt. Yeah, you might be really hurt, but if they're pretty much just going off of your word on how you feel and what they believe, then they have to do the same for the next person who says they're hurt. If they don't, they're exposing the business to liability. \n\nThe manager 100% did the right thing by you and by the company. "
        ]
    },
    {
        "post_id": "krfymz",
        "author": "tbo55",
        "title": "Long calls = better bonus? Hold my beer.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/krfymz/long_calls_better_bonus_hold_my_beer/",
        "score": 16418,
        "num_comments": 375,
        "created_utc": 1609906173.0,
        "selftext": "TLDR: >!Call centre removes limits on calls in order to raise customer satisfaction. I spend a month stretching my calls to be 4 hours long and make off like a bandit in the process!<\n\nA brief story from my time in a telecoms contact centre. I worked for a rather large Australian provider that everyone knows and actively hates, mostly because its fun to hate them. In this story we were doing outbound calls to transition people onto the new NBN network. (for those of you unfamiliar with Australia's internet, it was 3rd world, literally, we were slower than Nigeria until we rolled out the NBN and upgraded to slightly faster 3rd world speeds...) Also worth mentioning, much like the company I worked for, the NBN was universally hated. Cause it was shit. Nuff said.\n\nAnyway like all call centres we had a bunch of miserable hoops to jump through in order to bring our paycheck up to a level that could be considered humane. Our capitalist overlords refer to these hoops as KPI's. (Key Performance Indicators for the blissfully ignorant)\n\nAnyway with the new campaign came a new set of KPI's. Conversion rate, active call time, after call time and customer satisfaction were the KPI's of the day.\n\nNow these KPI's were normally all fucking bullshit. You needed to meet some fucking god teir numbers in order to collect a half decent paycheck. However in this particular case there was loophole. See due to the controversial nature of the NBN we were told to focus on quality over quantity. They wanted \"An excellent customer experience\" and the new KPI's were a reflection of that. As such quantity of conversions was not a KPI and when I questioned if we had time limits on calls I was told \"We don't care what you do but long calls means a good experience so keep them on the line and get them switched over\"\n\nAnd so began the best work month I had at that soul trap. See before entering coms I was a salesman in aged care, and a pretty good one at that. And you know that stereo type of old people talking for eternity and beyond? Its a stereotype for a reason. Each morning I would log in, volunteer for the aged clientele campaign (which was easy because they were normally the hardest people to convert, fearful of scams, technology and such, so not many people wanted to do it) And then I would start to chat.\n\nSee when speaking with the elderly all it takes is a well placed poke or 2 and you can literally have them speak for hours. So for the next month, I took 2 - 4 calls a day (down from 20-30), had almost zero after call time (the calls were so long i didn't need it), had an 80% conversion rate and 90% customer satisfaction (turns out people tend to like you after you take the time to listen to them). Each phone call (assuming I wasn't told to fuck off upon introducing myself) would last 2 to 3 hours minimum, with my record being a 7 hour call to a lovely bloke named Stan. (he told some great war stories)\n\nI ended up doubling my normal paycheck. And my managers, while not being entirely happy with my nonsense, put up with it because at the end of the day... those were the rules and KPI's we were given. I got my paycheck, the oldies got a good chat and my employer got to pay through the nose. Happy endings for all.\n\nI proceeded to hand in my resignation once KPI's went back to normal. Which I, to this day, regard as one of the best decisions I ever made.\n\nEdit: Obligatory edit to thank yall for the awards. Much Love <3\n\nEdit: Obligatory edit number 2, so yall have showered me in more awards than I have received in my entire time on Reddit. Which honestly isn't saying much given I haven't been here too long, but hey, its the thought that counts. Big preesh all yall. ",
        "permalink": "/r/MaliciousCompliance/comments/krfymz/long_calls_better_bonus_hold_my_beer/",
        "comments": [
            "95% of Metrics in call centers are bullshit, so turning it around on the company while making the customer very happy is a job very well done.",
            "Haha, brilliant. You got to make some elderly people happy, too!",
            "Fucking Telstra. Or Optus. \n\nI worked in training for a long time and those two companies were ones we used as examples of how not to do customer service.\n\nGood on you, and fuck those companies with a rusty corkscrew.",
            "Not only was the story awesome,  (A+, updoot, and all the gold!)  \nbut you have one of the best uses of TL;DR!\n\nUp front, but hidden.  \nAnd you *actually* summarized your post!  Not just \"Boss changed rules, so I complied maliciously.\"\n\nYou are the hero reddit doesn't deserve!",
            "That is awesome",
            "You, I like you.\n\nI also have worked in a call center for a power tool manufacturer, and never hit my # of calls KPI because I would actually try to find the answer to the question instead of immediately passing the call to Tech Support.  After 4 years, I was the go-to after Tech went home because I actually learned the products.",
            "As an Australian all I can get from this is Fuck Telstra .",
            "I'm guessing you worked for T.  We are fibre to the node, and copper to the house.  We still only get DSL speeds.",
            "I had a similar experience when canvassing (a shit job I did while studying to pay bills) for a NOW well known 'new' player in Australian groceries.  \n\n\nI somehow lucked out? and managed to get an older bloke in a retirement home.  \nWe had an active floor manager who basically said we couldn't end the conversation, we had to let the survey run its course or wait for the client to end it.  \nNeedless to say, I spent 90% of my shift (this was the 5th or so call) on the phone this one old bloke named Bill who told me some fantastic stories about his life.    \nWhen I finally got around to finishing the survey and asked him if he'd support this brand coming into the marketplace.  I still vividly remember his tone and voice answering:  \n\"No fucking way am I going to support any German \\*&\\^%s, they killed my mate in the war\" and promptly hung up!   \n\n\nNeedless to say, after that they let us terminate calls if we thought they were not being productive.",
            "Ha!! Lovely :) sometimes quiting a job is the most liberating thing...\n\nI had a teaching job for 17 years, was being fired every year and re-hired the next, to avoid permanent employment (weird legal loophole)... after 17 years of this, after securing another job I waited for them to contact me to rehire (usually the week prior to school start, they were convinced that we needed the job), told them I wasn’t available and they went through the roof hahaha telling me I needed to give them at least 3 months warning, I calmely told them they had fired me so I was under no obligation to do so... felt liberating....",
            "I worked for a Tier 2 ISP in the same country, owned by a Tier 1 ISP.\n\nDue to a quirk in reporting I clued in that call length timers started when the call dropped in to my extension and stopped when the customer hung up, however... if I didn't also hang up, new calls wouldn't drop into me. You could put yourself in wrap up mode if you needed more time.\n\nThere were KPIs on call length time and call wrap up time.\n\nCall wrap up time was time spent doing the leg/fingerwork after a call and the KPI was 2 minutes, stretch was 90 seconds.\n\nTo my knowledge, no one hit the 90 second stretch goal and as such was responsible for a huge bonus...\n\nWell now.. I had unlimited wrap up time now and made sure to kill the wrap up time at about 70-90 seconds.\n\nTeam leader could never figure it out. Was worth another $250pcm (Circa 2000) to me.\n\nThere were other games we played as well.. KPIs often get gamed. \n\nLike selling mobile contracts, getting the signup bonus, and then allowing the customer to cancel without penalty two days later in the cooling off period.",
            "I used to work for their inbound call centre as support for the dialup campaign (might be showing my age here)\n\n\nCongratulations on fucking with the system. After almost 3 years at that hellhole with it's ridiculous KPIs and monitoring systems, it's nice to see someone take advantage of it.\n\n\nI desperately hated the phone system that knew your every move\n\n\nFor those not in the loop, you had to select the \"mode\", and the duration of time you were in that mode was _*strictly*_ monitored.\n\n\n3.2 minutes average of after-call work? No bonus.\n\n\\>10 minutes a _day_ in the toilet? Same.\n\n\\>20 minutes non-lunch break? You guessed it.\n\nOh, you cut your lunch short to have more break later? NOPE.\n\nI see you entered meeting mode for 13 minutes, but the meeting minutes show it only went for 9. No, I don't care that you were  busting for the loop when the meeting closed, that's effectively theft of time, no bonus.\n\n\nLet's be clear here too, the \"bonus\" was not a bonus at all, you _NEEDED_ that monthly bonus if you wanted to eat, or be able to fill the car to get to work without borrowing money.\n\nI think I started at just under $22K AUD/yr  and the \"bonuses\" brought that up to  around $25k. Subtract ~$2500 in tax.\nThis was a full-time wage.\n\nI was living with my parents at the time paying $100/wk rent - better than the $280 renting a property the same 50km from work would have been - which left me with just shy of $300 per week. $100 to keep my shit heap car fueled, $50 (AVG) to keep it running, leaving $150 for food, clothing, mobile phone, and trying to keep myself afloat in a TAFE course.\n\n\n\"After-call work\" was a special mode that your phone dropped into automatically following each call, with which you had to take notes from the call on. The notes had to be accurate as well, in case QA reviewed your call. Anything missed was a knife hanging over your head.\n\n\nProblems with THEIR OWN systems commonly drew this out, and unless you were lucky enough to be able to show the system being non-responsive to your team lead, you were shit out of luck for excuses.\nMeanwhile, your team lead is nowhere to be found until 6 seconds after the thing finally starts responding again.\n\n\nMan ... PTSD from that place.\nI ended up quitting moments after telling an angry customer to practice auto-fellatio.\n\n\nA friend of mine in QA received that call recording later that day and was apparently laughing his ass off over my 5+ minute tirade against the customer.",
            "In 14+ years of being with Telstra the only positive experience I had was a very helpful lady in complaints after I complained to the TIO. Fuck Telstra (except that lady)",
            "Aussies do love a good old fashioned Telstra hate wagon.",
            "Ah Telstra. I will sing my utter contempt of them till the end of my days.",
            "I worked for a telecomm in the States providing technical support for internet service. After four years working there I was fired because my average handle time (ie THE KPI for that call center) was 31 seconds too high.  I lost a pretty well-paying job for me at the time. Despite losing about 40% of my pay and my standard of living dropping quite a bit just before I got married it's still one of the better outcomes I have experienced in my career.  I have said many times I would beg on the street before I would work at a call center again.",
            "I’m currently having internet issues with Telstra while reading this. The irony is not lost on me.",
            "Wait, this is either Optus or Telstra, and I remember calling Optus tech support at some point last year and had a FANTASTIC call, lasted like an hour and a half, just bullshitting about stuff like voice imitations, uni and all kinds of completely off topic things. It was a fantastic call and made my week if not month it was that good.",
            "WELL DONE, YOU!\n\nI don't always get satisfaction when talking to Hellstra tech support (I'm polite and patient 99% of the time, and even when I'm justifiably cranky, I always say \"I'm cranky about this, but I'm not cranky with you\"), but when I do, I always \"take the survey\" or whatever's being asked. I know that a positive score makes all the difference for the poor folk on the front line.\n\nHOWEVER - if \"Mike\" has such an accent that I can't understand him, and need to ask him to repeat everything, I just can't mark that as a positive experience.",
            "The fact you remember Stan says you made one hell of a personal connection. Probably made the whole week of a few elderly folks. I tell my staff to take the time to listen, especially with the eldery. We'll get 95% of our callers wanting to rush through and be done in 4-5min. Take the extra few with folks that might need it. It can make all the difference for that person, and you may be the only one they'vr talked to in a while.",
            "Oh Stan",
            "Lmao this was hilarious and made me smile",
            "May you never dream of Siebel 🙏🏻",
            "That’s kinda wholesome haha! Everyone wins!!! I hope you’re now working the job you want and earning what you rightfully deserve while making others happy!",
            "Fuck Telstra and Fuck fiber to the node!!",
            "So many senior citizens suffer for loneliness. You've done a solid by them. You're a good lad.",
            "We have a 73 year old at work, one of the founders.  He gets on a lot of the staff's nerves, as they are trying to work.\n\nMy job is basically \"solve customer issues\".   We don't get a lot.  So I have a lot of time to kill.\n\nThe old guys roll is similar.  So I tended to get his attention, and shoot shit with him for hours a day.\n\nWe are both salary, so who gives a flying left handed fuck in space.\n\nHe knew I shot straight, and I got a laugh out of the shit he did when he was my age.\n\nUnfortunately, the current crap forced him to leave the office to work from home about a week before we all got kicked out.  And we are still WFH.\n\nOverall, I prefer WFH, but I miss talking to the old guy.  And phone calls just aren't the same.",
            ">  And you know that stereo type of old people talking for eternity and beyond? \n\nOh yeah, I worked second line helpdesk for a large ISP. Also with no true time limits. Longer calls were looked into as they weren't the norm. But usually, if you had even a slightly plausible explanation for the duration it was good enough. And \"customer satisfaction\" was always a good enough reason.\n\nI've had calls last well over two hours because the elderly indeed love to talk. And most of the time they weren't so much calling to complain, as calling to have some occupation during service disruption. At one point we too were encouraged to \"connect with the customer\" to \"stop the churn\" and \"increase net promoter score\" (and other management buzzwords) and getting an elderly customer on the line was like hitting the jackpot. I just loved listen those people ramble on about their grandchildren and how proud they are they figured out internet banking.",
            "I read this in the morning before I went to work and happily thought to myself “well I’m glad I don’t have to worry about KPI’s”. I get into work and BOOM KPI’s are introduced. \n\nThis post is cursed 💀",
            "I wouldn’t be surprised if Stan still talks about you. He probably brings you up to his kids/grandkids. “Why don’t you ever call me? This nice person talked to me for 7 hours and you can’t even do 5 minutes?”",
            "Nice to hear how Telstra is xhit from someone on the inside.",
            "They call it Hellstra for a reason ;) my ex was in management, fucking souless company lol",
            "Telstra?",
            "Telstra?",
            "The problem with  nbn was it was originally designed to be excellent and bring us back to 1st world standards until Liberal government  under the onion loving Tony Abbott did as his overlord at Murdoch media (owners of Fox news, foxtel, newscorp) wanted and used a shit mix technology keeping us in medieval times.",
            "I wish that call length was not a KPI at all. Up front, it sounds like it would make hold times longer, and for a few weeks, it probably would. But if the length of the call is actually due to building customer rapport, then customer satisfaction goes up. More issues are found, and can be troubleshot properly, resulting in fewer callbacks. And customers who are willing to learn because you are allowed to have their best interest in mind will learn to resolve some of their own issues. All because one ridiculous metric is thrown out the window in favor of actually putting the customer first.",
            "Good old fucking Telstra hey 👋🏻",
            "ahh Tel$tra.  the only good thing about the NBN is it meant I could go with Aussie BB rather than those tuesdays for my HFC connection.",
            "You fucking legend. \n\nI bet the oldies loved you taking the time with them. Good on ya.\n\nOh and Telstra are hated in the UK, too. wankers.",
            "Haha I love bullshit like this. Used to work as a cashier and every few months we’d do a donation drive. Now the real reason the company did the donations drive was because it’s a huge tax write off but it has the appearance of being a caring company. All it really did was piss off customers. \n\n\nAnyways I hated asking for donations. We were supposed to ask everyone but most people would get pissed either saying “I already donated or it’s already so expensive.” \nSo I never asked.  I did everything else perfectly and customers loved me. There were customers that would wait in line to see me rather that go to my coworkers with no line. Eventually it got to the point where my bosses would talk to me everyday about not asking for donations. One day my boss stood and bagged for me just so she could force me to ask people. Well this one customer who always chose my line saw that my boss was forcing me to ask people. Right before I got to the dreaded question he put up his hand and said “I’m gonna donate to the drive your the only cashier that hasn’t asked me a hundred fucking times,” he then pulled out a couple hundred dollars and handed it to me. I smiled so fucking hard and looked at my boss who was PISSED. The next customer said something similar and gave me a $20. It ended up putting me in second place for the donation drive and my bosses stopped bugging me after that. \n\n\nThe next donation drive the new tactic was to ask for one week and then to stop and make it a silent drive. Surprise it worked just as well. The charitable people who wanted to donate every time would ask if we were still doing the donation drive and the people who didn’t want to be bugged opted to donate one big time and never be asked again. Despite being threatened with a lower raise when I first got in trouble I got my full raise at the end of the year. My bosses hated me for being right though so they denied every application I put in for promotion.",
            "It’s nice and dramatic!",
            "Damn, that is some next-level malicious compliance...",
            "Thank you for spoilering the tldr when you put it at the top.",
            "you made those elderly peoples day possibly even there week by talking to them, thank you for that",
            "Stan is the man. Awesome story",
            "Stan the mad kent.",
            "The name of the company rhymes with Helstra",
            "Ehh third-world has good Internet. It's the first world countries that are stuck with monopolies.",
            "Aw this is so sweet! You're totally right, I used to handle occasional calls, mostly from older folks and they'd end up going off on a long tangent. If I had time I would just let it happen since it makes them happy, lol. One guy spent an hour trying to convince me that Michigan state is the best state to vacation and gave me a long list of cities to visit, I actually wrote them down somewhere but I don't know where I put the note, probably my desk somewhere. You did a good thing and this is one of the happiest stories on this subreddit!",
            "As an ex call centre employee, the elderly were hands down the best customers. Had the best stories, were very grateful for everything you did for them and rarely fussy.\n\nI do love how your KPI was longer calls, ours were to answer more and have less call time but we also had QA - so they’d monitor for these ‘prompts’ in the calls.\n\nMalicious compliance - target to take X amount of calls per day, colleague starts hammering the leaderboard. Took them a while to realise that said colleague was just answering the phone and then cutting the call off straight away. Well, he did what they told him.",
            "Yeah, seen this way too many times. When a measure becomes a target, it ceases to be a good measure, it will drive bad behaviour as people try to game the system. Your managers were idiots, I hope upper management kicked their asses. Well done.",
            "Epic writing!\n\nr/talesfromcallcenters  would love your post too",
            "This belongs in r/wholesome",
            "My God when you said 'soul trap' i had a flashback to my years of telesales. I would wake up reciting my pitch night after night. 15 years later and I can still recite a couple of them. Trust me, for anyone in that industry wanting to get out, do it. You will love yourself for quitting asap.",
            "At least you had an element of KPI. I worked for a directory enquiries company in UK about 18 years ago before it got deregulated and at first our only KPI was call processing time which they wanted as low as possible. If you hit this time, you got a bigger bonus for the week which wasn't dependent on any other checks i.e. you gave the right number or any negative call monitoring.\n\nThis meant it was open to abuse and eventually got changed to include call quality and accuracy because some bell end gave every single person he spoke to the number for a McDonalds in Plymouth regardless of the number they wanted!",
            "I receive calls in customer service and man, I absolutely love old people. They will talk about nothing for so long. And since we aren’t allowed to stop them I have to sit there and listen, it’s great. I’m also kinda weird and get ASMR brain tingles from listening to people rant about their life so it’s oddly pleasing to me.",
            "I worked for the same mob in the early 00s before NBN was a twinkle in Rudd’s eye. There was so much fucking incompetence at the management level, especially around KPIs. \n\nI could tell you some horror stories about the outright criminality that caused me to quit, but more relevant to KPIs: one day I had to explain to our acting centre manager how averages worked. We were a 24/7 division, so the guys on the graveyard shift would understandably only take single-digit calls on a quiet night, where the day shift was bombarded - often with transfers and wholesalers who were in-and-out, refer to specialist. \n\nProblem was, our centre manager was holding all shifts to the same standard. Same expectations on volumes and handling time. \n\nIt took me a few minutes drawing up a hypothetical day of calls to show exactly what a 45min call can do to an average when you only have six other calls in the day, and the light of understanding fiiiiinally dawned on her face... and she must have then dusted off her ill-used imagination to figure how she would present that to the directors, because that expression of enlightenment turned to brief panic and then shit down into robotic neutrality as she muttered, “Well be that as it may, it’s still unacceptable and we’re not wearing it.”\n\nI think that’s the moment I decided the entire place was irredeemable and starting seriously thinking about quitting. \n\nNot long after that, this same fucking genius declares via ultimatum that no software troubleshooting will extend beyond a certain time. Anything longer than that would require a truck roll. Of course, this meant that people with more time-consuming solutions (often uninstalling Norton’s and upgrading WinXP service packs) were days later sent a tech who knew how to do none of it, and required to call in and start a new ticket. Management considered this win:win because tech visits didn’t come out of our department’s budget. \n\nI was vindicated to hear that a few years after I left that call centre was shut down due to incompetence.",
            "I used to dispute things with Telstra. 3 hours seemed to be their hard limit. At the 3 hour mark they transfer you to someone who just says what do you want? \"My bill is charging me $125 For late fees and it wasn't late\" and then the new person just says they'll credit me 125 bucks and says bye. (Mind you it takes 16 more calls later to get them to properly apply the credit). \nBut the first guy spent 3 hours saying no just to hit the threshold for the 'yes lady' to chime in and say ok.\n\nPlus they charge 60% more for the exact same product or service",
            "I'm not even sure this is malicious!  You pay attention to the potential customer and make them feel valued, the company gets insanely high conversion and satisfaction ratings, and you get paid for doing well because you were actually doing well.  That sounds like a win all around!",
            "In high school I worked for a telemarketing place that had similar metrics.  I discovered that you start accumulating \"talk time\" before the phone is answered.  This meant that if you got someone with no answering machine, you could just let it ring indefinitely and have really good talk time stats.  \n\nSomeone once answered the phone after a few hundred rings and it was very awkward.",
            "Fuck Telstra\n\nEdit: Tried to fuck over my dad to get broadband in by saying they had to dig up pavement and was gonna cost him $1000-$2000 as they were the only ones doing NBN where he lived. He waited and went with Optus and didnt cost him anything extra.",
            "> I worked for a rather large Australian provider that everyone knows and actively hates \n\nAhh, Telstra...",
            "Hahahah great story. Fuck the big T whom I am a customer of reluctantly",
            "Me seeing “telecoms” & “Australian” “ooo I wonder if it was T… *reads “NBN & hated”* oh it was *definitely* T…” nice work OP!",
            ">I got my paycheck, the oldies got a good chat and **my employer got to pay through the nose.**\n\nNo no no, don't even think like this! Your employer paid a normal employee a normal amount, for once, despite working hard to pay you less than anyone is worth.",
            "You were doing such a great social service OP! \n\nYou kept lonely people from going to the doctors and wasting her valuable time from other patients. \n\nPlus you made some lonely people happy... all for a subscription that only lasted a couple of years before being permanently terminated.",
            "FUCK Telstra",
            "Ah...old people.  I do phone support at a hospital and part of the job is dealing with patients and their portal access.  It's so much fun when they start in talking about their doctor and then start going into details on what's wrong with them and how their cat is sick and the kids are visiting.  Sometimes it's 15 min before I can even find out why they called.  I've had hour+ calls to do a simple password reset which are always fun.",
            "Great read. You are awesome.",
            "Fucking optus is so shit oml",
            "This is great. And you must have made all those clients' day, which is so cool.",
            "You probably really made people’s day! Good on you.",
            "You probably really made some old people’s days.",
            "Yeah my company also got KPI. A real pain in the a$$",
            "As a (very) former employee of a similarly bullshit operation,  I felt this deeply.",
            "Legend!",
            "I want to meet Stan now",
            "Love this. I had a similar situation at a call center where I needed to call alumni at my uni for donations. Sometimes I would get an answering machine and just leave a 30 minute silent message. Other times I would talk to old people for 40 minutes and never bother with the pitch.\n\nMy donation numbers weren't good but I wasn't dicking around between calls so it was a wash. Not the worst college gig for beer money.",
            "Upvote for use of KPIs - the bain of my bloody life!",
            "NBN is still crap. So's the Telco.",
            "I would've loved getting paid listening to veteran war stories 😁 - and you provided a community service to the elderly. Good on ya!",
            "Sounds like they got what their KPI's were designed for.",
            "I wish I could have talked to my grandma more but for the last couple years of her life she wasn't functioning well and  would call me by my grandfather's name. I also worked nights which didn't help but I was able to download some of the voicemails she left me.",
            "So that was you I had that lovely chat with? That was the highlight of my year!\n\nJust kidding :-) But well done. Those old folks will have loved that too.",
            "That’s so beautiful I think it brought a tear to my eye. Turning those stupid performance metrics back on the company and getting paid for your trouble? You sir, are a fucking hero.",
            "Award given. TLDR at the top. Best QoL ever\n\nYou taking about the big T.",
            "The metrics corporations use to gage how well they are sucking value out of you always suck. If they only learned to value people and pay them properly they'll want to do a good job.  Metrics aren't always a bad way to partially judge performance, but you need common sense too.",
            "Carl Baron - that fucking Telstra",
            "Telstra!!! \nAussie here.  Can confirm.  We love to hate them.",
            "You should call Stan and ask if he’d like to share his stories with the internet!",
            "I worked call center at a home shopping network of sorts... Graveyard of the given up",
            "Hold on. He could have injured someone.",
            "Maybe you can visit elderly homes? They need someone to talk to.",
            "Telstra or Floptus? Hahaha. It’s gotta be the first, right?",
            "Telstra can suck a fat one. The only way I could love this story more is if you were contracted through Concentric lmao",
            "Sister had a similar story in her very short stint in a certain ISP.",
            "upvoted for putting the tldr at the top and marking it as a spoiler",
            ">  Each morning I would log in, volunteer for the aged clientele campaign\n\nI was never lucky enough to have an option about which queues I took like that.  Consider me jelly.",
            "Hold my beer... lol, hear the a lot where I'm from. Always makes me giggle",
            "I almost took a job at TSA once.. until I did more reading. So glad I backed out of that even if it meant another few weeks without a job.",
            "tsa?",
            "Telstra really are wank stains",
            "Everytime i hear about kpi's being required to make a decent pay check i feel bad for you guys. I'm flat hourly without bonuses most of the time and i live comfortably as a front line rep, but i also do insurance, so idk if being in that industry means were paid better than the isp's in base pay.",
            "It's the sober version of, \"Hold my beer",
            "That's super sweet because the only people getting screwed... just had to pay you a decent salary for once and I'm sure the elderly had lovely days after chatting.",
            "That is very awesome.",
            "Telecom contact centre + Australia. Let me guess. Stellar?",
            "TL:DR FUCK TELSTRA",
            "As someone who worked in a call center myself I can share a lot of these feelings myself.\n\nI thought once to myself \"it isn't that bad\" but oh boy as soon as I left for another position it felt like freedom. No more pestering for meaningless things at the job. No more statistics to care about.",
            "Hahahah fuck TSA",
            "These are the best types of MC\n\nAs a former Telstra customer, F their management, and F that company.",
            "I feel you. Worked in a shitty callcenter once, walking out of there was one of my best decisions.",
            "Silver hand would be proud way to stick it to the corpo scumbags",
            "Well it’s called Hellstra for a reason.",
            "Fuck Telstra and fuck the NBN",
            "A fellow Australian bagging out the NBN? Take an upvote",
            "Hellstra has entered the chat",
            "Amazing",
            "I worked for Apple Sales and one of the important aspects of each call was the call length. The average had to be above 8:30 minutes. Before I got fired i was so burned out by shitty apple that I didn’t care to make conversation with each and every client. It burned my soul. Now I have no job. But im so glad they fired me.",
            "How is it that so many people have a problem with NBN and I'm sitting here with a 1000/40 connection and have never had a issue?! I've had NBN since it was available and never any problems. Internode and Aussie have been great.\n\nMust be fucking Telstra that's the problem.",
            "As someone who used to work for Telstra I’m glad you managed to get a little bit more out of the fucked up systems and processes they have.",
            "Dude's a fucking legend",
            "Done phonejockey work loads in my time, KPIs can be a fucking joke if your manager is militant about them, so many idiots in that industry with power complexes",
            "Lmao within the first few sentences I knew you worked for Telstra. My partner and two of my friends worked there during the nbn transfers and dear lord...just hearing about it gave me PTSD.",
            "I read this with an Australian accent. Great job OP!!",
            "Just wondering, what would be a good KPI for a job like this?",
            "Fuck arbitrary kpi bullshit",
            "Wow, I envy you. Also 20-30 call a day. Damn. I had to make around 90-100 in October and November. And was told I am chatting with customers too much.",
            "Was shit or is shit? Every time it rains our NBN cuts out 🤦‍♀️\n\nBrilliant story though!",
            "To be fair in the eyes of the old folks your company will be brilliant. So the kpi worked and they will likely be a loyal customer",
            "Worked for a credit card company here in Canada. My favourite calls were always the seniors. They were always friendly and polite and I just loved talking to them. Had the best customer satisfaction of my floor team but because my call time was horrendous and I never sold any extra BS like credit card insurance I never got any bonuses for being one of the best with customers. I didn’t mind though. I also got a lot of ‘fraud’ calls too of customers who were tricked into expensive add-ons by other employees or missing it when signing up for the credit card. \nCall centre work is tough. Always be kind to the agent you get because they could have just gotten off the worst call ever and you would never haven known",
            "Stan sounds like a great bloke. Good on you for giving the elderly a lot of your time and maximising your returns in the process.",
            "Best story I read on this sub, genius 👏",
            "Jokes aside, that really is incredible customer service. People like to be heard.",
            "As a CC rep, I applaud on your MC! But since I don't have KPI here, any calls over 15 min my boss will start listen in to see if there are any issues that we are not resolving lol....",
            "Third world internet is quite a bit better than you imagine. I have gigabit fiber for the equivalent of $20 a month. No data caps.",
            "One of my gaming buddies is in Australia, and I can confirm, his internet is shit.",
            "Please say im not the only one who read the title as long balls",
            "Nice.",
            "Take my free award",
            "Wholesome malicious compliance, those are by far the best. Who knows for how long Stan wanted to talk to someone if he kept OP for 7 hours.",
            "This sounds like TSA Group all over. Please tell me I'm right",
            "Shenanigans beget shenanigans.",
            "Guh, call center work is some of the worst shit.\n\nGlad you made it work for you! Those old folks were honestly really nice breaks if you were doing fine on your metrics.",
            "Wow, they are not strict with the AHT.",
            "Wait, there aren’t havin’ a beer?",
            "You probably really made those senior’s day, too.",
            "I knew a girl who worked at a call center. She had a guy call her who was obviously masterbating. She ended up having fun with it and he became a regular caller.\n\nShe was supposed to be helping with phone problems for the local provider. Maybe she was working in the wrong call center.",
            "Oh fucking Telstra. I know it when I see it.",
            "This is a perfect example of [Goodhart's law](https://en.wikipedia.org/wiki/Goodhart%27s_law): \n>When a measure becomes a target, it ceases to be a good measure.\n\nAlso, Fuck KPI's and lazy middle management.",
            "I used to work in a call center. My elderly clients loved to chat and would talk for hours if I didn’t stop them. They were usually lonely and those customer service calls would be some of the only interaction they’d get. It would make me so sad to have to tell them I couldn’t listen to their stories.",
            "Goodhart's law in action.",
            "I like Stan.",
            "Metrics feel too much like cattle. If your analyzed down to how you spent every second of your day then you should at least get hazard pay since your in prison.",
            "I've done the Irish version of this job- along the lines of \"our company sucks but why not take more products from us\" and had similar KPIs to you, so my resolution was to go through easy \"fixing\" techniques with people for their cable/net etc (restarting the modem, checking cables etc) got my call time up, got good reviews and helped get the sales!",
            "Quitting toxic jobs is radical act of self love, congratulations!! Sending all the love",
            "Yeah I remember my time working at a call center for the biggest telecom provider in my country.  I eventually found a loophole which kept my KPI almost perfect while also allowing me to take like a 10+ min break after every call unnoticed. The loophole kept the job somewhat bearable (I still absolutely hated it) but I quit after 2 months of using that",
            "What was the gossip about you during that month? Surely others noticed?",
            "I hate calling customer service anywhere because the reps talk twenty miles a minute and try to rush me off the phone due to these unreasonable call time limits. It’s so frustrating. I wish more companies would value quality over quantity.",
            "I worked for the same company and I swear I also spoke with Stan!",
            "damn. i thought i was in r/options for a minute and thought you were gonna make me rich lol",
            "> And you know that stereotype of old people talking for eternity and beyond? Its a stereotype for a reason.  \n  \nI only worked manning phones for just under a year, but I feel this. We took orders for a big retailer with a fair online presence, so we were taking calls as opposed to making them. None of mine were as long as some of yours, because we *were* judged by how long our calls were, but even gentle nudging wouldn't stop some people.   \n  \nThere was one woman, I'll call her Gertie, and I got her on the line 3 times in the brief time I worked there. Each call was between an hour and an hour and a half, and I'm not a forceful person, so nudging people to wrap it up is really not my forte (one of the reasons I started looking for something else before a year was out). I learned so much about Gertie. She's in her 70's and she told me about how she's from Tupelo, Mississippi and how her family lived next to Elvis's family. She was very young when his family left the area, so she doesn't remember them personally, but she told me a few anecdotes about her family's interactions with them. Ostensibly, I was there to take an order for clothing, but I wound up hearing large chunks of her life story. And I know I'm not the only one, because she told me about how one of our other reps had personally sent her a mother's day card that year, haha!",
            "Absolute gold, there. Anytime you can make them eat their metrics, the peons win.",
            "I worked at a telecom call centre too but had the opposite problem. I didn't make enough calls despite being the top seller in the companies history. A manager had the previous record and I outsold him by 20 sales in a week or something like that. \n\nMost decent people sold 15-20 products a week making 100+ calls a day but I was doing on average 40-50 sales a week making only 20-50 calls a day. My manager didn't like that and told me I wasn't making enough calls and needed to make more. Apparently it didn't matter that I made way more sales than everyone else, all they wanted to see was me burning through leads even if that didn't equate to sales. That's when I knew it was time to leave. I only lasted a few more months then jacked it in. That job was soul destroying",
            "From the title I thought this was a wallstreetbets post about options trading. I was very confused when I started reading.",
            "I helped to pilot an outbound sales program for a major electronics/service provider at my previous contact center. Unlike a true pilot, there were no KPIs or performance metrics defined. So myself and a few peers made a couple of calls each shift, generally not even reaching a human being. We had a collective total of zero sales at the end of the pilot and decided against launching the campaign.",
            "Your story reminds me of my call centre days. At one point, we had our commission based on conversion rate, which meant taking time with customers. \n\nThen, because we weren't getting the volume of sales they wanted, they changed it to commission for every sale. Customer service plummeted. We'd decide within about 30 seconds whether the customer was likely to buy and slammed through hundreds of calls in a shift. Elderly, cut off. New customer without a landline yet, cut off (we couldn't provide broadband until they'd had their line a week). \n\nI left before they changed it back. I later heard that they had introduced a survey at the end of the call which fed into your bonus.",
            ">*for those of you unfamiliar with Australia's internet, it was 3rd world, literally, we were slower than Nigeria*\n\nThat's Nigeria who are in the top 25 world economies at the moment?\n\nBeing in Africa doesn't make a country poor, backward, or any other negative description you can think of. \n\nAnd while we're at it the \"third world\" doesn't mean poor or backward either. It refers to a country which was neutral during the Cold War (first world = countries allied with the US, second world = countries allied with the USSR, third world = everyone else).",
            "We don’t say hold my beer”",
            "\nYou really make me long for my F*ck Off days! \nI had the boiler room rendition of your Job!\nIts all about the long stretched out quality call, right?\nSo, I would jot down the number of any company \nthat had the longest and most exasperating phone system-you know the ones with...\n press 1- to select the meat department, press 2 \nfor the processing plant, press 3 for you uncles but hole- well you get it. I would just keep calling numbers like that all day, and pressed every option! Heck-I had the best call time in the universe-with out ever speaking! \nSuffering bastard of telemarketing where ever you are- Take it, it’s all yours, May it serve you well! \nThe entire industry gives you a license to \n  F*ck Off at will! Enjoy!",
            "Duh",
            "nigeria comment unnecessary. it’s not funny to dunk on africa anymore",
            "I dunno.\n\nIt doesn't exactly sound like malicious compliance, since 80% and 90% on the hardest clientele sounds like a win for the company.\n\nGranted, they're probably paying a premium to get it done, but it costs money to solve problems.",
            "If this had rolled through in my time at such a call centre I wouldn't have quit so fast, we had the opposite, you got paid per minute, but your rate would drop of you call length was too long :(",
            "Sales is coin operated. They were dumb to be angry when their quotas led to predictable behaviors. \n\nWell done!",
            "I worked for a giant online retailer (yes, that one) and handle time wasn’t a huge factor for us. I would take 30+ calls, most of which could be solved in 5 minutes, but I really liked the chatty ones. One lady told me about the birds she raised, and one guy told me about a cool teaching program. Those were the best.",
            "Fuck Telstra. I moved to Aussie Broadband for my NBN connection and never looked back. Their customer service is great, too bad I'm stuck with fucking Optus for my mobile plan.",
            "I work in the same field though inbound rather then outbound. I can 100% say you are right regarding older people wanting to chat and it improving the experience.\n\nI’ve been in my role for over 10+ years and my talk time has always been high, but for two important reasons:\n\n1.) Customers want to feel heard, so actively listening to the customers issues, using genuine empathy and relating it to what they have told you gains their trust and even if it doesn’t result in say a monetary gain for the company, at least the customer feels heard by the company (or someone at it) and the positive experience is the difference between a customer bad mouthing the company or not which impacts future customer potential.\n\n2.) Listening and asking open ended questions can resolve 95% of issues. I cannot count how many times listening and taking the time to review a customers needs can dramatically improve the experience and reduce callbacks since the majority of people rarely call for every issue or grievance so it piles up.\n\nIt’s especially important since most customers are going through so much already so if you can make them feel heard and recognize their time is valuable it goes a long way.",
            "Sir! Your story reads like modern classic literature. I loved every part, but the best was Stan. I had a Stan once too. Be safe out there friend, and drop me a DM if you ever publish a book.",
            "This is the way",
            "Had a similar case study in college.  Company A decided that their main KPI in the call center was time on the call.  Just time, not at all tied to customer satisfaction.  Company wanted more efficiency, so they said that people who averaged 5minutes or under on each call would get a bonus.\n\nTurns out, instead of people working harder and more efficiently, the employees began hanging up just before a call got to 5 minutes and letting the customer call back.  Customers were pissed, and management realized that you can’t judge performance/improvement with a single KPI.",
            "This reminds me of a minor bit of what I consider malicious compliance at home. I somehow ended up as the tech support for my parents, and somehow for my in-laws (despite their having a local child who works enterprise level IT, multiple other son-in-laws capable). The difficult part was really the distance: a full days drive for all of them, and one special year when my Dad lived in Florida and had dialup.\n\nTrying to remotely log in during the early 2000's to a well infected computer on dialup with a member of the Silent Generation is challenging to say the least.\n\nHowever, the MC portion came with the in-laws. There had a been few hour long sessions over the phone, and at some point I discussed this with a friend of mine who worked as support for a rural health department. He said they just mandated Teamviewer on all of their laptops because there was *no* way they would try to walk the various employees through such things.\n\nCue bringing this up to my FIL after the next session. \"All you have to do is install this remote access software on your computer,\" and since this was during the timeframe when he still unplugged Satan's DSL modem when not online, that was really all I needed.\n\nSomewhere around a decade of peace and quiet now. I still take care of my Mom's tech support (RIP Dad) but it's a lot easier these days.",
            "Been out of call centers for 9 years now.   Just reading the acronym KPI sent a shiver down my spine so thanks for that.",
            "At least you made some very lonely people happy for a while.",
            "You are a beautiful person for taking the time to talk to those people who were obviously in need of someone to talk to. Even though it wasn't your job, and even though you were doing it to bend the rules and get a bigger paycheck.",
            "This is hilarious.",
            "bit late to the party, but I too used to work for a soul trap of a call centre and also had KPI's call length was also one of them. \n\nI worked in customer service, you dealt with the issue (usually add or remove something from their policy) and then ask about an extra they don't have. I was VERY good on the system used at the time, and could wrap up a 'can you send me a new policy document'  within 60 seconds, including going through security checks. Apparently, thats not a good call experience. \n\nDo YOU want to call your insurance company, and sit on the phone having been on hold for god knows how long for another pointless 5-10 mins, just to ask for a new policy document. Of course you don't. What I was doing, was truly customer service.",
            "Commenting on this post from an NBN connection that constantly drops out. I've got a TIO complaint in. Fun times.",
            "My biggest take away is that I *really* want to meet Stan, he sounds lovely and interesting."
        ]
    },
    {
        "post_id": "12rpbl2",
        "author": "Material-Egg7428",
        "title": "Oh I’m not allowed to clean up early? Have it your way.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/12rpbl2/oh_im_not_allowed_to_clean_up_early_have_it_your/",
        "score": 16372,
        "num_comments": 317,
        "created_utc": 1681901988.0,
        "selftext": "I am a Master’s student who works as a TA for a class of 60 students. It is a lab course so there is a ton of set up and cleanup. I usually end up working an extra hour or two past the end of lab (which I get paid for but it does mean I go home really late). So I started tidying up once most of the students were gone. There is another TA and the professor to answer questions. \n\nI did this for a few weeks until I missed a student’s question. The prof yelled at me and embarrassed me in front of the student for “not doing my job”. The other TA was on his phone and the professor was standing at the front not doing anything. He told me to ABSOLUTELY not clean up until ALL the students were gone. \n\nWe had one student that always stayed over an hour later than everyone else. The next week this student was the only one in the lab for over an hour past the end of lab. The other TA was helping them. I stood there, not lifting a finger, until she left. \n\nI took my time tidying up. The other TA is useless and was barely helping. Two hours passed (now 9:00pm) and the lab was barely cleaned up. The professor started panicking saying he still had to write lectures, do his own experiments and then have an hour drive home. He had to help cleanup. \n\nI did the same thing the next week and the professor went into a full on panic attack. He told me that I could clean up early next week. I told him that unfortunately the extra hours I put into cleaning for the last two weeks used up all my hours for the semester so I wouldn’t be in. I heard that the next week was an absolute shit show and the other TA complained that they were there almost until midnight. \n\n:)\n\nEdit: some people have been wondering why the other TA wasn’t out of hours too. He might have been but he slacked on reporting his hours all semester so he was stuck there until the end. \n\nAlso the prof couldn’t leave us in the lab alone (so he couldn’t go do his experiments) and it is a biosafety level 2 lab so he isn’t allowed to bring his laptop in (can’t work on lectures). He was stuck there until we were finished lol.",
        "permalink": "/r/MaliciousCompliance/comments/12rpbl2/oh_im_not_allowed_to_clean_up_early_have_it_your/",
        "comments": [
            "> I told him that unfortunately the extra hours I put into cleaning for the last two weeks used up all my hours for the semester so I wouldn’t be in.\n\nAhaha, the realisation of how much he screwed up there must have been amazing.",
            "Simple, efficient and effective MC\n\nWell written.\n\nKudos",
            "Other TA must have almost died, actually doing their job!",
            "And the TA teaches the professor",
            "*He told me that I could clean up early next week. I told him that unfortunately the extra hours I put into cleaning for the last two weeks used up all my hours for the semester so I wouldn’t be in.*\n\nLOL.  I woulda loved to see the look on his face.  Fuck that guy.",
            "Looks like his experiment  \n\n(•_•)  \n\n( •_•)>⌐■-■  \n\n(⌐■_■)    \n\nwas a failure...",
            "Cool but why didnt he pick on the other TA lol",
            "So as a student worker on your campus, they give you a set number of hours to work per semester?\n\nIf it was me, I'd stay late and use up all the hours in the first few weeks then I'd have extra time for my own studying for the rest of the semester.",
            "The other TA was ON THEIR PHONE and YOU got yelled at, while working. Great.",
            " I just wanted to say it’s refreshing to read a post on Reddit that’s actually well written and comprehensible, and not a shitty wall of text 👍",
            "Love it.  You didn't have to do a thing besides follow directions",
            "I'm a Rutgers student, familiar with the shit TAs have to deal with. Any prof trying to take advantage of you, or God forbid, shaming you for trying to get done what needs to be done, deserves to have it thrown in their face. Bravo",
            ">The professor started panicking saying he still had to write lectures, do his own experiments and then have an hour drive home. He had to help cleanup. \n\nProf is doing it wrong. He needs to walk out with the last student, leaving the TAs to clean up.  \n(I'm guessing he can't leave you in the lab alone, so that's lucky for you.)",
            "The shit eating grin is *strong* in this one! Well done.",
            "I half expected this to be catch 22. You cant clean until ALL the students left. But you and presumably the other TA are also students. So you cant clean until you leave but once you left, you are gone.\n\nGood MC, kudos",
            "Love it when douchey professors get theirs",
            "Alright i get being lazy but bro was putting in hours and not reporting them???????? Insane behavior",
            "Am I assuming correctly that you’re a woman and these other parties (TAs and Prof) are men? It sounds a lot like men not really realizing the astronomical amount of “hidden” work women do. They simultaneously noticed you were cleaning up “early” and failed to notice the amount of work it was… kind of crazy.",
            "Bro I did research in a bsl2 lab for 2 years. People ate and drank in there all the time. Laptops and everything.",
            "Can you tell us more about the professor's experiments? I want to know what they're up in the late hours after everybody's gone home!",
            "Fan-fucking-tastic. A+++ Love it!",
            "Late to this party, but just wanted to say that I love when faculty get put in their place.  It's such a self-important group that rarely gets held accountable for their behavior/actions, and it warms my heart when they do.",
            "Be careful of what you ask for professor!",
            "You're a real grad student.",
            "What is a TA?",
            "Remember this when you get a job after graduation.  Bosses will take advantage of the hardest workers and let the… less involved? … slide.   Stick up for yourself and stand your ground. \n\nWell done, you!",
            "He can bring his laptop in, just not take it out. It seems pretty silly to not have a computer he can use in the lab.\n\nSince your school is such a stickler for BL2 rules, shouldn't there be a BL1 room with a connecting door that he can bring his laptop into?\n\nI'm so glad I work in industry and only have to worry about such things on inspection day. Trying to explain the \"one glove and a cart to go through a door\" rule to old scientists is a nightmare.",
            "That is beyond stupid (of the professor). For the lab I TA’d the instructor would float around grabbing things and putting them away when students were done with them and encouraged us to do the same. I don’t think we were ever there more than half an hour after lab ended unless we had students staying late. Even then we would clean up everything that wasn’t in use.",
            "The “ran out of hours for the semester” was unexpected. Chef’s kiss",
            "You got two for the price of one.  Well played!",
            "I’d be more concerned about a professor staying after hours to conduct “experiments”, da fuk?",
            "Now that's a beautifully executed MC.",
            "I wish I would’ve had an hour limit as a TA lol but nice job!",
            "So satisfying to read. Good for you and thanks for sharing!",
            "Plot twist: That student knew what was up and decided to watch the world burn",
            "From my experience, most professors are absolute dicks. I was BERATED by my US History professor for DARING to ask a simple question about whether authors of books listed in certain chapters would be on the exam. Had everyone staring at me in the class, like I had actually done something wrong. Then another CS professor just COULD NOT bring himself to answer a simple coding question through email, so, me living some 27 minutes away, had to drive all the up to catch him at his very specific office hours (since I didn't have any of my own classes around that time, so I wouldn't naturally be up there). I walk into his office, we talk about the problem for no more than 2 minutes, and I leave.\n\nI hate them so much and I know I am not the only one. This is why people are beginning to gravitate toward certifications more and more.",
            "Masterfully done!",
            "I've never seen any regulations that prohibit a laptop in a BSL-2 lab. I've worked in one and at BSL-2+ for the last 14 years. I wouldn't be able to do party of my job if I couldn't have a laptop in my tissue culture room. Not to mention the rest of my lab that is also rated BSL-2 where all my other computers and other automated equipment are. BSL-2 is generally very safe.",
            "I don’t understand why unprofessional behaviour and verbal abuse is so normalized and accepted in academia. Good for you for sticking up for yourself in the way that you could.",
            "Well done!",
            "Wonderful. Karma kicks a**",
            "Perfect haha",
            "lol, something I suspected all along is that academics aren't necessarily good managers...",
            "What school is this cause literally every uni I’ve gone to made US clean up, the TAs were just there to supervise and lead discussions/answer questions… I feel for you. That’s horrible, and I hope the professors tires go flat every night after lab (:",
            "Awesome! Thanks for sharing. This seems a classic case of ego/stupidity (professor and other TA) vs logic, dedication and common sense (you). It appears you handled it brilliantly 👍🏻👍🏻",
            "It’s a liability thing, go ahead and bill them extra hours for wasted time, it’s still way cheaper than if a student gets injured when you’re supposed to be looking after them. Do exactly as your superior in the lab directs, don’t be surprised if you’re let go if you can’t.",
            "The thing with a lot of these stories is that if the person the MC is directed towards had acted like a decent person,  adequate leader, the OP probably would have handled the situation much differently.",
            "He can’t bring in his laptop but the other TA can bring a phone in?",
            "Ah, when you say \"lab\", you really mean \"lab\".",
            "Yooooo this is delicious. lol",
            "beautiful.  hey, you were just doin' what he asked, lol!",
            "Hahhaha",
            "That's awesome.",
            "Nicely done 👍",
            "This must be why some universities put their Assistants on stipend rather than hourly.",
            "I apologize for those of us that take extra time in the lab. I always tried to focus and get the lab work done quickly and correctly, but I, or my lab group, rather, was always the last to leave. I’d see other groups leaving when I was just over halfway done. I have no idea how they did it.",
            "Why can’t you take your laptop into a BSL2?",
            "A superior yelling at you and embarrassing you in front of others is something you should not accept\\* It is unacceptable behavior. Walk out or talk to HR.\n\n&#x200B;\n\n&#x200B;\n\n\\*Unless you go in the military, but that's what you get entering a job where \"getting abused and/or killed\" is in the job description",
            "All that education, but haven't learned a thing",
            "i'd be making the fuckin students clean their shit up.",
            "That is absolutely brilliant I would have loved to see his reaction",
            "You're not from the US right?  Any kind of hour limit in US academia sounds like a fantasy tbh",
            "You're not from the US right?  Any kind of hour limit in US academia sounds like a fantasy tbh",
            "\\-chef's kiss- superb.",
            "A panic attack? Really?",
            "Too much to read. Attention grabber. IMHO",
            "You're not from the US right?  Any kind of hour limit in US academia sounds like a fantasy tbh",
            "Oh how I miss academia",
            "What’s a TA"
        ]
    },
    {
        "post_id": "kv3aks",
        "author": "geddes_thesea",
        "title": "Next week, I’m going to fire you",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kv3aks/next_week_im_going_to_fire_you/",
        "score": 16370,
        "num_comments": 517,
        "created_utc": 1610374025.0,
        "selftext": "Worked for a shitty airline company. Let’s just make up a name... United Blairlines. At this company they started a smaller company that could hire and train people to run the planes, but pay them way less at certain airports. Where my colleagues at other airports were making over $20/hr, I was getting paid $10.25 for the same- and sometimes more- work. It honestly would scare you to know how little the people who are the ones that make sure your plane takes off safely are paid. All of us had two to three jobs to be able to pay rent, and we were all in the job for the benefits- free flights to anywhere in the country- on standby. Anyway I had a boss, we’ll call him Jim. I could tell many stories on how terrible of a boss he was, but this one has actual malicious compliance. \n\nI had to go to the hospital from the airport because of intense pain in my stomach. It turns out that because of stress caused by that job, my intestines decided to stop functioning. Anyway I spend the day in the hospital and then they gave me a note saying that I didn’t have to work the next two days. I told Jim’s boss that (since I hated talking to Jim) When I went back into work three days later. We had five people total to load all luggage, load the water, and push out five planes in a little over an hour. Already an incredible amount of work for so few people. We had our morning work meeting to discuss how fucked we were, then Jim asked me into his office. “Your attendance is unacceptable.” He said. Dumbfounded, I asked what he meant. “You’ve been late a couple of times, and now missing the past three days...” I said “Jim, I have the note from the hospital. According to work policy, that shouldn’t affect my attendance.” “I don’t care what work policy says. I’m going to fire you.” Again I cited work policy since we were “protected” by a union. I said “Jim you have to give me an attendance warning before you’re allowed to fire me for attendance. This is the first time I’m hearing about attendance, so you can’t fire me right now.” Jim said “it doesn’t matter, I’m going to give you a warning right now, and when I get back from vacation next week, you’re going to be fired, now go back to work, my decision is final.” So, I told my coworkers what happened. Then I decided alright well if next week he’s firing me, I’ll just leave now. Even though their day was about to be fucked since now four people were working five planes, they all said fuck this place, get out of here! So I left and went to get breakfast (this all happened at 4am.) \n\nAs I’m enjoying my meal, Jim calls me. I happily ignore. He calls three more times and then texts me, asking where I was at. I told him “you fired me, why would I keep working for you?” No response. I try to soak in the sight of Jim running between planes like a chicken with his head cutoff. I don’t imagine any plane took off on time that morning. I get a call from HR, and the union rep, and the General manager, who is Jim’s boss. They all said Jim was wrong and asked me if I could come back to work it out. But quitting felt so good, and I felt such weight lifted off my shoulders thinking about not working there anymore, so I never went back.\n\nSome more info. Although this isn’t so satisfying, it’s more a testament of United Blairlines complete lack of ethics... Jim got in really big trouble when he\nhad a guy who had a shoulder injury and had a note and told Jim several times he couldn’t do super heavy labor. Jim sent him to the bag room by himself anyway. Imagine having to lift 300-700 50-70 pound bags over your head per hour all while running between bag carts and the belt. Needless to say the guy tore his shoulder and had to get surgery on it. They still didn’t fire Jim. Instead they “promoted” him to manage the workers who did ticketing and no manual labor. As far as I know, Jim still works for United. My coworker still cannot move the way he used to two years later.",
        "permalink": "/r/MaliciousCompliance/comments/kv3aks/next_week_im_going_to_fire_you/",
        "comments": [
            "That's a pretty shitty union, if they can't even stop Jim.\n\nAlso, fuck Jim.",
            "Your union is really bad. An injury due to ignoring medical restrictions and fired without cause, and Jim is still supervisor?",
            "Goodnight Wesley. Sleep well. I'll most likely fire you in the morning.",
            "[deleted]",
            "> I get a call from HR, and the union rep, and the General manager, who is Jim’s boss. They all said Jim was wrong and asked me if I could come back to work it out. But quitting felt so good, and I felt such weight lifted off my shoulders thinking about not working there anymore, so I never went back.\n\nI would have told them, \"He needs to be let go, regardless of my decision to come back. He is a legal liability. I'm talking with employment lawyers, deciding which one to go with. I'll speak to you again in a few days.\"\n\nI'm sure that would get a desirable reaction.",
            "The two best times on the job:  \n\nDriving to work on the first day, full of hope and promise. \n\nDriving home on the last day, relieved to get the hell out of there.",
            "This United Blairlines sure sounds scummy",
            "Oh hey, I worked for a ground handling contractor for United Blairlines too. Just as shitty, without any union. Congrats on the malicious compliance we have all dreamed about.",
            "Good on you for following your own feelings! Sad to hear that he still got to keep his job and made others miserable :( hope you found a good (paying) new job!",
            "I would’ve negotiated for Jim to be fired before agreeing to come back, only to leave shortly after anyway",
            "If you didn't file a wrongful termination lawsuit, they won. \n\n Literally the only reason HR and upper management were calling you was to prevent a wrongful termination suit by you or the union.  You missed a payday and a possibility for  pro revenge.  \n\nIf Jim made the company bleed green he would be fired.  Until that day they couldn't care less how he treats the workers.",
            "\\> It honestly would scare you to know how little the people who are the ones that make sure your plane takes off safely are paid.  \n\nMan...I take over 100 flights a year due to my job and I am still completely fucking petrified of flying for this exact reason, and the fact I know airlines will find it cheaper to pay my family a settlement when the plane crashes than it is to actually make sure their shit works.",
            "*we were all in the job for the benefits- free flights to anywhere in the country- on standby*\n\nI worked for a now gone airline I'll call Try Waiting Awhile. In my day you could travel internationally and since we were at JFK in NYC, Europe was quite accessible. It wasn't uncommon for people to fly to Paris for \"lunch\" when it could be timed and sleep on the way over and back. \n\nDomestic was harder for some reason. Friends and I would monitor flights to make sure they would be empty enough, especially coming home and decide where to go. We went to California a few times on redeyes for \"weekends\" mostly because those flights were emptier.",
            "so jim still gets money, you no longer have a job, the poor guys are worked till their knuckles bleed and the last poor guy has a fucked up shoulder\n\nall this doesn't sound as satisfying as i expected",
            "Lol, \n“I’m gonna fire you next week” \n“Ok byeeeee”",
            "The only thing that stops United from being the world's worst airline is the notion that even considering it an \"airline\" in the first place is far too generous for the likes of them.",
            "Too bad your co-workers didn't decide to join you. I know, they needed the paycheck.",
            "Obligatory [United Breaks Guitars](https://www.youtube.com/watch?v=5YGc4zOqozo)\n\n...Today is the first time I knew about the followup songs he made, and while the second one was kinda meh (treads no new ground, and is melodically uninteresting), I found the third one was quite decent. (it's an actual followup, and has a decent melody, although is shorter than I'd like.)",
            "People don’t quit jobs. They quit managers.",
            ">because of stress caused by that job, my intestines decided to stop functioning\n\n>the guy tore his shoulder and had to get surgery on it. They still didn’t fire Jim\n\nMan, fuck Jim, and fuck management, and fuck shitty bosses and corporations from here to eternity!\n\nSolidarity comrades! ✊  🌹",
            "Currently work for the same airline (except I wasn't Express, just normal UAL) and also worked with a shitty guy named Jim as my boss, albeit I wasn't a ramp worker. I feel for you guys as some of the most genuine people I've met were baggage handlers or mechanics. Good on you for not tolerating that bs",
            "Sounds like you didn't receive unemployment benefits because you quit instead of waiting to get fired?",
            "Okay... not a bad story... but that's not 'actual malicious compliance.'\n\nMore like 'justified noncompliance.'",
            "You never have to get on your knees for a little tin god. Stand up for yourself no one will do it for you. Glad you got out of that shit hole.",
            "Wouldn't Jim be in the union too?  It sounds from his position, hes like a supervisor (he supervises 4-5 people who make $10/hr)\n\nI mean, I bet Jim probably didnt' make more than $14/hr- think about what a supervisor makes when their employees make $10/hr- its not that much more.  Maybe thats why he didn't get fired for the shoulder surgery guy\n\nAnyways, fuck Jim- just wondering how union rules work out when all affected parties are also union members",
            "I don't understand employment. They pay people half as much to do twice the amount of work and we have high unemployment. Its stupid and it's a problem worldwide.",
            "United Blairlines... hm. I may be wrong but you’ll notice that the “Bl” seems a little out of place, which may be a subtle nod to the airline, Jet Blue, which also has a “Bl” in it. Now, jet blue is a competitor of southwest airlines, and the southwest is one of the regions of america. America is also known as the “United States”, which you’ll notice includes the word “united” so i’m willing to bet they worked for United airlines, even though they tried to hide it really discreetly.",
            "That guy with the shoulder injury should sue. He’d win in a heart beat",
            "Your coworker with the torn shoulder should sue the airlines. That sounds like a lifelong issue be will have there. And he should sue Jim directly as well.",
            "“United blairlines” made me laugh out loud, thank you 😂\n\nEdit: also, FUCK UNITED BLAIRLINES",
            "My gf worked for ...let’s say... Shamurican Shairlines. They could discipline, write up, or fire you even with a doctors excuse. This was also back at the start of the pandemic. She would be sick and they would say... “so what?” Stupid mass transit companies.",
            "Sounds like Jim really knows the ins and outs of the Union.",
            "O shit not United blairlines\n\nTony Blair strikes again...",
            "That man has to be fucking delusional if he thought he could say that shit and expect you to not quit immediately. What a fucking insult that he really thought “I own you, you NEED this job and I’m gonna basically fire you now but you’re gonna stay on until the very last minute because you don’t have a choice” 🙄🙄🙄",
            "\"I'll book a ticket on some garbage airline---\nYou know, I don't wanna name an actual airline so let's just make one up; let's call it \"Delta Airlines.\"",
            "Let’s say I know a person who used to work for a flight company that may or may not be air Canada. He was a team leader. Had similar issues to your colleague, was then promoted to desk work and a pay rise. However the original shoulder injury later caused him to develop Degenerative Disc Disorder in his neck. He would still go out and help his buddies lift the cases though. A real pleasure of a person.     \nWhilst on medical leave, he was all but fired. Yes he sued. Yes he won. But not the stress he needed at the time. Most airline companies pay the hardest workers the least, yet they’re the one who do the actual manual Labour going.     \nFuck you Jim.",
            "\" Worked for a shitty airline company. Let’s just make up a name... United Blairlines. \" I understood that reference",
            "The worse someone is at thier job the further they will go, In a lot of places.",
            "u/jimsucks",
            "Blairican Blairlines does the same, it’s called failing upwards and it’s the reason I left as well",
            "I just went through almost the exact situation with a similar company called American Blairlines.",
            "United breaks guitars.",
            ">I was getting paid $10.25 for the same\n\nUS wages are so low... I reckon I drink more than $10.25 of Red Bull per hour.",
            "Your intestines: if you don’t relax, we’re not putting up with this shit anymore!!",
            "I hate Jim",
            "Man fuck Jim. We gotta kick that guys ass.",
            "Should’ve let him fire you immediately & then taken them to court costing them more money and a compensation payment to yourself and then quit.",
            "It seems that all Jimmy does all day is crack corn. I'm glad you don't care.",
            "As someone looking to go into the airline industry...yikes. And this was MAINLINE blairlines, not some regional carrier that went bust?",
            "Stuff like this really makes me upset. There's no justice, and the bad manager still keeps his. Shit is unfair.",
            "I really know how you feel. My company likes to promote incompetence.",
            "Lemme guess the air line here... Ryan Air! Nailed it.",
            "What, did the airline say “Hey, I think our employees might want to unionize,” and then some legal weasel in the back yelled “Why don’t we make a shitty ‘union’ for them and then let the plebs- I mean, *employees* think they’re being ‘protected’ by joining it, and we can still do whatever we want?” And then all the VP weasels and Exec weasels, and even the CEO weasel, of Weasel Inc. had a good long think, and a few strong drinks, and cheered and said “That’s a great idea, legal weasel! You’re getting a raise! Let’s hire some ‘union’ weasels and get this show on the road!”    \n    \nCause that union sucks.",
            "> United Blairlines\n\nGood to know. I'll be sure to avoid them. :P\n\nOn a serious note, good for you. Never put a job before your health, physical or mental.",
            "This is getting into lawsuit territory for wrongful termination (depending on where you’re from). It’s a shame that the union is so shit",
            "As a fellow ground Service Agent for a different airline, this is very accurate. It's an insanely underpaid job that somehow the shitty members of leadership fall upwards with. I'm currently putting in job applications for companies outside of the airline industry",
            "Useless union",
            "Ahh, the good ol' \"Promote them until they're high enough that they can't do any real damage anymore\" routine.",
            "United blairlines? Is that the company that used To have a passenger property throwing tournament and upgraded it into passenger throwing tournament a few years prior?",
            "\"Jim ... I'm a doctor, not a punching bag.\"",
            "Anyone know if there is a “tales from flight crew” subreddit? I’d love to hear their stories but haven’t found any.",
            "I’m so glad you didn’t go back to that job! Been physically sick due to stress and, let me tell you, it’s much quicker the next time around. Especially if it’s in the same toxic workplace. In my case, it took me a couple years to mellow out and not having constant nightmares about the place I quit.",
            "Man I almost want to say send this to the news I bet the airlines would clean up their act if everyone all over the world heard about how this group of idiots and then see how quickly they get their acts together.",
            "Fuck jim and everybody that looks like him.",
            "Where I live (Ireland EU),if Jim did fire me, I'd have been able to take him to the Labour Court. Victory here means anything up to two years wages. Maybe you shouldn't have walked?\nNow I'm assuming you're in the States where things are a lot different.",
            "I would've just quit if he sent me to the bag room by myself.",
            "Um why didn't you lay him fire you that would have been easy money",
            "All jobs are going to feel this way as inflation continues to ratchet up the squeeze on the already razor thin margins most companies are running on and barely surviving. \n\nThere will be hard decisions that will feel a lot like this story because there just won’t be enough money.",
            "Bro you were so close to being able to sue for unlawful termination....",
            "Did the guy with the shoulder injury sue? He should have.",
            "How much did your co-worker get from the lawsuit he certainly filed?",
            "Used to do that same job, not the same airline though. They're pretty much all the same.\n\nRemember how much the ramp workers  and csa agent get paid next time you look for a cheap ticket.",
            "I just heard of your story on YouTube.  Former Delta Global ramp agent here.  I hear ya on this brother as I’ve had my share of lousy station managers and supervisors during my time with Delta Airlines.",
            "Lol. What a great made up name that in no way refers to an actual company😉",
            "I feel this I worked at Jetyellow and I got paid $13 to drive those damn jet bridges and evenly distribute the damn weight of the plane and deal with emotional abuse from clients",
            "Let's find jim and email him.\nOr, let's just find Jim.\nGive OP a sweet little chuckle as he sleeps at night",
            "How is this malicious compliance?  It reads more like you pussed out of your workplace and refused to use your union rep to defend yourself. This is just a quitting story.",
            "Isn't United Blairlines the airline that pulled out a Doctor for not giving his seat",
            "I feel your pain. I also work for a contract company that serves United Blairlines, and I am supposed to just be in operations (a desk job that I specifically chose to get away from ramp/bag room), but due to our staffing issues sometimes I have to work outside. This shit is terrible, but due to me needing this job at the moment, I am forced to stay. I want to rage quit so bad.\n\nAlso, Jim deserves to eat a bag of rotten donkey dicks. Fuck that guy.",
            "This is pretty stupid. You got bullied into quitting a job and you smugly think that one bad day for the business and Jim is like a \"gotchu fuckers!\" moment?",
            "C'mon pookie let s burn this motherfucker down!",
            "Your workplace needs more violence to deal with Jim.",
            "United. Isn't that the airline that breaks guitars?",
            "Huh. Just this morning I read comments in another thread that delved into the differences in working for either Smelta or United Blairlines, and your story tracks, I never knew UB is so bad towards workers.",
            "This happened. Many people know it. Why protect Jim? Name him. It’s the only justice you’ll get. \n\nWhy do people give anonymity to people like that? \n\nName. Company. City. \n\nYes, yes, yes, yes, …ad nauseam. Other people have that name. That’s an excuse. Other people always have that name.",
            "What is it about companies keeping the one bad employee that drives off numerous other trained employees? Not just keeping, but rewarding with promotions?",
            "Jim is a pos!",
            "Sounds like you bailed on work for three days and didn't tell them what happened until you came back in. Bit of a shit act, no?",
            "How do people in your country make fun of socialism? This is worse.",
            "At the place I use to work at we called it \"failing up\" they do such a shit job that they get promoted.",
            "[deleted]",
            "[deleted]",
            "\"I'm cuter than this little shit has done for the weekend?!\n\nI'm glad I could do the same with people who think that's a good coder. We all know she has it, for me in the first four years of notes* I believe you",
            "[removed]",
            "Wow. I have a friend that worked at Air Canada before and at this point it sounds like most (all?) airlines are super scummy...",
            "I hear United breaks guitars too.",
            "Ramper here - I had a shift where there was only 5 guys to turn around 5 flights in the late evening, and it sucked. I know how you feel. Fuck Jim.",
            "This is why I prefer to fly Northeast airlines.",
            "This explains _soooooooooooooooooo_ much.  \n\nFuck Jim and fuck United Blairlines!",
            "Wtf is that. Worst union, ever? If stuff like this happens, we call our BA and he squashes it before it goes any further. That's why you pay dues.",
            "Title had me thinking you worked for Dread Pirate Roberts",
            "You and your mate should both sue",
            "Lets just hope karma gets him soon...",
            "You’re intensities rly said “boy if you don’t leave this job, we will.”",
            "I quit a job a few years ago after 12 years service. I can relate to that weight off your shoulders thing! Good on you!",
            "Pretty sure you worker at my local airport lol.",
            "United is a disgusting, shit company. If your coworker was smart, he’d have fucking sued them (and won).",
            "I also used to work for the airlines in a regional airport. I am not surprised by this story at all. Glad you got out when you did.  Well done fellow/former ramp rat.",
            "Oh awesome, another stressed induced ileus sufferer! Mine happened when I worked for Amazon. \n\nBut seriously good on you for sticking to your guns and leaving, Kim sounds like a total prick and really is gonna end up getting sued",
            "You could have called them United Unfairlines.",
            "I feel like Jim is my dad's supervisor for the same company. Fuck Jim.",
            "Walmart would like to fire you.",
            "So the lesson I just read is take care of yourself because your bosses don’t. Makes sense. Will not allow a boss to cause me to harm myself for their numbers",
            "At least they didn't try to frame you for murder and send you to jail for 30 years.  Because life is fucking nightmare.",
            "Surely, if you could and the co-worker could have sued, you for wrongful dismissal and the co-worker for his injuries and medical bills",
            "Ah yes, my favorite workplace strategy of “fuck-up, move up”. Where you can’t fire people so you promote them into positions where they’re least likely to cause damage. See: every US Government position. \n\nWorks **great**.",
            "I worked ramp so I understand everything OP is talking about.",
            "Hi",
            "Never give your body to a company, especially shoulders, knees and back. You’ll be a distant memory for them (if they even remember you) but have to deal with the fallout for the rest of your life. The math never works in your favor.",
            "I’m just imagining Jimbo Jones off The Simpsons but fat, old and cynical...",
            "I have sort of similar story, but in a moving company. You know, I got paid for CARRYING shit, not the travel time, which in most cases is 95% or more of the work day. As my then-boss said, I quote; Helpers don’t get paid for sitting in the cars, they get paid for working. Like, how is not WORK TRAVELS what I do as part of the job?! Just sayin’, I quit less than a week later from this talk, and never regretted. It was a nice job - low pay though, 10€/hr, - and the coworkers were between tolerable and very nice guys. Honestly, I wouldn’t mind doing the job, but the way the boss told me to do shit I wasn’t supposed to do - like drive my personal car to a city where we were picking the load, ON MY EXPENSE - was way over the line. Glad it’s over. On the plus side, aside great coworkers, it was free gym everyday + payment for just that! Haha.",
            "He probably was expecting you to beg for your job.",
            "Fesh Pince of Blairlines?",
            ">It honestly would scare you to know how little the people who are the ones that make sure your plane takes off safely are paid. \n\n25 years ago, I worked for a company fabricating a critical and extremely complex component of the thrust reverse system on just about every jet engine GE made at the time.  After 3 years I was making almost $1 over minimum wage.",
            "Well your coworker hurting himself really is his fault. He was put in a tough spot but being union he should've said nope no heavy lifting and stuck to it no matter what. It's common sense. Don't hurt yourself for a job no matter how much you need it because that injury could prevent you from ever working again.",
            "I thought \"United Blairlines\" was owned by its own employees?  How can this type of management be allowed - especially with a union?  The union must be pretty weak.",
            "I think we can all agree that Jim can officially go fuck himself.",
            "This is why all my homies fly Delta Blairlines.",
            "Jim can eat a bag of dicks. It amazes me he still has a job.",
            "Fuck Jim and all people like Jim and all big corporates support Jims!",
            "Shit man, Jim should have been fired immediately!! That poor coworker with the shoulder!! Well, at least the malicious compliance was satisfying - I chortled!! Thanks for sharing.",
            "ISS for not going to complain.",
            "I feel like you could sue for wrongful termination",
            "Michael! Michael!...",
            "Um. Why did your union call you at the same time as HR and your boss? Those people are at odds with each other...",
            "Nice try at that made up name, but I could figure out who you actually work for.\n\n\n\n\n\nTIM.",
            "I hate that airline. If I am implying the correct one. I will never fly with them even if the world is on fire.",
            "Yeah no shit you're getting paid less to take people to bumfuck Idaho where there's barely any air traffic. It takes years of training to fly into huge airports like JFK or Heathrow and with that training comes extra money.",
            "I know it varies, like the laws in a place like Ohio are way different than Texas or Oklahoma as its just a different culture.  I moved into IT years ago and as a manager or a technician, there is no union.  From my understanding, its considered white collar work even if you are crawling in an attic. I'm not the expert though.",
            ">It honestly would scare you to know how little the people who are the ones that make sure your plane takes off safely are paid.\n\n15 years ago I worked at a medium-size general aviation manufacturer. My job was assembling horizontal stabilizers. This I did for the princely wage of $9.50/hr. \n\nOnly the guys in the body shop/paint prep would get about $15/hr because the work SUUUUUUUUUUCKED.",
            "United Blairlines.\n\nThe only airline owned and flown by Tony Blair.",
            ">union job\n\n>$10.25 /hour\n\nSeriously?",
            "I haven't even read the full post yet but upvoted for United Blairlines.",
            "When I was younger I let a boss who I won’t name pay me off after I hurt my back (I make good money and in the Union)... if it ever happens to me again I’m coming full force with lawyers. They preach this don’t turn us in or you’ll be blacklisted stuff when your young but next time I’ll go to court and then start my own company with the settlement lol",
            "In my head Jim is boss in F is for family",
            "This kinda sounds like Menzies",
            "Where’s the TL;DR; ??",
            "A song for united\n\nhttps://youtu.be/5YGc4zOqozo",
            "I worked for delta/united at a small airport. I was cabin security and paid under $10. Fuck dgs.",
            "I'm loving retirement. I never have to deal with another Jim again, ever! And believe me I worked with more than a few!",
            "Fuck Jim",
            "Jim is a shitty boss, but I’ve learned a lot of bosses will do what’s wrong if the worker allows it and doesn’t stick up for themselves.  You got a union and a doctors note.  Tell Jim you ain’t doing shit, you have a note.  You’ve already gone over his head, you should’ve done it again when he said he was gonna fire you.  Easy wrongful termination lawsuit or at least Jim gets fired.  Same with your friend with the shoulder problem.  Some bosses literally don’t give a fuck about you and only care about production.  So you will have to look after yourself.",
            "Man, I don’t even personally know Jim and I’d like to put some visine in his coffee.",
            "Which city? Bloakand? Saltimore?",
            "Since it’s a shitty airline, you should change the fictional name to Larry Air.",
            "Ahh... failing up the ladder: every bureaucratic parasite's wet-dream!",
            "I used to work for a certain gas circuit breaker factory. Let’s call it, Hitsubishi. That was the best way to get promoted there. A worker fell asleep on the forklift and drove it through the bay doors. He got a promotion to QC, shortly after. It was called pulling a cheddar (his name) if you messed up on purpose to get a promotion.",
            "Also once worked at an airport for a similar company. Call them Amerikkan Airlines. Reading your post brings back a lot of eerie memories of the same happenings. Short staffed every day, made up rules and policies that would prevent employees from using any flight benefits (attendance) Etc. Working on million dollar airplanes and being paid near minimum wages.. got out as soon as I could. Did it for about a year and that was plenty long enough.",
            "So out of curiosity, how much would someone working for this fictional company United Blairlines get paid as a baggage handler, ground staff, etc?",
            "[United Breaks Guitars](https://youtu.be/5YGc4zOqozo)",
            "Make like the last scene of fight club.",
            "You think baggage handlers get paid poorly? You should see what the AMEs actually maintaining the plane make lol"
        ]
    },
    {
        "post_id": "lk9lim",
        "author": "Magnus_40",
        "title": "HR maliciously reject leave request. Ensuing malicious compliance results in a ridiculous amount of leave taken all within the rules.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lk9lim/hr_maliciously_reject_leave_request_ensuing/",
        "score": 16360,
        "num_comments": 696,
        "created_utc": 1613378866.0,
        "selftext": "tldr: HR reject holiday request despite it being within the rules so I now maliciously push the rules to take a ridiculous number of days leave.\n\nI work in a UK company that has a very good leave policy. I get 27 days annual leave and I can also build up flexitime and take up to 2 flexi days off per month. In addition, due to a screw up in HR, I am allowed to float all my public holidays; I was moved to a joint venture company for tax and legal purposes and when they took me back into the parent company they just adopted my contract from that company instead of getting me to sign a new one.\n\nOne day I put in a leave request for 3 leave days and 2 flexi days. HR person denied it as, she said, it was against the rules to mix flexi and normal leave days. The rules had changed some time ago to allow mixing but HR person told me that it was against the rules.\n\nI took it higher and her decision was overturned but she did not like it one little bit. Thereafter, whenever I submitted a request with mixed leave she rejected it out of spite claiming that it was not in the spirit of the rules. It is an interesting view into her mindset that she refused instead of asking how she could do it too. She was all about stopping me so the fight began.\n\nEaster was coming up and I was due to take 2 weeks off. The middle Friday of my holiday was also the end of my leave month and the Monday started a new month so I put in for 2 public holidays carried over from Christmas, 2 flexi days and a good Friday public holiday  and since the second week was a new leave month I used another 2 days of flexi, plus the public holiday Easter Monday and 1 day of public holiday from the start of the year. So my 14 days holiday in the sun cost me a single Friday which is 5 hours of leave time. She went ballistic but could do nothing despite trying to find any way to stop the request.\n\nAs a direct result of her trying to stop me I now make a point of building up and using as much flexi leave as I can just to see her pretending to smile as I hand in my request to her directly every single time. She grits her teeth so much I expect her to break a jaw. In 2019 I peaked and managed almost 60 days of leave all thanks to her. Maybe I should thank her.  \n\n\nUpdate: Wow thanks for the response and awards. Still new to Reddit so this is a bit overwhelming. It is always nice to hear different views from people around the world but I am amazed at the responses from the US regarding how few days leave you guys get. That's truly shocking that some of you get no time off at all.\n\nThanks all.",
        "permalink": "/r/MaliciousCompliance/comments/lk9lim/hr_maliciously_reject_leave_request_ensuing/",
        "comments": [
            "Is \"The rules had changed some time ago to allow mixing....\" documented somewhere for you to print out & anonymously send it to/ post it in her office? ;-)",
            "Why do some people just have to be so miserable?\n\nA lady I‘ve worked with off and on over the past 30 years is one such miserable person that I just roll my eyes every time she comes to me to complain about where one of my employees is and why hasn’t she seen them in the office for weeks.  Finally, I just told her “that’s really not any of your business” and it finally stopped, but fuck’s sake...\n\nEdit:  ...I mean, what, are you a fucking toddler that can’t understand that people can still be working when you don’t see them?  I’m an IT director, so my folks can work on projects remotely and often work for extended periods on projects at the project location.  I act considered putting cardboard cutouts of people at their desks.  She wanted to be able to go and interrupt anyone she wanted at any time she wanted for any reason she wanted rather than go through our help desk procedure.",
            "60 days leave a year! I think you just exploded American minds!",
            "\"It's an interesting view into her mindset that she refused instead of asking how she could do it too.\"\n\nThis is one of the main problems with workplace culture. It's always \"Why should you get to have/do that and not me?\" rather than \"we should both have that.\"",
            "Never understand why Karen's in HR get so wound up that a regular employee would dare to extract offered and deserved benefits at least approaching what they are worth to the company they work for.\n\n\n\nHOW DARE THIS MF'ER TRY AND COLLECT WHAT THEY EARNED IN FULL?!! REEEEEE!!!\n\n\nLike...what the hell? She doesn't suffer or benefit. Just file the shit and move along Karen, damn. Desperate to be seen as management. \n\n\nHmmmm. Maybe that's the problem? Management needs the employee way more than it needs HR. They can fire HR and do it themselves, they can't fire the employee and do the actual job that makes the company cash. \n\n\nI'd be kissing employee ass frankly. I want them on my side if things take a downturn. Then you've got the power of the workforce and the knowledge to royally screw management if they decide to do something shady on the same side. \n\n\nI'd be low-key telling other employees how to maximize days off with OPs approach like I was a buzzfeed article. Get 14 days for the price of 1!\n\n\nHR is too often the land of petty little powerless tyrants. \n\n\nHope you enjoyed every one of those days OP.",
            "Managers sometimes use leave as a reward\nPunishment system.\n\nAny request put in is assumed as approved unless the manager immediately rejects it with a valid reason. \n\nThe only one acceptable  is previous requests and that allows me to negotiate.\n\nIn essence it’s not a request but a warning that the manager will need to find coverage.\n\nThe one manager that rejected one of my requests was put thru a ringer.",
            "Our policy allows \"partial\" leaves (dropping to part-time, effectively) only with manager and HR approval.\n\nI worded my request along the lines of \"I'm entitled to take this period totally off, but I have some things I'd still like to be done. Would you approve two days off per week, or do I actually need to be fully off-work for five weeks?\"\n\nUnsurprisingly, they thought two days off per week for five weeks seemed fine.",
            "Everytime I see these types of discussions about vacations or sick time, it reminds me how blessed I am to work Union for a municipality.   It also reminds me, in my opinion, Unions would benefit the vast majority of Americans.  I had a discussion with a local taxpayer who complained about how much City workers are paid and that our benefits are \"too much\". \n\n  I asked them why they are trying to take from other middle class taxpayers instead of fighting for or negotiating their own benefits?  I then asked what someone who can do a good portion of carpentry, mechanical, custodial, tree cutting, plowing, painting, landscaping, electrical, plumbing,  locksmithing, paving, concrete, etc was worth...and they said a number no where near what my salary/benefits are worth together.  I basically told them that I described myself, I work for our town, pay taxes here, AND dont make anywhere near the number they spoke of.   Que...red cheeks and surprised Pikachu face...",
            "[deleted]",
            "Worked for the US government.  When I was hired decades ago they revised the civil service system.  We used to be able to add unused sick leave to our working time for retirement calculation (let's say you worked 30 years and had 1 year unused sick leave so you worked 31 years for your pension calculation).  They did away with this for new hires.  Decades later they were wondering why people were using up their sick leave (duh) and brought back the old calculation (the actual cost to the government turned out to be 25% of the cost of paying out the sick leave).  This was reinstated 4 years before I retired.  We use the local HR to do the paperwork though the agency HR (in another state) does the approval (we could skip the local HR in the process but it is somewhat easier to go through them).  Anyway, I go to the local HR office to find out my estimated pension and the person excludes my sick leave.  I told them about the reinstatement but they didn't believe me.  I made them look it up on-line at the Federal retirement site and they finally accepted it.  Morons!  (No one lost this benefit as the agency HR actually did the official calculation and payout but people needed this figure ahead of time for planning purposes.)",
            "I’d leave her flowers explicitly thanking her for making PTO requests so easy. Passive aggressive people love that kind of gesture.",
            "... Americans downvoting this as an exaggerated fairytail. Laughing in danish. Well done OP.",
            "Ironically, people who work in HR are some of the most detestable, insufferable human beings you are likely to encounter.",
            "Why does HR have to get involved with taking time off? My company is so much simpler: \n\"Hey boss, I need next Monday off\"\nBoss: Okay",
            "Good for you! Glad that worked out well.\n\nBack when I was in the US military we were officially given 30 days leave per year, but in reality that meant that you got a sheet of paper with a number on it that went up by 30 each year. After four years on my boat I had 110 days of leave on the books. (Normally it's capped at 60 and additional days just vanish, but I had several loop holes that allowed me to go higher) Anyway, when I was nearing the end of my enlistment I requested some of that leave, as is normal. It was denied and my boss's boss's boss told me I should expect to work straight up to my last day of service and not take any leave at all. I had several special qualifications and my ship was not allowed to go out to sea without me on board, and the command had made no preparations to replace me. I cornered bbboss when no one else was around, mentioned a few skeletons in his closet that could have gotten half of the upper command fired (related to nuclear safety), and he approved \\~60 days of leave and I left the ship and started college on time. Fuck the Navy.",
            "I once had to deal with an hr person working for Manpower (temp agency in the uk that puts you on a one week rolling contract so they don't have to give you proper benefits) refusing my request though it (probably) wasn't malicious. I accrued leave at 1.5 days a month iirc so start of the year I wanted a week off which was refused because I hadn't accrued the days. \n\nI pointed out that they didn't have to pay me for the time off until I accrued the days, so I could have the week off and get the pay later in the year. She insisted it didn't work that way, I pointed out her way meant that nobody could have a week off until half way through the year leading to everyone having to fight for time off the last half, still wouldn't budge or check with someone higher up. I checked my legal position and I was told I was correct, she disputed that too.\n\nI happened to go to another town to visit my parents and there was a manpower office on the high street, so I went in there and asked them what the deal was with accruing leave. They also told me I was correct. I asked them to call my hr manager and tell her, their faces fell and all of a sudden they closed ranks and said she was right. In the end I just called in sick the week I wanted off. \n\nShe also once got us into a meeting in groups of 10 to excitedly announce she'd negotiated a pay rise for us all of 50p a week. There was total silence. We must have been the fifth group she'd told and she was still grinning like she'd told us we won the lottery.",
            "What the fuck is her problem? She’s not your manager, your being gone doesn’t affect her workflow. What a garbage human being.",
            "Why do these people care so fucking much? Just approve the leave and move on with your life",
            "I don't see why she'd care. Her job is to process paperwork.\n\nAt my company, you direct supervisor is the one who approves it.",
            "59 yo American here.  I have never had 60 days of leave **in my entire life, combined**.",
            "*cries in American*\n\nY'all get days off? Wish i could afford that.",
            "Could you imagine getting paid time off like this? The USA is a fucking joke.",
            "I never understand people like this.  How does your leave affect her life?  Does she have to do your job? Watch your cat while you are gone?  Just sign the damn forms. Such a waste of energy.",
            "Amazing how something that doesn't affect a person at all can cause them so much anguish.  Sad really.",
            "Maybe adopt the Japanese approach of bringing back small gifts (could be as small as a chocolate bar or magnet specific to the region) when you come back from holiday. The mentality is it’s a thank you for everyone taking care of the place while you were away... she’d love the reminder :P",
            "I am on a very old UK contract that has 25 days leave in it. I managed to get it grandfathered in to my existing arrangement in a country thar only has 10 days leave. First work day in Jan I check my leave and then remind HR to top me up 15 days. They hate it.  A former manager tried to take it off me and I had him called out on it.",
            "MMM, yes this is my favorite kind of fuck you to work. I can taste the HR tears.",
            "Holy shit that's a lot of time off, what's it like getting more then 3 days off?",
            ">She grits her teeth so much I expect her to break a jaw\n\nShe had more than one jaw?\n\nI know she acts like a monster, but I didn't think she literary is one.",
            "American here. Can someone explain flexi days? I’m not familiar with this.",
            "I would start going through the motions and following up with her boss take it higher and then bill your time every time she denies it. Over a year I bet you would get another day off 🎉",
            "Our local authority where I worked for 30yrs stopped HR ‘approving leave. Managers gave approval and HR simply signed off as saying sufficient leave available",
            "I literally don’t understand a word of it, but I’m delighted you got a load of leave and fucked off HR.",
            "What a sad world where people get angry at you for trying to enjoy life by not working",
            "Why does HR even have a choice as to whether you take time off ?\n\nI'd honestly be so dumbfounded if HR at my company said I couldn't take a day off I'm not sure what my reaction would be. I assume I'd think it was some kind of prank.",
            ">\tIt is an interesting view into her mindset that she refused instead of asking how she could do it too.\n\nThis is an extremely good point. She could be taking advantage of her time off and helping others but instead she thinks it’s her job to deny requests. The tiniest bit of power can really go to people’s heads.",
            "It must be exhausting to be so petty that they'd get upset that they couldn't deny people time off.",
            "I am just always baffled that people are like this. How miserable must her life be",
            "please mentor me in your ways. LOL.",
            "Pretty bold of her to be told by her higher ups that it is explicitly allowed, then deny you in the \"spirit\" of the rule.",
            "I used to work in the UK public sector. Had 27 days as standard plus 8 public holidays. After 5 years I got another 5 days for long service. This gave me 40 days per year before TOIL came into it.\n\nI had flexible working too so could work from home when needed\n\nCrap pay but this did help offset that somewhat",
            "Typical HR experience.  Generally the worst and most useless people gravitate to HR as a way to feel useful/powerful without any talent or discernible skill.",
            "As an American with NO paid days off, I'm a little puzzled by all the different types of leave you have to navigate",
            "Until I read about her I was sighing jealously in American. Now I’m thinking she must be an American voter.",
            "On employee/employer appreciation day give her a card thanking her for allowing you to build up so much paid leave and without her pushing you to do that for yourself, you’d still only be taking 1-2 days off at a time",
            "27 days?  Plus floating holidays?   I just got to 22 days a few years ago.    And that was a big ask (US, of course).",
            "I'm atheist but I hope there is a level of hell for all HR folks. it's not like they hand out benefits out if their salaries.",
            "American here, I had to stop at 27 days leave..... that’s unheard of in the US.",
            "Petty tyrants.",
            "My man! Well played lol",
            "HR = Human Remains\n\nI've never understood why folks with such appalling people skills always seem so keen to do what is essentially a people job",
            "I feel this in my bones, lol. I currently have 80 days of leave. I cannot wait to just dip out for 2 months in a year!",
            "Jeez, here I am in the US with 10 days of PTO at an otherwise nice and high paying job (have to be here 14 years to get bumped to 15 days). They reject a lot of my requests because I put in for them a few months in advance because “we don’t know how busy it will be then.”",
            "I love working with flex hours, because there's pretty much no one else there when you stay late or come in early you can use the time to relax. I barely worked fridays because of it.",
            "She should thank you for not reporting her for discrimination. People who behave like that are gross.",
            "HR is a reflection of your organizations leadership and ethos.  Fuck ‘em all!",
            "Print out and laminate about 20 copies and adhere with clear epoxy to every available surface in common employee rooms...including table tops.  \n\nInclude: “Direct all inquires to Ms. HR#%^*@“",
            "This reminds me of a friend who requested 4 days off for a work related competition because they \"needed\" him to work his assigned days. They denied his request. So he took his 3 month (paid) paternity leave instead. Sure, he didn't get to do the competition, but he proved they could handle the job without him.",
            "That's like a whole year of time off! We get UNpaid leave on legal holidays or certain family-related scenarios. It sucks",
            "People like her are what I call Bureaucratic Hemorrhoids on the Anal sphincter of life.",
            "Ohhh flexi time sounds good. I work in the UK and we don't get that, maybe one day!",
            "I'm not saying be scared, but I'm not sure how much salt you want to rub into that wound.  HR gets it's sticky fingers into a lot of pies in my experience.",
            "27 days a year plus 2 per month!?!?!? Yikes, I get 10 a year total, and usually have to work most holidays. America is so far removed from worst rights that I don’t think they’ll ever figure it out at this point...",
            "Lots of companies due this. In the US they are required to let us take paid leave if it’s offered by the company. If not they have to either let it roll over or pay us out. A few co-workers and myself occasionally get close to being maxed out on leave so we schedule it in advance when we know we will max out and start loosing benefits. Management sits on the requests for months then tries to deny the time off because we all asked for the same time off. They then have to legally let us take time off, pay us out in benefits denied, or roll it over. Since management sits on the requests for months they can’t say we should reschedule since it will be a loss to us. It’s fun to watch the squirm then let us all have the time off and say don’t do it again but we do every year and they sit on the same requests every year for months.",
            "What I don’t understand is why she just doesn’t let you take your time off. You’d think she would prefer not to have the headache of fighting you every time you take the leave you are obligated to take. Plus I’d be willing to bet she doesn’t earn a bonus by keeping you there. There is nothing to gain especially since you keep winning these fights with her. Some people pick strange hills to die on.",
            "Jesus Christ this amount of time off is giving me anxiety",
            "She has some serious fucking issues holy shit. People are ridiculous.",
            "NICE!!!!  I have to remember this!",
            "If you transferred back in from the joint venture under the TUPE regs, they would not be allowed to do it on new contractual terms. You have to transfer back on the terms you're on before the transfer. There are exceptions but they require company wide changes and are interpreted VERY strictly by the courts if push comes to shove.\nI did over 30 years in various HR roles and I'm appalled that her attitude was so obstructive about leave. Some folk are just mean-spirited, but her manager should have had some very direct and difficult conversations with her.",
            "You should send a cheerful postcard to all of HR (*not* just her) every time you go away. :7)",
            "THANK HER. Tell her \"thank you for being so flexible with my leave\" smile and walk out",
            "i needed this story lol",
            "HR is not there for to help you. It’s there for to help the company.",
            "[deleted]",
            "That was the longest tldr I never read.",
            "Why didn’t she just deny it out of principle again. Like she was knowingly rejecting the rules otherwise why would she change now?",
            "She probably owns cats.",
            "How do you Europeans even make any money. Half the time youre not working. Lmao.",
            "“It is an interesting view into her mindset that she refused instead of asking how she could do it too. She was all about stopping me...”\n\nNo it isn’t, sure this definitely could have been malicious on the HR lady’s part. Hell maybe it certainly was malicious, but using the fact that she does her job and enforces rules surrounding leave as evidence she has it out for you seems kinda silly"
        ]
    },
    {
        "post_id": "d92554",
        "author": "SugarWine",
        "title": "Can't reimburse my bus fares because there is no receipt? Ok then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d92554/cant_reimburse_my_bus_fares_because_there_is_no/",
        "score": 16340,
        "num_comments": 648,
        "created_utc": 1569412140.0,
        "selftext": "I used to travel for work fairly often, and the company I worked for had very strict reimbursement policies. You had to have a receipt for EVERYTHING or you wouldn't get refunded for it.\n\nOn one trip I was staying in the center of a mid-sized city, but the training I was attending was in the suburbs. There was a bus route I could take, and while it took a great deal more of my time it was WAY cheaper to take the bus than a taxi. $1.50 bus fare vs. approximately $40 for a cab. Problem is, there's no way to get a receipt for riding the bus. \n\nSo, I email my company's business manager and explain the situation. Ask if I can please get reimbursed for the bus fare without receipts. The response comes -- no, any reimbursement requests without receipts will be denied, and I will have to cover the expense out-of-pocket.\n\nFine. Cab rides, twice a day, for a week. Totally allowable within company policy. Fares plus tips, the total taxi expenses come to almost $500. My boss questions the request, I show her the email from the business manager and explain that I tried to take the bus (which would have totaled $15. for the week.) but was told it wasn't reimbursable.\n\nOver the following weeks, heated discussion ensues between the business office and senior management. Two months later, there's a new policy -- reimbursement requests for anything over $10 must have a receipt. Under $10? No receipt required....",
        "permalink": "/r/MaliciousCompliance/comments/d92554/cant_reimburse_my_bus_fares_because_there_is_no/",
        "comments": [
            "Yes bartender I need 500 dollars of booze in $10 increments",
            "So funny enough, I worked for a company that reimbursed public transit, but we of course didn’t get receipts for the same reason. At one point we got audited by he IRS and guess what they wanted? Transit receipts for 20 people, for 3 years.\n\nWhen I explained there was no possible way to show these receipts, the lady asked me to call BART customer service (if you’re from the Bay you’ll get why this is laughable) and had to sit there with me for an hour before someone on the phone laughed and us and said, yeah, no way we can issue you receipts.\n\nIRS gave up on that, but I couldn’t believe an AUDITOR couldn’t understand why you don’t get receipts on a SFMTA bus.",
            "Company I used to work for gave us the option of a company phone or $20 a month stipend. Everyone took the stipend. A literal less than 1% took the company phone. New management took over and made everyone take the company phone. No one used it regardless, even after taking away the stipend......The real kicker was the company was paying $50 a month per phone. I asked Verizon for the contract specifics of what I was entitled to. I bet anything someone was getting kickbacks.\n\nUnreal that Management can increase costs 150%, about $15,000 a month more and keep their job.",
            "Back in the early 2000's I experienced something similar. As I am about to leave for a long weekend (pub. holiday),  we get a call from HQ asking  if I could be there the next day.  I'm Belgian, working in the Netherlands for a company with HQ in Germany. The last minute airplane ticket alone was \\~ 2000 euro, add 2 nights in a fancy hotel suite and it's a 2500 euro trip.\n\nSince it was a long weekend anyways I proposed to drive there: it was faster (450 km one way), less hassle and I could spend a few more days in the city.  Not to mention that it was way cheaper than flying there: compare maybe 100 euro in gas/parking with \\~2000 euro + a few cabs.\n\nThey got actually mad at me, that no special behavior would be tolerated, and I should do like anyone else.\n\nKicker of the story: I had to eventually stay there for 6 days, after the return flight had to be rescheduled 2 times. I remember I had 800 euro for cab fares in my expense note.\n\nThat was the day I decided I'd be my own boss and no longer deal with the stupidity, and have been freelancing ever since.",
            "Business travel reimbursement refuses to repay something I bought in advance or out of the appropriate meal time period. So if I buy a bunch of yogurts and fruit sunday night to have each morning for breakfast all week, they will not reimburse me. \nLeads to me maxing out my budget every “breakfast” “lunch” and “dinner” period with nonperishable food, even if I have already eaten or am not hungry. Their loss.",
            "[deleted]",
            "Somewhat similar I met someone taking the Subway once and he said his company provides car service home, but if you don't use it, you get a bonus of something like $100 each week, as the car rides would be drastically more. They stopped that practice so people stopped taking public transit and costs skyrocketed.\n\nLike people that spend $10 on gas to drive out to that store that has something for $5 less.",
            "[deleted]",
            "Yup, policies are usually written by those who don’t travel. \nOne time I did my laundry at the hotel using the washing machine and dryer and put it in expense report as $3.75 for laundry. Obviously no receipt as it was a machine. You would think accounting would understand, but nooooooo....... I really didn’t care about the money but I had already been talked to once for omitting small expenditures from my report and just paying out of pocket and not worried about being reimbursed. \nSo I said fuck it and had the hotel do my laundry from here on out. \nThey don’t blink an eye at me spending $75+ on laundry because it is in policy.",
            "You know you've done good when you cause a change in company policy AND make someone in management look bad, especially when you can back up your statements with written proof.",
            "Yeah my idiot company does the same thing. I used to travel for work a lot, usually for a week at a time and I liked to stay in B&Bs off of Airbnb because it was more like staying at a friend's house than a boring cookie cutter hotel. I found one I particularly liked because it was run by a nice retired lady who would make my breakfast every morning and even do my laundry! Plus I was saving the company shitloads of money because it cost $100/night instead of $350/night AND breakfast was included. I got a full receipt for it and everything so it was no problem expensing it. For awhile that was no issue, but then our finance department got taken over by the parent company and they forbade it, saying we had to use their 'in-network' hotels only...blah blah blah. I tried explaining how this was a much better arrangement for all of us and they harshly shot me down and told me to obey the policy to the letter. OK then, now I always choose the most expensive in-network option available and I make sure I max out my per diem on meals. Fuck them",
            "Policies are usually made by HR and money people who rarely travel",
            "My company also requires receipts for just about anything, but in cases like this they let us write on a post it note \"Subway, $2.75\" and turn in that as the receipt.",
            "Reminds me of a story told here where a traveling person loves good restaurant service and overtips. Accounting yells at him for tipping too high of a percentage. His response is to keep tipping the same but order much more expensive food. Yup, to appease accounting, he brought that tipping percentage right down!",
            "I love it when malicious compliance actually fixes a broken/dumb policy! Way to go!!",
            "Worked for a company that did this. They would also pick through the receipts for anything they disagreed with. My boss and I enjoyed the travel work. Company payed for everything and we both drank a lot. At restaurants you get a few receipts back. One of those receipts is just the total without the line by line. He would use those so the company wouldn't get pissy about the drinking.",
            "[deleted]",
            "My father towards the end of his career went to Paris for some meetings. He was there for 10 days, it was customary that people from his office were given a reasonable amount of free time to enjoy the sights while they were there. My father was a big fan of public transportation, especially trains. When he returned home he dropped off his expense report and receipts. When he returned to his office his phone was already ringing, it was the person doing his reimbursement asking why he didn't have any taxi receipts. He answered that he hadn't taken any taxis while he was there. They were dumbfounded and asked why he hadn't taken advantage of the time to explore, he told them about all the places he had gone, but also explained how he had simply used public transport. He was the first, and likely only person from the office that had ever done that.",
            "Heh, I was *almost* in the same position when I worked for a startup, but fortunately they had hired their first HR specialist, who had updated the travel policies like you described -- no receipt needed for such small amounts.\n\nI was at a conference in NYC and needed to leave for the airport around 3-4pm and could take a bus or cab (or Uber), but figured I could just take the subway+airport train (whatever they call that), which is muuuuuch cheaper. Also faster at that time!\n\nEdit: Come to think of it, the startup already set a precedent of reimbursing for a lot of things they wouldn't be able to expense on taxes, so it probably wouldn't have been an issue. Still, glad to see she headed that problem off early.",
            "I had this happen at the school I work at a few years ago. The district denied the request work around of a $500 charge and then flipped out on our cohort for following instructions of the district to not save money which ended up costing closer to three grand. Gotta love bureaucracy making things less efficient more often than not.",
            "Sounds like a similar boneheaded policy at one of my previous employers. When I got hired, they just paid per diem for travel and we didn't have to provide any receipts unless it was an extraordinary expense -- if you spent a night somewhere, you got paid per diem for that location. The company merged with another company and my region ended up under new managers. One of the first things they changed was no more per diem -- we had to provide credit card receipts for everything we wanted to get paid for.  I asked the VP in our area why they changed it: \"I'm sure you guys like banking that extra money from per diem, eh?\" came his response. Yes, all of us engineers who are getting paid near or over 6 figures are squirreling away an extra $20/day by eating cup o' soup instead of real food.\n\nThe best part? The expense limits for meals were $15/$25/$45 for breakfast, lunch, dinner, which is much higher than per diem in pretty much all of the areas that we worked in ($45-$55/day). Since we only needed to provide credit card receipts and not itemized receipts, I started eating a lot better when I traveled. Chili's or Applebee's instead of Whataburger for lunch. Instead of Panera for dinner, I'd hit Texas Roadhouse and get a nice steak with a couple of beers. On top of my extra nice meals, they had to pay someone to sort through the piles of receipts that I had to provide for those meals.",
            "I was traveling to a conference for the first time at my job for IT Support and I read up on the reimbursement policies because I wanted to make sure I submitted the expenses right. It said on there that I can expense dry cleaning (suits and button ups) if it's related to corporate event but this was hidden in the paragraphs. So I did, got my shirts and shit dry cleaned and ready to go. Came back, submitted my expense report and a few days letter I got a call about the dry cleaning bill. They said they don't cover it so they can't reimbursement me. Oh hell nah... I got out the reimbursement policy and screenshot the dry cleaning part and shit it over via email. \n\nGot a reply a few hours later... Approving my $70 dry cleaning expense\n\nThe next year, they had the dry cleaning bill removed. Bitch!",
            "did the bus not have an option for a season ticket or something?",
            "We live so close to the airport that it is cheaper for my husband to Lyft there/back rather than parking at the airport for even an overnight trip.  His company will not reimburse him $15 in Lyft fees (their response: have your wife drive you - f that, I work, too), so he expenses hundreds of dollars a month in airport parking fees.  Total insanity.",
            "I used to work for a place that had a meal allowance that didn't require receipts.  If you were traveling and were eating meals outside you got a set amount per meal WITHOUT a receipt (Let's say it was $10 for breakfast, $20 for lunch and $30 for dinner as an example).\n\nWhat I liked about this was that those extra things like bus fare or if you forgot your toothbrush were absorbed by the fact you probably didn't spend your entire meal allowance.\n\nEqually, if you were careful with how much you spent on meals you could either make a profit or, what I did, have a big steak dinner one night.  Either way, they just gave you $60 a day for food no matter what.",
            "I can see how this can happen. A \"must have receipts no exception\" rule is pretty reasonable, it reduces fraud and normally isn't all the onerous, I think everyone who's ever travelled for business is used to this. Transit fares are one of those weird times though that falls through the cracks, your use in particular. Normally if you get day or week passes you can get a receipt, or if you go up to a staffed booth in a metro or something. All things considered the $500 probably wasn't too expensive a lesson for them for a week long trip. I don't know what your bill rate / hour cost is, but that's probably less than 5 hours of cost, over the course of a 35-40 hour standard work week. For that cost though you might have been better off renting a car.\n\nBus fare should be pretty easy to claim as an exception, the fare is publicly posted, and you didn't claim any other means of transportation.",
            "A prior employer wouldn’t reimburse grocery store receipts when traveling. I would try to make my own meals when traveling, but they wouldn’t do it. \n\nI would find the most expensive ‘healthy’ restaurants in the city I was in and max out my breakfast/lunch/dinner budget. \n\nWhen we reviewed our expenses for the year, they were super pissed how much we’d been spending on food. I pointed out the grocery store rule, but they STILL WOULDN’T FUCKING CHANGE IT. \n\nThe entire last year I was there when I’d travel, I maxed all my expenses out. Fucking dumbshits",
            "I work for a Fortune 500 company.  We have a required receipt policy for all company credit card charges.  Traveled internationally and purchased a drink from a vending machine with a charge of $0.25 USD (a quarter) to the credit card.  Policy requires a receipt or a form filled out stating reason for no receipt.\n\nSo I spent ten minutes taking car of this .  So it cost them more (I make more than $1.50/hr) for the form than the actual spend.  And since it was a CC charge they already had the information from the \"Vending Machine Corp\".\n\nIt was not even a cash transaction.  \n\n&#x200B;\n\nAnd a few more people will have to review it and approve it - and they get paid more than a $1.50/hr too.\n\n&#x200B;\n\nThe world is going paperless, and we need paper copies of electronic transactions, that we then scan and make electronic.  I think someone owns stock in Dunder-Mifflin.",
            "I had the same problem. I used to business travel a lot and the company I worked for wouldn’t reimburse me for the train ride to or from the airport because I couldn’t provide a receipt. They would however, reimburse a taxi. \n\nI bought a pad of receipts from a taxi driver for $5. Then I would take the train to the airport for $2.50 and submit a taxi receipt for $60. \n\nFuck ‘em.",
            "My company has a similar policy in place, but it's $25 or less with no receipt. This is only allowable only once in per pay period though to discourage fraud and abuse of the system. At the same time, when we claim it, we have to include details as to what the items are and why no receipt.",
            "After reading a lot of these comments, I sure am glad that my company has a \"no receipts\" line in our traveling expense reports. It covers cash tips and smaller expenses. We're also allowed to submit credit card statements in lieu of a receipt in case one goes missing.",
            "Would they have reimbursed a transit pass? \n\nGet a receive for reloading the pass, or if there are preloaded cards, send the card in as the receipt?",
            "Such a great example of malicious compliance. I had a very similar thing where I would have been able to save the company ~$900 in hotel costs over 3 days, but the hotel wasn’t a preferred concur hotel and policy clearly stated only prefered hotels. \nFine, the expensive Hilton it is",
            "At my work (government), we have to get quotes from 3 separate vendors for every procurement. If what we’re buying is covered by a contract, then the quotes have to come from vendors for that contract, and they are all bound to the prices agreed to in that contract. So you usually end up with 3 identical quotes. And if one of the quotes is lower than the others because the vendor is running a special? You have to reject that quote because it deviates from the contract.",
            "I had a similar situation when traveling. I was lazy and hated lines, so instead of going to Starbucks for breakfast, I went to a grocery store and got instant oatmeal and a few other things. Was about $8 for a week’s worth of breakfast. Expense was denied due to it being “more than one meal”. I then had Starbucks every morning at about $14/day, which was totally fine per policy.",
            "Damn, how chintzy can they be..We drop a miscellaneous expense line for our road team and there aren’t any limitations. $1.50. lol \n\nIt sounds like you’re maybe a technical person not accustomed to getting around on a business trip. btw..$70 will get you door to door in a limousine. next trip tell them *I need walkin’ around/booze/hooker money..cash please*. good luck with things :)",
            "We get tickets that show the date, time and price paid on all buses here (UK). Is it not the same?",
            "[deleted]",
            "You could've rented a car for way cheaper than $80/day, and your trip would've been much more pleasant.",
            "I was looking in the comments but i found nothing, so i'll ask:\n\nWhat Country are you from?i\n\nIn Switzerland (and most of Europe from what i've experienced so far), there's always a ticket/receipt for public Transport. I've ridden buses in at least 10 european countries and i wouldn't recall a ride where i didn't get a small Paper ticket with at least the price and date on it...\n\nEdit: Now I'm thinking about it, i Find this kinda weird... How does this work? You enter the Bus and give the driver 50 Cents?\n\nHow can you be sure that your Money goes to the Bus company, and not the driver's pocket? How can you even be sure if you're paying the right amount, and the driver isn't ripping you off? It seems weird to me that a bus company wouldn't give out Tickets.",
            "A friend I know works for a construction company. One of the projects they worked on was ordering stone from China and needed samples, so when one of the workers went to inspect them, he bought an $80 briefcase to take the samples back to the US. The samples weighed close to 50 lbs, would have cost hundreds to ship, and taken weeks to get to the customer. When they added the briefcase to the overall total, the customer denied it call it a personal cost and refused to pay for it, even though it saved them time and money.",
            "Had something similar. I was traveling out of town for a week for a conference. This conference happened to be in the town where my cousin lived. My cousin offered to put me up for the duration of the trip. As a thank you I got my managers approval to buy her a nice dinner on the company dime. A $50 restraunt bill instead of an $800 hotel bill? Good deal.\n\nConference ends, I come home. Hand in my expense report. A couple of days later, HR comes to see me. Apparently, they were not happy about me buying an expensive meal. And I got lectured about being responsible with company finances. I explained what I had done and that I had gotten my managers approval. They did not care that I had no hotel bill. Just that there was a pricey dinner.\n\nOk. Next time I won't try to save any money.",
            "You must really like your employer. I refuse to take anything bar taxis, no driving, no busses and no trains.",
            "Nothing like a little MC to bring about the greater good.",
            "$10 each, or $10 total?  $15 total would still not qualify.",
            "You tipped the taxi 25%!?",
            "You're incredibly generous, most people wouldn't think twice about taking an Uber or cab for work versus public transit, you gave them a chance to save a ton of money and they blew it.",
            "But isn't the ticket itself enough?",
            "You'd think they could take the fucking bus pass itself as a record of your ride",
            "I wonder if that’s going to hold up after the next audit.",
            "Uff! I always love a malicious compliance that changes company policies.",
            "They would't rent you a car?  Also, your company allows public transit?  Internationally I'm provided a driver and advised to use my driver or Uber if on personal time; domestic travel always allows for car rental.  Our non-driving employees are advised to use a car service or Uber.  It's a liability thing that we're not allowed to use public transit during company-related travel on business trips.",
            "This sounds really familiar",
            "The returning post",
            "[deleted]",
            "What about the little paper bus ticket that prints out when you pay? Is that not a receipt of purchase of the ride?",
            "My company requires a receipt for everything, but transportation under $20.  We have an expense web portal. If you choose transportation for the line item then it has different rules.",
            "When I had a job that required staying out of hotels for extended periods of time, I ran into the same thing on $1 coin op laundry versus $10 full service wash and fold.",
            "My company is chill I have a check box that says “no receipt” just submitted a months worth of laundry at hotels and it was approved with no problem.",
            "Back in about 2015 my old employer changed from “no receipt needed under $25” to $75 if it was on the company card. They realized it just wasn’t worth the time and aggravation for employees, and they also had way too many people turning in expense reports 2, 3, even 4 months later because it might take you 2 or 3 hours to sort all the receipts from a 2 week trip, and you had people making $150k, $200k per year spending their entire Monday morning after a trip working on expense reports. People you’re paying $100 an hour to scan $31 meal receipts 1 by 1, email the scan to themselves, save and name the pdf, upload it to Workday or Concur or something, etc. Of course they’re too cheap to hire enough admin assistants to do all that, so they just did away with little receipts if stuff was on the card and got the card issuer to take care of digital receipts or whatever.\n\nIt was a glorious improvement in my life!",
            "Could you not use the passes? Our public transit here prints out a paper card that identifies the type (single pass, day pass, etc.) I think it even states fare on it.",
            "The ticket isnt enough for make a receipt ?",
            "I just discovered my new favorite subreddit",
            "Programmer here, what if it costs exactly $10.00?",
            "Must be tired. I misread bus fare as bus fart....",
            "Time to make the company pay for some coke and meth.",
            "I am actually surprised that only 500$ was needed to get it changed.",
            "I’m in a similar situation. The company I work for pays for mileage at a 0.55c/km. I have offered to take the metropolitan train which would mean a longer commute time wise, but only a $20 charge for the round trip (and more comfort for me, because long road trips suck). I asked if they were willing to reimburse the bus fare. They said no... so I drove, and it cost them ~$60 in mileage. And I would be able to provide a receipt for this train ride too! So silly.",
            "And so for the next step, get a monthly card. More than $15 bux, but still way less than the daily fare for the month. And you will get bus transpo all month, not just for work.",
            "Better question: Why were you staying a $40 one-way taxi ride away from your training?",
            "I mean where I live, the company should be able to justify **every** payment for the bookkeeper so it is normal that they can’t reimburse you for things you don’t have a receipt for",
            "Yeah I’m surprised you couldn’t use the bus ticket as proof? Or your bank statement if you were able to pay with card?",
            "I wonder if this will work at county offices. I have people who take the bus to get to doctors appointments and it's consider a medical expense. They don't get receipts from it so I'm not sure how to help them. :(",
            "Seriously where do they find these people. As a senior manager how can you be so rigid in your thinking? Cause it seems like this is a common issue where trying to be a cheap as possible costs more then being reasonable.",
            "Would you not get a bus ticket to use as proof of taking the bus?",
            "Good on them for pinpointing and addressing the problem.",
            "Costly compliance.. I dig it.. especially since it forced them to change their policy. I guess they realized that if you could do it, a whole bunch of others could do it as well and cost the company a fortune. Good job.",
            "This is why my company doesn't require receipts under $75. You're encouraged to be more responsible with company finances this way.",
            "Probably the best story I have read in this sub. Take my upvote.",
            "Couldn't they accept the time stamped bus tickets as a receipt?",
            "OFFS!!!!!  Who the fuck is running your damn accounting department and have they ever fucking heard of petty cash, employment laws, and thresholds?  Well, I guess they have now.  LOL!\n\nDon't think that you are alone in this.\n\nStupidity, it's a thing.  Sigh.",
            "My work has finally allowed air bnb to be used instead of hotels after refusing to allow it for several years",
            "Another option in cases like this is to attach a PDF of the fare list and the bus route. Some business will accept it. It isn't a receipt but it's proof of how much the fare costs you and the route you took to get to the location.",
            "Amazing how that’s works! 😁 Sometimes you just gotta play their game until they see the light!",
            "Anything over $10 is really extreme. We have ours at $75, but most companies at least give you some more wiggle room.",
            "Same with my company on transportation costs.  They get it.",
            "Work elsewhere.",
            "Why wouldn't you buy a bus pass, for which you'd get a receipt and a reimbursement? I smell bullshit.",
            "That is the way things are supposed to work. Those heated arguments were mainly about why your boss thought it was Ok to tell you to pound sand about your travel expenses. That was not his call to make either.",
            "I like this one",
            "but the bus would have cost $15 so you would still need a receipt",
            "IRS rules say anything under $25 doesn’t need.  Just have to note what it was.  \n\nCould just use a post it with $5 bus fare to event, and Another $5 bus fare from event.      Someone was slacking at their job.",
            "\\>  Problem is, there's no way to get a receipt for riding the bus. \n\nEvery bus system I've been on they can give you a \"transfer\" and every employer I've worked for will accept that as proof.",
            "One of the cool things with Uber is you can set up a personal and work profile on the same app and they will email a receipt to your work email.  I've done this a few times and it makes it super easy to do my expenses.",
            "This is our policy too. We need the receipt, or else no reimbursement. I'd have to talk to my boss about doing the same in case of bus trips without receipts.",
            "This is maybe my favourite thing ever",
            "In my city if you bought a block of rides (like 10 rides) you can get a receipt, but if you pay by cash on the bus, then no receipt. Thats what I would have done if I was really really into non malicious compliance. Which I'm not.",
            "There's no way to have a bus card and fill it? Like it's possible to get a receipt like that and is often cheaper than paying every day",
            "Ok but how long until you got fired?",
            "The best part? That $500 probably took up at least a dozen hours of senior management time. Time they probably bill out at $300+ per hour...",
            "And this is a great example of why the new trend of putting number crunchers in positions that are both CFO and COO is bad.",
            "They would still need a receipt.  $15 is still over $10.  That company needs  new management.",
            "I love when stupidity is presented a mirror.",
            "I like the story but the receipts needed for reimbursement makes complete sense.",
            "Man, we just get bus tickets that serve as receipts here in the UK.",
            "Just fraud the receipts pop",
            "It's been a while since I used transit...\n\nI've used the transfer slip as a receipt.\n\nI've been in transit systems that have \"business passes \" - essentially Mon-Fri passes,  and monthly passes,  both of which are purchased with receipt. \n\nI guess none of that worked, but why couldn't it?",
            "I live in a different country so there might be differences, but do you not get a ticket for bus rides? this should count as a receipt as there's day and time when the ticket was bought written on.",
            "Isn't your transfer \"proof of payment?\" Do they not give transfers where you're from? I'm not sure how it works where you are, but here if you buy a monthly pass or a pack of bus tickets, you get a receipt from the shop you bought it from. If you pay cash fare, you get a transfer as proof of payment.",
            "I don't get it. Didn't you get your tickets while riding a bus?",
            "Couldn't they take the bus ticket itself as a receipt? Or was there no physical media involved?",
            " Couldn’t you have just bought a week-long bus pass and submitted the receipt for that? I feel like most cities offer those",
            "Wouldn’t you get a ticket ?\n\nCause that counts as receipt for my company",
            "I wonder, why doesn't the bus give receipts? How do you know you got a fare if there is someone checking?",
            "love it",
            "A lot of companies don't require receipts for any amount under $25 any more. The IRS doesn't have the manpower to audit thousands of $5-$15 dollar receipts and if the tax man don't care the smart companies don't either. \n\nUnless they really distrust their employees which is a totally different problem.\n\nOTOH God save us from the bean counters. \n\nI worked for a company that had me pay $90 each way for a cab to and from an airport that had me paying about $45 less ($90 )round trip for air fare. Plus they paid me an extra 2-3 hours more travel time to and from the airport when there was one only 30 minutes away but the airfare was higher. \n\nAnd because ground transportation came from a different bag of beans than air fare and my time was operating overhead this all must have \"sounded like a good idea\" to somebody somewhere back in the mother ship.",
            "I’m honestly surprised.. in Perth (Australia) if you don’t have a multi rider (a plastic card you put money onto to use public transport), you can still pay cash or card and it gives you a ticket with the amount that was paid :/"
        ]
    },
    {
        "post_id": "awpgv6",
        "author": "Greedence",
        "title": "Need a doctors note for the flu...doctor delivers.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/awpgv6/need_a_doctors_note_for_the_fludoctor_delivers/",
        "score": 16325,
        "num_comments": 643,
        "created_utc": 1551579959.0,
        "selftext": "It was about 2 months after my 1 year anniversary at my last job. I caught a nasty flu around Christmas. \n\nI called into about the flu. They wouldn't accept emails even though I couldn't speak. On the fourth day my work required a doctor's note. I didn't want to spend the 100 dollar copay for a doctor to tell me rest and fluids.\n\nLuckily I had a good general doctor. So when I called him he sent me a PDF I could forward. \n\nIt stated Greedence has the fucking flu. He needs time off to recover and will come back when he is healthy enough. Greedence is not a grade schooler and should not need a doctor's note when he is sick.\n\nMy VP tried to call me on when I would be back but I kept directing her to the doctor note.",
        "permalink": "/r/MaliciousCompliance/comments/awpgv6/need_a_doctors_note_for_the_fludoctor_delivers/",
        "comments": [
            "I’ve seen one before that said something like  \n\n‘xxx has a cold, and wisely chose to stay home from ‘date’ to ‘date’ so he would not spread it around his workplace.  I support this decision. \n\nUnfortunately, you do not trust his testimony and as such he has been forced to attend my clinic, which is filled with vulnerable members of the public, in order to procure proof.  Please review this policy.’",
            "I like your doctor.",
            "When I was off for a week with gastro my doctor said I had industrial diarrhoea",
            "[deleted]",
            "I had a doctor like that he knew my mother and had worked with her various times over the years. Anyway, when I was 15 I broke my jaw and have plates put in and have arthritis in what's left in my jaw and cheekbones so there are times I can't talk or do anything other than take painkillers and sleep which doesn't work well if you work in a call centre which I did at the time so after 3 absences in a 6 month period they demand a doctors note which I get organised. My doctor puts at the beginning \"Hesitatedeye suffered a bilateral mandible fracture which required maxillofacial surgery and severe tension on 4 different occasions in the last 5 years.\" It was hilarious watching my boss, the HR lady and the witness for the company pull out a dictionary to translate it. I knew what he had done and why he did it and just like OP's doctor, he was one of the good ones left at the time.",
            "He sounds like my old Physician - Sicilian Italian, all the way. Boy, you don't cross swords with him or he'd light you up with some of the spiciest profanity you ever heard. He had zero tolerance for bureaucracies and would send some nasty-grams for sick notes to the 'crats.  You knew they were from him, their fax machines would be smoking.\n\nWhen the clinic got bought out, he left and went into taking care of the needy down south in Central America.  I'll miss him.",
            "Do you get sick pay at least with the note?\n\n\nHere in Germany you need a note on your third sick day, sick pay kicks in then for up to 6 weeks and after that your health insurance pays most of your wage.",
            "Doctors of Nova Scotia came up with a pretty great letter for physicians to use:\n\n“Request for medical/sick note: Letter to employer\n \nNote: The below content can be cut and pasted, and modified to suit the individual physician.\n \nDear Employer,\n \nOne of your employees visited me to obtain a medical or sick note to satisfy your company’s absenteeism policy. Employers with a sick note policy for missed time put an added burden on the health-care system.\n \nPeople seeking sick notes – who otherwise wouldn’t see a doctor – end up in physicians’ offices, walk-in clinics and emergency department waiting rooms. There, they may spread germs to pregnant women, frail elderly people, cancer patients and babies – all of whom are vulnerable to communicable diseases.\n \nIn most cases, the best remedy for a patient with an isolated illness (such as a gastrointestinal virus, influenza or a common cold) is to stay home, rest and drink fluids. Visiting a doctor’s office or an emergency room for a medical note does not support their recovery. Sometimes, employees seek a sick note after they have recovered from their illness, so I have to issue a note based on trust.\n \nEmployees seeking sick notes reduce access for those patients who really need to see me, and increase the three to four hours per day of paperwork that I do already. Both have a direct impact on patient care. In addition, providing medical notes is a non-insured service, not funded by Medical Services Insurance. I find it difficult to charge my patients for a requirement demanded by their employer.\n \nIf you continue to require a physician to authorize your employees’ absenteeism, your employees must submit a written request from your organization for the medical note. Upon providing the service I will invoice your company $_____ per medical note. This is standard practice to fulfill non-medically necessary services for third-party organizations.\n \nAs Canadians we are lucky to have our health-care system, but citizens’ inability to access the system’s services in a timely fashion is a growing problem. Health-care providers, business operators, governments and individuals must work together to ensure its sustainability.  \n \nI hope you will consider changing your current absenteeism policy to help reduce the unnecessary burden on our health-care system and improve access for all Nova Scotians.\n \nSincerely,\n \n \nPHYSICIAN SIGNATURE”\n\nBam, peanut butter and jam!",
            "My dad’s employer has this shot-in-the-foot policy where you can’t take off any time without a doctors note. So you have people that would’ve taken a day to rest and gotten back at it that are forced to go to a doctor, and if they’re gonna do that they might as well try to get extra days. ",
            "My work has been throwing fits when I'm scheduled on a food station during rush because I'm not fast enough and moving me back to my normal station... And then when I explain before hand next time that I have fine motor issues and I cannot physically go any faster, I'm already trying.\n(\"Hey, I'm not great at STATION, I don't want to slow us down at rush\")\n\nThey get huffy and refuse to believe I'm not just whining and being lazy.\n\nSo I'm having my doctor at my next visit write a very pointed note, that next time they pitch a fit.\n\n\"Box has fine motor issues related to a genetic disorder and it is reasonable to believe that fine motor issues will prevent fine motor related skills from being performed at high speed\" \n\nI'm requesting it be as rude as possible ",
            "Vomiting in the front office is my method of choice to get the word across, especially if it's projectile.\n\nPlus, you got paid for that short transgression.\n\nIronically, getting out of school takes way less effort than getting out of work. Maturity or something.",
            "My work has a policy like that, if you don’t have any sick days to burn. The kicker is that regardless of your sick days and what your doctor’s note says, if you’re out for more than 3 days in a row, you have to go through the process of applying for FMLA leave. I got the flu last year and only had 1 sick day left. I was out for a week with a doctors note... I had to apply for FMLA leave, then short term disability, and got denied for it like 2 weeks after I had returned. Like I understand that you don’t want guys pretending to be sick for a vacation and shit, but the fucking doctor told you I have the flu, and that’s not a disability. It’s an illness that happens to take more than 3 fucking days to get over. \n\nBonus bullshit: we have to bring in an obituary if we miss work to grieve the death of a family member. ",
            "This is giving me flashbacks when I had the flu.. I called in sick every day and after 3 days got told to get a doctors note. I went to the doctor and we discussed how long he should write that I needed off and we settled with 2 weeks. I still got calls from my boss telling me what an inconvenience this was. When I finally came back my first day I had to attend a meeting. My boss noticed I had lost weight (10lbs and I was already skinny) and was still pale and had the worst cough (I probably could’ve taken another week off tbh). “Wow! You really were sick!”. \n\nYep having the flu turn into bronchitis will do that to you.. I’m so happy I don’t work there anymore. \n\nYou have an awesome doctor! ",
            "All these people needing doctors notes to stay home when sick, I had to get a doctor's note saying I was no longer sick/contagious before my boss would let me come back to work.",
            "I worked for a hospital and they required a Dr. note if you got sick. ",
            "My school doesn't even need a doctor's note. It's just \"you say your kid's sick? Okay, we trust your judgement\".",
            "I work *at a primary care clinic*. I have been asked to work when I've lost my voice, as well as when I have had vertigo to the point of vomiting.\n\nMy practice manager still demands a sick note from me when I call out.\n\nMy doctor works at the same office I do.\n\nTherefore, I have to come into work, have an appointment, ask my MD to write the note, then print it out, walk back to my PM's office, and hand it to him.\n\nAfter the second time my MD said \"For God's sake, just text me from home and I'll have my medical assistant write it up and forward it to the PM.\"\n\nI love my doctor. I don't really love my work sometimes.",
            "Growing up military, I had a doctor that constantly was transferred when, and where, my dad was. She was a sweet lady, barely 5 ft tall. Weighed maybe 150. Tiny. But damn, whenever my school gave me problems for missing days due to illness, she’d tear into them via a note that my mother would never let me see. I did catch a glimpse of it once, and I learned that day... tiny women are terrifying. ",
            "I was so poorly and run down a few years back, that I was sitting on the floor at work, no energy to move, in pain in my throat and head, but my manager kept saying I couldn't go home becuase there was no staff to cover me. I worked in child care at the time. The next day I had my mum call in to say that I wouldn't be in because I knew the manager would try to talk me into working. They wanted a doctors note straight the way. Even though a note was required  after 3+ days being off. I managed to get an appointment and told the doctor my symptoms. I had Fanryngitus, basically tosilitus without tonsils, and an ear infection. I asked for a sick note and told the doctor that my manager would try to convince me to work and had an air of not believing I was poorly. He took out his sick note pad and said \"How long do you want off?\"",
            "This is great. I would love to see the actual wording the doctor used on the note.\n\nEdit: I suck at writing",
            "My eyes got super dried out and I didn't see or drive for a couple of days. The optometrist wrote me a note for work. They made me work outside on a cloudy day. My manager told me that it wasn't sunny enough for me to wear sunglasses. I called up my doctor who laughed, the sun's rays are always out. He wrote me a note saying that and added a giant picture of my eyes to it as a little f you too the man. ",
            "Yeah this policy pisses me off at my own job too. If we call out on a holiday or even if we’re at work and we’re too sick to finish our shift we have to have a fucking doctors note. I work at a damn hospital and you know what we tell people with the damn flu? Stay home and rest, don’t come to the damn doctor. I get that the reasoning behind this is to prevent abuse of calling in, but some logic people come on...if I’m going home early because my temperature is 103, I don’t need a doctor to tell me OR you that I’m sick and I need to go to bed and take Tylenol, thanks.  \n  \nI’m not bitter, you’re bitter...😒",
            "In my opinion, what's infuriating is not only the need to get a sick note to use time you've earned, it's also the need to do a song and dance for a doctor. You're doctor seems like an ok guy that would give you a sick note if you asked. \n\nI've had experience with ones who want to interrogate me as to how often I've been in and how much sick time I've used. \n\nI really wish I could be honest with everyone and either tell my job, \"I work my ass off for you guys and I don't feel up to coming in\" or tell the doctor, \"My bosses don't consider me an adult. Just write something down so I can leave.\"\n",
            "Last place I worked for refused to acknowledge doctor's notes if you called off for a sick day, they also got rid of sick time altogether which we used to be able to put in and get paid for. So your options were go into work sick and get sent home with no pay and take an attendance point or stay home with no pay and take an attendance point...  guess which one people chose to take... yet they bitched about people not showing up for work during flu season ",
            "Had a similar doctor back in primary school... my grandpa. He has a practice around here. I went in. He was so mad about school wanting a doctor's note (pneumonia) he excessively sweared in the note and then called up the superintendent to complain. Lucky lucky my teacher and Vice Principal got fired the next week.",
            "$100 copay?  Yuck. I don’t mind having lots of different insurance companies but they need to be more regulated. Something like copays can’t be more than $35.  Maximum out of pocket for a year can’t be more than $3000. ",
            "Ugh...not only did my husband have to have a Dr note, it had to be on their special form, and then be faxed into the main office...granted it was for FMLA, but was still a huge pain in my behind, because guess who had to get everything done since he was sick in bed?",
            "Is your doctor accepting new patients? I need that kind of MD in my corner.",
            "I hate the hypocrisy of some bosses.  They tell you not to come in when you’re sick and then complain when you call in sick.",
            "Ours requires a Dr's note day of calling in, and it's up to us to get the shift covered. So instead of being in bed resting or in the comfort of your own bathroom, you spend your time around other sick people to pay someone to tell you what you already know, all for a stupid sheet of paper.\nI wish I had your Dr. ",
            "I'm self-employed and my jackass boss always requires a doctor's note. I told him to toss off once and he fired me. Had to hire me back within minutes because I'm the only person in the company that does any work. ",
            "So a bit off topic but. Do doctors need doctor's notes? If they do can they just write \"yep I'm sick\" and have it be an acceptable response?",
            "I love when doctors do that. My surgeon wrote me a note for accommodations at work and he basically said \"these accommodations do not expire because SHE HAS RODS ATTACHED TO HER SPINE\" \nThis was after he found out the medical staff made me make an appointment and wait a month just for him to write it. ",
            "Still got that PDF somewhere? ",
            "It's not about what you have. Management shouldn't care about diagnosis. They want to know,when will you be able to come back and with what restrictions if any. That is the purpose of a note. At least in my country, also not America so we don't have to pay an obscene $100 for a walk in clinic. WTF is wrong with your county?\n",
            "*Swish* and the crowd goes wild for awesome doctor of the year!! ",
            "The real heros (the doctors)\n https://globalnews.ca/news/1731189/should-bosses-have-to-pay-for-your-sick-note/",
            "I had a doucheboss that required Dr notes for everything. I got furious when I called out sick for 2 days with a respiratory infection only to have to drive to the nearest minute clinic and pay to be told I had a respiratory infection.\n\nFuck that boss. I celebrated when he got fired. ",
            "Doctor’s notes are not always because an employer/boss is being a jerk. It’s often because the company follows some sort of security framework that stipulates that X policy is followed if their employees are out for N days. \n\nDefinitely not fun, but just throwing out there that it might not be a case of someone being a jerk.  ",
            "As a retired nurse. Sick was not an excuse. If you were breathing you were required/expected to show up.\n\nDidn't matter that you were contagious as all get out. As long as you weren't working NICU, you HAD to show up.\n\n",
            "That is an AWESOME doctor!  I love your doctor.  lmao...",
            "My work place has a no fault policy when it comes to absences. We earn two points a week of perfect attendance. Up to 96 points. And absence takes away 8 point. So if you miss 2-3 days that could be 24 points. But if you have a doctors note, you only get pointed for the first day. Any other days you take off that are in the doctors note, don’t get pointed at all. ",
            "This! I’m a PT and workman’s comp made them get proof he was there with me but didn’t accept the receipt for his registration as proof and wanted me to type out what we did EVERY TIME. Thing is sometimes i don’t chart until the end of the day so I wrote a letter stating if they want me to do this every time I’ll bill them for each one and left a number.  My patient said I didn’t have to do it and the receipt was enough the next visit. ",
            "My work does the same thing. 3 days and you have to get a note to work again. Then at the beginning of the year we sign a safety meeting about being sick. It said you must stay home if your sick until your fever breaks  for 24 hrs with out medication. ",
            "My doctor just has a stack of pre signed doctors notes that the receptionists will hand out if you ask no appointment needed.",
            "Jeez, do you all live in dictator countries? In the UK you self certify for 7 days and then on the 8th day you need a sick note from the doctor.\n Legally you need to tell your company the first day you are ill and then again on the 1st day you require a sicknote as you cannot work if you have been signed off sick.\n\nCompany policies dont always follow this rule. ",
            "In Germany your employer gets money back from your (mandatory) health insurance. So not getting a doctor's note on day one is a dick move.",
            "That wouldn't fly in Belgium. The doctors note is a legal document excusing you from work. If you don't have it it's unpaid absence.",
            "Every place ive worked at (Australia), if you have 2 or more days off my workplace requires a medical certificate or if your sick the day before or after a public holiday. Kinda just means atleast your getting ontop of your illness or atleast have something wrong rather than going on a quick holiday.",
            "Greg House, M.D.",
            "Wait, I though it was normal that you need a doctor's note after 3 continuous sickdays? (Am German)",
            "My old family doctor before he retired helped me out in a similar way. I had the flu in the worst way and my boss wanted a note. I managed to drag my ass to the dr. He looks at me and says, you have the flu. Go home and get rest and plenty of fluids. When I told him I had to get a note or I would be fired he got pissed and called my boss.  I clearly remember him telling my boss a note will cost $25 and asked how my boss would like to pay. He tells my boss that since you require him to have a note for employment then he is responsible for the note payment. Never had to get the note in the end and I quit that job a.couple years later and never had to show a note ever ",
            "Years ago I worked for a large company. 5 months pregnant, I came down with the swine flu (a particularly nasty flu that year). I got double ear infections as well and had 103 to 104 fever for over 5 days. I felt like I was going to die. Sickest I've ever been. I missed one week plus a day of work. They required Dr's note, in which he wrote that I was \"one sick puppy\"\n\nFirst day back to work my Supervisor and the dept. Manager called me in and were grilling me about \"how sick could you really have been\" and the Manager was going on about how he had never taken a sick day in 8 years.\n\nWithin 3 days they *both* got this flu. Manager took week and 3 days, Supervisor took same as I had.\n\nHahahahaha... my comment to them when they came back was \"oh, gee, bet you thought you were gonna die. So, so sorry you had to suffer like I did\". Hahahaha!!!! Not instant karma, but karma at its finest none the less.  Did I say \"hahahaha\" yet?\n",
            "I had to work for a company that did this crap because they had attendance points and all that. Glad those numbers don’t get to hang over my head anymore. That doctor is legit.",
            "Ironically, the only time I had to provide doctor’s notes for being out sick was when I worked for a huge international firm.",
            "I needed a doctor's note when I got the flu the day after Christmas. The doc saw me and told the person not to charge me and gave me my note. ",
            "Is he accepting new patients?  I’ll move to wherever he’s at. ",
            "Found the new GP! Change to him if you haven’t already.",
            "GPs must be so sick of issuing med certs ",
            "Any time I've needed a doctor's note (UK) I've not been able to get an appointment quick enough.\n\nYou can self certify for the first so many days, but usually get met with \"we have an appointment in 2 weeks\" when trying to get to the doctor.",
            "I got the flu pretty bad in college when I worked as a waitress at a certain chain Chinese restaurant I'll just call D. F. Bhangs. Can you imagine allowing me near food? And everyone in that restaurant?? I called out and they told me to come in or lose my job. My exact response: I guess I'm too sick to ever work again. Take me off the schedule.\nI never showed up ever again.",
            "A doctors note? When I don’t have insurance? Ok. You pay for it. ",
            "My company has a similar policy but I think it's up to the manager's discretion whether to ask for a note. So if you're a generally reasonable, trustworthy person they won't ask for one.",
            "> On the fourth day my work required a doctor's note.\n\nOn the fifth day I started submitting resumes to ethical companies.",
            "My doctors notes are in this format\n\nThe office of Dr mcdoctorface\nHospital clinic \n\nCity, state\n(555)xxx-xxxx\n\nTo whom it may concern, \n\nAAA515 was seen on xx/xx/20xx, it is my medical opinion he/she should not be at work atleast until xx/xx/20xx or later.\n\nYou may contact our office if you need to.\n\nDr McDoctorface\n\n\n\nUnintelligible scribble\n\n",
            "I was sick with the flu when I was in Basic Training.  Drill Sergeants wouldn't believe me until a medic pulled me off a firing exercise and took me to the hospital.  103 degree temp.  Stayed in hospital for 3 days with IV fluids. Within 3 days of getting back to my unit half the platoon was out with the flu.  That was in the 80's.  Seems nothing has changed.",
            "I'll take \"Situations that could never happen in the EU\" for 300 please\n\n",
            "If I get a Doctors note, it only states I was not fit to perform my duties at work and when I am able to resume them again.   Never will it say what my illness is.  If there is a restriction required, it only states my limitations.  Not the reason why.  And if my boss hints around asking what was wrong..... beware!  He will get told off or surely embarassed.  Then a professional complaint will be filed.  Some of what I am reading here is awful employment practices. I am sorry for you all.  ",
            "My obgyn was shocked at the fact that I needed a note to show that I did in fact go to see her during a shift. So she wrote a very passive aggressive note and charged my manager the money it would have cost me for the note. She knew he wouldn't pay, but wanted to make a point. He was irked. ",
            "In 2011 I worked two jobs. I got a call from the night job (which paid slightly more and I enjoyed a whole helluva lot more) to work this particular night.\n\nId already had numerous issues at my day job mostly centered around some pretty serious bullying. I called in sick with the flu, 10 mins before my shift started. They demanded a medical certificate, to which I explained that, as a casual, I'm not required to provide one, especially not for the only day I took off while working there 6 months, (3-5 days a week). However, they insisted.\n\nSo me being me, went to the medical center right beside the shopping center I worked in. The doc knew I wasn't sick at all, but when I explained the situation he gave me a medical certificate. \n\nHe asked me what to put on the certificate, and quick as a flash, I replied, \"Polio\". He did it.\n\nI walked back to the shopping center, while on the phone to my at the time gf, laughing about it. As I was walking in, the almighty CEO (of 4 small coffee shops, including a kiosk) walked out. \n\n\"Hey, you don't look sick at all!\"\n\n*exaggarated fake cough* \"Yeah, heres my certificate that you demanded.\"\n\nShe takes a look at it, starts fuming, but walks away cause she can't do shit. I quit about a week later, mid shift, when the chef deliberately sprayed me with water from the hose at the sink for absolutely no reason.\n\n",
            "Reminds me of when I was a manager at a movie theater. If you were sick, you had to get someone to cover your shift and if you didn't get your shift covered a doctor's note was required. If you didn't get a doctor's note, then you would be fired. Yeah it sucks, but that's the job.",
            "100 dollars for a doctor's note? Freedom can't buy you a healthcare system I guess 😂 ",
            "Y'all are acting like its ridiculous to require a doctor's note. But you obviously haven't manged people who will try to get away with lies. I had someone who told me they had to work from home, doctor's orders. So we went through the proper procedures to get the doctor to write out what accommodations they needed, we would work with them to figure out how to make it work. Nope, once the doctor saw how legit we were, he didn't fill out anything. Evidently, he never said \"you're required to work from home.\" \n\nNow my friend has someone who told her they were exposed to whooping cough so they had to be at home for 5 days. Nope, that's not how it works. If you're actually sick, sure, you can stay home. But we don't serve children so there's no real danger from someone who has simply been exposed to it. \n\nBut without a written policy, you can't call these fakers on their shenanigans. You have to treat everyone equally under the policy.",
            "I had to have a doctor's note every time for a single day of absence.",
            "Paging doctor badass on extension 2... Dr badass are you there? No? Must be writing letters again. ",
            "Ricky LaFleur?",
            "Omg, had a similar incident a few years ago.  I go into the acute care, wait forever to see the Dr, for her to come in and be a raging bitch to me because I'm apparently wasting her time.  Like fuck lady, I dont wanna be here either.",
            "Good doctor",
            "At my job, if I'm out for 3 or.more consecutive work days, I have to get the doctor's fax or email address, then I call a 3rd party, have them send a form to the doctor, the doctor fills it out, and then sends it back to them. Then that 3rd party approves my absence, and I get 0 points for that time. Saved my ass when I was out a week with the flu.",
            "Do you still have the PDF?",
            "> Greedence is not a grade schooler and should not need a doctor's note when he is sick.\n\nWorks when you are not getting paid when sick.",
            "Can you hook us up with your doctor?",
            "$100 copay wtf",
            " MY doctor was out with the flu last week ... it's going around their office.  So he didn't have a chance to call in blood work orders for knee to the local hospital ... I had to drive 35 miles to his office Friday morning to have blood drawn.... and only took a 30 minute lunch to make up for the 30 minutes I was late clocking in.  Saving my sick time for the serious stuff,  ya know ?",
            " MY doctor was out with the flu last week ... it's going around their office.  So he didn't have a chance to call in blood work orders for knee to the local hospital ... I had to drive 35 miles to his office Friday morning to have blood drawn.... and only took a 30 minute lunch to make up for the 30 minutes I was late clocking in.  Saving my sick time for the serious stuff,  ya know ?",
            "Had the same happen to me put I worked in a restaurant. My doctor just wrote a note saying I might have Mono and until they were sure I couldn’t go back to work. He cleared me after two days since I asked him to extend it a little longer so I had the anniversary of my mom’s death off. ",
            "It's pretty standard that if you aren't at work for more than 3 days that you need a doctor's note...\n\nIt's shit that they didn't accept emails and that isn't right but the doctor's note... Honestly if that's the hill you want to die on then go ahead, but having to pay 100 bucks for it should be what you are angry about.",
            "Love this thread. ",
            "It doesn't specify when you're no longer sick or potentially contagious to other people at work. They're going to terminate you one way or another.",
            "I have never worked somewhere that required a doctor's note for a sick day. And I've worked in mental health facilities, call centers, construction and office settings. Is this a new phenomenon?",
            "Sounds like dealing with Sedgwick.",
            "Last year my partner got the flu and used up all her sick days, she still had the flu and couldn't/shouldn't be going to work and her work made a big deal about how it's not appropriate to go over your amount of sick days. Shits fucked.",
            "My job has a list of demands for doctors notes. Date, address, phone number, Doctor name and signature, why you were there, date of return, it must be turned in at the beginning of the shift you returned, and can’t be emailed. I should also mention my work gives us zero sick leave. We aren’t even getting paid for this. And if you fail to follow one of those, well hopefully you weren’t out too long or you’ll risk possible suspension or termination. ",
            "One hundred dollar co-pay.  That has to be the worst medical coverage around.",
            "I used to work at a place like that. I'd come in knowing full well I was sick and probably contagious. And I'd cough and/or sneeze on my bosses desk as much as possible. One time I got the COO sick.\n\nThey realized that a much better policy is to force people not to come in if they are contagious and just let them work remotely. ( I work in IT.)",
            "Good on you and your doctor!  My doctor wrote a similar note to my boss once:  I worked in a grocery store as a cashier, and came down with pinkeye.  The doctor told me that I was one hundred percent not allowed to go to work because that would be a serious health code violation.  He prescribed me antibiotic eyedrops and said I should be fine to work my next shift in a couple days, but today's shift was out of the question.  Since I'd only be missing one shift and my employer didn't require a note unless I was missing three shifts in a row, I didn't ask for one.\n\nAs soon as I got home I called the store and told the assistant store manager (who was the manager on duty at the time) that I wouldn't be able to work my shift that evening because I had pinkeye.  She insisted that I come in anyway because they needed me.  I refused, saying that I wasn't going to be responsible for the store being fined or shut down, and she told me if I didn't have a doctor's note when I came in for my next shift I'd be fired.\n\nI asked my doctor to write a note, and he requested that I come pick it up at the clinic, if possible.  Turns out he had some very choice words for her.  He pointed out that she was knowingly ordering someone with a highly contagious infection to handle other peoples' food, and getting through the checkout line a little bit faster wasn't worth bacterial conjunctivitis or food poisoning so no one would thank her for it.  Said he was well aware of the company's policy on doctor's notes since many of his patients worked there, and she was way out of line requiring me to get one for a single day's absence.  Capped it off by saying that if she ever again demanded that someone under his care come to work after he explicitly told them not to, he'd report her to the relevant authorities himself.  Then he CC'd the store manager--actually wrote a CC: line on the note--and I agreed to deliver that copy as well.\n\nThe story doesn't really have a happy ending, though.  She continued to give me crap until I left for greener pastures, eventually got promoted to store manager herself, and as far as I know still works there."
        ]
    }
]