[
    {
        "post_id": "zc5eff",
        "author": "VivaIbiza",
        "title": "Restaurant only gives discount on phone orders, ok then…",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zc5eff/restaurant_only_gives_discount_on_phone_orders_ok/",
        "score": 16324,
        "num_comments": 852,
        "created_utc": 1670146298.0,
        "selftext": "I only live 5 mins walk away from a local pizza place so I went in and ordered direct to take away. I didn’t call ahead as I didn’t see much point as I lived so close and I didn’t mind the extra couple of minutes. \n\nWhile there I saw the were doing a special offer. 10% discount if you mentioned their promotion over the phone and then went in to collect take away. \n\n“I know I haven’t called in first, but now I know you do a discount if you do, and to save us both the hassle of me calling you right now and for the fact I know the promotion exists,  can I still get the 10% off anyway?”\n\n“No. It’s for telephone orders only”\n\n“Sure, I get that, but I could literally just call you right now from my mobile and you’d give me the discount but that’ll be a bit weird to make me do that, so can I just get it anyway?”\n\n“No. It’s for telephone orders only”\n\nThis jobsworth attitude pissed me off, so I was literally about to just forget about buying anything from there and go somewhere else, but as I got outside I figured that no, I’d just stand outside and call the number on their door and order a pizza that way to get my discount. \n\nThe phone rang and the same guy picked it up:\n\n“Can I order a pizza to collect with 10% discount please”\n\nHe recognises my voice obviously as it’s just been 15 seconds since we were speaking inside. He looks outside at me. I smile and wave. He looks pissed off that he has give me my discount now. \n\nHe takes my order and says it will be 10 mins. \n\nDuring the next 10 mins while waiting for my discounted pizza, someone else is about to come in the restaurant to order a take out. I ask them if they have phoned ahead for the discount or not. They didn’t realise that’s was a thing. No problem buddy, I’ll do it for you. What do you want?\n\nI call the same number again, same guy answers and hears my voice again and looks straight at me again. \n\nI smile and wave again and proceed to order this random strangers pizza order for them whilst maintaining eye contact with him. \n\n“My friend would also like the 10% telephone discount”. \n\nHe looks like he’s gonna pop a blood vessel but has no choice but to accept it. After all, I didn’t enforce the rules, he did. \n\nA week later, the telephone order discount is cancelled completely and it’s simply given if you have a menu, and there are menus in the entrance anyway, so you’d be crazy not to see it and use it.\n\nEdit: Well that blew up! Answering a few of the main questions here: \n\nThis happened a while ago, so the promotion wasn’t to do with google ads, or tracking info or storing numbers etc. It was just a badly executed promo that forced you to call to the very person stood in front of you already taking your order anyway if you wanted the discount. \n\nNo, not been waiting 15 years to tell this story like I’m some sort of legend and my life peaked at that moment, I read something else on Reddit yesterday and I was like “oh yeah, I remember something like that happening to me and I’ve never posted in MC before, so why not share?”\n\nThe guy behind the counter wasn’t a kid with management breathing down his neck. He may have even been the owner or manager for all I know. It was a small place and not a chain, and if it wasn’t just him there doing everything, then it was only him and the chef. So making me call him on the phone in front of him was him enforcing the stupid rule, I just complied with it. \n\nI agree, I risked a spat on pizza. I don’t suggest pissing off people who make your food. It was not something I was thinking of at the time though. \n\nI’ve also tweaked some text above for clarity as reasons why for not calling in first (lived super local and I’d only ever walked in, never called it before) and realise now that I didn’t know about the promo until there. That’s why I then asked about it. Thank you.",
        "permalink": "/r/MaliciousCompliance/comments/zc5eff/restaurant_only_gives_discount_on_phone_orders_ok/",
        "comments": [
            "I went to a tourist attraction and while queueing I saw someone with a printed out 40% off voucher. I pulled up the website it was from and had the voucher showing on my phone when I got to the counter but they wouldn't accept that it \"must be printed\".\n\nSo I sent my companions into the nearest cafe to have a drink while I popped into a nearby posh hotel, explained my problem to the guy behind the desk and asked him if he'd print it for me. He gave me the hotel email address, I emailed it, he printed it with an MC-appreciating smile, then 15 minutes later we all turned up back at the attraction with printed voucher in hand. Saved us about £50...",
            "When mobile phones were just introduced, I once went to get some food from the Chinese-Indonesian restaurant in our village. The line for ordering was extremely long, yet the lady behind the counter continuously picked up the phone and took orders from there. So I took out my super-modern mobile phone and called them while standing in line and ordered by phone while waiting in the ordering line. My food was ready before I'd have been able to order normally.",
            "[deleted]",
            "One time I my friends and I had gotten like 25 free taco coupons at taco bell.  They were \"one per visit\", so we pulled up to the drive thru and said, \"Listen, we're here to get 25 free tacos.  We can drive around this building 25 times, or you can just give us the 25 tacos now.\" Manager gets involved, says we can have the 25 tacos as long as we actually buy something.  Each of us gets a drink and we drive off with 25 tacos for like $5 worth of soda.\n\nI was a little sad we didn't have to drive around the building 25 times.",
            "I did something similar at a appliance parts store. I looked on the website to confirm the parts I needed were in stock, they were, so I headed to the store to buy them. I remember seeing the total price somewhere around $50 but when I get there, the total was $75. The desk guy said their in store prices sometimes differ from the website. I pulled up the website, showed him the price, and asked for a price match. Nope, he refused. \n\nI stepped outside, called the website order number, and placed my $50 order for local pickup. Waited for the email confirmation to come in and headed back into the store. Showed it to the same guy and he literally groaned haha. I asked him if it really is that hard to price match HIS OWN FUCKING WEBSITE.",
            "Op you called from outside? You should've call in front of his face",
            "I was in a craft store once looking at some Halloween ribbon. On the app it was on sale for like half off, but in store was zero discount.\n\nI placed an online order for pickup while I was standing there looking at it.\n\nNot malicious or anything, and I did have to leave and come back like two hours later to pick it up, but I saved easily $10+.\n\nI don't know if they would've price matched themselves, I'm not really bold enough to ask, but I was pretty satisfied with the outcome 🤷‍♀️",
            "I have a friend did the same thing except the order was for delivery only. He had them deliver it him outside the store.\n\nEdit: spelling",
            "Really doubt the front desk guy cared if you get the discount. People always expect the minimum wage employees to bend the rules for them even though you have no idea if he's gotten in trouble six times already for doing it.",
            "I could see it being a system that necessitates a phone being associated with the order to apply the discount. That wouldn’t be too crazy but also would be so easy to explain to someone",
            "My only issue is you never know what kind of trouble he could have been in for not following the rules. Could get written up or something just because you thought you were better than the rules.",
            "In this day and age I can't imagine not ordering ahead and having the food ready when I walk in to pick it up. I hate standing there waiting for the food to be cooked.",
            "Top shelf MC right here, love it",
            "Jobsworth: Fuck, i'm getting paid three fiddy an hour and my fucking boss is breathing down my neck about this phone in discount shit. Then some asshat comes in and acts like owns the place. He's right, of course, but fuck, I ain't getting paid enough for this shit.",
            "It’s not like this guy made the rule though, he just had the unfortunate job of enforcing it",
            "I mean if you want to save time, call ahead then walk over on foot. Then you’re only waiting 5 minutes",
            "I worked as a delivery driver for pizza hut. They had just trained and promoted a cook to store manager, at the time pizza hut was running the large pizza up to 3 toppings for 10 dollar promotion on television. He took a phone order. Two large pizzas. Since the lady didn't ask for a discount, he was taught to charge full price unless the customer asks for the promotion. So obviously their was a disconnected between the person who ordered the pizzas on the phone and the recipient of the pizza. It was a cash order. So I get to the house and it's like eight Mexican workers literally pouring concrete at a house for their driveway and porch. The total price for those pizzas? 40 dollars. I felt kind of bad making that delivery cuz the foreman on the job site looked equally surprised by the total. Before then I had been trained by one of the other drivers that had been at the store for the longest time. He would always apply every single discount he could in an effort to increase his tip. Apparently we weren't supposed to do that.",
            "im sorry, but as someone who has worked in fast food and for minimum wage or similar, i just cant get behind you on this one. most of the time, us at the front counter are on specific instructions about certain promotions and can be punished if we deviate. if a customer came in all entitled as if they were exempt from the rules that are stated so clearly, their excuse being that they live close by, i wouldnt be too happy either. i hope you see this and realize im not trying to belittle or disrespect you, but i think that this is not the feat you seem the think it is. he's just doing his job",
            "I’m old enough to remember a time when not everyone had a phone in their pocket. They’d do stuff like this knowing not everyone could just pull out a phone and call them on the spot. These promotions were to mitigate rushes and buy them some time in making the order. I don’t understand why they do it now. It’s like they’ve forgotten everyone has a phone now.",
            "I used to work at a gas station that serves hoagies and drinks. We used to get sooooo many coupons and I would routinely give them to receptionists wherever I was going. Doctor’s office, car shop. They always loved them; remembered me and my wait time was never long. Don’t know if those all correlate but I’m always asked if I have coupons now.",
            "[deleted]",
            "I’d have pulled out my phone while standing in front of him, and made the call. \n\nExcellent that you did it for the stranger, though. I’d have just to.d the guy about it. I like your style.",
            "This sounds exaggerated. Why would the minimum wage worker care whether or not you used a discount? They're probably just pissed at management making the dumb rule.",
            "Gonna be honest - sounds like you bragging about being a jerk.\n\nYou were 5 minutes away. If it took 10 minutes for the food to be ready, you wouldn't have taken 15 minutes to pick up your food. You would have taken 10. And gotten a discount.\n\nAnd then expected a discount and told them \"both the hassle\" - dude, it was only you hassling at this point.\n\nI used to live a block from a pizzeria and ordered subs there all the time. Still called ahead. They could be busy and there would be a longer wait, could end up closed, would be quicker for me to pick up than wait for it. And especially for a promotion.\n\nAnd then you're going to say this dude, possibly just an hourly worker, is \"gonna pop a blood vessel\"?  Get out of here. Bogus. He wouldn't care. And if they ran this promotion, they obviously want to get people to use it. Don't know why they wouldn't tell people.\n\nYou were just a jerk in this case. You could have called, didn't, and wanted the discount for calling. \"Oh, I saw a coupon in the Clippers magazine, but didn't want to cut it out so just give it to me? Let's just save the hassle and give me the discount.\" Yeah, that will work.",
            "You think you've won, but I have a feeling they put something extra in your pizza for you that you'll never know. I don't ever argue with people handling my food.",
            "That smile and wave, dude",
            "Never eat food made by someone who is mad at you.",
            "And you don't mind that they spit on your pizza? /s",
            "that’s malicious alright. what’s funny is that you chose malice in advance by not calling all so you could get 10% off a fuckin pizza and flex on someone who works at a pizza shop.",
            "Can tell OP haven't worked custoner service before.",
            "Reminds me of the time I went to Charleston and probably the one time in that cities history couldn't find shit to eat... It was late.  I ended up at a papa John's, they're closed, but open for delivery.\n\nI ask him if they'll deliver it outside, they can't.\n\nSo I walk ten feet down and give them the address of their next door neighbor.",
            "This is awesome. I used to have to print off coupons for places like Michaels and Hobby Lobby for a boss. So I would print multiples and leave them in the break room. Boss got upset with that because \"people should do their own work to get coupons\". I just raised my eyebrow with her and asked her to email that to me so that I could show it when people ask about coupons. So she did.\n\n2 days later, she asks for me to print coupons for her. I also had to print her grocery coupons for some reason. I printed her email and the response from her boss that I got after he read it. Because apparently she sent a copy to him and he replied to both of us. So then I had direction from her superior to not print coupons for anyone. Boss was not happy at all. Too bad, so sad.",
            "[deleted]",
            "Most of what I got from this was that people not only still do orders via phone-calls, but also directly in person?  \n\n\nI thought the entire point of tech advancement was so I never had to speak to another living person to get my food again.",
            "My advice, never ever piss off restaurants or places that serve food.  Yes, you got your 10% off but you never know what they added.  Just saying.",
            ">I didn’t call ahead as I didn’t see much point. \n\n>“I know I haven’t called in first, but I know you do a discount if you do, but to save us both the hassle of it and for the fact I know the promotion exists, can I still get the 10% off anyway?”\n\n\nTheir bussiness, their promotion, their rules..\n\nWhy is there always that bloody entitlement to 'gEt It YoUr WaY' they are not in the bussiness of making it your way, they make pizza and íf and only íf you care about clearly communicated rules you even get a 10% discount. Thank you...\n\nWhat's next? Screeching at a poor terrified 18 year old cashier for not 'hOnOrInG' you your six year old expired coupon for half price dogfood at a Wendy's? \n\nDont make peoples lives harder then they allready are. Sorry pal, you are not the main character in the scheme of life.\n\n\nAnd do you see it now? Dont be a vampire feeding on other peoples energy for your convenience as...\n\n\n>I didn’t see much point.",
            "You sound like a Karen harassing a service worker. Weirdo.",
            "I once went to an Auto Zone for a car part. They didnt have it in stock but said 1 a few miles away did and they could ship it to this location and have tomorrow. I said dont worry just have em hold it and i would pick it up myslef as i needed it sooner and would save them the trip. I show up and ask for the part. The total was $20 more. They tell me that that is the price difference from this location and to get the lower price I need to buy it from the other Auto Zone. They are the same company. Sure maybe different franchise owner but cmon. I tell them that Im saving them time and money by not having to drive the part to the other location. Guy was weelllll we will just say..... not smart. Get the manager over and tell him i still want the part but either he can pay an employee time and gas to take it to the other location or just simply give it to me for the price that another Auto Zone just a few miles away would. Got the part there for the right price.",
            "never fuck with an american when discounts are on the line",
            "So you actually ate the pizza AFTER pissing off the cook?  I bet the cook is the one laughing at what was under the cheese.",
            "I wouldn't have left the building.",
            "I'd have used my mobile right in front of him, without leaving the store - after asking for the phone number :)",
            "It’s because of tracking on google ads, probably. Just follow the dumb rule.",
            "I met a guy who worked at a rock climbing gym. I was interested in trying it out and this dude gave me like 25 day passes. Turns out I really enjoyed climbing so I was burning through the passes. One day one of the other workers asked how I got so many passes. I was like, “Bobby gave them to me.” He responded, “You know Bobby? You don’t need passes, man. You’re good.” The workers were all pot head climbers so it was a pretty chill environment lol",
            "You could have “saved yourself the time and energy” by just calling on your walk",
            "Pissing off people before they prepare your food.  Yeah, that's brilliant.",
            "Soo you knew it was a phone order discount and bc you live close by you decided you wanted to be difficult and demand special treatment instead of just calling them which you ended up doing anyway? This post isn’t the flex you think it is fam",
            "I called a hotel chain from their lobby right in front of the clerk and saved $40 for the night.",
            "I found a thing I needed discounted while browsing a home improvement store website. There happens to be one of their stores less than 5 minutes from me, literally only have to make 4 turns if you include the turn out of my driveway and the turn into their parking lot. So I decided to just go there and get the thing I needed. When I got to the register to check out, they tried to charge me full price so I showed them the price on line. Cashier said \"order it on line then.\". I argued with her for a minute and it was obviously pointless, so I told them I would order on line then. There was an option for pick up at store on line so I did that, then went to customer service to pick it up. So somebody had to take the thing back to the shelf because I didn't buy it at full price, then somebody else had to go get one from the shelf and bring it to the front to hand to me 5 minutes later.",
            "I really hope you had a clear line of sight to them making your pizza the whole time.",
            "It’s the “smile and wave” that tickled me. Absolutely adorable.",
            "I took advantage of something similar, years ago. We live near San Francisco, and a friend was visiting from out of town. Tours of Alcatraz, the old federal island prison, are crazy popular.  \n\nWe drove into the City, and saw that the wait for a boat and tour was something like three hours for walk-up ticket sales, but only fifteen minutes if you called and made a phone reservation.\n\nI walked across the street to a payphone, called for a reservation, and we walked back across the street and boarded our boat for the tour,",
            "This is wild and exactly why customer service is trash. Workers are required to follow coupon rules sometimes the coupon won’t even apply to ur order unless u do. I wish people understood the food industry ):",
            "Seems like a poorly planned promotion.  There's no good reason for phone only promotions.  As a bussiness owner, I rather have the customer present and paid then risk a no show.  As an former employee, also understand following rules, however stupid it may be.   There's no malicious compliance in this post.",
            "I would have stayed right in front of him in the restaurant and called. If I were really ballsy I would start asking about various things in the restaurant as I pointed to them and then later carry the conversation into the bathroom.",
            "Bro. I had a little giggle at the first part, but the second person walking through I was NOT expecting. That made me burst out with the ugliest laugh. Thanks!",
            "Reminds me of one time I was ordering 2 of the exact same 15cm sandwich from subway because they were on a special discont and told the employee \"no need to cut it in half, they're both for me\" thinking I was being nice and making it easier on her, just for her facial expression to change to the most annoyed face I've seen that day and proceeded to tell me \"But this discount is only for the 15cm ones\".\n\nI was silent for a couple seconds and said \"...sure, makes no difference since I'm ordering 2 but okay\". I did not try to convince her to do it or anything, but she mentioned it again twice thatshe could not give me the discounts if she didn't cut it, she knew that was dumb as fuck but kept explaining the rules like she did not want me to think she was mega stupid lol \n\nShe probably had an annoying manager/boss that enforced this silly stuff and gave the employees shit if they did not comply, so I do not judge the workers, they're just following orders",
            "I hope you enjoyed your floor food.",
            "You definitely ate spit on your pizza",
            "I wouldn’t have even walked outside… and I would have put him on speakerphone…",
            "Was the spit on your pizza extra tasty? You are a braver man than I am to irritate the person preparing your food. Shudder.",
            "This would have been cool... except why not order the pizza before you leave, then walk down when it's ready? Also, I doubt the guy working at the front owns the place, and if he does, I don't know why they'd care about a 10% discount.. I mean, if he ordered $50 of pizza, it's only $5. Anyway, don't mean to piss on your parade, I'm glad you had a satisfying moment.",
            "You sound like the kind of person that led me to quit working with the public. I guess that’s effective MC.",
            "> He looks like he’s gonna pop a blood vessel \n\nUnless it was the owner working the counter, bullshit.\n\nI like this sub but people really need to stop pretending front line workers give a shit about your mc.",
            "Doesn't even sound like Malicious compliance, that just sounds like you harassed an establishment. \n\n\"i didn't call ahead, can i have the discount\"\n\n\"no thats for phone orders only\"\n\n\"oh, can i have the discount now.\"\n\nI swear this runs like a spongebob gag, like a Scooby Doo villain thinking they're the shit. Like jeez the guys just doing his job, leave him alone ffs",
            "While this story makes me laugh, the whole thing about the employee getting pissed off and being emotionally invested in the discount policy makes no sense. Can’t speak for everyone of course, but I am one of the poor souls who has had many customer service jobs. I always wanted to do what I could to make the situation easier and make the customer happy (just to avoid verbal abuse, if nothing else). This story made me think that maybe this employee was already doing his own sort of malicious compliance? How much do you want to bet he’s got an a-hole manager who got on his case for giving the discount to customers when he shouldn’t have?\n\nThen again, the pizza shop employee might just be a jerk - who knows :P",
            "I wouldve been mildly annoyed with you at first, but definitely wouldve cracked up upon seeing you through the window while calling.",
            "This sounds like the employee was just trying to do their job and not get in trouble. Of course it doesn’t make sense that it has to be phone only takeout orders but a lot of things management makes you do don’t make sense lol",
            "I lived on the same block as a pizza place that was 50% off deliveries only. Would go in person to place my order, and they wouldn't let me take it home myself, it had to be delivered.",
            "In the early days of coronavirus this local restaurant was only taking phone orders, and handing the food out of a window in the storefront.\nI walked by and and tried to order from the dude in the window. He told me phone orders only. So I called the restaurant, he answered and I gave him the order over the phone while I stood directly in front of him. Like 5 feet away. While looking right at him. He pretend I wasn’t right right there in front of him. It was…very strange.",
            "I generally try not to piss off people that are about to make me food.",
            "So you purposely annoyed someone working an extra level job cuz that stuck by the rules someone else made… as a retail worker this just pisses me off.",
            "You kinda sound like a douche if this is a real story which i doubt",
            "[removed]",
            "Unless the guy taking orders is the owner, wth would anyone care?",
            "I mean. At that point why even step outside? Pull out your phone and call him while standing right in front of him.",
            "Advance auto parts is kind of like this. I live a couple of minutes away, but get a 20-30% discount by ordering online and picking up the order. They sometimes grumble that im there before getting the confirmation email and all, but oh well.",
            "During covid my local car delete shop parts department stopped taking walk ins, you had to call or order over the phone. Covid restrictions ended and I needed a part, went to my local dealership for a part (I think it was a hub nut and I was changing rear brake shoes). \nI go in and they still had the rope around certain areas directing you to reception. I mention I wanted to buy a hub nut and was told they were still operating their covid rules and not accepting walk ins.\nI ask if it’s in stock which the receptionist calls the parts department (literally 5m away a guy answered and I could see he was looking it up). I’m told it’s in stock but I need to order online or by phone and they can’t place the order for me. \nLiterally I did not move, I called their number, the guy I saw answer before answers. I place my order, I’m asked if I want to pay over the phone or in store on collection - I opted for in store.\nI end my call and tell reception I’d like to collect an order to and was directed to the guy I spoke to!\nThat was Ford.\nI bought a new car recently from Volkswagen, they also have the stupid telephone or online policy STILL in place and when I collected my car I wanted a dash cam, it was only after they showed me options in stock they told me I’d have to call up to order, atleast they admitted it was insane and they hated the policy - the Ford receptionist acted like a right jobsworth",
            "I was in San Fransisco for the Oracle OpenWorld conference and had bought a multi-day transit ticket. At the end there were still some days left on the ticket so I gave it to somebody waiting at a bus stop as I had no more use for it.",
            "I have two of these from recent events.\n1 - local cake shop sent out generic coupons (I remember the code still because it was so generic \"cake10\") which had the caveat of you had to bring the physical generi coupon with you while ordering.\n\nSo as my partner and I are driving past on an unrelated errand I mention the discount and say we should treat ourselves.\nMy partner goes in and comes back out a moment later saying they wont give her the discount. I ask her to wait in the car as I'm not afraid of confrontation and figure I can sort this out verbally as I can literally recite their generic coupon code to them.\n\nNope. Lady that works there isn't having a bar of it. Ok lady, game on.\nI go back out to my car and place an online order using the coupon code. No physical coupon required.\n\nI go back inside and she has no choice but to give me the cake I have paid for at the discounted rate.\nThanked her for wasting my time and hers - she was stunned.\n\nOther one was also an online purchase of tickets while the physical ticked booth was 5m away. Saved myself $100.",
            "Our local pizza place a similar offer... It's not available in person or online. I forgot to call in the order and realized my mistake too late.  Next time, I'll remember to get my 10% discount by using the phone and wasting their time with manual ordering and payment.",
            "I would highly recommend not letting food service people know which order is yours if you're doing something that may irritate them, whether they deserve it or not.  This story might have a reciprocal in the reddit universe in which the pissed-off pizza guy details what substances he added to the recipe for the customer who, in his mind,  didn't respect the rules.",
            "What if I told you you are paying the correct amount, and the price without discount is just inflated?",
            "Ah, the delicious kind of Malicious Compliance",
            "This whole time you think you win with the 10% discount but he still makes that 90%",
            "We must be twins.",
            "This seems like a mean thing to do to someone who is just following the rules but ok.",
            "Funny story but you are messing with the wrong people if you take it too far. Your order may end up with some extra secret sauce if you piss him off. Life Pro Tip: Be respectful with those preparing or serving your meal.",
            "Reminded me of when years ago a big electrical store had 10% off giftCards...\nI wanted a video camera $1100 rrp. Asked the salesman for the best price which was $1000 with abdoutely no chance of any further discount.\nThank you sir...then went to the counter and bought a $1k gift card for $900 an used it to purchased the camera...\nSalrsman was like wtf just happened?",
            "What happens to this guy if he gives you money in a manner that directly contradicts what his boss told him to do? Punking on low paid workers just doing what they are told is hardly something to celebrate.",
            "If I were the guy working and someone came in asking for a discount in a douchey way, I wouldn't want to give it to them either. After seeing you outside and making the call, I'd just hang up and say you're not welcome here anymore. If I didn't recognize you, you probably don't go enough to make it worth it. \n\nA pizza place near me offers a walk-in deal of a large 1-topping, 6 wings, and a  2-liter for $17.99. it's like 23 individually. I once called and asked about that deal and said I was picking up and they said had to be ordered in-store only. I said sure! And just drove the three minutes and ordered. Sat in my car and listened to music for 15 minutes and drove home and ate hot food.",
            "Was in a line at a 5 Guys that was about 15 deep and it was slow moving. Found the app on my phone, ordered the food, and stepped out of line to the confusion of those around me.\n\nWhen I picked up my food, the person who was in front of me was still 6 people from ordering.",
            "[deleted]",
            "Taco Bell told me I could only order certain items from the app, while I was there in person.\n\nI went to Taco Bell in the last several months. I was in the drive through. I was there as I was sent by my fam to get dinner, and my wife asked me for something she saw on their online menu. When I asked for it I was told “ You can only order that on the Taco Bell app.\n\nI said, “I’ve got money, you have food. It’s more complicated than that?”. I was met with silence. Then final, “That’s the rules”. I ordered something else.\n\nI am guessing it’s a marketing ploy to use something not on the in-person menu to solicit traffic for their app. You have found a similar ploy.",
            "Back in the day, one of the theme parks around here, Magic Mountain, would periodically have a promotion where they would have coupons printed on coke cans. I don’t remember how much off it was but it was significant enough. \n\nMy family recycles cans anyways but my parents would have us separate these coupon cans whenever they’d come out. Then they would organize an outing with our soccer team, Cub Scout troop, etc. \n\nWhen we would get to the park, my parents would have our friends offer the remaining cans to people in the parking lot. We usually a have a few trash bags full leftover (they were always the soccer coaches/den mothers/PTA volunteers so we always had a lot of recycling). \n\nIt was always a cool way to start the day making people happy. Sometimes people would recognize us in the park and strike up conversations, hang out with us for a ride or two, buy us little gifts, etc.  Thinking back I don’t know how moral that practice was for my parents to cheat the gate, but it felt wholesome and right at the time and it’s still a fond memory.",
            "Have a good one for this “rule enforcer” type… many many years ago my Dad took me to a Twins baseball game at the old Metrodome… anyways it’s Kirby Puckett bat day, first 20,000 fans get a real wooden bat… we had made a sign with thin wood duct taped on the edges so it wouldn’t roll up right? \n\nSecurity guy stops us and says to remove the wood from the sides of the sign… not allowed, foreign object could be used as a weapon…. You can guess where this went lol\n\nMy dad comes unglued after arguing with the guy… “YOU HANDED OUT 20,000 BATS!!” So f’king dumb 😂",
            "I had a similar experience at Build a Bear while getting a Christmas gift for someone. The doll was $28 if I ordered online or $44 in store. I asked the man working there if I could use the online price and he said no, but if I bought one in store for $44 I could get a second one for $12. I didn't need two bears so I said thank you and placed an online order right there, for same day store pick up. I came back an hour later and just smiled at him as I picked up my online order.",
            "I was playing golf with a buddy, and in the pro shop when we were about to pay our green fee, another player pointed out that there’s a book we can buy right there in the pro shop for $20 with a bunch of coupons in it, one of which gives us a two for one deal at the very course we are at, meaning we would be ahead by $50. So we tried to do that, and the guy says we can’t do that because we were originally “willing” to pay full price, and that the discount is really intended for players who have the book already and choose to play that course because of the deal. So we just told him we decided the green fee is too expensive and we will have to leave… unless they have any special deals. He relented.",
            "A pizza place near here had a \"buy a pizza-get a coupon-trade 10 coupons for a free pizza\" promotion. Once I had nine, I called them and explained that I wanted two pizzas, had 9 coupons and would only pay for one. (Important: there's no delivery fee). \n\n\\-Sorry, but that is not possible. The promotion is 10 coupons for a pizza, and you said you only had 9.  \n\\-But I am ordering a pizza now. As soon as it arrives, I'll have 10 to trade for the second pizza. Should I place an order now, get the pizza and the tenth coupon, them call you again to have the \"free\" one delivered, on a second trip?\n\nBelieve it or not, but she had me waiting while she talked to the manager about the \"problem\".\n\nBoth pizzas tasted fine, thanks for asking.",
            "I once was at subway because I got an email that said like 2 foot longs for the price of 1, so I go over there and they tell me that it’s for online orders only. I’m like, ok then just give me a few minutes, as my group and I pull out our phones and order while standing in line (no one else was in line because it was late at night). They received the order on the tablet and made it. It is annoying, only because if I need to go there to get the food for pickup anyways, why do I have to order online?",
            "I feel like you’re the jerk in this situation",
            "So you were fully aware of the policy, ignored it, and then got upset that the minimum wage employee working the front refused the discount? C’mon man.",
            "Ok, Karen. You got them good, Karen.",
            "You knew the rules and you decided they don't apply to you. So you harassed an employee who had no say in any of it. Head office and management make the rules and make people like us enforce it under a threat of losing the job, meanwhile main part of the job is dealing with entitled customers that don't treat us like people at all. We don't care about these deals, but once you start a fuss like that, WE WON'T LIKE YOU, and you won't get shit from us. Meanwhile, the customers that are polite and friendly, often get extra shit, because again, we don't run the business and we don't give a shit. You're nice to me, you could even get an extra free pizza. You act like a shithole, you'll barely get your own order.",
            "Wow your life must be really really good if something like this got you this mad and entitled to type so much.",
            "He dreamed of being a civil servant but was stuck in a non-government job.",
            "You didn't actually eat that did you?",
            "...and that how people end up eating spit. Be careful with passing off restaurant staff.",
            "Dude was so staunch and upset about what was probably 2-3$ off.",
            "I mean that’s what I would do. So I guess I’m a shitty customer too",
            "The worker is just trying to keep a job?",
            "there is no MC at all. it's simply advertising. if you call them, you'll save their number. if you need pizza again, you simply choose from one if the saved numbers. you don't put the menu back when leaving. you take it home, put it on your fridge. when you want something, you look at it, call the saved number, and order.\n\nceterum censeo \"unit libertatem\" esse delendam.",
            "I remember going to a restaurant about 15 years ago, the guy said that they were fully booked when they had many empty tables. My friend behind me then called the restaurant. The hostess picked up in front of me and made the reservation for 5 minutes in the future. \n\nI then stepped to the side and my friend checked us both in and we got our table.",
            "I've taken my phone out and called, while standing in front of the person at the register for shnit like this before. Most places don't care and just give the discount, but at every store, there is always that one dude...",
            "I did that once too, but didn't go outside, phoned it in right infront of the counter.",
            "Our local Indian gives 10% discount on orders via their app. I live just 5 minutes walk away so often go in and order via the app while standing at the counter. It’s madness.",
            "That's literally the worst policy ever bc telephone pizza orders will happen regardless. Face-to-face engagement is the real white whale in an industry so overrun by impersonal carryout. Also, those people tip reliably and keep your wait staff happy, which means less turnover. Literally everyone loses when you prioritize takeout.",
            "This, lol. I remember having a polite discussion with a manager/owner regarding the \"buy one get one free\" pizza deals they gave away regularly - to people who knew to ask for it. If you walked in and ordered a pizza - that's all I would give you - a pizza. If two people walked in it was common that the second person ordering would say aloud \"let me get your buy one get one free deal\" and the first person who had already ordered a pie would look at me like \"WTF? I want that too?!\" I hated it. But we weren't supposed to volunteer that info to everyone. I also questioned how he could sleep at night knowing he was selling garbage food to people who couldn't afford anything healthy and his response was \"it's their choice to come here\". Cool, cool. I made the buy one get one free deal known to every person who walked through the door when he wasn't there to stop me.",
            "[deleted]",
            "That’s petty af, especially for a local place. Interactions like this is what drives people to leave negative reviews or blast them on social media",
            "I laughed so hard at this OP!!!! Love it.",
            "Yeah, I bet he was fuming about that all night.  Well, either that or he forgot you existed five seconds after he was done putting up with you.",
            "This is stupid. You’re asking for the employee to give you special treatment and risk getting yelled at by their manager. Then you’re sarcastically waving at him through the window. It’s like you’re making his shift harder just to amuse yourself. \nI’m sorry, but you’re kind of the dick in this situation. Just call the order in during your five minute walk next time. Why cause a scene?",
            "Dudes mad that the employee wasn’t breaking the rules for him.",
            "My guy, if he ain't the manager or owner, its not his choice. He's just doing what he's told. You did all this to save what?  $2? Smh.",
            "Ok, Karen.",
            "So you helped advertise their 10% discount because you were upset that the worker was just doing his job. You sure showed them.",
            "Never fuck with the people who make your food.",
            "That's a funny story, dude.",
            "Fuck them for doing their job right?",
            "So you knew how to get the discount but you decided to be a pain in the ass about it anyway??? You could literally live in the parking lot and you'd still have to call to get the discount. Customers like you are why so many people don't wanna work anymore or dread going in to work.",
            "Awesome on the extra bit at the end, helping a stranger save a little extra money as a nice middle finger to the clerk",
            "I’ve done this. Didn’t even leave the store first, just did it in front of them. I don’t know why he wouldn’t want to give you the discount, that’s bizarre.",
            "A chain would probably have to ring it up a certain way and blah blah blah corporate bureaucracy. Regardless of whether or not it's locally owned, people that take these things so seriously (especially those that use it as a cudgel to \"be right\") are happening with far too much frequency.",
            "You're an inspiration, I love this.",
            "Not all heroes wear capes.",
            "I know you were pissed off and may not have thought about it but I would have literally called their store right in front of them and been like “I’d like to place a phone order please” LMAO",
            "Dude’s just trying to keep his shitty job by following the shitty rules. \n\nWhy you gotta be that guy that can’t follow simple instructions. This is like freaking out a cashier because they won’t take your expired coupon.",
            "Dude, that guy didn’t give a shit about how you ordered."
        ]
    },
    {
        "post_id": "mbcqwa",
        "author": "redxmoonx",
        "title": "Trying to pay with fake cash and then tell me to do my job? You got it!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mbcqwa/trying_to_pay_with_fake_cash_and_then_tell_me_to/",
        "score": 16321,
        "num_comments": 529,
        "created_utc": 1616499458.0,
        "selftext": "On mobile, sorry for the format.\n\nThis happened about 7 years ago, I (M29) used to work in a store whose name sounds a lot like those cops that ride in planes. This particular day I was in the register when a well dressed guy and three women walk in, each takes a cart, start walking around and picking things out.\n\nI was known for my no bs attitude on the register, you throw money at me, give me attitude, w.e, I'll do it right back to ya so when a coordinator comes to me 30 mins later and asks me to take the dude and his girls on my register, I already know we're in for a fun time.\n\nThey rolled up with these three carts FULL of clothes and not just any stuff, we talking shoes and boots that costs 300-800, expensive handbags, coats and more, I'm just there thinking \"aaaw shit\". So they walk up, I start scanning all the while these ladies are being unpleasant. Finally I get thru it all and total comes up to about 3k, dude reaches into his fly ass coat and pulls out a wad of cash, all crisp $100 bills and immediately I knew something was off, so i take the money and go to the machine to check it, first bill, doesn't pass, neither does the second so I turn back around and tell the dude the I can't take the money, before I even get a chance to fully explain, one of the chicks cuts me off and tells me to \"take the fucking money and do my damn job\"\n\nCue malicious compliance.\n\nI say \"you know what? You got it, let me get the manager so he can help\". See at our discretion, we can decline a form of payment, say if two of your cards get declined? Gotta use cash, your cash don't pass? Gotta use a card or we can just tell you to fuck off, but if we suspect you're using fake money, we gotta try and keep you there while we get the cops. So I got to my manager, cash in hand and tell him what's up, he goes to the office and checks the money. Now the dude is nervous but just imagine his pants when two cops walk in and head straight for us, his horrified face made my day.\n\nCops take my statement and next thing you know all 4 of them are getting arrested, while one of the ladies is screaming and cursing at me, while I tell her in the most innocent voice I can pull off \"you told me to do my job!\"\n\nEdit: thanks for the awards yall and I'm glad ya had fun with the name.",
        "permalink": "/r/MaliciousCompliance/comments/mbcqwa/trying_to_pay_with_fake_cash_and_then_tell_me_to/",
        "comments": [
            "Reminds me of a time (non malicious compliance) my mom once had the FBI show up to her work at Thrifties, aka Rite-Aid now. Dude showed up and bought 5 dollars worth of gum with $1,500 cashier check. She thought it was odd, so she asked the manager. Manager tells her to ask for ID. She writes the info down, cashes the check, and off he goes. 3 days later FBI shows up asking for my mom. They interview her and explain that they had been chasing this guy for months. The only lead they had was my mom because she was the only person that had asked for ID. They caught the guy 2 weeks later.",
            "Not me straight up forgetting sky marshals existed and trying to figure out how plane police sounded like a store\n\nEdit: thank you for all the awards and comments!!! Can't believe this is my most famous interaction on reddit haha\n\nEdit 2: coz so many people have been asking, I believe the shop OP is referencing is Marshalls in the US",
            "I used to work in customer service for a major bank. Got a call one day from a store owner asking when his money would be refunded. \n\nME: What refund are you expecting, sir?\n\nCALLER:  Well I made a deposit for my business that included several counterfeit $100 bills. The bank detected them and handed them over to the Secret Service, who forced me to submit to an interview and show them my security videos! It was such an invasion of privacy! And the bank has never credited my account for the money!!\n\nYes, sir. It sounds like everyone followed correct procedure. \n\nSo when am I getting my damn refund??!!?\n\nI'm sorry, sir, I don't understand what you mean. \n\nI mean WHEN IS THE MISSING MONEY GOING TO BE PUT BACK IN MY ACCOUNT??!? I'm out eight hundred dollars!! Those Secret Service goons didn't bother to tell me when I'd get my money!!\n\nAh -- I'm sorry to have to be the one to tell you this, sir, but no one is going to give you real money in exchange for counterfeit money. \n\n*WHAT??!!?* \n\nIt's considered a theft, sir. You were stolen from. That's why many small businesses refuse to accept $100 bills -- in case they are counterfeit. \n\n***AT NO TIME WAS I TOLD THAT THE BANK WOULD NOT COVER ME FOR THEFT!!!***\n\n... O.o\n\nGood times at work. :-}",
            "[deleted]",
            "I worked as a bank teller, and I caught someone in the act of using stolen checks through an alert on the computer.  I read the alert and didn’t react when I saw the alert, cuz it didn’t name anyone, but simply said to call security. \n\nThe lady was already a bit sketchy, so I told her that I would need to get her money ~$2300 out of the vault and took her ID with me to the back room. I called security and texted my manager to come to the back at the same time.\n\nWe verified that the lady was the one who actually stole the checks and called the police. My manager went back out front to keep an eye on her while I “counted the money in the back”. \n\nNobody was really “in danger” but the police still took a bit to arrive and the whole time I was hoping she wouldn’t just book it. She got so antsy, that she told the other two tellers to get me back up front/get her ID twice.\n\nI was on the phone with my boss for part of the time, getting the play-by-play for what was going on with that lady, and he finally told me in a hushed tone that the cops just pulled into the parking lot. I grabbed two $50 packs of $1’s, and her ID and started walking towards the front.\n\nI got to the front with all of “her” stuff and realized that the cops weren’t even out of their car yet, and I couldn’t hand this criminal ANY money. I decided to stall and slowly unbanded the money, mumbled some bs about verification and clumsily put it into the automated Money counter hoping for a jam. I could feel the weight of her stare on my hands as the bills flipped through the counter as it all sat on her ID just behind the counter and just out of reach.\n\nTwo state troopers, stone faced and both at least a foot taller than her entered the lobby at the same time. I made eye contact with both of them and motioned down at her without her even realizing.\nThe look on her face when the cops tapped her on the shoulder was one of the highlights of working at a bank.",
            "Play stupid games; win stupid prizes.\n\nThe Secret Service does NOT mess about with counterfeiters...",
            "I worked a register once and I would get fakes every now and then, but they were never good. Like, “Hey, I photo copied a $20 bill at the library, think they’ll take it?”\n\nEvery single time I denied one, they would insist they got it from the bank—every damn time.",
            "You said cop on a plane and all I could think of was Samuel Jackson.",
            "Always fun trying to figure out which store it is. Sometimes I have a hard time but I knew exactly what you meant. Unfortunately my brain couldn't come up with the word until a minute later. And I was like, I know this one.\n\nMaybe now she will think twice about telling someone to do their job. And karma for them being unpleasant to you.",
            "This might be my favorite malicious compliance ever!",
            "That´s a lot of years in prison. You don´t joke with the feds.",
            "Are the plane cops called air marshalls?",
            "I would’ve thought for sure that the mouthy one would return for revenge on you by sending some whacko guys your way.",
            "\"  a store whose name sounds a lot like those cops that ride in planes \"\n\nIt's like a riddle I can't figure out... this is killing me, come on... somebody help me out here!",
            "This sounds like the guy was potentially a pimp as well. The guy was well dressed but not the women or all were well dressed? Guess it doesn't really matter at this point but I'm curious if the woman who got upset was likely under his thumb as sex workers are normally penalized even more than the people who make them work and it would give additional reason for her attitude and upset. Either way, what a situation.",
            "I think my neighbor Danny was doing that counterfeiting a while back.\n\nGot like 4 1/2 years for meth/dealing.\n\nHe'll probably be dead before he gets out.",
            "Thank you.\n\nThis story made me smile.\n\n*Whatever a person sows, that they shall also reap.*",
            "I would have pinned this for a Ross store, but Marshall’s is super similar so makes sense.",
            "👏👏👏👏👏👏👏",
            "Hey, you didn't make the rules, you just follow em. \n\nCan't be angry that that.",
            ">store whose name sounds a lot like those cops that ride in planes.\n\nThat’s one of the best name descriptions I’ve ever seen.",
            "Wont be wearing sucks a “fly ass coat” in prison.",
            "Oh dang this was beautiful!  I wish I had any awards to give you for that parting line. A standing ovation from me Sir!",
            "Heard that  MARSHALLS !!!!!",
            "Where I worked it was the law that if a bill did not pass inspection, the police were called. Period.",
            "I read “cops that ride in planes” and spent 5 minutes trying to figure out what on Earth rhymed with “flying pig”.",
            "... pork choppers / Price Choppers was my guess...",
            "Not an American so I’d still be wondering what’s they’re called if you hadn’t said.  Thanks!",
            "P",
            "I want to watch a tv show about cops riding in planes, but like Ball Fondlers.",
            "I hate counterfeiters. They are almost as bad as politicians.",
            "Man, this story hit the spot! Thanks for sharing.",
            "Well done dude!",
            "This made my day 🤣🤣",
            "this feels like a valid use for my free reward, its all yours op",
            "*french chef kiss*",
            "Super Chicken?",
            "I can’t figure out the name where the OP works. I need a nap.",
            "I really enjoy it when we have to guess the store names. Added level of difficulty when you don't live in that country :p",
            "I see you misused the term \"ladies\".",
            "> a store whose name sounds a lot like those cops that ride in planes \n\nwhat? Is that an American thing?",
            "> sounds a lot like those cops that ride in planes \n\nFlying Pigs?",
            "This reminds me of a time a guy got the cops called on him for trying to pay with counterfeit money. He had a history of drug possession and because he didnt want to get busted for counterfeiting _and_ drugs he decided to swallow the drugs in his possession and ended up ODing when the cops restrained him.\n\nOopsie!",
            "What's with this format? Sentences... Punctuation... Paragraphs... Appalling to say the least",
            "Well, they have much to cop plane now",
            "I’m still trying to figure out the store name. What store rhymes with Air Pig?",
            "JUST SAY THE FUCKING NAME OF THE STORE.",
            "Cops that ride planes?",
            "Oh this was delicious LMAO I would've loved to known their situation and aftermath. Wtf.",
            "Why wouldn't they have a gun or a knife or something? Like this seems so incredibly stupid",
            "That's not malicious compliance",
            "Nothing malicious about getting the cops involved when criminals try to steal.",
            "Ahahahahahahahahahahahaha",
            "👮‍♀️✈️"
        ]
    },
    {
        "post_id": "b1stpx",
        "author": "Quixotic_Ryan",
        "title": "Not allowed overtime? Have fun checking everybody out.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/b1stpx/not_allowed_overtime_have_fun_checking_everybody/",
        "score": 16318,
        "num_comments": 548,
        "created_utc": 1552745380.0,
        "selftext": "EDIT: I haven't worked at this store for almost 7 years. I'm a teacher now, so thankfully I don't have to deal with customers now. Just some bat-shit crazy parents. \n\nI used to work as a checker/stocker at a grocery store. Our store manager (Mike) was a d-bag, and would always try to screw people. There was massive turnover at this store.\n\nSo one day, I get called into his office and asked why I gave overtime on my time card. I was usually scheduled for 1-10pm (hour lunch), but the store didn't close until 10, so I had to count out my drawer afterwards.\n\nI explained this to Mike and he didn't care. He went off saying that I should be doing this earlier, and that I was to leave at 10 on the dot so that I had NO OVERTIME.\n\nGot it, boss man.\n\nA couple of weeks later it was Thanksgiving time. We had extra checkers, but from 8-10pm, I was the only one besides the manager who closed the store that day (Mike).\n\nI made the announcement at about 9.40 that we would be closing in 20 minutes, and to please finish up your purchases to check out.\n\nPeople started coming up to check out, and their carts were LOADED since it was almost Thanksgiving.\n\nI go about checking them all out, but then the clock turns to 10:00.\n\nI stop in the middle of my transaction. Call Mike on the store phone and tell him I'm leaving since I can't have overtime. Walk over and clock out.\n\nThere are still 6 to 7 customers with full baskets in line at this time.\n\nMike comes over and is yelling at me as I'm walking out. But I remind him that he specifically told me that I can't have ANY overtime.\n\nWhen I got into work the next day, I was written up. But it was worth it. Apparently he spent the next 30-45 minutes checking people out.\n\nTL;DR: I did what my boss told me to. He got stuck checking people out by himself for 45 minutes after the store closed. ",
        "permalink": "/r/MaliciousCompliance/comments/b1stpx/not_allowed_overtime_have_fun_checking_everybody/",
        "comments": [
            "I would have gone to the owner or cooperate about the write up as you were literally following orders. ",
            "I sure hope you didn't sign that write up for doing exactly what you were told. ",
            "I had a boss who did something similar acting like a jackass when I ran over 15m and added it to my time sheet the week before. It was a shining moment for me when both of us were on a conference call with network planning, the clock on my computer hit the time the boss told me I had to be off the clock as there was ‘no overtime’, hung up the phone in mid sentence, locked the computer, and started walking out. The same boss catches me at the door and says ‘where you going?’. ‘You told me no OT, so go ahead and finish the call and I’ll talk to you tomorrow’.\n\nFunny thing was I was presenting to 20 network planners, including two directors. Next day I was told by the second level to ignore my first level and if I ran over, to put OT on my time sheet. 😎",
            "Why doesn't the manager do the damn smart thing and schedule you 1:30-10:30?",
            "I worked at Home Depot as over night stock.  We were understaffed and a really busy store so there was never enough time to get everything done.  Our idiot manager would work us right up to the last minute before clean up in some desperate attempt to accomplish everything.  Since I was one of 2 people with a forklift license, I always had to stay late to help tidy the place.  By Friday I would end up with almost 2 hours of overtime.  I was bitched at for going over 40 hours a couple weeks in a row, so I said fuck it.  Since he wanted to work me late every day, I just went home 2 hours early every Friday.  It was so entirely worth it.  Absolutely amazing to get off at like 5 on a Friday morning and go home and get hammered.",
            "I worked in a grocery store for a while during high school and then a few years after. We had an assistant manager that loved changing peoples schedules day of. One day I decided to double check my schedule and saw that I was working 3-7. \n\nI show up to work at 2:50 and the front end manager told me I wasn’t scheduled until 6. I went in to look at the schedule and sure enough the assistant manager changed it. I went home and turned my phone off. \n\nI was scheduled the next morning so when I came in the store manager called me into his office and asked me to explain why I no called no showed the night before. \n\nI told him if the assistant manager changes my schedule without telling me I’ll change my schedule without telling him. The assistant manager got in trouble with corporate and my schedule was never changed again. ",
            "I worked at subway for literally 4 hours when I was younger for the same thing. It was my first day and I wasn't feeling it almost instantly but when my supervisor clocked me out and said I had to stay to clean up and count bread and shit I just laughed at her and just left. Gotta nip it in the bud sometimes",
            "I've worked for a small business for years and the owner is great.  Close at 0000 paid till 0030, every night. Also he doesn't believe in anything less than .5 hour increments.  Just round up or down at your own discretion, give and take.  However if you're a const taker you won't last long.",
            "I worked for an orange colored home improvement store that had a policy of no overtime.   A manager had a bad habit making me do asinine stuff.  One night she made me stay several hours fixing an end cap that had been set up wrong for years.  She realized that Sunday I was going to have to leave four hours early and no one was going to cover my section.  She says you need to stay and cover your section the overtime will be ok.  Having dealt with her in the past, more than likely the overtime was a lie plus I had already made plans with my wife, I just said, \"I have plans with my wife I am sure you can figure it out.\"  \n\nedit:  removed a few words",
            "I had a similar experience. I was closing shop alone and the boss wanted me to count the drawer, clean, and finish jobs all while checking customers out. On slow days, this could be done, but counting the drawer was impossible and too risky.  \n\n\nSo, after hearing the complaint once too often, I told him that I'll start clocking out on time, but I won't be able to close out the register. He agreed and said he'd do it in the morning (he had the open shift and I closed).  \n\n\nA week later and I've got overtime approved and they tell me to make sure the doors are locked when I count the register.  \n\nTurns out the morning customers were eyeing the cash as he counted it was making him nervous. ",
            "Mike: Get back over here and finish checking out these customers. \n\nOP: You’re authorizing overtime? Per regulations, I cannot do any work unless I’m clocked in. \n\nMike: Don’t worry about the clock. The customer comes first. \n\nOP: There’s actually a LAW that says I can’t. There are also liability issues. No overtime, no problem. See you tomorrow. \n\nMike: Fine. Go clock in. \n\nOP: Great!\n\n[Some time later, during which time Mike has been working the register.]\n\nOP: The time clock won’t let me clock in. Seems it’s not my scheduled shift. Can you override the clock, or am I going home? By the way, I still cannot check people out while you fix the clock issue. ",
            "I worked for a big retail company as a checker a few years ago. They had this rule that you can not work over 6 hours without a 30 min lunch. If you went a minute over 6 hrs without a break you would get in trouble. Even though management was in charge of scheduling lunches, you would get in trouble if you didn't take a lunch. \n\nOne day I was scheduled for 6 hours. The manager that day didn't want me to take a lunch so he told me to clock out before 10. We close at 10. I was the only checker scheduled to close. \n\nSo right at 10 about 7 people come up to check out with full carts. I walked away and clocked out. He was very annoyed but it was his plan. I would have been the one in trouble if I stayed, not him. ",
            "Provide a statement for your HR file explaining your position and that you were following his express instructions to the best of your ability.\n\nGive HR, your supervisor, and, if relevant, your union steward a copy.",
            "It literally doesn't make sense. If each customer is spending like £20 to £100, and it takes 3 minutes or so to check each one out, paying you a slightly more money to hang around a little longer is still going to result in more profit than if you didn't do overtime",
            "If the corporate doesn't want to pay overtime, that's illegal, you can sue them.",
            "Can anyone comment on if you \"have to\" sign write ups? Either if you were at fault or not?\n\nI didnt sign one once because what was on it was a blatant lie to make the manager look good when he was the one who messed up (which he also admitted verbally to during???)... but then later a different manager commented on how that was insubordination to not sign it?",
            "You got my upvote simply for having to deal with bat-shit crazy parents. My condolences.",
            "Good for you. He told you no overtime. Had you checked those folks out, would you have been paid??????",
            "Written up? For doing what he told you? F that bullshit. I’m so sorry.",
            "What store gives you an hour for lunch? I only get 30 minutes.",
            "I think thats a worse problem, trading shitty customers for shitty parents",
            "Isn't it normal to hire people past the opening hours? I thought opening hours only apply to customers, operating/working hours is different. \n\nLike if say the mall opens to customers 10am to 10pm, employees are expected to work 9-5/4-11 shifts or some similar permutation. \n",
            "Wage theft is the largest type of theft. ",
            "TL;DR I did what my boss told me to and got written up for it",
            "Shoulda just stopped scanning food and started counting your till right after you made the closing announcement.",
            "U",
            "Written up for doing your job?\n\nYeah, sounds like a cut and dry case of malicious compliance to me.",
            "My previous job was pretty toxic environment and refused to pay us overtime unless previously approved. But it was a cafe so it's hard to predict. Then we lost a team member and they still refused to allow us to work overtime and refused to hire a replacement. Got to a point where we were all run down and a week wouldn't pass without someone getting sick which escalated everything for the rest of the team. When they eventually budged on it, nobody gave enough fucks to want to work overtime.\n\nOne time my manager and I got into a fight over a crazy thing she said or asked us to do. She walked away and came back when I was about to go on my (unpaid) half an hour lunch break. \"Can I have a sec Julz?\"\n\"No. I'm on my break. You can talk to me when I'm on the clock. This is my time.\" I think I also told her to fuck off.\n\nShe ignored it and sat down at the table with me and started going on. I looked at my watch and told her I'm timing my break from when she leaves my table. She fucked off pretty quickly. I timed my break from then. \n\nThat job was full of MC. I also got into a habit of asking them to clarify and put into writing each illegal and fucked up thing they came up with. Good times. \n\nNew job is much better. Although customers show up before open and start us down. So I got into the habit of getting in at 7.59 for a 8am shift",
            "I have a semi-related malicious compliance anecdote. My job officially goes until 8:30PM but I normally have to stay until 9PM to finish, so I had a deal with my boss where I arrived 30 minutes after my assigned time so I wouldn't go over. No probs. Well, I arrived 45 minutes after my assigned time one too many times and my boss tells me I *need* to arrive at my officially assigned time. I tell him okay and proceed to do it.\n\nWhat follows was a week where without fail I'd get 30 minutes of overtime each day. My boss's bosses were NOT happy about that and my boss called me in to relent and said I could start coming in 30 minutes after my assigned time. He hasn't said a peep about me being late ever since. I guess he figures me missing 15 minutes is a hell of a lot cheaper than me going over by 30 minutes.",
            "So you got written up for doing exactly what he told you to do.\n\nSmdh🤦🏻‍♀️",
            "[deleted]",
            "Sounds like some Whole Foods shit- LOL",
            "Jesus. This whole thing reeks of Dollar General.",
            "[Word cloud out of all the comments.](https://i.imgur.com/ydyUFet.png)\n\nFun bot to vizualize how conversations go on reddit. Enjoy",
            "Damn u are a legend haha",
            "Is this a repost, or am I having speep-deprived deja Vu? It seems so familiar, but at the same time, not",
            "Savage! I like it!",
            "Yep seems like a classic company ",
            "AND THEN?! ",
            "Nice.",
            "So lucky you only got a write up.",
            "Dollar General? ",
            "\"Hey boss, check this out (lifts kilt to reveal massive strap-on).\"",
            "Do it again FUCK you mike!!!!!",
            "I’ve worked in hotels for about 20 years and have worked for companies who were completely nonsensical batshit crazy on overtime. My current and last couple employers have been far more reasonable on this topic with only the instruction that it should be minimized and not to get into a habit of scheduling planned overtime or letting people intentionally abuse the clock. That is not at all what you were doing and I’m sorry to hear that you work for someone like that. ",
            "This is the exact reason I left for lunch, and just stayed at lunch.",
            "As a retail manager, I can tell you that I never did that to my employees. One store, had a tough policy on this. We did bag checks and employees weren't allowed to clock out until it was done. If i or my district manager had business questions for an associate while they were off duty, we had to wait for them to clock in. Then they would clock out after the conversation. If it was over the phone, with the exception of call outs or call ins, I would have to add that time to their payroll.",
            "I used to work at a place you start at 7 and there is a punch clock and I clocked  in at 7 every day and my bosses were trying to say I needed to be there before my start time I told them to change my start time then if I need to be there 15 mintues  early to work.  \nThis was all minimum  wage\n\nI started do this after they fucked me over a few times I was slow to learn. ",
            "The only \"trouble\" I've ever had about overtime was when my old assistant manager was still my assistant manager.  When we closed together we had the bad habit of getting out late because we were just doing more work.  One day I didn't leave until about 10:30pm (an hour after I'm supposed to) and I found out from him that he didn't leave until like midnight, but he clocked out when I did and just worked off the clock to get some stuff done.  We started at the same time so we walked in talking, and our manager was in the lobby.  She just goes \"Please tell me you didn't leave at 10:30 last night\" to me.  And to him she says \"A little birdy told me you stayed until midnight off the clock.  I'm not going to get you in trouble for it, but did you?\".  And his response was to \"plead the fifth\". \n\nSo no actual trouble, but we both got called out by our boss.",
            "Lowkey, I'd start looking for a new job. Your managers are shit and it's only going to get worse. ",
            "You guys really needs unions and soon"
        ]
    },
    {
        "post_id": "8ykeqa",
        "author": "Throwinitawaymkay",
        "title": "\"If you don't like it, then leave!\" Don't mind if I do. Don't mind if we all do.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ykeqa/if_you_dont_like_it_then_leave_dont_mind_if_i_do/",
        "score": 16301,
        "num_comments": 552,
        "created_utc": 1531491977.0,
        "selftext": "I work(ed) as a housekeeper at a small local hotel. At the beginning when I started (about three years ago), things were pretty peachy. I got above minimum wage and worked in an environment with a more relaxed working pace. We had more time than your average hotel to clean rooms and it showed in customer satisfaction. We had stellar reviews with customers raving about how there wasn't a speck of dust anywhere, how everything from the lamp shades to the bathroom drain was always scrubbed squeaky clean.\n\nI loved my job and took pride in it, and when we had extra time, (which happened from time to time,) we would do some deeper cleaning like scrubbing all the walls inch by inch, disinfecting the whole bathroom, cleaning the blinds etc. Even though we all had some extra time, we used it to make sure the rooms were always up to a very high standard.\n\nAs a result of this, we got a reputation of being an affordable but very clean hotel, so our popularity spiked. Even before we got so popular (in our prime we were booked full about 90&#37; of the days) our boss made a pretty nice amount of money. We don't have a reception, we're self-service (you just get a passcode for your room via text message) so he saved money with that. He drives an expensive car and seems very well off. We were never struggling financially.\n\nThen things started changing. We're a very close-knitted team of cleaners who have been in the house for years. A couple of us left at the end of last year (one moved to another state, another became a housewife after having a kid), and we started expecting newcomers to our team. They never came. Our boss claimed that it's hard to find workers for this kind of job. We never had anyone interviewed and I never saw ads anywhere that we're hiring, so I'm not sure he was even planning on replacing them. So our work pace got tighter. We managed somehow but there was no longer time for thorough cleaning.\n\nThen, the boss opened a restaurant so that the guests could have breakfast. Cleaning it daily got added to our workload (and that place is massive, it takes at least 1½ hours to clean daily). At the same time, he also opened a separate airbnb-style apartment (three bedrooms, kitchen, living room and bathroom) for larger groups who wanted to reside together. Cleaning that fell on us as well.\n\nSo suddenly, we were down two people (there were seven of us initially) and shoved two massive new responsibilities. We asked our boss again to hire more people, but he said no and that \"we've been having it too easy\" beforehand. He also refused to add another hour or two to our daily working hours (currently 9 a.m. to 3 p.m.). We have six hours and everything needs to be done at 3 p.m. sharp because that's when the new passcodes start working.\n\nUnderstandably, we were stressed out. There was suddenly far too much to do and our boss also simultaneously expected that we would keep up our usual cleaning standard. But when our time per room plummets from 45 min to 25 min tops (usually closer to 15), obviously we're not able to clean everything the way we did before. We would get yelled at when we got bad feedback because there wasn't enough time to clean thoroughly enough, customers who came in after our clean rooms were disappointed and took their business elsewhere. Also, my coworkers started calling in sick because they were burnt out. It was a mess, but our boss maintained the outlook that if he just pushed a massive amount of work on us, we'd somehow magically find an extra pair of hands and get everything done 100&#37;.\n\nLast week, we had a meeting with my coworkers. We discussed the current situation and to my surprise, everyone was considering quitting. Out of loyalty to our long-time employer, the five of us agreed to have a meeting with our boss and try to persuade him to hire more staff to bring the hotel back to its earlier standard. A couple of days later, we had the said meeting. Our boss was still in denial and said that we just need to up our pace and do things faster. He cited that most hotels give housekeepers about 20 minutes to do everything. We pointed out that it's true, but in that case he can't expect us to clean better than those hotels. He scoffed and told us \"If you don't like working here, then leave.\"\n\nThat was all we needed to hear. That night we had another meeting amongst us cleaners. We checked our contracts and realized there was no agreed on notice for resignation as we're at-will. So, we were all going to take his advice.\n\nThis morning, at 9 a.m. sharp, the five of us paid our boss a visit. The look on his face when we simultaneously slammed down our resignation letters and marched out, leaving no one to clean the whole hotel today, will warm my heart for the rest of my days. He was absolutely stunned.\n\nHe tried to call us to talk things over. Nuh uh, we just did what you told us to. Have fun replacing what was a motivated, loyal and dedicated team of cleaners who made your business bloom.\n\nTL;DR Boss refuses to replace employees who left and simultaneously adds a fuckton of work to us employees who are already struggling and burnt out. When we try to tell him that we can't take it anymore, he tells us that \"if we don't like it, then leave\". We take his advice and all resign simultaneously without prior notice, leaving him in deep shit. Feels good man.",
        "permalink": "/r/MaliciousCompliance/comments/8ykeqa/if_you_dont_like_it_then_leave_dont_mind_if_i_do/",
        "comments": [
            "It's amazing how a boss can shoot himself in the foot and be shocked that it hurts. :p",
            "[deleted]",
            "Considering how much you all put in and that he didn't want to pay for it? Good on all of you and best luck finding better employment ",
            "Cleaners are easy to find. **Good** cleaners are not. It sounds like your team went above and beyond, and if your hotel's reputation is as good as you said it was, being able to take credit for that should land you in a much better position. Well done.",
            "[deleted]",
            "You all should consider forming your own cleaning service, with 5 motivated and experienced people, it might be a great thing.\n\nEven if it's only 3 of you who want to do it, it could really work out.\n\nHell, you might even call your former boss and say that you:\n\n1) Won't go back to working for him as employees.\n\n2) You are now contractors negotiating together.\n\n3) You charge him double what you were getting paid. \n\nTrust me, you need double to make up for taxes, health care and other costs. \n\nHell, maybe even 2.5 times the employee rate if you factor in cleaning supplies and equipment.\n\nEven if he does't go for it, this really could be a good business opportunity for you.\n\nFor real, forming an LLC isn't hard.\n\nYou have the hard part down, finding a good staff that likes each other. \n\n",
            "You should band together and buy the hotel when he goes bankrupt from no employees",
            "Damn that felt good to read.\n\nHope you're in a better environment now. ",
            "It always blows my mind when someone can be so oblivious to what makes their business great in the first place",
            "This is happening to me right now.\n\nI’m an LPN working in an office that does primarily life insurance medical exams. I used to be a contracted worker and would only drive to peoples houses for the exams, or help with health fairs. Health fairs paid $25/hr. The contracted exams paid at minimum $17 per exam and my highest ones would be over $40 as they had blood and urine collection, height & weight, blood pressure, pulse, full medical history, and an EKG. If I had a couple I could make bank at a maximum of $80 or so in an hour of work.\n\nThe in-office nurse quit and a bunch of us took turns rotating in. My paychecks were a lot higher when I would work in the office as you can complete a lot more exams when you don’t have driving time in between each exam. I realized I liked working in the office a lot more than I liked having to drive around all over the place so I asked my boss if I could take over the in-office position and she agreed. Since I would be in-office I would become an hourly wage worker. She told me $17/hr, which I thought was fair enough since that would be the minimum I could make driving around and I often made less than that driving around if I had a bunch of basic exams spaced far apart that it took more than an hour to get to, plus I didn’t have to pay for gas anymore (we didn’t get mileage as independently contracted workers, we only got to write it off on taxes). My first few weeks were awesome. It was exactly what I wanted. Then things started to go downhill.\n\nI am the only examiner in the office. We have a quality control lady in the back offices with me who does purely clerical work. We have two receptionists up front who do all the scheduling and checking in and talking to agents, etc. One of the receptionist ladies had originally been hired in to do drug screens (random, post-accident, pre-employment, you get the idea) so she was responsible for doing all the drug screens that walked in. Between the two of us, things ran smoothly even on the rare occasion I would be double booked by accident. They rarely scheduled an 8am exam for me as 8am is when I am paid to start working and it would get somewhat stressful if I got there at 7:50 and the client had gotten there 20-30 minutes before their 8am appointment and was irritated to be kept waiting so long. The ladies told me they wouldn’t give me many of those unless the client could meet at no other time.\n\nAnother office in our area that does only drug screens closed down and suddenly the amount of drug screens coming in got way out of hand. We would have a waiting room with 5 or 6 people waiting for drug screens on top of life insurance exams. So my boss said she wanted me to get certified to do drug screens (to do federal ones, you must be professionally certified after taking an 8 hour class) so that I could help out in between my life insurance exams. Well, the front office lady hates having to stop her work up front and walk to the back of the office to do drug screens, so over a period of 2 months, I became the sole drug screener. She will do them only if the person has been waiting for 30+ minutes because I’m in with a full exam for life insurance but typically she will not do them anymore. I will come back from an exam to find 2-3 drug screen papers sitting on my desk for me to do, and will be expected to do them even when my next appointments show up for insurance.\n\nThen the QC lady started complaining that I don’t do enough cleaning in the exam rooms and processing lab. I’m not taking out the trash often enough, vacuuming, etc. so my boss tells me I need to be doing these things on top of my current duties.\n\nThen the ladies started giving me 8ams every single day, and giving me 3:30 and 4pm appointments (I am supposed to be out by no later than 4 because my boss does not want to pay overtime). This made it so that I often didn’t leave until 4:30-5 due to the time it takes to complete an exam, get the samples processed, upload the paperwork, and package everything up for FedEx. I put my foot down here and said that I cannot take anything after 3 for full exams and 3:30 for basic ones (I can typically complete a full in 20-30 min and a basic in 10-15, so this gives me enough time for all the post-exam things I have to do).\n\nThen they started moving my appointments into my name days in advance. To explain, our office has an account called OFFICE and an account in my name. OFFICE appointments are able to be booked remotely by customers using an online booking system. When appointments get moved from the OFFICE account to my account, whatever appointment time that appointment was for shows up as available in the OFFICE account. You can see where this would create trouble. Suddenly I was being double booked. Several times they would move the double booking to my name and I would be triple booked. Once I had 4 people scheduled for the same time. The ladies are supposed to call these appointments and get them rescheduled but they don’t, so if I don’t want to be double booked, I now have to make these calls myself.\n\nHealth fairs and drug screen events I am expected to go to at my boss’s discretion. I receive $17/hr instead of the $25/hr my contracted colleagues receive. Emergency breath alcohol tests and emergency drug screens (you have to drive immediately to the job site) I get paid $17/hr. My contracted colleagues get paid $175 (yes, one hundred seventy-five dollars) per 911 screening. I am randomly told to do Saturdays in a county 2 counties away (over an hour from my house) where I am paid again, $17/hr. Nobody asks me if I’m free to work that Saturday, they just tell me I’m working, so it’s impossible to make plans in advance.\n\nI do not have time to eat lunch. I do not have time to take any sort of break whatsoever. I do not have time to breathe and relax. My anxiety is so through the roof these days it’s a wonder I’m still working here. Many days I feel very close to breaking down, especially when I am tasked with so much that it seems impossible for me to achieve. On top of it, everyone is constantly on about how much better my predecessor was, about how much more she had to do (lol she quit but I guess they just overlook that little bit). But since this is one of the best paying jobs I’ve had, even if I’m being taken advantage of to the fullest, I have bills to pay and I keep showing up everyday. I am, however, taking matters into my own hands.\n\nI am enrolled in classes to complete my RN. From there, I will complete my BSN, and finally my CNM (nurse-midwife, a specialized nurse practitioner). I will be gone from this hole by the end of next year at the latest. I am obtaining a couple different certifications that should allow me to return to the contracted work and do appointments in my own time, as well as take on clients pertaining to my new certifications.\n\nEveryone deserves happiness. My plan takes, at minimum, 6 years to complete. At maximum, it could take 10+ years. Who knows? I’m taking online classes at a tiny community college and getting federal aid to help pay for it. Even if I didn’t have federal aid, the classes are $155 per credit hour and are 3-4 credit hours per course, so if I have to take one class per semester so I can afford it, I will. If you are stuck in a dead end job that makes you want to drive into a ditch every morning rather than show up, I promise you there are other options out there. Lots of areas, even small towns, offer weekend and evening classes and payment plans for many different certifications. STNA classes, phlebotomy classes, medical assisting classes, insurance classes, and so much more, are typically inexpensive classes, often offering payment plans that are manageable even with a minimum wage job. Manual labor apprenticeships require no skill and they pay you, you don’t pay them. I worked as an electrician for a year and even my tools and work boots I was allowed to have taken out of my paycheck in $10-25 increments. Find your passion. Find a stepping stone to get to your passion. For me, I started as a medical assistant. The electrical apprenticeship allowed me to pay for the medical assisting 12-week course. The job I got as a medical assistant paid enough to allow me to afford the 2 semester LPN license. The LPN is paying me enough to go for my RN, and so on and so forth. Nothing is unreachable, help is out there. Don’t give up even when it seems impossible.\n\nTL;DR: I’m in a shitty job that takes huge advantage of me. Using what I call the stepping stone method, I am making my life worth living 1 tiny step at a time, even though it is slower, because affordability is a big thing for me. I was born into poverty. I refuse to die in it too.",
            "Good for you guys. I think it's really important that employees demand respect. It sounds to me like you took pride in your work, and it's a shame that your manager didn't share that same pride. I hope you're on to bigger and better things where your drive can be appreciated!",
            "/r/TalesFromTheFrontDesk would appreciate this greatly.",
            "We're going to need a follow up to this tale.  Details about what the boss did for the next 2 weeks!  Please!!",
            "Do you know how the hotel is doing now without you guys?",
            "Given the short notice, he'll probably have to contract out cleaning services.  A contractor will charge him for every extra piece of work he tries to add on.",
            "Had something similar happen at a restaurant I worked as a line cook.  New owner bought the place, demanded we all start working more hours outside our agreed on schedules, and if we didn't like it, well, door's over there.  Even if we had schedule conflicts for things like church (as a part of my agreement for staying in my parents house without paying rent, I was required to go.) we were to accept the changes and deal with it, or else.  \n\nAbout half of us walked out right there.  \n\nEven more fitting, the restaurant was a favorite of the after-church crowd.   Since my dad was a pastor at one of the local churches, it got around quickly that he wasn't very supportive of people going to church...\n\nIt tanked pretty hard after that.",
            "This. This exact situation is why I hate most management. It's not usually the company that irks me....\n\nIt's the greedy, entitled, power tripping managers that, when you show your worth and hard work, they exploit it. Use it against you. Manipulate you for their benefit. And if you stand up for yourself and say something? It's always a \"There's the door\" attitude.\n\nExcuse me? I made you that money. I provided the exceptional service. And, at that, you're recompense is shit and you treat me like a fucking slave. A piece of shit. An object you can throw away.\n\nThe fucked up thing? It's only getting worse.",
            "This has to be the best malicious compliance yet. Everyone dreams of this scenario, and it’s awesome you banded together. I hope you and your (ex) coworkers are able to find alternative work without too much hassle. \n\nI also worked in housekeeping, and know exactly how you feel about time constraints against cleanliness. It’s a bitch, and when upper management start the whole “you’ve been working under an old school system, everyone does it like this now”, you know you’re about to start hating work. \n\nBest of luck.",
            "Give him a day or two, then negotiate coming back at higher pay, hours you like, and a written promise that he will hire X many employees in X days/weeks, with a penalty paid to y'all if he doesn't. :)",
            "I know the feels. I was employed at a certain Technology retail store (we will call it the fruit stand) as one of their more experienced technicians. Everything was fantastic. The whole team was like a giant family, spending the whole day just laughing and smiling. As a result, we had one of the highest customer service satisfaction scores in our region. Then everything changed once the fire nation attacked. \nWe had a few managers leave for other opportunities, and new management was more focused on their bonus then our humanity. They refused to hire when older technicians left, cut the times of our sessions by 10 minutes (brining is from 25 to 15), and took any simple pleasure we had away. No music was allowed in the repair room anymore, we were hounded for taking breaks for the bathroom or water, and they never told us a full truth about a situation. \nOne glorious mid October morning fate struck, and as I walked begrudgingly from the parking structure to the store front, I noticed the malls Maintenance  staff hoisting those giant tacky Christmas decorations. That was all I needed to muster the courage to walk in and quit on the spot. I did however give 1 week instead of walking out, as to make sure the bit of stick I had with the company vested properly. \nAfter a long much needed vacation I had applied, and been accepted for a new job with a new company. I walk into the room the first day to find that 4 of my coworkers from that old store had all done the same thing, and it brought joy to my heart. Nobody deserves to be treated like they aren’t valuable at there job. And to see my brethren drew the same conclusion and freed themselves as well was all I needed to know I had made the right choice. ",
            "Local tree surgeon company changed hands. New owner decided he could save money by cutting everyone's pay. The best hands immediately quit and went to work the next day for his competition, at the same or higher wages. The worst employees stayed. He replaced the ones who left with cheaper help. Then he started cost cutting on equipment. \n\nThe results were predictable. The old owner told me \"it took me 20 years to put together the best team in the business. It took him 6 months to throw it all away.\"\n\nLast I heard new owner was selling the business to his main competitor, for a fraction of what he paid for it.",
            "Good on all of you.  I hope you all find better employment elsewhere, soon.\n\nAnd to your boss: if you can't afford to pay your workers a decent wage, and hire enough people to actually do the work, you can't afford to be in business.",
            "This is by far my favorite malicious compliance story! Good job on giving the middle finger to that ex-boss of yours! Best of luck for your next gig!",
            "Having been part of a mass exit I can confirm it is the best feeling. \nThe bosses face suddenly realising “oh I’ve fucked up” it’s one I will not forget. ",
            "[deleted]",
            "I've been a chef for years at first in nice restaurants all over the country and as I aged I moved to hotels. We were running a 51 percent profit in food and beverage in this one hotel and I took a lot of pride in a lot of it being because of me. If you aren't familiar with profit in restaurants 50 percent is unreachable. In hotels is as good as if gets.\n\nWe get a new operations manager who oversees multiple hotels and he brings in this arrogant asshat consultant. Makes us use cheaper products. I refused and almost lost my job.\n\nThey basically ruined something that took me years to build. Right now I just took over a hotel that is zero profit in food and beverage. They would kill for ten percent profit.\n\nSome people just suck.",
            "I see it pop up in the responses below, but a great final touch would be for the five of you to create your own cleaning company, High Quality Cleaners or similar, then cold-call/ offer services to said boss, but at double rates (or more!) and allotting greater time for cleaning in the contract.\n\nExcellent compliance.\n\nGood Luck! ",
            "Honestly, I‘ll never understand idiots like that.\n\nI mean, just mathematically that doesn‘t make any sense.\n\nThen the whole „you‘ve had it too easy“... bruh, you didn‘t clean with them did you? They were there from the start, so you can‘t say „yeah, but these guys could do it in less time“.\n\nHow the fuck does someone like that manage to run a successful business even for a short amount of time is beyond me. ",
            "Man, I loved reading this story!\n\nI was once told the same thing, \"If you don't like it, leave.\"  I put my notice in the next day.  Not long after I left, the place closed down.  \n\nSo. \n\nSatisfying.\n\nEmployers really need to realize that it's happy employees that make for happy customers.  Take good care of your employees, and they'll take good care of your business and guests.  ",
            "You were acting like a union, you should have demanded raises across the board and threatened to strike.",
            "I'm in IT but my bosses pulled exactly this shit in my meeting with them today.  Told me there is no prospect of improvement on either our workload, or staffing level, but that I should stop having a \"defeatist\" attitude about it.  \"Fuck You\" is my attitude now.",
            "People dont leave jobs, they leave shitty boss's and its the shitty boss's who dont know this.",
            "Fast, cheap, or high quality: pick two. People who expect all three are delusional or have no idea what the job actually entails.",
            "It makes me sad that employers don't know the difference between good workers, bad workers, and workers who are being pushed too far. I have done the same thing before. Honestly, the business \"coincidentally\" always seems to go out of business in the next 6-18 months.",
            "It amazes me how many business owners attribute their success purely to their own savvy, disregarding the hard work of those working below them. ",
            "Good for you and your co-workers! I left a job once under somewhat similar circumstances and I still remember the color draining from my boss’s face when I told him I was leaving. It was as if it had never occurred to him that when he continually said no to every reasonable request I made, I might quit. Served him right.\n",
            "I wanna gag after this story. Stupid bosses. Who do they think is making them rich and comfortable??? Employees should be treated with respect and be taken care of. \n\nI’m so glad you guys did what you did. I hope each and everyone of you is doing okay and quickly find new and better jobs!",
            "Removed",
            "This story should end with the 5 of you starting your own cleaning service. Then opening a competing air BnB or hotel taking down your old boss. Eventually owning a chain of successful and super clean hotels. ",
            "When looking for a new job (assuming housekeeping) be sure to print reviews that mention cleanliness of your property.  A prospective employer will not only appreciate this but you might even get a premium. ",
            "The kind of stupid manager that thinks that all the success comes from his work since he's at the top of the ladder (or local ladder). These types need what OP did to realize that other workers below them aren't just useless freeloading \"robots\" they can rage on whenever something goes wrong.",
            "Malicious compliance at it's best! Well done, and best of luck!",
            "I wish one of you wins the lotto and buys the Hotel from his bankrupt ass one day!",
            "Guy got greedy. He was making a fuck ton, I used to book hotels and guest raring was always the most important factor for booking. Guys gonna learn the hard way. ",
            "Should've unionized and really fucked him.",
            "Damn if y’all are in California, I’ll hire you all of you. ",
            "This is why employers fear unions. Organized workers have power to affect the business, and can no longer be treated as disposable. \n\nHopefully your old boss learned something. ",
            "This made my day  \nWORKERS, UNITE!",
            "I like this story. You guys tried and tried to get him to see your side. Out of loyalty you guys didn't just up and quit and he disrespected you. All of you really deserved better. He tried to cut corners and cheap out because he knew he could take advantage of your loyalty. Serves him right.\n\nDid you think of maybe forming a cleaning service with your other coworkers?",
            "Similar situation with my Dad. He worked as the sole maintenance man for a factory for nearly two years after a new company bought them out. They kept promising to hire more bodies, but after 18 years of loyalty he got bumpkins, so he left them in the lurch two days ago. They'll easily lose hundreds of thousands finding replacements that can top him. HR was ready to offer him the moon to come back...",
            "And that is worker power at its finest. Fuck your boss ",
            "I think you all should start your own business. If you need a website to help you on your way to that, I'll do it for free. ",
            "This is one of the most satisfying r/maliciouscompliance stories I have ever read. You guys literally made this guy's business flourish because of your hard work and not only did he not reward you for it, but completely screwed you guys over only to have the favor returned. Well done!",
            "Remind me whenever it all falls massively apart. Has it already?",
            "Hope he started cleaning.",
            "[For you.](https://www.youtube.com/watch?v=koJlIGDImiU)",
            "Have the 5 of you thought about starting a cleaning business together? Sounds like you’d do pretty well.",
            "Play bitch games, get bitch prizes.",
            "bad bosses spoil a business.",
            "This is a good read, serves him right! Hope u are in a better work place now",
            "I LOVE you.   Awesome, just perfect.",
            "An ungrateful idiot that got what he deserved ",
            "Very proud of you all, what you did takes guts! Good on you for refusing to be taken advantage of any longer :)",
            "Oooh. I hope we get a future update on what happened to that hotel!",
            "Hey managers: Treat your employees well, and they will be good employees for life.\n\nYou treat them like shit and don't listen when they need things, then they will fuck you over, hard.",
            "I'm not sure if this is often asked for in MaliciousCompliance, but please update us on the situation!  We would love to hear how this turns out!",
            "YES VOTE WITH YOUR FEET. I needed to read this right now. ",
            "I think one of the basic business practices should be to take care of the people that take care of you.\n\nWhen Corporate entities start seeing and treating people as corporate cogs, thats essentially what we become(see Hell, Retail)\n\nThey seem surprised that when you treat people like people we develop a sense of pride in what we do, regardless of position or \"status\"",
            "I left working in hotels for these very kind of reasons. I like this sub because many times it's us decent employees having it back at assholish customers and/or managers. Your MC post resonates very, very strongly with me. Always stupid problems arising because « we really, really can't afford to hire sb else / renew the A/C system / wifi system / safe batteries (!) / elevator » etc. \n\nEver since I'd had that very shitty manager once, I hoped I could get everyone out all at once if I won the lottery. First thing I'd do. I have left this place a long time ago now, hardly anyone I know still works there, but I'd still do it for the sake of those who do provided it's the same manager.\n\nI'm experiencing what I believe is my most intense shadenfreude ever, thanks man :-)",
            "This is the most satisfying MC story I’ve ever read. If only we could do this to corporate America.",
            "#SOLIDARITY",
            "Oh God OP, please update us ",
            "Solidarity forever.",
            "Yet another instance of a business expanding beyond its means and thus ruining the good thing it had going.\n\nFuck, just let your lucrative business keep doing its thing! Don't succumb to greed to try to make more money and ruin what you have!",
            "Sounds like he got greedy.",
            "Damn, right now I wish that I had a motel!  You all sound like an excellent team, and someone will be lucky to snatch up the group of you...",
            "Wow you boss is an idiot. He literally wanted to avoid hiring one or two people, and now he's gotta hire and train by himself 5 or 6",
            "I wish I had workers like your crew. The fact you took pride in your work is rare it seems these days. All of you are gems. Not all bosses are inept. I hope you and your crew find that balance where your appreciated and paid appropriately. ",
            "I wonder what he did that day... and for the following days...",
            "Hmmm is that the crispy smell of well-cooked Capitalist Pig?  \n\nWell done, I hope you'll have no issue on finding a better envoirment for yourselves, best of luck!",
            "Idk what your situation is now but if you guys are the crack-team of cleaners you say you are I would look into starting your own cleaning business. Work for yourself and hold yourself to your own high standards, lord knows the world needs more business owners like you who take pride in a job well done and not just maximizing their profit margins. ",
            "OP, have you thought about you and hubby staying there once just to then complain to 'the manager/owner' about how dirty the place is - in front of other people using your inside knowledge to point out certain things that wouldn't have been done due to time constraints? maybe a message to whatever oversees these places? like board of health if somethings dirty etc\n\nand demand a refund and an apology from him - as a customer of course",
            "Power to the people on a united front. Good for you- no, Great for you all!! ",
            "I love this. You should let us know what happens to the place",
            "This is the power of collective action. Right on!",
            "If you had used this to negotiate better contracts that would be a union",
            "/r/prorevenge I hate greedy boss. ",
            "Outstanding",
            "You guys need to start your own business!",
            "This is awesome!  And, it turns out, this is the solution we workers have against all companies (large and small) treating us workers like we are really property or some vague resource, not people who have needs, dreams, and desires also.\n\nWe really DO have the power to change all this.  Refuse to work for ANY companies that treat people like shit, and those companies will eventually be forced into changing, or will go out of business.  BOTH of those outcomes give us working souls \"the win\".  But staying and suffering it gives THEM courage to continue mistreatment.\n\n* Note I'm talking about **actual** mistreatment here (like halving staff but doubling workloads, or physical or emotional abuse, etc.) and not merely uncomfortable situations (having to work with people i don't like, sitting in a cube that's ugly or too small, not having an office, long drive to work, etc.)",
            "This is how everyone should behave. Have respect for yourself and don't earn money for people who want to make your life worse. Good Job!",
            "It sounds like he really fucked up. I bet he could’ve made *more* money had treated you all well, paid well, etc. Happy employees = better service. It’s sad how many business owners and managers don’t understand this. ",
            "This kind of thing is way too common where companies are too focused on profit and not focused enough on profitablity. Overworking employees doesn't actually produce more value.",
            "Play stupid games with your loyal cleaners, win stupid prizes.",
            "https://help.glassdoor.com/article/Tips-on-writing-a-review-to-avoid-defamation/en_US/",
            "And so, another successful strike has been undertaken.",
            "What a fucking idiot. He deserved all the shit he got for that and more.",
            "You guys should definitely try and start up your own cleaning business. ",
            "Congratulations that is the best MC story I’ve ever read. Hope things worked out for you. ",
            "The price of greed. I love it!",
            "You had my upvote after 2 paragraphs. The rest was pure bliss.",
            "Do you have any follow up story after all of you leave? Is the business still alive? ",
            "This the of mentality will always battle me with bad bosses. I’ve seen my share of good and bad come and go and I’ll never understand how bad bosses can keep piling on work and then be shocked when it all falls to shit around them.",
            "You. Rock. I wish you the utmost luck in finding a better job, where your efforts are appreciated",
            "Fuck bosses, especially this kind of boss. Goddamn leech. Good on you and your colleagues!",
            "I like how you describe your impact as making his business bloom rather than making his business boom. Good word choice that did not go unappreciated. ",
            "Calling it now: boss is using money from the hotel to fund his drug addiction.",
            "I'd like to point out that rule three forbids discussion on an event actually occurring. \n\nJust a reminder, nothing more. No rule about reminding people about rule three. \n\nDon't forget rule three. \n\n/r/maliciouscompliance ",
            "Sounds like it is time to go on trip advisor and make a few complaints about the cleanliness of the hotel with dates after you all quit.",
            "I love how you joined five hours ago and you have more karma than I got in two years",
            "Stop! My penis can only get so erect\n...",
            "Fantastic.",
            "Wow, this is so awesome. Good luck to you and report back to us. ",
            "Is he still in business?",
            "Please OP start a cleaning business and make this professional revenge.",
            "Loyal to the end. Love it.",
            "So the dude wanted you to do more work with less people at the same standard?\n\nHow tf did he think it was gonna turn out?",
            "Nothing pisses me off than when a greedy idiot ruins everything.",
            "[Just right](https://i.imgur.com/IazJWlU.jpg)",
            "What an ass. I hope you have better luck with future employers, OP. ",
            "Savage.  Absolutely savage.\n\nCongrats.",
            "Good for you. Awesome that you all did it together! I hope you find something great where you can work to the standards you want with plenty of time to do so. Maybe you and your crew should start a cleaning business. There are probably many Air BnB type places that would use your company but don't need full time staff and you could send your old boss a business card and a nice note with your cleaning fees\n\nEdit: Just reading through the comments and everybody's suggesting starting your own biz! Go for it and don't look back (except to point and laugh)!",
            "Should have shit all over the place first ",
            "I admire you and your co-workers for your high work ethic and sense of self-worth.  Hopefully your next employer will be smart enough to recognize it.",
            "Or we could all at once retire",
            "It boggles the mind, doesn't it?  Let's get rid of the thing that was the main reason we were getting great business in the first place!  Greedy, stupid people..."
        ]
    },
    {
        "post_id": "g26eja",
        "author": "deeba_",
        "title": "No problem, I’ll print that video for you! And while I’m at it, I might have you fired as well.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/g26eja/no_problem_ill_print_that_video_for_you_and_while/",
        "score": 16294,
        "num_comments": 475,
        "created_utc": 1587004459.0,
        "selftext": "Hi all, This is my first submission to the sub and I hope you enjoy it! There’s a tl:dr at the bottom. \n\nContext: \nThis happened a few years ago, I was 18 and working as a receptionist for a  community nursing service. As the youngest in the team by a long shot (the average age of employees being around 55-60), I was usually the one responsible for the “Computer Stuff”, mostly just simple things - nothing a quick google couldn’t solve. The other staff members were wonderful, and I learnt a lot from working with them. \n\nExcept for the Assistant Manager, Karen. This woman was the bane of my existence, she was 75+, recently came out of a 15 year retirement as a receptionist, and was armed with a certificate in Business Management from a 4 hour online course. She refused to use basic computer skills such as Word or email, stating that she didn’t need to learn them again when she had others to do it for her - namely me. In a 5 hour shift, I would spend 3 hours just fielding her tasks. Needless to say, this came along with all the fun personality traits that make a ‘Manager from Hell’. \n\nMalicious compliance:\nAt the start of my shift, I receive an email from Karen asking me to print the attached files, one was a pdf and the other an mp4. So, assuming she meant just the pdf, I take the printed copy to her. \n\nThis is roughly how the exchange went:\n\nKaren: Why do you only have one file, I sent two?\n\nMe: ...you want me to print an mp4?\n\nKaren: Isn’t that what I asked? A monkey could do your job, and probably better at that (here, I’m pretty sure she laughed at her own joke). \n\nMe, desperate: Look, I don’t think you understand - \n\nKaren: Don’t try and teach me, don’t forget I did your job for 20 years and now, I could have you fired. \n\nAlready over it, and ready for some malicious compliance, me: Okay, well I’ve never printed this type of file before, so it might take a while -\n\nKaren interrupts: I don’t care how long it takes, I’m your boss and I’ve told you to do this. Once it’s done you can move on to the other jobs. \n\nI’m grinning ear to ear at this point, I get back to my desk and send her an email summarising our conversation and explicitly clarifying she wanted me to print an mp4, to which I got a snarky reply. Perfect. \n\nI spent the next 4-5 hours, pausing the video every 2-3 frames, screenshotting it, pasting it to a word document and printing. The administrative tasks piled up, not that Karen noticed because she mostly spent her time reading magazines/talking on the phone. I felt bad as this placed an extra load on the other receptionists; however since Karen was universally hated, they gave me their blessings. \n\nOnce complete, I took about 100 pages carefully held with clips to her desk and sweetly told her that I’d printed the other file. She looked smug, until she saw what was in front of her. Page after page of almost the same picture as the man moves through the video, some slightly blurry, all in full colour. She was furious, to say the least, but I was 1 hour overtime on my shift and Karen knew that would already cause her some issues, so she let me leave. Though, I knew it wasn’t over yet. \n\nAs expected, I get called into HR for a meeting the following week, where they accused me of wasting company time and not complying with management. I explained the situation in detail, and showed them the email (including her awful reply). I also showed them a few more emails and texts where Karen used some particularly ‘descriptive’ words to insult our staff members, including the very HR rep taking my interview. \n\nTurns out, this was the straw that broke the camel’s back as Karen had multiple reports against her from other staff members, and she had been driving HR insane with her own complaints. She lost her job the following week. \n\nThe best part is that this happened on a Sunday, where I got double pay. I took some of that sweet overtime cash and brought in cupcakes to work once Karen was gone. I said it was an end of week treat, but we all knew what we were celebrating. The HR rep seemed to particularly enjoy hers. \n\n\nTLDR: Boss made me print a video. Complied, used a whole shift and overtime. Got called into HR which added to the case against my boss. She was fired within a week. Cupcakes to celebrate.\n\n\n^**Edit:** ^^thank ^^^you ^^^^for ^^^^^the ^^^^^^gold ^^^^^^and ^^^^^^awards!",
        "permalink": "/r/MaliciousCompliance/comments/g26eja/no_problem_ill_print_that_video_for_you_and_while/",
        "comments": [
            "This is the best and it was so smart for you to get the verification in email.",
            "That is awesome!\n\nBut you have to tell us, what the hell was she actually expecting with the MP4 file?",
            "[deleted]",
            "I genuinely haven't heard that one before. Print an mp4.\n\nI've seen requests for stills, but not for just the entire file. Well played",
            "Our former company president questioned the invoices from the company maintaining our web sites (six brands; six sites).  I explained the volume of work on multiple sites.  He said I needed to print the web sites so he would have an idea how big it was.  I tried to explain that the sites are huge, change all the time, and are available to view at any time, so you don't need a printed copy.  Nope, he wanted a printed copy.  I was not going to waste my time on this stupidity, so I got a quote from the web developers to do it.  A couple of weeks later we received two huge three-ring binders of printed web site pages - a veritable monument to the company president's idiocy.  I dropped them on his desk along with an invoice for almost $3,000.  I am pretty sure he never got past the first five pages before he realized how stupid it was to read printed web pages.  He was forced out within the year for his horrid management practices (and we later found out he was screwing the frumpy HR assistant).  The executive assistant brought the binders to my office and asked if I needed them.  \"No, you can trash them.\"",
            "You know you are *real* popular when they hold your 'Going Away Party' the day after you leave.",
            "\"Go download me a hoagie off the internet\"",
            "Protip: if it was on any google app(classroom, gmail, youtube, etc.), you can use *shortcuts* on a PC/Mac. Namely, '.' and ',' which allow you to go forward or back *one, single frame*. That would be exponentially better, with full malice and compliance.",
            "Well, serves her right.",
            "This is truly beautiful. \n\nDo you mind if I ask what the purpose of the video was? Was it surveillance footage of a crime or something? You said it was just a man walking, so I'm extremely curious.",
            "In all honesty - I would’ve just opened the MP4 in word, and printed the 1000 pages of code.\n\nHere’s your file, Karen...\n\nE2S5W8RF DZV2S6V2YH69LAL8 KGEYP5UN 3NBKCN46 CXDUMSCT DJUZGRJY 5LBBMMQT JYNN2294 6UKNZXEX RD3HL9XW Y48W5CA4 F47KZFTC QQAC7KAF ZECZ62PA ZD76CP8B HWSNA2GN Z5X2RQHU VHSW59X9 PV6TRA9L TA8MGLD8 ZG7WTHVC UT6ASYZY N59HSRK3 8EEV5DZM MSCWQ6BZ TKJK7QRK GGFA4KV6 G5RPKN9A XUESA598 8T2BFUGY WDWV4KZU DEQ9TTLY 4KLHBVTT MYV78H8V LU7T2A97 CCKBKJ4A KAQWSEX3 LHR2YD3J KM2CAQD7 TQT65ME3 23F7MPHU 5BYVS2ES 2XNARXVA",
            "I...didn't think it was possible to print a movie. Kudos to you for figuring it out.",
            "Worst one I've had working in IT is someone trying to print an Excel spreadsheet to a Dymo labelwriter printer.\n\nFortunately, the Dymo seized up and wouldn't print at all, or I could see that burning up a roll of labels in short order.",
            "Print...a video. I'm done.",
            "I applaud the amount of effort and concentration that you wouldve spent trying to print out that one video.\nOP is clearly a person of focus, commitment, and sheer fucking will.",
            "How'd HR get involved? Did your boss report you or something?",
            "Very good.",
            "This story is brilliant. thank you for putting a smile on my face and giving me a good laugh. Best part was, I could just imagine you walking into her office with 100 pages and seeing Karen’s face go from smug to WTF? Would have been great to have seen her face 😂.",
            "I work as a video editor and I got this request once too. We have a number of online proofing tools or large file delivery applications, but this one, particularly Bat Shit Crazy Lady client didn’t want to use them because she didn’t want to ‘use up’ her internet at home, so she wanted a PDF copy. I suppose, in hindsight, I could have just cut her a copy, put it on a flash drive and send it over, but I was feeling especially Douchebaggy that day.\n\nThe project we were working on was about 8 minutes long and I had the editor export the timeline as a .png sequence, then turned the folder into one giant 29 000+ page 47GB PDF. We tried at first on just one of the office laptops but it kept crashing so eventually we let it run overnight on one of the 4K NLE systems, one with 24 processors and 96 GB of RAM. We put the resulting file on a flash drive and I had our receptionist courier it to BSCL.\n\nCouple days go by, didn’t hear from her, thought that maybe she liked it. Finally she calls me and asks me if this is some kind of joke. The file kept making her craptop BSOD, finally it opened on her son’s gaming laptop, but......there’s no audio! She was quite rude, made a number of comments about the quality of our work, my competency, my lineage, etc.\n\nFinally had enough and asked exactly how she thought we could transform a digital medium into a physical print medium? She said, “how the fuck do I know, you’re the professionals!” No matter how many times or how many different ways I explained it she refused to understand it couldn’t be done, said she got them from other, ‘more competent’ suppliers in the past. Finally told her I would send her a MP4 copy on a flash drive, but I ensured we had our logo prominently watermarking the entire video.\n\nDidn’t hear from her for a couple of weeks until she called me up one morning to say she loved the video but needed a copy right away without the watermark as it was going to be played at an event that night. I told her she needed to come by and pay us in full, plus there would be a rush charge for the short notice. We had to stop a render job to run this one. She didn’t like it, but agreed to come by in 2 hours and I’d have the final output on a flash drive for her.\n\nWhen BSCL showed up she told our receptionist she was there to pick up the drive but I had told her not to release it to her until she received full payment, about $11 750.00. Took a sizeable interac transaction and maxing out 3 credit cards but we got just under $8000.00 from her. She promised to pay the balance the following and I, against my better judgment, released the video to her. Natch she didn’t come in the next week and promptly went radio silent.\n\nWe still had her 3 credit card numbers on file though, plus signed contracts and change orders, and a signed balance due invoice, so we just started running her cards, twice a day, everyday. Took a month but got payment in full. Predictably, got chargeback notices from the credit card companies, but our preponderance of signed documentation stopped that dead.",
            "Great job OP, but you could have done that automatically with VLC.  https://www.isimonbrown.co.uk/vlc-export-frames/",
            "This happened to me once. Had to print a YT vid. Except instead of printing every frame, I just printed the thumbnail.",
            "\"That's not how this works! That's not how any of this works!\"",
            ">A monkey could do your job, and probably better at that\n\nI don't know Karen, can you do it? Oh you can't, guess you are dumber than a monkey.\n\nYou really should have bound it on one side to make it a flip book and brought it to her and flipped through it in front of her.",
            "Shame she didn't take the 5 hour online course, she might've been taught to not expect people to do, what you can't already yourself. Or at least listen to the opinions of others before forcing a course of action.",
            "[deleted]",
            "Pro tip: you can use FFMPEG (runs as a portable version no installation or admin account required) to export every single frame of a video (or just certain time intervals) to .png files. Then just use windows inbuilt printing tool to print all of them preferably in a grid. 5 min of work + 1/2h of printing and you're done... :D    \nThe command I used: .\\ffmpeg.exe -i [path to]\\video.mp4 [Path to output folder]\\Out$test%04d.png",
            "\"Don’t try and teach me\"  This is a sure sign of a bad co-worker and worse boss.  Everybody knows something you don't.  Ignore the warnings of your underlings at your peril.  You don't always have to act on those warnings, but you should always hear someone out before making the decision.",
            "I know this is over 2 years old. But I had just seen a recent news article on bored panda so I had to come check out the post for myself. Brilliantly handled and played out. Great job keeping records of everything.",
            "Not ragging on you, this is great... but in case you, or anyone else has to do this again, I bet you could figure out a VLC command-line which would do 90% of this without anywhere near so much tedious work.",
            "I thought you were going to print the binary data.  You could have used up all the paper in the city.\n\nYour method did her a favor.",
            "This is fucking legendary",
            "If you want a better way to get the frames of a video, run this command on terminal for apple, or linux computers:\n\nffmpeg -i someVideo.mp4 \"frame%04d.jpg\" -hide_banner\n\nWhere 'someVideo.mp4' is your video",
            "Demanding Luddites who are in charge of \"computer people\" should always be aware of which skills they themselves do not possess.  If they are willing to expose their own ignorance and be nasty about it too, they should try to enjoy the ride on the Incompetence Express!  Choo-Choo!  Now leaving the station!  Next Stop: UNEMPLOYMENT.",
            "For future reference, you can use ffmpeg to automatically split a video into a collection of images, and then you could bulk print the images.  Would be much faster, and require FAR less manual labor.\n\nAnd would result in more pages because it would hit literally every frame...",
            "I used to do email support and a customer called me wanting to know how to \"print an attachment\". After speaking with this woman for a bit, I realized that she was trying to print a video file (and she KNEW it was a video file).\n\nTo this day I regret that I was too flabbergasted to instruct her to right click on the file and select \"Open With->Notepad\" and then print that. This was 9 years ago, and had I had her do this, that print job MIGHT just be finishing up now.",
            "Should have used FFMPEG to extract the video to frames, that would have been probably WAY more than 100 pages, considering at regular 24fps 4 seconds is already 100 frames...",
            "If you wanted to be particularly malicious, videos have 30 frames every second so that would be 30 pages of full color for every second of video. And you can use programs like VLC to export every frame as an image, and then do a bulk print of all images. So for a 5 minute video you would go through 9,000 pages of full color prints, and it’s all automated so it wouldn’t take you long to do.",
            "I work in a print shop and I wish I could say no one has ever asked me to print videos for them.",
            "Remember friends \"can we chat in person?\" Actually means: \"I don't want a paper trail\" \n\nAlways send a follow up email summarizing all key points from the conversation, and save the reply of course :)",
            "I got this on the news feed TODAY (2023-01-12) lmao.",
            "This is a man of dedication and perseverance.",
            "Ngl, I thought the story would involve porn and was pretty nervous when you started talking about an old lady.",
            "[deleted]",
            "I love when people are so smug and dicks about something they know nothing about or bother to learn about. Oh wait, I don't love that. I love when they get what is coming to them.",
            "God, I love it when asshats think they're too good to have to learn technology like a common pleb- then immediately get bit in the ass by their own willful ignorance.",
            "I would have filmed myself flipping her the bird, printed out an mp4 of it, then mail it to her from an anonymous mailbox.",
            "Madlad. Printed a fucking MP4",
            "> send her an email summarising our conversation and explicitly clarifying she wanted me to print an mp4, to which I got a snarky reply.\n\n\nBravo - it took me a LONG time to learn to do that to ensure I had proof of someone's idiocy.",
            "The cupcakes at the end really did it for me, thank you for sharing. We had a notorious superintendent resign due to some shady business dealing and the music for passing periods that week was the witch is dead song from the wizard of oz. the principal had to know. She really was a witch though",
            "#Idreamofbeingthispetty",
            "PRINT a video. welp, now i can say ive heard that story.",
            "I know this is two years old, but, as a hobbyist programmer and IT major, I personally would have written a script to print EVERY SINGLE FRAME of that video",
            "    hexdump file.mp4 | lpr",
            "I figured you would open the file as a text document and print the random mess of letters it can produce, this is much more satisfying",
            "Lol!! Even my grandma knows you can't print videos XDDD",
            "Ding! Dong! The bitch is dead!!!!",
            "Open Photoshop file> import video frames as layers and print each layer 1 by 1",
            "I must read this. Mods unblock pls.",
            "That cupcake must have been very sweet.",
            "This is r/prorevenge stuff, if op was aiming for it!",
            "I'd have printed the video out directly as a text file, complete with the possibility of breaking the printer unrecoverably.",
            "Every 2-3 frames? Could've done 2-3 times the paper and ink\n\nProbably for your own sanity tho",
            "At the law firm I worked at we'd sometimes get calls for stuff like this but they would listen (shocking, I know) when we explained that you can't print a video file.",
            "I was expecting you to print out the code.  That would've been a ton of pages as well and she would've been completely confused.  Did she want all those photos from the mp4?  Just wondering.",
            "when karen becomes the manager the unthinkable happens",
            "Ah. I have a program that takes can do screenshots from the video and an option is to take every frame. Combined with my adobe pro that I can drag and drop all files into the program and combine all said images into a pdf. \n\nExcellent execution!",
            "OP you have to tell us: what did that MP4 file contain?",
            "I don't let anyone talk to me like that anymore but I understand you were 18 lol",
            "There is a simple beauty to this one.  *Thorough* compliance... *very* malicious.  Well done, indeed.",
            "Way to go!",
            "I'm just thinking about how you could've used blender to separate every frame into a png and then hit Ctrl + a, right clicked, and then print. Would've saved you a ton of time.",
            "wow. This one was a nice read",
            "She got what she deserved, but my first thought was for all that wasted paper...",
            "I think Karen was a bit too much into Harry Potter.",
            "My idea of printing it was to get a hex dump of the file and print out the bits.",
            "Ah, that felt good to read this! Thanks, OP!",
            "Should've opened it in notepad and printed the gibberish.",
            "Revenge cupcakes taste even better!",
            "GD a satisfying story AND cupcakes.",
            "Nice one",
            "Hmmm. Sounds like the dinosaur production company I use to work for in LA.\n\nGood shit.",
            "Hey OP I've never seen Gone With The Wind and my DVD player is broken can you print me a copy please?",
            "Brilliant",
            "[deleted]",
            "I'd changed the extension to .txt and open it in \"notepad\" then hit print... and dropped it at her desk.  Binary would be fun too.  Used up a couple of boxes of paper.  Don't get me wrong that was classic.",
            "I love this story, thank you for sharing! I would so have been one of those backlogged colleagues, cheering you on from my desk. So smart of you to get the confirmation in email!",
            "Good on ya! Hopefully Karen is seething in retirement",
            "I have got to say, that was very enjoyable! I also have a story where I got not 1 but 2 people fired. It happened about 12 years ago so remembering is gonna take time. I’m not gonna post it here prolly on another post.",
            "The cupcakes thing makes me happy. Everyone has a weight off their shoulders and you're being awesome to your fellow coworkers and get to celebrate",
            "I was having an absolutely shit week and this just made up for the entire thing. Thank you.",
            "There is a system in the Library of Congress where they print every frame of a motion picture to have a hard copy record. That was in the days of film release. I'm not sure if they still do that.",
            "First of all, who the F even prints out stuff before reading/opening them ? \n\nSecond, I actually had an English Teacher in school who gave us a video assignment that had to be submitted in paper. We landed up having a good laugh with classmates but didn't dare try this, cuz I had to pay for the print out.",
            "Of course her name was Karen!",
            "lmao. this is great.",
            "Great job!  \nIf something like that ever happens to you again, convert that shit to text format, and watch the printer burn!",
            "i love these, thanks for sharing.",
            "This has resurfaced on fb IT humor and memes  page today lol",
            "As a video editor, I was thinking, easy. Throw it into Adobe Premiere, export as a series of images. And then print the whole stack. It would have used just as much paper, but not as much time.  \nBut most people don't have access to that.",
            "Even more evidence that we were all better off living in teepees and eating stuff off of the ground.",
            "[bye bitch ;)](https://www.youtube.com/watch?v=1aA_ahUweyw)",
            "Some video editors let you export videos as an image sequence, might be useful...",
            "Removed. Please edit to remove abbreviation of names then message me here or send a message to the moderators to have it restored.\n\nP.s. our rules do not allow anyone else to do it for the OP or try to bypass the removal.",
            "[removed]",
            "Good on you to confront her bullshit. I would have just used a video utility to directly decompress the video into frames instead of wasting time doing screenshot.\n\nI mean why waste your time and talent on idiots like her?",
            "I could swear I’ve heard this story before",
            "If she can't use email, how did you start your day with an email from her that contains multiple attachments?",
            "100 pages = 200-300 frames\n\n\n300 / 24fps = 12.5 second long video?",
            "Doesn't know how to use Word or email.... sends you emails. 🤔",
            "How did she manage to complete an online course when she never learned how to use email?",
            "i have a question, if it isn't confidential information:\n\nwhat did she even need the video for, and why on paper?  from the description\n\n>...page after page of almost the same picture as the man moves through the video, some slightly blurry, all in full color.\n\nit sounds kind of like security footage, maybe?  not sure.  i have no idea if you're allowed to tell or not, but you don't have to! :)",
            "Is that karen is a boomer from the age where video file haven't exist and just use time machine to the future and doesn't understand how things work right now?",
            "[deleted]",
            "\"a monkey could do your job\"\n\nAnd you didn't say anything back?\n\n\nI guess you are a monkey.",
            "[removed]",
            "Idk man \n\nkinda sounds like you were a dick to an old lady who hasn't worked in 20 years and then got her fired for not understanding technology and having shit social skills , probably from not working for 20 years\n\nI'm failing to see how you're the good guy here",
            "so, transfer to DVD didn't cross your mind ?",
            "... *slow clap*\nYou're amazing.",
            "I would have opened it as a text file and printed it out",
            "Looks like someone forgot that it's \"hire slow, fire fast\" and not the other way around. No idea why the Karen was allowed to stay as long as she did. I would have fired her the first time she attacked another of my employees or myself.",
            "Wow, you really went all out on this one. I would have just printed the raw hexadecimal of the MP4 file and given it to her like that...",
            "Nice",
            "One day we will be printing mp4s out onto paper...",
            "Best part of this story is where you buy the cupcakes... 10/10 relatable",
            "Its a video. Do you want me to print a video?"
        ]
    },
    {
        "post_id": "yw430b",
        "author": "LadyBladeWarAngel",
        "title": "My Cousin Thought She Was Being So Clever. It Did NOT Work Out For Her.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yw430b/my_cousin_thought_she_was_being_so_clever_it_did/",
        "score": 16278,
        "num_comments": 336,
        "created_utc": 1668533783.0,
        "selftext": "So here’s a malicious compliance story that made my family laugh for years, and still does. \n\nA good few years back, I was about 24-25 years old, I went to Cyprus with my grandparents to visit relatives. My grandparents originally came from there and moved to the UK when they were like… 16. My cousin, 14 female, also came along. \n\nNow it’s important to mention that we’re Greek Cypriots. Certain things are expected when we visit relatives. Such as helping out with things if we can, and offering our help for whatever our host might be doing. It’s also worth mentioning that I have a sight problem, but I’m extremely independent in spite of it.\n\nSo we were visiting relatives and every time I offered to help out, either taking dishes into the kitchen, bringing them out of the kitchen, washing up, even getting a glass of water, I kept being told to sit down, they could handle it. \n\nI didn’t understand why, as I’m perfectly capable. I thought it might be to do with my eyes. \n\nOne day we were visiting a great auntie of ours, who owns a little summer home by the sea, not too far from where we were staying. Now when we visit this auntie, I always go swimming. She’s literally not even a couple of mins away from the sea. \n\nNow as I went to offer my help to my great aunt, I hear my 14 year old cousin talking to her in Greek. Another important note, I can’t string together a sentence in Greek. My father is English and had something against us speaking Greek. But although I’m not a fluent speaker, I can read, write and understand Greek. My family doesn’t know this. They assume that because I’m not a fluent speaker, that they can basically hide their conversations between other people\n\nMy cousin was telling my great aunt how clumsy I am. How stupid I am. How I’m a little… soft in the head. She was saying it in Greek. She thought I couldn’t understand her. But I knew exactly what she was saying, even if I couldn’t string sentences together myself, I knew what she was saying about me. I added 2 and 2 together, and realised my cousin was very obviously telling all my relatives this. She did it, because she thought she’d get praised if she helped bring out the food without me. I was angry, but I knew the perfect revenge. \n\nWe ate lunch, and after we were finished eating, my great aunt asked my cousin for her help to take the dishes in, and do the washing up, as she’d been on her feet most of the morning, preparing the food. \n\nMy cousin looked at me, knowing my great aunt couldn’t speak English and said “Hey OP, auntie needs help taking the plates in and doing the washing up.” Because now, she was bored, and expected to run off to the beach and leave me doing the hard work of cleaning up after.\n\nSo I looked at her and said “But I’m too stupid and clumsy, and soft in the head, to help auntie out. Besides, she asked for YOUR help. Not mine.” She went pale, realising I knew what she’d said. But she doubled down.\n“I helped bring everything out. You could help take it all in.” \nI laughed at her, picked up the book I’d brought with me, and got up from the table. Grabbed the towel I brought with me, and went to walk off. My cousin started whining to my grandparents that I wasn’t helping her. My grandmother looked at her and said “You made your bed. Now you lie in it. Your cousin caught you lying about her, and now she can go to the beach, while you help your aunt.” My cousin went completely white then. \n\nSo I went to the beach. Swam for thirty minutes, then chilled out on a deckchair, reading my book under the shade of a nice umbrella. By the time my grandparents called to me that we were heading home, my cousin had spent all of it helping to wash up, and dry things, and put them away. She hadn’t gotten to be lazy and go to the beach, to enjoy the sea. \n\nI could’ve helped her. I simply decided that I wouldn’t, as she never earned my help. Since then, every time we went to a relatives home, and she was asked to help, I watched with a smirk on my face. To this day, (I’m 37 this year) I still won’t help her. \n\nShe made out I was incapable to people. So now she suffers the consequences. It’s the malicious compliance that keeps on giving to me.\n\nETA\n\nAnswers to some common questions.\n\n1: I was born with Congenital Cataracts and I’m 85% blind.\n\n2: This didn’t actually start out as something to carry on for years. I don’t actually carry it on myself either. It started out as a ‘consequences for her actions’ type lesson. The family picked it up, because she wouldn’t admit to the lie, and no one liked her lying. They don’t actually make her do extra chores when I’m not there, as the whole thing started because she said I was ‘incapable’, so the family basically told her she had to help out her ‘incapable’ cousin.\n\n3: The family carried it on until this point, because she refuses to admit to the lie. To this day, over a decade later, she still says that I’m incapable, clumsy, soft in the head, to any relatives that will listen. She’s now a full grown adult, who refuses to let go of the lie, so the family has kept up her narrative, because she won’t let it go.\n\n4: Some people have asked if my grandmother knew what was going on before I confronted my cousin. She did not. After I caught her lying about me, and used her words against her, my grandmother straight away asked my great aunt, in front of us both, if my cousin had said that. My great aunt confirmed it, as she didn’t know my cousin was actually lying. I’d already put 2 and 2 together and realised this was probably what my cousin had been doing with everyone we visited. My grandmother was one of 10 siblings that made it to adulthood, and my grandfather was one of 6 siblings that made it to adulthood. We visited a lot of relatives. So once my grandmother found out my cousin had done this at my great aunt’s, my grandmother dug around and found out what I’d already guessed. When my grandmother asked exactly WHY she thought that it was okay to do this, she doubled down, and basically claimed it was true. So my grandmother told our relatives, that this was absolutely NOT true. She also told them, that as my cousin refused to admit to the lie, that they should treat her as the only capable one when I was there. If she wants to lie about her family, my grandmother asked they act towards her, as if the lie were true. If I was incapable, then I couldn’t possibly help out, but my cousin was NOT incapable, she’d be required to do the stuff they’d normally ask of me. \n\nPlease don’t get me wrong. She wasn’t asked to do anything OTT, like cleaning hunted kills, paving driveways, or herding cattle. She was asked to wash dishes, carry dishes in and out of the kitchen, drying and putting away clean dishes. Simple things asked of anyone. They just made a point of only asking her when I was there, because of her refusal to admit to the lie. She’s 24-25 years old now, with her own place. But she still goes around telling people the same lie about me. My grandparents didn’t know about it, until I confronted her with it. They just made a reactionary choice when they found out what she was doing.",
        "permalink": "/r/MaliciousCompliance/comments/yw430b/my_cousin_thought_she_was_being_so_clever_it_did/",
        "comments": [
            "Still ain't helping her over a decade later and smiling about it. Impressive 😂",
            "She must be swimming in regret",
            "I'm glad your family saw the humor in your MC! \n\nDo you have any other stories about people not knowing you understand Greek?",
            "It's been 13 years and she still have to do all the chores? I call it nuclear revenge!",
            "Curiosity: Had anyone actually explained to your Great Aunt what was up, or does she still think those things about you?",
            "It's like the gift that keeps on giving.",
            "Being a greek myself and having a cypriot stepdad , i am very curious : why was your father against speaking greek? Anything to do with the relationship with the grandparents? \n\nIn cyprus i heard a lot of about the so called εγγλεζο-κυπραίους so im just curious 🧐",
            "/r/ispeakthelanguage",
            "For someone 85% blind she saw right through her.",
            "Lord Hermes does like to turn things around on people",
            "hah, that its still ongoing! thats a pretty deep bed of shit she gets to lay in roflmao",
            "Not in a MC way, but my Spanish, which I should be fluent in because my mom tried to teach me as a kid but I was a stubborn brat, is pretty limited. I did take 3 years of it in high school, but it barely increased my knowledge. I can basically do a decent, proper greeting and goodbye, and that’s it. But I know enough to get by with context clues. My grandparents and a lot of my relatives straight from Mexico speak limited English. My mom is bilingual, and she’s always on the phone with them. When she’s talking with English-speaking relatives, and she wants to talk about me in front of me, she switches to Spanish. However, it’s come to the point where I can figure out what she’s saying. I wouldn’t even pay attention if it weren’t for the fact that she says my name that gives it away and my ears perk up. So I’ll tell her I know what she said, or if I disagree with something she said, I’ll speak up. Getting harder to talk about me in front of my face when I can understand what she’s saying.",
            "I was also born with a congenital cataract, but only in my right eye. Do you read Braille? Using my right eye alone there is no way I can read anything unless it’s like font size 24 and <10cm from my face.",
            "Such a great lesson!",
            "This is a keeper 😁",
            "Outstanding.",
            "I love this.  \ngreat story and a good kick to the but at 14-15.",
            "Damnnnn 2 decades eh? Now that’s consistent 🤣🤣🤣",
            "It's always good to use a person's words against them.",
            "INFO who can and who can't speak which language\n\nYou can understand greek but not talk it\n\nyour cousin can talk both languages\n\nyour great aunt who you were visiting only speaks greek\n\nYour grandparents, your great aunts parents, speak english?\n\n&#x200B;\n\nand some english have this weird idea that teaching kids to speak two languages stops them talking 1 language despite the 1000s of kids worldwide who disprove this.",
            "Can we trade grandmas? I like yours better",
            "Don't talk behind my back in front of me.",
            "It takes a lot of stupid to commit the same lie without success for years! She obviously won’t ever admit it so she gets to continue to do the work herself. What did she think would happen? She’s very stubborn and immature. Congrats on calling her on it years ago.",
            "what's cyprus like? seems awesome",
            "Beautiful.  I'd be smirking too.",
            "Actually, the whole family is performing this malicious compliance.",
            "I love how this reads like a classic children’s book, or fable. It’s short, sweet, and has a clear moral of the story",
            "Anyone else find it a little hard to swallow that grandma apparently heard all this going on and didn't say shit until it was time for the big revenge moment?",
            "A whole decade making a complete ass of herself and doing all the chores. Lmao",
            ">She’s now a full grown adult,\n\n_ehh_",
            "Πολύ κωλόπαιδο η ξαδέρφη! XD nicely done, OP!",
            "Great malicious compliance, too hehe 😉",
            "I was also born with congenital cataracts, they didn't get bad until my early teens, but I had surgery to replace my lenses with artificial ones, and now my vision is normal for all intents and purposes, is surgery not an option for you for whatever reason?",
            "Lmao-",
            "Hello there fellow British Cypriot!",
            "Lmao",
            "Still keeping up the lie and still doing so every time there is a family get-together! \\^\\^ I hope it's worth it for her\\~",
            "Might not see this but there's a sub you could post this to called I know the language",
            "This story is one of such capability, it may make you super capable.",
            "I have a similar story. My cousin loved weaponized incompetence. Well, we we're staying at my great aunt's cabin on the lake for the week. After the meal we are expected to wash and dry the dishes because aunt cooked. Well, cousin kept doing the drying poorly so I would end up going through the ones she already did and then she would go swimming. She also admitted that week that she knew I wouldn't be able to leave the dishes done poorly so she did it bad so I'd do my share and hers. Well, aunt comes in while I'm drying the dishes and asked if we traded duties, I said no, I washed the dishes but cousin didn't dry them well so I am doing them. Aunt asked where cousin was, I said swimming. Aunt told me to go swim and she'll finish the dishes. The next day it was dishes time so I went to the kitchen to get started and aunt said, I've done more than enough dishes and cousin will be doing my share since I had been doing hers. So, cousin did the dishes in maybe 2 minutes. Aunt came into kitchen, saw that the dishes were wet and dirty in the cupboards and made cousin redo them til they were clean. I think she had to do them 5 or 6 times. It took like 3 hours. It should've only took 30 mins doing it alone. It was glorious. We were 15 and 16 at the time. I was the younger.",
            "Wow… Your cousin was just basically talking about herself when she said “soft in the head” it seems…",
            "All she had to do was apologize and own up lol",
            "Hahaha, I love this!!",
            "A revenge worthy of Nemesis!",
            "Good family!",
            "Grandma ain't taking no excuses!",
            "As a fellow 85% blind person (retintis pigmentoda), this story made me grin.",
            "My niece was born with congenital cataracts. She is tough as nails and has been doing great with it. I'm glad to hear stories of others with it being cheeky and not being held back by it. Rock on.",
            "“My father is English and had something against us speaking Greek”. \n\n… sounds English to me. 😑 as comedian trevor noah said lol\n\n(I’m Greek, Irish, English and Native American lol. Not fluent but can understand a bit. Just wish the English would let everyone have their languages and leave us be) - and this is my experience though I ought not generalize. While it is something associated, I realize it doesn’t apply to every person",
            "Hey u/ladybladewarangel I am curious if your cataracts are in the traditional location which is the lens of your eye? I had a traumatic cataract due to a severe eye injury & they were able to put in an artificial lens that they stitch in. I don’t know how long they have been doing this, but they made it sound to me like it was a common procedure & not very invasive. \n\nYou don’t have to respond if this is a touchy subject, I only had a cataract in the one eye and it was difficult. I can’t possibly imagine 85% vision loss in both eyes.",
            "Can I ask you about your cataracts? My son has some and I don't personally know anyone with them to talk to.",
            "[deleted]",
            "(My dad was English and had a thing against us speaking Greek)\n\n\n*immediately not a paragraph later talks about how the cousin speaks Greek to talk shit about English speakers right in front of them*\n\nI think I found your dads thing lol",
            "It's all Greek to me 🤷‍♀️",
            "Wow, your cousin sounds psycho, I guess got what she fucking deserved",
            "I'm stuck on the phrase, \"I thought might be do to my eyes\"  what in earth dies mean?",
            "Why do people write their titles like this??",
            "Can we get a TLDR?",
            "Great MC! OP, why don’t you get cataract surgery?? I went blind in 2007 at 29 from undiagnosed type 1 diabetes and had cataract surgery. It’s life changing!",
            "Delicious. I was diagnosed with glaucoma in my early 20s or thereabouts so I somewhat empathize, though I'm probably in a better-ish state. Honestly, I don't know the severity of congenital cataracts or even my own issues as I've already consigned myself and prefer not to bother thinking about it.\n\nStill, revenge upon those who refuse to admit their failure is something we can all enjoy. Who doesn't like a heaping pile of salt to wallow around in?",
            "I love these heartwarming fafo stories. Warms my heart and always makes me laugh",
            ">To this day, over a decade later, she still says that I’m incapable, clumsy, soft in the head, to any relatives that will listen.\n\nI mean this honestly sounds like *she* believes it to be fact and in her eyes she's not lying...",
            "You have a great family. I never got that kind of backup when somebody wronged me.",
            "Too Sweet!",
            "Who takes 30 minutes to do dishes?",
            "[deleted]",
            "37 and still exacting revenge on the 16 year old’ s mistake. Good for you. Too bad no one has matured any.",
            "so, your greek relatives did never re-check your „touched in the head“ status, and still will not ask for your help? huh? also, if i was your cousin, i would just not go there, or be braty 🤔\n\nEdit: read more replys from op, and yeah. you are totaly justified. also good idea going nc with that cousin",
            "While I understand cultural norms, I’d like to point out that a big reason they weren’t asking for your help is because you were their guest (and yes, you’re a guest even if you’re family) and you came from another country. They want you to have fun, not work and it had nothing to do with your eyesight.",
            "May i inquire about your sight? My daughter had cataracts. We did surgery for her. Has IOLs. She's 16 now. Did you have surgery?",
            "Fantastic story and well written!",
            "[deleted]",
            "This should also go under petty revenge. Love it!",
            "Beached whale",
            "I can't believe op wouldn't just get cataract surgery and get their vision back..",
            "[deleted]",
            "She was a child herself and shouldn’t still be affected by a mistake she made as a minor. Thank God Jesus has forgiven me for all the things I’ve done in my life. I wouldnt appreciate family that never moved on from a childhood lapse in judgement",
            "Wow, holding on to anger much? Seems incredibly petty to rage over the stupid actions of a 14-year-old for over a decade when you never even suffered any harm from them.",
            "[deleted]",
            " r/ispeakthelanguage would probably enjoy this story!",
            "I love me some Greece!  I was stationed there at the airbase in 1984-1985.  Wonderful memories.   I'm so jealous.   My husband and I were going to go to Greece last year but then the pandemic hit.  Hopefully we can save up our money again so we can really go this time!",
            "I'm surprised she hasn't caught on after all these years that she's the one getting dunked on by everyone.",
            "Well played OP, well played!",
            "Damn, she continues to lie to this day? I have zero sympathy. Someone needs to just straight up slap her across the face every time she's caught lying, and scream in her face that she _WILL_ admit the truth _RIGHT NOW._ Every single time she tries.\n\nShe's acting like SHE'S the one soft in the head. Are you positive she doesn't have mental difficulties? Maybe she needs to see a doctor or something, she doesn't seem to know the truth from a lie.\n\nFor anyone who doesn't like my super confrontational solution, how about this. Maybe if everyone acted super concerned about that, and kept insisting to her \"no dear, you know you're lying but you keep on and on, we think you need help\", and started taking her to doctors and telling them \"she has some kind of mental problem, she can't stop telling this lie over and over, she's been doing it all her life and she seems completely hopeless.\"\n\nShe would DEFINITELY stop in her tracks then, either way."
        ]
    },
    {
        "post_id": "tyg1vb",
        "author": "bear-mc",
        "title": "Boss said no shorts",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tyg1vb/boss_said_no_shorts/",
        "score": 16276,
        "num_comments": 761,
        "created_utc": 1649346708.0,
        "selftext": "I work at an office that sells bulk goods to businesses that use them, like retail outlets etc. Our office doesn't usually have a strict dress code but we recently got a new boss, Asshat, who is quite literally the stick up my ass. He's constantly yelling at everyone about basic shit, like punching in a minute or two late/early, or being a word or two off the script during outbound/inbound calls. Dealing with him in general has made me hate the job more. As its getting hotter I've been wearing khaki shorts to work for the past few days, which is something I've always done for the past few years and nobody has confronted me about it before, so I figured nothing would change this year. But boy was I wrong. About halfway through my shift this boss comes to my desk and realizes I'm wearing shorts, and is visibly annoyed. He mutters something under his breath and goes back to his office. An hour later I was called into his office, where he proceeded to berate me about breaking dress code. He was fuming, and ended the meeting with \"From now on you follow dress code to the book, or your fired!\"\n\n&#x200B;\n\nSay no more, boss.\n\n&#x200B;\n\nThat night I went home and read up on the dress code rules. There was in fact a rule against shorts, so I was annoyed, but kept on. And then I found it, there is no rule preventing males to wear skirts/kilts. Here's where I devised my plan.\n\n&#x200B;\n\nI immediately ordered a pink and white striped kilt online, as well as matching knee high socks and shirt. There was no rules stated in the dress code against any of this (surprisingly). About a week later the clothes arrived, and here is what ensued the following work day.\n\n&#x200B;\n\nI walked in, wearing my new pink business outfit, and immediately the whole office is staring at me, and the boss who came in to cover another bosses shift in the morning was beat red in the face, and yelled at me to come in his office. He  goes on a 10 minute rant about how I'm a useless employee, and that he's going to fire me for not following the dress code to a T. I simply stated \"I am in dress code, I urge you to read the employee handbook.\" He ended up reading the whole thing in front of me, and I could see him getting more and more angry as he realized I didn't break any rules. I asked him \"am I free to go to back to work?\" And he looked at me with a death glare, muttered something under his breath and waved me off.",
        "permalink": "/r/MaliciousCompliance/comments/tyg1vb/boss_said_no_shorts/",
        "comments": [
            "Where I used to work had a similar rule BUT women were allowed to wear capris/shorts that sat below the knee.  One coworker came in, (male) wearing shorts because it is hot (like 80) in our work area.  I am in capris as is another female worker.  HE got told off. (his shorts were nearly covering his knees).    So next day he shows up in the same shorts but has stitched some black bands around the bottom so they were around the same length as the shorts I had on.  Damn straight I pointed out that his were the same length as mine so why wasn't I being sent home too... hrmm well they couldnt do that because no one would be running the returns.. LOL  Rules were then changed to allow guys to wear below knee shorts as well.   \nKilt was suggested to other male coworkers too coz, it's wrong..  Guys should be allowed to wear shorts .",
            "I worked with this one guy at Walmart for awhile. Our dress code then was shorts had to cover the knees, but he's really tall (6'8\") and slender build. So instead of trying to find shorts that fit, he decided to order some kilts. Management threw a fit as they didn't think he could do that (he's half Scottish so hold on) and tried to challenge him based on ethnicity. He brought in his actual family seal and paperwork to the asshat that tried to challenge him, then proceeded to \"open door\" all the way to corporate. That manager no longer works for Walmart and is not eligible for rehire even as a cart pusher.",
            "I worked in a call centre where shorts were forbidden. One hot summer, management finally caved and allowed shorts.\n\nThe new rule lasted about a week thanks to one guy in tight bike shorts.",
            "By all means please share the photo in the kilt!",
            "Why do places put these types of people in charge? Why are they always yelling. Are they that sad? Like shorts at an office where you're just taking calls? Wtf kind of shit is that.",
            "\"So, boss, would you like me to calculate how much company time and money you just wasted with your little tantrum?\"",
            "Oh man dress codes are such a touchy subject for me because I hate office clothes and I kind of pushed boundaries sometimes.  Glad I WFH now and work in my PJs half the day.\n\nYears ago though - I worked front desk at a small clinic where I was the only female.  I used to wear tank tops and shorts during the summer because we didn't have AC, just a box fan at the door.  At one point another lady was hired on but she was much older and overweight.  At that point I was talked to about what I was wearing.  \"These clothes look great on you, however we don't want...others...to think that they can also dress this way\".  Damn.",
            "A couple of years ago a subway system in one of the Scandanavian countries had a heat spell and the rules for drivers were \"pants/skirts\" and didn't specify gender.  After some male drivers were disciplined for wearing shorts, they showed up in skirts.  \nTPTB were smart and changed the dress code to allow for shorts.  I bet Asshat would have changed it to be gender specific.  Which, of course, would likely also get him in trouble.",
            "I worked in a large DIY store for a few years, we had no AC and the building was effectively a huge metal shed, so the few days per year the UK actually gets hot it would be even worse inside.\n\nSince it was getting so hot a few people (mainly those in the garden center stood in the sun all day) started coming in shorts. Management complained and said they couldn't as it wasn't allowed in the dress code. A few days later and most of the staff were in shorts, they decided it wasn't worth the argument and just left us too it. They couldn't argue it was from a safety point as skirts were allowed, there was talk of coming in skirts if they put their foot down regarding the shorts, which might have helped twist their arm.",
            "It's unprofessional to be comfortable while at work. 😒",
            "I'll never understand that a company whose employees never see the public have a strict dress code.  I mean, usually the dress code's meant to ensure a \"professional\" appearance.  You're sitting behind a desk with no public-facing role?  Who cares what you're wearing (within reason)?\n\nI used to work for a very large insurance company whose corporate offices are actually locked down during the day, and they had the strictest dress code I've ever seen.  In the 1990s, a woman couldn't wear socks with their slacks; it HAD to be hose.  Who cares about socks???",
            "I did that at GameStop.  My DL (district manager) said we had to wear long pants, so I asked about skirts for women and she said it was okay.  Then I asked about kilts and she said she would have to check on it, but she never did.  I asked the new DL after we had some restructuring and he said it was fine.  Got some weird looks and one wannabe-gangster custoguest was personally offended and called me some names to show his ignorance.  I just had to stay off the ladders when we were stocking shelves.",
            "Same happened to a kid I was in school with. They rewrote the handbook *twice* while I was in high school!🤣🤣🤣\nFirst no earrings on guys, then no \"wording\" on shirts (logos had to be approved or guys in skirts.🙄 The eighties...😃",
            "Nice kilt related malicious compliance! I could see my husband doing something like that.",
            "My job doesn't have a defined dress code but I set myself a rule. I can wear shorts when the forecast is for 90F or above. Today's forecast is for 94F, so shorts it is!",
            "Good on you.\n\nI did something similar at a restaurant I worked at in college. This being Florida, it was super hot on the patio and mostly women wore dresses and the guys wore shorts. One day we were told shorts were forbidden.\n\nMe and several of the other waiters all went to a thrift store or talked to a female friend and we all show up for our Friday evening shift in dresses or skirts. Rule was changed to anyone could wear shorts but no one could wear denim. (Maybe it was the 6'2\" guy who showed up for work in a denim miniskirt, nice top and fishnet stockings.)",
            "And it aaallllll started with no shorts in middle school. 🙄",
            "> _\"... quite literally the stick up my ass.\"_ \n\nThat's at **least** sexual harassment, and quite possibly assault, depending on the degree of consent you shared with him.",
            "The fuck is wrong with wearing shorts anyway??\n\nGood on you OP",
            "I hope all this was recorded in writing or audio/video. With a boss like that you'll need to CYA. \n\nKilts are awesome in the summer. Bravo to you for going the full nines with matching socks and shirt. Along with your colour choice.\n\nGood luck in future interactions with this boss.",
            "Good for you! I've had two different workplaces that banned shorts. Capri length pants were okay, but men don't generally wear pants that length - so - some men bought kilts. Some management folk got ruffled over it, some did not (VP did not and he was top dog, so nothing was ever said). Honestly, I find men wearing kilts very attractive - but I kept that opinion to myself.\n\nDuring the early 1970's, I was a teenager. The Feminist Movement was in full-swing. The topic of women wearing slacks into offices was quite controversial. Where my father worked, management was 100% against women wearing slacks in the workplace. It was a huge deal, in the news every day. Anyway, I was mildly aware that my father had made several phone calls to his mother around that time and was taking notes during their calls. Then a package came in the mail, dad was excited about it. I didn't know, at first, what was in the box. All I knew was when he left for work on Monday, my mom shook her head saying he was going to lose his job. He was gone from home Mon-Fri. I found out Friday night what the secret was. He was working as a utility lineman. He'd bought a kilt in the plaid pattern of the clan of his mother's ancestors. He wore that kilt every day that week in protest to management to allow women to wear slacks in the workplace. Yup, he was written up over it. Eventually, management gave up the fight against women wearing slacks. He had started something, more and more men were wearing kilts to work as a silent protest.\n\nHe sat me down and said he'd done it for me, being a young woman. He said that what a person wore to work had little to nothing to do with their work performance. He didn't see management's side of banning slacks for women, especially in Winter.\n\nHe wasn't directly written up for wearing a kilt. What was written on the form was that he wasn't wearing underwear and the spotter at the bottom of the pole had to look up and spot him....and all his private bits were visible.\n\nIt was one of the few times he really took a stand on something. He did it for ME, so, I was proud of him for doing that.",
            "I live in Florida and the no shorts thing bothers me so much. I even own fancy dress shorts that go below the knee but most places here still require long pants.\n\nIf i don't interact with customers and they literally aren't allowed in our building, then why does it matter? It's just outdated BS leftover from men having to wear suits to be professional.",
            "Good for you, I loved it! Bonus points for the matching kilt, socks and shirt 👌",
            "Another option would be to learn how to sew. Make some chiffon pants and see where they take it",
            "Buddy of mine did this in high school, but it was a straight-up girls' skirt. \n\nPrincipal just sat there pinching the bridge of his nose for a couple of minutes, told him to go back to class, and announced the dress code change a couple days later.",
            "Make sure you wear a dancer's kilt, they're a lot lighter than a piper's kilt.",
            "The real issue isn’t the dress code. It is the fact that they can fire you on the spot for something trivial. You need some proper worker rights!",
            "Am I alone in thinking that dress codes are a form of group insanity? The fact that a business can isolate a very specific slice of clothing from the huge array of things you can wear anywhere in public, and then force you to dress that way in order to be allowed to do your job… it’s insane. Uniforms, I can understand. You buy it, I’ll wear it. But making me buy a couple weeks worth of outfits I’ll never wear outside of the job? I’ve never heard an acceptable justification for it.",
            "I hate this so much! I had a boss just like yours back in 2019-20 in a logistics compliance role. Our office was in a fancy high rise in Chicago and we were a company of maybe 20 people at most, our dress code said nothing about shorts being not allowed and only said to look business casual. \n\nSummer 2020 and we were back in the office as soon as we could be cause the boss was one of those guys that had to see his employees working to believe them. I started wearing khaki shorts with a button up shirt to work and did it for a few days until I too was pulled into a meeting with the boss. He went off on me for looking unprofessional and demanded I go home and change into pants. It was already like 2pm by that point so I told him sure, my commute home was about a 45 minute walk both ways and I was off at 4 so I took my sweet ass time and got back with only 15 minutes left to my day and he couldn't say anything about it.",
            "I worked in a call center where a guy there regularly wore a black leather skirt for that very same reason.",
            "I'm 99% sure this is a repost because I SWEAR I've read this scenario before here, word for word",
            "> Asshat, who is quite literally the stick up my ass.\n\nI hope you don't literally mean \"literally\".",
            ">who is quite literally the stick up my ass. \n\nI really hope that that \"literally\" was misused.",
            "I work in a lumber yard as a driver primarily sonetimes running forklifts . It's a good job over all. I started wearing kilts about 5 years ago. No tartans just plain heavy cloth. My trucks mostly have no ac and it gets a wee bit uncomfortable in the summer. \n\nI started when they tried to enforce the \"can't wear shorts in the yard\". And restricting skirts and leggings from the female staff. It's never been an issue. I had one supervisor make a comment about \" are you seriously going to construction sites wearing a skirt?\" \" my answer was something along the lines of \" I got the legs for it, so why not?\"  This supervisor wore cargo shorts 6 months out of the year. My utility kilt covered just as much with out squishing my bits.",
            "Great story, in the city I live in there’s a company who’s dress code is strictly kilts and I guess that’s why there called ‘Men in Kilts’",
            "https://www.bbc.com/news/uk-scotland-south-scotland-57358762",
            "Meanwhile UPS issued me knee high socks and bootie shorts. I guess they WANT me to look slutty while I deliver lol",
            "I am continuously baffled by employers and bosses not wanting you to be comfortable while you work. Do they not understand how heat works? That productivity suffers when you're sweating your ass off? X x",
            ">who is quite literally the stick up my ass\n\nThis sounds like inappropriate workplace behaviour.",
            ">quite literally the stick up my ass\n\nI don't think that word means what you think it means.",
            "Did the same at work. No shorts allowed for hygienic reasons but skirts were fine. I now wear a skirt when its to warm. Fuck it. Its glorious. Nice breeze and all that. No sack and crack sweat. My boss finds it annoying but who is he to say anything about it from his ac office when i al there in 42c heat working my balls off.",
            "Should have let him fire you",
            "I love stories where dudes reveal unfair dress code practices by crossdressing. It shouldn't be a big a deal in the first place, but since it is, might as well use that taboo to your advantage",
            "Love it! Dress codes are so damn annoying. If it’s going to cause an occupational hazard, by all means, don’t wear it (I.e. tanks and shorts in a welding shop), but otherwise who cares?",
            "[deleted]",
            "Wouldn't the socks feel like you are wearing pants?",
            "Pics or it didn't happen",
            "> quite literally the stick up my ass\n\nFeels like you should have gone to HR a bit earlier, tbh",
            "Shorts of any length are not allowed in my office, even Bermuda shorts, but skirts that are so short that if the wearer leans over even a little bit you can see both London and France. Makes no sense to me. Note: a wearer of one of the skimpy dresses sits at her dresk wrapped in a blanket all day, but struts around in her tiny dresses away from the desk.",
            "Och an the noo! Gie us a wee dram!",
            "We just got a new dress code that includes no shorts. Our location manager thinks it's stupid because we're in a subtropical climate and the policy was written by someone in a cold climate. \n\nIm a known kilt wearer but I haven't worn them at work because management doesn't like them and I'm friends with the two founders. Like, I could, but there's no reason to push it. \n\nI told them that if they enforced it I would start wearing my kilt, whereupon they pretty much said that as long as no one from corporate shows up they'll look the other way. \n\nIt's totally stupid... No customer will ever see us.",
            "Ah the classic No shorts? Kilt it is.\\\nMy class did this in high school. They made us revert by mid morning though (saying it is sexist somehow, though all the girls were in on it as they lent us their kilts). There was nothing against using the other sex’s dresscode in the guide (it was encouraged for the females to use the males’ but apparently not the other way).",
            "Being yelled at at work would not fly here, I have no idea where you guys all live that this is acceptable...",
            "Dude I did about the same thing at my work.  \nWe got a new building at work and the Big bosses were coming in.  I decided to wear my kilt for the fun of it.  I got it years ago due some Scottish heritage.  I even told my boss and others about it.  My boss said he wouldn't stop me if I did it.    \nDay comes an I walk into the office with my kilt and everyone started laughing, smiling or shaking their heads and they walked past.  My boss walked past me, stopped shook his head and then keep walking past. The only one in the building higher up than my boss before the Big wig arrived was one of the VPs.  No one else wanted to confront me since I wasn't in their departments.  The VP came up to me and was like hey is there anyway I can get you to change as a personal favor to me.  \nI asked him are you asking that way cause you know you can't tell me to change and he was like yup.  I'm scared of what the CEO will say.",
            "We had a similar situation in my work place. Rumour spread of a dress code coming into place when there had previously been none, we heard we would all be expected to wear ‘trousers’ not jeans or shorts.\n\nWe aptly named this ‘Trousers Gate’ and managed to get our hands on an early copy of the employee hand book which confirmed the rumours.\n\nWe came up with the kilt idea and made sure we discussed it loud enough for management to hear.\n\nLong story short, just hearing us talk about kilts made them scrap the dress code.",
            "My SO was a bus driver and said back before his time the men did this. The women were allowed to wear a uniform version of their skirt, so the men ordered skirts as well. Shorts are now allowed.",
            "Knew of a group several years ago who got their dress code changed from casual to business casual despite NO ONE IN THE PUBLIC SEEING THEM.  This group knew exactly what the rules were, could afford their new wardrobes and abused the heck out it.  As long as they were not wearing jeans, shorts, sweats, t-shirts, tanks, and the like.... Outfits included..\n\n* White see through dress pants with black underwear\n* Powder blue dress pants with neon pink polos.\n* Kilts\n* Wedding and prom dresses (dresses were permitted, but didn’t specify type or who could wear them)\n* Tuxedos\n* Original 70s clothing including bell bottoms, vests with fringe, paisley…\n\nEvery week we hit the thrift stores to come up with new garish but dress code appropriate outfits.",
            "My high school eventually banned crocks. They left us with a very general dress code that put high school students in business casual (yay private school) but nowhere in the policy did it specifically ban crocs. Guess what almost every student wore because they could until it was banned the next year?",
            "Bottom Line is go to HR . He has no right to tell at you. That is harassment. Screw him . You talk to someone like an adult. Get his ass fired.",
            "OP, you are my hero.  I've dreamed of doing this for so long.... especially as here in Australia, in the summer, we have WEEKS of temps over 40°C (that's 104°F for my American friends).  I don't mind trousers so much the rest of the time but it seems ludicrous the women in the office can wear literally whatever they want, but heaven forbid the men should show their ***knees***.  \n\nI *did* once wear a kilt for a week (though not to work) when I had a vasectomy and it went awry... I got a massive blood clot and infection and everything down there was enlarged and multicoloured... and as painful as you might imagine.  \n\nAll of that - and it still would not have been acceptable for me to wear it to work in the office.  One of the guys in IT I did note wore zip-off trouser khakis - so he would sit there in the shorts til he had a meeting, then zip on the rest of the trousers.  He was an absolute legend \\^\\_\\^",
            "Email his boss about the situation, share yelled at despite being in compliance with the company dress code, and say that since his arrival you feel that there has been a notable shift to a hostile work environment. Hostile work environments are not good for productivity or sales.\n\nFuck losers like him who go on power trips over useless shit. Hopefully he’ll get canned.",
            "He's LITERALLY a stick up your ass?!  😳\n\nExcellent choice on going kilt.  I'd wear kilts everywhere if I could.  Why are good kilts so expensive though?",
            "I did something very similar, but continued to wear my utilikilt once shorts became an option bc 1: fuck you boss, and 2: FREEEEEEEDOOOOOOOOOOM!",
            "I don't get how shorts she considered unprofessional. Yes, it's better to feel and look miserable while sweating your ass off than to wear shorts ans feel far more comfortable and relaxed. I honestly do not understand how that rule caught on.",
            "I don't think you know what 'literally' means.",
            "I got a kilt just for those issues, dress code? Nothing about a kilt, guess what, yep im wearing a kilt, doesnt matter where we are, what function we are attending including a wedding its comical and everyone is a great sport except for the karen who set the dress code. Boo hoo,\n\nI live once in this world. Im going to have fun",
            "Holup\n\n“Manager is quite literally the stick up my ass”?\n\nThat’s sexual assault mate. No means no!",
            "The knee high socks were a nice touch. Im cackling. Good job.",
            "OP I am really curious, how can you let someone \"berate\" you? or talk to you like that in a professional environment? \n\nI don't understand how anyone can just accept that. I understand in a private owned, small shop but not in a company with HR, dress codes and all. \n\nNo one has ever talked to me like that even when I made mistakes and if someone ever does I would walk out and report him/her to HR.\n\nI am not paid to be yelled at. For me that is just abuse.",
            "Bruh that new boss sounds pretty incompetent ngl. How did he get the job is beyond me.",
            "Company I work for put in a safety requirement for pants after someone cut there leg. Now this is an industrial facility so I understand the need for safety. However most of the people here are not doing work that puts them in danger of this kind of injury. Add in that the only requirement was full length pants, nothing about material or cut resistant. A lot of the ladys were happy enough to wear stretch pants. Now, I'm not brave enough to wear stretch pants, really that's a lot more information than I really want to give coworkers. \n\nI could However get screen and make crude pants that could  be worn over shorts.\n\nLucky management got there heads out of there ass before things got hot and came up with a solution, but I was pricing screen",
            "Oh cool another story about a dress code and a guy wearing a dress. Super original. Thanks for sharing.",
            "I worked with this one guy at Walmart for awhile. Our dress code then was shorts had to cover the knees, but he's really tall (6'8\") and slender build. So instead of trying to find shorts that fit, he decided to order some kilts. Management threw a fit as they didn't think he could do that (he's half Scottish so hold on) and tried to challenge him based on ethnicity. He brought in his actual family seal and paperwork to the asshat that tried to challenge him, then proceeded to \"open door\" all the way to corporate. That manager no longer works for Walmart and is not eligible for rehire even as a cart pusher.",
            "Ours says men’s shoes must have toes but fails to mention heels. Also no ripped jeans or graphic t shirts.\n\nSo I wear jeans, plain t shirts and clogs every day.",
            "True story",
            "When you steal a several year old 4chan post",
            "> quite literally the stick up my ass\n\nI hate that we normalized the incorrect use of \"literally\" so much that the dictionary people just gave in.  Do you have an actual stick up your ass, placed there by your manager, or is that just a figure of speech?",
            "Oh that's delicious. Get back to work, indeed, OP.",
            "Why are people…especially bosses…such pos people? Like why do they have to be little shits about the most petty of stuff. It completely ruins the work environment that we all have to deal with. No one wants a shit boss. Not a single person.",
            "I get yelled at by clients at work and I don't take it personally. I don't even get upset. Why do so many managers seemingly have a complete inability to pick their battles? And when they lose one for some reason they let it ruin their day. Why?",
            "Whether the bottom of the garment is seen around the legs should not matter for either gender as long as the professional requirements for the job are met. For example: Suits can be worn if required as long as a man can wear a pencil skirt and a woman pants. \nExample: in the adult entertainment industry, short skirts and thongs acceptable. \n\nWhy people get so bent out of shape if a man wants to wear a one legged pant or shorts is beyond me.",
            "I love my kilts. If I could wear a kilt in a climbing harness without flashing everyone I would, but it gets quite breezy at the heights I have to go up.",
            "I would personally like a link to this pink kilt because I feel like more people could use it as a tool for malicious compliance. That, and I'm a sucker for a man in a kilt.",
            "Depending on where you live/work, you may be able to report the boss's behavior to HR. \n\nThere's a risk to it, but some HR departments take a very dim view at berating employees in public or screaming at them in private over non-existent rules. \n\nFor example, in California that boss would have made his company liable for harassment. And HR exists mainly to keep companies from being sued.",
            "I always wonder what kind of horrible things need to happen to a human being during their development to care about arbitrary rules and following authoritarianism rigidly.",
            "Wow this is the best post I have ever read on here 🤣🤣I’m living for the pettiness in the post. Fuck your boss. Jesus",
            "Awesome, but you should also find another job. When we stay at toxic workplaces we tacitly endorse the toxic behavior.",
            "No company can have a dress code preventing men from wearing skirts if women can. It's gender discrimination. There's been a handful of court cases which set the precedent.",
            "In a private school where I was sent in my youth.  Temperatures went above 30 degrees Celsius. Two of my classmates collapsed from heat exhaustion.   I went and purchased a kilt and knee high socks by the end of the week 3/4 of the class was wearing kilts...    i had cool pleats fanning my legs...   by the end of the year I out grew my kilt ...  I actually miss it  :/",
            "Real men wear kilts.",
            "We know you're lying about not already having the skirt and socks",
            "My highschool changed the dress code every year. My grandma had given me a skirt that fit the rules my freshman and junior year but not sophomore or senior.\n\nI also rode my bike to school regularly and was once caught by the principal in the 5-foot section of hallway between the door and the bathroom so I could change from shorts to slacks. She chewed me out but good.",
            "Started wearing kilts during summer days at my last job.  And when some random asked if I could do that, I said, “HEY.  This is my heritage.”  There was no further discussion.",
            "I work in corporate fashion and we don't have a dress code, just don't wear flip flops or look sloppy in general. There's also an unspoken rule that we can't wear shorts at above the knee length but we can wear mini skirts (go figure). I've worn really mini skirt length skorts with no consequence. Malicious compliance is the way lol",
            "Ah yes, malicious compliance at its best.",
            "Oh my god. I might try this, it gets hot in my office, guys can't wear shorts. Girls can wear skirts. Wonder if I can wear a kilt",
            "We have a stupid rule about women not being able to wear dressy bermuda style shorts (must be below the knee, like a capri) BUT you can wear a skirt above the knee. Wtf?",
            "I call bullshit on this particular story. While it's not an unlikely situation, it clearly reads like someone's just made up the story for themself. Sorry OP, but the factuality of your story stinks of BS. and never happened other than in your imagination",
            "copypasta",
            "And everybody applauded.",
            "No you didn't",
            "“I immediately ordered a pink and white striped kilt online, as well as matching knee high socks and shirt.” Ah I see, full femboy.\n\nAll in all, great story",
            "Yeah this didn't happen. But for real, Kilts are incredibly comfortable and great at regulating temperature. Cool when it's hot and warm when it's cold.",
            "🤣🤣🤣😊",
            "I love the malicious compliance.  But now I’m guessing he will just look for some other reason to fire you since he thinks you’re useless.  What benefit do you get out of antagonizing him, or do you do it because you know your days working there are numbered and just don’t care?",
            "Unless u don't give a darn about keeping the job... Then keep up purposely annoying him. He will get you one way or another sooner or later.  In life, sometimes, you gotta pick your battles. Is not getting to wear shorts the hill you wanna doe on?  Yes. He's a dick but honestly, you are kinda one too.",
            "Tbh this sounds like some sort of revenge fantasy fanfic.",
            "Someone else did this exact same thing, almost to the letter, like a year ago and posted about it. Good stuff.",
            "Never accept being shouted at by someone you work with. It is verbal abuse/harassment and is a crime.",
            "I bet you have a bright future as a sought-after employee.",
            "Things that didnt happen for $100, please...",
            "$GME",
            "/r/thattotallyhappened"
        ]
    },
    {
        "post_id": "ry077j",
        "author": "PeaceNGrease",
        "title": "Let me go? Fine. You’ll lose millions.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ry077j/let_me_go_fine_youll_lose_millions/",
        "score": 16267,
        "num_comments": 422,
        "created_utc": 1641534759.0,
        "selftext": "\nThis was around 10yrs ago. I’ve always been very technical minded & was able to read blueprints, construct complex devices, weld (mig, tig, stick. Certified in fact among other things.)\nI took a high paying job with a company that made several things for railroads.\nThe job entailed most of my skills, I mentioned above. It was a very small department, in fact there were only 2-3 of us. But we got along great & challenged each other. Which led to higher production. (Sadly the one other guy in my department left for a better job which left me by myself.)\nMy supervisor was great as well; liked to joke around with me, left me alone to focus on my work & had my back when I needed him. We actually assembled Signal Enclosures & Mast & Ladder Houses for railroads.\n\nFast forward to 3yrs later & the owners buy a much bigger location & move the whole company. As you might expect, several departments get shuffled. \nYep, my department gets folded into a completely different department that has no clue what I do. \nAt first, it was fine but it starts to go pear shaped pretty quickly.\nMy new supervisor seemed good at first. But I quickly realize he’s a “snake in the grass.”\nFor example,  I had to help the prototype department assemble a new, lighter type of mast & ladder house. So I’m printing out issues & suggesting fixes, etc.\nNew supervisor is not happy. He keeps coming over huffing, groaning under his breath, standing over my shoulder, etc.\nHe finally interrupts and asks in an angry voice “How much longer will this take?!” \nI respond “I have 4 more hours today. And eights hours everyday after that.”\nHe looks puzzled. \nSo I explain “This is my department. This is where I work. These are my responsibilities. So if it takes two months, that’s how long it takes.”\nAlmost as if to get the last word in he says “You work where & when I tell you!” And storms off.\nNext day I’m called into the office & they force me to sign a letter that states, \n I now work in my new supervisor’s department.\nFine by me.\nI watch from a distance in my “new department” as all the stock, hardware, parts, orders, etc. of my “old department” begin to rack-up. \nAnd since I’m the only one that works in that department, or rather, used to work in that department…lol.\nNobody is doing a thing about it.\nAfter about 2 weeks, my old department is a disaster. With items being thrown wherever it would fit. Orders had began to miss deadlines and higher-ups wanted answers.\nSure enough, I get called into the office where the new supervisor blames me for everything. But wouldn’t let me get a word in. \nOf course, they let me go without any reason or paperwork. The look of relief on my new, ex-supervisor’s face when I walk out was priceless. He had no clue what was coming…\nI leave with a smile plastered to me face. Because I knew something they didn’t;\nI was the only one that knew how to build the mast & ladder structures.\nI relaxed at home for around 2 weeks because I knew I would be getting a call from them.\nI ignore the first dozen calls. Then I answer : “can you come back & build, train new hires, etc for your department?” \n“Sure.” I say “for $20,000.”\n(Now that may seem like a lot but it wasn’t. They made millions from these. So there really was only one option; pay me $20k or lose millions.)\nLong story short, they went back-and-forth with me but finally conceded. \n\nI received $20k for two days work & they were helpless.\nThe cherry on top was my new, ex supervisor was fired for being a nitwit & costing the company $20k.\n\nEdit;\nWow this popped-off! Thanks for all the awards! Didn’t expect that.\nSorry it was so long.\nSome further information- I didn’t want to work for them again. It potentially would have been a situation- they used my knowledge & training of the new staff only to terminate me for some made up reason. Which I understand, nobody wants a disgruntled employee.\nWhy $20k? I bounced around on numerous figures but when it came time to say a number over the phone, $20,000 was the number that came out. No real thought. Could I have gotten more? Yes I think so. But it paid my bills, spent some, little vacation & gave me time to be picky about my next job.\nDid I get another job? Yes.\nAs to your questions; could I train 2 new workers in 2 days? Yes. Did I do it well? No. The company wanted it as cheap as possible. So they grabbed two new guys from a different department with zero experience. The best I could do was show them the general process given their limited experience & my limited time.\nAs far as getting all the work up to date; in my dept. the expected prod. was 2 per day. My personal record in one day was 18 before I stopped (previous good supervisor told me to stop. “What the heck are you going to do after you finish a months worth of work in a day?! You’ll be sitting around with nothing to do or you’ll be going home early.” ) \nThe first month I was there I set-up a series of jigs the allowed fast, repeatable results. That coupled with years of doing it meant I could build them in my sleep.",
        "permalink": "/r/MaliciousCompliance/comments/ry077j/let_me_go_fine_youll_lose_millions/",
        "comments": [
            "[deleted]",
            "Ooh, my dad did something similar. \n\nHis new boss didn't like him and let him go. Unfortunately, he was the only person who could certify blueprints. His old boss had to call him to ask for help, and my dad went back as a \"consultant\".",
            "Was that a one-off or did you keep working there now that your ex-supe was gone?",
            "You should’ve went bigger. I’ve always liked the idea of charging like a high end lawyer, $2000-3000/hr",
            "I'm surprised, usually managers get promoted for only losing 20k",
            "This reminds me of a computer guy I worked with, our smallish local company was taken over by a much larger national company.\n\nThey decided in their wisdom that they didn't need our computer department so made them all redundant, not realising that our lead computer guy built the complete system himself and their techs couldn't get it to integrate with their system.\n\nThey had to go to the guy and beg him to come back to consult for the integration, he did exactly the same and quoted something between 20k-30k for his time and they were forced to pay it because otherwise it would have taken a team months to transfer the data manually.",
            "OP, why did you decide on 20k as your price?",
            "$1000+ per hour? Bravo!",
            "Fucking hilarious that all that bullshit only ended up being 2 days worth of work for you lol",
            "OP did you get money when they fired you/let you go? idk as gratuity payment?",
            "Good for you. $20K sounds mighty low.",
            "I love the term 'snake in the grass'. I've recently discovered it (I'm not an English native speaker), so I've been using it in my own language to describe potential pitfalls me and my coworkers aren't expecting in our tasks. It's really taking off, so much so we've been called the herpetologists of our department since we're always looking for snakes.",
            "[deleted]",
            "This story demonstrates again that loyalty is a one way street in most employment situations. In my experience, management sells the idea that we are a team or family, but the reality is they use workers up, then kick them to the curb, or into the street.",
            "Should've gone for $50K.",
            "I filed an EEO complaint (retaliation) after I was \"forced\" to retire by a new narcissistic boss (government job). I asked for $20,000 to settle. Their attorney came back with a low ball offer. I raised my price to settle to $25,000 for a couple of reasons, but mainly to show that I had a \"good case\". The Settlement had a non-disclosure clause. I decided to bluff and called their lawyer and asked him if the document was signed, as I was giving interviews to two newspapers the next day and I didn't want to break the confidentially clause. He asked me to wait (on the phone) and got the Settlement signed while I waited. On the bright side I retired on my 54th birthday and receive very close to $80,000 a year in retirement. I celebrated my 20th retirement anniversary 2 days ago and, yes, my wife and I traveled the world until Covid.",
            "20k doesnt seem like much. if they make millions from it and you have all the power you could ask for 50k at least",
            "[deleted]",
            "$20K for 2 days work? You missed the boat bigtime there. Training and getting everything up to par should be $20K per day,  2 week (10 day) Guarantee.",
            "I had something similar once.  Boss fired me, and then called me back a week later to finish the project I'd been working on.\n\nShe only wanted to pay me when it was done though, so I passed on that.  Didn't want to deal with her continuing to mismanage the project.",
            "i love this sub",
            "You lowballed yourself on that one.  I would have started at $50k, and raised it by 10K every time they objected.",
            "Another 0 to the 20k and you would have been at consulting level. Knowledge is power!",
            "Nice!\n\nDid you treat yourself to something nice with your 20k?",
            "If they had millions to lose, I would have asked for 90K to 100K, what's the worse they gonna do, fire you again.",
            "It honestly baffles me how stories like these keep happening, how do people in these positions not question and learn who does what and how things are structured and why before making big changes or flexing their ego?",
            "Don't you just love it when new supervisors fail to actually listen to their experienced employees and have to learn the hard way.",
            "$20K to train people so they don't have to give you your job back does not sound like a great deal. I assume you took your skills to a better job after that?",
            "$20,000 is not a lot considering it’s a million dollar company. They’re just cheap bastards.",
            "Did you get severance pay? If not, that $20k is nothing.",
            "Am I on with your boss as well? Are they listening in? Good. Ok, big boss. I'll come back to work for you if you fire this guy and give me his job. And 20k.",
            "\"I'll come back under a couple of conditions:  \n1. mo $  \n2. I head my own department  \n3. Nitwit becomes my direct report in my department for 2 weeks as a training exercise\"",
            "They got off cheap.",
            "Charge a ton per consulting hour. \n\nWork much slower. 😄",
            "I love stories like these because it displays just how valuable our work actually is. We don’t recognize our own value when we get paid 15-17 an hour and are constantly reminded how “replaceable” we are.",
            "Man, you should’ve went even higher. Get your full years salary or some shit.",
            "Sweet",
            "He had probably cost the company far more than 20k at that point if it was affecting orders.",
            "Good for you! Hope you got a better job elsewhere.",
            "Loved reading this",
            "Wow, you got them by the balls. Did you continue to work there or did you find another job?",
            "Great story.",
            "> “can you come back & build, train new hires, etc for your department?”\n\nYou mean, come back to train my own replacements?  Sure thing.  $20,000 plus $1000 per day, and I'm always available as a consultant for that fee whenever you need me.",
            "What a delightful way to start my morning. :)",
            "Sounds like they got a deal as they would have had to pay a lot more. If you really were the only person who could do what they needed or else they had to pay millions, you should've asked for a million. That seems less than millionS.",
            "Don't. Let the computers die.",
            "Hahaha",
            "How are you doing now? Hoping to hear that your career has taken off!",
            "This is one of the best MC's I've ever read, wish I had awards for you!",
            "I love this story 😂",
            "And did you land on your feet and go with an employer who gave a damn?",
            "I've never heard of anyone doing this, but I have often fantasized about having a company over a barrel like this and countering with \"Sure, I'll come back for 1.5% of the revenue made from these.\", Alec Guinness/Star Wars style.",
            "They called me in the office one time to sign some type of probational period paper, I said you want me to sign that? I quit right away, the supervisor said wow I wasn't expecting that, shook his hand and left.",
            "Did you get a new job though?",
            "I've read a lot of these types of posts in r/MaliciousCompliance now, where the theme is a worker bee but with skilz that is taken for granted by their employer, who then learns the hard way when it takes twelve people to replace hero bee.\n\nCan someone point me to the right subreddit for the opposite: something like \"*Yeah, I really sucked as an employee. In fact, not knowing any better, you'd greatly under-estimate how much I sucked, so let me tell you. And boss finally wised up and canned me...*\"?",
            "X can also be acceptable for people who are physically unable to sign",
            "Only 20k?",
            "It is such a skilled position you train 2 people in 2 days to\nDo it.",
            "Should have asked for a royalty",
            "Disappointing story, they lost nothing. You sold yourself short. You went back for 10,000 a day for 2 days for something as you stated they make millions on. It’s a drop in the bucket.",
            "You were able to train the new people in 2 days? Does not seem that much of a 'one hit wonder' if after 2 days someone could be trained. \n\nIm surprised that they didnt just relearn the wheel, which i would imagine could have been done in 2 weeks you were off.",
            "This is the template for this sub. Perfect beginning middle and end. Thank you",
            "What a CHAD.",
            "If I had a dollar for every time this exact same story was posted to Reddit I’d be rich",
            "I can't be the only one who thinks this is a fantasy history, everything is so cliché.",
            "/antiwork",
            ">was able to read blueprints, construct complex devices, weld (mig, tig, **stick**. Certified in fact among other things.)\n\nOkay, is this a God Blink or just a coincidence? I just saw a post on r/ChoosingBeggars about a stick welder. Never heard of one in six decades on this planet, was curious but not enough to google it. Not thirty seconds later, I see another reference to a stick welder!\n\nGlitch in the Matrix, I guess ...",
            "Technical minded and then writes a wall of text...",
            "J and A industries huh?",
            "As I current RR employee, this makes me laugh.",
            "What a delightful story. Well done sir, I'd like to think I would have done the same in your shoes. \n\nI hope this highlights the importance of, \"fuck you,\" money. I own a business and also work a normal job. I had mgmt threaten me if I didn't sign something. I stood my ground and said no. Threats become really hollow when there's nothing they can actually do to hurt you.",
            "This belongs in r/antiwork 😂",
            "What's wrong with the shape of pears?",
            "Besides, it was time for something new to do"
        ]
    },
    {
        "post_id": "uxrqhs",
        "author": "joemondo",
        "title": "Deathbed Malicious Compliance. \"Give it all to her.\" Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/uxrqhs/deathbed_malicious_compliance_give_it_all_to_her/",
        "score": 16264,
        "num_comments": 204,
        "created_utc": 1653514475.0,
        "selftext": "My grandmother was an immigrant who had to leave school at about age 12 after her own mother died. As the eldest daughter it was her responsibility to take care of her younger siblings. Consequently she never learned more than basic reading and math, and although she married and had kids of her own she worked outside the home to add to household income, often doing cleaning and other low-wage work.\n\nOf her own children most were reasonable people, but her youngest daughter was a complete parasite. She had no problem taking whatever she could get from her mother, my grandmother, even having her mother co-sign on debts and then leaving her to pay it off.\n\nDespite not having much education my grandmother was a wise person in her own way, but not when it came to her own kids and especially not her mooch daughter. She just could not stop letting her daughter misuse her.\n\nShe ultimately became ill with cancer. Her kids took care of her, except for, you guessed it, the youngest parasite daughter. On her deathbed she told her oldest daughter she was worried about the mooch, and related where she kept all her money. It wasn't much. Maybe $700 or so. And then she told her oldest daughter that when she died to give it all to the mooch.\n\nAfter my grandmother died, oldest daughter had to stomach giving her own mother's last dollars to her miserable vampire of a sister. But to make it more tolerable, she decided to do it by sending it installments of $10 a month. \n\nSo that's what she did, for years. Just $10 a month, every month. Not enough to splurge on anything, not enough to even make a difference in her life. Almost as if it were nothing.\n\nI always admired my older aunt. She knew how to hold a grudge.",
        "permalink": "/r/MaliciousCompliance/comments/uxrqhs/deathbed_malicious_compliance_give_it_all_to_her/",
        "comments": [
            "What ever happened to parasite daughter?",
            "Not even enough to cover HD Netflix, amazing :D",
            "I've never been one to hold a grudge. My father was, and I'll always hate him for that.",
            "That’s inspiring. Very malicious. I love it!",
            "Your grandmother is a freaking saint and without a doubt a loving mother who loves her children to death. And your oldest aunt? She's a freaking madlad. She figured out how to grant your grandmother's last wish while making the smooch feel like she didn't got anything.",
            "I think that, in addition to the $700, any outstanding debts should've been given to the mooch as well",
            "I LOVE this lol. What a great way to deal with a horrid family member while still, technically, honoring your grandmothers wishes.",
            "That is brilliant 👏",
            "I'm going to guess the mooch aunt was still left with all those debts, since her name *was* on the loan, too.  Just because one person dies, it shouldn't cancel the debt the other one has in their name.  That's if the debts hadn't been paid in full before your grandmother passed on.",
            "I would have given her the entire $700 in 1 payment and explained that I no longer owed her anything and that since any debts are settled that she no longer has a need to ever contact me again.",
            "THAT is admirable compliance.  Smart woman.\n\nI would have done something stupid and short term like put it in a box of dog shit.  \n\n\nShe drew that out like a boss!",
            "I thought for a minute that parasite aunt was going to inherit all of the debt she had racked up for your g-ma",
            "Expected this to read that she gave all the associated debts also to her.. so that the mooch got \"everything\"",
            "debts dont transfer upon death, and any loans mooch cosigned with nana were probably written off as uncollectable.  however, debts will always be settled first by the estate before any money left over is distributed in accordance with the will.   \n\nThe fact nana only had $700 to leave to mooch, implies strongly that she could have left a lot more had those debts not been settled first.  you should let her know that she pre-emptively spent all her inheritence.",
            "For five years and ten month, that is definitely MC.",
            "Your older aunt's pettiness is admirable. I wish to aspire to that level.\n\nI hate to use the word petty, but I can't think of another appropriate word. And in this case, I think it's ok to be just that.",
            "My stepmother sent me a registered letter when my dad died, saying that all of \"their\" money was tied up and I wasn't getting anything. I could care less about the money, but I know he had saved some for my son to go to college. Never saw a dime. That's the last time I spoke to her, almost 16 years ago.",
            "Reminds me of when the two thieves that stole my £600 bike in London got caught and were ordered by the judge to pay me back. They said they couldn't afford that money so they were ordered to pay me £20 every fortnigh... For over a year. Took them a full year before they started paying (after a debt collection agency took over the file from the judiciary) but I did enjoy thoroughly getting that crisp £20 check in the mail every so often, enjoying my 4 pints on the boys!",
            "I had a friend who’s grandfather did something similar to a parasite son. Grandpa has three kids, two were married and successful. The third was always looking for handouts and grandpa was happy to help. I guess grandpa knew his time was coming to an end, he changed his will and left everything to the parasite. Turns out grandpa had taken some hefty loans and a new mortgage to help out parasite and so he inherited everything, including all the debt.  \n\nLast I spoke with anyone from the family, the parasite had shacked up with a wealthy widow in a different state.",
            "I thought this was going to go in a different direction. Like \"Give it all to her\" and all she got was a shit load of debt. Oh well",
            "Man I love your Aunt!",
            "OP I hope you don’t mind me saying this but it sounds like she learned no good skills to manage her life. Do you think she was babied too much and not disciplined or prepared for life? I say this because I see this often with younger kids of immigrants. They’re often harder on their older kids but later in life as they have less stress and a bit more parenting experience they end up over correcting their parenting styles by being way too permissive to youngest ones which often is not good for those kids themselves because they’re so unprepared for life and feel so entitled. \n\nHaving said that she is definitely another level.",
            "Was the younger daughter your mother or another aunt?",
            "Brilliant.",
            "If you really want to be even more malicious, you should send 1 cent a month instead of 10 dollars. That'd certainly teach her a lesson lol",
            "I can relate with having a parasite relative. Even had a fight with him at my grandma's funeral. He was 30, I was 9.",
            "STANDING OVATION!!!!!! \nGrandmother says to give her the money - I’m like NOOOOOOOOO!\nOldest daughter gives it to her sister in $10 installments for years every month !- me: y YESSSSSSSS!!!FLIP YESSSS!!!!",
            "Could have made it even more malicious by \"giving it all\" including all the debts she owned.",
            "Your aunt is the greatest!",
            "$10 a month.... I love the idea though TBH if I'd thought of the idea I'd go with $1 a month",
            "i wouldve gone $1, ten is too generous",
            "i would have given her a bad cheque or 700 in counterfeit bills instead",
            "Wow. So good! I’m so proud of your Aunt!",
            "my dead aunt pays my spotify now so thats cool\n\nboots up [https://youtu.be/j0lN0w5HVT8](https://youtu.be/j0lN0w5HVT8) and plays it in her memory",
            "Plot twist. Mooch is OP's mom",
            ">**she decided** to do it by\n\nMalicious compliance\n\nPeople conforming to the letter, but not the spirit, **of a request.**\n\nMalicious compliance is the act of intentionally inflicting harm **by strictly following orders**\n\n---\n\nRule 7: Include the fallout. Wait until expected fallout has occurred before sharing.",
            "[deleted]",
            "Grandma was an ungrateful shit",
            "Perfection!"
        ]
    },
    {
        "post_id": "iq4c3p",
        "author": "Clueguy",
        "title": "Pizza not spicy and well done enough for you? Alright then...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/iq4c3p/pizza_not_spicy_and_well_done_enough_for_you/",
        "score": 16253,
        "num_comments": 497,
        "created_utc": 1599748084.0,
        "selftext": "So quite a number of years ago I worked at a large Pizza Chain. The one with the red roof.\n\nEvery Tuesday evening a group of 12 people would come in to eat. Usually within 30 minutes of closing time.\n\nThey would order 1 large vegetarian pizza, with hot peppers, and ask for the pizza to be well done. They would also ask for chillies on the side.\n\nYou might think, ok, what is wrong with that?\nWell, a large pizza would be cut in 12 pieces.\nThis group would come in, take up a large space, only have water, order the one pizza, each person would have one slice, leave a mess and not tip.\n\nThey started asking for more hot peppers and complaining that the pizza wasn’t spicy enough. They also started sending the pizza back to be cooked more (it was already pretty dark).\n\nWell, one day they sent the pizza back but this time asked for it to be remade not just cooked more.\n\nAt this point it was 15 minutes to closing, I had cleaned everything and was pretty much finishing up my shift. Of course the manager has to appease the customers.\n\nSo I start making them another pizza.\n\nThey want it spicy? Let’s give them spicy. I added a coating of chillies to the tomato sauce. Covered it with toppings and added lots of hot peppers.\nThey want it well done? Fine, let’s put it through the oven twice. (it was a conveyer belt oven. Normally well done is put in the oven 1.5 times).\n\nThis thing came out dark and just smelled spicy.\n\nI cut the pizza and give it to the waitress. I’m now waiting to get an ear full after the customer complains. All prepared with my reasoning that I’m making what the customer asked for.\n\nI finish my shift and the manager calls me over.\nTurns out the customer did ask to speak to a manager... The customer said it was the best pizza they have had since they started coming and it was just how they wanted it. They asked if it could be made this way each week and left a nice tip.\n\nEDIT:\n\nWow. I did not think my story would get so many likes. And my first award! Thank you!\nFor everyone wondering, yes the customers were Indian.\n\nFor others asking why I didn’t just say Pizza Hut. I always find it fun when others subtly describe the well known store / brand. \n\nAs for the tip, it was split between everyone",
        "permalink": "/r/MaliciousCompliance/comments/iq4c3p/pizza_not_spicy_and_well_done_enough_for_you/",
        "comments": [
            "Delicious Compliance.",
            "It sounds like everyone won here 😂",
            "Everyone's tastes differ and people like different pizzas and different doneness, etc. sure! But HOW ON EARTH did 12 people who all like a way overdone super spicy pizza end up together!?",
            "Wasn't this also why potato chips were invented?",
            "Good, win win all around. I had a very similar situation where we had a customer always complain there wasnt enough X on their desert pizza. I added so much to prove a point I didnt think anybody would let it out. So I made sure to make it and box it up for the driver.\n\nThey called and sure enough, they said it was the best one they've ever had and to always do it that way.\n\nEdit: Dessert",
            "Reminds me of a story about some friends of my parents. \n\nThey had a small diner/steakhouse, the husband cooked and the wife waited tables, this was probably in the early 80s. One day an old cowboy comes in and orders a rare porterhouse. \n\nSteak is cooked, sent out, and returned. Not rare enough.\n\nOkay.\n\nSteak number two. Less cooked, but still sent back for being not rare enough.\n\nThe husband was kind of pissed at this point. He cranked the flat-top until it shimmered, threw on a new steak and let it maybe a second per side before putting it on a plate and sending it out.\n\nA bit later the wife comes back. \"He says it's the best steak he's ever eaten.\"",
            "Wow that story took a 180 degree spin wasn’t expecting a good ending lol",
            "I am confused.. Who lost here?\n\nusually in these posts someone loses..\n\nI am confuse.",
            "Theses guys are probably Indian. I am saying by experience. Let me know if I am rite.",
            "Had a co worker do something similar with a smoothie (over blended instead of over cooked) subbed out the dairy for almond milk, and added in what felt like half the fucking shaker of cyan pepper.\n\nShe made the thing into a disgusting, runny, burnt-smelling monstrosity.\n\nGuy loved it. \n\nMy co-worker actually went into the back room and started to gag. She didn't spit in it or anything nasty, she just assumed they guy would give it one look, or as most a sip, and send it back. Apparently the sight of him 'slurping like a porn star' at the drink she made (her words) caused her gag reflex to kick in.",
            "The good news is, now you know exactly what to make, how to replicate it, and when they show up.  You also know that they will tip if they are happy with the pizza.\n\nSo next week, start making the pizza ahead of time.  Maybe time it so that it's just starting its second pass through the oven when the walk in.  They get the pizza they really want, within minutes of sitting down.  They will probably love that level of attention and respond in kind.",
            "Who the hell eats one slice of pizza!?",
            "I was working at a Mexican restaurant a few years back. This customer came in and asked for enchiladas “as spicy as we could make them.” \n\nWent back and told the head chef and he said, I got him don’t worry. He doused these things in some sort of habanero sauce. Coated the meat with it, wrapped them up and covered it in way more of the sauce, topped it with cheese and tossed it in the broiler or whatever to melt it. Basically pepper sprayed the whole kitchen. \n\nCustomer said they were the best enchiladas he had ever had and asked to speak with the chef so he could thank him.",
            "That... well... wow. Good for you, you're an A+ pizza maker who knew hahaha",
            "Sounds like you just got handed recipe for a new pizza, minus the burning maybe.",
            "Reminds me of how the potato chips were invented.",
            "That actually does sound tasty... two times in is a nice crunch. They were probably impressed you went above and beyond. Probably fucked up on the first one.",
            "Awesome. I remember I worked in a kitchen and a few customers would always ask for their bacon burn. But always in a \"No, you don't understand what I'm saying. BURNT. BURNT. Not dark. Not well done. BURNT. You get me?\" We'd do our best to comply but it was actually a little hard to get it to the place they wanted. I feel for folks who like their food that way. Most cooks feel like they're insulting the guests by doing it that way even if the customer is explicitly asking for it.",
            "This type of backfired malicious intent is kind of how Nashville hot chicken was created. Not in a restaurant with customers, but in a home with a dysfunctional couple. As the story goes: a wife, angry that her husband has been going out behind her back, decides she’s going to punish him by feeding him his favorite fried chicken, but she’s loaded it with cayenne to make it too hot to eat. It backfired. The husband loved it. Then the family started selling it. I think that was back in the 1930s.",
            "I had quite a few similar customers when i was in college.   \n\nHad a customer that used to order extra onions on his sandwich.  Never sent anything back but one time I was having a bad day when he came in to place his order.  Sure enough. Ham and cheese,  extra onions.  You got it dude.  \n\nI put so many fucking onions on that thing, there was easily 2x onions to rest of the ingredients.  He took his food and came back about 20 minutes later. \"That sandwich was perfect.\"  He asked for me to make his order every time he came in.  Onion sandwich with ham and cheese,  every time.  \n\nEnded up being a cool dude and he got a good laugh when I told him about how I refined his order to his liking",
            "Reminds me of when I worked at Wendy’s in the 90s right when the spicy chicken was new and the drive-through started staying open until midnight.\n\nOne day at like 11:56pm a car comes through and wants a spicy chicken sandwich.  We didn’t have any and they took 7 minutes to cook.  We gave him a regular chicken sandwich and squeezed a few hot sauce packets on it normally given with chili.\n\nHe came back and said he knew it was wrong but wanted to know what we did.  The manager starts asking around and we admitted it.  Expecting to be yelled at, it turned out that he loved it and wanted it that way every time.\n\nThus a new unlisted menu item was born.  It actually is really good, arguably better than the real spicy chicken sandwich.  Try it.",
            "This reminds me of how potato chips were invented. Apparently someone ordered potato wedges. I think they were used to having thin ones because they were from France or something so they didn't like how American ones are thicker? So they kept sending them back until the chef got annoyed and basically made potato chips, which of course were delicious.",
            "\"fuck you\"\n\n\"Thanks!\"",
            "I once got chatting to a waiter at a local curry house and he told me a similar tale where a customer kept demanding more spice in his curry and complaining it wasn't spicy enough. \n\nThe staff basically said f-it and made the spiciest curry they could, they even made the guy sign a waiver in case he had some kind of reaction. The waiter then explained how this guy sat there and ate the whole thing, without drinking anything at all, and once finished said it was just OK and it could have been spicier!",
            "That is not how I expected that story to end. Turned out well. Except for the having to stay late part, I guess.",
            "A serious question, why cant people just say where they worked at if it a bug chain like Pizza Hut or McDonalds? Can you get copyrighy striked on reddit?",
            "I worked at a restaurant on a golf course one summer and we had a guy that would come in for 2 salmon salad sandwiches and ask for extra extra lettuce on each so I put a solid inch of lettuce on each and I ended up being the one he asked to make them all summer.",
            "What a well written story... you totally had me thinking this would end with the customers complaining.",
            "Legend has it this was how potato chips were invented. A difficult customer at a restaurant kept sending his fried potatoes back because they weren’t thin and crispy enough. The chef was so exasperated he sliced them paper thin and fried them to a crisp, with malicious compliance in mind. The customer surprisingly loved them, and a new snack (and regular menu item) was born.",
            "I want that pizza now",
            "sounds like The Observers from Fringe were going to your restaurant on the reg",
            "This is apparently a problem with white dudes going to thai restaurants too. They ask for insanely spicy but they never think they can handle it so they tone it down for them. They have to ask repeatedly to crank it up 9000% before they actually get what they want",
            "*Malicious intent becomes perfect compliance.* Always funny when that happens.",
            "What an interesting group of taste buds.",
            "I used to work at a locally owned pizza restaurant in my town. One day my husband (then boyfriend) came to meet me on my break for dinner. I put in his food order and my coworkers decided to \"see what he was made of\". They were not sure about my husband because most of the guys I worked with treated me like the little sister they were over protective of. \n\nMy husband ordered a jalapeno pizza. A large one. They put the peppers edge to edge if not overlapping. Every single square inch was covered with jalapenos. Hubby at the entire thing. He drank an entire pitcher of iced tea with it, but he loved it. He also really impressed my coworkers (who expected him to send the pizza back to be remade). They just never suspected how deep his love of spicy food went!",
            "Potato chips came to be because a guy sent his potatoes back claiming they weren't well done enough. Out of spite, the chef made new potatoes cut as thinly as possible, and cooked to a crisp. The customer was elated!\n\nSource: From back when the History Channel actually did shows about history.",
            "Too funny! 😂😂",
            "tl:dr - Gordon Ramsey, OP's comin for ya",
            "/r/deliciouscompliance",
            "Sounds like my dad ordered that pizza. He wants everything burned and spicy...though there is no way he would gave shared it with 11 people!",
            "That pizza sounds like my fucking jam",
            "This is the story of how potato chips were invented too!",
            "[deleted]",
            "Sounds like you ran into The Observers.",
            "were they brown? cause i can tell ya..... we do not find your spice, spicy. douse that shit in chili sauce babyyy",
            "total r/deliciouscompliance",
            "[deleted]",
            "i'm really into garlic on my pizza\n\n i remember having to tell one pizzeria:\n\n\"put extra garlic on. then put more garlic on it. and when you finally think it is too much, put more garlic on it\"",
            "[deleted]",
            "Huzzah!  A tip, finally.",
            "Provoked compliance accomplished! With burnt offering to boot!! Well done you!",
            "And that's what tips are for- going above and beyond. They should not be for doing your job- that's your employer's responsibility.",
            "Regular customers are regular income...give them what they want.\n\nThat actually sounds like a great pizza.  Sadly no Pizza Hut around here or I'd go show them your post. :)",
            "I would have accepted Pizza Hat.",
            "This should be in /r/Unexpected",
            "Thats hilarious.  Sometimes the customer really does want what would normally be an inedible pile of garbage",
            "Well I mean to be fair to them, once they got what they ordered they tipped well. I sorta get them. It’s not their fault they like something weird and since it was never prepared “right”...\n\nAlthough they should have been more explicit about it. Some foods I eat with a ridiculous amount of mustard. Like ridiculous. Like for one meal half a bottle... And I always say I am happy to pay extra but I need a lot. And most of the time they cannot gauge it, so I’ve more or less given up on eating stuff like that while out. So I can relate. Hey if they like half burned pizza that 6 million SHU... if they are nice and tip nice. Why not?",
            "I'm an indian and this made me laugh out loud \n\nPS idk how pizza is made in the US. Here it's spicy enough, unless the customer has high tolerance for spicy. We can add the extra chilli flakes they provide tho",
            "Might be an unpopular opinion:\n\nThat was kind of a dick move. Luckily it turned out well but the customer didn’t do anything wrong as far as I can tell and you tried to give them a bad experience.",
            "Lol. All this time they wanted it spicier xD",
            "My go to when I ask for spicy is \"make it hurt.\" I either get the level of \"i think this pasty ass white girl is lying about her spice level.\" And I get mild or I get \"imma show this pasty ass white girl the meaning of spicy.\" And get the chef special level of spice. There is never an in between. \n\nI want chef level spice. My regular Thai place gives me that spice level and has since day one.",
            "This happened to me once with a sourkraut and canadian bacon pizza and they would alwayss ask for extra extra extra sourkraut. One time i was busy af and annoyed so i put about a 1/2 inch layer of sourkraut and then called back later saying \"hey i ordered the canadian bacon extra sourkraut pizza\" and i said \"yeahh?\" Fully expecting him to complain and then all of a sudden he tells me it was the best pizza he ever had, it caught me way off guard and it felt pretty good to get complimented, but then i realized i have to put that much sourkraut everytime he orders now or he'll be disappointed (it was basically the entire amount we have in the prep table)\n\nEdit: also you should checkout r/talesfromthepizzaguy",
            "Who the hell only eats 1 slice of pizza?",
            "They remodeled the ones in my area and they don't have red roofs anymore and I'm actually kinda sad about it",
            "You can ask for a pizza \"well done\"? Is this a thing? Because my closest delivery chain has been delivering our pizzas more and more doughy and I'm always too hungry to send them back",
            "Malicious compliance turns into a win for everyone. Don’t see that often.",
            "Same kind of person who'd order a well done steak.",
            "I'm lost as to how this is even malicious compliance. \n\nThey asked for spicy and well done, and you made them a spicy and well done pizza.\n\nIf you put ghost peppers on it or something , that would be malicious.",
            "r/aww",
            "Our wallyball team did that every week as well, and developed our own special pizza, and named it after our favorite waitress. But we tipped and drank a lot too.",
            "I had a similar experience with a customer at a different chain. Never enough mushrooms. He sent it back every single week for more mushrooms. We started charging him for extra mushrooms automatically (otherwise it would throw off projected inventory) and it turned out he was totally fine paying more lol. This was after months of weekly conflict.",
            "Not gonna lie, they had us in the first half",
            "This has to be the most wholesome ending I've seen the one of these things.",
            "This happened to me long ago. We had a delivery customer who would always order their pizza extra well done, and they'd always complain it wasn't good enough. Finally my boss said screw it, ran it through the oven about three times, sliced the charred remains and boxed them up.\n\nI delivered it, and was glad to see they were most pleased by it! Got a good tip - don't recall sharing it though (he was already annoyed about them so why annoy him further? :trollface:)",
            "How can I order a pizza to this specification where I am?",
            "I once made food with 1/4 of a cup of cayenne pepper powder because it wasn’t spicy enough for my friend lol",
            "You tried to be malicious and turned out to be benevolent!",
            "ok so i skipped the text and went straight to the comments, what the kentucky fried fuck is a well done pizza. steak can be well done because you can eat the meat at its highest point of cooking, or is lowest point conversely, but pizza cannot be fucking well done. You can cook a pizza in 3 ways, the dough is raw, its done, its burnt",
            "I can 100% GUARANTEE this was an indian/pakistani group because well done is exactly how they get their naan toasted, and they are crazy with their spice tolerance",
            "Task failed successfully.",
            "As an ex Indian student who's gone out for pizza with other ex Indian students, that sounds like a couple of car loads of poor Indian students out to split a pizza. \"Extra chilli flakes please\".",
            ">The customer said it was the best pizza they have had since they started coming and it was just how they wanted it. \n\nNo way! I've never heard of that before! Amazing! You did good.",
            "> For everyone wondering, yes the customers were Indian.\n\nBut... Didn't you say they tipped at the end?",
            "How do you get 12 people to agree on one pizza?",
            "I can understand spicy from  cultural standpoint, but how the hell can someone stand eating something that is bordering on charcoal. Like how do you not taste the burnt?",
            "Then they went out to their cult meeting where they sacrificed a cat to the spice demon.",
            "Then you realized you just sucked at making pizzas all along, up to this point",
            "r/accidentallywholesome lol",
            "Unexpected",
            "That outcome was unexpected!!!\n\nGj op.",
            "I want to taste this legendary spicy pizza",
            "Dammit! I was all ready to get a justice boner but I’ll have to settle for a wholesome 100 reddit pizza moment",
            "r/deliciouscompliance",
            "That twist ending...LOL",
            "I wouldn't know whether to laugh or to cry.",
            "Unexpected ending! I guess the customer IS always right!",
            "r/unextexted",
            "Did they stay loyal customers after that? Did they ever learn to not be sloppy?",
            "So...you did your job?",
            "They had us in the first half, not gonna lie",
            "I saw one exactly like this with a few weeks ago.... with a few details changed",
            "What is it with old people and wanting pizza to be \"well-done\"?",
            "“I’ll show you... oh, wait. You actually liked it? That’s cool, I guess.”",
            "Well from malicious to perfice cooking. Odd croud but if they like it like that well you better have remembered the way ya did it. They happy and left a big top making your boss happy everyone wins. Even you as you can just know it's what they like and they and the rest of the customers are the blood of your shop.",
            "Pretty sure I heard this story before on here a week or two ago",
            "Damn dude",
            "Most wholesome MC ever!",
            "When you say chillies, are you talking about crushed red pepper?",
            "were they indian?",
            "They were Indian weren’t they \n\nedit: lmao posted before I read his edits I knew it",
            "Wait this is almost the exact same story I once read in a comment, except they used jalapeno juice I think, but everything else almost the exact same ummmmm",
            "Reminds me of the story of how potato chips were invented. Some royalty wanted the potatoes sliced thinner and sent them back and so the chef was like... You want them thin? I'll show you thin! And sliced them as annoyingly thin as he could. Turns out the royal bro thought they were great.",
            "You're a genius",
            "I don't understand how customers in a dine-in situation can \"leave a mess\"... isn't that just? Normal? Did they leave a mess not related to just eating a pizza??",
            "i love dominos",
            "Ngl I would like to try that pizza...",
            "wtf",
            "If they liked it so much why wouldn’t they want more than one slice??",
            "I'm pretty sure I heard the exact same story except at a pizza store named after a game and instead of a group it was one dude eating a whole Jalepeño pizza himself.",
            "They probably would have had better luck originally not going to a chain pizza place. I'm sure a mom and pop pizza place would have made that scorching to begin with.",
            "Wow what a twist!",
            "To be fair, in my experience Pizza Hut tends to undercook their pizzas relative to everyone else. Very high moisture content in the crust and sauce so it takes about 1.5 passes through the oven to get to the perfect amount of \"done-ness\".\n\nI worked at Little Caesars and Dominos before, so I know a bit about the pizza world.",
            "When malicious compliance goes wrong",
            "Lol if you don't know the story of how potato chips were invented, there are a lot of parallels. An angry cook, ungrateful customers, and a happy ending.",
            "Sounds like the best pizzza ever",
            "Aw. A nice story! How pleasant!",
            "Great story.",
            "1/12 of a large would only Hanger me.",
            "I didn't read it but I know it's pathetique",
            "LOL That's hilariously unexpected. I'm, uh, glad you managed to please them. Even if you were just trying to show them how much they were asking for.",
            "This is the first time I've heard of a well done pizza.",
            "Indian style pizza!!",
            "This is exactly how potato chips (crisps for you Angles across the pond), came into existence.",
            "Of course they loved it! Malicious food compliance seems to always end this way",
            "Didn't I read this somewhere else?",
            "Hahahaha were these customers Indian?!",
            "Like the story about the customer wanting Very Thin Crispy Potatoes, so the Chef cut them Paper thin, and the outcome Potato Chips, a Very Happy Customer, and the Rest is History!!!!!",
            "So they wanted spicy peppers on burnt bread. Wtf is wrong with people?",
            "Well done, sir! Lol",
            "You xpost to /r/kitchenconfidential?\n\nThose dudes might like this one.",
            "Excellent! Sounds like everyone won here.\n\nIn similar fashion, my husband is very simple in his orders, I am more unique. When we get coffee, he wants a black Americano. I love cold press with cream, but I hate that they absolutely fill the cup with ice, so I ask for very little. Only a handful of times have they made it with one scoop of ice as I requested.\n\nI always tip extra and thank them profusely for making the best damn coffee. Yes, it's unusual. I don't care. I'm paying for it and want what I asked for.",
            "Wow you literally gave them what they asked for and they were happy.\n\nWhen I ask for a bacon and egg roll I ask for extra really crispy bacon. You know how how it 99% always comes. Fucking floppy barely warm bacon.",
            "This is how potato chips were invented. ***~~Malicious~~*** ***Delicious Compliance.***",
            "Apparently this common enough, but I haven’t posted this anywhere else",
            "Worked there too before but not at a dine in. My manager had someone do something similar but that pizza was black when it came out after 2-2.5 times through. The customer loved that burnt abomination.",
            "I had a manager do something similar once. He got pissed that they sent a pizza back because it didn’t have enough extra olives. Way more pissed than could ever have been necessary (plus he was high af). So, he piled on, literally, 3 inches of green olives, crust to crust, threw back through the oven, and sent it out. Customer said they loved it. I wanted to vomit looking at it.",
            "Is there a reason why people on this sub don't just say pizzahut? It's not like reddit is the bbc or something. We can say negative stuff about companies if we want.",
            "Man the oddest one I got was he wanted it almost burnt( same thing go through twice) and then he wanted it put in the freezer and served cold.\n\nI thought for sure prank call but nope, left a huge tip too 0.o",
            "It's funny. Had they just been specific about what they wanted they'd have been much happier.",
            "Damn this is awesome",
            "lol. sometimes people like burnt stuff. I had to tell my friends when we were making bacon that it literally could not be too black and I would still eat it",
            "The \"I want it spicier\" was pretty common when I worked in a cajun restaurant.\n\nThe cooks definitely saw that as a challenge and complied with \"oooh, you want spicy? I'll give you spicy.\"",
            "Isn’t this how potato chips were invented?",
            "I think people don’t say major name brand names to avoid the name being searched... like by company attorneys",
            "I love a happy ending",
            "Must have been silver miners.",
            "Sounds like they love burnt spicy pizza 😅",
            "That’s wild. I took a trip down to Costa Rica when I was younger and went to a local pizza joint. Their pizza was double cooked and had spicy marinara default. Pretty neat.",
            "Thats how potato chips were made. A chef was offended by somebody who said his \"potato circles\" (or whatever the fuck he probably called them) were too thick and not cooked enough, and cut them extremely thin and fried them to a crisp",
            "You guys probably wont relate but I like the regular size totinos pepperoni pizzas with cold peices of velveeta block cheese, and dip in grape jelly. You dont even really pick any up, you just rub ur bite on the jelly blob.",
            "This reminds me of the origin of potato chips.",
            "This is how potato chips were invented",
            "Isn't this the plot for the invention of potato chips? Some grouchy customer wanted potatoes cut thin and salty, and kept sending it back to the kitchen to be remade, until the chef started raging and cut them REALLY thin, and salted a BUNCH, and fried them until they were REALLY crispy, and the customer ended up liking it.",
            "Unexpected",
            "YOU’RE ALLOWED TO SAY BRAND NAMES ON REDDIT",
            "Smells like a very r/deliciouscompliance story to me!",
            "Didn’t see that coming! Well done!",
            "I didnt know pokemon centres sold pizza",
            "Operation failed successfully? This is a fantastic story. I love it.",
            "So not bad customers. Just a terrible palette. Huh.",
            "That sounds like a perfect pie.  I kind of wish I was near you so I could order one like that.  Maybe I'll place a custom order tomorrow night..",
            "/r/deliciouscompliance would like a word with you.",
            "Plot twist?",
            "Well I didn’t see that ending coming",
            "Huh, did not expect that",
            "You could be on to a winner.  This is like the origin story of the potato chip and the pissed off chef who first made them.",
            "Reminds me of the apocryphal story of how potato chips were invented. A customer ordered fried potato slices but kept complaining that they weren't sliced thin enough. Frustrated, the cook sliced the potato so thin that they came out dry and crispy after frying it. After tasting the crispy potato slices the customer absolutely loved it and this potato chips were invented.",
            "who the fuck tips at pizza hut hahahahaha",
            "I will literally exhale if this [exact story](https://www.reddit.com/r/MaliciousCompliance/comments/7exmyt/the_pickle_burger/?utm_source=amp&utm_medium=&utm_content=post_body) gets retold but with another food item. The other version of it was with donuts but you gotta be shitting me. Don’t know if the one I linked is the original either.",
            "This is pretty wholesome",
            "You are master chef",
            "I also worked at said red roof establishment. Fucking garbage. Would make pizzas exactly how the customer asked- never good enough. Got a pie thrown at me once because of it. Who knew people get so angry over pizza?",
            "Is Pizza Hut dying out?  The restaurant near me closed a long time ago and I think it was long before covid. \n\nI just imagine with pizza delivery people maybe aren't going to the restaurants anymore.\n\nI wonder what their market share is now.\n\nHell, I'm surprised Little Caesar's is still in business.",
            "Haha love this. Reminds me of me and my brother. We used to fight so much about every little thing. \nAfter spending most of a day fighting I was making a toasted sandwich and asked if he wanted one too, little did he know I was going to smother it in hot sauce and make him suffer, I thought it was the perfect revenge. But he loved it. I was like whats the point in this? We fight and nothing happens, i make a shoddy sandwich, put in the smallest of efforts not even wanting him to enjoy it, and he's greatfull. From that day on we have been best friends and not fought once, mostly because this taught me a lot and I realised I was the instigator.",
            "Wow, it’s a win-win. They get good pizza and you know how they like their pizza now. Nice!",
            "I have these regular customers who always come in for a date night. They never ever tipped no matter how much I tried to give them good service. One day I decided to just stop paying any attention to them except for taking their order and bringing their food and for the first time ever they gave me, not just a tip but, a 30% tip. \n\nPeople are weird man.",
            "reminded me of the best damned chicken ive ever had. Mom forgot about a whole grilled chicken in the oven..for about 2+ extra hours from when it was supposedly done. it came out really dark...\nits been like 10 years since and i still think about that dry charcoal covered thing.",
            "As a Latin America born and raised person living in the US, typically when we ask for extra extra extra spicy, we mean it.",
            "Did NOT expect that to happen.",
            "Ikeep hoping that one day, I shall stumble upon a subreddit about unexpected wholesome compliance, and it'll be full of stories like this.",
            "I don't understand how a person can eat pizza like that",
            "of course they were indian. I was wondering how they managed to get 10 people together who all had the same horrible taste and were all cheap enough to not tip, now it makes perfect sense.",
            "Unsatisfied with the ending. I like my malicious compliance with a touch of petty revenge so if the outcome is the customer is happy, I’m more irritated than anything.",
            "Lol, so many times I've had to do this.  The Indians in the college town I worked in always asked for that, \"wedgie luvar wit capsicum under de toppings, no meat what so ever, please no meat. Clean blade when you cut please\"",
            "I mean problem solved right? Little shits get exactly what they want now that you know what to do and you won’t have to listen. Win win",
            "What is it with people coming in late and ordering a veggie supreme? I used to waitress at said Pizza Adobe chain and I would get a table every Sunday night that would order a veggie supreme with extra pineapple and two slices with no butter or cheese and they would throw a fit if there was ANY dairy even touching those slices?? They would also absolutely destroy the salad bar right before close. I hate people.",
            "Besides the vegetarian and well done part, I am drooling over the spicy pizza."
        ]
    }
]