[
    {
        "post_id": "im97tg",
        "author": "Clintosaurus_Rex",
        "title": "Landlord Tries to Keep Security Deposit... Ummm, No",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/im97tg/landlord_tries_to_keep_security_deposit_ummm_no/",
        "score": 16237,
        "num_comments": 464,
        "created_utc": 1599192968.0,
        "selftext": "About 10 years ago, my at-the-time girlfriend (now wife) and I moved from the area we went to college to an apartment near where we planned to start our careers. I say it was an apartment, but it was really the basement of a house that the landlord had walled off to create 2 \"apartments\" to rent. The place was kinda crappy, but the rent was cheap for the area, and we were close to work. \n\nEverything was fine for a few months, but the only parking for us was on the street out front - the couple that rented the upstairs \"apartment\" had rights to the garage and driveway (they paid more than we did). Suddenly my car got a couple BS tickets for parking on the street - I'm guessing some ass-clown cop needed to meet their quota - and my girlfriend's car got sideswiped in a hit & run. This crap had to stop, so we emailed the landlord (her preferred form of communication) to ask if there's anywhere safe for us to park. She replies, \"Park anywhere you want.\" We had noticed that our upstairs neighbors usually eschewed the driveway to park in the front yard (they were horribly lazy), so we figured that would be a good spot for us too. We parked in the front yard the rest of the year.\n\nWe figured that would be the end of it. We finished our lease, left the place in better shape than we found it, and requested our $1500 security deposit back. After a couple weeks, we got a check for $700... WTF!?!?!? Since there was no explanation, we asked the landlord for one, and she replied that the deducted amount was to \"re-sod the lawn\", claiming that parking on it had damaged it. \n\nNow, I was the one who cut the grass at this house while we stayed there, so I was well aware that the lawn was more weeds and bald spots than grass - picture the African savanna in mid-summer. No one had ever lifted a finger to landscape any part of the property, but the landlord wanted to sell the house once the leases were up, and she figured she could get the renters to pay for a nice, new lawn. I complained to the landlord: didn't care. I put in a complaint with the local housing department: didn't care. I threatened to take her to court: didn't care. So, that's what I did - took her to small claims court.\n\nI had never sued anyone before, so I was going in prepared! I took pictures of the entire front yard - the area that we \"damaged\" was actually one of the best patches of grass, though it did have a small rut that my tires made when the yard was muddy in the summer. I got testimonials from our upstairs and across-the-street neighbors. Most importantly, I printed out the email where the landlord told us to park anywhere. \n\nWe were suing for $1800 to cover court costs and us both missing a day of work on top of the full security deposit. In mediation we said we would settle for $1400, but she must have thought she was in the right because she refused to offer a penny more than the original $700 check, which we never cashed. When we got in front of the judge, it was pretty clear that she had no evidence, hadn't prepared anything, and just assumed that us \"kids\" would fall on our faces. We did not.\n\nWe put everything we had in front of the judge and made our claim (he was impressed). He stopped us when we showed him the email to ask the landlord, \"Did you really tell them to park wherever they wanted?\" When she said \"yes\", the judge replied \"Then what are we even talking about?\", and that was that. Judgement in full for us, and that bitch had to pay to re-sod her own damn lawn. \n\nNext time you tell someone to \"park wherever you want\", you'd better mean it. Or at least don't try to fuck someone over when they comply with what you said! If you made it this far, thanks for reading!",
        "permalink": "/r/MaliciousCompliance/comments/im97tg/landlord_tries_to_keep_security_deposit_ummm_no/",
        "comments": [
            "My landlord tried to keep half our $1500 deposit because of some burn marks, a broken door, and some shades missing - all of which I had taken pictures of when we moved in. All were pre-existing.\n\nI told her (company) that if I didn’t see my entire deposit back by the 4th of the month I was legally entitled to double that amount and I had lawyers on standby if they wanted to go to court over it.\n\nThey paid.\n\nThen I printed out copies of “The Landlord Tenant Act” which she had violated on several occasions (including not giving my full deposit back) and distributed bound copies to every person living at every rental property I could find listings for.\n\nScrew crappy landlords.",
            "I once had a landlord who tried to keep our ENTIRE £2500 deposit for flooding damage which she had refused to fix for months, and which SHE caused by deciding she could fix our broken washing machine herself by forcefully pulling it out without disconnecting it from the water or turning the water off first. \n\nIf she'd been reasonable we probably would have agreed to let her keep some of it, because we did break the bathroom sink (and then lived for months with the only source of water being the bathtub, because she wouldn't replace the bathroom sink and also hadn't fixed the damage she'd somehow done to the kitchen pipes in the washing machine debacle, rendering the kitchen sink also unusable). \n\nBut she wasn't reasonable, and two of my housemates were lawyers (which she knew) so they filed against her, she just didn't turn up, and she had to pay us the full amount back.",
            "Had a rental with a missing screen door. Tried and tried to get them to come put one on, as agreed in the move in inspection. We finally got fed up and went to the restore and installed one our selves. Come move out, our dog has messed some of the screen up, they tried to charge us 300 to replace it. Rolled up with my receipt from the store and a printout of all the emails asking for them to do it. Took the screen door off, put it in a friends truck and went about our day. They dropped the additional charge",
            "Yep, my last landlord tried to pocket the deposit - didn't even offer a pretense of a reason, just told me she'd referred the matter to her legal counsel and we'd be hearing from him (we never did).\n\nI assume the tactic was to make us thankful we weren't in legal trouble so we'd slink away and not cause problems, while she pocketed an extra grand without justification.\n\nThe thing is - I'm a lawyer at a very good firm, so it didn't go the way she planned.  In my state a landlord has to take certain steps in certain time periods if they'll not return the deposit.  She didn't.  As I'd demanded my deposit back and she'd not complied with the statute I was entitled to return of my full deposit plus attorneys' fees and a penalty of several hundred dollars more.\n\nI composed a precise and damning demand letter to her and had my colleague finalize it, sign it, and send it.\n\nA few days later my colleague received a sheepish call from her attorney asking if we'd drop everything in exchange for return of the full security deposit.  We said yes if they'd wire the money within 24 hours, else we were taking them to court.  The money was in my account that afternoon.\n\nI'm still annoyed when I think about that dishonest creep making me go through all that to get what was rightfully mine (well, most of it - I'd rented the place furnished, so there were some small damages she legitimately could have claimed for; but, pigs get fat while hogs get slaughtered, and instead of retaining $150 - 200, she tried to pocket the whole $1,000)",
            "Her preferred means of communication ultimately became her downfall",
            "Fun story! My last Landlord attempted to show our basement suite off before we gave official notice that we were leaving, and without providing adequate notice herself. This being very recent, so you know why we were so concerned- plus one of our roommates had a pre-existing condition.\n\n\nWe contacted the tenancy organization, and upon gaining the knowledge that we were fully within our rights to bar her entry, we printed out a copy of the residential act and taped it to all the entry points. \n\n\nWe then proceeded to block the front door with the couch, just in case.\n\n\nShe thought we were dumb students. Unfortunately for her, we weren't- and we would have gone to court if she'd tried anything.\n\n\nSucks to suck.",
            "I had a landlord once try to keep about £300 of my deposit to buy a new mattress because it was stained. I knew it was horrible when I moved in (I had to flip it because of all the stains) so I sweetly asked them to remind me which safe deposit scheme they put my deposit into, knowing full well they hadn't used one and that was illegal. They returned my full deposit.",
            "To landlords, it seems the deposit has just become a bonus check in their eyes. They can claim whatever they want and just keep it. And unless you took mad pictures before you moved in and when you left you have no evidence to disprove their claim. And even if you did they make you take them to court to get it back. A lot of people are too lazy and just say fuck it.",
            "Where I live, it’s actually illegal to ask for security deposits (exactly because of things like this). When my former partner and I went to sign a lease a couple years ago, we read through it and said, “Yeah... we’re not paying that”. \n\nThey were so confident and assumed we, young adults, would just fold. Yeah, no. We had them alter and initial the lease right there. Gotta say, the looks on their faces was pretty priceless when we reminded them: “You know this is illegal, right? It’s in the Landlord Tenant Act”.  We had already moved half our shit in at that point so they clearly weren’t going to fight us on it. \n\nIt was at that moment I realized that it really does help to read up on your LOCAL landlord-tenant rights. Please do yourself a favour and check out your local city guidelines! Given the kind of absentee landlords they turned out to be, I have absolutely no doubt that we would have never seen that $500 bucks again. Surely they had a plan to just make something up after we left. \n\nKnow your rights!",
            "You actually get your money? I won a small claims court ruling for 3k and never saw a dime",
            "I can imagine the look on the judges face when he asked thta question.",
            "Damage deposits are such a racket. I've had good luck with almost all of mine, but I do remember one time when I received an $18 deduction for a dirty oven handle. I always got a kick out of that, because a) I *did* clean the oven handle, and b) how do you calculate that's worth *$18*???",
            "Fuck. Yeah. \n\nI love it when our generation hands it to these idiots who think they can do whatever they want just because they inherited wealth and/or property. They get away with SO much foul play. So proud of you. Keep kicking ass.",
            "Theres a house that i was looking to rent here in our little town in the midwest that about 6 months ago i know was going for about $500 a month, $500 deposit.\nNot really an issue but i got word that the tenants who grabbed the house before my fiance and i were able to even FIND the damn phone number, we're moving out.\n\nI was excited and went down to the place that was renting out this very small two bedroom (think one bedroom that had a wall built in the middle of it that they smashed down another wall to provide a doorway) house..... Then i found out the rent was now going to be $800 a month with a $1000 deposit.\n\nI wondered why and asked, the landlord told us she 'didnt want anymore white trash breeders in her house anymore' (im expecting in February)... I was floored.\n\nI know that the previous tenants had put a hole in the wall but that was because the adult man in the house fell over after a day of work and tripping on a rug.\n\nBut to increase the rent THAT much just because someone left a hole in the wall and nothing more? Yeah no. Sounds like a nightmare renting situation.",
            "The first place my ex and I rented was like that. We had to paint it before we could move in, couldn't flush the toilet when the upstairs neighbors were washing laundry, their kids constantly took baths that flooded our bathroom because they splashed... I'm pretty sure it was not legally converted. When we moved out, we put the keys in the mail box and let the landlord know. We paid a $500 deposit and expected to get it back, but a month and a half later, we finally got a letter from the landlord with a bill charging us for the replacement of a damp carpet, painting (we actually never finished because we didn't feel like it was fair to be paying rent when we couldn't move in and we were young and dumb, so we didn't know any better), and an electric bill that was from after we moved out. I went to the free legal clinic and got copies of the landlord tenant laws and sent one back to them with a copy of the bill and a letter as to why they were not legally able to charge us for those things and that we could sue them for our deposit back if we wanted to. Never heard from them again.",
            "Had this happen. It was only for $300 and a tree fell on their porsche the week after i moved out. \"Religious\" landlords too lol.  ...try negotiating a non refundable deposit next time you move. That way, nobody owes anyone a penny. Any wear and tear is on them to deal with",
            "Proud of you for standing your ground buddy",
            "In college we asked our landlord to fix some crazy problems that occurred due to circumstances way out of our control and she had the balls to claim we were destroying her house. She delayed fixes for months finding the cheapest contractor to fix it.  In the end the contractor found out it wasn’t just some kids destroying the house there were serious problems outside of our control. So instead she tried kicking us out and selling the house. You can’t just kick people out in my city so she tried raising rent which you can’t do if repairs aren’t done. We got tired of playing defense so we went to a lawyer to play offense. We sued her for a ton of money and her lawyer came back with the most bullshit counter offer of $100 per person. Our lawyer actually called her lawyer to ask him if he was fucking serious. In the end our landlord should have taken our first offer because she lost almost double our demand in market value to the house alone. Had she paid us what we wanted and fixed the house she would have gotten it all back in the value of the home. Instead she paid for the repair lost the suit and had to sell the house for less because she thought that would magically make the lawsuit disappear.",
            "This post deserves a golden chair on this sub.  Oh sweet revenge!",
            "I had a landlord try desperately to keep at least part of my deposit.  $25 for carpet or something.  Well, I'd been living there for 5 years and the carpet was cleaner and somehow in better shape when I left than when I moved in.  I just replied and said \"no.\"  and that was the end of that.",
            "Go fuck yourselves shit landlords. You are not holding up the entirety of society on your two shoulders you pricks.",
            "When my BIL and SIL moved out of their Apartment in Virginia the land lord simply ghosted them re their deposit.  They were bummed bc they needed that money.  \n\nA quick google search showed that landlords have 45 days to send tenant itemized list of damages.  If they don’t then they have to send entire deposit.  After 3 months LL did neither.  \n\nWe wrote a quick letter citing the relevant state law and they got check for full amount back in the mail.",
            "I’m getting a fucking house when I grow up. FUCK dealing with landlords and deposits.",
            "Excellent. And it do pay to be prepared!",
            "wow.   you got really lucky with that judge.  my husband and i had to sue a landlord to be able to break a lease because the house we were renting wasn't up to code (we'd done a cross-country move, had to rent the place blind).  we had documentation from the state health inspector that was an inch thick, along with repeated attempts to get the owner to rectify the issue.\n\nthe damn judge ignored all the evidence and sided with the landlord.  our lawyers were so pissed off that they put in the appeal for us pro bono and got the judgement overturned.  we still haven't seen a dime, and the judgment keeps racking up interest... almost a decade later.",
            "Interesting. It's very rare for small claims court judgements to include lost wages for going to court.",
            "Oh man, I wish I had the time when I moved out of my last place to be able to comply with the agents requests. They asked us to return the “shrubs” out the back to their original height. Except they were actually trees that had grown about 3m in the 2yrs we lived there, so there were no branches below the original height. If I’d had access to a skip in time, I’d have bloody well cut them down then sent a photo of 3 tree stumps. In the end I just tidied them up a bit, quoted the legislation saying major lopping is the landlords responsibility, and that we only need to do light pruning. Threatened to lodge a claim with the magistrates court to get my full bond back. They relented within about 24hrs of that threat.",
            "Wow, I don't think I've ever gotten a security deposit back before from a landlord. I think one time they said we owed them, didn't give em that though.",
            "I can't figure out where the malicious compliance comes in, but it sure is an entertaining story. Thanks for sharing :)",
            "Before I bought my current house, I lived in a small apartment which had brand new carpets and such when I moved in. A few weeks after moving out, we were told we'd have to pay around $400 for carpet replacement and ozone treatment (in the form of a bill we received), and we wouldn't be getting our deposit back (another $400). They also refused to prorate the rent back to us (we moved half a month before lease was up), even after I explicitly asked if they would before moving and they had said yes. Once we received the bill, I asked about this, they said that they *never* prorate rent. \n\nThey tried to say there were cigarette burns in the carpet, and a heavy smell of smoke.\n\nThing is, no one that lived there (mostly me, 2 others toward the end) smoked cigarettes, or even allowed them to be smoked in the apartment.\n\nI complained to them and they basically told me the work was already done so I had to pay. \n\nMy realtor happened to be a realtor from the same company who leases the apartments, so she was able to escelate the situation up the ladder and a few weeks later we ended up receiving our full deposit back, plus prorated rent.",
            "As a landlord, this makes me happy. I had two young kids rent from me. One day, one notified me they needed to register to vote and told them they could use the lease as proof of residence. The next day, one brought me their *blank* lease.\n\nThey only returned one filled out copy, when I supply two blanks. Wow, I didn't notice. I explained to them their rights as renters and told them to always get a signed copy of their leases. \n\nI hate scumlords. They make the rest of us look bad.",
            "I like the story but this is not Malicious Compliance. It is something like \"I had a dispute, used the appropriate legal channel, and won.\".",
            "I once had a landlord keep some of our deposit for \"temporary stairs\". All he did was nail new boards on top of the old stairs. Also, they are still there (I sometimes visit my friend, who lives next door, and I can see). He also charged us for a broken window (I did break it with a Frisbee), and he never replaced it. Luckily, the window was already boarded up on the inside. The main reason why we left was because he let some random old guy in our apartment without telling us. I almost punched the guy in the face because I was coming back from summer camp, which happened to be at the nearby police station. We didn't call the police (dumb decision), but my mom did scream at the dude, who also admitted that the landlord was crazy, and thought he told us. He was in the basement to 'fix' the heating system that we weren't allowed to use.",
            "That $700 is bs, too. I paid $70 for a bag of seed to repair spots in my lawn and 3 weeks later it's perfect. Anyway, that was awesome prep for a small claims case. Congratulations!",
            "I’ve posted the story on here before, but here is the short version. Landlord was given verbal notice we were leaving, then didn’t pay back the security deposit because he didn’t get written notice. I was moving out three weeks after my wife, who I was in the process of divorcing, died of an overdose. With everything that was going on, I didn’t feel like taking him to court. I let karma have him. About six months later, he calls me to tell me that the rent is late. I reminded him I didn’t live there any more and he realizes he called the old number. He then proceeds to tell me how the guy who rented the place after me threatened to blow it up, and kill himself. The cops came and they broke the front door, all but 3 windows in the house, and two sliding glass doors. $16,000 worth of damage. Thanks, karma!",
            "I had a crappy hole in the wall studio apartment in an iffy neighborhood. I joke that it didn't matter that we had restricted entry, since half the people that lived there were the kind of people it was meant to kick out. More than once i found distinctly human feces in the stairwell. I had a tiny balcony, that we really only there because i was between two bigger apartments in the corner so they just gave my little corner a slab of concrete that connected the other 2 balconies. My \"balcony\" was bordered on both sides, with my window on one side and the wall of my neighbor's apartment on the other and the open end with a waist high fence. I was only on the second floor of this 6 floor building and they apparently decided not to do this on any of the other floors, so i would get rain on my little 4ftx6ft patch of concrete. It had a drain, but the drain wasn't sunken enough so it didn't do much. I had noticed halfway through my year there that sometimes with heavy rain the carpet just inside the back door would get damp. I made 2 maintenance requests over the phone (so i didnt have any record i had done them) and both times they told me it was fine. I also had 2 bookcases near the door. When we moved out i noticed a small black patch, maybe the size of a quarter that i thought might be mold. I took a picture and made mention to them that i had noticed it. It comes time to get my deposit back and its half what i paid (can't remember the numbers now). When i contacted them about it they said they had had to replace the carpet and took the money out of my deposit. I asked why the carpet had to be replaced, since I'd cleaned it and despite the small black spot everything else was in order. She said that the people that went in to assess it said the carpet needed to be replaced and i was at fault. They documented no pictures, no description of the particulars, just that the carpet would be replaced and it needed to come out of my security deposit. I tried showing them the pictures i took on leaving and they said they couldn't accept those as i could have doctored the time stamp in my phone somehow. They wouldn't let me contact the person they had had assess it and refused to follow up on my behalf. I explained the drain problem and the wet spot and that i had reported it, but since i didn't have any proof i had reported it i had no case. I was about q month away from getting married and traveling to Japan and starting nursing school at the time and couldn't handle the extra stress and expense of trying to take legal action , especially without any hard evidence to make my case, so i gave up. It was a fitting close to my time there. \n\n(Ps, on mobile)",
            "My first landlord tried it on with me a bit on the day I turned up to clean out the room I had rented before giving the keys back. \n\nHe claimed the floor behind the toilet was rotten and caused by “someone pissing on it” etc. Certainly not me - I wouldn’t piss my own floor let alone anyone else’s. \n\nJust seemed strange that he zeroed in on that one exact spot, as if he knew it was damaged anyway...\n\nA few minutes of back and forth, me standing my ground, he said to forget about it. He’s been a decent landlord up to that point, quite out of character.",
            "The most malicious I saw someone be towards a landlord required a ridiculous amount of black paint.  TLDR: Always specify color of paint \nin lease.\n\nWhen this girl went to move out after being a perfect tenant, the landlord refused to give her the deposit back unless she painted the apartment as specified in the lease agreement.  It just said the apartment had to be painted.  It did not specify color.  It did not specify surface. It just said *apartment.*\n\nSo she painted every surface **BLACK**. Several coats. Floor. walls. ceiling.  counters. cabinets. doors. Bathtub. Literally every surface.  It actually cost her more than the deposit.\n\nhe took her to court over it. she won because he did not spell out color or surface.she got her deposit back.\n\nHe got a HUGE repair bill.  Basically he ended up having to gut the apartment and refloor, redo the drywall, redo the ceilings, counters cabinets, every surface because the black paint keep seeping thru the cheapass white paint he would use.  After that he specified the walls had to be painted white before you could move out.\n\nSpecificity is a contract writers best weapon.  and can be yours too if the other party doesn't pay attention to it.",
            "MAO WAS RIGHT!",
            "> and that was that. \n\nI am proud of how seriously proud of how over prepared you were! that email, as the judge stated, and her admission she wrote it, was all the evidence you needed, and saving it for last was truly malicious!",
            "I told this story to a room full of people and they all applauded. Great work, very well written",
            "That's why you want to get everything in writing, specially when dealing with stuff that can be misinterpreted. The landlord forgot you also had everything in writing.",
            "You should've parked on her face.",
            "The first home I rented with my husband, the landlord tried to withhold part of our security deposit because the microwave apparently smelled like popcorn.",
            "Our landlord just didn't care. We saw her three times in six years- once when we originally rented the house, once when we complained about the people she hired to repair a wall that ended up having a huge hole in from the house being in bad condition (it literally grew by itself and we kept informing her about it until after about a year), and when we bought our own house and moved out. We ended up letting her be our realtor and she was annoyed that we wanted to look at so many houses, a lot of which she picked out and were in about the same amount of disrepair as the house we were renting. We got a decent deal on a cute house and never talked to her again. Surprisingly, she gave us the entire deposit back, most likely because she realized she did nothing for us as a landlord and did barely anything as a realtor.",
            "The best legal advice I ever got was \"whoever shows up with the most paper, wins.\"",
            "During my second year of uni I moved into a house with some friends. I got the smallest room and wasn’t really happy there, stayed in my boyfriends house most of the time. So I told the landlord I wouldn’t be renewing my contract even though my friends would be staying. They tried all sorts of little tricks like saying they wont pay for the internet for the house if it was only 3 people, they had to find another person in my place as it was their responsibility etc just a bunch of shitty tricks basically to guilt trip me. Anyway I moved out a month earlier than my contract and let them know via email my new address they could mail my deposit check to.  A month goes by no reply and no check. Another month. They were first time landlords, and there was no other way to contact them. After months they finally got back to me in the middle of summer - my friends had gone back home before the new school year - to say they had put the check under the door of the room and what seemed to be the problem. I told them that I’d moved out already and they didnt care, they even said I’d have to ask whoever moved in there whenever that may be. I got super annoyef at this point and started taking screenshots of my contract and sending it to them. It stated in the contract the deposit must be paid in full no later than one month after the end date of the contract. They said ok we’ll re-issue the check. So I waited, still nothing. At this point I was emailing everyday it had been 2 months after my contract ended at this point. They told me off for being rude etc turns out the idiots put the second check through my friends door. I threatened to get lawyers involved and said they were being completely unprofessional and my friends could also walk away from their contracts if the court found misconduct on their side (i was bullshitting at this point dont know if I was actually correct) but they said very bluntly that theyd mail me the check at my new address but to not cash it until a certain date. As soon as I got the check I said fuck that and cashed it. My friends also experienced similar issues when moving out and I’ve heard theyve since been fined by the council and havent found tenants for the last 3 years or so",
            "Not malicious compliance, at all, in the slightest.  Yes, you parked in the lawn because she told you to park anyway, but you did not do so with malicious intent, nor did you intend to harm her in anyway.  The harm that came was entirely of her own doing and not directly caused by your compliance.",
            ">my at-the-time girlfriend (now wife)  \n\n So, ex-girlfriend?",
            "Most landlords are scumbags.",
            "This is why security deposits need to be outlawed. Everyone who has rented for a period of time has had to deal with a landlord trying to keep all or part of a security deposit they don't have the right too.",
            "I got screwed out of a lot of my deposit from my first apartment. My roommate and I cleaned it WAY better than when we came in, we left it spotless. He took half our deposit to \"clean up the huge mess\" we made. We were busy and in school and just complained about it. Knowing what I know now, we could have done something similar",
            "nice",
            "Sounds like you met the burden of proof in spades dude. Nice job!",
            "My mom and I’s landlord took a $1500 security deposit for dust (we had moved out 3 months prior, and had cleaned the apartment top to bottom before leaving, of course there was dust) and a stray hair in the sink. Never got anything back.",
            "That's a huge deposit, holy",
            "You did well.  Small claims court is a gamble.  You win some, you lose some.  The judge you get makes a huge difference.",
            "I will take a look.shortly",
            "If it was me I’d have just parked a couple eggs on her roof and been done with it.",
            "Fucking leeches will do anything to keep that deposit, ask for a receipt and if they still give shit tell them you'll see them in small claims court. You'll get deposit back if your legit at this point",
            "I'm confused what you were complying to maliciously? It was a nice story, seemed pretty real I guess, but doesnt really fit the sub, then again, I dont know where it goes",
            "I'm glad I live somewhere where landlords don't hold the deposit, and can't take without your agreement, or a tribunal ruling",
            "Congragulations. \n\nYou and your wife are excellent citizens, and maybe your Landlord will think twice before trying to thief her next tenants.",
            "So you got your full deposit back that you were supposed to get back. Where is the revenge?",
            "I guess you weren't supposed to \"want\" to park in the front yard :/",
            ">\"Did you really tell them to park wherever they wanted?\"\n\nHonest question: Is there no implicit expectation of some common sense the landlord could have countered with? Like \"dont break shit\" shouldnt need to be mentioned explicitly all the time because its the standard case, isnt it?\n\nLike if you invite me into your home and tell me to just sit wherever I want youd reasonably expect me to choose a chair or couch or on the floor, but not your indoor plant or on top of your cat sleeping on the sofa because you would reasonably expect me to not injure or damage something. \n\nIf the front lawn was fucked up anyway that argument wouldnt get as far obviously, but would courts not consider a reasonable expectation of common sense?",
            "This would fit perfectly in r/landlordlove.",
            "Awesome story . I have been a renter  and a landlord . Been screwed over on both sides",
            "What hellish land was this where people are forced to park on lawns?",
            "/r/prorevege \n\nIt fits better there.",
            "This kind of crap is why I am glad that rental deposits are illegal here.",
            "With all these stories this should become its own subreddit r/talesoflandlords or something :)",
            "All landlords are bastards",
            "Insert a long slow clap that grows to a roar!",
            "> we emailed the landlord (her preferred form of communication) \n\nWhat's wrong with an email?",
            "This isn't malicious compliance at all...",
            ".... I don't know why I read the title as \"Tries to keep security _detachment_\" which, well.",
            "I'm glad I live where security deposits are illegal",
            "The best thing any tenant can do is read your states “residential landlord-tenant act” which governs these types of things. Most states require a move-in inspection. Also a move-out inspection where the tenant is present. It must be done in a specified time frame. If something isn’t listed or isn’t noted at the inspection it cannot be charged for. Typically if you have to sue to get a deposit back you’re entitled to 3x the amount in damages. In OPs case, if landlord couldn’t prove the grass didn’t look like that when you moved in then she couldn’t keep your security deposit to correct it",
            "Fuck dat bit-ch",
            "It sounds like you've been whooshed  and can't handle it. Its ok though. Reddit must be like that for a lot of middle aged loners. Good luck to you",
            "[deleted]"
        ]
    },
    {
        "post_id": "pstrlq",
        "author": "benm1999",
        "title": "Buy out our company and then fire everyone before you change the system? Works for me!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pstrlq/buy_out_our_company_and_then_fire_everyone_before/",
        "score": 16218,
        "num_comments": 410,
        "created_utc": 1632263241.0,
        "selftext": "I had worked at a small end rural internet company for nearly 6 years. It was family owned and they paid us all really well for the work that we did. Barely anyone ever left the company. In my position, I was head of sales and I controlled all software that was associated to clients. This had everything in it including billing addresses, service addresses and leads for new clients. It was an outdated program for sure, but it got the job done and it worked for us. Fast forward time and we are still doing our regular jobs when there was an unscheduled meeting thrown at us. We walked in and there were several new faces sitting on the other end of the table. \nThey announced that they had sold the company to XYZ. XYZ seemed like an okay place to continue working because they too were local and the team seemed nice. I was told everything is business as usual and to not do anything different. \n The transition took place and ever so often, someone from the new company would come to me and ask how we would do things and get a feel for it. I could tell they were trying to weed us out so I went balls to the wall with renewals on old accounts. They announced to me that I needed to go to the HR department around closing time. Having anticipated this, I saved all of my commission files and emailed them to myself. I went to the office and they laid me off on the spot because they do not pay commission to their staff. I said okay and that I plan on them still paying me commission for the time I was there as they had not discussed anything pay related with me yet. She said again we do not pay commission. \nI emailed my commission statement to the manager I was working with and basically was told the same thing. Fast forward to the next week when they realized they no longer had the credentials to get into our system and they called to ask for the information. I let them know that I would be happy to do that when I come up there to get my check for commission. I did not hear anything the next day and then I get a call that my commission check is in the office. \nI went up there, grabbed the biggest commission check I had ever made and gave them the credentials. Never tell someone business as usual when you do not intent on things being business as usual.",
        "permalink": "/r/MaliciousCompliance/comments/pstrlq/buy_out_our_company_and_then_fire_everyone_before/",
        "comments": [
            "I definitely would have deposited the check first. I wouldn't put it past those jerks to cancel it as soon as they got the info they needed.",
            "Also pretty sure it is illegal to change pay terms and then backdated the changes.",
            "I worked at a small mortgage company. One morning the IT guy got into a shouting match with the big boss. No surprise when he was fired. He was rehired two hours later when no one could log into the network.",
            "ahahahahahha this kinda rocks.                   \nReminds me of this dude in my neighborhood. He was in a sales position in his 50s.                   \nBUT the privately owned family business offered him an \"early retirement\" deal, where he would \"phase out\" over 5 years. He agreed to work part-time for those years and then take early retirement.                    \nThey signed this as a contract, with steep fees for breaking the contract.                   \nThe company then sold to an investment firm and they got these fresh-faced \"adjusters\" from the new mother company.                \nPeople were being let go left, right, and center, but my neighbor just sat there because he knew that his contract guaranteed him another 3 years of part-time work.                  \nThen some youngster comes in and starts talking about \"enjoying the last best years of your life\" and \"new opportunities elsewhere\" and my dude still just sat there and smiled.                   \nThe young guy hands him his notice - he's being let go.                  \nMy guy just takes the letter, reads it, and puts it into his briefcase and locks it.                    \nSmiles.                  \nTells the guy to check with accounting.               \nYoung dude goes pale, leaves, and comes running back 20 minutes later. \"Can I have that letter back, please?\".                  \nStill smiling, my neighbor just goes \"no, you'll be hearing from my lawyer. And by the way, don't fret. You might have breached the contract, but this may open nEw PoSiBiLiTiEs for you.\"                 \nLeaves, hands everything over to his lawyer.                   \nThat year, he completely re-did his roof and remodelled the house for his son and the grandkids.                   \nHe was still smiling and just shrugging when people asked him how he could afford that.",
            "Great job of CYA!",
            "Was waiting for the ending of “grabbed the cheque and said ‘what credentials?’”",
            "Yeah I'd have just took the money and tell them that you're unable to give them the credentials because you don't work for them anymore.",
            "I have a love for paragraphs and a fetish for being denied, keep it up.",
            "Should have got your check and not given them the credentials because you don’t work there anymore.  Fuck them.",
            "Question, had the OP simply picked up the commission check, which he was legally owed, and didn't provide the login information, could the company do anything.",
            "Mate you should've just taken the check and left",
            "[removed]",
            "I feel like you missed out on a ton of other opportunities here..",
            "Should still have not given them the credentials. They were happy to fuck you over when they thought it served them. If anything you should have offered your \"consulting services\" for the low low price of 10x what they owed you in commission.",
            "You should’ve kept the check and left.\n\nOr sold it to them. \n\nYou left money on the table.",
            "Should have charged them a sky high consulting fee on top of the commission.",
            "You should have also asked for a consulting fee equal to your entire salary since you were no longer working for them but had to come back and consult on how to get back into their old system.",
            "I made some paragraphs for you, but I think this is more petty revenge than MC.  \n\\--\n\n&#x200B;\n\nI had worked at a small end rural internet company for nearly 6 years. It was family owned and they paid us all really well for the work that we did. Barely anyone ever left the company. In my position, I was head of sales and I controlled all software that was associated to clients. This had everything in it including billing addresses, service addresses and leads for new clients. It was an outdated program for sure, but it got the job done and it worked for us. \n\nFast forward time and we are still doing our regular jobs when there was an unscheduled meeting thrown at us. We walked in and there were several new faces sitting on the other end of the table. They announced that they had sold the company to XYZ. XYZ seemed like an okay place to continue working because they too were local and the team seemed nice. I was told everything is business as usual and to not do anything different. \n\nThe transition took place and ever so often, someone from the new company would come to me and ask how we would do things and get a feel for it. I could tell they were trying to weed us out so I went balls to the wall with renewals on old accounts. \n\nThey announced to me that I needed to go to the HR department around closing time. Having anticipated this, I saved all of my commission files and emailed them to myself. I went to the office and they laid me off on the spot because they do not pay commission to their staff. I said okay and that I plan on them still paying me commission for the time I was there as they had not discussed anything pay related with me yet. She said again we do not pay commission. I emailed my commission statement to the manager I was working with and basically was told the same thing. \n\nFast forward to the next week when they realized they no longer had the credentials to get into our system and they called to ask for the information. I let them know that I would be happy to do that when I come up there to get my check for commission. I did not hear anything the next day and then I get a call that my commission check is in the office. I went up there, grabbed the biggest commission check I had ever made and gave them the credentials. Never tell someone business as usual when you do not intent on things being business as usual.",
            "I'm just thankful that you had the leverage, because that is messed up. I hope you got a better job with someone else who cares about their employees. This story would have been pretty bittersweet if all of that had included a long lawsuit with all those legal fees cutting into your check.",
            "My company changed time card systems. Apparently my boss did some funky accounting with my sick time,  because we both knew I'd used every bit of it and then some,  but upon switch over I got paid out almost all of my sick time.\n\nI reported it to my boss, his boss, and the time card people....no one could fix the error, so free money.  Thanks boss!",
            "I worked with gov customers until they awarded a new contract to a different company. Nine times out of ten the new company picks through the incumbent staff and keeps those who the customer depends on for specific tasks, or the star performers, etc just because it is easier to transition staff (sometimes ALL the staff) to a new contract than bring completely new staff into gov facilities. \n\nWell this new company went scorched earth and got rid of EVERYBODY.  I was on a small part of the non-IT part of the contract and had already lined up another job but MOST of the contract was the IT HELP DESK. Bonus! All the trouble ticketing and remote ops software belonged to OUR OLD company so it went too. \n\nI know from starting my new position (just up two floors in a different division in the same building) that there was NO HELP DESK for almost TWO MONTHS because there was no staff left to answer the phones or resolve issues. Network ops seriously sucked too because the operating software was disabled and uninstalled. \n\nIn the end, they did hire back about 20 people of the 145 they let go. Many of their own employees they planned to staff didnt have the required skills and many couldnt pass the background check to get building access.  Dont even get me started on all the billable hours they missed out on while there were no employees on staff.",
            "Press enter twice \n\nto make a new line. Add 2 spaces to the end and press enter once  \nto make a smaller new line.",
            "Simply put, Employer realized they couldn’t get away with their shenanigans (legal term).  OP’s shenanigans just expedited that realization.  \n\nOP only brandished their shenanigans weapon as a defense once Employer brandished theirs.  I’ll allow it. :)",
            "I would have taken the check then given the wrong credentials. Oops... I thought that was right...",
            "i would sue for a big fat severance package\n\nwith the commission of course",
            "Just as an FYI, keeping company credentials hostage is a crime.\n\nSeveral sysadmins have made the news and gone to jail for similar.\n\nMy suggestion, and it's probably still illegal, but harder prove:\n\n'Forget' the logins the moment you walk out the door.  But once you're paid, maybe remember that you wrote it down and secured it in locked cabinet A, just in case you ever forgot them.",
            "I'd have told the to stick it up their arse and let the business go to shit.",
            "Whenever you hear “don’t worry it’s business as usual or things are to stay the same” you know that the shits going to hit the fan soon. \nGuy I worked with had a similar thing happen to him, he was IT and dropped in it, he stayed late one night and changed every password there was, no one could get into the system or client accounts, nothing. He also had a big cheque.",
            "If i had a nickel for every time I’ve heard a company takeover where “nothing will change” and then continue to absolutely fuck everyone over...",
            "I wouldn't have given them the actual credentials but a wrong set. They were legally obligated to pay you, you were under no obligation to produce company information out of your head on demand after separation from the company.",
            "Should have told them that no further business will be conducted without payment of previous commissions.\n\nAfter that they can hire you as an consultant at $350 an hour to help with any issues",
            "Or, novel idea the OP sold renewals to people with old accounts.",
            "Otelco?",
            "As a sales guy that has been burned by shit like this before, I salute you.",
            "They tell you it’s business as usual so they don’t have everyone quitting at once. They want to lay people off on their schedule.",
            "U are smart😊😊",
            "Years ago…i started with a new company, received my first pay (direct deposit), it’s $5977 …… for two weeks.    When I informed them of this, the one partner yelled, “that’s what I get paid”.   I was told my whopping salary of $35,000 a year was entered as monthly. That sucked.",
            "😎😎 great move op 👍👍👍",
            "Stab in the dark, MLI?",
            "What were the consequences for them if you told them to kick rocks?",
            "sounds like a family owned northern nj cable company that got bought recently by the same entity that bought the one i worked for.  which said nothing would change then cut out unused sick/personal payout, 3 paid sick days, and a paid holiday.  then immediately started buying out and laying off the higher salaries, and making work hell for the remaining staff",
            "And it should had commission (for the work you already did) and a hefty consulting fee (for coming in).",
            "I worked for two different companies that were sold...the changes always start 6 months to a year...and its always nohi g but assurances that no drastic changes will take place.",
            "> so I went balls to the wall with renewals on old accounts.\n\nSo part of your revenge on a shitty company was locking a bunch of people into new contracts with them?",
            "Yaaaas!!!\n\n\nLol. I'm happy you played them. Muhahahahaha.\n\n\nFor me, I left the company (resigned on a Friday, lol to purposely ruin everyone's Valentine's Day plans) and I didn't teach one soul how to do my job. An Evil lady there kept saying I was replaceable and she could dO mY jOb. \n\n\nSo I though \"Lol, okay. Let's see how you do\" she quit 3 weeks after me 🤣🤣🤣\n\n\nShe didn't know how and couldn't take the responsibilities 🤣🤣🤣🤣🤣\n\n\nI'm happy you got your money and made them seem like fools. Hahaha I'm so happy for you. Yaaaas.",
            "I love how employers try to make this so much more complex than it is.\n\nI have a contract. I do the work. I get paid according to the contract.",
            "This one is open and shut. Give your employment contract to a lawyer and have them send a letter to the company. Only an absolute fool would not write you a check immediately. Pay the lawyer $500 and you are done.",
            "But....why did you still give them the credentials? That was not satisfying at all.",
            "How much was the commission check",
            "They always say it’s business as usual when a company is sold… However in reality, they always only look at buying companies with the goal of improving profit, not retaining existing profit levels. This always means change, or NOT business as usual. \n\nSome people end up making changes to make things work, but people can only change so much before the company decides to start changing the people.",
            "Why do you hate paragraphs?",
            "Paragraphs my dude, makes things much easier to read:\n\n>I had worked at a small end rural internet company for nearly 6 years. It was family owned and they paid us all really well for the work that we did. Barely anyone ever left the company.  \n>  \n>In my position, I was head of sales and I controlled all software that was associated to clients. This had everything in it including billing addresses, service addresses and leads for new clients. It was an outdated program for sure, but it got the job done and it worked for us.  \n>  \n>Fast forward time and we are still doing our regular jobs when there was an unscheduled meeting thrown at us. We walked in and there were several new faces sitting on the other end of the table. They announced that they had sold the company to XYZ. XYZ seemed like an okay place to continue working because they too were local and the team seemed nice. I was told everything is business as usual and to not do anything different.  \n>  \n>The transition took place and ever so often, someone from the new company would come to me and ask how we would do things and get a feel for it. I could tell they were trying to weed us out so I went balls to the wall with renewals on old accounts. They announced to me that I needed to go to the HR department around closing time. Having anticipated this, I saved all of my commission files and emailed them to myself.  \n>  \n>I went to the office and they laid me off on the spot because they do not pay commission to their staff. I said okay and that I plan on them still paying me commission for the time I was there as they had not discussed anything pay related with me yet. She said again we do not pay commission. I emailed my commission statement to the manager I was working with and basically was told the same thing. Fast forward to the next week when they realized they no longer had the credentials to get into our system and they called to ask for the information.  \n>  \n>I let them know that I would be happy to do that when I come up there to get my check for commission. I did not hear anything the next day and then I get a call that my commission check is in the office. I went up there, grabbed the biggest commission check I had ever made and gave them the credentials. Never tell someone business as usual when you do not intent on things being business as usual.",
            "***Paragraphs lol***",
            "Dude please paragraphs",
            "Take the check. Explain to them that they have broken the employer-employee trust and that you will need to confirm that your earnings have cleared in your bank account before discussing your employment.\n\nAfter you have your money, have a discussion about your compensation. At this point you are not negotiating for extra compensation. You are there to confirm that you will continue to be compensated as you were previously.\n\nIf they do not confirm your current compensation structure, then that is constructive dismissal. At that point you inform them that you will not continue to work for an employer who has unilaterally cut pay. You quit. You are no longer employed by them. And then you walk out the door.",
            "Never piss off IT, good MC as a fellow IT guy.",
            "Should have wiped the system before you left IMO",
            "> Fast forward to the next week when they realized they no longer had the credentials to get into our system and they called to ask for the information. I let them know that I would be happy to do that when I come up there to get my check for commission. \n\nFor future reference, extortion is a crime.",
            "# Please split up the text. This is a wall of noise!",
            "I would of charged them a consulting fee",
            "[deleted]",
            "The largest change I want to.",
            "Take the check, cash it, then tell them to pound sand.",
            "I had a similar thing happen to me except I'm a plumber and don't have any credentials to hold back.\n\nHad 7 years at a small family business (not my family though), boss retired and sold the company, new boss expects me to work 13 hours a day instead of 8, among other changes after promising nothing would change for me.\nNow on sick leave for a burnout, boss cancels my phone subscription on the first day home! No warning or anything, had to jump through the phone company's hoops to fix it, adding to my stress.\nJust wish I had some way to screw them back the way they screwed me.",
            "I would have reported them to the labor department to get the money owed, never would give them the credentials.",
            "Should have charged a consulting fee on top of it",
            "I would have said to charge them an additional consultation fee for coming in. Something that is charged by half day work at some high hourly rate meaning if you were there for 15 minutes you still charge them for half a day of work.",
            "I tip my hat to you !!!!!!!!!!!!",
            "> Fast forward time and we are still doing our regular jobs when there was an unscheduled meeting thrown at us\n\nYeah, especially if it's top brass or if there are subsequent meetings like this.",
            "You are my hero.",
            "Yah, that is total bs. It’s not fair to expect your employees, who have been used to a certain way of things, to just accept that they are now taking away the  one thing that incentivized people to do their jobs while at the same time lying about the changes. Totally agree with how you handled that, you did a lot of work for the company by the sounds of it and it’s messed up they were trying to rip you off. Totally expected business practice but that doesn’t make it right.",
            "I wouldn't trade that info for the commission check, instead I'd delete as much info from their database as I could and leave them fucked."
        ]
    },
    {
        "post_id": "oyt39l",
        "author": "None",
        "title": "I'm not paid to think. Ok.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/oyt39l/im_not_paid_to_think_ok/",
        "score": 16180,
        "num_comments": 732,
        "created_utc": 1628201371.0,
        "selftext": "Edit 3\nmany thanks for the awards guys they're  much appreciated\n\n\n\n\n\nWhilst working in a job that I'd been doing for 15 years the company brought in a freshly manufactured degree waving manager.\n\nAny problems within the production area I was always called in to troubleshoot for them and get things moving again.\n\nMr Fuckwittery the new manager asked me what I was doing one day and I told him that I was just thinking how to resolve a recurring issue in production.\n\nHis response was we don't pay you to think get back to your own job.\n\nOk Mr Fuckwittery on my way.\n\nCue MC.\n\n\nTwo hours later I get a call from the production supervisor asking for help as line six was down again.\nSorry Steve call the Mr Fuckwittery he's in charge and apparently I'm not paid to think.\n\nTannoy goes calling me to the office.\n\nMr Fuckwittery is a rare shade of red with anger.\n\nInforms me that I need to go sort out the issue in production. Sorry sir I can't do that as I don't get paid to think and leave his office.\n\nSmiling all the way back to my department.\n\nLine in production is shut down for two whole shifts with people standing around scratching their heads.\n\nMD comes to visit the next day and wants to know why the line is off.\nMaintenance guy tells him he can't understand why it won't work properly. MD says has Tom had a look for you.\n\nMaintenance guy says Tom won't come over because apparently he's not payed to think.\n\nMD says who the hell said that to him?\n\nMaintenance guy tells him Mr Fuckwittery told him that when he had just helped us out the other day.\n\nMD calls Mr Fuckwittery to the line and tells him that I'd been with the company since he founded it and I know more about this production facility than the people who designed it. And wtf are you doing telling long term staff that they're not paid to think.\n\nMD calls me to ask if I can help out as a favour to him. I Came across  and spent five minutes realigning a couple of sensors and the line was restarted. \n\nMD takes me to lunch offers me an extra 150 a week and tells me that the only person I answer to in future is him and him only.\n\nTo this day that manager still scowls whenever I see him around.\n\n\n\n\nEdit apologies for being long-winded and any grammatical or spelling errors.\nBut tbh I don't care.\n\nEdit part two. For the people who don't know what a managing director is.(MD)",
        "permalink": "/r/MaliciousCompliance/comments/oyt39l/im_not_paid_to_think_ok/",
        "comments": [
            "> To this day that manager still scowls whenever I see him around.\n\nBy what miracle does he still work for your company?  I was expecting the owner to fire him within fifteen minutes of your story ending.",
            ">Mr Fuckwittery is a rare shade of red with anger.\n\n\nA *rare shade* fucking got me good hahahaha",
            "Now you do get paid to think.",
            "My co-worker's husband is an SGT in the National Guard (E5) she was telling me that he has some new staff in his area and he is supposed to train them. No problem. Well, one of the newbies is the daughter of an E7, and she went and cried to daddy when she was told to do something. Daddy comes over and says \"SGT, my daughter said you told her to do something\" he looked at him, and replied \"Yes I did\" daddy just looked at his daughter and then said, 'OK' and left! Daddy is the same rank as the other, just a higher paygrade, so he had no authority at all in this situation.",
            ">Edit apologies for being long-winded and any grammatical or spelling errors. But tbh I don't care.\n\nnor should you - great story!\n\nI love seeing these shiny arsed degree waving twerps get their comeuppance :)\n\ndisclosure - I have a degree (Information Systems :) but there is no way I would wander into any new environment and immediately start pissing on a smoothly working system! Now, if it were \"broken\" and I was being asked to 'fix it', I would start by asking around. Not telling people they're 'not paid to think'.\n\nWho the hell knows the place better than those on the frontline‽ And who has the better ideas on how to fix it, and in the process make *their* job easier?",
            "As a recent retiree, this gives me a massive grin! Never cross the old dudes who have knowledge of the old ways!",
            "Has the line \"you are not paid to think\" ever not backfired?",
            "This is just beautiful. \n\nThank you for sharing",
            "I love new graduates coming in swinging their qualifications round. My colleagues always sit back and wait for the fireworks. \n\nI'm one of the older folks in the company but I also have a second job I've had for even longer. My employer is a large IT company and we get quite a few bright sparks coming out of University and they generally think they know it all. The usual conversation goes along the lines of me pointing out something that the new employee might have missed in their code or where they might not be trapping errors in the way they think they are. \n\nThe good ones will ask for an explanation, but there will always be the odd one who comes out with \"OK Boomer, I just graduated with a great degree and I studied this stuff at university really recently, we moved on from punch cards you know\".\n\nThese ones I will give plenty rope to hang themselves. I know they are going to come out with one of three or four papers to prove how much they know about our specific technology. That's usually when I drop into the conversation, that I actually teach the subject in a University as a senior lecturer; that's my second job. I also point to the author list for the papers they are citing and the fact my name is on that paper. That's the point I sit down and REALLY dig down into how much they understand. \n\nGoing to play the big bright graduate? Better have brought your A game.",
            "Can I please come work with your MD?\n\n  \nTho shame it took such a disaster for him to realise he was underpaying you $150 a week...",
            "Extra 150 a week? That's crazy. Your malicious compliance really paid off, literally.",
            "Nice. Gotta love the babies who think their pieces of paper mean more than actual years and years and years of experience. MC towards them is my favourite kind.",
            "Well played, sir. Well played.",
            "Weird how the MD's never make the manager's apologize, opting to let the issue fester below the surface for years. Really unhealthy.",
            "This reminds me of an old Canadian saying: \"keep your dick in a vice.\" 🇨🇦",
            "I was told this once a couple years ago by a washed up consultant who couldn't cut anything more than lines on the rig so he got a gig in completions.  Been working in plumbing and fitting for 20 years, but I'm the idiot for saying to shut in the well and vac out the line to the separator, isolate, and then vac the line to the tanks.\n\nNope, buddy knows best, starts draining the line by cracking open a union, 1 5gal pail at a time and manually dumping them into a 100gal holding tank, not figuring in fluid compression + distance making for about 650gal of fluid in the lines and shack.\n\nHe then figures he needs positive airflow into the line to get faster flow and has us pull a plug... yup, line still had plenty of back pressure and now there's a cube of oil across the snow and the shack, and my crew.  This is of course my fault as we aren't paid to think, but now he needs that vac truck out for cleanup.\n\nThe kicker, he \"designed\" the piping rack and failed to install any drain points and controls, which are a regulatory standard, could've solved all these issues, but he told the other crew that did the initial install the same thing.",
            "Something similar happened at where my dad worked. The place installed a new bottling machine, and scrapped the old one. One of the crew told the recently hired manager that that they had to go through a checklist to make sure everything was done properly. Manager tells him this is going to the scrap yard, anything in there is trash, quit wasting time. guys sure, has the manager sign off on the shipment and sends it away.\n\n Two days later, someone from the NRC (Nuclear Regulatory Commission) stops buy to collect the radioactive pellet from the bottler (it's used to check the fill, IIRC). Nobody can find it. Plant manager pulls up the invoice, call the snotty manager and asked what happened to the pellet. Manager, of course has no idea, says he thought it was all trashed, didn't know he had to remove anything. Rail car already took the scrap away. NRC man says \"find it, now\"\n\n Company ends up hiring several work crews to look through the scrap yard trying to find this pellet, plus paying off the yard for the down time while looking for it. Took two weeks before they located the machine. Company was fined a substantial amount for violating safe handling procedures, and manager was fired.",
            "This was beautiful fucking and a raise that’s poetic",
            "I absolutely love this. I’m a chemist for a large company and it amazes me how many times engineers don’t know enough to listen to operators.",
            "I can't imagine ever saying that to an employee, even if I hated them. WTF",
            "New leaders out of college fall into two categories:\n\n1) the humble and willing to learn from those who have been around\n\n2) the self entitled prick who thinks that their degree means that they know everything and that their word is absolute \n\nDon’t be #2",
            "I used to work in a depot level repair place.  So rarely did we have \"fix it now issues\", but what we did have was \"WTF is wrong with it\" type issues.  \n\n\nMy boss knew that if I was sitting at my bench, with a opened piece of equipment and tech manuals all around me, and me just staring at the box.  Sometimes looking half asleep.   He knew I was actually deep in thought, tracing every circuit in that damned box.   Eventually I'd move to make a fix and 75% of the time, it was the right one.",
            "Proud of you bud",
            "You mean Mr. Fuckwittery is still there?  He wasn't embarassed enough to get the message and leave?  Might be time to start tightening the screws:  \n\n\n\"Listen, Mr. F, I know we got off on the wrong wavelengths, but that should be past by now.  If you can't stop getting butthurt every time you see me, maybe you should consider some other professional behaviors and how you relate to other people.   Capish? If you don't capish, I suggest some serious personal introspection.\"",
            ">Edit apologies for being long-winded and any grammatical or spelling errors. But tbh I don't care.\n\nGreat story, and I put extra love into my upvote for “tbh I don’t care.”",
            "> To this day that manager still scowls whenever I see him around.\n\nMD sounds like he doesn’t have a backbone if Mr Fuckwittery is still around.",
            "[deleted]",
            "People quit bad managers, not bad jobs. You have a great manager.",
            "Who is Tannoy?",
            "Well done. Simply well done.",
            "Mr. Fuckwittery is my new favorite name for idiot sups",
            ">\tEdit apologies for being long-winded and any grammatical or spelling errors. But tbh I don't care.\n\nI guess you aren’t paid for that either! \n\n/s by the way - great story!",
            "As a someone in managerial position, it immensely lessened up my workload if my subordinates know what to do on their own, instead of I have to tell them what to do.\n\nMy position and ego will not at stake if I accept feasible and practical suggestions from them. It will make me look as a reasonable and understanding manager instead.",
            "I have  been employed by the same employer for many years, so I have seen more than my fair share of Mr Fuckwitterys coming and going. I love when they treat the old-hands with disrespect and then fall flat on their face as a result.",
            "If you've been in there 15 years I'm legit surprised you're not in management at this point.",
            "[deleted]",
            "Who's MD?",
            "Absolutely love it!  Nice MC",
            "This is not long winded at all. And its super satisfying 👌",
            "Why was this removed?",
            "So um what does MD stand for/mean, who is that? Should have spelled it out.\n\nOk ok ok! I know! You don’t get paid to think! 😅\n\nEdit: nice try putting that edit after and trying to pretend it was there before but you still missed my joke’s subtext that it’s against sub rules\n\nEdit 2: there’s also another non-insulting meaning to the joke , I’d like to see someone guess it",
            "Enjoyed the story but the edit gets my award! NOONE CARES! Applause",
            "What is \"MD\"? Do you have a Doctor running your factory?",
            "It would be nice if you didn’t use short hand for phrases nobody but you knows. The fuck is an MD?",
            "Why is the edit not fixed to be in the beginning of the story?",
            "Love love love this, this is one of my favorite subs to read after work",
            "Great story and I think it was the perfect length. Some stories drag on forever and aren't interesting.",
            "People like Mr. Fuckwittery are deeply, deeply insecure, and that alone explains most of their behaviors.",
            "LOL.  This one was pure joy to read. I've always hated that \"not paid to think\" line. Of course I am, as is everyone there.",
            "You are my hero.",
            "And who is coming into any workplace and telling anyone that they're not paid to think? Bitch, you don't know, I might be. I don't know what he expected.",
            "I had a middle level manager that started hassling me (tech with serious experience) about in by 9 out by 5. Gott bad enough that I told the executives that I am going on vacation right now and that they could tell me if I still had the job when I got back. Result was that the only conversations that he was allowed to have with me was identifying priority issues.",
            "I'm glad it was long, i don't think a shorter version of this story would be sufficient is delivering the glory that is artistically portrayed",
            "Who is Tannoy?",
            "[deleted]",
            "I hate when company’s try to hire a “manager” from outside",
            "Damn you click on it only for it to have been removed.",
            "Do they not teach these managers how to actually lead a team? There are so many stories of them knowing nothing about the industry they're in, going on power trips and shit, surely they should explain to them how they should conduct themselves? Even if the big boss came in and reprimanded the guy, how was he allowed to be like that in the first place?",
            "What did Mrfuckwhittery have to say when the owner asked ‘who told him not to think?’",
            "Karma is so beautiful :)",
            "That's a dude who isn't going to last.\n\nIf there's one thing getting a degree taught me, it's that having more people think about a problem very, very rarely makes it worse. If he couldn't get that through his head after four years, he might never get it.\n\nContrary to popular belief, stupid is fixable, but he might be a lost cause all the same.",
            "Why not just fire a manager like that. Managers job is to manage and enable the resources available to him to perform their best, not degrade and shit on them. He just completely fucked up his reason to be there, so why keep him.",
            "That’s a win in my books baby boy.",
            "Did you comment on an ask reddit post recently?? I feel like I've read your story in a comment and am so happy to have more info haha",
            "I was not a manager but I knew to ask the guys who knew about the issue at hand.  No college degree is going to teach a person like Mr Fuckwittery the details and nuances of the line.  One of the major failings of managers is that they don't understand that \"management\" is really about managing people - their degree and titles mean little at a certain point.",
            "Someone told me the company they worked for got bought by a larger company. The new company asked everybody to write a job description, and based an said description they decided who to let go. For instance they let the storeman go they don't need 2 of those. Meanwhile this storeman was the only person in the old company that knew exactly how many and witch components went into each product the company made.\n\nNow they had people going through years of paper trails (was before computers) to figure out what changes was made to which products to figure out exactly what went into each product.",
            "You deserve a lot more than $150 a week more",
            "Fabulous!",
            "\"Mr Fuckwittery\" - i think we all have one at work, now i have a fantastic name for him. Thank you.",
            "\"You aren't paid to think\" is something people who don't know how to think tell employees. That's a profoundly dated, industrial age, crap thought-process.\n\nAny manager worth their salt should spend serious time listening to veteran staff to adapt to their team and determine how best to help.",
            ">Edit apologies for being long-winded and any grammatical or spelling errors. But tbh ~~I don't care.~~ I'm not paid to think.",
            "If those machines have some kind of HMI or panel you might want to think about adding some sensor alarms to it to help with troubleshooting.  It's something I've learned to add to all the machines I build.\n\nSay you've got some cylinder that takes 15 seconds to move from one end of travel to the other, at which point it turns on a cylinder.\n\nAdd a few lines of code that say \"If the cylinder has been moving that way for 29 seconds and the sensor isn't on, display an error on the panel.\"  And a second set for if the sensor in the end it started at doesn't turn off.\n\nIt really speeds up maintenance if the machine tells them where to look at first.",
            "Don’t worry about the grammar and spelling, you aren’t paid to think after all.",
            "\"Tannoy\" is an overhead paging system.",
            "Why is the manager (LOVE THE NAME!!) Mr. Fuckwittery still there?!?",
            "That wasn't long winded, it was short and to the point. I wish more stories were this concise.",
            "Were you just pulling new names and acronyms out of a hat as you went?",
            "Sounds like a fantasy from someone born in the 30s.",
            "This made me happy. Good for you!",
            "I really entertaining and warm story 🥰",
            "Thank you for this line: “But tbh I don’t care.”",
            "Mmmm yes that's delicious.",
            "Yes... experience trumps fuckwittery. Checkmate!",
            "This is so satisfying I'm reading it twice and then saving it to read again later.",
            "I would twist that knife as often as I possibly could.",
            "Great outcome and congrats on the promotion!",
            "Why is Mr. Fuckwittery still working there? Can't imagine it's worth paying his salary.",
            "Good story but shouldn’t your company and MD think to train other people to fix these issues for the inevitable day you are no longer there?",
            "I'm going to have to steal the name \"Mr. Fuckwittery\" and use it for a character in a story. It's a beautifully lyrical, almost believable surname",
            "I am happy it worked out for you. I dealt with this at my previous employer.\nKey term: “previous employer.”",
            "Wow. A higher up who recognizes the value of an employee and compensates him as such to keep him around and happy. What a novelty.",
            "That's a big dick story right there.",
            "I thought I saw you in the Ask Reddit thread because I remembered reading [this comment](https://www.reddit.com/r/AskReddit/comments/oyn6hy/what_made_you_quit_a_job_on_the_spot/h7uoio3/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) but it turns out that wasn’t you, but you also did comment on that same ask Reddit thread with the story about the other job you quit. I just had such a weird experience figuring all that out, and we live in a computer simulation",
            "OP You've listed yours and anothers name in this post if you want to change it.",
            "Why dont you get fuckwitty job?",
            "good job sir.",
            "It's astounding that your maintenance crews over 2 shifts couldn't figure out the problem.",
            "Last time a manager had my back they went and had to retire at 47. I miss that job but not the people that took over.",
            "Yesssss I wish I had this level of brass balls sometimes",
            "Loved the part about that manager still being mad about it",
            "[removed]\n\n👀",
            "I liked this one. Well written.",
            "That's the good and the sad part about being for a company for a long time. You stop giving a fuck. I am now at that point in my company. I need to leave.\n\n\nAt least your boss cherishes what he has",
            "Absolutely loved this story, thank you <3",
            "This is awesome! Love it when people like that are put in their place, sooner or later! \n\nHopefully though he's learnt a lesson in being human!",
            "Good for you. Fuck that guy.",
            "Were you not eligible for promotion?  Why would the boss expect you to answer to a brand new employee if you were there since day 1?",
            "Long -winded? \nHell, I wanted more stories of fuckwittery. I know he had to be good for several more.",
            "Best post I’ve read in a while!!",
            "Ouch, a line down for two whole shifts can get expensive!!! Good on you for sticking to it though. It's good having a higher up supporting you.",
            "Hehehehehehhehehe gotem",
            "That's awesome. I love it.",
            "I love the name you gave him, \"MR. Fuckwittery\".\n\nWhy is it that these newly minted college grads think they know better than a 10, 15, 20 yr vet of the biz?",
            "Username checks out.",
            "“I get paid from the neck down.” Is what I tell people.",
            "Iove these stories. Especially when the trouble shooters are without degrees or any formal training. Companies need to realise that these folks are special and to be kept at all costs. \n\nThis doesn't specifically need to apply to OP since I don't know his degrees or training.",
            "10/10 \"Riveting\"",
            "That a great humble pie to that guy.",
            "God i love stories like this.  You handled it perfectly",
            "That was a favourite line of a M.D. of an ice cream manufacturer I formerly worked for.  Was a nasty piece of work and quite frankly the worst employer I'd had the misfortune to work for.",
            "> To this day that manager still scowls whenever I see him around.\n\nWhy a company keeps a manager like this on staff I don't understand.",
            "\"I went to school. I know more than you! Here's my degree!\"\n\n\"Good. Use that degree and solve this problem.\"\n\n\"It's not in the book!\"\n\n\"You don't say?\"",
            "You rock!!!",
            "You have a very cool name, my fellow Tom",
            "God I’d be so petty. If I’m walking by and he’s just scowling/giving mad side eye I’d just have the biggest most sincere grin I could muster and just wave cheerily! 😂😂",
            "U absolute Are Sole.",
            "You had a line idle for at least 16 hours over a sensor alignment issue that you were able to diagnose in 5 minutes? Your organization has a lot more problems than Mr. Fuckwittery.",
            "If that maintenance man couldnt realign some sensors, what the hell is he doing there",
            "You should’ve asked your pay to be higher than his. And for him to be fired right in front of everyone.",
            "Yeah I’m sure boss man was super understanding if you knowing how to fix it and not doing so for 2 days to spite the person who told you to fix it. 2 days of lost production and he just asks you to do it as a favour and moves on. \n\nCool story bro."
        ]
    },
    {
        "post_id": "latb3v",
        "author": "--Morgoth--",
        "title": "Force me to to take my vacation time when I dont want to, and tell me to secure my station by freshening up my passwords before I go? Okay boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/latb3v/force_me_to_to_take_my_vacation_time_when_i_dont/",
        "score": 16191,
        "num_comments": 505,
        "created_utc": 1612264414.0,
        "selftext": "To start with, my boss had his moments. Sometimes he was a dick who would push off me on my raises or screw with my system, sometimes he would hook me up and make my life pleasant. This was not one of the latter. \n\nSo, I had plans for vacation, but my boss decided I had to take my vacation time in  June instead of August because HE wanted to take his vacation in August and no other time would work. I lost some money as a result, but thats my fault for planning ahead I guess. \n\nWell. Ill start by saying...my position was vital, and being gone for 2 weeks, with nobody able to access my terminal, was not ideal for the business. \n\nAfter forcing me to take my vacation early, and losing a chunk of my deposits, He told me to change my passwords before I go for security reasons. Welp. That is exactly what I did. I didn't leave notes(its a security system. I dont leave passwords laying around.) I didn't leave anything for his part timers to work with. I did PRECISELY as he demanded. And when I go on vacation, my work phone does not ever get turned on. I straight up left it at home. (I told him on the way out the day before, that if he has questions, ask em now. He said \" I know what I'm doing\".)\n\nApparently, while I was gone 2 weeks, his part time techs ruined the server system, destroyed my work terminal, managed to screw up and lose several clients, got my account hardlocked(was easy to fix.) And all around, cost my boss about 100k in damages/profits lost. Most of these part timer techs were fired for the amount of property damages they did. For the life of me, I can't figure out how they ruined so much tech while I wasn't around. \n\nI still don't know how he runs a business. But he stopped giving stupid requests like that.\n\nQuick edit: he also, had another master admin account i set up for him. But he lost the information I made for him, on a handy little laminated wallet card. So.....\n\nEdit 2, electric boogaloo: yes the boss still left for his vacation. He did not admit he made a mistake, and things were not fully repaired or fixed when he went on vacation. Also, I booked my vacation with him, and and made my reservations in December. He knew for months.",
        "permalink": "/r/MaliciousCompliance/comments/latb3v/force_me_to_to_take_my_vacation_time_when_i_dont/",
        "comments": [
            "So my question is, did he get to take his August vacation or was he too busy putting out fires and soothing clients?",
            "Boss makes a dollar, I make a dime, that's why we both lose when I'm forced on vacation time.",
            "I've run into the situation where my boss has wanted me to change my vacation plans in the past.  Every time I've offered a choice:\n\n1. I go on vacation as planned\n2. Boss pays for airline, hotel, etc change fees and any difference in prices for everyone involved in my plans.\n\nI've just straight up refused to accept anything other than those two choices - and surprise, surprise - I almost always got to go on vacation exactly as planned.",
            "(it's a security system I don't leave password laying around)\n\nThank you for dismantling that trope found in nearly every video game.",
            "It is like a fucking sitcom.  Except you are the straight man that every main character thinks is useless until you are not there.",
            "I can't imagine being denied leave that's planned out so far ahead. That's some major bullshit.",
            "I hope he enjoys his august vacation he had to have.",
            "> For the life of me, I can't figure out how they ruined so much tech while I wasn't around.\n\nDon't try to figure or it'll cost the life of you.",
            "Apparent this boss has shit for brains.",
            "Had it been me, I would've taken the June vacation, and  immediately started a job search.  With any luck, I would guess a person with your skills could've found a new position elsewhere with a start date after your August vacation.\n\nIt's been about 15 years ago, but I did something very similar.  Only difference was that when I gave notice to company A, they matched and upped the salary offer from company B by 10%, and still let me go on my vacation. \n\nI did stay at Company A for five more years.   Glad I finally left.",
            "[deleted]",
            "\" I still don't know how he runs a business \" accurately describes most business owners...",
            "Going on a vacation with your entire block of vacation days, or having a baby put in you the crosshairs of my old VP.  He know it was illegal, but he found ways to let you go.  He thought you should value you work life over your home life.",
            "omg this is the best story, thanks for cheering me up! forcing you to take a vacation cost him 100K, I love it.",
            "[deleted]",
            "I've always thought Eru Illuvatar was kind of a dick.",
            "When I hear “vital, key or irreplaceable” what I really hear is we can’t afford to promote or move you to a different position so your stuck.",
            "Your boss should've had the company reimburse you for lost money due to him forcing you to change your vacation dates.  Why'd you change the dates without having him agree to do that first?",
            "Please tell me you still do not work for him.  I'm seeing present and past tense in your story, so hoping you still don't work for him.",
            ">Master admin account... lost the info... on a laminated card\n\nYeah, this sounds like hell",
            ">Also, I book my vacation with him, and and made my reservations in December. He knew for months.\n\nNot an MC story, but a few years ago I was making plans for my brother's wedding, which I only needed a Friday off for. I tried requesting it in our system months in advance, it wouldn't let me request anything in August for some reason. I ask my boss, normally August is a blackout date because we're too busy getting classes ready for the fall semester but that hasn't been brought up this year yet. She says it's fine and I'm able to get the request in, and send her an email to cover my ass.\n\nWe're nearing August, and the blackout dates are announced. She emails me, saying she needs to revoke my previously approved vacation day due to this policy (which wasn't in effect when she approved it). I go up to her desk and say, \"The one day I've requested off for August is my brother's wedding, and I'm his best man. I'm going.\" Her reaction was pretty much, 'Oh...nevermind then.'",
            "I remember changing passwords before vacation, then it taking 3 days to remember them.",
            "If you booked your vacation time with him,  he fully well knew and thus you booked things THEN LOST MONEY when he changed... that's on him. \n\nI'd have gone right off at him for costing me money like that. If demand he either cover it,  else I'm going on my holidays AS AGREED ON ALREADY.",
            "I dont ask for time off. its more than 7 days I out I let them know I'm not going to be there. I accrue pto. its mine to use when I want it. you can deny it all you want but I won't be there. I'm lucky to be in a position where I can find another job in no time. not every has that luxury. I would encourage people to fight back tho. just like this guy did.",
            "I have a contract gig that REALLY wants me to ACT like a W2 salaried employee, but wants to compensate me like a 1099 contractor. They never commit to any dates because they don't plan ahead and they want to hold the option of changing schedules whenever it benefits them. And they expect you to be free REGARDLESS of when that is to get the project done.\n\n  \n\n\nLike, you don't pay me enough to be my one job (not even close), so don't act like I can just run around and come in whenever you need lmao. It's really disappointing how inflexible they are with scheduling. Sorry rant over",
            "100k dollars damn dude",
            "If he knew about your vaccacion plans and had sanctioned them before, in most countries he would have been responsible to pay any damages resulting from moving your vaccacion slot. Also, if his only reason for this dick move was his own vaccacion he'd have a hard time enforcing that (there are legitimate reasons, but only related to the company itself).",
            "When I last asked for vacation time I was told no, that time was a major upgrade period and they needed all hands on deck, as such I was told to take it earlier (3 weeks or so earlier, nothing too major).   \nWe didn't have anything booked yet so we told the travel agent about the date change. The agent in her mastery ended up saving us something like 15% off most of the holiday AND we avoided a major typhoon that would have hit us had we gone on our original date.  \nBest part is when I got back, all the upgrades were done early as we were ahead of schedule, so it was a nice ease back into the work rhythm.",
            "Pretty sure I would have told him to go get fucked. UNLESS he was willing to pay for all the cancellation costs, as it was approved. What's he gonna do? Fire you? Then you have some serious chops for a wrongful termination lawsuit as it was preapproved time off.",
            "The idea of shared admin passwords scares me senseless. I applaud your revenge but I highly recommend trying to figure out how to avoid shared admin credentials (accountability issue) and where this cannot be avoided strong random passwords stored in something like keepass using both a password AND a keyfile is the way to go. Obviously don't store the keyfile with the keepass database. \n\nPoint is no one should ever log in as you. Where shared credentials are required - there should be audit controls that can determine who is using them. Cyber security is serious even in a closed environment. Stay safe out there friend.",
            "Okay this made me physically contort.",
            "Should have asked for a raise when you returned.",
            ">Also, I book my vacation with him, and and made my reservations in December. He knew for months.\n\nHow the fuck is that even legal to deny them to you then, damn",
            "I have been a manager for many many years and I always permit my employees to have 1st choice of holidays and vacation schedules. I have worked through many christmases and New Year's as a result but it's fine as my employees get to be able to take to off time they need when they need it",
            "If he had a backup created with the info printed, why not put it in company safe and fetch it if needed? Figure it is easier to lose the wallet than a safe. Just assuming he has an office safe or even a lock on his desk drawer.",
            "There isn't a job worth being the punching bag for someone else. \n\nThe moment he told you to move your vacation you should have laughed and told him to cough up the deposit money.",
            "Did he know of your vacation before he made his decision? Most places go off seniority for picking priority and picking is done beginning of the year. Sounds like some shit a garbage boss doss. Piss poor time management skills.",
            "If he denies previously approved vacation time, in my country (where they can do that, but only for serious business reasons) he is literally on the hook for damages like lost deposits. Might want to check whether that is the case in your state and if it’s still within the statute of limitations.",
            "hmmmm my question is, let's say you took your vacation without having to change anything travel plans wise, would the situation be the same? did the malicious compliance happen by leaving your work phone behind? or do they normally have the password that you eventually changed by the boss request",
            "Human resource bitches be making me take vacation days!",
            "Upvoting because the Breakin' reference is top notch.",
            "owner's son, \"dad, these guys are out of control and broke everything!\"\n\ndad, \"fire them all!\"\n\nOP returns from vaca, \"WTF!\"",
            "I'm pretty sure the boss is liable for the lost deposits depending on if he changed his mind on ur vacation date or whatnot.",
            "There needs to be some type of tests before someone should be allowed to have employees (depending on industry, context is critical). Like, interviews with psychologists and social workers, to help weed out bad actors, or mitigate some of the damage people with personality traits that are obviously affecting their functioning could do. Get them into therapy, an art program, an MLM (NO) . Somewhere not where the extremely technical, cutting edge technology is please!",
            "Is your boss also the owner? If not it is a wonder he did not face more consequences for costing the company all that money, unless he could blame it on you, of course.\n\nSo glad you left your phone at home!\n\nToo many of these stories start with, \"so my boss called me on Christmas....\"\n\nLike, dude, if I am not on the clock my phone is turned OFF. The end.",
            "I wish I can go on vacation and leave my work phone behind. I went on a vacay once with my boss (we're close) and he left his Blackberry at the hotel's reception desk. I get too stressed knowing that emails are piling up but after what my boss did I try not to worry about work too much when I'm on holiday",
            "Huni: If i didn't go to culinary school",
            "Did you work for Michael Scott?",
            "Make sure to send him a bill for the deposits lost.",
            "Gonna need more details of the damage caused because I dont get it as it stands.",
            "In normal circumstances securing passwords is good practice, buuut...\n\nYour boss doesn't sound competent enough to handle that level of inconvenience.",
            "Why use many letter when few do trick",
            "Why on earth would they need access to your terminal. \n\nWhy are you printing out master admin creds on laminated wallet cards instead of using password managers.\n\nThere is so much wrong with this set up.",
            "Electric boogaloo...\n\nI've heard that somewhere...\n\nIf anyone knows where it's from, please tell.",
            "I wouldn’t be just taken my planned vacation and told him to fuck off. People that just roll over and take this shit blow my mind.",
            "You submitted your vacation dates in writing, got his signature -- and months later he told you that you can't have August??",
            "Perhaps some non-lawyer lawyers can explain this to me, but how are you not exposing yourself to damages if your boss chose to go after you? You knowingly (though temporarily) locked down a security system and didn’t give your employer the ability to access its controls.\n\nThat reads as sabotage to me. What am I missing?\n\nEdit: This is an honest question free of intended judgement. Your boss sounds like a pill who deserves to be knocked down a peg, I’m just curious about the legality of your actions.",
            "This doesn’t seem too malicious lol, your boss is just a dick",
            "So you are basically saying your company has shit security/account practices and uses a USERS INDIVIDUAL ACCOUNTS to access things?\n\nAlso you created/laminated a \"master account\" for said application that most likely has a non-expiring password and he lost it?\n\nYeah, you all should be fired.",
            "You guys should look into something like Lastpass that way everyone has access to the passwords for accounts while your gone",
            "I don't like the stories that gets 3rd parties fired",
            "[deleted]",
            "Okay, that’s good murderers.",
            "He gets shit on a news station 😂",
            "I think episode 7 is my favorite rapper ⛷",
            "Okay okay... what if we taxed wealth?",
            "this one is quite malicious. You really screwed your boss over, all because you didnt like being denied a vacation request.",
            "Yeah great story the temps got fired hahaha so funny. Also no you weren't punished for planning ahead. Awning ahead would have been you making sure you had your leave accepted before booking anything. Next time try to apply for your leave early.",
            "Okay I’m hearing it",
            "Sounds like you deserve a big raise",
            "Omg this is sweet",
            "I feel like there must be a Bible quote here, but I can’t think of it. This feels like a consequence of biblical proportions.",
            "Talk about coming back to a proverbial fire, holy Sh\\*&!",
            "Even though it sounds like fun, I hope you learnt never to book anything until your holiday has been approved in writing...",
            "Sounds like shitty planning if only one guy in the entire place had access. RBAC people.",
            "This shit is why we need unions",
            "Sounds like something my old BizMacs boss would do. That guy was a prick beyond belief.",
            "The ability not to be surprised by Crit-Fails.",
            "Okay, first of his name)",
            "So what you’re triggering my Chemistry PTSD"
        ]
    },
    {
        "post_id": "g19n4h",
        "author": "xgnexistence",
        "title": "My boss wanted me to train my replacement but i didnt work there anymore",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/g19n4h/my_boss_wanted_me_to_train_my_replacement_but_i/",
        "score": 16169,
        "num_comments": 749,
        "created_utc": 1586884655.0,
        "selftext": "Hey reddit! Not 100% sure this counts but i want to share my story\n\nI used to work in a Grocery store back in 2016, I was 16-17 at the time, (I don't work retail anymore) but i wanted to share this story i still remember to this day.\n\nIt was a pretty normal night right before the end of my shift (I was one of the few closers at my store) so it was just me, my supervisor, and a cashier (i worked the self checkout/customer service desk). My supervisor had just collected the tills and was in the back counting, and I was starting my rounds to take back the non-perishables that were left at the registers. (i also might add that our store had terrible camera placement, basically it showed all the registers, and the supervisors office door which is where the safe was, this is important later).\n\nAfter putting up all the items that were left at the registers, I did my final checks of the store to make sure there were no misplaced/damaged item on the floor, I find a case of beer that was leaking in our beer/wine section and since i wasn't sure how damaged the bottom of the cardboard case was i had to drag it to the front so i could inform my supervisor about the damaged item before taking it to the back (we kept a cart(s) full of damaged items to be taken out by the morning crew).\n\nSince the supervisors office is locked while they are counting the tills i call over to her and let her know that there was a damaged case of beer and i was taking it to the back. She responds with an absent \"Ok, sounds good.\"\n\nSo I take it to the back place it with the rest of the damaged items, and go back to the front to see if there is anything else my supervisor needs me to do before I clock out, there isn't.\n\nNext couple days are fine as I finish up the week and wait for the next weeks schedule to be posted, and I find out that I'm not scheduled for the next week, I figure there must have been a mistake as there was someone working at the same Grocery store who shared my first name. I go upstairs to my managers office and ask him about the schedule and why I wasn't scheduled.\n\nHe responds with a \"Oh, My bad I forgot to tell you that you are suspended until the investigation is over, by the way can you train \"your replacement\" today on the self checkout/customer service desk?\"\n\nMe confused and annoyed at the moment don't really pay attention to the second part of his comment ask him what he was talking about.\n\nMy Manager: \"We caught you STEALING that case of beer that you took to the back, and until the police investigation is complete you won't be working here anymore. Please turn in your uniform, name tag, and badge.\"\n\nI AM FURIOUS, but I decide that I would just go with bit of MC in this situation. \"Well \"bossman\" I took the DAMAGED case of beer to the back to be thrown out in the morning as per procedure, but since I won't be working here anymore I guess you will just have to find someone else to train \"my replacement\", since I clearly CANT be trusted.\" (I was the only person who could train someone for the Customer service desk other than him)\n\nHis. Jaw. Dropped.\n\nThe look on his face was priceless as I took off my uniform and handed him my name tag, and override card. I then proceeded to walk out get in my car and drive home.\n\nAbout 2 years later I join the army, and I'm going for a job that required a Security Clearance, Guess what shows up? That suspension with an unfinished police report and the tapes from the security camera. I sit there with my interviewer as we watch the tape together clearly showing that I did not steal ANYTHING (needless to say I was approved for my clearance). I ask if I can get a copy of the tape, and my interviewer agrees, it took 2 years but I finally had the evidence I needed to sue for wrongful termination, but as the time is well over the statute of limitation, I am unable to actually do anything about it.\n\nEither way I decide to go pay my old workplace a visit over my Christmas block leave and a couple people recognize me (including my old boss). He tells me that thieves like me aren't welcome in HIS store, and that I need to leave or he would be calling the police, I told him to call them, and that his claim would surely hold up when I showed them the copy of the video footage of me \"stealing\". (the store had one of my favorite muffins and honestly I really wanted one since they are only made there)\n\nThe police got called and did nothing and I got 3 muffins free of charge thanks to my favorite supervisor! WORTH IT!",
        "permalink": "/r/MaliciousCompliance/comments/g19n4h/my_boss_wanted_me_to_train_my_replacement_but_i/",
        "comments": [
            "Something similar happened to me once; I got laid off suddenly along with a lot of the rest of the team. Two days later, I get a call from one of the folks left in the office asking me to train them on one of my tasks. I said sure, since I no longer work for the company, here’s my consulting rate. They were angry over my response, and I lost a friend over it.",
            "They're dumb for suspending you before getting you to train the new guy. So obnoxious.\n\nTell us about these muffins.",
            "The length of that statute of limitations is kind of a head scratcher.",
            "I'm annoyed that the police would bother with theft of a case of beer, I can't get them to figure out who stole my car.",
            "I once worked at a Grocery Store as a cashier, and had an incident where I was suspended pending investigation and it took weeks to figure out what the hell it was all about as I was an incredibly anal, meticulous, careful and hard worker. This happened well over 20 years ago and still is crystal clear in my mind due to the absolute ass-fuckery of it all. \n\nTurns out it was based off a customer complaint and threat to call the liquor board over me \"Taking a bribe to sell to a minor\"... Once I was finally able to get the details and after combing through literally a hundred plus hours of footage I was able to piece together what happened and never even got an apology or support. \n\nScenario as Follows:\n(apparently the busy body bitch that caused all the pain and frustration for me was in line behind this customer)\n\nGuy walks up to the register with 2x 40oz Old E (Malt Liquor)\n\nMe: ID Please?\n\nGuy hands me ID, I check it and show camera over my shoulder, (policy due to sketchy neighborhood) The guy is in his early 30s.\n\nMe: Thank you\n\n(Scans beers and total is $4.xx) \n\nMe: Your total is $4.xx\n\nGuy: How about $1?\n\nMe: Your total is $4.xx\n\nGuy: How about $2?\n\nMe: Sir, your total is $4.xx, if you don't have enough there's nothing I can do.\n\nGuy: Ok, ok, ok.. Here's $5.\n\nI take his money and finish the transaction. And go on about my day annoyed but none the wiser that the next customer in line decided to selectively overhear what was happening and make up their own story about it, the proceed to spend days raising hell demanding I'm fired and brought up on charges, etc over \"taking a bribe to sell alcohol to a minor\". Fuck BBB and all those self entitled meddling \"Karens\" like them.  \n\nI was 19 years old, living as a Caregiver for a T-7 Paraplegic who was my best friend at the time, and working two full time jobs to meet our needs.  We almost lost our apartment due to the loss of income during that time, as well as the pain and frustration the confusion of it all cost me and the most devastating part was the feeling of loss of trust in me as I always worked so hard to be the most dependable, hard working, and over achiever in everything I did that time. It really broke my heart to experience someone being so willing to try and destroy my life over something they \"overheard\".",
            "A customer supposedly lost a wad of cash while in my shop. After calling a dozen times demanding i find it (somehow), he called and complained to management that I probably stole it. While an 'investigation' was ongoing, I was told not to serve that customer and let my supervisor deal with him (there were only two of us in the shop).\n\nFun part came that very day. My supervisor went out to run errands, and the customer came in to buy materials for a job. I told him, sorry, can't sell you anything. He freaked out and complained to management again. Unfortunately, I was following orders. The next three times he came in, I was alone, and he couldn't buy anything.\n\nManagement finally declared the 'investigation' closed. The was no investigation, really, they just wanted the customer to think they were doing something. In the end, his baseless accusation just bit him in the ass.\n\nKinda wish I had found the money now.",
            "I’m confused, why did they think you stole the beer? Wasn’t it sitting in the back room? And the tape was clear enough for you to get your security clearance....",
            "So neither the store nor the police ever watched the video? Crazy!",
            "OP’s old boss just rendered the statute of limitations moot when he renewed his slander against OP’s good name. Further, if he actually put those accusations in writing, when the video evidence clearly exonerates  OP, then he is guilty of libel as well.",
            "Although you're SOL with the wrongful termination, if he called you a thief in front of witnesses (and called the police in), you're probably good with a defamation lawsuit.",
            ">the supervisors office door which is where the safe was, this is important later\n\nWas it? Where was the safe in the story?",
            "I was working at a coffee shop. Little boutique place with handcrafted drinks and the whole bit. I was having fun with it and thanks to years of other customer service work, I found it really easy. \n\nSo one day, I was given a promotion to shift supervisor. I was super pumped and felt like a million bucks. The next day would be my first training shift to learn the opening procedures. Great!\n\nCame in the next day, got the safe code, learned the cash in stuff, etc. All was going really well. We had a minor incident mid- morning where someone accidentally dumped a full coffee on the debit terminal and fried it. No biggie. Ended the day on a great note. \n\nNext day I'm in for a lunch shift. All is fine, and I'm making the sandwiches for next day. The store manager comes by and says, \"Hey, just so you know, there was $300 missing from cash out yesterday. The owners are putting your promotion on hold until it's sorted out.\"\n\nWell, that was both infuriating and humiliating. I knew I hadn't done anything wrong, and spent the last hour of my shift on the verge of angry tears. I mean, there I was, 32 years old. Homeowner, been working since I was 16 without any issues, and being accused of stealing a pittance on my first day as supervisor. Because apparently I'm not only a thief, I'm stupid too. Risking my job and reputation for next to nothing. \n\nCame in the next shift a couple days later, and am told, \"Oh yeah, by the way, we found the money. No one had been able to reconcile the fried debit terminal, but the bank sorted it today and the total matched the missing money.\"\n\nShe was so excited, but weirdly didn't like when I flipped out and yelled, \"You didn't even confirm that it was missing *cash*?! You just leapt to the worst, most insulting conclusion?!\"\n\nI stormed out and went back to the corporate world. Which sucks because I loved working there. But there's no way I could've reconciled working for such absolute morons.",
            "If you were suspended for a week how were you wrongfully terminated? It sounds like you got suspended for a week and then quit.",
            "[removed]",
            "I was dumb and gave my sup 6 months notice. They were furious because how dare I *tell* them what I am doing, they tell *me* what I'm doing. It was a weird sense of a power trip. Essentially I wasn't happy in my position and requested a transfer because I did not plan on staying on in my current role for another winter season. My sudden loss would hurt the people left behind and I did not want to abandon them. After no further news 3 months later there had been no further discussion I grew concerned they weren't preparing for my departure. Once again I broached the subject and even offered to train a replacement. Again I was met with distain and told I wasn't management and I don't get to decide how to run things. Basically \"know your your place\" transfer denied.\n\nAfter that I kept my head down, did my job and left it alone. And then near the time I said I would I stopped coming in, talked to HR and said I was leaving, turned in my ID badge and that was it. No exit interview or anything. Later heard it took them nearly 4 months to find a replacement.",
            "Red velvet \"muffins\" with crème cheese frosting?  Those aren't muffins.  You are describing fucking CUPCAKES!!!",
            "Similar happened to my friend but with no satisfying ending. She worked for a popular cinema in the UK and was working the til. A manager asks her to move to the til next to her so he can go on hers. She thinks nothing of it.\n\nThe next day she’s called into the bosses office to say she’s fired for stealing £80. He even showed her the security footage, it was her grabbing a receipt and throwing it on the floor because A) the customer didn’t want it and B) they were too busy for her to throw it in the bin at that moment. \n\nBut apparently that was her stealing the money. \n\nShe realised the manager who took over her til didn’t sign her out and they were down £80 on *that* til. She got to angry she stormed out and hasn’t been back since (obviously).",
            "[removed]",
            "They kept tapes for 3 years over a case of beer?  Slow work days on thar police force.",
            "[deleted]",
            "Something to know: You dont need to have the evidence in hand before you sue. Part of the lawsuit process is getting the evidence from them. It's called Discovery. Also you can make the claim that you were never terminated since he said you were merely auspended until the police investigation was complete. The police never completed it so you were still just suspended 2+  years later.",
            "And they had a copy of the VHS tape?\nWtf",
            "[removed]",
            "Please don't question the validity of the submission. Thanks.",
            ">it took 2 years but I finally had the evidence I needed to sue for wrongful termination, but as the time is well over the statute of limitation, I am unable to actually do anything about it.\n\nAssuming you live in the U.S. That's not really how it works. 49 out of 50 states are at will employment. Meaning you can be fired at any time for any reason. Unless it's discrimination and you belong to a protected class. Which doesn't seem to be the case here.\n\nI enjoyed the story regardless. Thank you for sharing.",
            "I once ran a hospital department's waiting list as a temp. I enjoyed it so applied for the job when it was advertised.\n\nI didn't get the job because I didn't have enough experience. I wasn't even shortlisted.\n\nA couple of weeks later they introduced me to the new person and told me I needed to train them up. I laughed, told them I didn't have enough experience and went home.",
            "You would have been laughed out of Court, they suspended you pending an investigation, you quit",
            "He called you a \"thief\", and knew, or should have known that to be false. Which sounds like slander/libel. Doubtful you can find a lawyer to take the case, but you could sue him for that.",
            "How’s this malicious compliance? Nothing malicious and no compliance in the story- which reads like a made up one.",
            "How were the police involved but never contacted you?",
            "I have had the opportunity to \"train the replacement\" before. \n\nI tried them as requested. Maybe didn't train them right, but I did train them.",
            "Sounds like a Publix thing. I remember working as a CSTL and this sounds like routine work. It's why me and my sister quit the job",
            "You should send the tape to corporate if they have such a thing or owner. A manager like that shouldn't be a manager. Statue of limitations might have passed but his ass getting fired hasn't.",
            "> The police got called and did nothing and I got 3 muffins free of charge thanks to my favorite supervisor! WORTH IT!\n\nMan I woulda been scared as hell to accept those muffins. Knowing them, they'd call the police and say you stole them.",
            "Epic!\n\nI got triple-seated in my restaurant section and manager wanted me to run another sections food.  Blew it off.  He came out to the table as I’m taking drink order and asked to talk to me.  Told him If be with him after finishing with my customers.  He was super pissed off.  He closed my section and was going to write me up unless I would stay and roll silverware setups.  Took the write up.",
            "Being put on suspension with a pending investigation isn't abnormal so I don't think the court would do anything as you willingly quit",
            "for everyone wanting a recipe here you go\n\n Ingredients \n\n2 large eggs, room temperature and separated \n\n1 and 1/3 cups (160g) all-purpose flour\\* (spoon & leveled) \n\n1/4 cup (32g) cornstarch\\* \n\n1/2 teaspoon baking soda \n\n4 teaspoons (6g) natural unsweetened cocoa powder\n\n 1/4 teaspoon salt \n\n1/4 cup (60g) unsalted butter, softened to room temperature\n\n1 cup (200g) granulated sugar \n\n1/2 cup (120ml) canola or vegetable oil \n\n2 teaspoons pure vanilla extract \n\n1/2 teaspoon distilled white vinegar liquid or gel red food coloring\\* \n\n1/2 cup (120ml) buttermilk, room temperature\\* \n\ncream cheese frosting for topping\n\nPreheat oven to 350°F (177°C). Line a 12-count muffin pan with cupcake liners. This recipe makes 14 cupcakes, so you will have 2 cupcakes to bake in a 2nd batch. With a handheld or stand mixer fitted with a whisk attachment, beat 2 egg whites on high speed in a medium bowl until soft peaks form, about 2-3 minutes. See photo at the bottom of this post for a visual. Set aside. Sift the flour and cornstarch together to make sure it is evenly combined. Whisk this, along with baking soda, cocoa powder, and salt together in a medium bowl. Set aside. Using a handheld or stand mixer fitted with a paddle attachment, beat the butter on high speed until smooth and creamy – about 1 minute. Add the sugar and beat on high speed for 2 minutes until creamed together fairly well. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. Add the oil and beat on high for 2 minutes. The butter may look “piece-y” and not completely combine with the oil. This is normal and ok. Add 2 egg yolks and the vanilla. Beat on medium-high speed until combined. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. Beat in the vinegar and the food coloring– until you reach your desired color. I use 2 Tablespoons. With the mixer on low speed, add the dry ingredients in three additions alternating with the buttermilk, beginning and ending with the dry ingredients, and mixing each addition just until incorporated. Do not overmix. Fold whipped egg whites into cupcake batter with a rubber spatula or wooden spoon. The batter will be silky and slightly thick. (If there are still pieces of butter – and there were in 1 test batch for me – again, this is ok. They will melt inside as the cupcakes bake. Making them even more buttery.) Spoon batter into cupcake liners filling 1/2 – 2/3 of the way full. Bake for 20-21 minutes or until the tops of the cupcakes spring back when gently touched and a toothpick inserted in the center comes out clean. Don’t overbake; your cupcakes will dry out. Allow to cool in the pan for 5 minutes, then transfer to a rack to cool completely. Prepare cream cheese frosting. Frost cooled cupcakes immediately before serving. I used a Wilton #12 tip; I don’t recommend a star tip. This frosting is a little too thin.",
            "[removed]",
            "That bored huh OP?",
            "[removed]",
            "I bet your old boss stole the beer and threw you under the bus because he needed to feel like a big man",
            "So at the end you stole 3 muffins >:-O",
            "[removed]",
            "Anyone else find it odd that a store would have the security footage 2 years later? Or even bother give it to the police for it to show up for a background check?\n\n&#x200B;\n\nNot saying it didn't happen. But this is crazy unusual and would probably be good to explain that part.",
            "[removed]",
            "Chances that your manager stole the damaged case and blamed you? 99%",
            "I wasn't caught stealing, but had a workplace want to switch me from salary to hourly because my 50 hour work weeks were not always during the 40 hour scheduled work periods. So I gave them my 2 weeks notice. The very first day after those 2 weeks, they called asking me to \"help\" until they hired my replacement. They paid me 2 1\\2 times my hourly wage for the next month on MY schedule until I got their \"new hire with a degree\" up to speed. It was a FANTASTIC feeling.",
            "If you were ready to sue them for wrongful termination, maybe bring a defamation of character suit? He called you a thief because of that incident, and you have evidence contrary to his assertion. That guy should have a record on his resume, too, imo.",
            "lol why did you get free cupcakes ?",
            "I can't even begin to fathom how a boss would be shocked that somebody would refuse to train somebody after they've been fired.",
            "I managed a bar and developed a whole new cocktail program for this place. \n\nI streamlined everything online for easy access to recipes and builds as well as cleaning schedules and other info. \n\nI got fired for trying to get the daytime manager fired because I caught him stealing and sleeping in the office. That's a whole different story though \n\nAnyways, I walk out of the meeting everyt I got fired and immediately revoke access to all the recipes. Got phone calls for a week asking for it all back. \n\nApparently $1000 for a year's worth of work was too much to ask.",
            "Going off my experience. Maybe they just codify the reference checks then. This was back in 2008, fbi interviewed a couple of my friends. One in person one over the phone. This was for the same mos as Op claims he was in,  but different branch.  They sure as hell did not share any details with me, that’s just silly.",
            "Nice.",
            "So did you learn your lesson?  If you see something broken or leaking, just let it be.  Don't do more than you absolutely have to do, no good deed goes unpunished.  \n\n(joking)",
            "This always amazes me. Sure, the flat out ignorant accusation is messed up but the entire concept of asking someone to \"train their replacement\" makes no sense at all to me. If you had a mild grasp of human nature, you'd see this would be a bad idea at best and a huge insult. The arrogance, the confidence in their power over people to ask them to do the insane just blows me away.\n\nI mean, sure maybe there's a little bit of \"don't burn bridges\" going on here but, I'm sorry, if a boss asked me to do this, I'd consider that bridge already burned down at that point. Am 8 missing something here?",
            "When I was younger, I was working at a family owned camp ground. I was housekeeper for the cabins. A holiday rolled around and it was a huge money maker for the campground. They were short a cashier and they knew I had experience. I had only one rule, no one but me was allowed in my til. The first few hours went by pretty good, the. The owner said that her daughter would be helping me at the desk and the register. I did not like this idea one bit. The daughter, being the owners daughter, started letting her friends run the register as well. I backed out. I didn’t want shit to do with that mess. I told my boss that her daughter was letting her friends run the register and handle the money so I wasn’t doing it anymore. My shift ended and I went home. The next day, when I arrived at work, my boss met me at the door telling me that the register came up short and that I was fired for stealing. I’m dumbfounded. I simply told her “ok, I’ll be here payday for my money, please have it ready”. I go in a few days later to pick up my money and i was short about 100.00. I ask why and she tells me that it’s to replace what I had stolen. I was furious. FURIOUS. I told her that she needed to be asking her damn crack head daughter about the missing money instead of automatically blaming someone that wasn’t a member of her family. I told her I’d be back in a few days for my damn money and it better be there. I go back a few days later and received an envelope with 400.00 in it. She apologized to me for wrongfully during me and blaming me. She said that the days following me being fired, the money kept coming up short and decided to ask her daughter about it. Yes, her daughter broke down and admitted to stealing the money to support hers and her husbands dope problem. My boss asked me to come back to work since her daughter or SIL was no longer employed there. I politely told her no thank you, that I’d rather not work for people like her or her family. She told me to give her the extra 300.00 back that she gave me as a bonus. I told her that I’d be keeping that money as settlement for the pain and suffering she caused me by wrongfully terminating me. I turned around and walked out. Never saw those horrid people again. \n\nThe daughter and SIL both had opiate addictions. I know this for a fact because my second day there, both asked me if I had anything for a headache. I offered some Tylenol but they refused. The daughter told me that they like to “alter their reality” while working then giggled about it. Sad thing is, they had a two year old son they let just run around the camp ground. There were swimming pools but they were fenced in but the huge ass pond wasn’t fenced. Not to mention all the strangers that would come through for overnight stays while traveling. Their altered state could have easily caused their son to drown or to be kidnapped. I didn’t like those people at all.",
            "[removed]",
            "[deleted]",
            "They \"suspended\" you and you immediately quit? Or did they fire you for not training your replacement. Just a nuanced aspect I'm curious about. Per your description, you quit, which would negate any claim of wrongful termination, statute of limitations notwithstanding.",
            "If the police made a report that the supervisor is kicking you out for your previous theft it might open the case back up for litigation. \n\nI’d call a lawyer and ask.",
            "You most likely could have sued when this happened for wrongful termination. I’m pretty sure any lawyer/legal counsel could have requested and obtained to video evidence as well as the official reason for the termination through discovery in a lawsuit. I know this isn’t going to help now but very well could help someone else. I am not a lawyer to be clear and different states etc have different laws that any lawyer the practices this type of law in the occurring state will be familiar with. Always best to consult a lawyer in your state they will tell you if you have a valid case and what your options are.",
            "Grats on the clearance!  That level clearance don't come easy!  And grats on the muffins!  :)",
            "The last few paragraphs aren't the least bit believable.",
            "Your “malicious compliance” is getting fired and not doing anything about it 2 years later? Ok",
            "And then all the grocery store workers and all the shoppers stopped and gave an applause. Fireworks went off and the police arrested your old boss. The end! What a great story!",
            "The moderator has requested I don’t question the validity of the story so I won’t be submitting the comment I intended on submitting initially after reading this story.",
            "[removed]",
            "Always gotta love the naysayers who can't believe or sometimes even follow the plot of anything that does not fit their personal bias and beliefs.  You caught some good ones who clearly have no idea what they are talking about or how things actually work.\n\n(Former holder of a top secret security clearance myself, now medically retired after 17 years service.  I love the \"that's not how it works\" kids lol.)",
            "This makes no sense from his perspective. You're \"stealing\" by leaving the stuff in the store!? What did you walm away with!?",
            "Allow me to introduce you to... people.",
            "I used to work in Chicago, I used to work in a store. \n\nI used to work in Chicago, I don't work there anymore.",
            "Hang conscripts.",
            "TS/SCI? Sounds like 35 series. SIGINT?",
            "My favorite of all time",
            "lol yeah let me hang around and train my replacement!!! haha im dry, can that dude hook me up with whatever he was smoking? lol!!",
            "Hopefully you still got your TS-SCI?",
            "you cant just say you have the tape and not sharing it? especially when there is no ongoing legal processes.",
            "Friday",
            "Gotta ask, what MOS?",
            "[deleted]",
            "i don’t pick up on that.",
            "Is this Publix? Sounds like Publix lol. I used to work there.",
            "Charge for double for training because your time and knowledge makes sense..otherwise move on..",
            "Seriously? This makes me rethink my being \"let go\" from being a \"sandwich artist\" at a certain sandwich shop. Nothing much was done at the time, but when I tried to get a job at another store in town, the manager at that store was EXCITED about the idea of having me work there, and she did a 180 after calling corporate....\n\nIt hasn't prevented me from getting a job in other fields - I'm a licensed professional now, I work insurance....even with it all happening in 2003, and it's not work I've done in the last 5 years before I started my current job... you'd think....huh....",
            "Thaaaaat’s a dark souls boss down there\n\nFTFY",
            "Nice",
            "What an anticlimactic ending.  How disappointing.",
            "That’s pretty screwed up. Lucky for you the security clearance process was good and didn’t just auto reject you. I’d be looking to contact the police and get the record straightened up.",
            "3 muffins? They better be giving you every fucking muffin they have on hand.",
            "Wow, i read all this...",
            "I’d take some walks through that store from time to time if I was in your shoes.",
            "This just petty revenge.",
            "TL;DR: Gets laid off wrongfully, proves innocense years later and gets three 10/10 muffins for free",
            "Can we reevaluate rule 3?",
            "fuckin awesome. hell yeah",
            "One possible reason for firing a key person before a trained replacement is on board is a fear that the training will be flawed on purpose.  Lots of people understand that training someone to do their job is a red flag.  Another reason is that a very responsible and competent can make work look effortless. \n\nManagers sometimes assume the job just doesn’t look that difficult because they don’t see the organizational and knowledge that goes into it. This is most likely in areas where the manager has little knowledge of the job requirements.\n\nThird possibility is someone wanting your job and working to discredit your performance behind the scenes.",
            "I hope your old boss felt like a piece of shit after seeing the tape"
        ]
    },
    {
        "post_id": "r1in64",
        "author": "Sugarman111",
        "title": "Screw her over on probation period? Ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/r1in64/screw_her_over_on_probation_period_ok/",
        "score": 16166,
        "num_comments": 396,
        "created_utc": 1637797844.0,
        "selftext": "Not me, this happened to my sister in law. She's quite a lot younger than me and was working part time in a chain shoe shop whilst studying. After graduating with a business degree, she was offered a job managing one of the shoe stores. This obviously seemed like a fantastic opportunity for her first role as a graduate. She was on a probationary period for three months and after that her salary would increase, although the probationary period could be extended.\n\nShe HATED it. The owner would give her instructions and later that day his girlfriend would come in and give her opposite instructions, then criticise her for the way she had worked and micromanage her until she did it her way. The girlfriend wasn't part of the business at all but SIL didn't want to cause any issues, so didn't argue. However, it was causing her a lot of stress; I noticed she lost quite a bit of weight. It came to a bit of a head when SIL had spent a few hours sorting the filing out, then went to the shop to serve customers. When she went back to finish the filing, girlfriend had gone through it all and messed it up, saying she'd organised it differently for her, wasting hours of SIL's time and causing her more work.\n\nSIL suspected they were going to extend her probationary period to screw her over, even though she was doing a great job despite being sabotaged and micromanaged. Her staff loved her and sales were higher. So she started looking for another job. Surprise, they extended her probationary period but she found a job paying more and 10 minutes from her flat. They wanted her to work ASAP but she was sure she had to work her notice period, which was 6 weeks. She asked me to read her contract to see if I can confirm. The notice was indeed 6 weeks...except for staff on probation. Either party could terminate with one weeks notice.\n\nSIL tells owner she's quitting and giving one weeks notice. Owner is caught on the hop and can't find another manager that quickly. Tells SIL her notice period is six weeks, to which she takes great delight in pointing out that her probationary period has been extended and the required notice is one week.\n\nSIL has been at the new job for quite a while now and is much happier.\n\nEdit: Lots of people saying you can quit when you want. I should have clarified that we're in the UK (some of you have correctly sussed that out), where contracts can be enforced.\n\nWhat could they do if she was contracted to a longer notice period and refused to work it? It's never happened to me or anyone I know but the internet tells me they could theoretically bill her for the cost difference to bring someone in to cover the remaining notice period, although this could be costly and unlikely.\n\nReally enjoying the puns, trying to get through and give everyone an up vote 🙂",
        "permalink": "/r/MaliciousCompliance/comments/r1in64/screw_her_over_on_probation_period_ok/",
        "comments": [
            "In my country we have saing : probation period works both ways, they evaluate you and you evaluate them.",
            "What problem did the owner have?   His GF obviously wanted to manage the store... badly.",
            "Perfect example of MC!  Love it!  I'm glad your SIL is happy!",
            "Looks like the shoes... Were on the other foot. 😎",
            "Beautiful.",
            "That’s what your boss gets…\n\n\nFor being a heel.",
            "I’ve been a fire sprinkler technician for 25 years. I just got head hunted by a regional company from a HUGE company I worked for for ten years. I was the go to guy for all the techs. If they had a problem they would call me at all hours and I’d always answer. I found out some of them made more money with less experience and less licenses. My new company HATES the old company and they are corporate enemies. I put my two weeks notice in and my district manager said he would do anything to keep me. The new company gave me a dollar an hour MORE then I asked for. The reason? The guy that will be my boss was already my boss for four years at the old place! He told them “give him more then he wants to make sure he comes here!” I told my old place what my new pay rate was and the manager said “we can’t match that, if we did the guys here would be pissed!” The final outcome?? I have been at the new company for two months now and 5 of the fitters in my old dept followed me to the new place!! More are coming and the old company can’t find new fitters!!! Teamwork really paid off! Next week another fitter is leaving the old place to come here purely because I told my new boss that I trained him through his apprenticeship! Feels great to be at a company that appreciates you. And a $5.25 an hour raise doesn’t hurt!",
            "gf had no business being there, if the owner was the sole proprietor!",
            "Oh, that is sheer perfection. The ideal mixture of MC and LAMF.",
            "Sounds like her last job...\n...was soleless",
            "I had a kinda similar thing happen to me at my first proper job as a developer for a large company.  \n\n  I was brought on as a consultant from a staffing company and they told me its a 6 months trial period with fixed salary and if I make the 6 months then we can negotiate a higher pay. I said fair enough.  \n\n6 months go by and the client is relocating me and my colleagues who got to stay from a kind of proof-of-concept demo team that was self sufficient to a live production team.    \n\nI tell my employer that I am ready to negotiate my pay and they tell me that because I'm changing team that counts as a new contract and my trial is extended 6 months so the pay stays.  I told my manager that it's not a good way to do business to trick me into thinking I can renegotiate my pay and then say I can't, she proceeds to tell me that I can quit if I don't like it.  \n  \nSo I did, a month later. Got a job lined up and handed in my 2 weeks, The client was quite angry because they were \"invested\" in me since they had moved me to a production team with real employees and \"intended\" to hire me at some point. Oh well. Treat your employees (consultants in this case) better next time. I hope they forwarded that  critique to the staffing agency",
            "Shoulda sold that bitch girlfriend down the river as the reason she left",
            "That's something most people forget : the probation period goes both ways. It is as much a period for the business to see if an employee is right for the job as it is a period for the employee to see if the job is right for them. Good on her for finding a better opportunity and give them the middle finger on the way out !",
            "“Six weeks is only required from *valued employees* not mere trainees.",
            "At the end of the 1970s, I was substitute teaching when a teacher quit at the end of the third week of school. They asked me to fill in on a daily basis until they found a replacement since it was my license area. I asked to be considered for the position which they agreed to.\n\nIn my US state, schools can only use subs to fill an empty position for 15 days before they must put them on a temporary contract an pay full teacher salary (and benefits). I taught the last week of September, all of October, and into November still being paid at sub pay. And the principal wasn't being very supportive. Apparently he had wanted to hire a friend but was told he couldn't. I think lack of support for the teacher that started the school year is why he quit at the end of the third week with no notice.\n\nSometime before Thanksgiving (second half of November) something came up (don't remember now) with the principal that flipped my switch. I'd been accepting all the crap because I was hoping to get the position. Now I didn't care. I mentioned to another teacher that this was my last day as a sub, that I wouldn't be coming back. Lo and behold, at lunch time the principal arrives with a temporary contract for the rest of the school year. \n\nI caved and signed. Still no support from the principal (as compared to the other 17 teachers in the building) but full teacher pay and benefits. And the next year I got the position where I taught another 32 years before retiring.",
            "Notice period 6 weeks? Surely that's unenforceable in any case.",
            "I once refused the end of my probationary period (6 months) because it would have meant being locked into three months notice.\n\nMy manager and HR queried this and I pointed to the offer letter where it said the period could be extended and it didn't say which party had control.\n\nThey asked why and I told them, in a deliberately matter of fact way, that the three month notice lock-in could go against me if I decided to leave and I was competing with someone else for the same job. They were nonplussed at my candour.\n\nI did quit, one week before my first anniversary. A colleague who gave notice before me was still working when I left!\n\nThat company has done a staff survey where one question was if the person expected to still be there in 2  years (no other option offered) and about 40% said no.",
            "Looks like she was a shoe-in for the new job",
            "I hope people learn from this. Never tolerate two conflicting bosses. And also never tolerate a boss who sabotages you. Either get it sorted or move on. It will never improve while you tolerate it.",
            "Leaving after we treated you like crap? Shoely you can't be serious",
            "It cracks me up.  My new job told me there was a 6 month probation period.  I live in the US, so not sure what that means - for the firest 7 months, they can fire me gor no reason even HARDER?",
            "Extending probation period is BS, but glad it worked out in your favor in this case :)",
            "6weeks to sabotage a business?!?!  You can get A LOT done in that time.",
            "After I got my epilepsy diagnosis I had a dr note that said I wasnt to be left alone (long story short) told my boss this because it was normal to leave us alone for 8+hrs to run half the store which here is illegal since we wouldnt get  our breaks and lunches.(big box store at that).\nAfter a couple weeks of her continously leaving me alone for 8hr shifts I put my 2wks in. In writing said I would do the 2wks if my breaks and lunches had coverage. Sure as shit about 4 days in she refused to  cover a ncns or call someone else in so I walked my happy ass out and she ended up having to cover it all. No regrets.",
            "I guess the shoe fits and the mean boss wore it",
            "A shit company tried this with me - my notice was 0 days if on probation. They said it was ridiculous - I said, write better contracts then. I let them off with that day’s pay, and they used it to bitch about me after I left.",
            "I did the exact same thing at my last job! Despite having discussed that I'd be trying for part-time postgraduation, I was told that I would not be given a leave for 2 weeks to prepare(Indian competitive exams can be super tough and people are known to prepare for years). The Hr also went to the extent of insinuating that I was perhaps not smart enough to be able to crack it that easily and should therefore not demand a leave.\n\nSimultaneously, I was pretty frustrates with company policies, the politics that people indulged in and the lack of a proper HR system! I could quit within a week as they had extended my probation by 3 months.",
            "Friendly reminder if this was in the US, she’s most likely an “at will” employee meaning any notice is a courtesy and not a requirement",
            "This is the way",
            "Just outstanding, they got exactly what they wanted, and exactly what they paid for. Twice.",
            "well, the girlfriend can be the manager",
            "You\\`d think this 'manager' and the GF were doing this on purpose - testing people.\n\nToo strong people a threat - and too weak 'easy prey' to 'enslave'.\n\n&#x200B;\n\nWell done for your sister!",
            "Never EVER work for a couple!  My very first school holiday job was husband & wife bosses.  Constantly countermanded each others' orders.  It was hell.  I lasted a week.\n\nHave seen plenty of other examples as well.  \n\nRepeat NEVER EVER work for a couple!",
            "OP, this phrase right here is just so pleasing to say:  \n*\"caught on the hop\"*  \nnever heard it before but it's quite the keeper.  \nThanks for the smiles!",
            "No one can \\*make\\* you work somewhere longer than you want, no matter what the contract says (at least not in most western countries, anyway). Surprise surprise, employers sometimes put whacky, illegal provisions in employment agreements.",
            "Did they trainer well?",
            "It's worth noting that in many countries, you can just quit with little to no notice, even if your contract says otherwise, because labor law overrides contracts.",
            "I love a happy ending *snif*",
            "I love stories like these.",
            "Always rear the contract. Loop holes hide everywhere!!",
            "They want extended probation? They get extended probation.\nProbation periods are for both parties and work 2 ways, seems they forgot this",
            "Aaaand… the other shoe dropped.",
            "That is so beautiful. They screw her over and it works to their disadvantage.\n\nThis should also be posted on r/antiwork",
            "Honestly if someone tries to extend a probation period for me I'll simply give notice in the same meeting and be off ASAP. It's just a sign they're trying to screw you out of salary, benefits, or stability. Their game plan is probably to terminate right before the period ends.",
            "> we're in the UK where contracts can be enforced\n\nContracts can be enforced in the US as well. The existence of the word \"contract\" kinda makes it clear that there was a contract in place. The folks who said \"yOu CaN qUiT wHeN yOu WaNt\" are not the sharpest spoons in the drawer.",
            "If you’re in the USA know that you can just walk out of most jobs.",
            "What if she did fall under the 6 week period for resigning, and just didn't show? she already had another job. What will they do, sue her?",
            "Oh delightful! A happy ending",
            "Gold!",
            "i’m still stuck on having to give 6 weeks’ notice!",
            "6 weeks notice? Fuck that",
            "Boom",
            "Jeez. How many times did she tell him that his girlfriend was micro-managing her and he didn’t listen? Do businesses even want sales?",
            "Good luck to a firm enforcing a breach of contract on an employee for a role like that. In Uk notice periods are primarily in place to protect the employee not the employer. \n\nThis is employment not indebted servitude.",
            "I just passed my 3 month probationary period and got a dollar raise and $500 bonus! I think I found a good one.",
            "\"except for staff on probation. Either party could terminate with one weeks notice.\"\n\nYes, that's what probation is. It works for both sides.",
            "In the UK an employer can terminate a contract and give pay in lieu of notice, an employee can resign with immediate effect and cite any number of reasons to justify this. Bullying is a classic case and having someone undermine you is bullying.\n\nAll in all though another good example of the benefits of being a member of a trade union.",
            "People over on r/antiwork will love this story 👌",
            "You know it's a good story when everyone in the comments are using theme of the story for all the bad puns! 😂",
            "Ok, I laughed.....",
            "I’m sorry but was there anything official behind the six weeks notice? If I felt like I needed to quit I’m not waiting six weeks, I’d give them two and if they got mad I’d probably just walk out. No job is worth that",
            "Even in the UK, you can quit whenever you want. It’s in our nation’s labour laws that you can just ditch a job whenever.\n\nNotice periods are polite, not required.",
            "It is compliance and it is malicious. Mission accomplished 😎",
            "Post to r/antiwork too!",
            "r/antiwork",
            "I’m from France (where there are notices) and live in the US (where they mostly aren’t).\n\n> where contracts can be enforced\n\nThat’s a bit disingenuous, contracts in the US can very well be enforced too, and generally are when people intentionally violate their agreements. The difference is that state law forbids notices in work contracts in 49 of the 50 states (I believe Alabama is the one that doesn’t have it). Those legislations come from the belief that no notices makes for a more dynamic and successful job market, whether that’s correct or not.\n\nAbout what happens in the UK when people stop working without notices: if it’s anything like in France, the employer can sue and be compensated for it. If someone really wants to leave without notice, they can ask the employer to waive at least some of the notice period, and I’ve seen employers agree to it fairly often. I’ve also had friends quit without notice and sue for being mistreated, if they have a convincing enough case, then they won’t have to pay for the notice. If the employer doesn’t agree and there wasn’t mistreatment though, yeah you’re stuck, you have to work it if you don’t want to pay up.",
            "probation periods in alot of places need to be in writing and signed.\n\neven then alot of the cases I do hear about tend to side with the employee.",
            "Nope, in the UK you can quit on the spot under grandfathered EU regulations.",
            "Always keep an eye for that next job.",
            "Worth pointing out as well that they have to actually pay someone to replace you in order to bill you for it, and it has to be above the cost that the role already incurs, since you've vacated it and freed up that money already. Basically you're usually very safe walking out of a job in the UK unless you work in a genuinely very unique and valuable role.",
            "Holy shit! WORK PAYS OFF!!!\n\nAfter difficulty, comes ease!",
            "Also in the UK. Top tips, from my mum, who was area manager for citizen's advice, for many years:\n\nNever sign a contract unless they're actually standing over you with a pen. Many places send them to you and ask you to sign and send back, try and 'forget' to do this, they often forget themselves and you've got a much stronger case if you decide to just walk out. (Keep the contract and sign your own copy, so if they claim later not to have it, in order to try and swindle you, you can say you sent it back so they must have lost it, there's nothing they can do about that, the burden of proof is on them, not you)\n\nEven with a contract, companies won't sue you to enforce a notice period. There no point, it'll cost them more than its worth, in time spent preparing, attending court, sending letters etc and it's very unlikely they'd win. If they're saving £2000 by not paying you for the notice period, they might only be out of pocket by a few hundred quid if they have to hire someone else.  Unless you're the CEO on a major salary and you'll cause huge financial loss of contracts, they'll just absorb the costs. (A shop, for example, will just move staff around for a bit).",
            "She shouldn't have said anything, showed up on the 6th working day in casual attire and said good bye. Maybe take in a old stale cake to say thanks 😄",
            "Like, what would happen if the notice was 6 weeks and you just left anyway?",
            "There is nothing malicious about this? She just quit according to her contract.",
            " r/antiwork story",
            "[deleted]",
            ">She was on a probationary period for three months and after that her salary would increase\n\nThis is a giant red flag and nobody should ever agree to something like that.",
            "Curious as to how someone could ever HAVE to work their notice, like if you had another job lined up you don't need a reference, and it's not illegal to leave without notice so what are they gonna do, fire you?",
            "You can leave right this second if you really feel like it.\n\nRequired notice means nothing. Unless you like your supervisor okay and want a decent personal reference. (for generic reference, your former employer only has to say if you were employed, and nothing else.)",
            "Every time I read one of these I can't help but feel there is another side to the story.\n\n\nPersonally, I have extended someone's probationary period as they were overly confident about their abilities while making fundamental errors and jeopardising relationships. This person did not react well to any feedback I provided. Still, I could see some potential, and she was expecting a child, so instead of letting her go I extended her probation and worked on a development plan with her. She was not receptive to the plan I put in place. Finally, she ended up burning bridges with some clients in a colossal outburst to a point where she was unable to do her job. At that point her contract was terminated. I can't help but feel like her version would be very similar to what OP has posted. This person thew alogations around, saying that I had orchestrated the whole thing and that extending their probation was my plan to get rid of her. If you really want to get rid of someone during probation period you can, you don't even need a reason to do so. I extended her probation in the hopes that she could learn and grow. I put my neck out in front of my own managers and extended probation against their recommendation of immediate termination at the end of her first probation period. \n\n\nSaying something like \"sales were higher\", and \"her staff loved her\", would be exactly what my example would have said. Unfortunately, a periodolical uplift in sales does not unpick a severely fractured relationship with a key client. Reactive sales and team building are basics/quick wins. Strong business planning and relationship building with zero immediate uplift is preferred IMO. learning the fundamentals and ropes to ensure future growth and success are fundamental to owning any career. My example did not show any belief in the latter.\n\n\nI have no idea what your SIL's experience was like, so no disrespect intended. Just sharing my experience as the example here kind of struck a chord.",
            "bruh i'd rather sink the ship if it meant not letting OUTSIDERS touching my shit\n\nif it's my work, it's mine and you're not touching it unless you have a written notice",
            "Notice period?  That sounds like some bullshit.  \n\nI've quit a few jobs in my life, and several of them received \"5 minutes ago\" notice.",
            "I'm living through a somewhat similar situation except it's IT industry and a 12 week of notice period forced on me even when I am under probation period. 💁🏻‍♀️",
            "What I'm getting from this is she's not fit for management, since she feels unable to refuse orders from someone not even working there. Why the hell get stressed about it too? \"Sorry, you don't work here, also if you did I'm the manager, so shove off.\"  If she then has problems, bring it to the district manager's attention and stop being so weak-willed.",
            "> , even though she was doing a great job despite being sabotaged\n\nWho is she doing a great job?? She’s stressed in losing weight. Jeez.",
            "6 week to quit? Jesus…",
            "Im in the UK - Ive never heard of notice period being enforced via contract. Usually people work their notice period out of plain decency as its what was agreed.",
            "What are they gonna do if you just quit on the spot? Drag you back to work? Fuck them.",
            "> The girlfriend wasn't part of the business at all but SIL didn't want to cause any issues, so didn't argue.\n\nThis is what annoys me about people. All she had to do was say something like \"I appreciate your input, but you're not my boss.\" and ignore the gf bitch.  Good god, it's not that hard to speak up for yourself."
        ]
    },
    {
        "post_id": "a38eeu",
        "author": "PlagueMember",
        "title": "I'm not allowed to leave early? Okay, I won't.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a38eeu/im_not_allowed_to_leave_early_okay_i_wont/",
        "score": 16171,
        "num_comments": 477,
        "created_utc": 1543981165.0,
        "selftext": "Story from a few years back, working in retail hell. TLDR at bottom.\n\nOur store had been going through major renovations, official reopening, the works. There was a new department manager after I'd stepped down from that position, from too much stress and a lack of support from upper management.\n\nA little about the new manager, she was a nice enough lady, but perhaps more ill-suited to the position than I had been. I was helping her learn the ropes of how our department worked. All fine except for a major inability to self-solve, which led me to turning my phone off outside of my working hours. She'd call me constantly in a panic with minor questions that plenty of other people in-store could have answered.\n\nThe store manager was an all-stick-and-no-carrot kind of person, who treated every question and issue as an inconvenience. She was a nightmare to work for even if she *liked* you, many good people quit when she took over our store. Myself included, after about 6 months. I'd worked for that company for 10 years.\n\nThere was one particular day, where we were already going to be short on staff and it was a busy shopping day (Thursday - pension day). I needed to leave by a certain time in the afternoon (lets say 3pm) for an important doctors appointment. I'd given plenty of notice but the day before I was told I couldn't go. It was too late to reschedule without being charged the entire appointment fee.\n\nCue whining from DM: But I *neeeeeeed* you, it's so busy and I don't have enough cover! What's this appointment for anyway?!\n\nMe: It's an important doctors appointment. I'm not telling you any more because last time I shared with you, the whole store knew my personal business.\n\nDM: But what am I supposed to do?!\n\nMe: I don't know, you're the manager.\n\nCue later in the day, I'm summoned into the store managers office. I'm informed in no uncertain terms, that I am *not allowed* to leave early on this day, because the department is short staffed and they need me. Being a meek little thing I bend to my store managers will. I say \"Okay\" and shuffle off with my head down.\n\nNow, I'm understandably upset, my fragile mental state is in tatters. I feel that this is all really unfair and somehow wrong, so I call the only resource I have: The union.\n\nI'm crying and explain the situation to the kind lady on the phone. Now because there was never any paperwork submitted for leaving early (normally rearranging shifts etc was done verbally then updated in the roster), there wasn't anything she could do in an official capacity. But then she threw me a lifeline.\n\n\"You're going to the doctor anyway, right? You're within your rights to take a sick day, get your doctor to write you a note. They can't force you to come in, you can't get in trouble for it, and they will have to pay you for it.\"\n\nSo that's what I did. I did as I was told - I didn't leave early. I called in sick and just didn't show up at all. Instead of losing 1-2 hours of staffed hours, they lost a whole day for being unreasonable bullies.\n\nThe next day I heard all about how the department was chaos. I felt bad but it also felt good to set a boundary with these people that were taking advantage of my good nature.\n\n\n**TLDR** Told I can't leave early for important doctors important. So I don't, take entire day off paid instead.",
        "permalink": "/r/MaliciousCompliance/comments/a38eeu/im_not_allowed_to_leave_early_okay_i_wont/",
        "comments": [
            "You did the right thing. I work retail too, and I see all the people who have lots of empathy get abused and taken advantage of heavily. It's rough for your colleagues, but they'll survive.",
            "This reminds me of an incident when I first started working at 16.\n\nTo get to work on time I had to get the train, the only train to get there on time left at 6am. This was the first train of the day. One morning the train was cancelled and the next one turned up an hour later. Hence I was an hour late.\n\nThis was the first time I'd been late but was called in to see the manager. I explained the circumstances but still got an official warning and told not to be late again or I would get a written warning added to my record. I'm not sure how I'm supposed to ensure the rail service runs on time...\n\nSo a few weeks later I'm on the platform and the announcer \"apologies\" for the cancellation of my train.\n\nChoices:\n1. Wait for next train, arrive late and get a bollocking.\n2. Go home, ring in sick.\n\nI took option 2 and as self certification allows for 5 days without a doctor's note (UK) I took the test of the week off paid.\n\nNo bollocking and weeks free holiday.\n\nThe company counted sickness by occurrence, so one day and 5 days counted the same. HR only got involved when 3 had occurred in the same year.\n\n",
            "Reminds me of my job.\n\nMy workplace (US) doesn’t have sick time, so when I got an “impressive” Strep Throat infection earlier this year, it was FMLA (a process designed for long absences due to illness or major family emergencies) or get fired for not showing up “ready to work.”  But FMLA requires you to miss at least 6 consecutive  days of work due to the same condition.\n\nWas I better by the weekend? I was taking my antibiotics, in much less pain, was walking straight, and could kinda talk again.  Could I have technically have clocked in and done a few hours?  Yeah. Did I?  No, I would have been fired.  I got daily emails and some texts about how overloaded they were and how every member of the team was required to come in for overtime hours.\n\nI missed exactly 6 days, which is conveniently when my Dr. could do the paperwork.  I was gone until I felt 100%, because I can’t get half a day of sick time to see a Dr. about an illness, or a day off moved around to get my voice back.\n\nManagement: Penny wise, pound foolish.",
            "Brilliant.\n\nAlso....Aussie? Pension day and Thursday make me think that",
            "Why didn't she get replaced after staff started to leave?",
            "Screw them for asking why you needed to go to the doctor's and fuck them for making it known the last time when you answered.",
            ">inability to self-solve\n\nI wonder if my coworker think of this towards me. I don't really call them few times a day but maybe once or twice in a week. But still makes me wonder.",
            ">  I felt bad\n\nNo, never do that.",
            "This was refreshing to read, good for you! ",
            "God bless unions. I hope they come to strength again in the US. ",
            "Good for you. Screw those assholes. ",
            "I'm jealous of the fact that there's a union where you work. My state worked damn hard to kill of as many unions as they possibly could. I hate these politicians who ruin any employee safeguards. I hate them so damn much.",
            "Absolutely did the correct thing. Luckily you’re part of a union. When I was in training for Walmart, I couldn’t believe how much they try to nail in you’re head that [unions](https://youtu.be/z_VL4gqrCHc) are the bad guys.\n\nEdit: the anti union stuff starts at 2:30",
            "Good for you. Retail is hell, and I wish unions were more of a thing in the U.S. to have these protections. I am in retail hell right now- and my time off for surgery yesterday only got approved Friday despite doing the paperwork years ago lol",
            "I did that as well. Put in the paperwork 1 week early instead of the suggested 2 weeks. So DickHead boss denied it. I just didn't show up to that date. Then the following monday i got called into a meeting and was talked down to for my behaviour. HR (human resources) and DH asked why i didn't show up. I said i had a doctors appointment. DH asked for what and i told him it was none of his damn business.\n\n\n\nThen he went on a little spiel about how he tries so hard and that by me not listening to him and not showing up it felt like a slap in his face.\n\n\n\nI grinned from ear to fucking ear when he said that. Yaaa.... From that moment on he actively tried to fire me for any little reason. He even went as far as promoting an ass kiss instead of me even though i had been groomed for the spot for 3 years. (We knew the current boss was going to step down when the company merged. I was his #1 that whole time.)\n\n\n\nSo i eventually quit and got the hell out of there. Fuck you DH, Fuck you HR and Fuck you PA.\n\n\n\nP.S. Just so anyone reading this buried story knows; HR (human resources) is not your friend. The company signs their check and they will always, always take the companies side when they can. Document everything people.... EVERYTHING.\n\n\nEdit: Added eventually.",
            "Retail mentality is running stores on as little as possible and depending on reliable people massively. As soon as you need to not be there for something important, it's your fault if the store doesn't do well, you've let everyone down and they guilt you over it. ",
            "I'm a retail manager and theres only 3 days you have to work.  Inventory (we do it once a year), black Friday and the Saturday before christmas.  \n\nStores should be staffed to handle call outs.  If they aren't, managers are failing at their job.  \n\nStores should also be understanding of peoples lives and honor time off requests.  ",
            "Seems like there are no bigger cunts than entitled middle management burnouts. So glad to have only spent a few years in retail/service jobs before graduating college. ",
            "Perfect malicious compliance. And if you are good at your job and they’re actually competent enough to know who is valuable it Will teach them a lesson. ",
            "What did the manager say when you came in the next day?",
            "I'm blessed to have worked in places where everyone is really understanding.\n\nI did once work in a place with an uppity manager who overstepped the mark and was told\n\n\"Listen c*nt bucket, drop it right now or I'm going to add up all the out of hours phone calls I've answered this month and put them on my timesheet, then take all my outstanding sick days due to stress\"\n\nThis would have been effectively 3.5x my salary for that month.",
            "I worked in retail and so did my stepdad, he was a bit of a push over like you, and they wouldn't let him do certain things even though they legally had to. Even making him work through a lunch break to cover the rush and sending him home an hour early, (this was standard practice for the store, or they'd make you have your hour lunch 2 hours into a 9 hour shift.)\n\n Well I overheard the one of the managers call my stepdad a mong (mongrel), reported it to the Union and gave my step dad the knowledge, and the union my stepdad and myself had a little meeting. We were told that they couldn't have the manager written up because it was my word against his and there was complications with the managers and supervisors jobs and it would look like I was slating him so my stepdad could keep his job.\n\nWe were advised however to go to the doctor's and get a sick note for mental health, for stress from being over worked and not having proper breaks, from bullying in the work place etc. The doctor signed him off for 6 weeks initially, which the store paid full pay, then the doctor was still unhappy so he signed him off for another month, which again the store paid full sick, as they didn't want my step dad to report them for the mistreatment of employees.\n\nThey couldn't contact him at home because he was off sick and they could be done for harrasment. He was in the middle of fighting for his job, so he trained for another one in that time off. He offered to take voluntary redundancy, and because of the sick pay and unable to lay him off or make him redundant in that time it pushed his redundancy package up because he went over into a new year by the time he got back to work.\n",
            "As an American who has watched the Democratic Party systemically help the Republicans destroy unions, I'm envious of the fact that you have a union. ",
            "Without knowing what you went to the doctor for exactly I still want to thank you for not coming in impared in any way.     \nDisease in retail spreads really fast, and even if it was just diagnostic or a mental issue .... you're not 100%. Take care of yourself.       \nPeople who aren't realiable 100% just end up creating more work for collegues. People who are contageous think they are helping by coming in, but end up infecting whole departments and causing more sick days.          \nHell, if you're not 100% - no matter what - this is detrimental to you. You're not going to recover from anything if you keep doing shifts. You're going to make yourself worse and worse.            \nShit like burnout is not a flip-of-the-switch kind of thing, it's accumulative.          \nAnd then, of course, there's the matter of working shitty retail jobs from hell, constantly overworked because you're understaffed, have to take on additional shifts, can't leave before that one guy who is always late shows up, etc.            \nPutting the company first and \"helping out\" wherever you can is fine as long as you are fine. But you gotta pull that ripcord and peace out of there for a while if it's starting to affect your health. The company - or a bad manager - don't value human personal for retail jobs as much as they should, which is why retail is such a shitty job field with high turnover.    \nYou gotta look out for number 1, occationally. ",
            "> She was a nightmare to work for even if she liked you, many good people quit when she took over our store. Myself included, after about 6 months. I'd worked for that company for 10 years.\n\nPeople don't leave jobs.  They leave managers.",
            "Where I work you’re allowed to take up to three consecutive sick days without a note. I was going through a rough patch with my health and had been taking some one or two day absences. More often than not I ended up at the doctors and got a note anyway, and my manager was often the one to tell me not to come to work until I was better. None of this leave was excessive or terribly frequent, however it was enough to trigger the manager. They then insisted that i was to provide a sick note irregardless of the amount of time taken. So, instead of taking a day off to feel better I would have to make an appointment, get dressed and travel to the surgery to waste the doctors time just for a note. The doctor would often issue a three day note so - instead of taking the one day off I needed, I would take the full three off instead with the note. ",
            "When you said the union I read that as onion for some reason and was reasonable confused for several minutes. ",
            "As a former manager: good for you!",
            "Nice.",
            "Now I am also curious about what was your appointment.\n\nYou can share with us. We promise we won't tell anyone in your old job what happened.",
            "God I wish Americans had this sort of worker rights. ",
            "YESSSSSSSSSSSS. ",
            "This made me smile. Good for you!",
            "This is why we have unions!",
            "I did something like this once, told management I could only work a half day, on my day off never the less, they said no, you gotta stay all day. Took the whole day off.",
            "Jah bless unions.",
            "Shit it must be nice to have a union for retail work. ",
            "This didn’t happen to be a certain blue and yellow grocery/clothing/whatever else you want store did it? This sounds all too familiar with how they like to treat employees. I went in one day when I was a little sick because I couldn’t afford to call out and in the hour and half I was there my fever jumped to over a hundred and my asthma started acting up. I went to the manager and asked if I could go home because I felt like death and there was no way I’d be able to get everything for my department done and she straight up told me “no, go back to work” so I was like peace and grabbed my shit and dipped because I’m not trying to kill myself because they like to treat their employees worse than the trash.",
            "I'm pretty sure that's illegal. You scheduled time off for a doctor appointment and they tried to cancel on you. I know it's DEFINITELY illegal for them to ask what the appointment is for. ",
            "Aha! I can’t leave early if I don’t arrive! 🕵️‍♂️",
            "We have problems with stuff like this in my current work place.  My boss put one previous employee in a position like this constantly so that she just stopped asking for days off and calling in sick.  My boss would take her paperwork for asking the day off up to a month or two in advance, set it on her desk till the day before, then refuse the day off.  My boss now no longer believe anyone when they call in sick because that employee would have to call out sick for any day she needed off.  Luckily my company does not require a doctor's note until you have been out for two or three days in a row.",
            "Thank you for using the correct word cue instead of queue that a lot of others on here seem to use. ",
            "Oooo this was so satisfying",
            "Did you give them a doctors note for your sick day too? That would really be MC. Show them you went above and beyond by providing them with a doctors excuse for your absence, AND showing you them you still kept your original Dr's appt. ",
            "Sounds like Woolies.\nThen again the union was helpful so must be somewhere else as the missos are more than useless at the best of times.",
            "They treat you like this because they don’t value you. They can replace you with virtually anybody ",
            "When I worked in retail, I went through a lot of hard shit including my mother, and only parent, moving across the country from where I grew up. She bought me a plane ticket to visit her for Christmas that year and since management at the store I worked at was pretty firm on no time off during the holidays, I had to quit. Then I flew to see my mom for Christmas, and when I returned, they offered me my job back. Screw retail!",
            "Retail is like that and it’s not fair.  I worked in a call center with similar bullshit rules. Glad I’m out of there! ",
            "Why does this sound like Meijer?  I know it isn't because you say pension but still...same shit.",
            "I think most doctors would gladly write you a sick note if you had a previously scheduled appointment. \n\nEvery doctor I’ve ever asked thinks companies requiring a doctors note for being out one or two days is bullshit. It puts a strain on the healthcare system. People who actually need to see a doctor can’t because people with a bad cold are clogging things up.",
            "wow what retail job has a union. I'm jealous",
            "If you can't manage people or a schedule, perhaps you shouldn't be a manager.",
            "More unions please",
            "Union strong, Union proud! \n\nI tell all my nurses to join the union. Too many arsehole employers out there.",
            "If your boss is more than 15 minutes late, you are legally allowed to leave",
            "Your union is your first call, not the last. ",
            "Perfect response!",
            "You did the right thing. I’ve had bosses like that too. My last straw is this lack of scheduling when I should be getting more per week. So I’m leaving soon. ",
            "That was well worth the read. ",
            "Beautifully executed, kudos",
            "One thing I learned about retail is don't feel bad. Every retail I've ever worked is the same. They pretend to be your friend, pretend to have your back, but will throw you under the bus faster than you can says \"huh?\". Glad you got out of there! ",
            "Is this nofrills? Lmao",
            "Good on you for drawing a line in the sand",
            "In my country, we have all the same worker's rights but they are unenforceable in half the states because they are \"right to work\" states where you are legally allowed to quit a job or fire a worker for absolutely no reason. Not *any reason*, but **no reason**. All in the name of equality, so we all have the equal right to work or some bullshit, I don't know. So, you are legally allowed to take that sick day even though your boss told you not to, but if you choose to, there's a chance you might be let go for \"no reason\". I'm so glad we have the right to work. ",
            "Do you work for Meijer? In the East Columbus area? This sounds terribly familiar.",
            "its not your problem they're short staffed because they can't schedule",
            "Ooh something similar happened to me! I requested my time off months in advance for certain times on this certain day. I was denied even though I easily could've swapped shifts. Management wouldn't let me so I just called out the day of. Idiots could've had my job covered but instead had to scramble to find someone. ",
            "This is amazing.",
            "Once, when I worked at a supermarket, we had a summer-eve-extra-spectacular open night, where everyone working there was on shift and we were open til 10pm instead of 8pm.\nDuring the shift I felt a migraine coming on - strongly. I asked absolutely everybody if they could cover my shift the next morning. Nobody could / would.\nSo I just called in sick the next morning, cos fuck that. ",
            "Myer??\n\n&#x200B;",
            "This is something I would do, except I'm expected to work this weekend.\n\"I'm sorry guys. This freak ice storm that literally everyone knew about a week ago has made it so I can't leave my driveway.\"\n\nI live in the middle of nowhere, and I'm not gonna commute on miles of black ice to my job. Sorry fellas. Do it without me.",
            "This post was speaking to me on another level and have a feeling you're Australian so it makes me think I work for the company you're talking about. ",
            "How was the \"important doctors important\"?\n\nEDIT: adding apostrophe, since at least one person was confused.",
            "The unions makes us strong. Good job OP.",
            "Can you please elaborate how you called in sick for the same day if you were already at work?",
            "Gotta be Kroger.",
            "[deleted]",
            "When I read these tales from retail hell, I'm dumbfounded that there isn't just a **massive** move towards unionization. The OP here at least had a union to call.  At least she had paid sick leave guaranteed. When America was \"great\" ^(for straight white men) it was also heavily unionized. ",
            "And people complain about unions",
            "If you’re so obsessive about how a place should be run why give up your position in the first place. change my view. ",
            "This has to be Kroger. ",
            "[removed]",
            "Jobs are for assholes",
            "Eh, I honestly question why OP would have picked a day that is traditionally busy for the store when setting up his appointment? \n\nI've had to deal with long chains of doctor and physical therapist appointments in the past and always pick days/times that are usually slow at my job so I won't inconvenience my coworkers more than is needed.\n\n\n"
        ]
    },
    {
        "post_id": "y15oer",
        "author": "No_Concept_9848",
        "title": "I was told this belongs here. They got what they asked for lol",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/y15oer/i_was_told_this_belongs_here_they_got_what_they/",
        "score": 16132,
        "num_comments": 610,
        "created_utc": 1665484638.0,
        "selftext": "“Here’s 33% of your website. You’re welcome.”\n\nI had a trophy-wife-client who had a frozen yoghurt business paid for by her husband. They contacted me and asked me to design and build a new website for her business. I gave them a quote and they asked if they could pay in three instalments. After we all agreed to the terms, I had written approval and I received my 33% deposit, I got cracking. \n\nWe had regular check-ins and they were happy with the progress until one day they just went quiet. They were already behind on the second payment and I was growing impatient. I was done with the site and just needed final approval and payment before launching it but I couldn’t get hold of either of them. I eventually got hold of the lady at her day job after weeks of being ghosted. She calmly told me that they found someone cheaper and that they won’t be paying the remaining 66% even though the project was complete and all their feedback was addressed. She told me that I could just give her 33% the files and move on with my life. I made it clear that websites don’t really work if you only upload 33% of the files, sarcastically, at which point she hung up the phone. \n\nI still had their ftp details for their brand domain that housed their current (old) website, so I decided to take revenge. I created a page with an animated, fake loading bar that was stuck at 33%. Underneath the loading bar was the message: “This company does not pay their suppliers. They decided to pay only a third of the price so now they have only a third of a website.”\n\nI went as far as to download the website files, split it up in roughly three portions (file size), and upload a zip folder containing a third of the files to the ftp folder. This way I actually gave them the 33% they paid for and I could show the file size to prove it. \n\nI also permanently deleted the old site’s files from the folder so they couldn’t restore from a backup. Not that they’d have a clue how to do that. They threatened to sue me, I’m still waiting ;)",
        "permalink": "/r/MaliciousCompliance/comments/y15oer/i_was_told_this_belongs_here_they_got_what_they/",
        "comments": [
            "They don't want to pay for a website but would be willing to pay for a lawyer to sue lol ok",
            "One thing I’ve learned is that anyone who threatens to sue via media that is not a letter from a lawyer, is not going to sue.",
            "One of my old friends would plow snow and lay salt during the winter. He had a customer stiff him, and the guy said “There’s nothing you can do about it!”\n\nWrong answer. \n\nFor the next two years my buddy took great enjoyment of plowing that guy’s neighborhood for free. And would put every bit of the snow in front of his house. Driveway, sidewalk, front yard, as much as he could pile there. Then some days when he was feeling particularly assholish if it was cold enough, he would bring two 5 gallons of water with him, and pour it on top of the snow so it would get nice and crunchy. (Anyone living in the Midwest knows just how much fun it is to move snow that is mostly compressed ice from the plows)\n\nAfter 2 years of this, the guy gave up and said OK, I’ll pay you DOUBLE what I owed you if you’ll just please stop. \n\nHe relented and took the cash, but not before commenting “turns out there IS something I can do about you not paying!”\n\nI aspire to that level of petty assholeness.",
            "Did they ever contact you afterwards or do you know what ended up happening to their site?",
            "Always reintroduce people to the cost of their own assholery.",
            "Different circumstance but when we were first in business 40 years ago, we had a customer who bounced a check for a patio door. After waiting weeks, my husband went back to the house with a cop (they did this back then) and pulled the door out.  I believe he put plastic in the opening but we did take the door.",
            "I would've cut every file into a third of its original size. \n\nThe index.html keeps the opening <html> and <head> and some of <body>. Every .jpg that is still referenced in the now partial .html will load and render to a third.",
            "Oh this one is saucy. Nice",
            "Real power move would have been to put all the site's files into one zip, then use a file splitting tool to give them 33% of that one file.\n\nWell done. Fuck people who stiff their workers.",
            "Same thing happened to me. I waited until they were at an industry event before changing the site to \"not available due to non payment of bills.\" Then I insisted on a cashier's check lol",
            "There are times that being your own boss is most delightful. Calling a terrible client to account? This is one of those times.",
            "That lady is a straight up douche. But the erasing of old files could have gotten you in trouble.",
            "i feel like i read this somewhere before...",
            "Word of advice from a veteran.\n\nDon't get into spats like this.\n\nJust send them the bill and the summons to small claims court. They violated the contract and deprived you of your expected earnings.",
            "> They threatened to sue me, I’m still waiting ;)  \n   \nUh why didn't you sue them? If they signed a contract and you did the work, take 'em to court.",
            "Damn, that was crafty. Very nice.",
            "I read an old story about a bricklayer who specialized in chimneys. If he was worried about not getting paid in full, he'd mortar in a clear piece of glass between bricks about halfway up the chimney. Wouldn't show from outside, would show daylight if you  looked up from the fireplace but completely blocked air flow.\n\nSometimes he got fully paid when the chimney was finished. Sometimes they tried to stiff him, only to call him back after they used the fireplace the first time and got a house full of smoke. Once he was fully paid, either way, he'd drop half a brick down the chimney to fix it.",
            "I'm not an IT guy but isn't the contract that they signed binding? Could you of took them to court when your were done with website but they hadn't paid up..",
            "On the flip side, I always find it odd that in her work as an editor, my wife has lots of people coming to her, some in actual tears, who’ve paid thousands in fees to end up with a crap job, but then somehow expect my wife to fix it for them free of charge.\n\nShe even had one client who ditched her because she found someone “more professional”… then returned over a year later, having spent several thousand pounds with this “professional” and with a manuscript that would have actually been improved if you’d wiped your arse with it… and without any acknowledgement or apology tried to talk wife into fixing it ‘as a favour’ because she had no money left.\n\nFor comparison, wife is a writer with several titles to her name, spent years working in journalism, lecturers at university, has testimonies from literally hundreds of satisfied clients and openly shares examples of her work and total fees before agreeing to undertake work… the “more professional editor” in this case was someone who basically had a flashy website and good marketing/sales bullshit, with no demonstrable track record… \n\nSome people really are just shit.\n\nI know it won’t make up for your lost revenue, but have a small token of my appreciation for your actions… I don’t even consider that malicious… it just teaching some numb bastards a lesson… sadly one they won’t learn, and will cry to all their friends about the evil web site designer who wronged them.",
            "I hope you sleep good. I sure would.",
            "> I also permanently deleted the old site’s files from the folder so they couldn’t restore from a backup.\n\nThe sensible IT guy in me thinks this is where you lose the moral highground.\n\nIts one thing refusing to give them the completed work, but it's another thing entirely to activly damage their existing stuff.",
            "A good alternative would be to covert the files to binary, and remove every 2 bits out of 3.  Then send it over.\n\nMaybe code it special so that the headers stay in so it starts to load, then just spits out the nonsense from hell.\n\nEdit: thanks for the correction, ⅓≠⅔",
            "[deleted]",
            "This is beautiful. I hate when AH’s stiff people after contracting X work for Y pay. This actually warms my cold, black heart.\n\nHappened to my pops, a carpenter, several times. He was too nice of a guy to go after them properly (though I offered, he never took me up on it).",
            "In \\~7 years of being an editor, the only clients who ever didn't pay what they owed were well off seeming older women writing YA fantasy. Any other genre/age paid without issues. YA fantasy authors now get charged in full up front.",
            "I wonder what goes through the mind of a customer who threatens to sue you even though they also refuse to pay for your services.\n\nDo they expect a random stranger to work for free?",
            "I’d have given them all the files, but only the first third of EACH file. Just run the program through a copy routine that cuts off the HTML, JS, image files and so forth at the 1/3 byte limit. If you’re nice, throw in the EOF bytes as complimentary.",
            "Good story, I just hope this part will never bite you in the ass:  \n> I also permanently deleted the old site’s files",
            "I would have given them 33% of each file.\n\nThe webpage would barf all over itself.",
            "I’d send their details to a collection agency",
            "r/prorevenge would love this...",
            "Feel free to tell them that you will be suing them for breach of contract.",
            "Yeeeaaah, my husband had a client who walked out after paying about 1/3 and said he should be happy he got as much money as he had. My husband does engineering so he liened the building and then sued to collect. @$$ of a client kept refusing settlement offers. He actually owed about 12k and my husband had offered to let him off at $8k but nope. My husband won the lawsuit of course. He collected about $16k due to interest, and his attorney collected over $80k!",
            "The middle third of each file. No html declaration, no image headers... Thought about every third bit but that ends up looking like random noise, right?",
            "The e-mail would be the only thing you would need to defend yourself if they did sue you. They gave you the terms, in fact, the judge would probably rule that they need to pay you in full for wasting their (the judge's) time.",
            ">I also permanently deleted the old site’s files from the folder so they couldn’t restore from a backup. Not that they’d have a clue how to do that. They threatened to sue me, I’m still waiting ;)\n\nYeah, so, that part right there?\n\nThat's gonna be expensive for you if they DO sue you.  That was destruction of property.  \n\nYour best hope is they are too lazy or too uninformed to sue you.",
            "Did I read that right, you altered/deleted their old website, the one you didn’t work on and wasn’t the subject of your contract? As a lawyer, I’d say it’s time to lawyer up or settle this dispute quickly. If the law where you are is anything like my jurisdiction, you went a step too far by destroying files that didn’t belong to you and were not your work product.",
            ">I also permanently deleted the old site’s files from the folder so they couldn’t restore from a backup.\n\nYou had me then you lost me",
            "Hehehe",
            "TFG voters. They truly admire people who stiff their contractors. \n\nIt's only bad if it happens to them.",
            "Oh, I wish I could have picked your brains a few years ago when I got stiffed in a similar way.",
            "You think they'll pay a lawyer?",
            "Of course, they can afford to pay a lawyer but can't afford to just pay you for the work you already did",
            "I've read this exact specific story last year, repost",
            "If I were the judge, you would not have to pay. They would have to pay you some money for the hassle they caused you.",
            "lol should have zipped all the files into numerous archives then give them only 33% of the archives so they cant even look at the files. lol",
            "Haha, was this in a coastal town in Southern California, by any chance??",
            "https://github.com/kleampa/not-paid",
            "Nice... Might've been a good time to return 402 Payment Required to every request 😁 (Technically, it means the visitor is supposed to pay, but the thought of a bunch of potential customers asking the lady why they need to pay to see the website is also amusing.)",
            "I still remember this story from the first time you posted it. Was it even your story to begin with?",
            "Did they sign a contract with you? If so, maybe you should sue them.",
            "Nice!\nIf you had a written contract you could possibly sue for the profit.  Anyway, I found it was always best to contact a lawyer before taking any contemplated action (read revenge).  “Still waiting” may not lend itself to a good sleep. It wouldn’t hurt to run this by a business lawyer.  Unless you think they’re just generally flakey, like being all bark and no bite.  At least one comment suggests what you did might be considered “fair,” in a general district court.",
            "Wow!  Can't believe their first reaction was to ghost you.  Why not just tell you?  As if you're never going to follow up.  And you could countersue for breach of contract.\n\nThough, I believe the lawyer is going to want 33% of the winnings.",
            "I feel like I’ve read this before.",
            "I’ve read this before…",
            "I remember reading someone story on here website design they had a feeling they would get screwed so they built into the site that each week the site would gradually fade to just a white background lol was funny",
            "50% MC, 50% petty revenge. I approve.\n\n(Except for the part about deleting their existing files.)",
            "unless you have it in writing they wanted you to deliver what you had created so far, they night actually have a case against you.\n\nif i interpreted this correctly, their backup of their old site was not your property, so...",
            "[removed]",
            "You'd better hope they don't sue you, if they can show lost income due to what you did to the previous website you'd probably lose in small claims.\n\nAnd they don't need to be able to afford an attorney to do that. \n\nNot legal advice, I am a lawyer but not your lawyer.",
            "They're gonna sue?  That's cute.\n\nIf they couldn't come up with the money to pay in full, they probably can't swing an attorney either.  Not that they have a case.",
            "Loading bar stuck at 33% is superb - any repercussion?",
            "🔥👏🏻👏🏻👏🏻 I need more of an update of how they reacted because I know that they’re not letting go of this",
            "**Screenshot, please.** I need this laugh in my life.",
            "Lawyer’s probably take one look at their website and nope out 🤣",
            "Way funnier to upload 33% of the bytes",
            "I've read this here before.",
            "Can we get the name of this place so we can avoid it? I'd hate to support people like that.",
            "I am pretty sure you deleting the old files may be illegal and criminal tampering with computer files.  \n\n\nEverything else I think is awesome",
            "[deleted]",
            "> I also permanently deleted the old site’s files from the folder so they couldn’t restore from a backup.\n\nYou executed a wholly malicious act which was outside of the reasons for which you were given access to their FTP, which, could damage her business in measurable dollars. It's very likely they'll try to sue you for [commercial disparagement](https://www.findlaw.com/smallbusiness/business-laws-and-regulations/commercial-disparagement.html), and depending on your state, even [tortious interference](https://www.findlaw.com/smallbusiness/liability-and-insurance/tortious-interference.html). \n\nCongratulations. You committed a crime, and will almost absolutely lose that suit they're bringing against you and could be responsible for thousands, if not tens of thousands in damages. This was incredibly stupid of you.\n\nYou had every legal right to not complete your contract due to nonpayment, you do not have any right whatsoever to cause intentional harm to that business as \"revenge.\"\n\nThis isn't /r/maliciouscompliance it's /r/icommittedacrimeandherestheevidenceforit",
            "Deleting the existing site that you did not do? I’d sue you too. Everything was cool up until that point.",
            "Oooo, this is a good one, please keep us updated OP!",
            "This is unethical. I know it feels satisfying but don’t do this. If they don’t pay you just don’t turn over your files.",
            "We need the url\n\nWe need the url\n\nWE! NEED! THE URL!",
            "I'm just wondering what makes this woman a \"trophy wife\". Seems irrelevant, and the rest of your story contradicts that trope, so I'm not really sure why you would include that, unless you're a straight up douche. It doesn't add anything to the story, besides making you seem like a misogynist.I mean because fuck attractive women with day jobs, right? 🤮",
            "Wow. That’s into illegal and <edited, because I don’t know what the fonk my brain did there>.",
            "This feels like more than just malicious compliance...AND I LOVE IT!",
            "This is Badass",
            "This is not Malicious Compliance.",
            "I supported you up until sabotaging the old site.\n\nHourly backups with two week retention are a wonderful thing.",
            "This is the way.",
            "I need an update",
            "Should ghosted them for same amount of time as well",
            "I really hope you gave them 33% of each file. Like the middle 33%. That might be even more useless than complete files, just 2/3 missing.",
            "This is beautiful",
            "Well done!"
        ]
    },
    {
        "post_id": "hd2zuj",
        "author": "None",
        "title": "Won't Be Taught By A \"Girl\", So He Got Fired",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hd2zuj/wont_be_taught_by_a_girl_so_he_got_fired/",
        "score": 16120,
        "num_comments": 844,
        "created_utc": 1592725935.0,
        "selftext": "So, I used to work for my grandparents on an oil farm in Texas.\n\nI was 17, freshly graduated from high-school, and had moved from the Midwest to Texas to live with my grandparents and work on the oil farm they worked for doing some easy data-entry.  The building was essentially a tin building on the job site where my grandma and I (the only two office workers besides my grandfather who was the foreman) worked.  \n\nBasically when the new hires would come in that had missed the initial hiring round I was the one that would make sure all their paperwork was in order and that they had all of their OSHA classes finished, and if any safety training hadn't been done I would just put in the VHS and confirm on a written copy that they had finished it \"under my instruction\".\n\nThis went on for two months with no issue until one fateful day, a regular Florida Man (record and all) came in as a new hire and came to my office to finish his new hire paperwork.  Once he was in my office I found he had no safety training to speak of and I informed him his next day or two would be spent in my office watching safety videos (all of this was paid of course).\n\nHe immediately flew into a rage, screaming about how he wouldn't \"have some little girl teaching him how to do his job\", which again I was a 17 year old female (at the time, I now identify as non-binary), and was only going through company standards and OSHA rules with him.\n\nI went to my grandfather who was my boss at the time obviously very confused and uncomfortable and unsure of how I should proceed.  To which my grandfather said, \"You wanna fire him?”\n\nCue my excitement, my grandfather follows me to my office and I, as a 17 year old, get to fire this grown ass man sitting in front of me.  I start directing him to gather his things and leave and he starts up a huge fit, yelling and cursing at me, before he noticed my grandfather standing in the door with his gun holstered on his hip (my grandfather usually kept this locked in a safe on the ground or in his truck, I hadn't realized until after he'd pulled it out just for me) and very quietly then he got up and left.\n\nThe most satisfying moment of my life.\n\nEdit: Changed queue to “cue”, sorry y’all I wrote this drunk at 3AM.\n\nEditEdit: Enough with the transphobia please, obviously gender has a lot to do with this story so I just wanted to include that I identify differently now.",
        "permalink": "/r/MaliciousCompliance/comments/hd2zuj/wont_be_taught_by_a_girl_so_he_got_fired/",
        "comments": [
            "To be fair, it was be fired by you or be fired on by granddad. I think he made the right career move!",
            "Someone I worked with once fell asleep while being trained by a female member of staff!!  And this was because he just couldn't believe she could teach him anything.  He didn't last much longer",
            "I apologise in advance for the bad pun but it popped into my head as I was reading your post:\n\nIs it harder to do data entry when you're not-binary?\n\n\nAnyways, thanks for the story!",
            "When I was 18, I worked at a hotel/conference center. I was the supervisor of one of the bars. One night a 30-something year old guy had his first day at the job there. He made jokes about me being to young and wouldnt listen to my advice, he was a \"experienced\" barkeeper. So I left him alone for a bit. When I returned he had broken 50+ glasses in the dishwasher. I told him to get something to clean it up and he left. He never returned. My boss came to me and asked why she had found his tie and name badge laying on the floor somewhere. He was fired the next day. Maybe listen to peoples advice regardless of their age",
            "This is r/instantkarma material. That must feel good firing him lol.",
            "[deleted]",
            "whats an oil farm? do you grow oil??",
            "> ...had moved from the Midwest to Texas...\n\n> ...sorry y’all...\n\nConfirmed.\n\nI kid. Good story. It truly amazes me the mentality of some people.",
            "that’s amazing! I can imagine the look on his face, getting fired by a “kid”. Surely he’ll spout something about you being the grandkid of the owner and that’s why he got fired, but it was 100% his own fault and this was super sweet to read",
            "No safety training, no work. This is like every job site in the world. That dude was fucking crazy",
            "It’s sad that he never actually respected you, he respected your armed grandpa. It’s like guys who stop hitting on you when you say you have a boyfriend, but not when you want him to leave. \n\nSadly, the good ole boy Florida Man is probably out abusing women to this day.",
            "I used to work in oil. There were probably 200 men working on the site and maybe 10 women. \n\nFor the most part, they left us alone, but I remember once some guy made fun of my handwriting because it was \"too pretty\". I guess he thought that was a sick burn or something? I really don't know.",
            "I wonder how his fragile masculinity managed to reconcile that experience?",
            "[deleted]",
            "You have an awesome grandfather!",
            "I am a woman who was a 50% partner with a man in owning a car lot.  We had a male employee who would clean our cars, and was a friend of my partner.\n\nMy partner went out of town for a couple of days to buy cars.\n\nThe employee did not show up to work while he was gone.\n\nWhen the employee finally showed up again, I called him into the office and asked him where he'd been.\n\nHe said, \"I ain't gonna work for no woman\".\nI said, \"You're right.  You're fired\".\n\nI had a great partner.  He backed me 100%.",
            "He doesn't want to be taught by a girl? How the heck did he get through elementary, middle, and/or high school?",
            "It's one of those things where maybe you could have rescued the situation... but it was better not to. A guy like that would likely have been a pain until you fired him for something else. :-(",
            "Also probably the most satisfying moment of your grandpa's life too.",
            "What a sexist attitude to have. How sad some people still think like this. I hope he had a hard time looking for another job after that, and you had him labeled as non-rehireable.",
            "A good example to prove that being an awful person will get you nowhere in life.",
            "That must have felt pretty awesome to get to fire him, and I'm glad your grandfather provided extra backup even if you didn't realize it at the time!\n\nAlso, you be you and don't let the transphobes tell you any different! My trans girlfriend sends all the internet love to you.",
            "I'm glad you have a better sense of who you are today!\nMy partner is nonbinary, and you all deserve the happiness that comes your way!",
            "Aww, such a great story. This reminds me of visiting my grandparents’ oil farm when I was a kid. Plowing the oil fields, stacking bales of oil in the barn, milking the oil, helping birth oil calves. Such treasured memories.",
            "More power to you, OP!",
            "He wouldn't be taught by a girl... So he got fired by one",
            "Do you mind if I ask what non-binary actually entails?",
            "Excellent story!\n\nOne pet peeve: it’s “Cue my excitement” and not “Queue.” You’re talking about your excitement starting like it’s responding to a cue (like an actor appearing on stage on their cue), not like it’s waiting in line.",
            "Not all men do that for their family. your grandfather is solid",
            "Your grandpa is an awesome man! He could very well have fired the man himself, but let you do the honors.",
            "It makes me happy, as a Texan, that this happened in Texas.",
            "I once had a co-worker get mad because the company we were with required him to take at east a half hour lunch hour.  \"I don't want some bean counter telling me when to take my lunch!!\".\n\nI tried explaining that it's not someone off on a power trip.  They're protecting their ass from you trying to sue them later, claiming \"I was never given a lunch break!\" or \"They never told me I couldn't do that!!\".",
            "Imagine being that asshole reading this post and realizing \"I got fired by one of them SNOWFLAKE WEIRDOS\"\n\nidk, those misogynistic fuckers seem to hate LGBT+ even more than women, and I'd like to see his face when he realized it was a double whammy",
            "> \"You wanna fire him?”\n\nBest grand-dad ever!",
            "Sitting here having lived in West Texas all my life wondering what in tarnation an \"oil farm\" run primarily by family members is supposed to be.",
            "Hey, just here for that edit; I’m non-binary too! Ignore that transphobic commentary. You’re valid, and you’re loved. I don’t think I really need to say it all ofc because we enbies are pretty tough, but just know that you are valid!!\n\nYou’ve got backup, bud. Lmk if I can help <3",
            ">\"You wanna fire him?”\n\nI like this line the best :)",
            "I'm more concerned for the fact that you would just put in a video for an OSHA mandated class, especially in Texas, in the oilfield. With the classes that are mandated by the state and by OSHA depending on what the job involves, very few are just a video and done.\n\nSource: I work for an oil field safety company",
            "Great story, I love that you fired him and you got support, wish you well always, mad respect",
            "My grandparents used to own an oil company as well and I can clearly imagine my grandpa doing this for me. RIP Grandpa. :’(",
            "Wow! What an empowering opportunity! Actually, that whole job sounds like amazing experience you were graced with at a very early age.  Lucky you.",
            "Wheres is the malicious compliance? Idk if this belongs here.  Good story though",
            "I saw the edit about transphobia and my afab nb ass squared up and dug through comments for a bit ready to fight people, but all I saw was someone genuinely asking about what nonbinary means and a very good discussion happening in the replies. I’m glad the transphobia has been buried.",
            "\\*clicks gun\\*\n\n'This baby can knock the fleas off a dog from over two hundred feet away, and its pointed directly at your head, Tannon!' - doctor Emmett Brown, back to the future part three.",
            "What the fuck is with some of these people in the comments?! Know that the majority of us back you and support you and that we understand why you brought it up. Also, fuck that guy.",
            "Dude, as another nonbinary person I'm sorry you had to do that second edit.",
            "What an awesome grandad to back you up, teach you an important managerial skill, and not tolerate sexism in the workplace! \n\nSorry people are being transphobic bc of your non-binary identity. Fuck that shit! Be your perfect you and keep on doing the right things.",
            ">I went to my grandfather who was my boss at the time obviously very confused and uncomfortable and unsure of how I should proceed. To which my grandfather said, \"You wanna fire him?”  \n>  \n>Cue my excitement, my grandfather follows me to my office and I, as a 17 year old, get to fire this grown ass man sitting in front of me. I start directing him to gather his things and leave and he starts up a huge fit, yelling and cursing at me, before he noticed my grandfather standing in the door with his gun holstered on his hip\n\nAhhhahahaha I literally wanted to jump up and down with glee reading this, so fucking satisfying.\n\n&#x200B;\n\nPS since I read the edit about transphobia and I know how goddamn pervasive transphobia is: transphobes can fuck right off, keep your damn hate and insecurities to yourself or better yet work through them and become a better person.",
            "I always wondered about planting season on an oil farm.",
            "Dudes logic was flawed. The tape was giving the info, not you. He was learning from the tape.",
            "30 years ago, I worked at a full service gas station when I was 16. My dad is a mechanic, so I knew a few things. As a young woman, I had some harsh lessons in misogyny (we called them \"Sexist Pigs\" back in my day). I did take great pleasure in shocking the misogynistic guys with my engine and car knowledge when they tried to test me to prove I knew nothing.",
            "\"Enough with the transphobia please\"\n\nI want that on a t-shirt.",
            "Your grandfather made an awesome choice, instead of just doing it himself, he let you experience being in control of a stupid situation. Good on you grandfather and good on you!",
            "That was a totally awesome moment right there!\n\nAlso, I am trans, and the haters can take that crap out of here.",
            "Where is the malicious compliance though?",
            "That story gave me a good stomach feeling.",
            "I grew up in west Texas in the oilfield, where my dad worked. I've never heard it called an oil farm.",
            "Queue is a group of people forming a line. I think you meant cue.",
            "This isn’t malicious compliance but definitely a awesome story",
            "As a fellow afab enby, I’m sorry you have to experience transphobia, it blows my mind that so many people can’t just accept us and move on",
            "It's amazing how quickly people can quell a fit of rage when they realize you are armed. I've had the pleasure of experiencing this a few times myself.",
            "And nothing of value was lost.",
            "Kudos to your grandfather for backing you up, sounds like an awesome man! How long did you work out on the farm?",
            "that’s badass, my dude. i can only imagine how cool it was to do that as a kid",
            ">oil farm\n\n...do the barrels grow on oil trees or something??\n\nJust kidding, I know it was probably some kind of extraction facility. If you don't mind me asking, did it have a full drilling platform and Derrick, or were there just pumpjacks?",
            "It's also good to have a large steel wrench in one hand. Some idiots may think they can misbehave in a way that is short of being able to be legally shot.",
            "Props to GPA. You do the deed, but he's got your back just in case.",
            "Great story, glad that idiot had the common sense to scootch before your granddad fucked his shit up lol.\n\nAlso fuck anyone who’s being a transphobic douche. Being non-binary is perfectly valid and you deserve the same respect that everyone else gets. Hang in there :-)",
            "This isn't malicious compliance. He refused to comply with the rules and was fired. At no point did you or he comply with an action requested by the other to the downfall of the requestor.\n\nExample: \n\nFragile man: Pull that rope!\n\nYou: Uh that is not going to end well...\n\nFragile man: Pull it I don't want to hear any back talk.\n\nYou: Pulls rope\n\nPiano lands on Fragile Man\n\nGrandpa: Why did you pull that rope?\n\nYou: Fragile Man demanded that I pull it and didn't want any back talk.\n\nGrandpa: Well... fragile idiot you are now injured and fired.\n\n*Fin*",
            "I am really proud of you, and of your grandparents. This was exactly how it should be done. (And no trans hate either. You be you. We all should be!)",
            "They call oil rigs - \" farms\" in Texas?",
            "Ooooh I wish I could do that lol. How awesome would it be to get revenge by saying \" you're fired\". A classic moment :)",
            "I've lived in Texas for almost half a century and I've never heard it called an \"oil farm.\" Oil field, yes. Oil farm, no. (yes, I am old.)",
            "They mentioned it because OP didn’t feel comfortable leaving it out.  Maybe thousands of people thinking about OP as being a girl didn’t sit right?  Sure it doesn’t matter but it’s important to OP.  Relax people lol.",
            "This is probably one of my favorite MC posts ever. Thanks OP!",
            "Being afab NB myself, sexism fucking sucks.",
            "Awesome story! I love your grandpa.",
            "Thanks for clarifying.  I too feel it’s an important detail.  Obviously because of the way the guy acted being instructed by a “little girl” but also, now that I know you are non binary I feel I’d have an incomplete story if you didn’t mention it.  To anyone that has a problem with that, what are you afraid of? You’re as bad as the guy who OP fired.",
            "Congrats on the transition! You're amazing :)",
            "Excuse my incompetence but what’s an oil farm? Is it where oil is born and raised?",
            "Ha! Nice story. Also, *Hug!*",
            "He sounds like a real dick",
            "Good riddance to bad rubbish.\n\nClearly, this guy with his impeccable record of cooperating with safety standards was going to be an exemplary employee and an asset to the company. /sarc",
            "Sounds so satisfying",
            "I love this story!  I live in new England and we don't do guns too much, but this was a good gun story. I also identify as they them. We should be friends. We all gotta stick together.  If given permission I will dm you my instagram.",
            "So satisfying",
            "Well, I read the whole thing and then saw the two edits (well two so far.... ) I have read enough from those pesky English persons that queue and cue are kinda the same thing, so no problemo there.  \n\nThe second, well my current old guy philosophy (did I really spell that right on the first try?) is, are you good at what you do?  If so, all those other labels aren't really my business.  \n\nBe the best you that you can be. And I do hope you are happy/content. \n\nNow for the real comment.  Your Grandfather is a true bad ass.  \"You wanna fire him?\"  I would so love to see that....",
            "Don't mind the negative comments. I identify as non-nonbinary.\n\nedit: I see you bigots hating on my gender identity.",
            "Would have been cooler if grandpa handed you the gun lol",
            "Why was this deleted?",
            "That’s how you can see how much Americans are degenerate: the fact that her grandfather displayed a lethal weapon in an at work argument - and that everyone thinks this is normal or even worse: enjoyable. Could you imagine any western country in the world where a dude gets fired, he gets angry and then the boss comes at the door with a gun at his belt? Just like if there was no other option than saying « hey you seem angry but I could also kill you right now » Wtf kind of barbarian violent society you guys live in?",
            "Showing off a gun while firing someone is kind of a dick move, but otherwise great story.",
            "I love these sort of empowerment stories. Good on you OP!",
            "Your dad sounds amazing. Exactly like the kind of father that I want to be some day",
            "How is this malicious compliance? I thought I was at petty/pro revenge while reading it.",
            "Cool story, but I'm not getting how it's supposed to be interpreted as an example of r/maliciouscompliance ?\n\nWhat's being maliciously complied with? \nAnd how so?",
            "Well done, Grandpa!",
            "Sounds like a good grandpa you got there. That’s what I like about guns, people often get scared when they realize you have one. You don’t even have to point it.",
            "They'd like this in r/prorevenge",
            "America, the greatest country in the world, where you threaten ex employees with guns until they leave",
            "Oil Farm?",
            "What is an oil farm? Growing oil crops like canola/peanuts/sunflower? Or where one drills for petroleum?",
            "*cue",
            "[deleted]",
            "[deleted]",
            "You need to share this in \nr/TwoXChromosomes\n\nGreat story. Thanks for share and making the world a better place for my daughter!",
            "[removed]"
        ]
    },
    {
        "post_id": "p7vud9",
        "author": "StrongAbbreviations5",
        "title": "Neighbor complained to the HOA about my yard",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p7vud9/neighbor_complained_to_the_hoa_about_my_yard/",
        "score": 16106,
        "num_comments": 1200,
        "created_utc": 1629437244.0,
        "selftext": "So, I have a Karen for a neighbor. She's a grumpy old C with a live in son in his 40s and no other family or friends. And when I say she's a Karen we're talking to the point that she came into my property to yell at our landscaper about a boulder he was installing... on our property (something about believing it would fall over... onto more of our property...)\n\nA few months after we moved in we receive a letter trying the HOA saying they'd received complaints and asking that we make sure we're mowing watering and maintaining. I chalked it up to moving into a nicer neighborhood and made an effort to mow twice a week instead of my normal once, added a little time to the sprinklers, and figured all was good...\n\nApparently it was not all good as we received another letter stating the complaints had continued and the HOA wanted to talk with us to see what the problem was. \n\nI should note, we had just moved in not that long ago, and hadn't landscaped the back yet so were letting our dogs pee on the front at night, which lead to the inevitable patches of bright green grass that grow stupid fast. Now I'll freely admit I don't keep my yard to the level of some of my neighbors, but it was in perfectly good shape outside some green spots in an otherwise average looking yard and I do my best to keep things mowed and looking decent.\n\nTurns our grumpy C had taken real offense to this and started complaining to the HOA. The \"hearing ended up bring mostly incoherent rambling, but the bottom line was she didn't like how our lawn looked with the green spots...\n\nWhile the HOA agreed this was not her business and definitely not theirs, I decided she was right and we should stop letting our dogs out in the front to pee as I also don't like the green spots. Now, I put them on the leash and let them do their business in her yard (read: tree lawn). And I'm clearly not the only one as her entire yard is now COVERED in pee spots and dead spots on her actual lawn which my dogs don't step for on. I'm pretty sure she's complained about everyone with a dog, and now the entire neighborhood takes their dogs to her yard.\n\nThe best part, she actually does a shit job taking care of her lawn, weeds and crab grass everywhere, she just waters it almost non stop. So today I got to report her to the HOA for her yard looking like total shit. If it were any other house (there are much worse) I wouldn't care at all, but this lady wanted lawns without spots so I'm just doing my part to enforce her rules...\n\nEDIT : to everyone hating on HOAs - they're hit and miss for sure but in this case THEY didn't do anything but tell me someone complained and then tell her I wasn't violating any rules and they weren't going to be involved... Also, HOAs are often surprisingly easy to take over, you just have to skip the whining about how terrible they are and do the work instead. If the HOA is that bad, talk to some neighbors, tell them you're going to run for the board, and get them to vote for you. Then, help others do the same... and remember what you hated about the previous board. Be forewarned, everyone finds a reason to complain, no one is will to help out...\n\nEDIT 2 : for everyone about green grass from dog pee... Urea -> ammonium -> nitrogen for plants... If you don't water it stays concentrated in one area, killing the grass. If you do water (or just spray the spot with a hose quickly) it's diluted and gives the grass a big boost of \"organic\" nitrogen fertilizer",
        "permalink": "/r/MaliciousCompliance/comments/p7vud9/neighbor_complained_to_the_hoa_about_my_yard/",
        "comments": [
            "I could not imagine getting to a point in my life where I gave the slightest fuck about how someone else's grass looked. People like her need a different hobby.",
            "This shit is why I made sure to not buy a house with an HOA.",
            "These HOA things sound mental. I’ve heard so many crazy stories about them and am glad we don’t have them in the UK. I think I’d end up killing someone for telling me how I have to have my own property that I pay for.",
            "Mowing 2x/week?! I get mine done every 2 weeks and it is a little shaggy by then, but I would consider that to be the normal mowing cadence for the majority of yards in my area.",
            "Am I the idiot? My house runs alongside an access alley. I weed my side of the alley regularly since if I leave it a week or two then I have about a metre of weeds against the side of my house.\n\nNone of the 20 neighbours whose properties back onto the alley bother to maintain their boundaries and hence the alley is a metre or so narrower than it should be. This means that when vehicles access the alley they manoeuvre as close as possible to my house.\n\nDo you think if I cultivate a particularly tough and scratchy piece of vegetation they will swop sides?\n\nCan anyone recommend a plant (one that does not damage foundations/brickwork etc) but is resilient enough to deter trucks and vans?",
            "Since when does dog urine turn grass green?",
            "Just a tip: A natural way to repair yellow spots in the grass caused by the dog's urine is to dissolve a cup of baking soda in a gallon of water and pour on the affected area. The baking soda neutralizes the high nitrogen concentration, and it will also deodorize the area so the dog won't recognize the spot and go there again....",
            "I'm failing to see the malicious compliance in this story.",
            "See as someone from the UK I find this whole HOA stuff utterly insane.",
            "Keep a notebook on when you mow, water and so on. If you can show a continious cycle of this, it shows that you take care of it. \n\nI hate mowing the lawn, so I went to my local buy/sell page. Bought an older robot mower. Paid about 100usd for it. Have had that running for 3 years now. 3 times pr week. Look into that, and forget about mowing at all!",
            "HOAs sound like absolute horseshit. It's my property which I bought and own so I should be able to do what I want with it (within reason obviously).\n\nI somewhat understand if it's a shared building but I live in a block of apartments and as long as we don't change the external windows or doors, the maintenance company don't give a shit what else we do. Some people have decorative rocks outside their doors, some have small potted plants or hanging baskets and I have a bench. If I owned a detached house then there's nothing I have to adhere to other than planning permission.",
            "We also have a next-door Karen. Our home is currently under construction. Never even met our 71-year-old next door neighbor, but so far she’s complained incessantly to the HOA about the construction noise, accused the Hispanic roofing crew of “making her uncomfortable” simply for standing on the roof doing their jobs, and come onto our property with a gun to threaten the workers. She took pictures of a work truck entering the site five minutes before the permitted time, which resulted in us getting fined $250 by the HOA. Dumb b*tch has made our lives miserable for months and we haven’t even moved in yet. Can’t wait to report her stupid yippy dog to animal control.",
            "Frankly, if I had a kid in his 40s still living with me I'd be grumpy too.",
            "A HOA near our town had like 3 karens on the board that would just vote themselves in every year.  So some people finally got pissed and ran for the board, and won because they just showed up with 20 neighbors and out voted the karens.  Their first action was to change the bylaws to just follow country rules, dropped fees to just over minimum to handle common areas, then changed the voting structure to require a quorum of 51% of the voting block to be present to vote in any new bylaws.  So in essence  you're going to have to get 140 homeowners to show up on a tuesday night to vote in any new rules.  That's not going to happen. \n\nThe three board member dudes just sit around drinking on their meeting days, and laughing at the complaint letters that come in, and sending out form letters that say, not in our rules, call the county code inspector.",
            "These HoA's are the best representation of America. You can do whatever you want until someone else thinks it costs them money in the long run.",
            "What was the malicious compliance?",
            "When you buy a home within the jurisdiction of an HOA, you kinda make your own bed unless you have the endurance to dismantle the whole thing.  Become the president and legislate chaos! \n\nAnd let the Ms.Langstrom’s of the world gnash their teeth and wrong their hands at the carnage and bedlam they created!!!!",
            "Lawns are such a dumb concept anyway",
            "...I will never understand American obsession with lawns.",
            "I don't really see how \"I let my dogs piss on someone else's property\" is something for you to be proud of tbh.",
            "Wow, you both sound awful",
            "Mow *twice* a week...\n\n\nMow *once* a week...\n\nHere I am, mowing bi monthly ( every second month not twice a month)",
            "Our neighbor has reported us to the actual police department for water stains in the public alley. God help us all.",
            "Wait your dog pee promotes grass growth? Mine... Makes a brown patch of dead grass...",
            "I just don't understand. Why are people so obsessive and anal about grass?",
            "My buddy and his gf moved into a nice older, 2 story, 4 unit home. They applied for the one open unit and got accepted undo the condition one of them serves as President of the HOA… I said oh boy. Luckily for them, everyone living there (maybe 8-10 ppl total?) was young professionals and the President title got passed on every year as more of a formality to keep things from getting static. I think it was more like “the new guy has to deal with the city since we live in classic downtown” kind of hazing.",
            "As someone who lives in the UK I really don't understand how in the land of the free you have people mandate how often you cut your grass.\n\nThats just wild.",
            "You have become the Karen",
            ">Now, I put them on the leash and let them do their business in **her** yard\n\nHow the fuck is this compliance?\n\nNobody asked you to do that.\n\nYou're just being a shitty neighbor because you've got a shitty neighbor.",
            "[deleted]",
            "You mow twice a week? Yikes!",
            "This doesn’t sound like malicious compliance so much as middle age in a neighborhood and it’s an HOA. I just assumed these kinds of things were just normal drama.",
            "Should also report her for using too much water if you’re in a part of the world that is drought prone…",
            "Lawns are so fucking stupid in the first place. \"let's use up the majority of our property caring for this useless green shit\". This is by far the worst part of homeownership.",
            "French here, I see a lot of post about problems with HOA (which I assume is homeowners association?). I just have a simple question, how come does a HOA have anything to say about the general state of a yard or anything else ? What is their purpose ?",
            "To this day I still don’t understand the benefits of HOAs...  All I see are horror stories about power tripping retirees trying to control their neighbors.",
            "Always be nice to your neighbor until they are not nice to you. Be the good neighbor and you will get good neighbors. Be the bad neighbor, and you get a yard covered in dead grass from dog pee.",
            "I’ll be dammed if I ever let a neighbor tell me how to live in my own house.",
            "You know, as far as HOA’s are concerned, this one sounds pretty good. \n\nIt seems filled with people who are serious about their job, yet aren’t absolute cocks about it and are kinda reasonable.",
            "One-up the game and begin peeing in her yard yourself.  Wait to see how long the other neighbors take to join in.",
            "lol a fucking hearing over somebody’s lawn\n\nSuck my balls im not living anywhere with an HOA",
            "What is up with suburbanites and lawns? I moved into a rental home a few months ago. The lawn was trash. I've been fixing it up, and one way to do so is to let it \"grow wild\"... long grass, seeding itself, and just target weeds. Aside from a few weeks, I keep it fairly well mowed.\n\nI have a toddler that loves to play with the little boys next door. They are sweet boys, but the parents have forbidden them from coming over into our yard to play. They tell them that they are \"allergic to grass\". I have seen no evidence of this, I'm very certian they simply don't want them to play in my yard.\n\nCrazy people.",
            "“Skip the whining and do the work instead.”\n\nSounds awful - I d rather whine.",
            "I am a college student living in a house me and several friends are leasing. The house literally borders campus. Our neighbor, however, finds as many reasons as possible to call the police, the city, or harass us in other ways. Weeds in our backyard too long for her liking? We will get a notice from the city code enforcement division to remove all the weeds (in our own backyard, which is fenced in.)  She most recently complained that we didn’t “rake” our grass after we mowed it, and these grass clippings “clogged the drain at the end of the block.” She claims she stood in “15 inches of water directing traffic.” It only rained 2 or 3 inches. We can’t even exist in our own front yard with 5-6 people and a small, fairly quiet speaker or the police will show up (she cites a city code  about speakers not being audible from beyond the bounds of the property.) this is ridiculous because you cannot even hear it from her yard. She goes out of her way to be annoyed with us time and time again. Like, you literally live on a college campus. It could be a lot worse. We never throw parties or have excessive noise or anything yet we deal with the cops and city frequently despite there being 100+ person yard parties a block or two away. Some people are just miserable.",
            "As someone who works with HOA's I can tell you this is how 99% of complaints/violations work: everyone is complaining because someone else complained about them.  It's an endless cycle.",
            "I belonged to our condo’s HOA board. Condos were in a historic 1890’s silk mill. It was interesting. Fees had constantly been going up every year. I asked the treasurer if anyone was behind, and lo and behold, the resident in the unit beside the treasurer had not paid his fees for 3 years. He was almost $4,000 in arrears. WTF. It was a mess getting the funds from the guy. And needless to say the treasurer resigned.",
            "One thing to note is that cutting your grass once a week is already too often, stops the roots from growing deep and causes the grass to go craggy and shit after a while",
            "Fun fact: Properties with HOAs tend to grow in value *slower* than properties without an HOA, contrary to developers’ claims! \n\nWhen my wife and I bought a house, an HOA was almost an automatic veto on the property. We didn’t want those restrictions, didn’t want drama, and didn’t want neighbors who were into that kind of thing, either.",
            "r/FuckHOA might like this",
            "Dog nutter behavior.  Don’t see any malicious compliance.",
            "My HOA isn’t too bad. They usually leave me alone, but some of their projects are fucking stupid.   \n\nOne thing I’ve learned though is when you have something like dead grass due to broken sprinkler lines, save every email and pic.  They tried coming back to me to repair a couple thousand in grass repairs due to dead grass, and again when they replaced it in 100 degree weather, in a drought, without increasing sprinkler run time, AND I was out of town and not notified.  \n\nNot only did I politely tell them fuck right off up the Lollipop Trail, I included videos of their undocumented work crew skipping half the grass needing to be replaced, and asked if all vendor employees had been properly vetted for US employment eligibility.  \n\nI was rather promptly informed there would be no charge for the two sod replacements and that I’d be notified by phone and letter if there was to be another replacement.",
            "What is HOA?\n\nAnd where is this fascist dystopia where you can't even live your own life in your own property?",
            "Word of advice to anyone looking to buy, do not buy a home in an HOA neighborhood. If you want Karens and stupid bullshit, that's how you get Karens and stupid bullshit. HOAs are a HUGE detriment to home values unless your a boomer or a Karen. You can't do what you want, the neighborhood is a geriatric den of Fox News guzzling racists, and you have to PAY to enjoy the Karens and boomers.",
            "Imagine being such a shitty person the HOA is not the villain in this story lol",
            "Wow. Your neighbor has a Karen living next door to her.",
            "HOA is an exclusive American concept that doesn't exist anywhere else in the world that I know of.\n\nWhile I understand the conceptual benefits of a HOA and in some cases actually be a force for good... It is used often as a tool by select members to abuse people they don't like.",
            ">made an effort to mow twice a week\n\nNope, fuck that, not happening.",
            "Wait, in America you're somehow legally obligated to mow your lawn every 20 minutes?",
            "[https://www.planetnatural.com/organic-lawn-care-101/history/](https://www.planetnatural.com/organic-lawn-care-101/history/)\n\n&#x200B;\n\n[https://blogs.scientificamerican.com/anthropology-in-practice/the-american-obsession-with-lawns/](https://blogs.scientificamerican.com/anthropology-in-practice/the-american-obsession-with-lawns/)\n\n&#x200B;\n\nFuck a lawn",
            "I'm told seeds for obnoxious plants are cheap by the handful. I love biodiversity. :)",
            "What the hell is a HOA and why the hell should someone tell me how to keep my garden??? What the fuck guys",
            "If I pay money to own property you better believe I'm gonna put up decorations and shit which means fuck HOAs.",
            "Were I live outside of Dallas almost every neighborhood is an HOA. Especially new construction. We got bitched at once for having our garbage cans visible. The horror! Other than that though they left us alone. They are not super strict. I would love to live without one but it’s not easy to find a house around here that isn’t in a HOA.",
            "If it wasn't this challenge in life, it would be something else. When you clear an obstacle that means you're just opening up room for another one. That's life, the struggle.",
            "Ours was a little annoying, but since everyone wanted to bitch and no one wanted to volunteer, my wife just ran unopposed and got on the board of trustees.  The noise was gone almost immediately.",
            "I would never buy a place attached to a HOA. If I wanted a bunch of rules and people governing over me I would’ve continued renting…",
            "> she just waters it almost non stop\n\nWater... your lawn?  I've never understood this.  If you're in a place where you need to water your lawn, you're probably in a drought and thus legally can't anyway...",
            "I WISH my neighbor had a shittier lawn, just to make mine look better by comparison. I hate my neighbor's perfect lawn.",
            "I like the shitty looking yards.  Makes me feel better about myself.",
            "Dog piss does not turn your grass bright green and make it grow fast, it kills it.",
            "I find it incredible you can actually get penalized for having your lawn unmowed.",
            "ESH… oh, sorry. Wrong sub.",
            "Why do people move into areas with HOA’s?",
            "As a brit the whole idea of a HOA is beyond confusing. It's my house, I paid for it with my money, why should anyone else have a say in how my property looks?\n\nI understand (to a point) from a property value perspective, but other than that I don't see the ideal.",
            "Let’s buy a house with HOA fees, sounds good to me!",
            "HOA’s are hilariously white collar.",
            "I have one (HAD)\\* who would corner you at the car on the way to work in the morning (why not, she had nothing else going on in her life) and make some comment about your lawn or your grass being too high. At that point you were supposed to IMMEDIATELY blow off work and mow the lawn instead of going to your regular paying job. I had a lawn service who came every other week like [clockwork.](https://clockwork.No) Big surprise! They came Thursday, she bitched on Wednesday so like a cat trying to manipulate getting fed, she believed that her bitching is what got the lawn mowed. It didnt. \n\n(\\*I moved. She wasnt the REASON but she was definitely on the list.)",
            "She sounds like the kind of psychopath who would put poisoned hot dogs in your yard for your dogs. I would be cautious around your yard and around her, but I hope things work out in your favor.",
            "A good tip that works for us, when you give food to your dogs put a  little bit of yogurt on top. It helps with preventing them from decoloring the grass\nGood luck !",
            "Never pay the mafia",
            "If I wanted to keep playing high school games, I'd join an HOA.",
            ">EDIT : to everyone hating on HOAs - they're hit and miss for sure but in this case THEY didn't do anything but tell me someone complained and then tell her I wasn't violating any rules and they weren't going to be involved... Also, HOAs are often surprisingly easy to take over, you just have to skip the whining about how terrible they are and do the work instead. If the HOA is that bad, talk to some neighbors, tell them you're going to run for the board, and get them to vote for you. Then, help others do the same... and remember what you hated about the previous board. Be forewarned, everyone finds a reason to complain, no one is will to help out... \n\nGet a majority of the board and dissolve it",
            "After a lifetime - literally - living in places with HOAs, my husband and I bought a house in a non-HOA community last year. Let me tell you, the number of complaints I have about our neighbourhood is.... zero. None. No complaints. Yeah there a few houses with plenty of cars, but no one has a rusted junker in their yards or anything. The nighbourhood is awesome and the people are friendly and everyone's dogs like to play together happily. Our yard is mostly moss so we pay it little mind. So much more content without one!",
            "I hope you all then complained to the HOA about all the bright green spots on her lawn.",
            "You must have a superdog or you are doing some amazing diet management. You say that your dog peed in your front yard and you have patches of overgrown grass. Yet when the same dog peed in her yard, the grass died there. How?",
            "Five years ago I moved from an HOA that charged ~$1000 per year. The only perk I knew of we garbage pick up. The PGA level golf course, marina, pool, clubhouse and tennis courts were extra. They also charged you yearly for the tag to enter th community, paved the roads only once in 15 years (the length of time I lived there), snownplowing was spotty, especially since the drivers had a side for  (with HOA property) to plow non HOA neighborhoods for a fee. Reported with proof and was told to stop trying to cause problems. Everything on the exterior of the house was controlled and even doing repairs/ maintenance required a $50 application fee and approval. Can you guess why I detest HOAs? \n\nAnd yes, I did try to join the board and change things from within, but the board was rum by those who could afford the million dollar homes on the lake. Guess who threw money around to win and who didn't have that kind of capital?",
            "When a neighbour complaint is so bad the HOA side with you",
            "You can report someone based on how their front yard looks? That's so first world lol",
            "Finally someone understands HOAs",
            "Shouldn't be cutting your lawn so often it isn't for biodiversity. Once a month if that.",
            "My HOA covers the maintenance of all outside areas. If it didn't, id be like, \"wtf am I even paying for?\"",
            "I dont understand people who choose to buy a house with rules. I think people who go to an HOA have a fetish of being bossed around.",
            "Everybody is always quick to bitch about HOAs without looking into any of the positives, or even bothering to consider when one could be a “good” investment. I live in a small, secluded suburb in the country that’s main housing network is a bunch of attached townhomes, usually 6 per “block”. My HOA takes care of all lawn work, trees/flowers, removing snow and ice in the winter, repaving of roads, roof repair, deck maintenance/staining, etc… I’ve been living here for 2 years and have never even seen anyone associated with the board. My HOA fees are $200 a month, which I consider a small price to pay for all the stuff they do through the year that I don’t have to waste my time/money on. Also it’s nice to know I’m supporting my neighbors in the event something happened to their homes. We just had multiple blocks need a roof repair, which out of pocket would have cost these people thousands of dollars, all of which was done for free using our dues. My HOA dues, mortgage, taxes, and utilities all come out to less a month than a single months rent would be in the city for a two bedroom apartment that is half the size of my townhome. I live in a well manicured area, with tons of green space, and my property value has gone up nearly $20,000 since I bought it. Best investment I ever made. The best thing you can do is your own research into a community, call and ask for their community guidelines, talk to neighbors if you’re considering moving there, etc…. Don’t miss out on a perfect place to live because of some Internet stereotypes/ echo chambers.",
            "Sorry but this belongs in /r/AmItheAsshole , I don't agree with your neighbor at all but taking your dog to do its business in her yard makes you no better (and quite frankly worse) than her.",
            "Why would ANYONE buy a house with an HOA? Unless you're doing something extremely dangerous or incommodating, no one should be able to manage what you do on your property... Jeez.",
            "This definitely went a different way than I expected, but I always love some poetic justice.\n\nAlso, PSA: If an HOA is giving you too much shit for a change on your property, get a HAM radio license and install a radio tower in your yard. It's a federal law that every citizen is allowed full access to the radio, so they can't stop you and it'll be a good bargaining chip to get them off your back.",
            "I get the sense that people who buy into HOA's haven't ever resolved their elementary school issues.",
            "Why in the ever-loving fuck do people live in areas with HOAs, aside from the obvious reason of why they were created in the first place...",
            "This is why I will never live in an HOA. Never have, never will. My money, my house.",
            "That's some petty shit to bring your dog to pee on her lawn. Who's the bigger man here? Nobody.",
            "Mowing twice weekly!? Fuck HOA",
            "I don't go about trying to force people to maintain their lawns to my own standards, but if I saw you letting your dog piss on my lawn, I'd poison my grass.",
            "[removed]",
            "God damn i would become an arsonist if i lived in one of these things.",
            "If I ever looked at buying a place that had a HOA I would ask for a reduction in Price based on 20 years of HOA dues and maintenance.",
            "This is exactly why I refuse to move into ANY property covered by an HOA.  The original intention was likely good but you never know when a nosey busybody with nothing better to do than tell you how to maintain your property will make life hell for you.  We don't need to codify, \"don't be a dick,\" into a formal, binding contract.  And if you feel we do, then maybe you're the problem...",
            "Home Owners Associations are a fucking menace.",
            "lawns should not even be a thing",
            "In fighting Karen you’ve become Karen",
            "You couldn’t pay me to live in a HOA",
            "I like how your defense of HOAs is that, sure they're a bit annoying, but what you can do is take that minor annoyance and feed it your entire life. You are the HOA now. Everything is HOA.",
            "Dude, your explanation of how to win the HOA is exactly why HOAs suck",
            "The bright green patches of grass are not from where your dogs pee...those are the brown spots...I'll let you contemplate grass, fertilizer and the like too figure out the green spots..\n\nEdit for your edit: thats not how that works..."
        ]
    }
]