[
    {
        "post_id": "hwsxze",
        "author": "toastisuseful",
        "title": "'Give us more money or we'll evict you' Go ahead",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hwsxze/give_us_more_money_or_well_evict_you_go_ahead/",
        "score": 16094,
        "num_comments": 445,
        "created_utc": 1595555572.0,
        "selftext": "A few years ago my best friend and I rented a tiny 2 bedroom flat together. This place was kind of terrible; my friend's room had a hole cut into the wall so the last foot of the bed would fit (this became a 'mantlepiece' in the next room), the kitchen was the size of a child's playhouse kitchen and the upstairs neighbours spent all ours of the day and night screaming at each other or having loud sex. BUT, we were mostly happy because we were over living with 6+ other people. We paid £75 a week each + bills for this place, which was pretty standard for a 2 bed flat in our area.\n\nThen 6 months into our 1yr contract the landlord sold the terraced house our flat (and 5 others) was a part of to a middle aged married couple who were first time landlords. They were the kind of people who thought they were smarter than everybody else and I got the impression they thought property management was going to be the easiest thing ever.\n\nWe had no problem throughout the sale process, we were assured nothing would change, we didn't interact much with the landlord before anyway. Then 2 weeks after the sale we got an email from the couple saying that we owed them £20 each more a week. Basically, in our contract it stated our rent was £75 each a week about 10 times, but there was one typo where it said our rent was £95 each, so they said they could legally charge us £95. We laughed at this, but when it became clear they were serious we reached out to the letting agent and got them to put in writing that it was a typo, our rent was always £75, and they even gave us the original advert for the flat with the correct rent on it. We thought this would be the end of it. We were wrong.\n\nThe couple insisted on coming to our flat for an in person meeting. When they got there they said that they asked the old landlord about it and he was shocked that we'd not been paying enough for 6 months now and the rent was always £95. I didn't buy this because they had nothing in writing, but I made the argument that OF COURSE he would say that because he wouldn't want it to seem like he sold under false pretences, and if we'd been underpaying by a total of like £160 a month why had he never spoken to us about it?? They said that he was a busy guy with too many properties, then the husband spent ages condescendingly explaining mortgages to us. Then they declared that if we did not start paying them the higher rent, they would evict us and we had 24hrs to pay or 30days to get out and they left.\n\nHonestly I think they saw two 22yr old girls and thought they could scare us into paying more money. What they didn't know is that my friend and I are very pleasant until you piss us off and we become vindictive motherfuckers. We decided that night that if they wanted to evict us from this shit hole we were gonna make them do it properly and if they were so pedantic about contracts and rules we were going to stop letting ANYTHING slide.\n\nThe couple woke up the next morning with an email from our lawyer (my flatmates brother, a bored lawyer with time on his hands) requesting a formal eviction notice in writing and laying out a record of last night's conversation. Thing was they didn't actually have legal grounds to evict us because even if we went to court and a judge favoured their interpretation of the contract (we were advised this was unlikely) we still didn't owe them more than a month's rent, which would have been their only legal way of evicting us because we were otherwise great tenants. By 9:15am they were ringing us, but we ignored them and emailed that our lawyer had advised us to only communicate in writing.\n\nWe then sent an email informing them that the fancy new front door they just installed could not be unlocked from the inside without a key, which violated fire safety laws and unfortunately if this wasn't rectified ASAP we would have to report it. We then sent texts that showed them repeatedly entering our flat with less than 24hrs notice, and did they know that this was illegal? Maybe we should talk to the other tenants because if they're doing this to everyone then this could be quite a problem...\n\nAfter about 3 days of this we received a very nice email saying that they don't agree our rent was supposed to be £75 each a week, but they would graciously allow us to finish out our contract at that rate. By this point we'd found a flat triple the size for £80 each a week and wanted out of that hamster cage, so we offered to move if they signed mutual surrender forms. They eagarly agreed. \n\nThe best part was that they stubbornly tried to rent that flat at the higher rate, despite us telling them it was a terrible idea, and the flat was empty for over a year. And because they had agreed to end our contract early they got stuck paying the council tax, not me!",
        "permalink": "/r/MaliciousCompliance/comments/hwsxze/give_us_more_money_or_well_evict_you_go_ahead/",
        "comments": [
            ">Maybe we should talk to the other tenants because if they're doing this to everyone then this could be quite a problem...\n\nMy vindictive side hopes you did that when you left",
            "As I was moving out of my duplex, my landlord looked in the window - saw a mess of boxes, bags, papers and shipping supplies and told us we were “messy” and she was raising our rent $200-300 more a month. She said we could pay that or leave.\n\nI told her we would be out by the end of the month.\n\nCome the end of the month, we are out and even shampoo’d the carpets (didn’t have to).\n\nThe landlord dragged her feet and said she was keeping our deposit because of a laundry list of damage to the duplex.\n\nI emailed her back with a slew of photos of said damage on the day we moved in and told her that if I didn’t see my security deposit, in full, I was taking her to court.\n\nGot it 2 days later.\n\nI made a point to print out a dozen copies of the “Landlord Tenant Act” of my city, highlight all the areas she had tried to screw us over (the last few years) - then I took those booklets, looked up her properties online - and gave a copy to each of her tenants.",
            "In college our landlord tried to renew a lease and increase rent by $100 and they did so without proper notice; less than 30 days. A week after sending us the new lease they called to tell us they had mistakenly sent us that lease agreement and were not going to continue the lease and we had to leave on the last day of our lease. We immediately checked with a lawyer and were told to just send a check for the original amount and a letter saying we were staying. They retaliated by sending a pay or quit stating we had underpaid. Our lawyers very quickly pointed out they hadn’t given enough notice to legally raise rent. So they send a new notice of rent increase. Our lawyers then pointed out that they couldn’t legally raise rent if problems reported by the tenants had not been fixed.  Unfortunately for them we had six major issues that had been reported but not fixed. At the same time We sued our landlord for not fixing the issues in a timely matter.  So they fixed the issues and attempted to raise rent by a huge amount. The issues were pretty substantial to the point of us needing to stay in hotel rooms for days to be fixed. Our lawyers then informed our landlord they couldn’t raise rent in retaliation for legal issues. Their lawyer agreed but stated we needed to start paying the previous increase in rent now that the problems were fixed. \n\nMeanwhile our lawsuit was in remediation and the landlord wanted us out. We wanted basically a half a year of rent back for having to live in a house that should have been condemned prior to the fixes. They wanted to give us half a month of rent then a full month and then finally agreed to a third of a year. The best / worst part is that the landlord sold the house for a fraction of what it was worth in attempt to make it someone else’s problem. She only agreed to pay us close to what she wanted because the clause in the sale agreement stated it needed to be a empty house. In the end the house ended up selling for almost double just a year later. \n\nIt was fucked up because had they just talked to us face to face we could have settled the matter and both come out on top but instead the landlord took pennies on the dollar just to protect their pride.",
            "One thing you learn pretty quickly as a landlord, is that there's a BIG difference between a small amount of rent per week and a vacancy.",
            "Do renters have to pay the council tax?  How much is it yearly?",
            "I'm so glad you had the help of a lawyer! I once got robbed 600€ from my deposit for absolutely no legal reason whatsoever, but had to let it go because fighting in court over it would have cost much, much more. Therefore I am extremely happy every time I hear about shitty landlords and ladies get put back to their place, so well done and thank you for sharing your story!",
            "Get the feeling your new landlord had been watching too much of 'Homes Under the Hamme'r?",
            "They saw girls, but were dealing with women. Well played toastisuseful! (OP)",
            "A while back my wife and I were looking to move into the Chicopee village (unincorporated area of North Georgia). I was set to buy but my wife wanted to rent for a year first, smart move. We found this house for rent, two bedroom, one bath, 1k sqft, on .16 acres. The home was built in 1909, single story with a root cellar and had a two bay detached garage out back. Through the house was valued at $87k, the guy rented it for $1100.\n\nWith the intention of buying it, we fixed up the old building, at nominal labor rates, and submitted receipts to deduct from rent.  At the end of the lease I was ready to buy (and cut our rent down to a $600 mortgage). However the home inspection did not go well. The house failed for wiring, plumbing, broken sewer line, sagging foundation, and rotting supports. It didn't even have good bones. We let the land lord know, and offered $67k as is, or $87k once fixed. Mind you, this house was technically no longer legal to occupy. \n\nThe land lord refused our offer, so we resolved to rent it for another year while we looked elsewhere. However, due to code violations it would have to be fixed before being rented. The land lord tried to raise rent by $200. At that point, we bailed. Went to live with g-ma for three months while we closed on our new home. A year later my stimulus check was sent to the wrong address, so I elected to drive by the old place and ask for it. Fortunately I didn't have to ask because the house was still vacant, and now condemned.",
            "People don’t realize how fast a vacancy kills a higher rent.\n\nIn your example, your flat cost 3900 a year and they wanted 4940 a year.\n\nBy trying to earn an extra 1000, they actually lost 3900. Ouch.",
            "Is it common in your country to pay by week?",
            "I've a few rental properties in nice-ish areas (used to be a bit ghetto, but is gentrified now) and rent below market value. Purely because the rent in each place is over $1K a week and a few weeks without tenants means you loose that money you would make with the higher rent. \n\nI've happily done renovations for them, allowed them to put holes in the wall to hang shit up, had their gardens landscaped, put solar panels in and rain water catchment tanks for watering the garden (one couple is big into environmental stuff so I roll with it). Basically these people let me renovate the places while they live there meaning if they do leave the places are top notch and can be instantly put to market with a few hundred more each week. \n\nThe idiots who try and nickel and dime people wringing every last cent they can usually screw themselves over. In Australia our housing prices are through the roof, so each year that goes by, my houses are worth more and more and I don't have to pay a cent towards them.",
            ">when you piss us off we become vindictive motherfuckers.\n\nWell you know what they say, “hell hath no fury  to a woman scorned”",
            "My uncle let my sister and my cousin live in his 2000$ 2b/2ba apartment near their work for 500$ each. It was the most beautiful family setup ever, they had a great place with parking and ammenities and it was perfect.\n\n2 months down the line my uncle gives them a letter saying hes raising the rent by 400$ each so now theyre gunna pay 900$ each lol.\n\nThey moved out of that motherfucker so fast and cut ties with his garbage face.\n\nFun fact is now he has had no one living in that apartment for over 2 years because 1. hes a shit person and cant talk to people. and 2. pandemic hit and he for sure cant do anything.\n\nJust a total fuckshow and a constant reminder that you reap what you sow.",
            "This is beautiful. One of the best malicious compliance stories I've read in a while!",
            "As an American I would politely like to ask, what the hell is a council tax? Thank you.",
            "£75pw????? Where do you live I pay £200pw plus bills and am just happy I have a roof over my head. But then again I live in London and make bad life decisions",
            "UK landlords really are a special breed, aren't they?\n\nI can't believe that they stubbornly tried to let the flat at the higher rate, whilst still having to pay off their mortgage, utilities and council tax for a whole year, instead of just biting the bullet and dropping the price and at least making \\*some\\* money from having the place occupied.\n\nThey think they're smarter than other people because ''muh investment'' and then go and show that they don't even have the slighest idea how markets work. Supply and demand, my dude.",
            "I hope you reported that door violation and anything else you found anyway after moving.",
            "If anyone from the UK is having grief with tenancies and landlords talk to [Shelter](https://www.shelter.org.uk/) who will tell you the law around possession and tenancy agreements.\n\nSeveral things you can do if renting through shorthold or assured shorthold tenancies: \n\n* Change the locks - doesn't matter what tenancy you have unless you're in a listed building - if you keep the old ones and cause no damage you are within your rights to do this if your landlord is not giving you 24 hours notice - even if they aren't and you want better security for your insurance you are allowed to do this as long as you give the old locks to the landlord\n* Rent arrears - a landlord can only start possession proceedings if your rent is in arrears by 8 weeks or 2 months - if your tenancy agreement states payments in weeks its the first one if months its the second one - if your rent was £500 per month if your were £999 in arrears they cannot start proceedings for possession even if they do and you have the court date if you get your arrears down below the limit the judge will throw it out.\n* Notice to quit - if they bring the tenancy to an end you have 2 months to vacate (dependant on tenancy agreement)  - discuss with the landlord and if they are amenable don't pay rent for that time to save your deposit for the next place - the debt becomes a non-priority one once you leave the property - even if legal action is taken the court looks at what you can afford not what they want\n* Tenancy deposit - it is law that your landlord should lodge your deposit/ bond with a [deposit scheme](https://england.shelter.org.uk/housing_advice/tenancy_deposits/tenancy_deposit_protection_rules)\n\nHope this helps someone in future",
            "Stories like this make me _really_ want to become a landlord one day. Just so I can... not pull any \nshit like this, and there’s one less evil landlord in the world and lots of more happy & housed people as well.",
            "Fun fact, that I'm sure your lawyer friend was aware of and informed you of, is that the person responsible for the language in a contract will receive a negative ruling if there is any ambiguity (basically you wrote it so if it works against you that's your problem).\n\nSo yeah based on that principle alone, you would win.",
            "Just well done! I wish more people would exercise their rights against landlords",
            "This is easily the most beautiful rental revenge story I have read yet.",
            "It boggles my mind that you can find a place that cheap. I'm the NYC metropolitan area and anything short of 800 USD/month means you'll probably be murdered by the landlord (/s)",
            "r/badlandlords",
            "Do apartments typically rent by the week where you are?",
            "That's awesome. Well done.",
            "Hell ya this was a good read. Really pisses me off when people get away with that kinda shit",
            "Was this house legally converted to a H.M.O.?  If not you could have reported them to the council.\n\nDo you ever watch \"Nightmare Tenants, Slum Landlords\" and/or \"Can't Pay? We'll Take It Away!\", they often show illegal lets, someone rents a house, renter then does some bodge job diy splitting the rooms into individual lets, then renting out these rooms",
            "Hey, just curious, but why would tenants pay the real estate tax? Is that customary in the UK? It’s usual in a commercial lease here in the US, but not residential leases.",
            "Weekly rent sounds so annoying, but good on you for not letting these new landlords walk all over you OP.",
            "£75? Was your housing subsidized or is it always that cheap",
            "I’m blown away. You lived in this tiny shit hole with over 6 people? Or the building had over 6 ppl...",
            "Seeing shitty landlords and letting agencies always brings a tear of joy to my eyes. I leave my flat of four years in three weeks and cannot wait to rain hell.",
            "...council tax? could you please explain what that is to a dumb 'Murican?",
            "What is council tax? And why would they have to pay it instead if you?",
            "I’m always amazed by how cheap rent is outside of major cities. I honestly thought £75 was a typo and you meant £750 until you gave the further math of how much extra per month they wanted.",
            "Epic! Pure and simple",
            "How would paying the lawyer work in this case?",
            "American here. What’s council tax? I looked it up and it seems to be similar to property tax... but I’m still not entirely sure.",
            "When people have issues getting deposit cheques back from Landlords.. Is it possible to just call the bank and cancel the original cheque? Since it's a deposit it can't be cashed anyways until the end of rental agreement... So just when they go to cash it, they find out is been canceled. \n\nMaybe I'm looking at it the wrong way but seems like the easiest way to ensure you get the deposit back.",
            "£75 split 6+ ways still sounds expensive for as terrible as it was. Glad you got out",
            "Omg gold",
            "My soul needed this. 😌",
            "A similar situation occurred to me and my (now) spouse. The major difference was that we had upstairs neighbors who tried to break into our apartment to attack us. Regardless, when I saw you mention that you ignored the phone call and responded that you would only communicate in writing, I smiled.\n\nA lot of people don't realize how important this is (especially in tenancy disputes), and they get screwed over by bad faith verbal agreements.",
            "my landlord once asked for too much money so i shoved a gerbil up his ass through a tube",
            "I’m just wondering where in the world you can pay this little for rent. Is the US that messed up that $1000-1500 a month is normal for here??",
            "Landlords are parasitic scum which produce nothing of value. Mao had the right idea.",
            "You must have been renting in London for the property to cost £450 per week! Horrifying!",
            "Man I forgot Americans used to spell hour as our.",
            "All rent is theft. More rent is more theft.\n\nAt their best behavior, a landlord is neutral. There is no such thing as a good landlord.\n\nStories like this just show how correct those statements are",
            "Would they have to pay any council tax? From what I understood, council tax isn't taken on empty properties.",
            "What's the deal with English? It's called a \"flat\" even when it has stairs. \n\n(I get that the alternative is \"apartments\" even though they're all glommed together)",
            "You all need to move to Montana. Renting is pretty cheap here. We've been getting a lot of people from new York, California, and Texas",
            "So they wanted you to move out, and you moved out?  Cool story"
        ]
    },
    {
        "post_id": "pk7955",
        "author": "HereForTheJokes-13",
        "title": "Malicious compliance in the deli (and a Karen slapdown as a bonus!)",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pk7955/malicious_compliance_in_the_deli_and_a_karen/",
        "score": 16088,
        "num_comments": 321,
        "created_utc": 1631093970.0,
        "selftext": "I just witnessed the most beautiful piece of malicious compliance at my local supermarket. It has a deli counter where you take a paper ticket and wait your turn. There's a digital display that shows the next number, but when it's quiet, the staff often just serve the next person without advancing the number of the display and it gets out of whack. \nToday was one such day. I pulled ticket #87 and the display said \"29\". There were 2 people ahead of me at the counter, some guy who was apparently 85 and what turned out to be a Karen at #86.\nWhile deli girl is helping man #85, Karen launches into a tirade about the display being on 29, yelling at the young girl behind the counter that she was lazy and causing  confusion. I just rolled my eyes and threw a look of understanding sympathy to the girl behind the counter as she finished up with guy #85.\nWhat happened next was priceless. Karen sees #85 leave and launches into her order. Deli girl cuts her off with a saccharine sweet smile and says \"one moment please ma'am\", picks up the clicker for the display and clicks it over, and over, and over again until it reaches 86. It took quite a while. \nNeedless to say, Karen was pissed! She GLARED at the girl behind the counter the whole time, while I stood there with a huge grin on my face. And the best part? She couldn't even criticize,  because she was the one going off about it being wrong. \nAfter finishing Karen's order, deli girl tried to apologise to me for the delay. I told her she'd absolutely made my day! \nIt's not often you see service staff being able to deliver a customer service slapdown, but when you do, it's glorious to watch!",
        "permalink": "/r/MaliciousCompliance/comments/pk7955/malicious_compliance_in_the_deli_and_a_karen/",
        "comments": [
            "I would have sat there and called the numbers too. \n\n\"30?  30?  Anyone have 30?\"\n\n\"Okay, 31? 31?  Can I get a 31?\"",
            "That is priceless! I guess you could have complimented her to her manager saying something about how she is meticulous with her work!",
            "I was hoping she'd go to #87",
            "I would have clicked one number at a time and call that number out and wait about 20-30 seconds before clicking the next number, because well obviously I have to give each number time to react",
            "When I worked in a phone store 100 years ago, a customer had a massive go at me because apparently we hadn't answered the phone at some previous point. I apologised and explained that we were probably all with customers to which she said 'Well that's not good enough'. You already know what happens next - 2 minutes later the phone rings so I answer it halfway through serving her. She was so furious it made my whole week.",
            "...after advancing clicker to correct number, CSR went back to wash her hands, {for 20 seconds} while singing the alphabet, dry said hands and placing fresh gloves on her hands strugglingly...\n\nProceeding to customers waiting outside deli, counter girl looked at clicker and called off, '86!'",
            "If you see her there again, tell her she made my day too.",
            "hahaahahahahah i bet it made the girls day too! hopefully she has reddit and we can see her story in here as well.",
            "It's like the days when I used to work at a theater and we'd have to cook the foods, I'd tell the customers who order pizza and boneless chicken that we're not allowed to cook the two together cause the chicken (3 minutes) takes less time to cook than the pizza (5 minutes), most people would say \"that's fine I can wait\" than I go to place the chicken in (it takes 3 minutes to cook).\n\nAfter it's done I place the pizza in and hit 5 minutes before bring the chicken along with the sauce to the customer, they'll look at me and ask \"where's my pizza?\" I'll remind them that the pizza takes more time to cook so I'm not allowed to cook them together, but they are allowed to come back and I'll give them their pizza when its ready, most time they'll remain nearby or other times they'll go to watch their movie, than sort of forget for a bit and we'll put it in the heater to keep warm.\n\nStupid part would be when they do come back for it and complain that the pizza is \"cold,\" dispite the heater being very very hot, so hot the the pizza box when removed will be warm when held. Worst was when the customer demanded that we heat up the pizza for them, so the GM stuck it back in the oven for 30 seconds and the crust was extra crispy when she removed it.",
            "Your story is so much better than mine haha! I had a lady yesterday get so particular about her shaved meat where she wouldn't accept anything except what was literally meat dust, so I gave her meat dust. I wasted a good 10 minutes of her time. Even tho it was a small thing, it was oh-so-satisfying to me.",
            "I used to work deli and that is the best passive aggressive thing you can do. I also used to hate when there would be a huge crowd waiting and they would all stare. I figured out staring back is a major power move lol.",
            "Can confirm this is the best type of malicious compliance. I’m a former deli worker. The stories I have! My favorite is when somebody asks for something chipped. (Lunch meat that’s sliced very thinly.) normally it’s not an issue, but on a Sunday afternoon when there’s over 50 people waiting and somebody asks for chipped, I’m taking my frigging time and staring at the person as I do so. Be nice to your essential workers folks. They’ve all ready realized they don’t need to work for $8 an hour and these labor shortages are just the beginning.",
            "I would have done that, yes, but maintained eye contact with Karen whilst holding up my other hand in a please wait kind of gesture.\n\n\\*click\\* \\*click\\* dead stare \\*click\\*",
            "83... 84... 85...\n\nSorry, mandatory break time. Be back in 10 minutes.",
            "The numeric order wait list thing is not always a guarantee. I figured that out long ago. Definitely used to some lag in the display. I've seen people march up angrily in the past like your Karen did but never witnessed malicious compliance as in your case. That is so glorious. Thanks for sharing.",
            "You could've lied and said I've got #29.",
            "Is this the store where shopping is a pleasure?",
            "The only part of working in a deli that I miss is that my boss was pretty cool with us messing with customers if they were being dicks.",
            "I would've happily sat through that just so the system was working correctly again. I can't stand when people use these ticket things wrong.",
            "And I hope she stared into Karen’s soul the whole time without any expression on her face.",
            "I would have called the numbers a few times",
            "So good! Love it!",
            "Would have been funnier if she called OP over at 85.",
            "That's when I'm sad that she's working with food and has to keep her hands clean, because otherwise she'd totally be getting a high five",
            "She should have called 29 three times, clicked to 30 called it three, times all the way up to 86.",
            "Oops i clicked one to much, one more moment please, I've got to go around again.",
            "Was there a discard basket on the counter? You could have fished out an earlier ticket and gotten served before Karen :-)",
            "A couple years ago the guy behind the counter (I think he was like the actual deli manager or something) straight up ignored one lady who was being rude and entitled. Pretended like she didn't even exist. She was tapping her foot, hands on her hips, loudly declaring \"exCUSE me!\" and he just looked right past her to me and said \"help you, sir?\" And after filling my order of whatever it was I wanted, turned his attention to someone else. And the old biddy finally just left in a huff.",
            "Beautiful. \n* chef’s kiss *",
            "I would have clicked too far and taken your order first, and that would have ruined both of your days.\n\nShe did that perfect. Make sure she knows that is Reddit approved MC!",
            "I wonder if that's how the counter got to 29 in the first place, i.e. a karen every so often, but otherwise, they just serve people… lol",
            "This is the best post maybe ever. I wish I had seen it in person.",
            "This was beautiful. Perfect and absolute.",
            "Awesome. You made my day reading this!",
            "And you're Awesome for being patient and emphasizing with the deli worker!",
            "A the great fish market Joe Patti in Pensacola Fla\nThey have an armed guard sitting on a stool passing out the tickets. It gets really crowded in there and they are very strict about waiting in line. Once served things move along quickly.",
            "I too, work in a deli and my God the nerve of some people. A lot of people like to try and skip ahead and get mad if you try to call them out on their bullshit.",
            "No +10 on the clicker for fast advance / setup? Disappointing.\n\nOr maybe that feature was there, but the whole 60-some click through was worth it for the deli worker.",
            "I work in a deli and this happens all the time. What gets me off track is customers come up one at a time and as I finish one just another one comes up…they pull a number and then randomly I’ll get five people and all five people will bitch and moan that the numbers are off. I kick the numbers thingy plug out of the wall and yell “NEXT” so they don’t have the option to correct me. Or I tell them we are hiring if they have something bitchy to say besides “thank you for being here so I can get my unflavored ham and shitty dyed cheese”",
            "My only regret is the hell Our Hero would have had to pay if she had clicked through to 87, and told Karen \"Whoops! Sorry about that. It's going to take a while to come back around to you.\" ;)",
            "Should have called each number and waited for a response!",
            "Click bait tittle, Karen doesn’t get slapped.",
            "dude having displays be synced with the actual tickets is a rarity. I´ve never seen a place with tickets like that being synced unless there's an avalanche of people buying shit. And I've been in multiple countries.",
            "86 that Karen",
            "Good for her!!  Too bad she didn't call out each number as she was flipping them too.  Now THAT would've been the cherry on top!",
            "I worked for a once-large, now mostly bankrupt super market chain as a teen, in a large retirement community turned city.\n\nOne of my roles was at the meat counter.  Now the thing about the store is they often held sales for meats, and while the ads were supposed to be printed a certain way, sometimes key exclusions got omitted, and we were told to honor the ad as it was printed.\n\nOne time, the ad was supposed to have cheap live lobster, up to 1.5 pounds, and anything over that was supposed to be normal price.  The ad got printed without that exclusion, so these retirees lost their damn minds.  Most of my day was spent weighing and steaming lobsters.  \n\nWe had the same take a number system, and for those who don't know, there are way more than 100 tickets in that roll.  Each number is also prepended with a letter, so A00-A99, B00-B99, and so on.\n\nCalling out the next number, and watching as 2 different people hold up their tickets, and then look at each other confused was both hilarious and sad at the same time.  Moreso when we had to ask what letter do you have, and then the realization that they were 100 people behind what was being called.",
            "Be careful what you bitch about...",
            "Oh Karen, just go home and go back to bed.  This is not going be your day!",
            "I saw a Karen feed a clerk at the Safeway deli a bunch of shit.  She had a particular deli order. \n\n I followed her, waited until her back was turned, stole the order, and put it in a cooler on the other side of the store prominently where it would be found and returned  to deli later by a worker.  (\"guess customer didn't want this\").  The deli had a big line that day, doubt the witch lined up again to reorder.",
            "Touche Pussycat",
            "Clicks one more by accident, \"serving #87 now...\"",
            "100% I went to the game imo.",
            "Used to work in a deli with that exact same setup. Never had anyone Karen about it, though.",
            "Good story, was waiting for the \"slapdown\" part tho. False advertising",
            "I love this so much. Thanks for sharing this delight!",
            "So it is an unwanted bonus.",
            "...a \"two for one\" sale --",
            "Wish I had an award to give both you and the Deli Counter person!",
            "At first, it sounded like any other day at the DMV/BMV or w/e",
            "Ha!! This is the best!!",
            "This is such a great story!",
            "I would have took my time and been like ma'am you wanted the right number",
            "Why oh why do these Karens insist on fucking with people who are literally handling and preparing their food?",
            "You made me smile and chuckle after a stress filled day!"
        ]
    },
    {
        "post_id": "mjwaoa",
        "author": "VShadowOfLightV",
        "title": "Stop waking up at 6? OK then.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mjwaoa/stop_waking_up_at_6_ok_then/",
        "score": 16085,
        "num_comments": 691,
        "created_utc": 1617543087.0,
        "selftext": "When I was a kid, probably 7-12, I’d routinely wake up at 5-6 in the morning with no alarm, perfectly rested, and decide I’d just go play some RuneScape before school. I was homeschooled at the time, so I had a good couple hours before I was supposed to start. \n\nFor some reason my mom had a problem with this. She had a lot of problems with a lot of things but that’s another rant for my therapist. So naturally she decides to tell me that I can’t wake up at 6 anymore. So I thought as you probably do that she was being stupid, but of course not being brave enough to tell her so, went into my bedroom, and set my alarm for 6:*01* instead. \n\nWhen she woke up the next day and found me on the computer she of course started screaming at me. I waited patiently for her to stop, and then proudly announced that I had not disobeyed her, I had woken up at 6:01 instead. My victory was shortlived, as I then got my ass beat and was grounded. I never was allowed to wake up early again, and of course am now a lazy adult who would rather sleep as much as possible.\n\nEdit: thanks to u/caufield88uk for pointing out I didn’t clarify: \nI woke up without an alarm when I was really little, but then started sleeping more and set an alarm because I genuinely enjoyed waking up early. I made it sound weird. \n\nAlso: it wasn’t because I played video games. It was solely the waking up part. Never had issues with school because of it, was never tired. Wasn’t loud in the morning, didn’t wake her up. She was just a narcissistic pos.",
        "permalink": "/r/MaliciousCompliance/comments/mjwaoa/stop_waking_up_at_6_ok_then/",
        "comments": [
            "This kinda reminds me of how as a minor, my bedtime was 8 (until I was 16, then it was 9)\nAnd how it baffled me when my parents were surprised and angry that I routinely woke up around 5.",
            "Jesus, your mom belongs on /r/insaneparents \n\nI would never be mad at a kid for doing that. Even if you didn’t want them up and unsupervised in the morning, if they find a workaround your instructions just adjust your instructions and say “no getting up before 7am”. Tf is wrong with her?",
            "As a parent: as long as you don't wake me up or make a giant mess everywhere else, knock yourself out waking up early. Also, don't complain about being sleepy later. Otherwise. Go for it.",
            "This reminds me of that time my parents decided to set a curfew... two months before my 18th birthday. I told them I would be sleeping at a my best friends place if they were suddently setting a curfew for two months, which seemed silly to me. They agreed to let me sleep over at my friends place, but knowing what I was up to, they told me \"you aren't allowed back in the house before 7am!\"\n\nYou can guess the rest of the story, I went out clubbing, sat on a bench with a friend (who kept me company) until 7am, got back into the house, and picked up a book to read. When my dad came downstairs at 7.30 he was like \"what are you doing here?!\" and I told him \"well, it's *past 7am,* so... I'm allowed to return from my sleepover.\"\n\nCurfew was cancelled.",
            "The golden age of RuneScape, before you had a world map permanently embedded in your brain and still enjoyed the thrill of discovering new locations and skills.",
            "Your mom had some serious control issues.",
            "My 12 year old wakes himself up at 6:30 every school day so he can have some time to himself before I get up and start \"bossing\" him around. I love it. And can tell so does he. The mornings he sleeps in always end up being a little tense. Why your mother would be angry for this is beyond me. Why anybody would be angry at another person for their sleeping pattern is infuriating.",
            "I thought you were going to wake up at 4 AM and play even more runsecape.",
            "I used to get up at 6 every morning when in middle school, so i could watch the excellent cartoon \"Exosquad\". Now I get up at 6 to be ready for work :(",
            "My kid wakes up at about 6am every day. Since birth. Still in elementary school. I love him. So we asked him to play quietly in his room until 7am. His idea of quiet used to be a lot louder than it is now. At 7am he'll come out of his room and if we're still asleep he'll play on the computer till we wake up. I don't yell at him or 'beat his ass' because I love him.",
            "...my mom would have loved you",
            "My homeschool kids tried this too.  Problem is, in our house, ,computer time doesnt start until schoolwork is finished.  So they switched to doing some of their unguided lessons before I got in there for the school day.  Theyd be so proud! Look, ma, I already got my duolingo and extra math done!",
            "What the fuck? Waking up at 6am is an incredibly good habit to be in.",
            "Jesus, if my kids woke up at 6am and *didn’t* annoy the shit out of me for the next 2 hours until I get up, I would give them a trophy.",
            "I have to tell my wife constantly that our son is used to waking up early so it’s only natural that he wakes up early on the weekends.",
            "Imagine as a parent you punish your kid for getting out of bed bright and early\n\n98% of parents would dream for a child that doesn't have to be dragged out of bed 😂",
            "Wtf? If my kid woke up early and entertained himself with a video game without being all crazy loud id ENJOY it. \n\nWhen he has to get uo for school (pre covid since he hasnt been in full time school yet this year) it was always a fight. But now he will get up early on my days off an come jump in my bed to wake me up to make him breakfast (i have no issue feeding my child dont take it that way, we just have several options that are quick and easy, he usually asks for those because he would rather me do it than do it himself)",
            "When I was little I was also an early waker grandma would usually be up at that hour doing old people stuff/making breakfast. It was usually right around 6AM.\n\nAnd oh my God I had the best cartoons to watch that early. \n\nKABLAM, And Aah Real Monsters was all the motivation I needed.",
            "\"Homeschooled\" can be code (not always) for paranoid parents who want to program their kids into a cult. Or, can be horrible parents who don't want to risk CPS sniffing around when people at the school catch wind.\n\nI hope your homeschooling was better!",
            "Yep. I wasn't allowed up past 9pm, but I wasn't allowed to get up before 8am, sometimes I could be up at 7, but only for specific reasons. As a 17 year old the rules didn't change. I had to be asleep in my room for 11 hours a day. I was always awake for at least three of those hours. Awake, trapped in a dark room with nothing to do for three hours a day. Solitary confinement is a form of torture and I went through it daily. It was a huge fight to get my bedtime to no bedtime as well.",
            "Damn, if my mother had found me awake at 6 she'd assume I stayed the entire night awake...\n\nAnd if I had actually started waking up at 6 after going to bed at a \"normal\" hour she'd probably have congratulated me and asked me to make breakfast for everyone else. 😁",
            "Our kid set up his clock radio to wake up at 6 in order to work on his humongous Minecraft village before \"waking up\" at 6:30 to go to school. He thinks we don't know. We let him do it because he's getting enough sleep anyway, he's doing well in school, and why not let him have a bit of control over his schedule?",
            "Hell I think most adults probably wish they could wake up at 6 and not feel exhausted.",
            "I used to wake up hours before school to watch the magic school bus and popular mechanics for kids. 2 shows on really early. I credit them for everything I ever learned in science. mrs frizzle was a better teacher",
            "Was it the waking up early that she was mad at or the playing video games before school? I couldn't let my son, who was homeschooled for development issues, play video games before school. It was because when he did,  he couldn't get focused to do his school work.  He could play after he did schooling though and when there was no schooling he could play as early as he wanted.",
            "Growing up I would wake up normally 4:30-5ish and did the same thing you did, play runescape I was quiet so i did not disturb anyone in the house. My dad did not care as long as I made him coffee when I got up so it would be ready for him when he got up. Crazy that your mom would get upset over that kind of thing.",
            "My kiddo wakes up between 6 and 6:30 every morning and I’d be totally fine if he wanted to play quietly on the computer until I got up. Far preferable to playing lego and making up his own soundtrack - loudly and off-key. Sorry your mom didn’t see it that way.",
            "My parents were the same way. Just unreasonable bullshit. I sprayed too much windex on the bathroom mirror once and got choked out and grounded and had to reclean the whole bathroom.\n\nI kind of had an opposite experience with the waking up early thing. My parents woke me up at 6:30am every day (even though they bought me an alarm clock) and would take me to school as soon as I was ready around 7, even though the building would be fucking locked until 7:30.",
            "Taught my 5 y/o how to turn on the TV and watch Muppets, her favorite, when she got up before we did. That was a bad parent he/she had.",
            "Two of our kids are early risers. They are up and at it before 7 every morning. I am up most nights really late because their toddler brother tends to wake up in the middle of the night bustling with energy and no amount of changes in his sleep schedule has helped. So I'm not ready to be up quite so early. The only time I have an issue with them getting up so early though is when they are loud and wake up everyone else in the house. (Both are adhd and while they are capable of playing quietly, sometimes they get too excited and forget) they get a reminder that others are still sleeping and that they are being rude, usually they will calm down, sometimes we have to separate them, but we don't really punish them for being kids.",
            "In the wise words of my 5yo. \n\n\"Well that's fucking rude\"",
            "Some parents get busy in the morning. Also your mother is a controlling bitch.",
            "\" and of course am now a lazy adult who would rather sleep as much as possible. \"  \nNo, trust me, *that* is a product of age LOL",
            "Many kids wake up early.  When I was a kid, I got up so early that no one else was up and the only show on TV was a show called \"Modern Farmer\" where I saw video of combines harvesting wheat.  Mom was not very responsible. How one \"not wake up early\"?  People wake up when they wake up.",
            "Did she ever give a reason for the rule (although it probably still wouldn’t be reasonable)?",
            "My son has always woken up early, but as long as he doesn’t wake me up I don’t care.",
            "As a parent I’m keen to have my kids in bed before 8pm (all under 10). I’m much more consistent with this than my wife and don’t like it when they stay up late too frequently. However I’m fine with them waking up whenever they need to, my wife less so, but it’s more about concern that they’re waking themselves up early in order to watch tv or play video games. \n\nI personally think it’s great that my eldest gets up early and keeps himself to himself without waking me up. I’m also an early riser (6:30 most days) so it’s also nice to come downstairs and have some 1:1 time with him. He’s usually been up for half an hour by that point.",
            "This boggles my mind! Also, the comments of others getting in trouble for waking up early?! My parents would’ve been totally surprised, but additionally content about it. I do not understand getting upset about your kid getting up early as long as they’re not doing anything wrong or being loud. Great story all around though! :)",
            "Sorry but yeah your mom is a piece of shit.",
            "I'd much rather my kid wake up early to play videogames (or whatever hobby), then stay up late to do it.  If you stay up late, you might get carried away and not sleep much.  If you wake up early, then your playing time is necessarily stopped by the things you have to do that day.",
            "Malicious Compliance is super effective against employers, but not very effective vs momma bear.",
            "Weird that you’re mom wouldn’t allow you to be awake at 6, honestly I’d be rewarded if I could do that",
            "Your Mom probably just didn’t like you playing video games before school. Why she didn’t just say “hey no video games until after school” is a mystery the world will never know",
            "I just want my kids to wake up, and not wake me up in the progress. I appreciate it some days but if I’ve had a hard day/evening I’d like to sleep in til 8 or so.\n\nSorry your mom was a total dingbat though.",
            "My mom likes to sleep in, especially on weekends. With my dads schedule, most mornings she was on her own with 4 kids. When we were little, she kept the cereal and bowls in the lower cupboards so we could get ourselves. breakfast and allow her to sleep in. We would watch tv or play until she got up, usually by 8.",
            "My kids were pre video games when they were little. Our rule was they had to stay in bed  until 7am so they were less likely to get into trouble before I got up/showered/dressed. They could read quietly or play quietly in their bed but couldn't get up until clock said 7. Sometimes they fell back asleep. They started learning to tell time and got more reading time in which made me happy.",
            "Wow, waking up early is all my mom ever wanted from me but I was the kid that absolutely could not for the life of me LOL we should've traded sleep times",
            "As a kid, i had insomnia problems where id wake at between 1-3 most mornings and id play RuneScape until about 5-6 then get back into bed so my mom didn’t know i was up playing Runescape all night",
            "Similar part. Except I am sleepy no matter whether I enjoy waking up or not. Parents don’t know only because I fall asleep before they wake up lol",
            "I was the same as you as a kid. I would wake up super early (naturally) to play video games, my parents didn't have a problem with it tho.\n\nStill grew up to be a lazy adult :)",
            "If it makes you feel better I really didn’t have a sleep schedule growing up and still want to sleep all the time as an adult.",
            "I understand being a morning person. I’ve always been a morning person. I just wake up early and I’m usually like ready to go. Most people are opposite lol",
            "RuneScape taught me more than school ever did.",
            "I think we trend to be awake at a time that's most peaceful as the late or early time least likely to be around a certain type of parent",
            "My mom did this too.\n\nI would get up early, get ready for school, and play video games for an hour or two before I had to head out the door to get on the bus.\n\nI left for the bus the same time my mom's alarm went off to get her up for work so I wouldn't ever miss it.\n\nI never woke her up, never touched anything of hers, never missed the bus. But when she found out what I was doing she took the PlayStation each night and she would plug it in after I left for school so I could only play in the evenings.",
            "Wow, that's insane.  Your mother really had problems.",
            "This happened to me as well I'd wake up at about 6:30 to 7 am get showered dressed and ready for school I'd kick back and play warframe for a bit. By doing this I was always clean for school, always on time, learned how to make my own breakfast and my mind was awake and ready to take in information for some reason they didn't like that even though it didn't harm them in any way possible. They put a stop to it so I started waking up like 10 mins before school in defiance and it impacted me a lot I was always tired and a lot less clean than I usually was but seriously fuck my parents",
            "Why would you want to discourage getting up early, that doesn’t even make sense.  I’m sorry you had to grow up that way.  And being homeschooled by her too.  My heart goes out to you.",
            "Your mom sounds like an extreme version of my grandma. When my mom and her siblings were kids, they were made to go to bed early, at like 7. Then, of course, they woke up early, and that really annoyed my grandma, who wanted them to sleep til 7 and stay out of the way while she was making breakfast and whatnot. lol\n\nThankfully she eventually noticed that trying to make kids sleep 12 hours every night wasn't working and didn't press it.",
            "Damn, I wish I had been an early riser when I was younger. For the last 30 years I have had the hardest time waking up and usually slept an average of 9 hours a night sometimes 10. After I had covid I toss and turn for 6 hours and wake up exhausted because I can't sleep.",
            "I had the opposite situation. Every Saturday, my chore list consisted of:\nWashing and waxing a car\nWeed the dichondra lawn \n\n\nAnd to correctly Wash and wax, this 8-10 year old must wake up at 5 am before the sun to ensure the wax didn’t dry In the sun.  Oh how fun that was!!!",
            "You good?",
            "Parents need to choose (priorities! ) their fights. This isn't one of them!",
            "I applaud you lol, you magnificent bastrd. God dam. This made my day",
            "Same shit for me only I would wake up at 4am or would wake up at midnight on christmas",
            "My brother put himself to bed at like 8, then would wake up at 4:30-5 and wake the rest of us up. My mom was not having it. She told him he could eat cereal and watch cartoons quietly until 6:30-7. He always wanted to mow the lawn (the weirdo), but she made him wait until after 8 am so the neighbors couldn’t complain.",
            "I wake up at 745 everyday no alarm, no matter the time of year or how tired I am, I just wake up.",
            "My parents worried about me hurting myself if I got up before them so I had to stay in my bedroom if I work up early (I could use the bathroom) and was only allowed to leave it at 7am. All my books were in my bedroom so little me would get dressed and read before everyone else woke up and my alarm went off at 7. \nI really enjoyed it.",
            ">I never was allowed to wake up early again, and of course am now a lazy adult who would rather sleep as much as possible.\n\nThat final MC.",
            "Lmao I would have woken up at 5:59 to spite that rule",
            "See, when I did that as a kid my mom taught me how to make fried bologna sandwiches so she could stay asleep and I could do whatever I wanted....",
            "Whenever I hear of parents stubbornly keeping their kids in their rooms for beyond 9 hours or forced to stay \"playing\" outside without explanation, it seems like the parents are barking for privacy for sex.",
            "Just like my 8 year old son. Since he was a baby, he woke up at 6am on the dot. I never got mad, I would just wake up with him. He now plays fortnite, and starts school at 8am. So he wakes up gets dressed and plays probably a good hour when I wake up around 6:30 to get myself ready and make us breakfast. I mean if he’s rested and it’s not affecting his performance at school, I don’t see the problem. Sorry you had to go through that man.",
            "Yah...Same with me and my mornings growing up.  Always got up early and watched GI Joe, Smurfs, etc before going to school.\n\nMy stepdad didn’t like it for some reason and said if I get up early, I can only watch the news.\n\nNext day I was up watching CNN.  Now I’m a communist.",
            "Reading your upbringing reminds me of part of mine....if you’re interested, the approach used in r/internalfamilysystems helped me a whole lot.",
            "I have always been an early riser, when I was a young kid I would play downstairs quietly by myself. It would have sucked to have had your experience.",
            "I am going to say there's two sides to every story before I make any assumptions on your mother.",
            "My daughter used to get up too early.\n\nSo I put tape on her clock for 8am and said this is the time you're allowed to come wake us.\n\nWe both work and our only alone time after she goes to sleep so her loudly waking us at 630 was a problem and made everyone cranky.\n\nShe learned to sleep or hang out in her room until 8, and we would get up at 8 not complete zombies.",
            "I routinely sleep at 6pm, and wake up at 1-2 am, just like it lol.",
            "First day of school in a new city and I went to the bus stop two hours early. I woke up early and didn’t have anything else to do. Mom freaks out when she sees me missing and eventually finds me at the bus stop just chilling, drags me home.\n\nNow my body naturally wants to wake up 20 minutes later every day, so I’m always tired.",
            "See, I was also homeschooled but my mother wasnt insane. There was no playing before schoolwork, but no designated start time. I remember waking up at around 6 and getting all my schoolwork done around 9 for both ODST and Reach so I could play them as soon as possible.",
            "I think there's a redit page called r/raisedbynarcissists that would be perfect for this story too.",
            "Hahah I just love knowing there was another kid ou there that woke up early to play RuneScape, I too woke up every morning between 5-6 and played RuneScape before getting ready for school",
            "Yep, same situation. Now can’t go to sleep early and easily sleep till 10 or later. Thx Ma.",
            "Reminds me of my mother in a way. I was a serious bookworm as a child, i still am, she hated this. She used to tell me to stop reading whenever she found me with a book. \nShe still thinks im being lazy if i tell her im reading.",
            "Yeh I started going gym at 4:30-5:30am cause I start work at 7am my parents were like is there something wrong with our son?",
            "My son is 9 and is like this. He’s always been an early riser. Sucked for me, a night owl who loves sleep, when he was smaller. Now, he’s up before his siblings every day. He gets up, plays on the PC and often gets himself breakfast before anyone else awakens (we are also virtually schooling so he doesn’t have to catch a bus or anything).\nAm I mad about this? Hell no! Why would I be? Everyone deserves to enjoy their favorite time of day. Mine just happens to be 1 am and not 6am.\nYour mom belongs on r/insaneparents.",
            "I did the same, except younger. From 5y/o onward I would wake up at 5am, play Lego for awhile, get hungry, sneak out of the house into the backyard and eat raspberries and blueberries and raw green onions and garlic.\n\nThis freaked out my parents once because they woke up and wondered where I was and thought I was missing. We were living with my grandparents on a deep 1/2 acre lot, and those bushes were tall and lots of hiding places. Oh and the sandbox.... So much fun.\n\nLater on I started to play Microsoft Monster Truck Madness and eventually make my own tracks and trucks. That's when I started learning programming. Trexx, Alice3D, qbasic, C, C++. OpenGL, Ogre3d... All before homeschool started and later at night after 2-3 hours practicing piano.",
            "Come join us at r/homeschoolrecovery",
            "lmao when i was <10 i would literally wake up at the actual crack of dawn to go downstairs and play Little Big Planet, and whenever i would get a break in my work (homeschooling gang) i would go back and play Little Big Planet. there was nothing else i would do except Little Big Planet. “Play, Create, Share” consumed my life. that was all i was.\n\nuntil the minecraft craze of course",
            "I remember waking up early as a kid because right before school on cartoon network I could catch an episode of yu-gi-oh and maybe something else and have time to finish it before having to leave",
            "I can relate an uncomfortable amount. I used to read a shit ton as a kid, because I got exactly half an hour of screen time a day, and at most an hour or so of TV. I had quite literally nothing to do but read or play outside. But my mom would actively encourage me to stop, because my vision got worse over time. I don't think it was my fault exactly, since both my parents have bad eyesight. And now I rarely read physical books. I still read very often online, I just haven't really read any physical books since quarantine began, since I usually had access to the internet. And now my mother complains about me and asks what happened to me. I mean, wow, I wonder what happened...",
            "Don't worry.  Puberty wipes out early waking anyways.  It wouldn't have been much longer.",
            "I'm one of those people that stays up late gets up late. I remember being awake at 11 p.m. when I was in elementary school. My dad would still wake me up early on the weekends, ugh. If you want your parents to stop waking you up by pulling your blanket off, sleep naked. I wish I had known this when I was younger. Put an end to that shit.",
            "oh my god. i thought i was the only one who had this waking up early thing. i love mornings, have always loved being up to see the sunrise. lately i've been too tired/depressed to get up, even when i set alarms, so i've missed some beautiful mornings ;-;",
            "Parents do weird unintentional stuff to their kids. My Mom was a farmer's daughter, so waking up early autonomously is still a thing. However, the one bad trait my mother unintentionally put in my head - whenever I started cleaning my room, she would barge in yelling that I had ten minutes to finish... so everything ended up under the bed. To this day (I'm 60 now), keeping organized is nearly impossible. I don't know that I can blame it all on that, but it certainly played a part. Moving past the old scripts is the hardest part and takes a lifetime to master.",
            "My 3 year old gets up every morning between 545 and 6.  It’s exhausting, and sometimes it’s easy to get upset with her over it.  I just want to sleep until 7... is that too much to ask?!?!  \n\nThen I realize it’s time I get to spend with just her.  As long as she’s not whining and tired still, it’s some of the best time I could spend with her.",
            "Lol nice one. This reminds me of the time mom saw me sitting on a chair outside my friends main door and watching TV with everyone because I wasn't allowed to go into anyone's house and it was too hot outside to play outdoor games.\n\n\nThat rule went out of the door real fast.... But not before I got beat up for being over smart.",
            "I had a similar thing but eventually my mum gave up, I sleep at 9 and naturally wake up at 6, I am getting over my recommended hours and don't feel tired so there isn't an issue it was just her deciding how things were and then acting on them without ever questioning if any of it was true",
            "I was the same way! I would wake up on my own somewhere between 4 and 5 am and would get ready for the day then play sims busting out or sims castaway, she would get so angry and it ended with me forcing myself to sleep until I just wouldn't wake up anymore, and then she spent the next x years until I graduated spending like 20 minutes trying to get me out of bed cause I might as well be a bear in hibernation if I don't wake up on my own",
            "I'm always thankful that my parents weren't batshit insane like some peoples. They weren't great, but at least they weren't insane.",
            "\" She had a lot of problems with a lot of things but that’s another rant for my therapist. \"\n\nThat struck a cord with me there buddy, big oof of solidarity.",
            "> For some reason my mom had a problem with this. She had a lot of problems with a lot of things but that’s another rant for my therapist. \n\nOof, I felt that deeply.",
            "God... I'm a father with kids aged 8, 7 and 4. All three of them generally wake up between 6-6:30am every day. As far as I'm concerned that's normal for them and completely fine... unless they're loud and wake me up early on a weekend. \n\nThe only time I ever enforced a \"wake up\" time was on the eldest when we got him a smart watch and he started setting alarms before 6am so he could watch stuff longer before school. That earned him a 6:30am or later time for when he was allowed to come out his bedroom for a couple weeks. Never had any problem with that since.",
            "Your mum is weird... I’m in a great period of my parenting life right now where my kid is old enough to play video games in the morning while I sleep in. Makes me smile when I get up and I see him in the computer room playing his games, still in pjs.",
            "Gonna date myself here but, I used to wake up around 5-6 on Saturday mornings to watch cartoons. I usually had to watch the broadcast bars for a few minutes until the programing started. Sitting inches from the 21\" tv screen as to hear it so I didn't wake anyone up.",
            "That’s really immoral that she resorted to violence in that situation I’m sorry you had to go through that",
            "Ugh, this is why it's ok to teach a kid how to make pancakes and coffee. Nobody can be angry when waking up to pancakes and coffee",
            "My mom made me go to bed at 8:30 right up until 18 and lost her shit if I was up before 8. I'd usually be up at around 4 and if I was lucky I could sneak out of my room to play Oblivion for a few hours before I was supposed to be up. My older sibling never had to deal with this.",
            "Shitty mom. I’m so sorry for you :( I love when my baby wakes me up in the morning, cause when I do wake up she’s so happy she finally has some company and the big cheesy smile is my fav",
            "How dare you have some time to yourself and enjoy it???",
            "Your mom sounds like an entitled narcissist. If she wanted you to wake up later, she should have put you to bed later. She just wanted to spend less time doing the job of a mom smh",
            "People have hard ons for dominating children it happens all the time. Think of it like the ring of power in Lord of the Rings: once you have it, it’s yours to keep and wouldn’t want anyone taking it from you.",
            "I used to be like this too, would wake up before anybody else did and would play RuneScape or age of mythology",
            "When I was a baby I never needed a lot of sleep, if they put me to bed at a normal baby time say 6 or 7pm I would wake up at 4-5am. Which pissed off my dad as he was annoyed about getting up for work. \nSo they started to put me to bed later. I grew basically having no bed time, I don’t really remember being put to bed in any kind of routine (that might just be my memory)\n\nThey would get annoyed if I woke up even approaching early say 7am or so. Still now in my 30s I have terrible trouble getting out of bed, not waking up just getting up I can be in bed for hours quietly doing things reading or watching YouTube etc, but find actually getting up and making any noise very difficult",
            "I dealt with a large group of home schooled children during college at a science fair.   It was very eye opening, by the end of the night I felt sorry for nearly every single child there.  They all had guardians/parents with them that were some of the most miserable wretched \"Karen's\" I had ever delt with.   I vowed if I ever in my life ended up custodian to a child they would NEVER be homeschooled.  Socialization is an important factor in growing up as well as the book/math/etc parts of education as a child.   Few of the other kids were future narcissists/insert-other-awful-trait-description but most of the general group was just very excited but unsure of how to even ask questions at the different exhibits/tables.   Very few of them had even been in any sort of building devoted to academics before.  I left that night after clean up feeling pretty down that there are so many awful parents that are bizarrely self-righteous and suffering from the Dunning-Krueger effect.   I hope those kids turn out okay in the end.   Not all homeschooling is bad but that night made me think the vast majority of it should not be happening.",
            "I think the majority of homeschooling parents are controlling narcissists which is why they can't just let their kids go to school and have a normal life.",
            "Man that sucks.  I think most of us would love to be able to get up on our own early. Your mom really fucked up there.",
            "When you’re past the age of 21, it’s time to quit blaming your deficiencies on your parents.  If you are a lazy adult, it’s because you choose to be a lazy adult.  Could be time to get out your umbrella cause it’s raining cold hard facts pal.",
            "Hey there, we have to leave the crap with our parents in the past. Please don't get stuck on this... Other people are not going to be endlessly sympathetic to your childhood era defiant behavior. \n\nGood luck!",
            "Stop talking about your genital fur.",
            "She didn't want you up because you weren't being supervised and she wasn't willing to get up at 6 to supervise you. She didn't trust you.\n\nShe may have been a narcissist, but not for that.",
            "[deleted]",
            "[deleted]",
            "Wow still blaming your mom for things even as an adult eh lmao",
            "What?",
            "How did you never stab her in her sleep?",
            "This isnt why youre a lazy sleepy adult",
            "So over one-sided stories from children about how their parents were the worst because they didn't like you waking up to play some computer game, one known for being addictive. parents then set reasonable rules to help their child grow up to not be a incompent human being and not playing Runescape as soon as you wake up, as I'm SURE you were playing wayyyy too much. Then you have to see a therapist because of your inability to listen to logic, whereas people like me see therapist because we went grew up foster care."
        ]
    },
    {
        "post_id": "o4wakl",
        "author": "AccomplishedWardrobe",
        "title": "Nothing Beats Scummy Landlords during Covid Shutdown",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o4wakl/nothing_beats_scummy_landlords_during_covid/",
        "score": 16075,
        "num_comments": 470,
        "created_utc": 1624285508.0,
        "selftext": "I hated my old apartment, needed to desperately get out and right when I was looking for rentals last year, coronavirus hit and everyone shut down. With less than a week on my lease, I had to jump at the first available home. Didn't even get to inspect it.I ended up with equally horrible property managers.\n\nI didn't have a key on day one, had to break in to move in, they didn't tell me about the German roach infestation (it's okay, I used to do pest control so I managed) and so forth.Right when I lost power during Christmas (also okay, I live in the south, I didn't get too cold) I tracked down the original property owner and asked her if I could get out of the contract and just pay her directly. We investigated many options and the best way to get out of the contract was to just pay for the last remaining months and write a 30 day notice.\n\nThey call me and tell me that I have to write them a notice, signed and sent and received on the exact date 30 days from the leases end to be accepted or I will lose my $1,000 security deposit. They really stressed it had to be mailed and definitely on time or they won't be able to accept it.\n\nCue my pettiness.\n\nI wrote a template letter, with a generic \"this is a \\[number of days till lease end\\]- day notice .... I'm writing to terminate my contract and to receive my security deposit as stated...\".I sent one out on my 103 day notice. Then another one on 89 day notice. Then another one on 73 day notice and so forth, basically whenever I remembered about it, I would change the date around, print it, sign it and then mail it.\n\nThey call me saying this is very unnecessary and that they got my message loud and clear. But they sounded pretty rude about it so I sent some more. \n\nI then received some passive aggressive emails that they will honor the contract and leave me the $1,000 deposit as I have sent them a 30 day notice. But they can be tricky and as I haven't technically sent them an exact \"30 days\" notice, I have some more letters to send. Plus again, they sounded pretty rude over e-mail.\n\nCue the final 15 day countdown till my 30 day notice letter. I upped the ante. I now have one letter per day to send and I have changed the fonts on each letter ranging from Papyrus to Jokerman to Comic Sans. My favorite one is the one where it's all bright yellow and barely legible. It jsut hurts looking at. Oh and better yet, I got the last batch sent as certified mail so I get an email that they received it AND that they had to sign it.\n\nOn my 34th day notice letter (now probably the 20th letter I've mailed), I received my cashiers check back. No message or anything.Fortunately I have four more letters to send. The best $43 on stamps I've ever paid. \n\nTL:DR I spam the lease office with 30 day notices till they gave up on holding to my security deposit\n\n&#x200B;\n\nEdit: Even though some are breaking rule 3 and wondering if this is some made up everyone cheered tale, heres a link to some screenshots and emails. |  \n[https://imgur.com/a/d6Xbc4P](https://imgur.com/a/d6Xbc4P)",
        "permalink": "/r/MaliciousCompliance/comments/o4wakl/nothing_beats_scummy_landlords_during_covid/",
        "comments": [
            "You had your petty pants on good",
            "\"They sounded pretty rude about it so I sent some more\"!!",
            "A $43 dollar investment that nets a $1000 return is a 2325% return on investment. Smart!",
            "Deposits,  what a racket.  While I was building my house we rented.  Gave deposit.  When we left the house was spotless.  Got no return because there was a piece of onion skin in the back of a cabinet.  That's it!  Because the new house wasn't finished I had no time to take him to small claims.  It still rankles me to this day.  Fer.",
            "I think I'll try the bright yellow painful font.😆.\n\nThank you for not being my enemy.\n\nYou're an inspiration, keep up the good work!?",
            "I had a particularly petty and difficult state agency to deal with, and after a series of issues with their actions demeanor and attitude, I started making my payments in individual portions. \n\nI would pay all at once, but it would be a stack of small-dollar checks, pouches of odd change, separate envelopes with a small money order, that sort of thing.\n\nThere's no resolution, I eventually ran out of starter checks and gave up.",
            "The exact 30 days thing is outrageous. I hope they get sued to non-existence.",
            "Well played, sir. Well played. \n\nThe lack of assistance for things like moving in or even getting you your key are shitty, then adding in the roaches makes it border on despicable. I’m glad you got your deposit back but sorry you had to live in a place like that for so long. \n\nThis MC made me smile. You should send one the day you move out stating you’re moving out just for shits and giggles too. Did you do a letter in Wingdings or whatever other symbols font too?",
            "It's the best way to deal with agents, they genuinely dislike anything that makes work for them, so the one thing I learned is the best way to get anything out of them is to make doing what you want the path of least effort.\n\nWe had some try to hold our deposit so I gave them a week then took to phoning them.  Every day at 10am.  Every single day, until it was on my doorstep.  Then I phoned them to thank them for sending it...  sometimes it's the little things.",
            "Dealing with something similar myself. Haven't gotten the keys to my apartment as it needed appliances replaced, has a German roach infestation, a broken window needs replacing, and a non-functional A/C unit needs to be replaced as well, plus the walls needed to be painted. Manager keeps insisting on hiring contractors to do the work, so it's taking far longer than it should have to get me in there despite my contract stating I should have been in there since the start of June.",
            "judging by the title, you could use a crowbar",
            "Your long-game malicious compliance is amazing.",
            "This malicious compliance really brought me joy. The incessant letter sending is brilliant, but changing the fonts is utterly fantastic! Well done!",
            "Honestly, it is standard to ask for it in writing. Now, insisting to mail it instead of just bringing it to the office is petty on their part. But they HAVE to have a letter stating your notice for the file and usually with termination, it is one months rent, even with proper notice. (In the industry so I know what is required.). But they shouldn’t be rude to you even over email. So I say be petty!",
            "I like this! The Comic Sans in yellow was just the perfect icing on the cake :)",
            "It isn't petty if they're trying to rob a thousand bucks off of you.",
            "I help homeowner’s get their insurance to pay for storm damage. This sounds like what I do with emails. Really gets the stress out sometimes when you double down on their petty arbitrariness.",
            "It's cool that the owner was willing to work with you.",
            "I goddamn love this, and love you, you petty avenger!",
            "I did something like this to a receptionist who said my diagnosis wasn’t good enough to see the oncologist in her office. When she agreed to schedule me if I had my doctor send a referral, I got like all ten of my doctors each to send one.",
            "My cousin in law was exposed to covid by his landlord.  As a result, me had to self isolate for 2 weeks and was unable to work.  The landlord still expected full rent despite the fact that it was his fault that my CIL lost two weeks pay.\n\nLandlords suck",
            "Amazing work!",
            "Good. They would have taken that money and tried to charge more.\n\nI was in property management. It is a mean a cruel job. It wasn’t for me.",
            "> I have changed the fonts on each letter ranging from Papyrus to Jokerman to Comic Sans.\n\nMay I interest you in one of the best fonts ever made, [Comic Papyrus](https://fontspace.io/comic-papyrus-font/)?",
            "Better safe than sorry. My husband once gave his 60 days notice and the landlord claimed it was invalid because February only has 28 days so it wasn’t actually 60 days.\nResponded with a quote from the landlord and tenants act saying that 2 months is still fine even if one month is February. \nSo then she said it didn’t count because she has two apartments at the address and it didn’t say it was apartment B. Even though she only had the two places and was so up in their business she insisted in knowing her tenants jobs, school schedule, family etc. \nLandlords will do anything to try and get an extra month’s rent out of you while they rent it out to someone new after you move out.",
            "Apartment living and landlords in non- wealthy neighborhoods is proof of mans inhumanity to man and how all that matters in life is money. It’s a never ending parade of greed, negligence and sadism. The normalization of sociopathic behavior where bullying, cost cutting, and roach infestations are all acceptable.",
            "Hold on, *german roaches*?",
            "Damn, so good. I will steal this idea when time comes.\r  \nSo petty but so effective and satisfying.",
            "Wish I had that chance. 3 out of my last 4 landlords just straight up stole part of my security deposit. Significant amounts each time, but not enough to pay for the cost to court and lawyer. (Where I am, they don't reimburse legal costs for small claims)",
            "This actually warmed my heart. Lovely job.",
            "I'm, jealous of this execution.",
            "The long game here is beautiful. They deserve every bit of it, and more.",
            "r/LifeProTips",
            ">Fortunately I have four more letters to send\n\n~~Joe Lycett~~ Hugo Boss is that you?",
            "Having worked in property management, I approve. That's brilliant and a good way to cya.",
            "[deleted]",
            "You are my petty god.",
            "Should've made sure at least one was in Wingdings.",
            "You are a stud. Bravo, I say",
            "My ex girlfriend lost her place during the moratorium. I kept telling her that it wasn't legal for them to do it and all it took was some paperwork she needed to file. It caused her so much anxiety with the idea of confronting her landlord, a registered sex offender. She eventually just let him kick her out and as far as I know has been living in a tent behind her mother's house.  She's a super alcoholic that I just can't be around anymore despite being very much in love with her but no one deserves to live like that.  I've been homeless but was both unfortunate and fortunate enough to qualify for a domestic violence shelter that I stayed in for six months. It's not even close to as bad.\n\nIt stresses me out not knowing how she's doing but despite not being able to help attempting a relationship when we are around each other, I realized how toxic we were together.  That said, I hope she's ok and hope that landlord goes to hell.\n\nEdit: typo",
            "Reminds me of the film *Shawshank Redemption*, when Andy sends a letter every week trying to drum up funding for the library. Finally they respond, hey, we got your letters, we're working on it, you can ease off now. Andy, now knowing that they're reading his letters, starts sending *two* letters every week.",
            "As a landlord but not scummy, I wouldnt even be mad about this. I would save them all in a stack, band them together, put them in your file folder and occasionally laugh about the goofy ass tenant we had that wanted to be real sure to get their sec dep back. \n\nI probably wouldnt send the check early tho. I am a bit petty.",
            "Thank you for the laugh. This is one of the best I have ever read. When you got to the part about the different fonts I lost it.",
            "[removed]",
            "*chef's kiss*",
            "OMG, this is epic! Take my hug reward, you made my day🤣",
            "This should be the new standard.",
            "Certified mail with return receipt is nearly $6.53.",
            "I'm having a fucking *terrible* day and this brought the first smile to my face since yesterday. Thanks a ton, and great work.",
            "If you didn’t send the 30-day notice on the 30th day, would you technically have to give it back?",
            "DAYUUM. Well done my friend, well done.",
            "This is some quality MC!",
            "A note to the OP, please learn to use paragraphs. On mobile all I'm looking at is a massive wall of text.\nReally hurts the eyes and makes it difficult to read.",
            "Delicious. You should've sent one in Windings too.",
            "Well done!",
            "Petty LaBelle!",
            "I’m laughing this is iconic",
            "This is a convenient corruption of the language used on their behalf. \n\nWhen it says “30 days notice” it means “at least 30 days notice” not “exactly 30 days notice”.\n\nThey have deliberately misinterpreted the language to inconvenience people knowing that if a person sends it early or somehow the notice doesn’t arrive exactly on the date, they will try to use that as an excuse. \n\nWell done on beating them at their own game. The pricks!",
            "I love this",
            "You contacted the actual property owners, and they helped you?",
            "I forget what the subreddit was called but I stumbled upon it a while ago, and it was subreddit for landlords to post memes, and tell stories about them kicking starving families out and laughing about it, calling them “rentoids” I scrolled through it for a bit but never went back. Good on you for fighting the good fight.",
            "Delicious. Loved it",
            "She used *Comic Sans.*\n\nOLD MEME INCOMING\n\n*Megalovania intensifies*",
            "Brilliant",
            "Your Postal Service thanks you.",
            "Christ we where lucky with our landlord.\n\n\n\nThere for 6 years, evicted us due to needing money for renovation.\n\n\nCleaned the house a bit, got our entire deposit back and that's all she wrote.",
            "Slowclap.gif\n\n\nBra-vo",
            "This is just brilliant\n\n I'm going to steal this idea",
            "Loved this story!! Sounds like something I would love to do, but I’d probably chicken out lol",
            "You're so petty you should start a Tom Petty cover band, and I would totally stan for you guys",
            "OMG. My husband would worship at your feet. He would do exactly this. Lolol",
            "Holy shit, one german roach, and I am out. Never ever ever again.",
            "Well played fellow Redditor, well played! X",
            "You have given me a fantastic idea for my crappy landlord when I move",
            "Hahahaha. This is amazing!\n\nI love love love that you changed the font each time. I think i'll save this for when I need to torture someone.",
            "This is very good. I didn't have but a $95 security deposit. But I had learned from several people that moved out over the years they would charge them for new carpet, new paint, new bathroom fixtures (upgrades to match the new model) but usually several thousand. You could try and fight it but they had  a paralegal at an attorney's office that did paperwork just for them. And they would file a lien that showed on your credit. Most people paid. Many had lived there for years so all these things were normal expenses in turning over an apartment. They also charge high rates for labour cost more than what they paid. They owned several thousand apartments and had roving maintenance staff.\n\nSo when I got ready to leave after 9 years I went and took pictures of the new Model Apartment. It had a different style and color than mine and the paint was different. The bathroom and kitchen fixtures we different. There was no varience of colors in the newly leased apartments.\n\n2 weeks later they were showing my old apartment. A friend went over and took pics of carpet, paint and fixtures. 2 weeks after that I get the letter saying they are keeping my $95 and I owe them $2,364 for painting, new carpets, scratches on the walls and new fixtures. I forget to mention 3 scratches that were deep enough to see, I spackled and sanded.\n\nMy good buddy sent back a letter on his law firm stationary asking that after 9 years wouldn't they be doing these things anyway. Please respond to his office not me. There began an odyssey of 2 years before my friend said he would be looking to find plantiffs for malicious prosecution suits including mine if they were stupid enough to take us to court for vacating the lien. That's when we sent them the pictures. By then I had 11 other people who had moved and my buddy was looking at really going after these guys. Working with me had been for fun, meals, and drinks. I did pay for his assistant's time doing the letters.",
            "I think I love you.",
            "A masterclass!",
            "You absolutely malicious complier. I applaud you",
            "I’ve never heard of German Roaches so my brain immediately went to anthropomorphic cockroaches yelling at each other in German.",
            "You sure nothing? Cuz I got a bat here willing to prove otherwise...",
            "Well done",
            "If you're in the US, good for you for supporting the USPS 💜",
            "Different fonts and yellow color is just LOLs",
            "Just saw the yellow font. \n\n*My eyes! My eyes!*",
            "\"But they sounded pretty rude about it so I sent some more.\"\n\nThis made my day",
            "This is amazingly petty, in a very good way. I love it.",
            "I love how people with money never complain about landlords or mortgage company. Seems like it’s always the lower class that has issues.",
            "This is glorious! Please tell me one of the letters was in wingdings font!",
            "I love you.",
            "Beautifully malicious compliance",
            "This is inspiring",
            "This is genius and petty, nicely done.\n\nHow much was it to make each letter certified?",
            "\nWhat the fuck did you just fucking say about me, you little rentoid? I'll have you know I graduated top of my class at Wharton, and I've been involved in numerous secret raids on squatters, and I have over 300 confirmed evictions. I am trained in cutting off utilities and I'm the top cable cutter in the entire Beth Shalom Temple. You are nothing to me but just another renthog. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of landlords across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your credit score. You're fucking evicted, kid. I can be anywhere, anytime, and I can evict you in over seven hundred ways, and that's just with my bare hands. Not only am I extensively trained in keeping security deposits, but I have access to the entire arsenal of the landlord association and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You're fucking homeless, kiddo.",
            "You sure are a hero!",
            "Scummy landlords are bad....but so are tenants that are fully capable of paying their rent but use the law and Covid to stiff the hardworking, middle class landlords.",
            "I love this so much",
            "Bohahahaha! I love this story!!",
            "Wow i- this is just blatant landphobia. This is unacceptable, you bigot! Landlord rights are human rights!",
            "gotta love Southerners taking advantage of people since the 1600s",
            "Why didn't you capitalize 'during'?",
            "The landlord was letting you out of the contract, which they didn't have to do, and you got mad they wanted a 30 day notice?\n\nI don't get it.",
            "This dude moves into a slum and expects the slumlord to be a good guy.",
            "Can someone translate this mess for me?",
            "[removed]",
            "I mean. If a government is going to shut a section of people down without relief and rules as to what landlords can and can't do, do you blame landlords for wanting to get paid?",
            "This has nothing to do with compliance. 30-day notice is a pretty standard concept. You just went wildly out of your way to bother people. Congrats??",
            "[removed]",
            "Did not read. Formatting makes it impossible. Take this shit down or don't post enormous blocks of text.",
            "i think you are the a$$ hole here.",
            "So you didn't do your due diligence and then wanted to break your contract but they were the rude ones?",
            "Wow. This is dumb. You were in a shitty apartment you probably could have got out of for free. And the. You wasted. Money sending loads of letters.",
            "I bet you felt accomplished! High five! :D",
            "Idk scummy tenants are pretty hard to beat.  Imagine someone living i your property, pets shitting and pissing all over your floors, tearing up your appliances and property, then expecting to give them free housing when they signed a contract today for it."
        ]
    },
    {
        "post_id": "8myu68",
        "author": "DanishProtestPig",
        "title": "Dapper Dan fails to think things through",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8myu68/dapper_dan_fails_to_think_things_through/",
        "score": 16067,
        "num_comments": 437,
        "created_utc": 1527598262.0,
        "selftext": "\n\n\n\nNot sure if this is Malicious Compliance or Petty Revenge...\n\nI graduated uni a few years back and immediately started looking for a job in my chosen field - marketing.\n\nMarketing entry level roles were thin on the ground, so when I found a role which was hybrid of marketing with sales support, I took it. \n\nThe company was a medium sized business which specialised in recruitment, contractor hiring and head hunting. They also subcontracted work for a recruitment technology provider, which matched up perfectly with one of my other passions - technology.  \n\nI absolutely loved the role. I got to do all parts of the marketing and sales lifecycle, I got to work with suppliers, event organisers, clients, staff all across the company, meet new people and do really exciting things. \n\nI had two managers - the one who managed the sales team and the one who managed marketing. \n\nThe marketing manager was a kindred spirit; the sales manager was oldschool sales. An arrogant and headstrong late-forties man who lived for making deals and boasting about them. Shiny shoed, silver-tongued. I’ll call him Dapper Dan. We were not friends. \n\nFor about 18 months, things went swimmingly. I’d do marketing half the time then divide the rest of the time between sales support and billable work. Billable was building custom careers / job sites to host the recruitment system front end. A steep learning curve but with the help of some web dev friends I got pretty familiar with simple site builds. \n\nBeing tech-aligned meant I was always looking digital first, bringing the company into the age of social media, SEO / SEM, website optimisation and multi channel marketing. \n\nDapper Dan sneered at such things. He saw digital as a waste of money. However, we were always able to justify the spend on digital by offsetting the billable website work. \n\nThe marketing manager eventually moved on to bigger and better things. Rather than promote me or hire in a replacement, the company moved the marketing responsibilities to Dapper Dan. \n\nDapper Dan’s changes were immediate and far-reaching. He removed the digital budget. He required that 50% of my time would be sales support, to ‘better enable the sales team’. He incorporated the billable work with his own team’s revenue. He rewrote my annual objectives to align purely with sales targets, rather than marketing. When I voiced my objections, he took me aside for a ‘friendly chat’ and told me if I didn’t like it, I could always leave. \n\nNaturally I went and complained extensively to the departed marketing manager over drinks. After listening sympathetically for 45 minutes, she held up a hand, said ‘Stop’, and shared some life advice. ‘Each job pays you twice. You get your money now, that’s your wage. You also get experience now, that’s how you get paid in the future. So. Are you still getting paid? Yes? Are you still learning? No? Figure out how to keep learning, or leave.’ \n\nTaking the advice to heart, I busted my ass for the next year. I worked on digital outside of office hours. I made friends with the tech provider’s support and dev teams. I went to developer group meetups, attended conferences, studied for and acquired industry qualifications. I joined the national marketers and digital marketers group. I dug through blogs, articles, emailed people, took every opportunity to cross skill, upskill, to learn. \n\nAnd I sat with a smile on my face in the sales meetings as Dapper Dan delegated dumb do-work to me so his team of sycophants could make the company’s growth figures look spectacular. Spectacular they were, to the point that the company was acquired, and Dapper Dan betrayed me. \n\nYou see, managers have the discretion to assign a pool of shares to high performing staff. The shares have no real value and can’t be traded, but in the event of a management buy out, they would suddenly have value - and quite a lot of value. \n\nDapper Dan felt it appropriate to reward every SALESperson in his team with a generous parcel of shares. As a SUPPORTperson, I would not be the beneficiary of such kindness. I’d had a verbal agreement with the previous marketing manager that the pool would be shared across the entire team so was pretty shocked to discover I’d been excluded from the pool. \n\nI queried him on it, per the previous agreement, and he said (verbatim) ‘Well, an verbal agreement is only worth the paper it’s written on. You don’t make any sales, you haven’t built the business, you don’t get a cut’. \n\n'If you didn’t like it,' he reiterated, 'you're welcome to leave.'\n\nThat is EXACTLY what I decided to do. Except I didn’t tell him. \n\nThe way the contract handover works in this instance is that all staff cease employment with company X on one day. The following day, they commence employment with company Y. Annual leave is paid out and begins to re-accrue at the new employer. Other arrangements - salaries, long service leave and length of service - may be transferred to the new employer. \n\nAbout six weeks before the handover, Dapper Dan passed me my new contract. I waited a week, came back with some enthusiastic queries on the new benefits, which took him two weeks to follow up. I quietly registered a domain name and parked it, then spun up a Wordpress instance and started building a personal blog. \n\nThree weeks away from drop date, everyone’s frantically running around getting all the deals as close as possible to closing and employment contracts are the last thing on his mind. I go back to him, I tell him I have a couple more things I need to check out and I’ll email them through to him before I sign it. I spend a few more nights throwing together a bunch of blog articles relating to Recruitment Technology. How to articles, that kinda stuff, many of my own installation notes. \n\nA week passes, I fire off a couple of really complex questions around the transfer of benefits. He obviously forgets about them, then in the week of the handover, catches heat from the HR team about the outstanding contract and pulls me into a meeting room to berate me about not having signed the new contract.\n\nI explain I’m waiting on his feedback on those specific points before I’ll commit, that I don’t want to be disadvantaged moving into the new role, call out the lack of a share option as an example. Clearly frustrated, he drops the words I’ve been waiting for. ‘If the signed contract is not on my desk on Friday, don’t bother coming into the office Monday.’ He paused for dramatic effect, and reiterated ‘I mean it. You won’t have a job.’ I replied that I completely understand and that I’ll have everything he needs on his desk by close of business Friday.\n\nOn Friday afternoon, Dapper Dan leaves the office early to attend his normal ‘client networking’ visits which typically involve long lunches and alcohol. \n\nAt 4.45pm I save the final set of forecasting and reporting to the share drive, send an email to the IT team passing over access to the Marketing lastpass account which contains the global database of usernames and passwords for all digital assets (including client sites), an Excel workbook containing my reporting macros and the location of all my documentation. I redirect my phone to Dapper Dan’s desk number, lock my laptop and leave it on his desk along with my ID card.\n\nOver the weekend I push my personal website live and add my contact details to my LinkedIn profile, switching it to 'Actively Searching' mode. I figure my holiday pay will cover me for a couple of weeks of downtime before I have to go diving back into the workforce. \n\nOn Monday, I’m enjoying a long walk in the spring sunshine with my dog, who’s incredibly happy that his human has not disappeared down the driveway at 0720 per normal. We stop for coffee at a local cafe and my phone begins to ring. It’s one of the sales drones at old company; I ignore it and thoroughly enjoy the freedom of being able to amble through a park without anywhere to be. The phone buzzes another eight or ten times by the time I get home. The poop has well and truly hit the windmill.\n\nI check my voicemails, ignoring those I know from my previous employer and returning the phone calls of two ex-clients to let them know that my contract has ended and to check in with Dapper Dan for work in progress - or contact the technology provider for support requests. \n\nShortly afterwards I got a call from a bemused contact who works at the technology provider who’s been fielding support calls that I’d normally handle. He listens with increasing interest as I explained the situation, then tells me he’d call back shortly. \n\nTen minutes later he’s back with the Head of Product on the line, asking about my lunch preferences. She arranges to meet me at a nearby Thai place. Over a delicious red duck curry, she cheerfully describes the wonders of a career as a contractor. She also mentions the day rates for highly qualified, industry-certified staff, mentioned that Tech Provider were really struggling to find such staff and gives me the number of a recruiter who may or may not have been on Tech Supplier’s preferred supplier list. I call the recruiter on the way home. \n\nMeanwhile, my collection of voicemails from Dapper Dan was growing by the hour as he came to grips with the breadth of the problem that he’d generated. At some point in the late afternoon, HR must’ve clicked to what had happened and I received a polite SMS from the personal number of the regional HR Directory asking if I was available for a quick chat. \n\nI call through and discussed the options presented to me by Dapper Dan on Friday, and that I felt I had no option but to follow his instructions. They probed for more information and it became apparent they were unaware that Dapper Dan had pulled an ultimatum without first engaging HR. They then informed me that to benefit from the sale of my shares, I would need to transfer to the new company and remain in their employment for a full year. \n\nWhen I explained that I had no such share options, there was a full four second silence. It transpires that this, too, was not adequately communicated to HR. I mentioned that I’d appreciate it if Dapper Dan could discontinue his voicemails to me as I found them unprofessional and had no intent of recommencing employment under his management. We ended the call politely, I wished them all the best and regretted the conversation had to happen under such circumstances. \n\nMy contract for Tech Provider came through via the PSL agency at 11pm that evening and was signed and returned the following day. \n\nI was deployed to client site that Wednesday. \n\n*Post Departure*\nI met up with one of the old IT team at a conference three months after it all went down. He was ecstatic to fill me in on what had happened. \n\nThe first notice anyone got of it was the service desk asking who they should route my LastPass account to and why I’d be passing it around. One of the techs came up to my floor to find me, then found an empty desk. Asked around for where I’d moved to and noone knew. That was the first call, from one of the Sales drones trying to locate me. \n\nThe tech went to Dapper Dan’s desk and found my laptop with my ID and post-it note taped to it. He put two and two together, went back downstairs and checked the access logs and realised the last time I’d logged in was Friday. He then locked my account for security purposes and went to HR to check if there was a leaver form. \n\nHR checks, no leaver form AND a great big red cross next to 'employment contract received'. HR calls Dapper Dan, who’s not in the office. Dapper Dan says ‘No, contract should be on my desk, it was on there on Friday, I’m out on the road at the moment, give me till lunch time and I’ll sort it out’. Obviously thinking that I’m grandstanding. Starts to call me and leave messages then gets progressively agitated as he realises I’m not coming back. \n\nWhen he gets into the office, he can’t find the contract either so he goes to HR and ‘explains’ what has happened, says I have been stonewalling them and it’s cool, he’ll get it sorted, it’s between me and him. HR says erm, no, this is our thing now, and the HRD sends me the SMS. \n\nShortly after my phone conversation the HRD walks into a sales meeting and very abruptly pulls Dapper Dan out. They disappear into a meeting room where it may only be assumed that Dapper Dan was required to spell out exactly what had occurred and address the comments that I had made. I suspect he came completely clean at that stage.\n\nDapper Dan was subsequently reamed as only HR and senior management can ream a manager who’s f*cked up. He was demoted, decoupled from Marketing, his budget reduced by half and a new, separate Marketing function created. \n\nHis team were collectively put under review and forced to carry out their own reporting, tracking and metrics, which lacked the coherence and consistency that I’d been able to deliver. This reduced the capacity of the team. A couple of them left and they missed out on some key deals. \n\nIn the fallout they completely dropped the ball on the client website builds. They went to market to try and find a resource who could fulfil these builds, and Dapper Dan was reportedly astounded to discover that experienced technical marketing staff are both hard to find and expensive to recruit. \n\nThey were unable to fill the role and the builds were taken back inhouse by the tech provider, who now had an experienced resource to deploy (me). I ended up working on three of these at full utilisation rate, which was paid by the new company. I’m pretty sure Dapper Dan would’ve seen the funding arrangements for these and would know my day rate - which is substantially higher than his. \n\n*Much later*\nAs the sales lead, Dapper Dan had to bear the displeasure of his superiors for the full twelve months before he could claim his share payout. It would’ve been a really, really shitty twelve months for him. He resigned within two weeks of the anniversary of the purchase, and the company enforced a six month notice period and another 12 month no-compete clause. Any benefit he would have received from the share payout would have been consumed over that 12 months unless he switched industries or moved cities. Last time I saw he was on the job market. \n\nAs for me? Happily living the life of the contractor. I get paid for the hours I work and I work the hours I want. \n\nMy old marketing manager is now VP of something at a large multinational. I’ve used her speech several times when giving young, frustrated staff career advice. \n\nTL;DR\n\nOld school sales manager attempts to call my bluff. Hilarity ensues. ",
        "permalink": "/r/MaliciousCompliance/comments/8myu68/dapper_dan_fails_to_think_things_through/",
        "comments": [
            "‘Each job pays you twice. You get your money now, that’s your wage. You also get experience now, that’s how you get paid in the future.'\n\nUtterly brilliant",
            "OP delivers! \n\nWhen I saw '*Post Departure'* I knew you wouldn't let us down. Great work and a finished story!",
            "Well played and well written, my favorite. Also includes good advice; a 3x winner! Thank you.",
            "Reminds me of what a friend of mine pulled.. \n\nHe was the sole software dev on a new product... We had just been acquired, and he was under pressure to deliver.. He was used and abused by the new company, adding features, shortening deadlines, etc, etc, etc.. He took it without saying a word...\n\nDay of release comes. He sits in a room, with his manager, and others as the product goes live. Once it goes, he slides two pieces of paper, one is a letter of resignation, effective immediately. The second is a contract for $300/hr. They had no choice but to accept it... He ended up working for 6 months on that contract, ironing things out that he already knew were wrong, but didnt have time to fix while under the gun..",
            "This isn't petty revenge. I'd say this is r/prorevenge. 😁",
            "Wow. I'd consider this pro malicious compliance. Absolutely delicious ",
            "I don’t want Fop pomade. I am a Dapper Dan man!!",
            "I don't understand how *anybody* could think that the digital side of their business is a waste of resources in this day and age. Dapper Dan definitely dug his own ditch, then lay in it.",
            "Anyone who is looking at this and is deciding not to read it because of how long it is, don't do that. Just read it. It is an amazing story that is definitely worth the read.",
            "Legendary.",
            "By the time I realized how long this was, I was completely sucked in and no longer cared, I just had to find out how it ended. Congratulations, that was spectacular. ",
            "This was just beautiful.\n\n*Wipes a tear*",
            "Your former marketing manager sounds like someone i want to work for.",
            "Both malicious compliance and petty revenge, I say. Well done. ",
            "I started in inside sales, hated it.  Began gigging through the database to find easy sales.  Made my sales goals and beyond while barely picking up the phone.\n\nI became the marketing analyst for the sales department.\n\nAs time move on they forget why I'm there (to make others look good and to make their lives easier)  Get downsized.\n\nI like the job I fell into but I'm seeking contract work as well.  I'm glad you landed in a good place.",
            "This one is well worth the read. Nice writing OP!",
            "‘Each job pays you twice. You get your money now, that’s your wage. You also get experience now, that’s how you get paid in the future.'\n\nI'm not sure how my sorry ass have cruised through a decent career without ever considered this.\n\nThanks for this brilliant words.\n\n",
            "Wow, long read but seriously worth it. Nicely played and good on you for using the circumstances to better yourself.",
            "Can someone ELI5 me what the move was? I got a bit confused ",
            "That's some damn fine revenge! And I bet Dan really appreciates the \"experience pay\" he got from you.",
            "This is the best post on this site I’ve read. It’s so satisfying for those of us in support roles with management that has no clue how much we do for the company. ",
            "It's not often someone can claim the company is resting on their shoulders, this was one such time. Great read, wish you all the best in your role",
            "As soon as you said \"*An arrogant and headstrong late-forties man who lived for making deals and boasting about them. Shiny shoed, silver-tongued*.\", I knew exactly the man you referred to and imagined the sales director where I worked a handful of years ago, Exactly the same breed, where winning against everyone was more important than being right.",
            "Pro Malicious Compliance Revenge ",
            "> I quietly registered a domain name and parked it\n\nWhatever came from this part? Was this a domain the company would have wanted?",
            "Fantastic!!\n\nr/prorevenge would like to have a word with you",
            "This is just beautiful",
            "I will **never** not love this post.  ",
            "Combining 3 of my favourite subs (r/pettyrevenge, r/prorevenge & r/maliciouscompliance) into one elegant beautiful story. ",
            "Jesus...That hit the spot...I need a smoke. ",
            "This is a fantastically written story. You have a true talent with letting a story unfold. I thoroughly enjoyed reading this. ",
            "This was immensely satisfying to read. Possibly even r/ProRevenge considering a guy ended up completely out of an industry for trying to fuck you over",
            "Absolutely brilliant, from start to finish. Thank you so much for sharing, brilliantly written. Definitely fits malicious compliance by following the contract transfer rules to the letter!",
            "Bravo sir.  Easily the best thing I have read, and will read, all week.",
            "This story is an example of why this subreddit exists.",
            "This is by far one of the greatest turn arounds I've ever seen! Good stuff dude.",
            "I now have a new favorite quote, and I plan to cite it as\n\n\"Each job pays you twice. You get your money now, that's your wage. You also get experience now, that's how you get paid in the future.\" - u/DanishProtestPig 's Departed Marketing Manager",
            "OP! what year did this happen? you know, my husband had a very similar experience with a fellow in the same field of expertise, about nine or ten years ago. difference is that the husband got our Dapper Dan fired when husband tried to quit (i enjoy telling the story, if there is interest, but it isn't MC).\n\nwe are located in a large state in the south of the US.\n\nI would be amused if we had burned the same guy. ",
            "I'm going through the same currently. My new manager only wanted to move the software team further and further away from the non\\-software based company.\n\nSince I was the only one of the team aiming towards the needs of the company, this caused a lot of conflict with me and my manager. So therefore I decided to quit, still hoping I could work as a contractor here and there for the company.\n\nA week before the end of my employment, we disagreed on where I could do my work \\(I wanted to work from remote, and he couldn't convince me with reasonable arguments why I couldn't do my work from remote\\). Stubborn me says that I would take a day off if he wouldn't let me work from remote.\n\nHe then says: \"If you don't come to the office, you'll be suspended. Meaning that you can't have a goodbye drink anymore and an email will be send around explaining your continuous misbehavior.\".\n\nI reply: \"Okay, just make sure you pick up all the work I had promised others to finish today. I'm going to enjoy the sun.\".  \nHe thinks this hurts my chances to work as a contractor, whilst I believe the other managers will think this is a ballsy move of me.\n\nWe'll see how things will turn out...",
            "Thank god non-competes are unenforceable...except if the severance pay is equivalent to the pay a former employee would have earned for the duration of it. (In Switzerland)",
            "AAAAAAND I came.",
            "Worth the read. I say, well done!",
            "*Applause*",
            "Oh Dapper Dan, no longer dapper.",
            "Hi OP! I am going to be a Senior in University studying Marketing and Management. Could you touch on some of the specific skills you researched to make the transition into Technical? I am applying to tons of summer internships, but they are mostly Sales based. I have the knowhow on FB Ads Manager and Adwords, but I want to have more of this technical skill you speak of to justify my value as a Marketer who doesn't just do Sales. ",
            "Fantastic.\nThis is the kind of story that brings me to this sub. Great compliance, extremely malicious, 10/10.",
            "Solid TL;DR like a simple conclusion to an essay that was pleasant to read",
            "Haven't even finished reading through but I have to say the advice from your former manager is exactly the advice I needed. Been at the same place for nearly a year and a half now and I'm not going anywhere. I feel trapped and I hate my job. I can't even really support myself on what I make, tbh. Seeing my job laid out as being paid two-fold I realize that I'm no longer learning here, but instead stagnating. Time to get moving. Thanks. ❤️",
            "You are my hero - so fucking satisfying. I'm really glad everything worked out so well for you. And I'm stealing your boss's advice. ",
            "Beautiful. Both slick & professional.",
            "I can totally see this as being some new Office Space movie.",
            "That was the shortest TL;DR for the longest story.",
            "You write very well and I enjoyed reading your post VERY MUCH. I wish I have half of your talent. \n\nAnd, with your permission, I would like to hijack the quote of your mentor and use it as a desktop background.",
            ">Dapper Dan sneered at such things. He saw digital as a waste of money.\n\n\"Internet? What? That still a thing?\"",
            "she held up a hand, said ‘Stop’, and shared some life advice. ‘Each job   \npays you twice. You get your money now, that’s your wage. You also get   \nexperience now, that’s how you get paid in the future. So. Are you still  \n getting paid? Yes? Are you still learning? No? Figure out how to keep   \nlearning, or leave.’\n\n&#x200B;\n\nWow. +1",
            "Gaw Damm Dood, that was loooong! But, I read it, not only very interesting, but well written. Hope you are happy on your new Job. Best of luck!",
            "You should crosspost to /r/prorevenge if you like the idea of people masturbating to your professional life.",
            "When people with titanically good writing skills likes you post here, it really is super fun to read.",
            "This is one of the best that I've read in a long time.  Probably belongs in /r/prorevenge also.\n",
            "/r/pettyrevenge? No. Nonononono, my friend. /r/ProRevenge!\n\n\n\n[Just for you!](http://www.reactiongifs.com/r/5s.gif)",
            "Man reading this gives me hope that I’ll be able to break free from the 8-5 slavery and do something I enjoy with better hours.\n\nA man can dream...",
            "This is amazing. And thanks for including your old manager's advice! \n\nSide note, I love your username!! I learned about it from SATW.",
            "This is very well written. Thank you for taking so much time on the conclusion. Too many people build up the story and then leave out the fallout. I don't want to guess or imagine! I want to know.\n\nSo thank you for this excellent story-telling.",
            "I think I need a tissue.",
            "Where’s that long tag when you need one ",
            "This may be my favorite story I've ever read. It hits me on so many levels. I've worked with people like Dapper Dan, and its great to see there can be a happy ending",
            "I've read a lot of these but this is the first one I've commented on.. Bravo and good for you. \nThat's great advice as well. ",
            "You are one devious son of a bitch.\n\nI love it and I love you",
            "This is the most satisfying thing that's happened to me all year and it didn't actually happen to me. Thanks for sharing, OP! ",
            "Bravo OP! This is a great tale of underdog victory and revenge",
            "\"Brilliant from start to finish.\"\n\n- SSkulling",
            "I really enjoyed reading all of this. Bravo.\n\nAs a marketer, I totally understand the old salty sales guy mentality. My favorite chirp was \"all you do is look at fonts all day\" ",
            "Glorious!",
            "Well-written, and entertaining all around.\n\nThanks, OP, and continued success with your career!",
            "I really really want a red duck curry now. Damn you.",
            "Sadly another manager with the old \"sales make us money and IT costs us money\" mentality...\n\nAlso, this is definitly pro revenge",
            "\nI don't normally read these really long posts, but I thoroughly enjoyed that.",
            "That was fantastic. Well written, and a great read!",
            "Brilliant. Very well done, and very well executed.",
            "I believe this may be both pro revenge AND malicious compliance. ",
            "Man this was such a delight to read!",
            "This is r/prorevenge material",
            "Forget petty revenge. \nThis story is for r/prorevenge. ",
            "This story is inspirational. As someone in a similar position I can only say I hope to have such drive and intelligence in the coming months/years. ",
            "This is the shortest TL;DR to a giant wall of text I‘ve ever read.",
            "I kept wanting this story to go on.\n\nAmazing tale man. ",
            ">Naturally I went and complained extensively to the departed marketing manager over drinks. After listening sympathetically for 45 minutes, she held up a hand, said ‘Stop’, and shared some life advice. ‘Each job pays you twice. You get your money now, that’s your wage. You also get experience now, that’s how you get paid in the future. So. Are you still getting paid? Yes? Are you still learning? No? Figure out how to keep learning, or leave.’\n\nPhenomenal!",
            "/subreddit",
            "Long ass story! ....But beautiful!",
            "Dapper Dan sounds like a real prick.",
            "You, sir, honestly do yourself a disservice by adding the TL;DR. You write so beautifully, I was genuinely disappointed that I got to the end, and didn't notice the passage of time while reading.  With the benefit of some pretty serious wisdom from your OMM, you seem to have deftly handled that entire situation with a level of intelligence and class that is (sadly) quite rare - kudos to you. I was satisfied that it turned out well for you; the fact that DD received some comeuppance as well was sheer luxury!  Well done all 'round, and thanks very much for sharing. As many have noted, OMM's advice resonated, and will remain. Cheers!",
            "Absolutely amazing, thank you for sharing. I'm commenting mostly so it's easy to find again in future.",
            "Petty revenge? Oh no, that warrants being crossposted to pro revenge.",
            "Fantastic read. Thanks for sharing, OP. 👍",
            "Damn that's doing it right",
            "I don't want Pomade, i'm a Dapper Dan man!",
            "Proud of you!",
            "Hope dapper dan learned his dapper damn lesson ",
            "I did not have the time to read all of that!! I still did though, because it was fantastic!",
            "My dude, this is definitely not r/pettyrevenge. You planned your actions very carefully, knowing full well shit would hit the fan.\n\nThis is r/prorevenge.",
            "Stories like this are why I come to this sub. \nTotal lack of thinking threats through, no appreciation of jobs others do as no understanding andddd most importantly comeuppance.\nThanks for sharing, nicely written too.",
            "TL: read anyway- worth it.\n",
            "I know I'm late, but care to provide any more detail on the voicemails?  I would love to experience the growing despair of Dapper Dan.",
            "Honestly that career advice is probably some of the best I've heard, I am definitely going to have to start remembering it more.",
            "This was so well-written and extremely fun to read. I didn't want it to end. Hope all is well, OP!",
            "In B4 this gets guilded, if only for the old marketing manager quote.",
            "Is it just me or is this hard to read. Maybe I'm not smart enough. I got most of the gist and loved it, but man, that lingo made me feel like I was swimming in technical soup...",
            "Why do people make tl:drs like that",
            "Thanks for this thorough story , I enjoyed it as I did the inner muahahhahhas inside ",
            "So it’s safe to say you’re definitely not a Dapper Dan Man!",
            "Why does this not have more upvotes, it's legendary",
            "Geez, Dan clearly didn't realise your value for the company which automatically makes him a bad manager!",
            "I think we've also all learned a lot from this too. ",
            "Beautiful. You set it up, and he executed as you thought he would, and you got yourself out of the way. Well done.",
            "anyone else see the title and think this was gonna be about the fashion designer Dapper Dan lmao",
            "Petty and Pro. Well done",
            "Worth the xl",
            " You Glorious and magnificent righteous bastard, have my upvote.  That was incredibly satisfying.",
            "Read all the way through, worth jt",
            "dam what a great story and I didn't expect to find a new quote to live by. Thanks =)",
            "This was really long but I read and enjoyed every line of it. Well put and perfectly planned revenge. Kudos!",
            "This may be the most brilliant plot I have seen in the past year.",
            "That is excellent advice and writing.  I can see why your story was gilded. ",
            "Excellent work. Good example on not burning bridges even if you have an asshole boss. ",
            "Standing ovations.",
            "This has to be what dreams are made of.",
            "Baller! ",
            "> She also mentions the day rates for highly qualified, industry-certified staff, mentioned that Tech Provider were really struggling to find such staff and gives me the number of a recruiter who may or may not have been on Tech Supplier’s preferred supplier list.\n\nWhy would a company do this over contracting the candidate directly? Recruiters are paid to find candidates and screen them, but if you have already found someone and like them why unnecessarily pay the many thousands of dollars in recruitment fees? ",
            "This is truly the best sub on reddit. Justice boners abound.",
            "/r/pettycompliance?",
            ".",
            "Long, but a good read. Keep up the good work!",
            "Pro revengs my friend",
            "I was hesitating to read this long thing but oh boy am I glad I did, great stuff.  ",
            "Dapper Dan is my main man (not actually, it's just an obscure Panda Bear reference)",
            "ELI5?  I’m buzzed.",
            "You’re a very good writer. That was a pleasure to read. ",
            "A great write up and pure joy to read. Thanks for taking the time to share!",
            "My first instinct is to not like anyone that *chooses* to go into Marketing. But you? I like you. :)",
            "You are a genius. You played the long con and didn't just come out on top, you dominated Dapper Dan. \n\nHats off to you!",
            "That was an excellent read. Well done. I’m in awe. ",
            "I enjoyed this thank you.",
            "Excellent story. You're a very talented writer, as well, so it's easy to imagine you being a successful marketing guru. Congrats on one upping the sales guy!",
            "I normally don't read posts that long, but I did and it was worth it.",
            "As for the shares thing, I didn't quite get that. Was HR mad because Dapper Dan had gone against company policy in not issuing you any? Or was that just them recognizing that he was being a shit stain on top of everything else but it was his discretion?",
            "This is glorious. ",
            "The payback here is so satisfying to read, it might as well be pornography",
            "Did you really censor fuck? The fuck?",
            "Thanks for posying, it was a good read! Kept pulling me along. And the post departure piece, excellent addition!",
            "All I remember is that Dapper Dan was in Oh Brother Where Art Thou?",
            "10/10 thoroughly enjoyed the read",
            "Beautiful. That's some fantastic advice. I'll keep that in mind. Thank you for this great story!",
            "DELICIOUS",
            "*This feels sooo good*\n\nI love it. ",
            "I don't often save posts. I saved this one. It's beautiful.",
            "…",
            ">long service leave\n\nAussie?",
            "The former manager's advise is very good, but there are other factors to consider also.\n\nHow much stress does the position cause you?\n\nIs the culture of the team/company good?\n\nDoes the company support your goals?\n\nDo you enjoy most of what they ask you to do?\n\nDo they value your contribution to the team?\n\n[edit: formatting]",
            "Wait did you get the new job, payout for leave, AND the shares since there was nothing on record to say you didn't?",
            "This belongs in /r/prorevenge as well. Fantastic!",
            "This might work on /r/talesfromtechsupport too, not entirely sure. Seriously, well fucking done man, I would have never have thought to do this. That lady's advice was genius.",
            "It's not every day you get to fuck Duck Phillips as only Donald Draper can.",
            "Thankyou, great words",
            "Brilliant story and well done for sticking it to dapper dan the useless management man. I'm glad it worked out much better for you in the end, the rest of us will have to slog it through until we can find light at the end of the tunnel like you. ",
            "*His name is Dapper Dan*\n\n*He smells like he just sat on the can*\n\n*hmmm hmmm hmmm la la...*",
            "> Not sure if this is Malicious Compliance or Petty Revenge...\n\nI'd say it started off as /r/maliciouscompliance and led into (maybe unforeseen) /r/prorevenge",
            "That was thoroughly satisfying to read!\n\nWhat would you have done if you hadn't received your ultimatum? I imagine the same: simply not sign the new contract. Technically you've been fired already. You simply chose not to accept the replacement offer.",
            "Lul",
            "Satisfying conclusion, had to pick up the story a day later halfway. ",
            "Amazing and definitely worth the read. Way to cover your ass!",
            "That was fantastic. I didn't understand all the jargon (we have different jargon in the medical field) but the storytelling was excellent. I might need to see a doctor about this case of justice-induced priapism.",
            "Marketing manager sounds fun.",
            "The best revenge is living well- good job!",
            "Thank you for sharing, like /u/yzpaul puts it. Amazing way to put it.",
            "Domino Effect",
            "TLJ\\-Luke\\-This\\-Is\\-Not\\-Going\\-To\\-Go\\-The\\-Way\\-You\\-Think.gif",
            "Awesome story and 5 stars for writing it so well.",
            "Wow, that really is something. ",
            "> On Monday, I’m enjoying a long walk in the spring sunshine with my dog, who’s incredibly happy that his human has not disappeared down the driveway at 0720 per normal.\n\nOh, man: I just changed jobs, and had 3 months off in between. Those mornings at the park with my dogs, *every day*, were such a joy. 10/10, can relate. ",
            "This deserves its own XXL tag",
            "Non compete clauses are illegal and do not hold up in court",
            "We\n(-@",
            "Bro this totally also r/prorevenge",
            "More internet points for you! Copy and paste to r/prorevenge too! ",
            "really though, if you don't get this story, you're on the wrong slope of the bell curve.",
            "Holy shit, this is way too much r/pettyrevenge",
            "Great story, but the timelines and clarity over what problems actually were are a bit vague. And something pretty irrelevant about a blog and domain name squidged into the middle. ",
            "Can I have a proper tl;dr? Kinda hard to follow lol",
            "!redditsilver ",
            "I can get this up to 1k karma..",
            "Seriously keep it short. Did not need to be this long",
            "Why didn't you go to HR immediately with this info as opposed to fucking your company over one person? You said they lost some key sales.. that sucks for them.  It came off as very entitled but you do seem to be a smart person work wise. ",
            "[deleted]",
            "This guy is so incredibly chuffed with himself, at every moment, that it was too annoying to finish. ",
            "*Swoon*"
        ]
    },
    {
        "post_id": "tbfcqe",
        "author": "pinkfloss9",
        "title": "I uno reversed a malicious compliance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tbfcqe/i_uno_reversed_a_malicious_compliance/",
        "score": 16060,
        "num_comments": 483,
        "created_utc": 1646964710.0,
        "selftext": "This happened years ago when I used to work at an office as a front desk one summer during college. A video I saw today just reminded me of the incident. One day this lady came in to pay a fine. She was very rude and angry about her fine. I don’t know the particulars because all I did was work the front desk. She decided to try a little malicious compliance. Her fine was about $250 and she said she was going to be paying in quarters. I knew I had to comply since we’re supposed to accept any legal tender \n\n I took the bags from her but realized that she had unrolled every single roll of quarters. She said that since we want to waste her time with a stupid fine, she will also waste our time. I tried to explain/beg her not to do this to me, since I had nothing to do with her fine. She didn’t care and said that we’re all evil. She smirked and said “one band one sound”. I realized then that there was no reasoning with her.\n\nI was furious but I began counting one by one. We were interrupted by multiple phone calls and customers so I had to restart a few times. She started to realize how long this would really take. She tried to stack  the quarters to help me count faster but I told her that it was my job. That I couldn’t just take word that the stacks were correct so I had to do it one by one like she asked for.\n\n2 other came, paid and left while she was still standing there. She started getting mad saying that I was wasting her time on purpose. I told her that we don’t have a coin counter so this is how long it would take. She threatened to call the police, I told her to go ahead that I’ll have to restart when the police gets here so I can be sure to get an accurate count. After someone else came and left she finally snapped. She whipped out her credit card and paid.\n\nAs she was leaving she snatched one of the bags of the counter but the handle gave way spilling all the coins all over the floor. She scooped up what she could but left a good chunk. I told her she was littering and  she flipped me off. \n\nI got a broom and swept up the coins. There was about 192 quarters on the floor. When I was leaving work I found some more in the parking lot. It wasn’t a whole lot of money but for a broke college student it was great.",
        "permalink": "/r/MaliciousCompliance/comments/tbfcqe/i_uno_reversed_a_malicious_compliance/",
        "comments": [
            "Laundry for months baby!",
            "“Why the sudden change?”",
            "lol. Her attitude cost her $50 in quarters and increased the fine to $300. Well played lady.",
            "> I told her she was littering\n\nLmao, best line of the story.",
            "Hey 50 bucks is 50 bucks.",
            "I find this hilarious…as someone whose worked in a business that accepted cash payments before it’s really annoying when inconsiderate people do something wrong and then get annoyed they have to pay for something as a result. So when rude people had deliberately saved their smallest change to pay for things just to be an ar$ehole about something I had no control over - then I’d make sure I did my job and counted every last cent to make sure they hadn’t underpaid.\n\nEdited for spelling",
            ">  I told her she was littering and she flipped me off.\n\nYou. I like you.",
            "Random piece of somewhat related trivia. Here in Australia is Currency Act 1965 have conditions for coins to be considered legal tender  \n\n\n* not exceeding 20¢ if 1¢ and/or 2¢ coins are offered,\n* not exceeding $5 if any of 5¢, 10¢, 20¢ and 50¢ coins are offered,\n* not exceeding 10 times the face value if the coins offered are greater than 50¢ up to and including $10,\n* to any value for coins of other denominations above $10.\n\n&#x200B;\n\nWhat this means is that there is no obligation to accept it as payment (although there is nothing stopping you from accepting it anyway) if the total value of the coins exceeds $0.20, $5, and $10 respectively. It is certainly good knowledge to have when working at a bar with some of the more... difficult customers!",
            "\"since I had nothing to do with her fine\"\n\nThat is why I've never applauded someone who was proud of doing this. You're not sticking it to the man, your sticking it to some poor innocent worker who had nothing to do with whatever led to your being there and probably has more annoyance at \"the man\" then you",
            "She fucked around and found out.",
            "Sounds like she had a change of heart.",
            "You're a heroic figure off civil employment.",
            "I think it’s funny that you counted them one by one and told her this is how you have to do it. And when you lost count you started over. 🤦‍♀️ If she wasn’t smart enough to make you use some sort of stacking method, she deserved what she got even more than she already deserved it. \n\nI’m also curious what she thought the police were going to do. I can’t think of any possible argument she could make that you were breaking a law.",
            "I want to believe that you saw the 192 quarters on the floor and instantly counted them like Rainman, and that you could have counted them quickly but chose not to.",
            "I can't properly describe how beautiful this was.",
            "Nothing like getting a $48 dollar tip because you complied. \n\nI recall back in the 70s or 80s, some guy tried to pay his tax bill in loose pennies. Several hundred dollars worth. The clerk advised him that he could not accept that many pennies. Somehow it ended up in court and the man was told he either needed to pay his tax bill in paper currency, check, or credit card. Why? because no where on a US Coin (Not even a dollar coin) are the words that state it is legal tender.",
            "\"I'll have to restart when the police get here\" omg that's terrible 😂",
            "Love it!",
            "Hahahahaahah. That’s gold 🥇",
            "I've been in that boat before.\n\nNot payments, but the race to see who cares less.  *I'm here until the end of my shift, but you want to leave now.*  I already know that I care less, and it's going to be really entertaining to watch the bad customer learn that.",
            "Don't most countries have a max amount of coins you legally *have* to accept? Like in Canada it's\n\n\n(a) forty dollars if the denomination is two dollars or greater but does not exceed ten dollars;\n\n(b) twenty-five dollars if the denomination is one dollar;\n\n(c) ten dollars if the denomination is ten cents or greater but less than one dollar;\n\n(d) five dollars if the denomination is five cents; and\n\n(e) twenty-five cents if the denomination is one cent.”",
            "I didn't realize people were posting erotica in here. Wow that's amazing. Well done",
            "hahahahahha",
            "Well you sure changed her mind",
            "Free laundry days",
            "> There was about 192 quarters on the floor.\n\n\"About\"? That's an oddly specific number for an estimate.",
            "Damn, I just gave away my free award.\n\nTrue Uno Reverse card.  Played like a champ.\n\nEdit:  I mean, even farther, this is the uno reverse card that wins the game.  They think they're getting you stuck, but you sat on that card, ready.  When the game got reversed back to you, you reversed it back to them, and won the game.  There was no turning back, she was FORCED to lose, and FORCED to sit through the consequences of her actions.  Bravo.",
            "Always hilarious when it dawns on someone trying to pay for something with a bunch of change that the person they're \"punishing\" is getting paid to sit there and count coins while they are just wasting their own time.",
            ">She started getting mad saying that I was wasting her time on purpose.\n\nShe started it.:D",
            "<STANDING OVATION>  Author!  Author!",
            "Play stupid games, win stupid prizes.",
            "\"I'm going to waste your time!\"\n\nI'm paid to be here either way.",
            "192 ÷ 4 = $48... nice tip.",
            "You're sick and I love it",
            "She was not really wasting your time - you were getting paid just the same.",
            "The whole story was great but you getting some extra cash out of it is just _chef's kiss._",
            "Hey, quarter = free laundry!",
            "Wouldn’t have worked in my country. Quarters are only legal tender up to $10 specifically to prevent this type of MC.",
            "Love it how she thinks she’s going to waste your time when she has to stand and wait as well…lol I would have added oh by the way since you gotta wait as I count all your change, I get paid to do this. Do you have to work today?…lol",
            "In a bygone age, you could've spend an entire weekend in an arcade.",
            "So THAT'S why there was a coin shortage!! XD",
            "Seem like you gave her no quarter.",
            "Well I'm glad that where I live you can't be forced to accept more than 50 coins per payment.",
            "In Australia, you could have legally refused that amount of coins.\n\nhttps://www.lifehacker.com.au/2017/02/what-are-the-maximum-number-of-coins-you-can-legally-pay-with/",
            "$48 Thats the price for a decent dildo",
            "Helpful hint, when counting quarters or any change for that matter, keep one coin from the “dollar” counted to represent the dollar. You wouldn’t have to restart, because you’d just need to keep counting out dollars. Five dimes and fifty pennies? Keep a penny and put the rest in the bin.",
            ">one band one sound\n\n\nDid she just quote..... Drumline the movie? ..... Unironically?",
            "Hey, that's $48 that you can use towards anything else that you might need change for. Score you.",
            "That's the best story I have ever read on this Reddit.",
            "I used to do something similar to people paying with ludicrous amounts of change when I worked as a cashier.\n\nSometimes people seemed like that was all the money they had so I would count 'wrong' and give them some change back.\n\nOther times you'd get those snarky impatient people who have dumped $20 worth of 5c pieces on the counter.\nI'd count just slow enough that they couldn't complain that it was intentional and if a stack accidentally toppled over well... Have to be sure and count it again.",
            "You should have gotten her a chair for her to sit in while you counted. lol",
            "I mean what did these idiots think would happen?\n\nAlso even if they were rolled how do we know she didn't short change them 1 quarter each?",
            "WHOA!!! 4 gallons of gas?!?! Nice!",
            "That is AWESOME!",
            "This is wonderful",
            "Sweet!",
            "We need to pick up on this issue of coin littering sooner",
            "Glorious!\nI hate people like this who give normal folks just doing a job a hard time.",
            "Not sure if you had a scale around but I find weighing coins to be a decent option for calculating how many there are",
            "Mama Cass did this with $10,000 in pennies, the stunt cost her about twice what the bill would have. Which is why no one does it.",
            "you made me laugh today, thanks for sharing lmao :D",
            "Bet it was a Walmart plastic bag.",
            "This was incredibly satisfying to read. Thank you",
            "omg, this is one of the best ones I've read.  i can just see ur getting all flustered and more and more angry lmao",
            "Think of all the cheap little toys you can buy with that!",
            "Did she think she could just go roam the store while they count her coins at the front desk? Lmao you want to waste their time, you’re going to have to be present for all of that wasted time",
            "This is delicious",
            "After all that she left you a tip?",
            "I got this all the time when I was a cashier. It was better when they were rolled. Then you had to open them up and count it all. Lol pissed many people off.",
            "Karma bit that dumb--s b--ch in the butt!!",
            "This sounds like a win win to me lol. I love this",
            "To be honest, even if the quarters were still rolled in paper, you would have to verify that the number of quarters in each roll was correct. It wouldn't have saved time. You'd still have to count them.",
            "The pleasure I feel imagining this Karen loosing her shit by her own fault !",
            "> I used to work at an office as a front desk\n\nSo, I've got to ask...\n\nWhat's it like working as a front desk?\n\nAnd does your office have openings for other pieces of furniture?\n\nEdited to add quote since some people apparently missed the joke.",
            "That's not just undoing MC, it's also #ProRevenge. Well played (I'm sure I'm not the only one saying this)",
            "Probably the most reddit title anyone has ever written outside of the wretched r/rarepuppers",
            "I am a bit lost trying to figure out how you can be a front desk and later work at one.\n\nMost desks I have encountered are inanimate objects made of wood or steel.\n\nEdit - I get it now, you had help from autocorrupt that changed \"at\" to \"as\".",
            ">about 192 quarters\n\nThanks Rainman.",
            "You got a job as a desk? Don't they usually have furniture for that?",
            "So, she was a Karen before anyone knew about Karens?!",
            "I know some places have a rule that they won't take loose change beyond a certain amount if it's not rolled.\n\nI don't know if your place had that policy, but I would've told her anyway \"That's great, but we won't accept that amount of loose change.  Roll it and come back.\"",
            "I-uno = mrcn card gain?",
            "I hope this is true. Fantastic.",
            "That’s like 54.5 so cups at a punch party in college, back in my day…. Not sure how inflation hit coolaid and cheap vodka",
            "This is awesome! The fact that she was punishing you for something you didn't do and it back fired on her made this story a million times better!!",
            "Couldn't you just weigh the quarters with a scale? It could be done in seconds. It might piss her off more. The hardest part may be finding a scale though.",
            "> Her fine was about $250 and she said she was going to be paying in quarters.\n\nThis is illegal in some countries. For instance, here in the UK, coinage is only allowed to be used up to a certain amount:\n\n* 1 pence coins > up-to 20 pence\n* 2 pence coins > up-to 20 pence\n* 5 pence coins > up-to £5\n* 10 pence coins > up-to £5\n* 20 pence coins > up-to £10\n* 50 pence coins > up-to £10\n* £1 pound coins > any amount\n* £2 pound coins > any amount\n\nOf course shops *could* decide to let you pay with more, but they're not obligated to under the law, and can refuse you service.",
            "If you were a broke college student, then the police don't pay enough.",
            "I love this so much. Bless you",
            "This is art at its finest",
            "Well, that was a nice reverse..",
            "Beautiful",
            "Hey thats laundry money for a while",
            "LOL, that gave me a chuckle ! Good job done",
            "well, of course you put the to the credit of her account, for future necessities!",
            "Let all the world over hear the song of PinkFloss9",
            "This is great.",
            "Hahaha! Tanks for the friday laugh!",
            "👏👏",
            "lmao, bravo",
            "This is delicious.",
            "I think you handled this Karen problem like a pro.  Idiots thinking they are disturbing a company or police stn. and shit on a Cashier are just idiots!  I get frustrated when any \"worker \" is treated as if they made the rules, they raised the prices, they fined you for an illegal problem!\nTake you're big mouth to the proper office.",
            "This is just beautiful.",
            "The perils of Khajiit college.",
            "Where I went to college when you borrowed money from other students they would often accept only 75% repayment if it was done in quarters (for laundry and vending machines). (This was before bills were commonly accepted in vending machines.) Since I went home every other weekend, I did not care about quarters... but I never had any money to lend anyway.",
            "This might be one of my favorite stories I’ve read. \nTake their pettiness and make it worse for them.",
            "Wow, considering it is 40 quarters a turn on the Waterworld arcade game, you could play nearly 5 steps!",
            "hahahaha :D\n\nGoddamn I laughed at this. At least they weren't pennies.",
            "when your spaghetti falls out while out in the world",
            "There may be laws around paying in coins to prevent bullshit like this. In Canada the highest amount that can be paid in coins is $40 but it has to be paid in two dollar coins, and the highest dept that can be paid entirely in pennies (when we had pennies) is 25¢. https://laws-lois.justice.gc.ca/eng/acts/c-52/page-1.html",
            "Thos lady dropped a Drumline reference?? \"One band one sound\"? Wow....that's an odd one to pull out of your pocket",
            "\"I Play: Malicious Compliance\" \n\n\"You've sprung my trap! Reverse Compliance!\" \n\nStunned",
            "In Australia, too many coins is not considered legal tender. From the Reserve Bank website:\n\n> -not exceeding 20c if 1c and/or 2c coins are offered (these coins have been withdrawn from circulation, but are still legal tender);\n\n> -not exceeding $5 if any combination of 5c, 10c, 20c and 50c coins are offered; and\n\n> -not exceeding 10 times the face value of the coin if $1 or $2 coins are offered."
        ]
    },
    {
        "post_id": "o6ehej",
        "author": "None",
        "title": "Lazy IT guy asked me to make sure other people had the same problem.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/o6ehej/lazy_it_guy_asked_me_to_make_sure_other_people/",
        "score": 16065,
        "num_comments": 807,
        "created_utc": 1624460233.0,
        "selftext": "A few years back I worked for a small ish company ~100 people. We had a web service which was notoriously poorly maintained by IT. The service worked on IE, but was buggy on Firefox, chrome etc... occasionally when a new version of a browser was released the webservice stopped working until IT got around to fixing it. \n \n\nSo one day IE releases a new version and it breaks the web service so I submit a service request to IT. I wait a few hours doing other tasks but eventually get to a point where this problem is literally preventing me from doing my remaining work. \nSo I go down to the IT guys desk, he's playing games on his phone, and ask him about the issue. He says the issue is not currently high enough priority and it won't be addressed until it becomes a priority task. How do service requests become prioritized? They have to have multiple people report the same issue. \nHe then says \"if you want me to work this issue make sure someoneone else has the same problem. It might just be a 'you' issue, not a browser issue.\"\n\nSo I go and tell all my coworkers to install the newest version of their browsers to see if an ongoing issue has been fixed. Before long no one can do any work. The webservice is down for everyone on the newest versions now. He gets bombarded with service requests and the issue becomes prioritized. I come in the next day and the web service is working properly.",
        "permalink": "/r/MaliciousCompliance/comments/o6ehej/lazy_it_guy_asked_me_to_make_sure_other_people/",
        "comments": [
            "There is entirely a chance this IT guy was also doing Malicious Compliance. Someone above him said to stop wasting time on non prioritized tickets.",
            "As someone who used to be the dev fixing stuff, getting a bunch of people reporting the same thing like this was actually helpful. Whereas I personally would always *want* to prioritise things like this, management had their own set of rules they wanted me to follow instead. Can’t speak for your guy, obviously, but for me what you did would have been awesome.",
            "As someone who works in IT...\n\nUser: Everythings down! HELP!\n\nMe: When you say everything what do you mean?\n\nUser: like everything I cant work!!\n\nMe: \\*sigh\\* Please be specific, do you have power?\n\nUser: Yes... but I cant do anything.\n\nMe: so your Pc is on you just cant get on the web.\n\nUser: thats what I said!\n\nMe: ok is it one site or all sites.\n\nUser: EVERYTHING\n\nMe: Can you get to [google.com](https://google.com)?\n\nUser: well...yes...\n\nMe: [CNN.com](https://CNN.com)?\n\nUser: um... yeah that works too...\n\nMe: ok so specifically whats not working? \n\nUser: I cant get to this link my brother sent me!\n\nMe: send me the link?\n\nUser: [Facebook.com/somerandomlinkaboutcats](https://Facebook.com/somerandomlinkaboutcats)\n\nMe: Ahh yeah management asked us to block facebook links last year... sorry.\n\nUser: oh thats facebook? \n\nMe: yup...Anything else I can help you with today?\n\nUser: well can you unblock it for me?\n\nMe: Im hanging up now and going back to drinking...",
            "This doesn't seem like malicious compliance. Seems like there was a policy in place that they needed to follow and you helped it move faster. They said more people needed to have the issue, you made sure more people did have the issue, and they fixed it fairly quickly. Sounds like everything worked like it was supposed to.",
            "Not to say he wasn't being a lazy shit, but as IT I get where he's coming from. If one person complains about an issue, it's lower priority than if everyone has it. That being said, if you told him \"hey, when I updated the browser this happens\" that should have been a red flag to go ahead and get that resolved now before it became a bigger problem.",
            "It's standard practice to prioritize based on how extensive an issue is and how much it affects business.",
            "this is how IT incident response / triage often works. I mean dude shouldn't be playing games, but where i come from a P4 (low priority issue) doesn't get all hands on deck treatment. An incident can become higher severity and warrant more resources / attention when it is confirmed to be impacting more people than just one user or one site.",
            "Protip for users: Working in IT doesn't mean I automatically know how to do your job.\n\n* What do you expect to happen.\n\n* What actually happens.\n\n* What are the steps so I can reproduce the issue my end.\n\n* Are there any errors? If so, provide a screenshot. If the error prompt has a \"details\" button\" that provides the error stack then send that across too.\n\nMuch love\n\nYour IT Guy x",
            "Thats some fine \"Karening\" there.\n\n\n-doesn't think they have to follow protocol.\n\n-runs to who they think is the manager\n\n-assumes everyone is not doing their job\nand my favorite\n\n-when following the protocol, thinks that the person is getting in trouble.",
            "As an IT guy I am amazed that an app that worked on a specific version of IE didn’t have a group policy set to prevent users from upgrading the IE version. It’s very typical that an app especially an in house built app worked only on IE 8 for example back in the day. We would prevented our users from having the ability to upgrade IE in the first place.\n\nEdit. I’d also like to note that it’s typical to rollout the new version of IE or your selected browser version once the app has been fully smoke tested. \n\nI also don’t feel like the IT guy was lazy, most likely the end user who reported the issue didn’t follow the process. Was this a walk in reported issue? If so that may be breaking company policy as I have worked frontline desktop support in the past and all issues were to be reported via phone, ticketing system customer portal, or email and walk ins weren’t allowed. Company policy. \n\nHe could also have been on break, or running a process waiting for the results, etc. Could he have sounded more professional? Sure but I also remember working frontline support and people walking up to me at all times even while on a break to try and directly report an issue to me vs using the proper notification channels. If the proper notification channels were used then the ticket queue would have a ton of tickets reporting the same thing making it easy to prioritize the work. Just my 2 cents.",
            "I work in IT as well. Used to manage two Support teams a while back. We had a weekly top “dumbest tickets” list. My personal favorite was one where a dude sent a ticket complaining that his desk is crooked. I shit you not, the man wrote a literal essay about how his crooked desk is preventing him from doing his work. \n\nThing is that people complain stuff isn’t working properly all the damn time even if the real issue is them not knowing how to use the software. When you have one person coming in to say “this isn’t working” you aren’t going to immediately drop the other 124747 tickets in your queue just to spend the next 5 hour investigating something that might or might not exist. If more people complain about it then yeah, it’s worth prioritizing because chances are there is an actual issue there.",
            "I’m falling on the “Stay in your lane, luser.” side of the responses here. While he may have been playing Angry Birds, he could also have been getting his 2nd factor to log in to them AWS admin console. Or just catching up on tech news while waiting for a status bar to reach 100%. If he’s really playing on his phone all the time, his manager should hear multiple complaints.\n\nAnd knowing if the issue is affecting one user or multiple is critically important both to troubleshooting and prioritizing an issue. By getting _everyone_ to upgrade and not just one or a few, you magnified the severity of what would otherwise have been an issue with limited scope that he could’ve “caught early thanks to your help”.\n\nJudging from your tone though, I suspect he was either impudent to some degree, or at least seemed lazy and/or irritated that he had to work on this, which is unprofessional. But it is an annoyance when a large corporation whose actions you can’t control routinely changes your work environment in ways that create random tasks of unpredictable difficulty at unpredictable times. (Microsoft - updates.)",
            "I feel resentment towards IT in this post. Most IT people have to deal with resentment from users all the time, many government web apps still to this day only work on IE.  It's a waste of resources to support more than one browser.   \n\n\nI mean, maybe there is an issue with playing a game on his phone if it's a regular occurrence, but could just be taking a break?    \n\n\nHe was right to prioritise his work, If you knew that was going to break the other computers I think that's just a bit mean, you could have just told IT the new update for IE breaks the site.",
            "The fact that it only worked with IE and broke with every little release should have been a big giant red flag indicating the website needed to be re-written from scratch.",
            "The 1 IT guy that does your support is also the one managing web services and you've laid the blame for front end development on him. Sounds like instead of fucking around on his phone he should have been looking for a less shitty job.",
            "meh. Is the IT guy lazy? Or do you not understand how IT jobs work?",
            "IT guy here.  We have to filter a lot of bullshit from customers.  In some cases, it's because we actually do have higher priority things.  An entire department being down is more important than one isolated incident.  An inconvenience is less important than an outage.  In other cases, it's because the customer feeding us incorrect information (whether because of their lack of IT savvy or in effort to make us think the problem is more important) can actually get us looking in the wrong place, and make it take longer to fix.\n\nI can't count the number of times I've gotten the call, \"All of our computers are down.\"  When it turns out that one computer is having a very specific problem with one module in an application.  Here I am troubleshooting the switch, domain controller, etc., when all I needed to do was troubleshoot their computer.",
            "I work in I.T. and I side with the IT guy, you would not believe how many users report \"THE NETWORK IS DOWN!!\" when they kicked the fucking cord out of the wall, or they installed some stupid shit on their machine.",
            "O hey look, a user that thinks their problem is more important than everyone else's.",
            "Typical user:\n\n\"IT asked me for more information, those lazy fucks!\"",
            "Our IT guy knows it's going to be a bad day when he gets into the office and everyone is excited to see him.",
            "Where was the lazy?",
            "It's not laziness, if it's someone else that needs to look into the issue, it won't be prioritised until it's impacting a specific number of users.\n\nI work out of hours IT, and on-call will only pick up priority 1 outages, so fair enough you not having access to your email is an outage to you, it doesn't fall under an OOH escalation outage.",
            "\"IT guy is working based on ticket priority and I made the ticket a priority\"\nNot malicious compliance, but go off I guess.",
            "I hate the stigma that catching someone once on their phone means they're lazy. He should be able to do whatever he wants on his coffee break, including playing games on his phone. Demanding someone work during their coffee break in actually illegal in most jurisdictions.",
            "ITT: 10 types of people: those with no clue of how IT departments or their staff operate, and those that work or have worked in IT.",
            "as the IT guy, I've done the same. The company you work for probably sucks balls, too. Also if I cherry pick tickets with the new setup of teams, it bypasses other people and they now have political issues with me or even worse my boss. \n\nMy boss cool and does not need the extra bs from the other teams.",
            "What game was he playing?",
            "You should've gone to Jen first about it.",
            "LOL, reading through this thread is amazing.",
            "So...it sounds like it was working to some degree in IE, but then you updated IE on your own and turned your setup into a snowflake that was unsupported. So instead of removing the update or asking ITs help in removing it because you updated something outside the standard, you decided instead to wreck havoc by getting other people to change their environments too. 🙄",
            "If you had a web service that didn’t work in all browsers, that shit had nothing to do with “IT”, that has everything to do with the half assed Developers that wrote it.  Don’t confuse the poor IT staff with the so-called developers that write awful software.  They aren’t the same thing.  Trust me, it’s just as frustrating for support staff to have to catch flack for a mess they didn’t create.",
            "Half of Reddit works in IT, OP bout to learn the hard way lol",
            "As someone who works in IT, I get both sides here. Front lines of IT just do basic troubleshooting and escalate it to the appropriate department. Then wait for a solution. The more people that becomes affected by the issue, generally the more people higher up get involved and the quicker a solution is found. But it is annoying if a tool you use to do your work doesn't actually work.",
            "I guarantee that users were told only to use IE as 1000's of rubbish web based applications that obviously need modernised, are specifically written to run IE since it is ubiquitous among a windows enterprise environment and these interface with many other critical systems that cannot be upgraded without replacement never mind an upgrade.\n\nPoor IT guy was most probably using downtime in between tasks and was following procedure only.",
            "My husband works in IT on the hardware side. Only last week something on the software side went wrong and he was faced with a similarly lazy colleague. It's important to note that hubby will go out of his way to fix things before passing it into anybody else, even if it means longer hours for him.\n\nThis issue was effecting *everyone* currently working from home, roughly 150 people. It was making their jobs very difficult but not totally impossible and knowing how bad (We'll call him Jake) Jake is, they were all calling hubby knowing how helpful he is.\n\nAnywho, after a couple of days, he'd totally had enough and was getting nowhere with Jake. So now, ~150 people suddenly have Jake's direct phone number. Including some pretty high up people he was inadvertantly pissing off (He really, *really* should've known). Jake is NOT a happy bunny :D",
            "I feel like your topic backfired, as most IT guys would love this info.\n\nI personally would...",
            "Not sure how this malicious compliance. This is just compliance.",
            "I’m an IT guy and when a user comes to me and says “the server is broken” my first question is “is anyone else having the problem?” More often than not the answer is “I don’t know.”\n\nMore often than not, if a server is “broken” the issue will be more wide spread than just 1 or 2 people. Sure, the IT guy could have and should have tested it from his end, or read the logs and done some due diligence, but often times, especially if they are burnt out/ overworked /understaffed, the amount of “give a fuck” rapidly approaches zero.",
            "Doesn't sound like a lazy IT guy. We often deal with one off issues that are user error, getting multiple people to report the same issue really helps us narrow down the possible causes.",
            "[deleted]",
            "Have a cookie. Usually it is a you problem.",
            "So by malicious you mean \"i did exactly what he wanted me to do\"?",
            "This employees name is Chip, and he always calls to say the website is down.  He doesn't know what he is talking about. I recorded the whole thing as proof:\n\nhttps://www.youtube.com/watch?v=uRGljemfwUE",
            "This story is told from such a basic end user perspective. Like they believe that end-user facing IT guy is the one that resolved the issue.\n\nYou described a dev issue. You complained about a dev issue to someone how had probably routed it to the dev's queue and it wasn't being worked by THEM. He was playing games on his phone because he had nothing to do because he is not a dev and he had already routed your ticket for you.\n\nHe told you good advice to get your ticket moving. The dev(s) saw all the similar reports and couldn't ignore it.",
            "Yeah I’m not seeing this as malicious..but ok",
            "To be honest, IT rarely maintains web pages to that degree. To have whatever required plugins working on modern browsers is an internal apps thing that is either outsourced or goes to a separate team, but with it being a small company I’m thinking outsourced. If the IT guy was capable of fixing the bug within a day and pushing it out to all systems, then he is criminally underpaid lol",
            "[deleted]",
            "I love how all the IT techs are coming out of the woodworks to tell OP how shit works in the IT field. \n\nThere should have been a GPO that blocked IE updates if an application specifically worked on a specified version of IE. \n\nIf it affects 1 user, then it’s low priority. If it affects multiple users, then it moves up. IT managers typically want their techs to work on higher priority tickets. Also keep in mind, you’re typically not their only ticket/customer for the day. And I’m not defending your tech for playing on the phone, but we also need downtime between tickets so that the techs don’t get burned out too quickly. \n\nI wouldn’t say this is malicious compliance.",
            "You have no idea the amount of BS politics he deals with concerning those tickets. I'd cut him a little slack.\n\nThose managers and executives get insane when making their stupid rules.  Just fixing it and making the person happy is never a consideration.",
            "My last tech job prioritized surplus processing over low priority calls. (Surplus was labeled in our help desk as med priority) my contact stated I was required to process calls in order of priority on the help desk. It got to the point where I did the same thing telling end users to get multiple people to complain about the same issue to get the priority raised.",
            "[deleted]",
            "What can we say.. people are getting tired.",
            "Lazy IT guy was following his boss's orders.",
            "I’m currently 1 of 3 IT people for a 1200+ work group. The majority of the people that put in tickets mark them as urgent or work stoppages, then they don’t respond when more information is needed to resolve.",
            "I work in IT and I cannot tell you how many people have what we call “a user problem”.  It’s extremely common and annoying, mostly because these people absolutely refuse to believe they are just the dumby doing it wrong, and lie to your face when you ask them to reboot their computer or if they have tried rebooting.  I always lie to them and say “I made a change on the back end that requires a reboot, please reboot your PC”, and what do you know shit starts working again, and I did absolutely nothing.",
            "Never go see the IT guy. Email him so you have a \"paper trail\" to CYA. You should have shot him an email asking for a ETA on a fix as you can't do any more work today without the fix. And CC your boss on the email.",
            "How do you know he was playing a game? What game was he playing?",
            "Isn't this just compliance?",
            "Those multiple tickets are probably official policy. I think my company somewhat prioritizes based on how easy it is to solve the issue. Easy fix that affects one user - medium priority. Directors don't see correct data in the tools - low priority, solved after 6 months and some badgering lol.",
            "TLDR; an update broke the website, IT blamed you, gave everyone a week-long holiday",
            "I was in this situation before but I didn't check if anyone else was down; I just sat at my desk fucking around until home time and anything I got questioned I said IT was fixing it as soon as they could and so I got paid to do jack shit that day",
            "I’m engaging support with a vendor because their software (that we internally host) is being problematic. When one user reported it I didn’t have much to go on, when multiple users reported the same issue, I had something to go on. I’m just glad my coworkers appreciate their IT team and will work with us to diagnose and resolve issues and fully understand when we use their reports to engage software vendors to report bugs.",
            "Didn’t the son of Magnus",
            "Sound alike he didn’t want to have to update everyone’s browsers so he had y’all do it then he fixed the problems all at once.  Where I come from a work stoppage is always a priority even if it’s just one person. That IT dude sucks at customer service and was totally bullshitting you.",
            "How did you get your coworkers to install a browser? I can't get mine to understand changing printers 😔",
            "Not malicious. You just helped the IT guy",
            "[AH] He was trying to give you the day off.",
            "Like a lot of folks..IT here. It sounds like that company should have locked down updates.  I get that small companies may not see it as a priority, but if it breaks each update...\n\nAlso could have been that pushing a fix when only one or two people are on the new browser may have broken it for the rest. By having everyone update you may have made their lives a lot easier!",
            "I'm IT and I approve this message. 🤣",
            "Downvoted this as it’s not MC.  It’s barely doing the right thing.",
            "As your generic IT guy, I have to prioritize things.\n\nTaking something that works, and tweaking it slightly, is not a priority.  We work on a 1 to 5 system.  Some of the crap I do would be a 6.  It also takes very little time to do unless its just months of \"little things\" submitted all in one ticket.  Those go to a 7.\n\nA revenue center not being able to bring in revenue?  Yeah, that tops my list of things I can handle.\n\nThe only bigger things I can try to help mitigate, but are above my pay grade to fix.  One day though...",
            "It seems like the IT guy was actually helping you. He lets you know what to do so they can get to work on it. I've worked in IT using the SCRUM (or scum) framework and it's fking annoying af. The IT department may have other high priority tasks they are currently working on with a deadline, as well others already planned in the future. so I can understand why the IT said the priority isn't high enough since they may have other work or features they are told to do by management level.\n\nLook, a lot goes on behind making, developing and maintaining even a website. A lot goes on behind it that a single change can actually make the website not work. Cut the IT guy some slack, he seemed like he was actually helping you/answering with what he could and help the issue get addressed quicker.",
            "Probably not lazy, but probably how the ticketing system works and him meeting his KPIs.",
            "This is a management issue, they are the ones who decide how tickets are handled.",
            "Speaking as an IT person, I'm certain the man was dead inside.",
            "Sounds to me like the IT guy was also maliciously complying with his own department's policy.",
            "Theres also something to be said about the \"works on my machine\" issue. Unless your company closely regulates whats on your laptops, the issue can be easily caused by a single user due the configiration of their single machine.\n\nYou mention browsers, in my company we have several web portals and api's that we test with a set of browsers. We also have a standard for what that browser has to be. Clean, vanilla install, no extensions, no privacy tweaks, no themes, no plugins, etc. \n\nWhen a user complains, we test services with a set of prebuilt VM's with our standard set of browsers installed and up to date. If it fails in the controlled test, its a proper issue. If not, users config is compared against our standard and surprisingly often, its a bit misconfigured, has weird extensions blocking stuff and different frameworks or different security settings.",
            "Just write an e-mail with your boss in CC that the issue is preventing you from doing any work and let confirm that the issue will not be resolved until it is high priority. Either it will become high priority very soon or you can just relax and wait.",
            "Most of the comments seem to be missing the fact that the IT guy was sitting around playing games.\n\nEven if your issue is low priority, if he had the time to be doing nothing and playing on his phone he should have at least taken a look at it.",
            "I don't care if it is prioritized or not. You have time and a ticket. Get to work. Yes, we have tickets where SLA says that we have 10 work days to solve. Does not say that you have to use those 10 days. That is a point where I agree with my boss 100%. (I work in IT Support)",
            "ITT: bunch of computer nerds making excuses for IT guy playing on his phone instead of actually working, lol",
            "Sounds like he has an issue prioritizing his workload. Since when are computer games a priority over a low priority request for support? I hope you reported him for that.",
            "It's funny how any time someone badmouths IT, half of Reddit (all of who work or have worked IT jobs) come running to their defense.\n\nSorry guys. Sometimes IT people just suck. Period.",
            "Is this not how people normally coordinate with IT?",
            ">How do service requests become prioritized? They have to have multiple people report the same issue. He then says \"if you want me to work this issue make sure someoneone else has the same problem. It might just be a 'you' issue, not a browser issue.\"\n\nThat's just lazy support. It's not your job to figure out what the issue is. The tech should have determined that when the ticket came in.",
            "Being the IT person that would get some sort of call/ticket/walk-in for an issue like this, the tech's comment is pretty rude.  The thought of a reply like that to someone's issue makes me cringe, no matter the issue.  Add on the fact, they seem to be actively doing something on their phone and that makes their reply that much worse.  \n\nI see it as the equivalent of a server at a restaurant telling their table that they won't refill drinks until two or three people are out of beverages.",
            "Was the IT guy named Roy?",
            "I. E. is Internet Explorer?  That is your problem.  Internet explorer does not adhere to the [https://www.w3.org/standards/](https://www.w3.org/standards/) , and the various versions are not compatible with each other.  Just like the various versions of Windows (95+) have various incompatibilities.",
            "You handled this PERFECTLY. \n\nAlways always always make a ticket and get your coworkers to report their own tickets. Its the only way to make IT support move.",
            "How is this malicious tho? He told you how to get it higher on the list and you did. This is exactly how IT depts work at most places",
            "Its more fun when its the system that's used to log service requests is the one that's down and the helldesk won't route your call to the next level until you submit an issue via the system that's down.",
            "It developer here. I would not change the production code for a single guy saying he has problem. Deal with it . It is stupid and I could create problem for everyone else.\n\nIn you case it could have been a browser bug which could have been hotfixed the very next day .\n\nI would have reported you to HR for having all the works in office to stop to prove your point . You should have send a very very detailed mail and open a ticket like everyone does cause I have to justify a commit in production . It is not like I can say /u/maliciousguy felt like something was wrong so I broke everything else to fix a problem  he was the only one to report and I have no open ticket about it .\n\n\n\nWe are not here waiting for anyway to ask for a fix to whatever could be a problem with their pc .\n\nOh and the playing and wasting time issue is the most annoying part. As far as you know there could have been a compilation process in background he could have been connected in terminal monitoring something or just having a break between a stressing debugging session and another .\n\nAnd btw it is not like you can open the code and find an error . I work on stuff which contains like thousands of rows .\n\nThey fixed next day but you do not know how much it took\n\n\nTL Dr open a ticket if u want help and what you did should be reported to hr\n\nVery bad idea to have enemies in the dev and it department .",
            "This is how it is supposed to work. And for all i know, the helpdesk guy might just be doing simple repairs/user management, logging tickets, and communication with the specialists that actually fix the stuff. I've been in that position for 2 years before i got promoted and users like you are the reason i hated that position.",
            "Even the lowest priority tasks should still be a higher priority than playing games on your phone.",
            "Going to IT support directly and not creating a ticket is like going to a pharmacist and asking for medicines without prescription. \nThey can fix it as a favor but tickets exist for a reason. \nIf it is urgent create a ticket and then go directly an IT guy and ask him to pull it and work on it on priority.",
            "As an IT guy... You're a fucking dick.\n\nYou purposely made the problem bigger than it was when there is a known work around and you raised it to the level of production impacting... On purpose.\n\nYou're a real fucking dick.",
            "I'm sure that people said this, but did you have to make sure everyone had the same problem, not just one other person? But also yeah he was lazy.",
            "IT has changed a lot since the got the ticketing system. It's a super over managed position now. Good you got the job done.",
            "Not to say he wasn't being a lazy shit, but as IT I get where he's coming   \nfrom. If one person complains about an issue, it's lower priority than   \nif everyone has it.",
            "“Playing in his phone” was probably some c-level that bought the newest iPhone and needed it set up with everything transferred ASAP he’s leaving in 5 minutes.",
            "If i were the IT, and was in charge of maintaining that service, but all employees were allowed to install/upgrade anything on their computer, including what is needed to run company services, then i would just tell you to downgrade what you updated if you want it to work for now.\n\nAnd if you went ahead and told everyone to upgrade to make this higher priority than other existing issues by making the problem worse for the company, and i would receive some blame from my higher ups about that new problem, then i would essentially tel him that you consciously made the problem worse and made the company lose money because of it",
            "yeah, I would get yelled if  opened a ticket for one of my co-workers for non prioritized tasks. OP It's not our fault we do our job but there is someone above us",
            "Non IT guy here…this actually makes logical sense. 👍🏽",
            "It’s completely missing the point to imply the appropriate approach is: 1. Do the high priority tickets, 2. Play games on phone, end of list, absent higher priorities just let the other tickets fester. Fuck that lazy IT guy.",
            "I would absolutely send out a memo to report ANY AND EVERY issue encountered, no matter how small. If IT want to play stupid games, then their ticket count can triple overnight, see how their KPI's look then.",
            "I understand priorities, but.... Just because it is bottom of the priority list doesn't mean you never do it, it just means you wait till everything else is done. So.... Clearly he was just crappy it if he's just playing games."
        ]
    },
    {
        "post_id": "8e5hn4",
        "author": "pay_purr_mew",
        "title": "Call My Mom? Okay",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e5hn4/call_my_mom_okay/",
        "score": 16061,
        "num_comments": 507,
        "created_utc": 1524424789.0,
        "selftext": "Junior year of high school I had a real knob of a math teacher (hereafter,\"Mr. K\"). Always picking on students and lived on failing people. I had an A in the class come interim report time and he demanded everyone get it signed by their parents and returned. Usually this was reserved for folks with grades C or lower. I didn't bring it home and have it signed. Mr. K spent 20 minutes of class time sending all of us up to call our parents in front of the class who failed to comply. I was last and all the other students with failing grades were fussing and sucking their teeth.\n\nI, however, couldn't wait. She has little patience for bullshit. When it was my turn, I call my retired Lt. Colonel mother, then middle school teacher in the middle of her robotics class. She was so worried that I was calling because at the time I was having a lot of health issues and had regular standing appointments on base to get injections every single day. I tell her Mr. K asked me to call because I didn't have my interim signed. Thinking I was failing, she demanded to know my grade. I tell her I have an A in the class. At this point she politely requests that I hand the phone to Mr. K. He has the smug look and just stares at me, thinking that I just got in trouble. \n\nQuickly he turns around and everyone can hear her barking at him for wasting her time enacting useless policies and how dare he waste valuable class time as one teacher,to another. He's quietly mumbling \"yes ma'am, yes ma'am.\" He hangs up the phone and resumes class.\n\nI was never asked to call my parents again in his class.\n\nEdit: I speak to my mother every day or so and read her some of the things y'all said. She was in stitches. My father was the airborne ranger, so she doesn't often hear that she's the badass one. You guys really made her day. Thank you. 😄",
        "permalink": "/r/MaliciousCompliance/comments/8e5hn4/call_my_mom_okay/",
        "comments": [
            "[deleted]",
            "My father was a Captain in the US Navy (Colonel in the other branches, it's one below Admiral), he fought in Vietnam and has had thousands of men and women under his command... yet I've never seen his \"war face.\"\n\nExcept once.\n\nI was on a Boy Scout trip to the Blue Ridge mountains, 4 hours away.  As we were breaking camp, my buddy Jon and I decided to go up to the scenic view one last time (3 minutes up a hill).  When we came back, everyone was gone.  Thinking at first \"Oh shit, we are lost in the woods...\" and then remembering there is a Ranger station about 2 miles down, we hike there and ask to borrow the phone to make a collect long distance call (this was the 80's so it was a big deal to call long distance collect)  I get my dad on the line, explain the situation, he tells me to give the phone to the ranger... and the ranger gives him directions to where we are.\n\nIt was a long 4 hour wait, and an even longer ride home, almost completely silent.  About 10 minutes from home, my dad pulls over and makes a call on a pay phone to my scoutmaster and tells him to meet us at the church parking lot where the scouts meet.  We get there and our scoutmaster, Mr. Frost, was waiting.  My dad says \"Stay in the van.\"  Jon and I just nod.\n\nMr. Frost starts out with his hands up in an \"Ok, let me explain\" pose and my dad cuts him off.  I have never seen one grown man so thoroughly dress down another grown man in my life.  The most terrifying part was he never raised his voice.  Something in my dad just \"shifted\" and suddenly he was a goddamn Commanding Officer of a United States Naval Base telling some poor squabbie that his level of fuck up from the true course of rectitude has been noted, and it has angered the powers on high... their very avatar stood now, in the body of my father, addressing that scoutmaster with cool, calculated, righteous anger that had not the barest hint... but really just the implication... of focused, controlled, murderous rage underneath.  Mr. Frost wasn't a military man, but you could watch his very attitude melt into pure submission.\n\nMy dad got back in the van and took Jon home.  Then he and I are alone in the car for the 10 minutes it took to get from Jon's house to ours.  I asked him \"Dad, are you mad at me?\"  He said \"No, you did something stupid, but Bob's job is to protect you from that.  I will say this though, learn from this and don't do it again.\"  Message.  Received.\n\nWhen I became a scoutmaster years later... you better fucking believe I counted my kids twice before a single car rolled out.  Never lost one.",
            "This is true malicious compliance, not purposely misunderstanding a command or anything like that. You did exactly what was told knowing the result would work in your favor. That's awesome, it's teachers like him who give the good ones a bad rap.",
            "\"retired Lt. Colonel mother.\"\n\nIt doesn't get better than that, folks.",
            "[deleted]",
            "My friend's mom was a Major in the Army Reserves when he graduated Marine Corps boot camp. As a skinny 6 ft 11 in recruit, he got fucked with a lot by the drill instructors. \n\nHe told me it was all worth it when his drill instructor team had to salute his mom at graduation.",
            "Back in the late 90s in high school, one of the teachers made me call my mother to bring me a different shirt. Reason being, because the one I had on had a cigarette ad or something in the background. My mom worked an hour away at least. I was literally giggling when my teacher called her which just made the teach even more pissed. I had already offered to turn the shirt inside out so you couldn't see it.\n\n30 seconds later, I can literally feel the explosion of anger through the phone from my mom. The teacher couldn't stop stuttering while my mother lambasted her for a good 5 minutes about how fucking stupid she was, and how if she had to drive up to the school it would be a special version of hell for everyone involved.\n\nThey just let me turn my shirt inside out.",
            ">retired lt Colonel mother\n\nOh shit. Oh shit that man had a *family* shit.\n\nThanks op. Makes me laugh. I wish there was a sub specifically for ex-armed forces gone give it to ya.\n\n\nEdit- I need to add, this was very well written. You did it perfectly. All relevant info, no chaff, and nice build up.",
            "As soon as i saw Lt Cl i knew it was gonna be golden \n\n\nEDIT: DAMN this blew up. You guys doubled my karma overnight! Thank youuuu",
            "In primary school, my teacher sent me to the Head teacher because she felt I was being disrespectful, because I asked her to explain the answer to a maths question as she marked me wrong. Her response was just \"that's what the answer book says\". The Head wanted me to apologise to the teacher, and when I wouldn't without an explanation of the maths question, she rang my mum.\n\nMomma Roonling asked the teacher what the question was, then answered it herself, and asked what I had given as an answer, and what the teacher had said. Turns out, I was right, and my mum tore the Head a new one, and threatened to go to the school board / papers, as if 2 senior teachers couldn't explain a primary school level maths problem, they shouldn't be in that job.\n\nI got apologised to and sent back to class, and asked not to tell my classmates. I was 8. Of course I told my friends!",
            ">Lt. Colonel Mom\n\nHO BOY this is gonna be good!",
            "I was attending a Catholic private high school in the 80's, despite being from a non-religious family.  I decided that because my Religious Co-ordinator set us an assessed task to “Compare and contrast two differing religions.”, that I would choose Christianity and Satanic worship.  Yes, I know: I was asking for it.  But… I did a good job academically.\n\n\nI was failed for presenting the doctrine of an “anti-religious cult”, and given a two week suspension.  My parents were asked to attend a meeting with the Religious Co-ordinator (along with a fairly large group of parents in the same situation), to “…discuss their child’s grading”.\n\n\nMy Dad was busy.  My Mum attended.\n\n\nWhen my Mother stood up to ask on what grounds I was failed, The Religion Co-ordinator asked whose child was hers.  When she replied with my name, the Religious Co-ordinator replied “Well, we hear more than enough from your son on this topic in class, so you can sit down.”\n\n\nI was only privy by eavesdropping when my Mother presented this information to my Father that night.\n\nMy Mum was a shy, retiring type.  My Father, the Scotland-born, retired Squadron Leader, R.A.A.F., was not.\n\n\nI remember distinctly the short quiet period after this revelation.  In the end, my Dad simply said: “I’ll handle this.”\n\n\nI’m not really sure what happened, as I only have other people’s reports of the interaction (I was suspended), but by all accounts, my Father made an appointment, attended the Religious Co-ordinators office, and destroyed him.  Apparently, the tirade was heard far and wide.\n\n\nMy parents received an official letter the next day from the school apologising and requesting my immediate “return to studies.” \n\n\nI called my Father “Sir”.  R.I.P. you glorious bastard.\n",
            "I love it when people think they know your parents better than you. It’s like, seriously? My life depends on knowing exactly how mom and dad work and how they’ll react!",
            "My 7th grade language arts teacher made us do this as well, needless to say, half the kids just dialed wrong numbers on purpose and the other half had parents asking why the teacher was wasting everybody's time. Fortunately, that was her last year teaching before retirement. ",
            "That’s amazing! \n\nThis reminded me of a horrible day when I was in second grade. I was a very well-behaved and quiet student. One day in computer class I asked to go to the bathroom and the teacher told me no. I asked again about 15 minutes later when my tiny bladder was about to pop and she told me no again and scolded me for asking. About 5 minutes after that I peed myself. We had those plastic closed back chairs so it held all of my pee and I was sooo embarrassed. \nI don’t remember much between that and getting to the office while sobbing, but I do know this was an excellent time for someone to mistreat me, as my dad was home. He worked out of state from the time I was in first grade until I was in high school, but he just so happened to be off that week and my mom was at work. \nThe principal called my dad and explained what happened and he told them he’d come get me. My dad isn’t a huge man, but there is something about him that makes him very intimidating when he needs to be. He came into the office and gave me my clothes and told me to change and wait on him. He ripped the principal and the computer teacher a new one, took me home to shower, then took me to lunch and told me they would never treat me like that again. That computer teacher learned to let kids go to the bathroom after that too. \n\nMy other favorite story is when my PE coach wanted to give me a C in middle school and my sister, who was an English teacher at my school, chewed him out in a faculty meeting and got written up. I ended up with an A in PE after that though. ",
            "Badass mom. ",
            "I think I just got a justice boner, but Idk cuz I'm a chick. Does a boner feel all tingly and exciting lol",
            "Don't mess with any parent that is former military. ",
            "I have a similar story, but it was a science teacher and she called my mom because I didn't say something right in her 7th grade science class.\n\nMy mom isn't a military officer, but she is a strong German mother of 7, and she didn't hold back. Basically, \"you're gonna take my kid away from learning and shame him in front of the class over nothing? Leave me alone, don't call again.\"",
            "Damn that's mean and good.\n\nWhenever the school wanted to call my parents I made sure they called my dad while he was on pharmacy duty on base or if he had the morning off duty and was sleeping. Always pick the time when they are most agitated.",
            "[deleted]",
            "They don't work at the same school do they? ",
            "I have a friend thats a combat veteran Lt Colonel, you have never seen a dress down like that of their rank. Compound that being a personal affair, aka child of theirs and its the perfect storm. From my experience they dont yell/swear, they dissect you by how you respond. Its a chess game that you are not qualified to be sitting at, its brutal.  \n\n",
            "People with military experience took ass-chewings and made it a fucking art form. ",
            "It must be nice to have known that she would have your back :)",
            "I don't even know that woman... but she's gold. ",
            "Your mom is the real MVP <3 ",
            "This. Was. AWESOME!!\n\nWell written, to the point, buildup perfect, AND your handle is just TOO TOO CUTE!!!",
            "I have a Hispanic friend who gets in trouble often and one of our teachers made him call his mom and him and his mom are having this conversation in rapid Spanish and because I take Spanish class I could make out some of it and he's just talking about the teacher and his grades (which were pretty good) and he's asking what they're having for dinner and just having a casual conversation having nothing to do with why he was in trouble and I'm trying not to laugh and after a couple minutes, he hands the phone back and looks at the teacher and says \"yeah she understands and will discipline me when I get home\"",
            "Oh man, teacher-on-teacher drama.  I love it.\n\nMy stepmother was a high school English teacher.  Universally hated.  But the year I graduated, my AP teacher and head of the English department was retiring.  She got to take over the department and redo AP to her liking, thankfully after I was done.  This meant throwing out everything postapocalyptic, sci-fi, or remotely enjoyable, and replacing it with Bridget Jones' Diary, and literally everything that Jane Austen and the Brontë sisters ever wrote, and she was so incredibly proud that after 30 years she finally got her wish to dismantle a truly fantastic AP class.\n\nAs a hated stepmother, I had no qualms in calling her out on her bullshit one day whilst visiting my dad.  This started a war that unfortunately carried over into school.  However... her lair/classroom was right in the middle of the second floor hallway.  This becomes important soon.\n\nAfter some minor spats, it became apparent that she was going to go out of her way every day to make the rest of my senior year hell.  Except she failed to take into account that 1) she was universally hated and somehow didn't know it, and 2) I was a straight-A student, athlete, musician, recognized multiple times for various academic awards, and my teachers were more like my peers than my actual peers.  My teachers both past and present were my best friends.\n\nOne day I came back from lunch a few minutes late because I stopped for a latte and the place was busy.  Meh.  Whatever.  I could get away with the occasional late-to-class because my teachers liked me.  However, getting to my after-lunch class, which happened to be AP English, I have to walk past my stepmother's classroom twice - once to get to my locker, once to go to class.\n\nUpon seeing me walk toward my locker 5 minutes after class started, my stepmother - a roughly 4'10\" woman of Medusa-like hideousness - came and blocked my path to class by standing in the middle of the hall with her hands on her hips.  Oh, this should be good.  I crossed my arms, yawned at her, and leaned against my locker, inviting her to do her talking/yelling/screeching thing that she does.\n\n3 words into her tirade, half the doors on the second floor flew open to see who or what was making that awful noise.  Every teacher whose class I had ever taken barrelled down the hall and surrounded my stepmother and yelled at her for disrupting their classes with her personal vendetta bullshit which the entire school had known long about - she and I have hated each other since the day we met, and since we share an uncommon last name in a small town, yeah, everyone knows.\n\nFinally, my AP teacher, a tiny, ancient, gentle man overcame his emphysema to bellow at her like a creature 4 times his size.  All I could make out was, \"Goddammit Medusa, go back to your miserable fucking cave and die just like your students' souls!\"\n\nI'm 34 years old and my stepmother has never spoken to me or made eye contact with me since that day 17 years ago.",
            "Reminds me of a story a friend from Canada once told me. His mom was in the military. He said one time someone (who didn´t know that his mom was a soldier) tried to insult him by saying \"Your Mom wears army boots!\" and he just replied: \"Yeah, she does. So what?\".",
            "Had something happen with a friend during HS. Three of us were on our way to lunch \\(we weren't allowed to leave, but did it everyday and it was known among one of our parents anyway.\\)\n\nSo we're headed to my friend's place to make lunch as her mother specifically purchased food for us to do so knowing this was the norm. To paint a picture, I'm driving and our female friend had positioned herself in the lap of our other friend in the front seat as I got tired of waiting on them to stop fighting about who was riding shotgun.\n\nWe're pulled over by the police and he pulls us out of the car. She's up first and is asked to call her mother \\(who is a teacher in another district\\) Her mother answers, hears police and assumes something had happened. The cop replies, \"Ma'am, do you know what I just caught your daughter doing?\" Not only was she annoyed to have receive such a call, she was able to tell the cop EXACTLY the situation, what we told him, and where we were going up to and including that her daughter was in the lap of our friend. \\(This was a normal fight they had fairly regularly and could have just as easily been him in her lap.\\)\n\nThe cop, taken aback kind of stammers as she's screaming at him over the call for wasting her time and to just let us go. He replies, \"Ma'am, are you aware they're not allowed to leave school?\" To which she abruptly responds, \"Have YOU had the school food?\" She then tells him to stop wasting her time and to just let us go and proceeds to hang up on him. In the end, he made her call her brother \\(who is roughly twice her age at this time and gave her a stern talking to\\) because her father just laughed and hung up on the cop as he'd already gotten the situation from the mother.\n\n\\*\\*TL;DR\\*\\*  Female friend gets me pulled over on our way to get lunch because she's sitting in my other friends lap in the front seat. Girl in question's parents yell and laugh at officer and subsequently hang up on him for wasting their time.\n\nAlso I may have just outed myself on Reddit if anyone who knows me reads this post. As there's more to the story that they love to tell whereas I saw it as a rather insignificant occurrence.",
            "Hahahaha, YES mam! ;-)))",
            "The teacher was definitely in the wrong for the phone calls, but what was so bad about getting a grade report signed? (Unless you forgot to bring it home of course). I had to do this throughout middle and high school.",
            "Lieutenant Colonel?  Robotics teacher?  MIDDLE SCHOOL?  Yeah, no.  Your mother is definitely the badass one. :D",
            "Mr K is an absolute moron.",
            ">I was never asked to call my parents again in his class.\n\nSo, this wasn't an abnormal classroom activity? Like, this happened with some sort of regularity and wasn't simply a one time thing?\n\nWhat in the actual fuck? Mr K has some serious mental issues and should not be in charge of anyone of any age, let alone children he's supposed to be teaching valuable life skills to.",
            "I guess having a milliary family does has its perks.",
            "I had a psycho mom who seemed to have a personal policy that under no circumstances should the school call and bother her if I was there. This only got worse over time when I showed that I was a consistent academic achiever.\n\nAlso, we moved when I was 10 to a school district with severe bullying problems, including by admin to us poor students. They would actually manufacture problems and call my mom. It made me laugh because despite that she was abusive to me at home, she had a don't mess with my daughter or my time attitude. They would call and she would scream at them every single time. She also showed up to the school once to scream at them when a student hit me and they tried blaming it on me. ",
            "I always loved the \"Call your parents\" only because I knew my mom would be more pissed that the teacher thought this was a good use of everyone's time. Might I get a lecture at home, sure. Might the teacher get torn a new asshole on a public platform, definitely. ",
            "Just wondering, I thought that the military was big on following protocol. You didn't follow the protocol. Why was she not upset with you? I'm sure as a member of the military she saw some bass ackward things but still had to jump through hoops because that is how the system works. ",
            "I love it when teachers think they know how it's gonna go down... then they're disabused of their notions by someone's mother.",
            "Military mom barking on the phone to a teacher, when she herself is a teacher? Justice never tasted so good",
            "Nice story!\n\nI once had a teacher that gave us a test with questions of a matter which we didn't discuss 50% of in class. As you can guess, the whole class didn't do too well. I didn't even do that bad, I think I got about 70% right but my teacher still thought it would be necessary to call my home.\nNo problem for me because my parents are chill and they knew about the shit he pulled.\nI admit, I almost felt bad fir my teacher when my dad got on the phone.\nSee, my dad is an ass (fondly speaking) and does not mince his words and he's quite smart (an allround talent to boot). Dad didn't like what my teacher did and started discussing every single question on the test (why he asked that, why he thought it made sense blablablah) and when my teacher didn't want to admit that he was wrong and tried giving half assed reasons my dad called him a stupid cunt and hung up.\nNow, you probably think: that can't have ended food for you!\nBit nope, the next day at school my teacher apologized to me and asked me to apologize to my dad for him as well...he did not count the test into our gpa. \n\nSorry for my English btw, it's my second language and I'm really tired atm.",
            "The thought of a grown man being like \"^(yes maam it wont happen again maam\") with *someone else's mom* is the funniest thing",
            "My mom isn't a Lt Col, but she has been a special needs teacher( kids from desestructurated homes) and reeeally knows how to do a good berating. Every time one of my friends call me sonofabitch I just call her and let her know it, then just pass the phone to my friend saying \"you have a call\". Not the first time my friends tell me \"please, just punch me next time, really\"",
            "Did he have the rest of the kids call home, or did he stop with you?",
            "Beautiful. ",
            "You got him good OP!",
            "Sounds like an awesome mom. Give her an extra hug and salute for me.",
            "God damn man, I dont really know if I want to know how you grew up with 2 militarily parents like that. I bet they made a person out of you.",
            "I think you should post this to /r/MilitaryStories ",
            "This must have been a long time ago.  Nowadays, I don't think teachers have time to care like they used to.  They pretty much get coerced into passing everybody along now, at least from what I've heard.",
            "Can we talk about how bad the titles are in this subreddit lol",
            "So, you didn't follow instructions, and set your teacher up to get yelled at by your mom?",
            "I remember in my French class we had a pop quiz which never happens where I'm from so when I got my test back I ripped it in half in front of the teacher. Who told me.i have big exams coming up and I have her the date and time of the exam and said it wouldn't be a surprise so I would count those marks. She told my mum this in a teacher meeting and my mum went totally backed me up and said she would have done the same thing. She then laid into my teacher about favouring another class over mine. ",
            "Your mom is the real MVP <3\n\n",
            "Your mom is cool.",
            "Your mother is, without a doubt, a hero.",
            " My gaurdian is now a retd. Lt. Col. And I can easily second the motion \"Officers retired or otherwise are not to be trifled with.\"",
            "Give your parents, especially your mom, a Hoo-rah from me!\n\n**Edit** Words",
            "The exact same thing happened to me with a math teacher when I was in 7th grade",
            "Did he have a large hole in his chest?",
            "Public shaming like this is just low.",
            "Your mom is a badass! Respect to her!",
            "My Mom's career was in the public school system as a school secretary.  She basically supported public schools and policies and teachers especially but one thing she couldn't STAND was having students (me mainly) write sentences for punishment.  She would call the teacher and ask that they give me another punishment.",
            "Necro time but I had a similar thing. Math teacher was mad that I got to class late in grade 7, it was the class right after lunch and I had been in the bathroom taking a massive shit , which I politely explained to my math teacher, or at least as politely as some kid in jr high would. As I was explaining this after class was dismissed he handed me his cell phone and said to call my mom to which I obliged hesitantly. I call her and she picks up “who is this”  “it’s me, my teacher is mad that I was late to class because I was takin a shit after lunch” she says to put her on speakerphone so all 3 of us could talk and then she went off on this poor guy like “what am I supposed to do about my kid being late because he’s in the bathroom, do you expect me to follow him around your school?!”  “Well no ma’am but-“ \n“Stop wasting both our time and give him detention or whatever you guys want to do, don’t have my son use your cell phone to call me in the middle of a work day for something as stupid as this”\n\nMy mom is awesome and usually had my back when it came to school stuff as long as I wasn’t blatantly acting out. ",
            "[deleted]",
            "[removed]",
            "And then the whole class applauded as the principal walked in and declared that Mr. K was fired. He gave the whole class the rest of the day off so everyone chipped in and bought me a Nintendo 64 which was just released that day. ",
            "[deleted]",
            "I think your mother was wrong. She enabled you to fail to comply with the teacher’s requirements and she seemed to derive pleasure, as did you, OP, in embarrassing and degrading the teacher. It doesn’t matter that you were used to seeing teachers only ask students with a C or lower have their parents sign. This teacher wanted accountability when it came to the Interim Progress Reports and you were no exception to her rule. Edit for typos. "
        ]
    },
    {
        "post_id": "7qcyv7",
        "author": "Trance354",
        "title": "Don't come in tomorrow. I don't care who calls, you're suspended.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7qcyv7/dont_come_in_tomorrow_i_dont_care_who_calls_youre/",
        "score": 16056,
        "num_comments": 408,
        "created_utc": 1515949039.0,
        "selftext": "Background: I have worked for copy shops for a very long time. I worked as lead production in multiple Kinkos, and subsequently I can make the copiers pretty much dance to any tune I set, due to learning their ins and outs. \n\nAnyway, for a variety of reasons, mostly I'd moved, I got a job with a competitor(Ikon) that stationed me closer to home[contract positions at client locations], in an incredibly busy, paper oriented, banking company. My boss was a rather ... stubborn, close-minded woman, who liked to insult her underlings, of which I was one.  When I started, I began streanlining her processes. Most of her time was taken up by physical labor which the copiers could do automatically. I pointed this out early on, to which she said, \"That's the way we've always done it, and I like it this way.\"  There was an implied threat at the end of that. Thankfully, we worked opposite schedules.  So while she was there, business as usual, but I was blessedly alone for 6 hours after she and the others left. \n\nAnd shit got *done* while I was alone at work. Turn around times would drop from 24 hours minimum, sometimes days, to less than 5 hours. The clients learned that if they brought their projects in after my boss left, they'd get them much sooner. All of this leads to the blowup.  \n\nBoss Lady = BL\n\nProject client = VC\n\nMe = Trance354\n\nThere are other co-workers, but they didn't speak up. \n\nI come in to the basement shop early in the afternoon, and there are stacks of paper *everywhere*. Massive collation job. Which the copiers can do automatically, of course. I open my mouth to say as much, but,  \n\nBL: \"No! Dont touch anything. No touchy!\"[She's a 20-something Italian **girl**woman with maturity issues]  \"Start working on the next job. I don't want you touching this one.  VC is going to get this in the time I specified, not one second earlier.\"  I don't think BL liked VC, BL's husband had gotten whiplash looking at VC one time, so there was a bit of jealousy.\n\nSo I look at the email, and start pumping out jobs. All collation, ironically. Really small, really complicated jobs. All done and picked up by the time BL was packing up to go home. \n\nBL: \"I'm going home.  Don't touch anything. This job is off limits.\" \n\nTrance354: \"This job is off limits, don't touch it.\"\n\nFive minutes after she leaves, VC calls.  \n\nVC: \"Is BL still there?\" No. \"I have massive edits to that job, it's like a whole new project.\"\n\nTrance354: \"She point blank told me not to touch *that project*.\"  \n\nVC: \"If the project isn't done by morning, I'll lose my job.\"  \n\nI know this is hyperbole, but I have a way around BL, so, \"Send it to me as a new project, cancel the old project by email, sent only to BL, not to me, and I'll see what I can do.\"  \n\nVC is appropriately appreciative, and sends the files over.  I set the machines up, and everything starts printing. All I have to do is refill paper and put the automatically collated products into massive binders. \n\nEverything is done just before quitting time, and VC is already there with her superior, looking at the process BL was using, versus just having the machine do it. \n\nVC: \"Why was she doing it this way?\"  \n\nTrance354: \"I really don't know, but if I had to guess, I'd say her bonus was tied to her profit. This company is paper reliant, so saving on your monthly copy allotment is out. If she does all the collating by hand, each time we touch a sheet of paper, it costs you money. And it is likely not a discounted, or included, cost in your contract. It probably isn't much, each time, but it can add up, especially at this company.\" \n\nVC and her boss thank me for getting everything done so quick, and I head home.  \n\nNext day, I get to the copy center,  and right off....\n\nBL: \"Go home.\"  This woman is livid, \"Go home. Don't come in tomorrow. I don't care who calls, you're suspended.\"  \n\nI go home and proceed to go on a massive bender.  Because there's no work the next day, I turn off my phone. Prevents angry drunk dialing.  While checking my phone, I send a message to VC, to I tell her I will be out for a couple days, and to expect a production slowdown, and to pass it along.\n\nWhile I'm out of the world, my boss calls. And calls. And calls a lot more. She leaves messages about coming back in, getting work done, etc.  \n\nTurns out VC's boss called her boss, the CEO, and told him about the job I'd done.  CEO liked the job and wanted to thank me ... And VC may have had them check the contract.  And an order came from \"high up\". All the bells and whistles I usually have the machines do. Turn time was faster than BL could manage. \n\nI was on the verge of being fired, so I reached out to a friend at a kinkos I used to work at, about noon on my 2nd day of suspension. They agreed to the same pay rate, and I was hired. \n\nI informed BL and said my goodbyes to VC and the rest of the ladies. \n\nBL was fired a week later. I heard through the grapevine it was poor human resource management. VC unhappy, her boss was pissed, and *her* boss was .... not happy.  \n\nSorry so long.",
        "permalink": "/r/MaliciousCompliance/comments/7qcyv7/dont_come_in_tomorrow_i_dont_care_who_calls_youre/",
        "comments": [
            "Why were you on the verge of being fired? You did as you were told, why weren't you promoted to BL's position instead?",
            "After playing a lot of Factorio lately, the automation in this story is pleasing.",
            "Copy that. ",
            "[removed]",
            "Narcissist bosses.  They come in all flavors.\n\n\nI had an old boss that did this.  I was new, and I had a ton of ways to improve  processes.\n\nShe resisted them, so I did some under her nose.  She also forgot about what she told me not to do.\n\nWhen the new processes were happening, and people liked them, she said she liked them.\n\n\nPro tip: if you can put an improved process in place side by side with an old process, and quietly allow the people who do the work to choose, the new process  will usually be adopted if it is better.  Leadership will adopt it to by sheer force of will by the people doing it.\n\n\nAnywho.....\n\nShe kissed the wrong ass, and when unpucked ass came into power, her decline started.\n\n\nShe was finally out the door.\n\nWe wondered where she ended up, so I googled her, found her.  Though a cashed webpage that listed employees for the company,  I found she got a job, and compared it to the current web page, lost it again.  It only took her 3 months to get fired.\n\n\nIt said she was a \" process improvement expert .\"\n\nShe was not.  She was a huge bottle neck in the processes at our company .\n\n\nI'm  guessing she listed my improvements as her own, and when she didn't deliver( or made things worse)\noff she went again.  She got a job where her son worked after that. The only way she could keep  a job is to be protected while there.  At my job, the old CEO liked her, and defended her even when get got endless stream of complaints against her.\n\n\n\n\n\n\n\n",
            "Damn. Sweet sweet justice served with a drizzle of malicious compliance.",
            "[deleted]",
            "Never knew that the intricacies of politics in that small copy shop down by the street could be so fascinating. ",
            "I don't understand why you were in hot water and had to change jobs at the end. You should have received BL's position. ",
            "I don't understand why you were on the verge of losing your job?",
            "How does one even get into the copying industry?",
            "Now she's the manager of Pop Copy. Because fuck 'em, that's why.",
            "I have been in similar spots in my illustrious factotum career. \n\nMore than once have i pointed out clearly (when the appropriate moment arose) to the topmost management that i know more and can do more than my immediate supervisor. I offer to take their place and create a more productive environment, thus a more profitable business model. \n\nIt worked twice. The other times i walked away because my boss was a family member or enmeshed somehow that made them just unfireable/ undemotable. Some business just don’t want to be better. ",
            "Any time you find yourself quoting early Emporor Kuzco, you're the bad guy.",
            "That was beautiful.\n\nAlso, thank you for being \"that guy\" that helps us desperate people at the 11th hour and knows what the fuck they are doing. The world needs more like you.",
            "> each time we touch a sheet of paper, it costs you money.\n\nWhat does this mean? Was BL charging by the hour instead of by the job? I would think VC would be charged a set price based on the product regardless of who did it or how.",
            "if this is recent, have VC know you're looking for a job, since she already spoke to youre ex CEO, I bet she can have some words put in for you to be rehired with more cash",
            "You just about copied my last job except I was asking to be hired on as a real employee, not a contractor. 6 months after leaving, they are 2x over budget and have had 3 people in my lead position all fired or transferred. I still go to lunch with my old contacts. Mostly to hear about the contestant failures.  \n\nFeels good, to know you did a job well. I do miss some of the people a great deal though.",
            "I currently work at FedEx Office (kinkos, I dunno if you've stayed with us through the change) but OH LORD. I cannot IMAGINE having a boss like that. My manager gets upset when we manually staple a single file, haha. \n\nYou should post this to /r/TalesFromPrintAndCopy  , we're woefully slow over there and hearing stories revolving around damn copy machines is somehow cathartic to me. ",
            "oh, nice way to make an idiot shoot themselves in the foot there. and good working finding a nicer job. ",
            "> I can make the copiers pretty much dance to any tune I set, due to learning their ins and outs. \n\nIT guy here, printers and copiers are our natural enemy. Can I PM you next time I have a problem?\n\nEdit: also excellent story, sorry I responded out of excitement after the first paragraph at the idea that there is a person that can tame these beasts.",
            "I'm imagining OP floating in a lotus position in front of the printers, playing his flute like a snake charmer with collated boxes of paper stacking themselves around him.",
            "What I got from this, and some comments by OP, is this.\n\nVC loved OP, VC's boss was impressed and wanted to thank OP for the good job.\n\nHowever, BL hated OP for showing up, and BL's boss was BL's maid of honour as well. Despite doing a good job, OP one-upped BL, and BL probably complained to BL's boss, or BL's boss did not appreciate her friend getting showed up.\n\nA classic case of toxicity where personal relationship takes priority over efficiency and competence",
            "Sounds to me like if you stayed you may have gotten BL's job and the pay that went along with it.",
            "BL is not a boss lady,its Bitch Lady",
            "I love this.  I love everything about this.  Very, very well handled!  :D",
            "Why did you abbreviate Project Client as VC?",
            "This is pathetic",
            "> And shit got done while I was alone at work. Turn around times would drop from 24 hours minimum, sometimes days, to less than 5 hours. The clients learned that if they brought their projects in after my boss left, they'd get them much sooner.\n\nAh, pure, weapons-grade capitalism right here. Gotta love it.",
            "I kinda feel bad for VC. They didn't do anything wrong.",
            "One thing I don't get. Why would they have a bonus structure set up to incentivise such a slow tedious process?",
            "So, did you go for BL's job?  They probably would have been happy if you took it.",
            "Ah, yes. Personal issues. The second greatest obstacle to an efficient workflow, behind basic incompetence.",
            "I worked for another well known copy related business, and the same bullshit exists there. So many stubborn people that won’t even listen. So many lies about how the work can be done; so many lies on contracts about turnaround time. So many employees who get treated like crap and then the higher ups are shocked when the good employees leave.\n\nWell done, Op.",
            "Why did you think you were verge of getting fired? It sounds like you were on the verge of taking BL's job.",
            "I'm glad you were able to find another job--hopefully somewhere where your efficiency is more valued. ",
            "This was the shitiest story I’ve ever heard.  I’d kill myself if i had to make copies all day.   ",
            "So you told the client that your company was essentially ripping them off. If you didn't have another job lined up, you'd kill your career right there.\n\nOne time I was in a meeting with an executive and a client, and the executive started spouting off all sorts of untrue shit which i corrected him on. It was the last time I ever corrected someone in front of a client because i learned that the health of the business is often better than being right. The client then thought my executive was incorrect and didn't know what he was talking about since i had to correct him.\n\nIn a fantasy world, me knowing more than the executives would result in me being promoted and praised. Unfortunately in the real world this resulted in the client losing faith in our company, the client dropping us eventually and all of his not hitting a bonus.\n\nSo keeping mouths shut to customers about what your business is doing wrong is better",
            "I guess you could say that her plan failed, even though it seemed great...\n\n... *on paper*.",
            "I worked at the staples copy center for a short period of time. It was a terrible experience. My boss wouldn't follow the scheduling thing (that she trained me on!) So people would come in and want stuff done right off when I was already working on other projects.\n\nThen if I told them that's not how that works they would say \"Bossulina always does this for me!\" So I would have to do it right off for them, then struggle and pray that the other clients would come in late.\n\nOverall, it was just awful",
            "So your boss was just fired.  Why aren’t you in talking to her boss about her job? ",
            "Dear gods im so happy my current boss is awesome. I couldnt work under a bitch like this, but credit to OP for making it work for as long as it did.",
            "Incredible",
            "Oh man, so many feels. BL seemed to be one of those dinosaurs that refuse to change. It makes sense that it directly effected her bonus. Too many people out there, I know of two. That company is lucky they could just fire her without resistance. My company has one employee that has outlasted her usefulness, so to speak. But every single time they try to reduce her hours to have someone who can move at all, she calls corporate crying about \"age discrimination\" and things just go back to how they were. They tried firing her three times and every time, she pulls this shit. I doubt that even if the company offered her a fair, early retirement, she would just go willingly. But the company doesn't want to do that either so I guess they deserve all the shit they get but WE at the store level don't. \n\nFlorida is a will to work state... Unless you are over 55-60yrs old I guess because I have NEVER seen upper management backpedle so fast, so many times after trying to fire someone. This ONE OLD LADY!",
            "Do stupid stuff, win stupid prizes I guess. I do enjoy having the irrational get burned. ",
            "interesting coincidence. 75% of my worst experiences are working  with Italian women. Let's just say, they are not the straight forward types. ",
            "I've never thought the processes are so complicated. What are those projects like?",
            "We're not suspended, *you're* suspended. ",
            "I.. I totally understand. I too work in printing, with stubborn folks sometimes.",
            "Nice",
            "This feels like a greentext",
            "Can you explain “collated” and why it helps?",
            "A beautiful journey.",
            "I used to work at a copy shop some years ago, sounds about right on this story for stupid stuff like that, and employees being treated like garbage. I sat here and applauded this story, thank you",
            "Great story mate",
            "A real paper chaser. Good job :)",
            "Any time you find yourself quoting early Emporor Kuzco, you're the bad guy.\n\n",
            "You and I have extraordinary similar resumes. Are you still in the copy/office services business? ",
            "What are some simple copying tips you have us mere plebians?",
            "How long ago was this if you don’t mind me asking? \n\nI work in print as well and we use the Xerox C60’s. What exactly was she collating by hand and why if the machines could do it? I mean I get doing it by hand if you seriously want to upcharge a customer in that fashion but that also seems like a super shitty thing to do. Not to mention print centers function so much better if you can streamline the process and pump out more work in shorter turn times making more money that way and bringing in more business.\n\nI’m curious though, was the customer’s file set up in a way where it could be printed collated or was it in pieces and expected to be assembled? Or could you just combine the file a la ‘combine PDFs’?",
            "If upper management wanted to hire you at your former employers, would you consider?",
            "Nice story, wish it was real",
            "Sounds like you primed yourself to take her job, presumably at a higher salary, but opted to bail and accept the same salary. You should cross post this in TIFU",
            "Is there a TLDR version?",
            "https://youtu.be/PZbqAMEwtOE",
            "I knew this was going to be good from the title.\n\nOP did not disappoint",
            "You obv did ur best snd ceo wanted to thank You but i feel like u went ego road smh",
            "Tldr",
            "Updoots, great story :)"
        ]
    },
    {
        "post_id": "pwch8y",
        "author": "Reverend_Bull",
        "title": "Student MC'd Me and I Couldn't Be Prouder!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/pwch8y/student_mcd_me_and_i_couldnt_be_prouder/",
        "score": 16052,
        "num_comments": 291,
        "created_utc": 1632729166.0,
        "selftext": "I used to teach intro-to-college courses.  Freshman sessions where we'd go over study skills and campus resources and how not to drive yourself nuts.  Fun class to teach, especially for me.  I love deconstructing classroom norms.  (I usually started every semester in street clothes, with a backpack, hiding among the students and complaining about the late professor).  \nOnce, for an exam, I offered the students any resource they wanted.  After all, I had made the test to be about *interpreting* information, rather than memorizing it.  Bloom's Taxonomy don'tchaknow.   If they could look up a term they'd be able to better reason their way around it.\n\nMost brought books and notes, a few brought laptops and note cards, etc.  One student, however, came to my office hours right before class.  \nStudent: \"Mr. ReverendBull?\"  \nMe:  \"What can I do for you?\"  \nStudent:  \"If I don't have access to a resource, you'll help us find it, right?  Like in that library literacy unit we did?\"  \nMe: (not catching on yet)  \"Of course!  That's what I'm here for!\"\n\nStudent: \"You said we can have *any* resource we wanted for the test, right?\"  \nMe: (thinking nothing of it, expecting open book assurances or the like) \"Yep, that's what I put in the syllabus.  What're you thinking?\"  \nStudent: \"Great!  I'd like the answer key to the test please.\"  \n\n\nI had to take a second and then just grinned, proud as can be.  I'd pushed them all semester to think outside the box and carve their own way, and this audacious little punk came up with a perfect plan.  \nHe got his answer key.  And because I had also allowed group work, the whole class got it.  \n\n\n(Luckily, most of the test was measured more on rubrics (e.g. short answer responses as opposed to multiple choice), so they still had to come up with a way to phrase it in their own words).",
        "permalink": "/r/MaliciousCompliance/comments/pwch8y/student_mcd_me_and_i_couldnt_be_prouder/",
        "comments": [
            "I like to imagine betty white sitting in the classroom with her backpack trying to blend in. “What’s happening, fellow students?”",
            "Sounds like you’re a professor who really cares about your students! I’m sure they remember the impact you had long after they finished college.",
            ">(I usually started every semester in street clothes, with a backpack, hiding among the students and complaining about the late professor).\n\nYou sound like the professor I had in a course for \"Introduction to Social Psychology\"\n\nShe spent 15-20 m sitting with the rest of us waiting for... Well her...No one looked twice as she was wearing what she refered to as a punk rock outfit. Was mostly a leather duster, spiky leather boots etc. No one was any wiser as age wise it was basically between 23-46 and she was on the \"younger\" end of that spectrum.\n\nOnce she gets up and introduces herself to our astonishment she get straight into it\n\n\"Welcome to the course, Introduction to Social Psychology, your first course to achieve your Bachelor in Social Psychology. Lets get started with Stereotypes and how all of you look like you've seen a ghost just because I do not fit the stereotype of a professor.\"\n\n&#x200B;\n\n> I offered the students any resource they wanted. After all, I had made the test to be about interpreting information,\n\nAwesome, that's close to what I did my bachelor thesis on \"Intrapersonal Understanding\" and it's quite interesting how people interpret information when they're allowed or not allowed to discuss their own understanding of a subject matter.",
            "That was a genius idea! Smart kid!",
            "This reminds me of my Spanish class in high school. My teacher said we could have one double-sided sheet of paper for our \"cheat sheet\" on the final exam. You could put whatever you wanted on it, but *no english*. \n\nI was one of those kinda weird kids who learned dead language alphabets for fun so I wrote all my translations in Ancient Greek alphabet, adding a few of my own letters for the missing Latin ones. Since she said no English, she took a once-over, laughed, and let me use it on the exam. \n\nI got an A.",
            "I thought he was going to ask you to join him for the exam as the resource as I was reading",
            "Lots of great examples of this in literature, like \"A Wizard of Earthsea,\" where the graduating wizard can only leave the Academy if he can guess the door warden's name. A wizard's name is their most closely guarded secret, so Sparrowhawk spends days contemplating how he can possibly force a master wizard to disclose his name. Until, finally ... he asks him, \"What is your name?\"\n\nOr my favorite recent book, **Project Hail Mary**, where the teacher asks the students in a lightning round setting, \"Who can tell me the radius of the Earth?\" A student called Trang starts to answer, when another student yells \"TRANG!\" The teacher and Trang look puzzled, so she says, \"You asked us, ***who*** can tell you the radius of Earth? Trang can!\"\n\nLateral thinking, or \"thinking outside the box,\" is a very valuable skill - kudos to you for teaching it!",
            "This is some Captain Kirk/Kobayashi Maru level thinking! Smart kid!",
            "Quick question.\n\nAside from the grin, did you also laugh like a mad scientist that recently discovered the solution to a creative roadblock?",
            "Great story. I had it pegged that the student was going to ask to use OP as their resource.",
            "Phrasing is everything. \n\nThey can request any resource they like. Delivery is at your discretion.",
            "I had a philosophy professor once tell us about his allowed resource in the exam. It used to read “a 3x4 card” meaning the size of a cue card. One student one year made a massive 3x4 FOOT card and brought it into the exam. The professor tried to find where it said 3x4 inches but sadly the syllabus didn’t have units of measurements. The student got to keep it, And he updated the syllabus, but told the story for the end of time.",
            "I half expected the answer sheet to be mostly \"Student can explain X and Y concept, with example\", or something like that. Basically useless for them without actually studying, double MC!",
            "There's a long-held story, probably apocryphal, where a physics professor at CalTech was giving a take home test that was incredibly difficult.  On the top they had stated that students could use anything, \"including Feynman,\" implying the textbook.\n\nSo one student reportedly went to Richard Feynman's office, showed him the test with the instructions and Feynman was like \"okay, let's do this.\"",
            "You could MC' him back, if you wanted.   \n\n\nStudent: \"You said we can have any resource we wanted for the test, right?\"\r  \nMe: (thinking nothing of it, expecting open book assurances or the like) \"Yep, that's what I put in the syllabus. What're you thinking?\"\r  \nStudent: \"Great! I'd like the answer key to the test please.\"  \nYou: \"Yeah, you can use that, if you have it.\"",
            "This is awesome. When I taught apprentices in electronics, I used to tell them they could utilize any reference they had available. \n\nFour students out of about 200 realized that they can utilize a senior technician if they require help. That's why supervisors exist. To ensure a journeyman is available to assist with routine tasks as the apprentice completes their journeyman qualifications.\n\nPart of that qualification is knowing when to seek assistance. Nobody is expected to be an island. Four students directly asked me to clarify a point by explaining it to them again. I was happy to. \n\nI never had a student fail. I had two require two additional weeks of training to reach a confidence level in their own ability, but that's also because I put a sneaky challenge in which deliberately tells them to do something incorrect. It challenges their training and should have the student asking for clarification or better, correcting me. \n\nI really miss those days now that I'm reflecting on it. Thanks for sharing your story. It brought back some warm memories.",
            "It’s like an old Canadian Armed Forces Basic Officer Course task. The cadets had to move from Point A to Point B in a given time, which was impossible. Unless they requested helicopters. The aim was to get them thinking beyond the immediate.",
            "[deleted]",
            "College-level educators willing to admit they’ve been had are in short supply. I hope you continue to be a positive force in education for a long time!",
            "You’re the kind of teacher people take with them all their lives. I still hear Mr. McCollum from 6th grade social studies in my head. Other teachers taught me, sure, but he taught me to love to learn. You sound very much the same.",
            "There is a legend at the university I went to (Michigan Tech) that one of the professor offered something like this, so one of the students showed up with a grad student as his \"resource.\"",
            "As the students roll in, you casually drop the classic: “Yo, I heard if the professor’s 15 minutes late, class is cancelled!”\n\n\\**14 minutes pass*\\*\n\n“Alright, time to g-“\n\nSlowly, you stand up and walk to the front of the class. \n\n“Phew, right on time. Let’s get crackin’ “",
            "This is the kind of wholesome MC I need in my life. Your students definitely loved you!",
            "Awesome!\n\nHow common are multiple choice questions on tests in the USA, do you know? In the UK we only sometimes have a couple of those at the start an exam",
            "You need to watch the UK show called Taskmasters (you can find the episodes on YouTube). I think you ll like the show a lot, it's hilarious. The taskmaster will ask the contestants to perform a task. Some of them think outside the box and find creative solutions. Here is an example:\n\nhttps://youtu.be/qlFL3_k2m6c\n\nThe way your student MCed you reminds me of Taskmaster which is why I brought it up.",
            "The lion, the witch, and the audacity of this baccalaureate.",
            "cheeky fucker.\n\nkid's going places.",
            "This story reminds me of a professor I had for my Freshman Fall courses three years ago. Due to the nature of the class, he decided that instead of testing our memory of the material, he would test our pattern recognition. To that end, the first 30 questions on the multiple choice test were C and the last 20 were B. \n\nI think the only people in the class who didn't get an A on that test were the ones who either didn't study at all and therefore just guess randomly, or those students who are extremely paranoid to the point where they start to doubt everything if they mark the same letter more than 3 times in a row.",
            "Have my Silver Award cause that’s all I have. I LOVE this! I have loved all of my professors from my university, but you would be such a fun one!",
            "You sound like such a fun professor. If I ever move into the \"teach college psych\" phase of my career, I might need to borrow that beginning of the semester tactic.",
            "Damn that kid's smart!\n\nOn a side note, I ended up taking that class in my 4th semester at a 2 year Community College before transferring to university. (You do the math..needed the course type to complete my core classes and *none* of the advisors I saw before every semester thought to mention this one in the beginning)\n\nI started it thinking it was a waste of time since a lot of it went over things like: reading the syllabus, don't be afraid to ask questions, professor's office hours, etc. A lot of my answers to many of the questions the first several weeks were \"I can't tell you what I *might* do but here is what I did..\" \n\nI was pleasantly surprised to realize that I didn't know my most effective study techniques as well as I thought and a couple of other lessons that did end up helping. Overall it was mostly a waste of money since 90% really didn't pertain to me but I was glad I got to at least walk away with something.",
            "I've done adjunct work and I love the idea of letting them use available resources (which is just how it's done in the working world) but I would draw the line at handing out the answer key. I'd tip my hat at the cleverness of the request but c'mon.",
            "Just curious if you corrected this for future tests, or if you just let the whole class have the answer key for exams moving forward? I can see this being a wonderful moment in teaching your students to think of creative solutions and all, but if you just let them keep having answer keys because you wrote that one line that was open to exploitation in the syllabus, I think that might be treading into the realm of being a bad teacher.",
            "Sounds like the *Feynman* physics test story.  A professor at Caltech announces students can  *Feynman* (the textbook *The Feynman Lectures on Physics*) on the exam.  An enterprising student brings Feynman, the Nobel Laureate.",
            "So much of my professional career has been about finding a suitable path, not the “right” answer. You just taught the perfect lesson. I was fortunate to have teachers, professors, managers, advisors, mentors, leaders, etc. who shared your spirit and I am better for it. I was a low effort student that got by with good enough grades, but because of all the lessons that focused on thought processes, thinking creatively, and not limiting myself, I have become one of the most successful people I know, both professionally and in my personal life.\n\nHats off to you! Also, send me your students, particularly the one who asked for the key. I would love to interview them and bring them into our company. We need thinkers, not robots.",
            ">(I usually started every semester in street clothes, with a backpack, hiding among the students and complaining about the late professor)\n\nAre you Nelly from The Office?",
            "Are you the guy in that YouTube video wearing a basketball Jersey pretending to be a student?",
            "Plot twist: Answer key has answers reversed in an order only you know, specifically for situations like this.",
            "ON GOD I HAD A TEACHER THAT DID THIS IN MY PSYCHOLOGY CLASSES. my favorite teacher ever. he would wait with the students on the first day.",
            "This is great! I loved having teachers like you in high school and college, it's a real shame there's not more of y'all out there.",
            "Dude asked for the wrong resource.  Should have asked for you to be his resource during the exam.",
            "Why are you teaching these people instead of testing them? They’re supposed to get burnt out, not wiser /s",
            "This is totally a story about how cool op is.",
            "Thank you for your service for the betterment of humankind.",
            ">I usually started every semester in street clothes, with a backpack, hiding among the students and complaining about the late professor.\n\n[Are you this guy?](https://www.reddit.com/r/Cringetopia/comments/czo219/teacher_pretends_to_be_a_student_on_the_first_day/)",
            "You’re the kind of teacher I’d’ve loved to have. \n\nInstead I got the French teacher who got me suspended for not finishing the colouring of a project. \n\nShe *told* me I thought I was better than everyone for not having to colour it (I was sick for half of the week had less than half the time everyone else did, I even said, as I handed it in, that I expected to not get full marks for not colouring it when others had), to which I responded, “no, I don’t think anyone should’ve had to colour it. This is French class, where we learn French. Not art class.”\n\nI wouldn’t have been so douchie about it if she hadn’t claimed that “[I] had the gall to come up here and think [I’m] better than everyone” when I had even explained myself and expected to not get the full marks. \n\nMoreover, why do so many classes involve art projects? History, English, French, the only class I can think of that didn’t have something like this was math. I remember multiple times in middle and high school simply asking teachers if they could just take 25% off my grade for the project if it meant I didn’t have to do the art aspect. One teacher jokingly suggested I write an essay instead, and I eagerly jumped at the opportunity.",
            "Bc of covid, my son didn't take his end of course test for his sophomore social studies class. In order to graduate he needs to take it  in December. We just had an ARD meeting (admission, review and dismissal) because he's in special education and one of his accommodations for testing is \"access to any resources he needs to take the test successfully\". That's how they worded it in the paperwork. I was on a zoom call with the ard committee, my son was on campus and they asked if he needed anything to take his SS EOC exam, he said no. I frantically texted him while on the call telling him to ask for the answer key and he glances at his phone and dismisses it. 😤 I later asked his sped teacher and yes, technically because of the wording he could have gotten the answers.",
            "You seem like a great teacher!",
            "I was expecting him to ask to bring you as a resource",
            "Nah that’s a little over the top. As a teacher I would’ve stopped that. But if it worked, it worked.",
            "Wholesome malicious compliance!",
            "> (Luckily, most of the test was measured more on rubrics (e.g. short answer responses as opposed to multiple choice), so they still had to come up with a way to phrase it in their own words).\n\nMy orgo II exam, last one before the final, was take home. Which basically means any resources you want.\n\nTook me and my study group the better part of a day to finish 3 questions, even with the help of the orgo tutor.\n\nEdit- grammar",
            "Ah yes. I've pulled this trick before. But unfortunately the person running the session did not follow through on giving me the answer key. A bit disappointing but not surprising as it was a government HR session. Government doesn't usually reward outside the box thinking.",
            "Your students are going to remember you forever. They’re going to tell stories about you to their grand children, that’s the kind of lasting power thinkers like you have. I’m a graduate student, highly interested in pushing the boundaries of my own thinking, seeing, and knowing. I wish I had had an assignment like that. You’re the real homie Mr. Bull. Keep doing what you’re doing. You’re the kind who makes school bearable for people who absolutely hate it.",
            "I'm not a betting man, but this story could also have ended with the student asking *you* to be their information resource for the test, as in standing next to him and whispering the answers in their ear.",
            "Attaboy for being that Prof. \n\nI mean, the student got ya, but well done for gettin' got, and doing the right thing.",
            "Damn.\n\nMost of my teachers were the \"Thou shalt do X, Y, and Z, but only in the manner of A, B, and C. Also, you must etc, etc\" kind of teachers.\n\nExcept for the band and Spanish teachers. They were chill.",
            "This was fan fn tastic.",
            "I thought the story was going to end up with the student requesting *you* to be their resource in the exam.",
            ">Me: (not catching on yet)\n\nRelatable.",
            "You just know that the kid who got the answer sheet was a hero to the rest of his class",
            "I did not see that coming. I was expecting YOU to be the resource the student asked to use, lol. You definitely did your job teaching these students to be resourceful and think outside the norm.",
            "Haha I was expecting him to ask to just use you as a resource",
            "My lateral thinking took me to asking for the test.  Student went straight to the finish line.",
            "Respect.",
            "Halfway through I actually thought the student was going to ask for YOU as the resource (e.g., to guide them where the answer is, provide them the resources, and even just respond to the test questions)…",
            ">I usually started every semester in street clothes, with a backpack, hiding among the students and complaining about the late professor\n\nEvery student in your class thinks you're a cringey boomer",
            "Beautiful",
            "Or he could have said he wanted YOU for his \"resource\".",
            "Dumbest shit ever",
            "Did you even *try* to be prouder?",
            "You got Kirked.",
            "I was thinking that he wanted you as the resource.",
            "Sounds like 10th grade",
            "I wish you were my prof. I probably wouldn't be skipping so much class. I always felt classes were a prison because of how strict teachers are in my country and I often just read about the subject in the library instead. I often surprise everyone when the kid doesn't even show up for half the time gets in the top 10 of the whole batch in the final exams.\n\nI am in an asian country where thinking for yourself is not encourage in this part of the world(maybe it did changed recently as I graduated 15 years ago)",
            "If I had a teacher like you I'd have turned out to be something that helped the world. Instead my teacher slammed my head against the walls and be littled me. Other teach would put me outside and I wouldn't get to learn anything. I hated schools and teachers so much",
            "Heh, I've had professors literally taking the test next to the students so as to double check themselves and make their answer key",
            "OH  my gosh. That kid probably owns his own Forbs 50 by now! That is pure brilliance and you were awesome for going along with it! He is going to remember you for the rest of his life as the coolest teacher ever.",
            "Would have argued the answers werent a resource...but an end result.",
            "He's going to tell this story 40 years down the line.",
            "You’re gonna go far kid.",
            "> I used to teach intro-to-college courses.\n\nI *hated* that class. Felt like busy work and I resented being forced to take it.",
            "I love the story, however I’m not seeing the “malicious” part.",
            "How is this malicious compliance",
            "Bless your soul. \n\nThe first class I ever was really going to fail was grade 10 history. Being a young stoner and having a very lenient teacher, I learned very little. \n\nFor the final exam he gave the whole class 15 minutes with their study books to get as much of the Long form answer questions as possible, I didn't have study notes. Now my friend and I were two of the worst students in class but we got along great with the teacher as our desks faced his. \n\nSo he collects everyone's study books and puts them on his desk, facing us, he gets our attention, shows us the front of the books so we can see names, and we picked the smarter girl in class, he puts her book, open to the long form answer notes facing us and states \"let's See how fast I can rifle through this\" \nHe proceeds to answer the 50 T/F and Multiple choice right in front of our eyes, \"ignoring\" the fact we can see this and making no eye contact. We copy these and quickly scribble out the long form answers from the study notes, and as my friend starts the essay question I realize I already cleared a 70 with my answers, giving me a high enough mark to pass, and don't need to complete the exam. I wrote n/a on the essay question, and handed in the exam, first in the class. \n\nMy buddy beside me and the teacher just gave me a surprised look and the teacher shrugs. He then takes an eraser and changes 3 of his 50 answers, winks and tells us \"it would have been to suspicious if you got it perfect. Have a great summer!\"\n\nLegend.",
            "You have a great surname. That is all.",
            "This was my favorite course to teach as well. I always loved it when a student came back and reported how well something I taught (e. g. test prep skills) worked.",
            "This is amazing, my PGCE finally became useful. I know what Bloom's Taxonomy is, go me...",
            "I read this out to my partner who used to be a teacher herself. She loved it!",
            "I love this. And I love that you honored his request. This is such a win!",
            "What was their learning experience in this?",
            "I love you x",
            "And you share your rubrics with your students prior to the event... right?",
            "I thought he was going to use you as the resource rather than ask for the answers flat out.",
            "I was expecting him to say you were the resource he wanted to use. Well played nonetheless.",
            "Give that student an A.",
            "I had an Algebra 1 teacher in college like this. For our final we asked if we could all work together on the final since mathematics was a practical application type subject. You wouldn't be in a room by yourself most of the time and would be working with a team. She allowed it. We all passed and honestly I took this type of creative problem solving onward into my daily life. Talk about a valuable lesson learned.",
            "I had a teacher in high school who would go over a test we were taking the next day by just asking the questions and we would say the answer out loud.  The test itself was multiple choice and the order of the questions was randomized but the session told you whether you needed to study that night or not.",
            "The fun thing now is that because of iphones and the internet, they all have the answer key already.",
            "You mean Bloom’s Taxonomy is still a thing? Jayzus!",
            "That's awesome!  Thanks for sharing!",
            "I’m one of classes, back before covid, I was taking one class online and the professor put the whole answer key online early. The test was open book but I had to go into get it proctored. I literally wrote all the answers in my book and stickynoted a page or two before what I wrote down. Ez as pie",
            "Wow, I wish I had that kind of intro to college course. We just wrote in journals and questioned our life choices",
            " Sounds like my strategy for all of college in which I learned nothing and ended up owning myself.  \nI’m a fucking idiot by choice.",
            "FANTASTIC!",
            "I'll never go to college because I simply could not do well in that environment, but this is cool.",
            "Good for you both!  That's flexible thinking on both sides!",
            "Ok then teacher, I'd like to use 10 gold bars as a counting resource please",
            "I love your style! Find a way to teach online!",
            "😂😂",
            "This could have been a lesson of \"Don't trust single sources blindly\". Shift the questions by one, by moving the last one before the first one snd watch him in rorment when the kdy doesn't mske sense, if you don't zoom out and see the pattern.",
            "Did you change the Syllabus for the next term?"
        ]
    }
]