[
    {
        "post_id": "8ulrn1",
        "author": "Kaylee_Sometimes",
        "title": "My kid wants to make sure the rules are followed...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ulrn1/my_kid_wants_to_make_sure_the_rules_are_followed/",
        "score": 15980,
        "num_comments": 745,
        "created_utc": 1530208059.0,
        "selftext": "My two kids are in a stage of telling on each other for EVERYTHING, and today I got to serve up some malicious compliance because of it.\n\nThe house rule is that they are not allowed to watch TV while eating meals.  This morning Kid 2 decided she wanted her breakfast, while Kid 1 was still watching his show.  So I got Kid 2's breakfast and she sat down at the kitchen table to eat it.  Technically the TV is still visible from the kitchen table, so this is a bit of a gray area, but I was going to let it go (hadn't had my coffee yet and didn't really want to pick that battle).  However...\n\n>Kid 1: \"Hey!  Kid 2 is watching TV while she eats!  She's not allowed to do that.\"  \n>  \n>Me: \"It's ok, she is sitting at the kitchen table like I asked her to.\"  \n>  \n>Kid 1: \"Yeah, but she can see the TV from there.  That's not fair!\"  \n>  \n>Me: \"You know...you have a point.  Turn the TV off.  You'll have to watch your show later.\"  \n>  \n>Kid 1: \"Wait, what?\"\n\nThe TV went off, and I got to drink my coffee without having to listen to an episode of Pokemon in the background.\n\nTL;DR: If your sister doesn't get to watch TV, neither do you.",
        "permalink": "/r/MaliciousCompliance/comments/8ulrn1/my_kid_wants_to_make_sure_the_rules_are_followed/",
        "comments": [
            "My mum had a phrase for this: \"Are you telling on her to get her in trouble or out of trouble?\"",
            "Now watch Kid 1 is going to weaponize this and ask to eat when kid 2 is really into whatever they are watching.  ",
            "It's good they learn that being a snitch doesn't always pay off.",
            "Similar experience, but not quite...\n\n\nI have a brother 4 years older than I am. He was in the process of being disciplined my my father, receiving a very stern talking to that I anticipated would result in a spanking. I believe I was 6-7 years old, making him 10-11 years old.\n\nIn my infinite wisdom and foresight, I went and got a paddle-ball paddle that we had either pulled the ball and rubber band off of, or it had broken off from regular use. Knowing our uncoordination and general ineptitude, we probably pulled the rubber band and rubber ball off of it.\n\nI presented it to my dad, saying 'If you want to spank him, you can use this'. At that age, my brother and I were mortal enemies, and we took every opportunity to cause pain and bodily harm to each other.\n\nMy dad responded 'I will use it to spank him if you want me to, but I have to spank you with it first to make sure it works.'\n\n\n\n\n\nI left the room and put it back in the pile-of-stuff we played with.",
            "I can’t believe Pokémon is still on TV",
            "Would do the same thing to my kid. Except he loves Mickey Mouse Clubhouse.",
            "Way to stick it to the little lawyer!",
            "If they were smart they could take turns eating breakfast and have the tv on the entire time ",
            "Good lesson but I'd be bummed I  couldn't watch Pokemon as the parent.",
            "Kid 1 played themselves",
            "I heard Kid 1’s “Wait, what?” in Chidi’s voice.",
            "Tbh, my parents still talk about me being a shithead like this. Let me tell a story through anecdotes.\n\nMy parents never told me that turning the lights on while the car was moving was illegal. If your family is like mine, that may be confusing, but fyi--many parents said it was illegal so their idiot kids would turn off the lights and they could see the road in the dark. It was a \"simple\" solution to a practical problem. But that wasn't me at that age.\n\nInstead, at the age of 5-ish, my parents said \"Brian, you can't turn the lights on because it makes it hard to see out of the windows. That's a new rule. No lights on in the car unless you ask us first.\"\n\nI was happy to oblige because their reasoning made sense, and it included me in the process of driving by helping me understand what THEY were experiencing. This is also why \"no screaming, jumping, or being rowdy in the car\" was effective for me--I understood that the consequences might mean they couldn't properly drive, and I might get hurt in an accident as a result. However, I was a stickler for rules, and this came to bite them in the ass, as I'll get to later.\n\nMy older sister, on the other hand, was a primal beast with no care for others. She would hurt people because she thought it was funny. She gave zero shits about other people being uncomfortable. But the thing is, she saw that me being a rule-abiding citizen garnered me favors and admiration from my parents, and she wanted the same. Rather than realize I was responding to GOOD rules with actual substance, my parents started to realize that by calling something a \"rule,\" they could enforce behaviors and the kids would be compliant.\n\nThe problem? I started to see all rules as having some inherently important background, even if none was supplied--after all, my parents didn't lie to me before, so why would they lie now?\n\nSo my parents developed weird rules to keep my sister complacent.\n\n\"You can't eat ice cream past 7 PM on a school night.\"\n\n\"No speaking at louder than whisper at grocery stores.\"\n\n\"No one is allowed to open the attic.\"\n\nFor me, I invented explanations for why these made sense. For my sister, she just hoped she could get the praise I did.\n\nThe problem was, I was a child of justice. If someone is breaking a rule, it needs to be called out, for EVERYONE'S safety. Dad's driving and mom turns on the light in the car to look for her wallet? \"MOM, THATS AGAINST THE RULES!\"\n\nMom has an ice cream Sunday at 7:30 on a Wednesday? \"YOURE BREAKING THE RULES!!!\"\n\nDad tells my sister to come back to the cart at a decent volume in the store? \"DAD YOURE BREAKING FAMILY RULES!!\"\n\nMom and dad need to go to the attic to stop a leaking pipe? \"NO ONE IS ALLOWED UP THERE!!! YOU CANT GO!!!\"\n\nAt some points, parents have to realize that kids may require different rules. Otherwise, you may realize that you have to engage your kids on their level. If you're not ready to do that, you're a bad parent.\n\nNo, I'm just kidding. You're not a bad parent. Kids are hard, and develop in weeeeeeird ways. What works for one kid may not work for the others. But the one thing that I have seen almost universally produce better kids is treating them like intelligent human beings. \"You'll understand when you're older\" is not an explanation, but \"it's hard to explain until you're older, but here is why it's hard right now\" goes a long way. Not all kids are willing to admit fallibility, but as long as they don't feel belittled for their lack of experience, they're usually willing to accept guidance.\n\nAnyway, just my 2 cents.\n\n",
            "I recently read that kids don't generally tell on other kids for breaking the rules to get them in trouble. Rather, they tell on them because rules are their law and order. Sense of security. So instead of the knee jerk reaction of punishing the child for tattling, look deeper and see if there's an insecurity reason.\n\n*I was one of those children who would be punished for telling on others. I was also neglected as a child and a product of a divorce at the age of 2. When I was at the more stable parent's home rules and order were cherished. It all makes sense today why it was so important for me to have law and order in the few times I had it.",
            "This is one of the reasons I just can’t get behind an open concept layout. I hate having the TV on all the time, no matter what I do it always seems to be on when everyone is together.  ",
            "Dude I’m just impressed with how disciplined your kids are. The fact that neither threw a tantrum is a miracle to me. \nKudos, keep it up",
            "What do you have against Pokémon?",
            "I was with you until \n\n>\tdidn’t *have* to listen to an episode of Pokémon in the background \n\n",
            "If you want your children to respect the rules....have rules that have legitimate reasonings that make sense.  \n\nYou wanna have a family meal so no tv on during meals where most everyone is there to eat?  Sure ok, makes sense.\n\nYou don’t want the kids eating in the living room, or specifically, you’d like them to eat meals at the kitchen table where they’re not gonna make a mess?  Ok that makes sense too.\n\nCan’t look at the tv while you’re consuming food?  Kinda feel like you’re flexing your authority arbitrarily here.  \n\nAnd yes I realize what OP did in this instance was to teach the one kid a lesson about petty snitching....I’m talking about having this rule outside the scope of this particular example.",
            "But u can't rob them of another ash pokemon fight! ",
            "That's a pretty stupid rule to begin with",
            "Holy fuck the comments section is *hostile*",
            "ITT: People who think this is a good MC and people who think OP is teaching their kids incorrectly.",
            "This is probably my favorite MC ever. So simple, yet effective.",
            "This happens in my house all the time!! I do the same thing, just turn it off. One kid sneaks and watches in the reflection of the computer monitor haha",
            "This is why the tattle tale always got punished by my dad too. No one likes a tattler ",
            "Simple rule:  if a parent has to get involved to resolve a dispute amond children then both children lose.\n\nDont be a weapon your kids can use.",
            "> The TV went off, and I got to drink my coffee without having to listen to an episode of Pokemon in the background.\n\nI was with you up until then. Who wouldn't want coffee and Pokémon?",
            "But. Why can't they just eat and watch at the same time?",
            "Wait, you could have watched Pokémon and didn’t? ",
            "Not to rag on your kids in particular, but this is why I never want to hang out with little kids. They crave attention so much they're willing to throw someone else under the bus for it.\n\nEdit: typo",
            "This is why I'd never make \"rules\" for children, they'll always try to game the system. I'd only make judgments, forcing them to collate and research prior case law in a vain attempt to circumvent my will, only to be met with ultimate defeat when they realize I wield supreme authority without recourse to precedent. \n\nYeah, I think I'd be a great father too.",
            "I'm confused. Why would Kid 1 care if the TV was turned off? ",
            "Damn kid 1 is gonna learn the world is an unfair, cruel and unforgiving place real young.",
            "To be fair to the the kid it is totally unfair that he doesn't get to watch TV while eating but his sister can for unknown reasons and its definitely super unfair that he had to turn the TV off instead of shutting the door so he was punished when he wasn't breaking any rules.\n\nAt least thats from a kid's perspective.",
            "My mom's version of this was \"Only tattle if someone will get hurt\". Wisdom that kids understand.",
            "Fuck off! If my kids watched Pokémon I’d be ecstatic!",
            "[How I imagine Kid 1](https://youtu.be/8cuihrjLNAo) at the end of that.",
            "You're a monster T_T",
            "Wait, you're saying you *didn't* want to watch Pokémon while you drank your morning coffee? ",
            "My sister nannies 3 kids. We went to the zoo to see the pandas on Monday, I've never been so fucking exhausted lol. Mad respect ",
            "I imagine someone naming their kids \"Kid 1\" and \"Kid 2\" now...",
            "Now prepare for a \"we can still see the TV, so  you must turn it off!\" the next time your kids are  eating and you're watching TV.",
            "wait, your shielding your kid from the magic of pokemon D:",
            "You turned off Pokémon? That’s blasphemy!!!",
            "More like \"TIFU by missing an opportunity to watch Pokemon during breakfast\". ",
            "If your sister does not get to watch TV neither do you?????\n\nYou thought them that way and now they think thats right .\n\nNot cool",
            "Is there a subreddit for stories like these? Specifically parent trumps kid stories? \n\nThis reminded me of a few memories with my mom and brother and I would love to send them a few of these. ",
            "I just want to know what kind of parent names their children like they're the Things out of The Cat In The Hat.",
            "/u/Kaylee_Sometimes  Be very careful about how you enforce things like this. If the next time kid 2 tells on kid 1 and you do not proceed to do the same thing a resentment towards you will grow and it will never quite disappear.\n",
            "I'd use this but my kids watch all their TV on their iPads. No arguments over content",
            "When I was working at a school, tattle tellers would get in trouble too. I hated when kids did that, especially the older ones. Drove me nuts. They learned quickly not to do it when I was around. Hahaha!",
            "Lol. Don't know how many times I have said \"good point\" no more screens. Let's all do some chores!",
            "LOL what a dumb moment from the kid.\n\nBTW, discourage tattle-tailing by punishing both of them, much like this, every time they tattle over bullshit you don't care about. It encourages them to work together.",
            "During pokemon? too cruel.",
            "Please don't raise your kids to demand to speak to the manager.",
            "I have twins and have done this exact thing a bunch of times.",
            "\"This is why communism doesn't work\"",
            "> having to listen to an episode of Pokemon in the background\n\nNow you missed en ep!\n\nCongratulations - auto-malicious compliance... :P",
            "Allowing kid 2 to watch because of a “gray area” was a terrible idea in the first place. If you aren’t going to enforce the rule, what’s the point of it? If you had said that you would have allowed watching TV while eating _only_ for that day, I think you could avoid any mishaps from either kid1 or kid2.\n\nedit: changing to the used spelling of grey/gray",
            "Am I the only one that thinks this approach is stupid/short-sighted. The kid is doing exactly as instructed and is further extending the order. Kids do as you teach them. So clearly they don’t understand that exceptions exist for only when mom feels like it. \n\nFeels like you just wanted to make things easier for yourself instead of communicating that you were allowing an exception, something on which as kids they likely have an incomplete understanding. \n\nDownvote. ",
            "Please post this in r/parenting.  This is amazing",
            "What a stupid pointless rule. Rules like these are why kids end up having strained relationships with their parents.",
            "It's funny, I only watch TV when eating meals, if I'm having a nice dinner like a takeaway I always get a show ready while I eat",
            "With such stupid rules, you are lucky that I'm not your kid.",
            "Punishing kid 1 for following YOUR rules is clearly a good idea /s",
            "OMG THANK YOU for this!! Real laughing going on here. This is exactly what I'm going to do to my sweet angels. ",
            "I'm sorry they ruined your Morning by not allowing you to watch Pokèmon.",
            "You're evil!",
            "It's not malicious compliance if it's YOUR rules you're enforcing maliciously.    Malicious compliance is all about turning the rules against the person or system in power. In this context thats you. ",
            "My sister is 6 years younger but physically stronger. She can easily beat me up and likes to demontrate it. She used to corner me and provoke me, hoping to get a chance to flex her muscles at me. Pure power play. I was dismissed every time I tried to tell on her.\n\nSo I‘m a bit allergic to this mentality.",
            "That is a win, but just so you know you are out numbered and they are plotting their revenge on you",
            "Why the fuck wouldn't they be able to eat in front of the TV ? And why not let them watch TV for a set time each day ?",
            "This is great.  Then again Pokemon is great too.  What's your problem Mom! ;)",
            "My line is always, “Are you reporting (for safety reasons) or tattling (to get someone in trouble?” And I let them know I’ll only listen if they are reporting. ",
            "\"No one likes a fucking tattle tale, now beat it.\" - dear ol dad",
            "I want to grow up to be like you. Hope I can be as cool. ",
            "r/kidsarefuckingStupid",
            "I like the malicious compliance on the one hand, but on the other I've gotten the short end of the stick when a parent favors one kid in every situation (i.e. sibling doesn't have to help with something if they're busy but in the reverse situation will save me work) and it is indeed incredibly frustrating ¯\\_(ツ)_/¯",
            "That's a good lesson on \"Snitches get stitches\"",
            "GOTTA CATCH THEM A-",
            "This sounds like kids, all right.",
            "/r/maliciousmaliciouscompliancecompliance",
            "Classic embamboozledment. ",
            "Reminds me of this genius skit :\nhttps://youtu.be/lKzn1b4jpMQ",
            "Okay... but who doesn't want to listen to an episode of Pokemon while they drink their morning coffee?"
        ]
    },
    {
        "post_id": "ivf83f",
        "author": "OneMoose9",
        "title": "I have to move MY towel? Fine, have some sand.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ivf83f/i_have_to_move_my_towel_fine_have_some_sand/",
        "score": 15976,
        "num_comments": 164,
        "created_utc": 1600465230.0,
        "selftext": "When I was 12ish my family and I went on a camping trip with my mentally abusive pill of an uncle and his family. \n\nOne day we went to a beach that was a 5 minute walk from our campsite. I got there first and it was super windy so I spent forever struggling to get my towel to lay still. \n\nNow when I say it was windy, I mean it was whipping up sand windy and any sort of movement sent sand flying through the air. It was great. \n\nWhen I finally got settled it wasn't long till the rest of the group started filing onto the beach with my a**hole uncle leading the way. My uncle decided to lay his towel out about 3ft from where I was sitting. As soon as he finished he looked at me and demanded that I move myself and my towel somewhere else. \n\nTo this day I cannot remember what his reason was for making me move but I can tell you it was absurd and I was thoroughly annoyed. So I got up and grabbed my towel in a very aggressive manner causing a wall of sand to fly up and slam into my uncles face. \n\nI'm pretty sure he wanted to kill me that day, what with all the screaming about how I did it on purpose and got sand in his eyes and mouth. But I swore up and down that it was an accident so the rest of our family believed me and they told my uncle he was acting insane. By then everyone on the beach was staring at us so he had no choice but to stop making a scene and hate me in silence.\n\nI most definitely did it on purpose.",
        "permalink": "/r/MaliciousCompliance/comments/ivf83f/i_have_to_move_my_towel_fine_have_some_sand/",
        "comments": [
            "If you have to have anyone hate you, having them do it while silently fuming is the only way lol",
            "I mean he did ask for it.",
            "They knew you did it on purpose too. They knew...",
            "Your uncle sounds like a real sand up guy.",
            "Towel sand is the new pocket sand.",
            "Sounds like your uncle is also that salty bitch’s cousin, sandy dick",
            "“Move your towel”\n\n“....fuck you”",
            "Hahaha love it!",
            "Your uncle's a dick. Well played!",
            "Something tells me if you had tried to be careful he still would have got sand in his face and accused you of malicious intent. At least this way, you got a little satisfaction. 👏",
            "Based on the character representation of your uncle.... I’m fairly sure they knew it was on purpose. 👍👍😂😂",
            "Love it! But why did your parents subject you to him at all?",
            "Your entire family probably wanted to throw sand in his face themselves. You were their hero that day!",
            "I had an uncle when I was a kid who was super shitty to my aunt, I didn't know how much of a dick he was then but I naturally didn't like him. During some holiday gathering my cousin and I were throwing balls at him \"playfully\" when I decided, fuck it, and just hit him in the nuts. He proceeded to run around whining to the family about how I did it on purpose while they proceeded to continually brush him off. Now that I know how shitty he is I relish in this memory",
            "For a 12 year old tyke, you certainly had grit. Even your uncle would have to agree.",
            "I love this SO MUCH.\n\nI have an uncle who has literally ruined lives and is just an AWFUL person. For example, he told me (at 16) I should kill myself because I was a drain on my family (I had straight-forward clinical depression that was corrected with meds). 25 years later, I realized he was just an abusive shit head.\n\nI would have loved to kick sand in his face.\n\n(And oh golly he had a lot of trouble with quarantine because he was blacklisted from all grocery-delivering services and couldn’t get out on his own.... surprisingly NO ONE was willing to help him!! Wonders never cease.)\n\nTo clarify, my mom and I figured out how to get groceries to him despite the ban; as far as I know he’s as angry and evil as always. Fuck you, Uncle Mike, but you’re not gonna starve on my watch.",
            "Sweet Justice",
            "Unto bullies as they deserve!",
            "[deleted]",
            "It almost seems like there’s a shitty uncle downvoting all these comments.",
            "I don't like sand. It's coarse, and rough, and irritating, and it gets everywhere....",
            "Even at that age I would have said “no I was here first and if you didn’t want to as close as you are to me you should have Ickes a different spot”\nDid your parents not tell him to get over himself and do one for asking you to move?",
            "The reason he wanted to you to move, was to show you that he could.\n\nThat's all.",
            "At your next family reunion, tell him the story, and watch him flip again. Bring popcorn :D",
            "‘I most definitely did it on purpose’ 😂",
            "You should write off all your human family and commit to your moose family 100%. \n\nWe are the future!",
            "In Japan, heart surgeon. Number one. Steady hand. One day, Yakuza boss need new heart. I do operation. But, mistake! Yakuza boss die! Yakuza very mad. I hide in fishing boat, come to America. No english, no food, no money. Darryl give me job. Now I have house, American car, and new woman. Darryl save life. My big secret: I kill yakuza boss on purpose. I good surgeon. The best!",
            "Yeah, every family has a Funcle... mine was a real bag of dicks...",
            "Mate, get your dad to have a word with him. If someone treated my kid that way i won't ignore that shit",
            "It was a misunder-sand-ing. \nI’ll see myself out.",
            "Correct. That's why I have a question",
            "We all have that one -or two- relative and the best that we could do especially if we were just kids and couldn't do a thing or confront them about it is to be passive aggressive and act as innocent as we could.. \"huh, it was an  accident auntie, didn't mean to upend your teacup. Sorry for that \" I swear by the time I was 13 I was a pro at being   mc and pa at it",
            "I like you as a kid.  Please tell me you'd still do this again if you had the chance!  😂",
            "Clifton Beach?",
            ">ive been trying to do their fucking jobs.",
            "Good on you, m8",
            "Fine sir, thanks for the find.",
            "Or course you did.  I would have done that as well.",
            "Must have run out of that abomonation.",
            "Last line is the best",
            "Uh oh, hope he got some juice",
            "This is amazing.",
            "Haha I cant imagine ever saying that to one of my neices or nephew. Uncle was either young or just a douche?",
            "One of the most wholesome posts here (as a front pager) I've seen in so long) <3 I have uncles like this",
            "Should've told him when no one was looking.",
            "Does anyone who was present at the time remember this?",
            "Great job",
            "Truly wonderful, the mind of a child is.",
            "This is ridiculous",
            "\"Yes, I deliberately moved my towel after I was threatened to.\"",
            "Holy cow the amount of attention this is getting has given me anxiety lol",
            "Sounds delightful! He def deserved it.",
            "Very satisfying story, thank you. I'd be interested in reading more.",
            "Didn't read but......\n\nI hate sand it's rough, course, and it gets everywhere.",
            "[removed]",
            "If your uncle has a reddit account, you better makes sure your life insurance is topped up.",
            "It was either this post or the one before on aita....sorry but awesome effn story",
            "Man, I hope I don't end up like that uncle.\n\nAnd though he seems to have deserved it, it's not *really* malicious compliance.  It's malicious, and it's compliance, but the two words are independent in this case.",
            "[removed]"
        ]
    },
    {
        "post_id": "yzooka",
        "author": "None",
        "title": "I got fired for this, but worth it",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/yzooka/i_got_fired_for_this_but_worth_it/",
        "score": 15960,
        "num_comments": 1010,
        "created_utc": 1668898950.0,
        "selftext": "Waiting tables at a regional specialty pizza place, about ten years ago.\n\nFamily comes in, taking their order and the teenage daughter wants a calzone, and wants chicken wings as a filling/topping.\n\nI start to confirm she wants wings (this was before the boneless wing craze), because they have bones in them.\nShe's gives me that open mouth, raised eyebrow look that says \"uhh, did I stutter?\".  I say I'm going to have to check with the kitchen, and I ask a line cook if he could put wings in a calzone, his response was \"I mean.....I guess....\" and he translates to the pizza guy what we need, pizza guy shrugs and nods at me.\n\nI go back to the table, and say \"the kitchen says they can do it, but I want to make sure you want chicken wings in your calzone\" the dad, exasperated, says \"buddy, why is this so hard?\"\n\n\"Not hard at all, sir, coming right up\".\n\nThe kitchen guys are actually chuckling while they put this thing together, I walk it to the table, happily drop it off, and get called back 3 minutes later to explain why there's bones in a calzone.\n\nI (very comfortable with confrontation) say this is what you asked for, I confirmed twice, and the dad snaps his finger to the manager and calls her over.\n\nHe complains there's bones in his daughters calzone, manager looks at me and I say \"I confirmed twice she wanted chicken wings\", and the dad says \"you know what she meant, like chicken meat\".\n\nI explain \"there's chicken meat on those bones\"\n\nManager tells me to wait elsewhere, manager takes the tongue lashing from customer, and personally makes a new calzone. Mind you, the family eats their food while new calzone is being made, forcing teenager to eat alone while Dad keeps looking at his watch.\n\nI was fired (with no protest from me) about ten minutes later, in fact I got to leave before Calzone Girl finished her meal, and take great satisfaction knowing the manager had to bus the table afterwards.",
        "permalink": "/r/MaliciousCompliance/comments/yzooka/i_got_fired_for_this_but_worth_it/",
        "comments": [
            "I’m baffled that you got fired for this. As a manager I would have been in the back laughing my head off with you.",
            "This is a bittersweet ending, because that family is going to leave thinking they got their way and they have learned absolutely nothing",
            "My understanding of chicken wings: \n\nChicken wings have bones. \n\nBoneless chicken wings do not have bones.",
            "This is why I don’t work jobs where I’m required to work with customers. I would joyfully do this knowing that I would be fired. \nYelling at me, calling me names, basically treating me less than equal is gonna guarantee you won’t be pleased with the outcome.",
            "Dad is why the daughter is spoiled.",
            "It would audacious to order chicken wing meat in a calzone. Like, to make chicken wings, debone them, then make the calzone.\n\nI'd say its possible but youre going to be paying for at least 2 dishes",
            "I've only had one person in my serving career say \"you know what I meant.\" and it was the only time in my career I got to say \"it's not my job to assume, it's my job to bring you what you ask for, which is what I did. I assume nothing.\"\n\nIf they want a thing, they should ask for the thing. I don't get paid enough to try to read their minds.",
            "What a bonehead...",
            "You...got fired for this? Had I been the manager, I'd have high-fived you in the kitchen.",
            "How do an adult and an almost adult both mistake chicken wings for just chicken? When asked twice? What was OP supposed to do, deny them their order that they insisted was what they wanted? \n\nOP would have gotten fired for that and they got fired for giving the customers what they so rudely demanded. Twice. \n\nI don't understand them being fired in a damned if you do and damned if you don't situation.",
            "That's one of the rare posts (I'd even say the first) on this subreddit that made me sad :( i feel sorry for op being fired for that situation... I hope you're in a better place now",
            "Sounds like the customers won.  They got their food, the manager probably comped their bill and OP got promoted to unemployed.  10/10 they're going to try this again in the future.",
            "[deleted]",
            "Honestly: I don't see the malicious part in this, except for you getting fired/wrongly terminated. You even explained there are bones in this calzone.",
            "Don't know why you were fired",
            "I don’t understand how you were fired… you told them there were bones… how did that not compute?",
            "You shouldn’t have gotten fired for that.  Hell, you showed restraint if anything.\n\nI bet you’re in a better situation now.",
            "When I waited tables years ago, I had some bitchy teenage girl with her family order a chocolate milkshake ( as her dinner)\n\nWe had chocolate ice cream, and we made our own desserts, so I scooped it up, took it to the bar, and they blended it up\n\nTake it to the table, she scoffs at it and says, “I wanted vanilla ice cream, and chocolate syrup… everyone knows that’s how it’s made”\n\nHad to re-do it. Whole table tab was around $120 ( mom and dad were booze hounds), and they stiffed me.\n\nI hope that girl is now 100 pounds over weight from her stupid milkshakes.",
            "This is why you tell your manager when weird requests like this happens. Then they’re the ones liable.",
            "Sounds like they deserved chicken bones in their calzone",
            "I really don't see why you got fired for that. Customers were jerks",
            "OP got fired because his customers were stupid and his manager was spineless. \n\nHope you’ve got a better job now OP",
            "I was still in training. A large party came in. It was myself, the manager and one server. We had multiple call outs. I had a large tray of water. The restaurant was set up to where there was barely room to walk between tables, so I let the guy I was standing behind, waiting to get through, know I was right behind him with water. Please don’t move your chair. He verbally confirms he will not and immediately proceeds to ram his chair into me. Water went everywhere and he starts flipping out. It was an obvious ploy to get free food for his gigantic party, but I tried. \n\nI immediately went to get the mop and napkins. I’m coming out of the back with both. The manager comes over and starts laying into me about how I can’t just walk away when something happens. I was the only one who went to get anything to clean up with, so I handed her the mop, the napkins and walked out   Have fun serving an already upset idiot and his large family, as well as the rest of the dining room, with one less server. I saw where that job was going.",
            "Manager had no bones in his spine....",
            "Bro should have asked for a boneless pizza 💀",
            "Fuck that manager.",
            "> manager takes the tongue lashing from customer,\n\nLol US culture is so fucked up weird. I've waited tables in the Netherlands for 5 years at 3 restaurant and shit like that just does not happen. Customers are never that rude, and if they are, they get kicked out. \n\nThis whole spiel about how working in service and retail is such a horrible experience is uniquely US. It's Americans that suck, not those jobs.",
            "How to tell you’re from America without telling you are from America. I know it’s a cheap shot, but in most European countries you wouldn’t get fired over this. In 🇳🇱 the customer would be told of verbally. “You got what you ordered, stop complaining “",
            "The customer should have clarified what they were asking for exactly. Sounds like the daughter had an entitled attitude and her parents didn't care. If it were my kid I would of double-checked first. If something unusual is being ordered customer should clarify everything! \nOP, maybe double-check with manager for something like this before \"the shit hits the fan\" lol",
            "I honestly don’t understand why you got fired for this - honestly, most jobs would be great if not for the customers…",
            "I would have promoted you, if I was the manager.\n\nWhy fire you for giving them what they ordered?",
            "At will employment is such an abomination.",
            "When I was a waiter, I had plenty of dumb situations like this happen. On the topic of chicken, I had customer order a plate that came with chicken. He told me he wanted it medium rare so I told him we can't do that and the cooks wouldn't allow it. He says \"Well, I've come here plenty of times and they've always cooked it for me like that\" (never seen this man here before). Even his friends in his table looked confused with what he was saying. I tell him to let me confirm with the kitchen. The cooks were like \"No, we've never done this before and we won't do it.\" \n\nAfter another back and forth of me going to the kitchen and customer. The cooks said \"if he wants a raw chicken. Then lets have it in writing.\" Btw I was like 18 at the time, i didnt want to be in this position at all. I was scared to get confrontational and tell this to the customer. So i go back and I tell the customer the cooks cant do this. The customer says \"wow, can't believe yall are doing this to me.\" After this, I finally take and put in their order for the cooks.\n\nThe weird thing is is that the table enjoyed their food and had no complaints about their food. I even went to my manager who ran the register and asked her if that table (specifically that guy) complained. She said no and they left me a decent tip too. I told her how i expected the guy to complain and explained to her what happened. She totally had my back and agreed on what we did. Even told me to come get her if anything similar like that happens again. Kinda sucks your manager didn't do the same",
            "I feel like body cameras for waiters would almost be better served than for police.\n\n\"Are you sure you want chicken wings? With bones?\" \n\n\"Yes\"\n\n\"She meant chicken meat\"\n\n\"Let's go to the body cam footage! Nope waiter specifically said with bones, you pay double now for being an asshat.\"",
            "Already fired? Should have dumped a pitcher on the table on your way out. That way they could all eat together when your POS manager kissed their ass again.",
            "I mean, you can’t fix stupid",
            "Damn, you went above and beyond there and they fired you for it.  \n\nOne of those \"man sorry they canned you and congratulations on escaping those clowns\" situations",
            "Holy shit the guy who ordered boneless pizza was actually on to something.",
            "“You know what she meant”, then say what you mean",
            "There is absolutely nothing satisfying about this story.",
            "The customer is always wrong. That manager is a piece of shit for not supporting the staff when a customer does some dumb shit. If that was my place I'd tell that customer to fuck right off she got what was ordered if they want something different then they can pay for a second one also.\n\nThese kind of managers need to stop supporting the customer and support their employees",
            "Not quite the same situation but I was a waiter at kind of a mod level restaurant, not quite high end fine dining but not Olive Garden either. Nice enough for about half the clientele considering it a fancy night out basically.\n\nSo we're open Thanksgiving Eve basically but were closing early at 7. It was 6:30 and it had been relatively slow and my section was up on rotation for the next table as a small group of 3 people came in, seemed like 3 friends but late 30s maybe early 40s. I greeted the table went through the whole speal, and let them know that we closed early and that the kitchen would be closing soon so they would need to order soon and that everything would need to come out together since when the kitchen closes the stations they don't open it back up.\n\nThey said ok and that they already knew what they wanted. Got appetizers, main course, desserts and alcohol.\n\nI made sure to ask if they were sure about dessert because there was ice cream involved with the kitchen closing and they snapped back \"Yes we heard you the first time, hopefully you heard our order\". I said ok and that I'd put the food order in and come back for the drink order. So I walked away put the food order in and came back with waters to get their drinks. They asked what the bar had, even though it was on the menu, so I ran through the regular alcohol and wine staples and they asked if we had Hennessy. I said no but we had Remy and that we had XO or VSOP.\n\nI started to explain the difference but the guy interrupted me saying that the XO is fine. I started to explain that it's 10 year vs 4 year aged so XO is a lot more expensive but the guy just incredulously looked at me and interrupted me again saying \"Do you always question your guests orders like this? No wonder this place is dead tonight. Oh and make it a double\".\n\nMy manager had to get involved twice. Once when all the food came out at the same time, apps, meals & desserts, and I got chewed out saying I never explained that everything would come out together and how I rushed them. They proceeded to stay an hour and a half after our closing time. At which point my manager had to get involved a second time when they finally got the check and realized how much a double of Remy XO cost. Once again almost raging about how I misled them and didn't explain anything and all the standard bullshit.\n\nMy manager didn't fire me over it but I definitely knew I was basically getting no tip on the highest spending table the whole night, which they of course did, tipped the change to round it up to the next dollar with a smiley face on it, and this was after my manager comped the desserts and 1/2 of the Remy.\n\nThankfully my manager knew the shitheads would do that, AND was making me drive out to my family super late so he fucked around with the ticket putting auto gratuity so the total came out to the same but so I at least got 20% on a lower check with the card charge looking the same.\n\nMy manager was a shithead too but that day he was a good dude....Then he got fired 4 months later for getting caught fucking one of the hostesses that was in high school, while his assistant manager got arrested in the restaurant after 5 different women complained to police that he pulled his dick out and flashed them in the elevator of the parking garage by the restaurant....good times.",
            "This is why my boys can’t work FOH. They have no patience for people like this and will call out their stupidity/ignorance/Karen attitude and not care if they get fired.",
            "If I were your manager that day things would have gone differently.   \n\nFirst, I'd have walked over and ask that guy if he just snapped his fingers at me. When he confirmed he did I'd have told him I'm not his slave so you better start off by apologizing to me for treating me like one.   \n\nSecond, I'd have asked the dad if the words \"no bones\" ever fell out of his daughters mouth. When you the server confirmed that they did not I, as the manager, would have told these idiots they got just what they ordered.   \n\nAnd third, when the Dad starts spouting off I'd have called the cops to have these unruly patrons removed.  \n\nOf course, I'm a salty old fart that has been in the service industry for years and never took that kind of treatment from any patron, ever.",
            "You got fired for that? Wow! Can’t believe management didn’t agree these people were being ridiculous and chuckle along with the rest of the staff. You’re obviously better off for leaving. \n\nAnd seriously, what idiot adds chicken to a calzone by requesting “chicken wings”?",
            "That’s messed up that you were fired.  But I absolutely love what you did.",
            "Look what happened to Brad’s Wife at Cracker Barrel",
            "I feel you, I used to work at a family run pizza resturant. Had a costumer ask for every topping we had, which was like more than 20 on a small 7 inch pizza. Checked multiple times to make sure he wasn't joking around, he started getting angry when I questioned his dumb order. He complained to my manager that the pizza dough was uncooked, it could literally not bake and crisp up cuss there was so much shit on it. I proceeded to get in trouble. People suck.",
            "When explaining why there were bones in the calzone, I hope you asked the Dad, \"buddy, why is this so hard?\"",
            "Can’t believe you got fired of someone not having any kind of control over their native language",
            ">I explain \"there's chicken meat on those bones\"\n\nThis killed me lol",
            "The only thing the manager proved by firing you is that they are an even bigger idiot than the customers.",
            "It might have been easier just to tell the customer, “No.”",
            "All of this is not sane. I am baffled at your society time and again. I know these stories must be the excesses of your society, but still the blatant normalisation of absolutely insane stuff is just mind boggling every single time.\n\n1) customer has attitude to waiter eg. \"did I stutter\"-attitude\n\n\\- very odd\n\n2) customer gets what they order and are not satisfied and then does not accept the outcome or their own role they played in the part.\n\nbaffling to me, this is not normal\n\n3) you get changed bussing area over this\n\n\\- avoidance of the dispute does not resolve it.\n\n\\- how about both you and customer just deal with it and nothing changes?\n\n\\- why does manager not accept your side? You have known and worked toghether for years.\n\n4) you get fired over something so trivial\n\n\\-have you no labor rights?\n\n\\-does the owner not have any morals?\n\n\\-does the customer accept such behavior from a business, where they so casually fuck with someones income like that?\n\nany of these is just crazy to me, but for you it all seems so normal, that's the thing that continues to surprises me.",
            "\"Let me get uhhhhhh **BONELESS** pizza and a two liter of pepsi.\"",
            "Manager is a piece of shit.\n\nSorry, no excuse to fire you.  You did what was asked.",
            "Insane you got fired for this. I just don't understand people like this. I'm someone who personally doesn't like bones so I just ask if I'm unsure - no need to be a jerk about it. I hope one day everyone can just treat those doing them service some respect.",
            "Did you point out the potential problem - \"I have to make sure you're aware that there will be bones in the calzone\"? - or just keep repeating the question about wings?\n\nYes, I know it should be obvious, but some people are thick, and sometimes they go to restaurants.",
            "I don't get why you were fired.  You double checked that she wanted wings, and she said yes.  You did what you were asked to do.  Not a fireable offense, IMO.  Still, you were probably better off not working for a mangager who didn't have your back.",
            "Why did you get fired?  You did what they asked.",
            "You called them idiots on your way out the door, right?",
            "did they fire the chefs too? wtf",
            "Boneless wings? ITS A GODAMN CHICKEN NUGGET.",
            "I would be angry looking back at this story… not satisfied! They got exactly what they ordered? And we’re told twice that the chicken is on the bone… the reaction makes no sense and the firing is even more wild",
            "I used to manage retail and when we got customers like this I would look at my employee and wink then take them over the coals in front of the customer then escort the employee to the back room where we would laugh out asses off. Don't get me wrong, if an employee deserved disciplinary action they got it,but it was never yelling and never in front of customers or employees. The \"show\" I put on with the help of the employee was literally just to get the customer to shut up and go away and regular customers would know it and sometimes you would see them cracking a smile when we did it. For context I managed a retail store in a crappy part of town.",
            "I got fired from a serving job 10+ years ago because the table complained over and over, on a busy ass Sunday brunch/lunch rush, that their food was taking too long. Excuse me Mr manager but *HOW THE FUCK* is that *my* fault? I handled it well, got my manager to talk to them, got them settled, and was fired end of shift. 🖕🖕🖕🖕",
            "Ah yes, because everybody knows chickens have no bones, which is why you've never seen a chicken skeleton before. /s",
            "Your manager is just the type of manager who never should be made a manager...",
            "Gives customer what they want. Gets fired. Everything makes perfect sense here.",
            "What the F?  Was the kitchen supposed to pick meat and skin off a bunch of wings and put that inside a calzone?\n\nShe dumb…",
            "Ah yes, chicken wings = chicken meat.\nIf my head wasnt hurting already, it would be now",
            "Something tells me a major part of the story is missing.",
            "This is always why you run it past the manager in sight of other employees. Let the manager eat the shit. Not you.",
            "Fired for giving the customer for they wanted after also confirming twice that this was actually what they wanted? The fuck kind of shithole country do you live in where this allowed?",
            "[deleted]",
            "If she wanted chicken in his calzone, she would be ordered calzone with chicken (meat), not with chicken wings. Because wings have bones...",
            "Your manager is shit",
            "This must be in America? Where else in the world can you get fired this easily for doing your job.",
            "Why would you specify \"Chicken Wings\" if you wanted \"Chicken Meat\"???",
            "That entire family is fucking trash. Miserable human beings being pathetic nothing new",
            "Did the daughter then demand a goose that lays golden eggs and fall into a chute to the incinerators?",
            "i think all staff whom work in the service of people shud wear a body cam \n\nto protect themselves against customers and bosses like that and also watching back the videos for a laugh bound to be some funny one's",
            "Should have called the manager over to confirm that the order was correct.  Not the line cook.",
            "Manager should have asked them to leave.  You did everything right, not your fault the customers were idiots.",
            "That family doesn’t know manners for the life of them. Sickos. It was better you got fired, they didn’t deserve your hard work. They saved you from a longer span of misery",
            "As a makeshift wage, the sweetest one I had was a security guard job during my college years. I was sitting in a tiny guard shack overseeing a completely empty trailer lot in the middle of nowhere. I could study, do my home work, read books, eat and even nap. Yes it wasn’t all tax free cash from tips but the gig was clean, guaranteed, easy to do and paid fair back in that time. On top of all that, I didn’t have to deal with all that petty human drama, idiotic entitlement, theatrical tantrums, cretinous rage, and inconceivable rudeness from all that typical man-child crowd of failed adults and their spoiled litter. Just a food for though.",
            "Honestly if my server has to ask the kitchen if they can do it and double checks my order *twice*, I'm going to start really thinking about what could be so confusing about it so I can clear up any misunderstandings and make sure I get the food I want.",
            "It is extremely easy to be fired because of things customers do or say, and the people that go out of their way to cause that chaos are absolute shit stains \n\nI lost my first job ever because at KFC as a teen(not that I liked the job)because someone called in and said I made a racial slur, I am in no way racist at all and don’t even say racial slurs ever, I told my boss there’s no way I said that and he said sorry we still gotta let you go\n\nWhat made it worse was I called my parents on my way home, and all they had to say was, “WOW anon I’ve never been fired from a job ever” cool thanks, parents of the year",
            "I have been a vegetarian for almost 20 years and I know chicken wings have bones.",
            "Sounds like the family wanted a lawsuit.\nChicken bones in food can be a choking hazard.",
            "[deleted]",
            "I’d protest the firing. “Customer is always right” type of deal (which I don’t believe), you gave them what they wanted and double checked. Not your fault they are stupid.",
            "You’re a better person than me. I woulda let those people have it. If I’m getting fired I’m going out wild! That girl and her farther are morons and that bullshit is absolutely unacceptable!",
            "Fuck that manager.",
            "The craziest part of the story is that you got fired",
            "I'm stunned at how stupid the daughter AND the father were in this instance.  You mean to tell me neither understood the difference between actual wings, and just simply a calzone with chicken? \n\nI'll bet later when they told the story to others about how they ordered wings on a pizza and were pissed off that it had bones in it, the people they told looked at them like they were idiots. \n\nOr maybe their friends are idiots too. Maybe idiots who only hang with other idiots is how so many people stay so stupid",
            "Makes no sense you were fired. Leaving something out of the story or just shitty manager?",
            "> I start to confirm she wants wings (this was before the boneless wing craze), because they have bones in them.\n\nDid you specifically mention about the bones or did you just say \"you sure you want chicken wings\"?",
            "People make fraudulent slips all the time, I’m surprised you didn’t specifically ask about the bones when confirming.",
            "Why is it that the dumbest people get promoted to manager?",
            "I'm confused. What exactly was the cause for firing?",
            "Fired for this shiet? Why a crappy management",
            "This is why you just say no. If you don't like the item on the menu, order something else.",
            ">you know what she meant, like chicken meat\n\nYeah I know what she meant, which is why I checked *twice* whether she actually meant what she said, and she literally asked for bones.\n\nCustomer is always right in matters of taste.",
            "But the customer is always right 🙄",
            "As a customer, this is one reason I like the qr code me nis so damned much.  I specify what I want and it's clear in c ase there are discrepancies. Wait staff can still add value by explaining dishes, offering suggestions, etc.\n\nIt still bugs me when a waiter person doesn't write down the order. You think you are showing professionalism... But it's another point of failure.",
            "What a douche manager. Clearly you know what they meant, but you did verify and the responsed. I would have offered to make them another one and charged for both plus extra for the extra labor on the boneless one.",
            "Did you clarify when you \"confirmed twice\" that chicken wings have bones in them",
            "What was the reason? Like if someone tells me chicken wings then I assume chicken wings. No I don’t know they mean chicken meat because that’s just called chicken.",
            "They FIRED you for this??? What the heck",
            "Thought this could be real until they claimed they got fired 10 minutes later…",
            "You confirmed twice...gave her exactly what was ordered...and you weren't ture about it, although I wouldn't have blamed you were. So the manager just rewarded bad behavior...and a Karen was born.",
            "I would never fire someone over a guest making a weird request.",
            "Some men just want to watch the world burn…\n\nI love chicken wings. \n\nI love calzones. \n\nNever shall the two occupy the same space at the same time.",
            "I see why servers used to spit in people's food",
            "this is why I hate working in the \"service industry\" because of the so called \"The customer is always right \" philosophy.....  \nNEWS FLASH..... the customer isn't necessarily right all the time .....",
            "I always confirm with a manager before I touch a weird order like this. Make it their problem so they can’t fire you",
            "Getting fired for a stupid customer like this might be a blessing.  Your manager fired you for such a stupid reason, giving the customer what they ordered. No kitchen is going to remove the bones from Chicken wings unless you're paying a huge price. \n\nIf this had happened to me the manager and customer would have been blessed out in front of everyone, full bore as I had nothing to lose. Nether the customer or manager has a shred of intelligence.  \n\nI had bad guests try to get my staff fired, hoping to get something for free. Once it's clear what they want I deny them satisfaction. Most are just creepy liars in my book. I will always believe my server over the guest.",
            "The phrase \"there's chicken meat on those chicken wings\" is what got you fired, it sounds like you gave them wings because you decided to.\n\nSaying \"you requested chicken wings, not chicken meat\" could have saved tou",
            "In reading this I was confused. I’ve gone through some comments, but… it sounds like a miscommunication or you doing this intentionally… I understood in the very first part of the story that they only want the meat part in the order. And while you clarified the chicken has bones… you didn’t say you clarified that they wanted the bones in the calzone.",
            "Why were you fired? You followed instructions, and even got confirmation. The idea that you should have know they meant chicken fingers, rather than chicken wings, is ludicrous. That's a wrongful dismissal suit, or should have been, but I guess it's too late now.",
            "They should not have fired you.\n\nBut if they were the kind of place that *would* fire someone over this, they're the kind of people you don't want to work for.",
            "[deleted]",
            "Only thing I would have added both times is “you want chicken wings with bones in your calzone?”\n\nHis fault.  Personally, he should have been kicked out for summoning your manager with finger snaps.",
            "Always call the regional manager in times like these, it's going to make for a much better story, even if fictional.",
            "Drop the restaurant name and location",
            "Why would you get fired for doing exactly what the little twatwaffle asked for?",
            "OP served a *bone-in calzone* with a straight face, *without once* reminding the customer that wings have bones…\n\nOP, you might not have been as good at that job as you thought you were.",
            "Seems like \"are you sure?\" Should have been replaced with \"there are bones in our wings and that will be terrible to eat in a calzone.\" People can be jerks but communication goes a long way.",
            "Well that's just not a nice thing to say.\nOh well, I'm over it.\nEnjoy the holidays!",
            "Just to be clear, that was not worth it at all.. You got nothing out of that interaction that I can see (unless you were really wanting to quit but couldn't for some reason).  \nAmerican customer service and employment law is so fucked. Here they would've been charged for any new calzone, and if they started talking shit, asked to leave and not come back."
        ]
    },
    {
        "post_id": "je2u9l",
        "author": "Successful-Medicine9",
        "title": "Comply with the 30-year old dress code? You got it, Boss.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/je2u9l/comply_with_the_30year_old_dress_code_you_got_it/",
        "score": 15953,
        "num_comments": 716,
        "created_utc": 1603118406.0,
        "selftext": "**Update**: First of all, wow! Thank you all for so much for your support, understanding, and awards. I'm newish to Reddit and I was completely overwhelmed with the responses to this post, so I apologize if I didn't get to your comment. I've had a number of folks suggest I put up a photo gallery of barely-compliant outfits, and I would very much appreciate suggestions for how/where to do that (subreddits only, not an insta fan sorry). I'll be off of the grid all next week but I can start putting some together after that. And to those of you who disagree with how I handled this situation, know that I don't hate you. I just think you're wrong.\n\nThe shelter I've (30M) been working at for a couple of years now is over 30 years old, and is quite notorious for keeping things that way. The daily notes are physically kept in binders, 80's-style punitive measures are imposed on clients in conflict, and the electrical panels are labeled with cards that went through a typewriter. You get the idea.\n\nThe floor supervisor (over 20 years in that position) emphasized that even though jeans were allowed, we needed to strictly adhere to the dress code. That meant button-up or collared shirts, no logos, only long pants/dresses, no hats unless you're outside, no visible tattoos, etc. In other words, dress nothing like the vast majority of the people we serve. \"We're meant to dress they way they should aspire to dress,\" said the supervisor. I was told other staff -including staff above my paygrade- have long hated the dress code and unsuccessfully tried to change it for years. None of them were bold little shits like me, though.\n\nGiven my previous experience with underserved populations, I also knew this was a terrible idea. Generally speaking what people in these communities lack in financial resources, they make up for in their abilities to read people and navigate emotions. If they think you're an authority figure or acting inauthentic, many will outright write you off. And for the most part they have a great social/emotional radar.\n\nThe dress code said men's shirts must, \"... have visible buttons *or* a collar.\" I sewed two buttons near my hip on a plain t-shirt and wore it in. They said nothing the first time, but had a meeting where they \"weren't pointing out anyone in particular\" and updated that specific part of the policy to prevent me from doing it again. Next I wore capris. After all, nothing about pant length was mentioned either. That time the code was updated and we were informed via email. Still no one-on-one conversation about it.\n\nA few months and minor malicious compliances later, our workplace gave us logoed t-shirts with the institution's name and website on them. Hooray, we thought! We will at least be able to wear t-shirts now. Nope. After a week of several coworkers wearing the shirts *they gave us*, we got an org wide email that the shirts did not comply with the dress code and should not be worn during work hours. Knowing me as the office rabble-rouser, several pissed off coworkers came to me independently to ask how they too could rebel. Enter this story's biggest malicious compliance.\n\nAs a minimalist, I had no desire to hold onto a shirt that I would not wear. We had no input on the design/color of the shirts, and I simply did not need it taking up space in my closet. The most reasonable alternative would be to turn the shirt back in and explain that, so I did. Coworker #1 was moving soon and didn't need an extra thing to pack, so she also turned hers in. #2's partner hated dark green (the shirt's color), so he turned his in. This happened all they way to 25 total employees, with some borrowing other's excuses.\n\nAfter 5 days, the supervisor had a box with two-dozen shirts sitting in his tiny office. He actually has to keep them on his desk, and I can hear him bumping his hand against them when he uses the mouse.  3 months later they are still there. He's not dumb; he knows those shirts are an \"F you\" that lives in his office.\n\nHe cannot donate them to the shelter due to some other ridiculous handbook rule about organizational spending, and he bikes 6 miles to work so driving them home isn't a reasonable option. He's tried putting them in general office storage, but his boss has said the shirts are the supervisor's problem since he ordered them. Currently he's just stuck. We know it bothers him, but he knows he can't bring it up since it's his own rules that prevent us from wearing them.\n\nNo dress code changes so far, but the top-of-the-year meeting regarding our handbook has dress code on the table. 3 of the people who returned shirts are a part of that advisory board of 5. I'm cautiously optimistic that we'll finally be rid of of some of the dumb, short-sighted elements of our dress code come February.\n\nTL:DR The homeless shelter I work at has a dress code that drastically sets staff apart from the community we serve. I convinced several coworkers to turn in their non-compliant clothing. My boss has since had to deal with a pile of clothes on his desk.",
        "permalink": "/r/MaliciousCompliance/comments/je2u9l/comply_with_the_30year_old_dress_code_you_got_it/",
        "comments": [
            "[deleted]",
            "I was thinking since it stated “men’s shirts must.” You would be coming in with women’s shirts",
            "In that kind of setting, every employee wearing the same shirt (with logo) would probably be best.  It makes the employees easier to identify for the clients.",
            "We had similar issues at a kids home I worked at! \n\nThe higher ups kept pushing for us to dress up with suits/ties/dresses/etc \n\nWe tried so hard to point out that the kids will distrust us and then not to mention the harm they could cause. \n\nSeveral had behavioral issues and for example wearing a tie would be a great way to strangle a staff member \n\nI left before they implemented even more strict rules",
            "Dress codes are among the worst.\n\nSo are people who think people living in a shelter need people's nice clothes to aspire to.",
            "I made this its own post a while ago, but it's my favorite MC I've done.  I worked in an office in a large shipping company.  We were in a nondescript office park.  We had no logo on our door.  We had a code for the door.  Customers didn't even know where we were, but they were not allowed in the building.  In the six years I was there, 0 unauthorized people tried to gain entry to the building to ship something.  So, nobody in the office had any customer-facing positions at all--all of our customer communication was by phone or email.\n\nSo I'd been off for a bit and came back to work in early summer.  I wore the same shoes I'd worn last summer, which was a pair of dressy sandals.  I was taken aside and informed that I could not show more than three toes, so I would have to get new shoes.\n\nFine.  I spent all weekend shopping for shoes.  Finally found a pair that I liked that only showed three toes.\n\nWell, they were wedges.  Apparently wedges were unprofessional and not allowed.  Now, this was a wedge that matched the shoe--no cork or espadrille or whatever.  I challenged it saying that high heels hurt my feet.  My wedges were okay...but they had a platform.  Boss says, no platforms over 1\".  I measured, mine were exactly 1\".  So then boss says that the shoe has an open back and the dress code says either open back or open front but not both.  I pointed out that in the pictures on the website, there was a peep-toe with an open back.\n\nFinally, my supervisor said that I should wear other shoes tomorrow, but bring my sandals so that the supervisors could have a meeting over their appropriateness.\n\nWTF.\n\nSo, I called my doctor.  I had just had knee surgery a few months before.  I described the shoes and the nurse said it was fine and that my dress code was ridiculous.  She wrote and the doctor signed that I was permitted to wear whatever shoes I wanted.  They faxed me the note and I emailed it to both supervisors.\n\nThey were PISSED.  I wore those damn shoes every fucking day that summer, and then with tights in the winter.",
            "Oh man. I work from home and we have to dress professionally. I am the only one on my team with visible tattoos and we have to cover up our tattoos. They finally sent us collared polos to wear, but since I’m a woman, I got the women’s style. Which doesn’t have buttons like the men’s polos. It’s a v neck, that STILL shows my chest tattoo. I was told I still have to cover my tattoo (it’s just a single letter that shows), but not to wear a bandaid because it’s unprofessional. So I’ve taken to wearing the gaudiest necklaces I can to “cover” my tattoo.",
            "[deleted]",
            "I mean I can understand why they'd want you to be decently dressed, but why enforce a dress code for a homeless shelter.\n\nEdit: and then stop short of an actual uniform.",
            "Your superviser could drive them home with his bike, just not all 25 at once. However I don't think he wants them at home.",
            "May I suggest going in another direction?\n\nI would like to know whether or not a Tuxedo violates any of the rules.\n\nI think the community you serve would enjoy seeing you wear it, and I think local news might pick up on it as well.",
            "> “We’re meant to dress the way they should aspire to dress.” \n\n\nComes off as OP’s boss making sure the homeless people know they are different from the employees. We are all humans and sometimes we need help. OP’s boss seems like a condescending prick if that’s really his rational.",
            "I mean...right now, the highest paid jobs have mostly gone remote.\n\nAnd we all know work from home = no pants.\n\nSo...by the aspirational logic of that dress code, you shouldn't be wearing pants...",
            "70s cowboy plaid shirts with pearl buttons are the way to go.",
            ">80's-style punitive measures are imposed on clients in conflict\n\nWhile I've sympathy for you with the dress code, I'm more concerned about this.\n\nIs your organisation actually fit for purpose?",
            "I adore malicious perfection 😍",
            "This boggles my mind. We had “professional” dress at the shelter I worked at, but we usually just wore what we wanted. I’m goth and fully tattooed and honestly the way I presented myself helped me build relationships with the guests and helped them trust me and ultimately go on and get clean/housing.\n\nHopefully they change the dress code for you soon! That’s awesome what you guys did",
            "Ok, hear me out here. \n\nAsk for the shirts back. Slice them up the middle, and sew them back together using buttons. You now have a perfectly suitable short sleeved button up shirt. Bonus, it's got the org's logo on it!\n\nIt'll also look stupid as fuck.",
            ">Given my previous experience with underserved populations, I also knew this was a terrible idea. Generally speaking what people in these communities lack in financial resources, they make up for in their abilities to read people and navigate emotions. If they think you're an authority figure or acting inauthentic, many will outright write you off. And for the most part they have a great social/emotional radar. \n\nThis needs to be brought up in the next meeting. This manager is holding you all back.",
            "You should stitch together a bunch of cut up, mismatched clothing and make it compliant",
            "Aloha shirts. The louder the better.",
            "If it is warm in the office, have you considered a skirt?, and then if they tell you off for wearing it make a sexual harassment claim to HR",
            "I had a cubicle job where we were the only department that had a dress code. We also had no in person customer contact. I got a variety of the most ridiculous looking dress shoes I could find. I lived for crossing my legs in a department meeting and watching my manager glare at my shoes.",
            "> \"We're meant to dress they way they should aspire to dress,\" said the supervisor.\n\nthis person is scum and should find another line of work.",
            "My office has a 90's dress code. They \\*just\\* removed \"women must wear closed-toe sandals\" and \"women must wear nylons with sandals\" from the handbook. It's ridiculous. And we do not interact with the public.",
            "Another rebellion:\n\n Get appropriate shirts at a thrift shop that are either 3 sizes too large or small enough to look sprayed on. \n\nHow about tropical shirts? \n\nButton uo crop tops?\n\nShirts with paint on them. \n\nShirts with one long and one short sleeve. \n\nPants with cut off hems. \n\nPants with side seams cut up to the waist. \n\nPants with neatly hemmed holes. \n\nIf the dress code says nothing about colour experiment with tie dye.",
            "The only dress code that should exist is safety oriented and call it a damn day. The work gets fucking done that's all that should matter but management needs to have seventeen pointless meetings about collar vs no collar",
            "I'll never understand the mentality of this crap.\n\nI'm a drug and alcohol counselor, a select few sites want me in a suit and tie. I come from a blue collar family in a blue collar area.\n\nI know what I'd do if I needed help and everyone in the building is dressed like their shit don't stink.",
            "And here I was reading and thinking \"he's gonna give all the shirts to the homeless, the clever bastard\". A bit disappointed as I would have loved to read about how everyone was confused about the \"staff\" looking slightly out of place.",
            "If you wear any of the suggested options from the comments, I think I can speak for everyone here when I say that we need daily photos.",
            "> only long pants/**dresses**\n\nYou missed a golden opportunity there",
            "Dude you should show up in full 1700s garb. I feel like that would fit the dress code.",
            "I worked for a guy in a computer shop as a tech. He had a dress code that we had to wear dress clothes (dress pants, collared shirt, black dress shoes) as to look professional. I didn't mind at all, as I liked looking good.\n\nHe also made me wear a tie.\n\nProblem here was that most people in the same industry (IT people, other computer shops) etc really weren't wearing ties. It was a pointless thing. Also, the ties were a pain in the ass as they would flop into your open case as you worked and I had to source out a tie clip to secure it to your shirt, which then really mooted the point of wearing a tie. The whole thing was just a pain in the ass.\n\nAlso, the other tech I worked with didn't have to wear a tie. I HAD to, but he did not, because \"I fucked up by allowing him to not wear a tie, but you have to wear a tie.\"\n\nIt was more about the boss being a narcissist and having to have his own way.\n\nIn the end I refused to wear a tie.  He got super pissy about it, but really couldn't do a thing about it because the other guy didn't have to wear a tie.",
            "I work in a similar type of place and we can wear what we want within reason, basically just nothing revealing, no tracksuits, sport team tops and nothing offensive. This is also good because we sometimes go out in public with the people we support and the idea is that we just look like a friend or family member.\n\nTo identify us as staff we have land yards with ID badges on them, your work should just do something like that if they want staff to be easily identified.",
            "I would rock the [jail shirt look](https://www.amazon.com/dp/B004HV8E4W/ref=cm_sw_r_cp_awdb_btf_t1_yoDJFbZ0GSM7C)",
            "Whoa. I read the entire post and this was for a *homeless shelter*? The fuck? ...",
            "Wear a kilt, complete with sporran and Sgian-dubh 👍🏽🏴󠁧󠁢󠁳󠁣󠁴󠁿",
            "Wear a dress shirt under a tee...better yet if you have/ know someone with sewing ability, cut a thrifted dress shirt collar out and sew that collar onto the tee shirt. Bonus points if it's an ugly collar from a tacky shirt.\n\nIf you like the tee shirt, there are stitch widths you can use to make them super easy to remove.\n\nAlso, mad props on the button idea!\n\nJust throwing ideas out there.",
            "I'm curious: does the dress code label dresses as a woman's only item? Cause that would be pretty hysterical to see a bunch of men walk in in dress code compliant dresses for the day.",
            "For years, my Dad had this butt-ugly button up shirt with pictures of fish all over it. We affectionately called it his \"perch shirt\". My Mom HATED it, so when he got a job at an embassy and moved overseas, she jumped at the opportunity to toss it (It wasn't \"professional\" enough for the status of the new job). Fast forward a couple years, and my husband and I are shopping for Christmas presents at WalMart and lo and behold: a perch shirt. It's not exactly the same as his old one, but it still got a gleeful reaction when he opened that present (and the biggest eye roll I've ever seen on my mom's face).\n\n\nTLDR: Get a shirt with fish on it.",
            "I’m developmental therapist and a big part of my job serving my families were home visits. We also had a ridiculous dress code and it also set us apart from the families we worked with. I 100% used MC to my advantage. It stated in our dress code that we had to follow it “in the office” so that is exactly what I did. And I deliberately made my appointments in a homeless shelter that I worked with several families on days that I could “dress down”. I wanted to be sure that the kids and moms were comfortable with me and I made a good first impression, and that means I didn’t show up in their “home” looking like an “authority figure”. We also had to cover our tattoos in the office so I always made a big deal covering up my very small (the only one I had at the time) tattoo with a huge brightly colored ace bandage, to demonstrate how ridiculous that dress code was. My boss hated it! But there was NOTHING she could do. Parents LOVED me and would ask me about it and I diplomatically and objectively explained that it was our dress code. Many of them complained to management. I didnt stay with the organization long enough (the dress code was just the beginning) to see any changes.",
            "I was waiting on you to show up in a tux like Jim from The Office.",
            "Find a local donar  that will buy high end button down shirts for those you serve.   Spread the word as to why this is happening and have the local news paper catch wind of the arrogance and show up for a photoshoot",
            "bet the supervisor is on a home owner association board",
            "Oh please update once the meeting happens.",
            "I was sort of waiting for you to show up in a 30 year old three piece suit, but the tshirts box was even better",
            "OP, do turtle neck shirts have a collar??",
            "> only long pants/dresses\n\n> After all, nothing about pant length was mentioned either\n\nWhich is it",
            "Had a buddy come in the office wearing a dinosaur costume with a suit and tie on. Our conference rooms were in the basement and I was in a video conference  meeting and saw two dinosaur feet walk by. I stopped mid sentence and had to explain to the people on the call that a dinosaur just walked by.",
            "We had an unnecessary tie rule for males at one of my first job.  I joined an insurrection of finding the butt ugliest ties you could find.  No give in corporate policy.  I left after 18 months.",
            "Has anyone spoken to your boss about Maslow's hierarchy of needs?  https://en.m.wikipedia.org/wiki/Maslow's_hierarchy_of_needs\n\nThat should enlighten him to what the clients are going through.",
            "Bookmarking this to follow up next year.",
            "The dress code does sounds insane for a shelter - you're totally right.\n\nAs a genuine tip if you can't get it changed - something like corduroy trousers and flannel shirts would fit the dress code and still look pretty casual. [Here is an example](https://ohanthonio.com/wp-content/uploads/2015/11/urban-outfitters6.jpg) \\- it's a little hipster looking, but better than being the guy working in a shelter looking like an accountant.",
            "I'd start apologizing to clients \"I'm sorry for how I'm dressed, but Management thinks you should aspire to dress like this and that we should be setting the example for it too. They seem to still think it's the 1980s since that's when these dress-codes were made.\" But that's due to a hope that if clients complain about it, things might change.\n\nFrom the description, I kinda picture you all looking like Dee Snider from Strangeland when Captain Howdy has served his prison time and wears button ups and khakis. Right down to the make up to cover his extensive tattoos.\n\nBut since it's from the 80s, you could also try rocking David Bowie's outfit from Labyrinth. XD",
            "I always felt like if you have a strict dress code, you need to just provide a uniform. It's not worth the fight - either go 100 or just let it go.",
            "I didn’t read all the comments. Once upon a time I was a caseworker for adults with severe and persistent mental illness. At that time the DBHDD recommended if one was with the client in the community that the caseworkers should not be easily identified as a caseworker. The dress code recommendations were non logo T and pants or jeans. Management understood that our underserved populations often were exposed to lice, scabes, and bed bugs meaning we didn’t wear/take our work clothes home some days and being expected to carry spare dress clothes was not reasonable. Just some arguing points if needed.\nOne may also argue Maslows hierarchy of needs says your clients are aspiring to have health care, permanent shelter, consistent food, and reliable income. Aspiring to dress a certain way is several steps away from them and presuming how they will choose to dress is wrong.",
            "Polo shirts.  Your boss should have ordered polo shirts (golf shirts).  They would have fit the dress code nicely.  They're more expensive than a basic t-shirt, and if they violated dress code, then he would have been in even more watt hotter.",
            "\"We're meant to dress they way they should aspire to dress.\"\n\nWhat if you aspire to be Batman?",
            "Aw man, I was hoping you'd sew collars onto the T-shirts.",
            "Oh I thought you were going to turn up in a tux",
            "I hope there’s an update later on! :)",
            "Flares.",
            "Do they have different styles for men and women, but not say which one? Wear the opposite gender! (Something like you can wear pants or a skirt, but not specify which is for men and which is for women).",
            "Wow is your manager a pansy. \n\nCan't find a solution and keeps them specifically on his desk inhibiting him from a proper work flow? Not being able to stand up to his boss over something this mundain? 20 years in that deflating enviroment must be brutal.",
            "Get the hentai ahego shirt",
            "This is next-level MC.  Recruiting others for coordinated MC?!?   Next level.",
            "I was fully expecting all the male employees to show up in dresses. Pretty sure it would be illegal for them to assign gender specific dress codes.",
            "This just seems like an invitation to be creative. \nJohn Travolta’s Disco digs from Saturday Night Fever?\nA zoot suit?\nA monk’s habit?\nI’d really roll with it.",
            "I am so very much looking forward to the end of year update on this",
            "2 words: SHOULDER PADS. Wear em proud, even if your a dude",
            "> labeled with cards that went through a typewriter\n\n\"Welcome to the Dot Matrix.\"",
            "The idea of dressing clean and professionally.  Obvious. \n\nThe idea of dressing like a salesmen when you are supposed to be a helping hand. Silly.\n\nI used to work for a non profit. They did multiple things, one of the main ones was helping people navigate resources. Those workers work business casual-ish clothes....but that makes sense. They are there as an authority figure in whatever resource they help people with. \n\nMe on the other hand. I worked with families. Helping low income parents with young children in their homes once a week. I can't imagin I would have gotten anywhere with anyone if I had been dressed in \"professional\" clothing.",
            "Should've worn a dress",
            "I think you need to raid some used clothes stores and find some pimp suits.",
            "I was waiting for you to sew on a collar or something",
            "Only wear shirts like [this](https://m.romwe.com/us/Guys-Fire-Print-Button-Through-Shirt-p-628894-cat-858.html?url_from=usplasmshirt03200527456L_ssc&gclid=Cj0KCQjw8rT8BRCbARIsALWiOvQE-SddmiEctaysX430UwLVWNewqIO6hfM8gtV34Tkliz3DR6JrPZYaAmykEALw_wcB&ref=us&rep=dir&ret=mus).",
            "🤣🤣. When you said that you could hear him hitting the boxes I let out quite the snort! That’s hilarious!",
            "I work in a shelter too. You are 100% in the right. It’s important to develop trust with the people we serve and one way to do that can be by minimizing the imbalance of power by how we dress. We used to be business casual, jeans on Friday. Now it’s jeans any day.",
            ">We're meant to dress they way they should aspire to dress\n\nTelling them what they *should* aspire to seems extremely patronizing and tone deaf for a shelter. Well for anything, really.",
            "Stirrup pants. In yellow. With sparkly shoes.",
            "\"Know Your Audience\"\n\nIs the company's audience the folks they serve, or the yokels they try to impress for press and funding?",
            "Just remember.\n\nLeather chaps qualify as pants!!",
            "I worked at an insurance company with a dress code for men that said \"pants or slacks. Shirt, tie, jacket, or sweater.\" I took advantage of that oxford comma and wore the lightest weight \"tshirt\" type sweaters I could find. The dress code for women was right out of the 1940s. \n\nWe eventually voted a union in all those draconian rules were tossed out.",
            "Mary Barra recommends the most sensible dress code. I like that it is only two words: Dress appropriately.",
            "Have you gone full 70s yet? Bright colored bell bottoms and not at all matching bright colored button down. There are so many glorious color/print combinations to that.",
            "What an asinine way to run any organization. The embodiment of “rules are rules! *fingers in ears* la la la I can’t hear you”",
            "Have you tried surgical scrubs yet?",
            "How about polo-neck Ts? Does that fit into the rule variation. Short sleeve shirts can be comfortable as well and the line of buttons in hot weather adds ventilation. \n\nI wear company branded polo neck T-Shirts for work but move to light fabric short sleeve shirts in the summer. Aircon isn't really a thing in my working environment.",
            "I have seen collars sewn on t shirts with buttons showing thought it looked neat and it would be compliant. A Orville Redenbacher tie to finish the look.",
            "[removed]",
            "What beautiful and clever MC! I love it when rules come back to bite management in the ass!\n\nI work for a site called Not Always Right and our readers absolutely LOVE stories like this. Would you mind if we published your story on the site? Our readers would love this as much s the Reddit readers have! Let me know if that's okay?\n\nThanks again for the great story!",
            "https://www.carhartt.com/products/Long-Sleeve-Workwear-Henley-K128\nhttps://www.carhartt.com/products/Short-Sleeve-Workwear-Henley-K84\n\nWould those be compliant?\n\n\n\nI recommend using imgur.com to post your technically-compliant wardrobe as everyone asked.",
            "There are a lot of human beings who just don't understand the purpose of rules. Rules are meant to serve people and keep harmony and order, if they aren't doing that then they should be changed. \n\nThey are not to be dogmatically followed forever just because they were written down 30 or 200 or 2000 years ago.",
            "Hope you win 90 % of dress codes are just the fashion police and nobody needs them.",
            "[deleted]",
            "A place I used to work had weird outdated dress codes. One prohibited sandals of any kind and my friend/co-worker decreed that if she was prohibited from dress sandals in the summer in her hellishly hot part of the building that she would find the ugliest pair of shoes and stamp them into fresh dog's droppings every day for work. Nothing was further pressed on the matter and the ladies and some gents enjoyed cooler feet.",
            "That dress code would have been archaic 30 years ago, if memory serves.",
            "I don't know... Asking employees to wear jeans and a polo shirt doesn't sound as militant as everyone here is suggesting. It's not like they are requiring a suit and tie, or even business casual. And I doubt the supervisor can influence this policy and simply has to enforce it. Is this like punishing the poor girl at the grocery store who asks you to put on a mask? Petty employees are just as bad as petty management.",
            "I'm sorry but this all sounds kinda ridiculous. Some of this happening sure, but everything little part idk and tbh the dress code doesn't sound that bad. If you had a problem with it why didn't you work somewhere else instead of agreeing to work there when you knew the dress code was already in place?",
            "Bold little shit is my new life aspiration",
            "File under: Who gives a shit.\n\nGet a different job.",
            "I don’t really see how your dress code is that strict from your description. Pants and a polo/button up. Doesn’t sound that hard to me.",
            "We're gonna need an update after that meeting happens.",
            "I’d like to see an update to this to learn if the dress code got revoked.",
            "If you're involved in company meetings you can casually bring up that you've heard about 25 members of the staff resent your boss for the stupid dress code rules that are not productive and de-motivate you.",
            "Damn dude savage for just a pretty easy dress code",
            "So, I read this, and I hate everyone involved. Congrats for being a pain in the ass in pain in the ass land?",
            "Please update us in February, after the meeting!!",
            "I legit thought you were going to go full 1990 style. After all the dress code is from the 90s. But I do personally love the polo/golf shirts for my work because they are super comfortable and I have always felt constricted in a regular t-shirt collar. I have a fairly thick neck and the t-shirts are generally one-size fits ~~all~~ some.",
            "Why can't the manager just throw the shirts away?",
            "Jesus, this is infuriatingly petty all the way around.  Op is no better than the idiots he works w",
            "You sound like you live to be a pain in the ass. I doubt you have any real compassion for your clients. Like the character of Jimmy McNulty from “The Wire”, you just want to show everyone that you are the smartest person in the room."
        ]
    },
    {
        "post_id": "la691a",
        "author": "None",
        "title": "Force me to take 2 weeks of unpaid time off? Have fun running the place without me.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/la691a/force_me_to_take_2_weeks_of_unpaid_time_off_have/",
        "score": 15948,
        "num_comments": 381,
        "created_utc": 1612194734.0,
        "selftext": "I used to work at this one coffee shop, my first chain coffee shop after working only at local or family run ones. Simply put, it was hell. Owners would micromanage everything without knowing anything about how the business ran, never listened to their staff, and only cared about the money. Typical out of touch owners of a business.\n\nI was hired to replace a manager that had walked out of one of their locations, leaving it with only part time staff. I was told I was being hired on as the \"acting manager\" until they either hired someone else or they felt I would be a good fit for the position after my 6 month probation.\n\nI won't go into everything that went wrong because there's a lot but to summarize, it was literal hell. I was expected to cover all no shows (which had me working 90-100 hours a week), I wasn't allowed to fire anyone no matter how many things they did wrong (someone actually showed up to work drunk and I *still* wasn't allowed to fire them), and any changes I wanted to implement were shot down (like replacing old parts in the espresso machine, shortening our hours to save money on labor, bringing in items that customers would always ask for).\n\nI was stressed, over worked, and irritated as hell when the owner comes in to talk to me about sales for the store. We weren't making enough to warrant the hours I had scheduled and he wasn't going to pay me any more over time. I would only work the hours I'm scheduled and if someone no showed, I had to have someone else cover those shifts. I tried to explain to him that I only came in when no one else would cover, it just so happened that the people he allowed to continue to work here had terrible availability. Making the schedule was already hard enough, getting someone other than myself to come in on their day off was next to impossible. On top of all that, I had to learn the ropes myself. There was no one to train me so all the managerial knowledge, ordering, scheduling, I learned myself. No one other than me knew how to order coffee, had the numbers for the repair guys, anything other than making coffee and using the til, I was the only one that knew.\n\nHe wasn't hearing any of it.\n\n**Owner:** \"All I'm hearing is excuses. This is your store. If you can't handle running it. I'll start looking for someone who will.\"\n\n**Me:** \"Wasn't that the plan though? It's been 3 months since my probation period ended and you never gave me the manager position so I assumed you were looking for someone to take over.\"\n\n**Owner:** \"I think it's in your best interest to take some time off. Start thinking about your position here and whether you actually want to start moving up (I had mentioned in the interview I was looking forward to working my way up in the business).\"\n\n**Me:** \"I can't. There's no one to cover me.\"\n\n**Owner:** \"You're taking this time off.\"\n\n**Me:** \"Is this a paid break?\"\n\n**Owner:** \"No, consider this a time out for you to get yourself sorted. Take the two weeks to rest and we'll see what your position will be like when you get back.\"\n\n**Me:** \"Owner, I can't really afford to take that amount of time off. I can't even take 2 days without having to come in and cover.\"\n\n**Owner:** \"Don't worry about the business right now. It'll run without you.\"\n\nNow, to put into perspective, I was basically the manager at that point. I made the schedules, I did the orders, I knew the codes to the safe and the alarm. I wasn't allowed to hire someone to assist me and no one worked enough time to be able to cover even half my shifts. I knew this, the staff knew this, customers knew it.\n\nI made sure to block all work numbers and spent those 2 weeks looking for another job. I managed to find one after a few days that paid significantly more. I sent my resignation email to payroll and the owner (knowing he never checks it), deleted my account off the POS system (being a manager means I have access to it from home) and spent the rest of the leave catching up on well deserved sleep, having blocked all work numbers. I'm not getting paid so I'm not working.\n\nAccording to my coworkers, shit started going wrong the next day. One of the openers didn't show and the next staff member didn't have keys. Owner wasn't answering his phone so they left a message. Owner didn't show up until one of the regulars called asking if the place was closed down. He showed up 4 hours after they were supposed to open.\n\nOrders weren't done, inventory was missed, 4 no shows, you name it, it went wrong.\n\nOwner tried every way he could to get a hold of me, even using a customers phone to call me (too bad I didn't answer any calls that weren't in my contacts already).\n\nAfter 2 weeks, I turn my phone back on and get a call the same day from Owner. We agree to meet the next day.\n\n**Owner:** \"So, you've had some time to think.\"\n\n**Me:** \"I have. It's really given me perspective on my position here.\"\n\n**Owner:** \"We can start you back on your normal hours for now and we're looking for a manager to take on more of your responsibilities.\"\n\n**Me:** \"Oh, that's good. I'm actually quitting.\"\n\nHe was silent for a few minutes. I think he was waiting to tell him I was kidding. Sucks for you buddy, I'm serious.\n\n**Me:** \"I've already e-mailed payroll and removed my log in from the computer. Here are my keys. Good luck.\"\n\nAnd I left. Owner tried calling me a few times but stopped once I told him to check his e-mail.\n\nI was on okay terms with some of the staff that worked there and apparently majority of them had quit after I had left. Owner did find a replacement pretty quickly but without anyone to train them (owner didn't know anything about running the business), they were fucked from the get go and left pretty soon after they were hired.\n\nMy petty ass is always checking reviews from customers and employees and they have consistently sucked for the past year and seem to be on a downward trend over the past year.\n\n**TL;DR:** Owner forces me to take 2 weeks unpaid leave, place goes to shit and I take that time to find a better job, land said job, give my 2 weeks via email knowing he won't check it, and quit the second my vacation is over.\n\n**EDIT:** Holy shit thank you everyone for the awards! I finally got to premium! Now my avatar gets a sweater <3  \nThis particular job I had was soul crushing and I'm lucky to have a story like this to share with others that have gone through similar shit. If someone is dealing with an owner similar to this, I highly recommend brushing up on your knowledge of your local labor laws. There are sadly way too many owners that try to get away with shit like this.\n\nTo clarify a few things, I'm from Canada. Forcing me to take leave was not actually legal of him to do. I was tired and so worn down that I just didn't want to fight anymore. I took it as a gift of all the days off I missed from all the over time I worked and that was it.\n\nFor those wondering about whether or not I'm owed overtime, thankfully I'm not. Another manager task I had was organizing hours and submitting them to payroll. Owners didn't have control over that, the managers (along with me) were in charge of that. There was a rule in place where we had to get approval from the person who made the schedules for overtime and that was me. So I got paid my overtime. Thank fuck. Even if I did have some money owed, I personally just want to leave it be. It was hard enough getting my last paycheck from them, I didn't want to put any more energy into these guys than I had to.\n\nAgain, holy shit thank you all <3 I hope you are all doing alright with everything that's going on in the world right now and are TAKING NO SHIT LIKE THIS.",
        "permalink": "/r/MaliciousCompliance/comments/la691a/force_me_to_take_2_weeks_of_unpaid_time_off_have/",
        "comments": [
            "[deleted]",
            "I wish more people were taught not to put up with this abusive stuff. I’m glad you got a better job and ghosted them.",
            "My favorite kind of compliance! Why do owners think that because they “own” the business they are the gods of the business? You literally need the support of others to make your business run.",
            "Oh that’s brilliant not only doesn’t he listen, but he doesn’t know how to work in his own business. Shame you couldn’t get a photo of his face when you told him you were quitting.",
            "I cannot understand the concept of being an \"absentee\" owner. I mean I know those people exist. How *in any way* are they benefited by not knowing what's going on? Even micro-managing has to be better than cluelessness.\n\nAs I see it, if you're too indolent to actually keep tabs on a shop, sell it and invest in something you WILL want to look over.",
            ">Owner: \"No, consider this a time out for you to get yourself sorted. Take the two weeks to rest and we'll see what your position will be like when you get back.\"\n\n>Owner: \"Don't worry about the business right now. It'll run without you.\"\n\n\nLittle did he know - he didn't bother to sort himself out for those 2 weeks & after to genuinely realize his own position while not realizing the business did run without you, just not as well as when he was taking advantage of your goodwill & efforts. He and you reaped what was sowed - Him a fucked up business, you a better job anywhere but his business.",
            "There's a \"celestial currency\" located in my grocery store. The manager is 21 years old. She is very good at her job, but she hasn't had a day off in months because of crappy staff. Her boss (that has no idea what's going on and knows nothing about the business and is never there), says \"too bad. You gotta do what you gotta do. It's part of your job\". She also isn't allowed to fire anyone, and had to come in when someone calls off or doesn't show up. 5am, or 5pm. All the same. I'm not sure how she's made it these past 3 years. Good on you for finding something different and not putting up with the bullshit!",
            "What a nice man. /s \n\nWhen you didn’t see the writing on the wall, he gave you two weeks off without pay to figure it out. \n\nHe wasn’t smart enough to grant you the managers job. He could have had you work 90-100 hour weeks for 40 hours pay for weeks or maybe months longer.\n\nGlad there was a happy ending, and I hope you find an employer smart enough to have you run their business to both your advantage.",
            "On one hand, I'm pissed for you that you had to work so much for so long. On the other hand... that made the fallout even more dramatic. \n\nWell played, my friend.",
            "Congratulations on getting out and kudos for letting the boss twist in the wind after his very poor decisions.\n\nSo how much longer before this place implodes?",
            "ah, the old \"you have all the responsibility, but you have zero authority\" shtick.\ngotta ~~love~~ loathe it",
            "And the store is running? Or is it still closed from time to time? Did the owner have to step up and try doing your job?",
            "I kinda wish you’d demanded a raise first.  See if you could get him to match your new job.  Then tell him you quit.",
            "There are two types of business people.  Those who've been in the weeds who know how it works...and the bad owners whom you've seen on Bar Rescue who did not learn a damned thing.  The owner you dealt with, was the owner who did not learn a damned thing, and was used to having people kowtow to him.  I'm just glad you left before things got a lot worse.",
            ">bringing in items that customers would always ask for\n\nThis is the actual meaning behind \"The customer is always right\".... about what they want. They want to buy a thing. Provide it for them to buy. That's what they're right about.",
            "This sounds a lot like my job when I was the GM of a small hotel. \n\nThe owners actually knew what they were doing, but didn't pay me enough or let me hire an AGM so I was stuck working almost every shift. \n\nI quit the day after Christmas when my overnight shift employee called out Christmas day and the owners expected me to cover. Fuck that.",
            "Wow, so glad you escaped, and without survivor's guilt.",
            "Every time I read one of these I fucking thank my lucky stars that I live in a country with labour laws that would never allow my manager to force me to take 2 weeks of UNPAID LEAVE",
            "Good god, are you sure this wouldn't be a better fit for prorevenge? This shit is amazing!",
            "Basically how every grocery store operates. Higher ups don't know a fucking thing about how anything works.\n\nOne time I tried telling the one I work at that \"I need some fucking help because 1.5 people  ant do all of this ourselves\" so they forced me to take basically an entire month off for saying the F word.\n\nThey literally almost killed women running deli/bakery because I was the one that did most of the physical work for her\n\n6 months later and they FINALLY hired 3 more people after 2 person quit from stress and another one was gone for a month due to sickness, but the damage is already done lol. Now all anyone does is say \"we're too slow and not doing a good job\" but we don't have the time to properly train the new people because all they do is add more and more shit to the trash pile of work they have us do",
            "It makes you wonder what the real circumstances were behind the previous manager’s departure",
            "Owner thought he was going to teach you a lesson by treating you like a child and putting you on a time out.  He forgot that adults can find better things to do with their time, like finding a better job.",
            "For anyone that this happens to in the future, those forced 2 weeks unpaid can be seen as constructive dismissal and you would be eligible for unemployment benefits.",
            "Just curious: how can an employer force an employee to take unpaid time off? I’m a spoiled european, but I’ve never heard of such bs. They can force employees to take time off, but it’s always paid without exception because it’s not employee’s problem they’re not needed at work. Unpaid time off can be given only per employee’s request when they need holidays but have no paid holidays left.",
            "This sounds exactly like the coffee shop I worked at. Glad you are outta there now!",
            "What is it with these owners trying to micromanage everything?",
            "Talk about digging your own grave!",
            "I LOVE THIS. I want an update when this owner goes has to shut down his business and accept he is an incompetent failure ✨",
            "I temporarily took charge of my team this time last year, my immediate manager waa exactly like this owner. Expected the world, but gave peanuts in return.",
            "Sounds like you are due a lot of overtime. I would definitely look into that",
            "Oh you are my idol. I’m still riding the high from getting most of my coworkers to quit over the course of a month while our racist, sexist, creepy, rude, a-hole of a manager was on vacation. But this story - this is like pure uncut Colombian cocaine compared to what I did lol. Soooo satisfying.",
            "This is nice. I think I’ll save it and read it again.",
            "Hope you learned the most important lesson: if you are not an equity partner in a retail establishment and not paid for overtime, 40 hours is the boundary.",
            "Ohohoho man, now this is the feel good slap to the face I needed today. Well played, screw those guys.",
            "i get one or two days time out but two damn weeks! what the Hell did he think you were going to do? stay at home? in the end, you left that job perfectly.",
            "This has warmed the cockles of my heart",
            "Take two weeks off with no pay?  Ok.  Thank him for allowing you time off to get a better job.",
            "You gotta love owners and/or customers who always assume a job is so simple until a magical set of circumstances forces them to do do it.",
            "Out of touch owners ( or in ny case  management) not listening to seasoned staff really seems like the thing rn",
            "There’s just one fishy thing about this. How could you not afford time off after working multiple 90 hour weeks with 50 hours of overtime each week?",
            "I don't often read these but this one was *delicioussssss*",
            "Why wouldn't he hire you as the manager - I have seen this so much it really puzzles me, people are acting and doing an awesome job, staff are happy and the business/department is running well.\n\nThen they either hire someone else or leave the person acting for 12 months+ and wonder why the person then takes their experience and gets a job on more pay elsewhere.\n\nOwners like this deserve to go out of business.",
            "\\>  **Owner:** \"Don't worry about the business right now. It'll run without you.\" \n\nFamous last words.",
            "Good thing you got out of there.",
            "Congraulations on knowing your worth! Your hard work didn't progress you to a management position. You said enough and that's a powerful message and decision.",
            "This made me feel so irritated and then so relieved. Thank you for letting me live through you for a second. I’ve always wanted to do something like this.",
            "i was expecting the place to shut down. i’m surprised it didn’t",
            "This was amazing to read.",
            "Running a shop is no fucking joke man, I used to own one.\n\nNever again!",
            "I don't know how long ago this was, but an owner forcing his employee to take an unpaid leave is illegal I think",
            "I have literally dedicated large chunks of my professional career to teaching people how to be better leaders than this guy because I’ve had so much grief from this kind of boss/owner.",
            "In a successful business, with competent operators \"Take your two weeks, relax, the business will run without you\" is great. That's someone who wants their employees to do well, and cares about their mental health.\n\nIn this situation, however.. No.. No, the business will NOT run without me.. But ok",
            "Serves his stupid ass right.  Congrats on the new gig!",
            "You’d think after the last manager fucked off they’d make some attempt not to treat the replacement like absolute shit...",
            "This was great story. Thanks",
            "\"Consider this a time out?\" \n\nWtf?",
            "I think I was one of your regulars. Are you from BC?",
            "Good on you, fellow Canuck.",
            "This is somehow every coffee shop I worked at in Boston. Get an employee to do managerial work and call them manager but pay them hourly (can’t get tips as a manager/can’t get over time as manager). Use eager employees until they break. Repeat.",
            "This one sparks joy.",
            "People need to set boundaries. Yes even with employers. \n\n\"You're giving me a management position with a 6 month training/probation where I'll be manager after that time? Fantastic. Put it in writing.\" \n\nThe day after the 6 months probation contact them asking when you can expect the announcement that you're manager. If they say anything longer than 2 weeks you immediately look for a new job. Hand in your notice. \n\n&#x200B;\n\nAnd stop running yourself ragged for companies that don't give a shit about you.\n\nI worked my ass off and stressed about Walmart when I worked there. I said enough is enough and only worked my shifts and took my days off. Didn't accept calls I didn't know. But I still showed up on time every time and worked from start to finish. Everyone loved me. Managers knew I wouldn't take shit. But I also didn't start it either. Employees knew they could count on me to be there and actually bust ass working not fooling around. \n\nBut I wasn't about to give myself a heart attack for $9/hr.",
            "I wish I had been less than 30 years into my career when I realized that:\n\n1. Nobody pays you enough to make a shitty job worthwhile.\n2. Nobody pays you enough to yell at you.\n3. Sometimes it's better to quit and take your chances than to stay miserable. \n4. There's no such thing as \"job security\".\n5. Your employer doesn't care.",
            "Fucking Starbucks.",
            "Fucking loved this.",
            "Karma can be SO 👏🏼FUN 👏🏼",
            "You are my hero. Fuck yeah",
            "Why would you even want to own a cafe if you don’t want to be involved at all in running it",
            "Ahh coffee bar memories... I had a job so identical.  It was in a bookstore as well.  whole company shut down a year after they \"demoted\" staff.  There is a God! We had to  come up with the marketing ideas along with shelve books, beg for emails (or get written up), ring up books, on top of run the cafe.   That's how young and dumb I was.  But I got schooled in corporate management, I forward any advice to others today.  In the end, I did get a great staff together, no write ups, great attitudes and attendance.  I enjoyed everyone I hired and the cafe was always thought to be step child job but it became a lot of fun after all.  I think OP was extremely brilliant.",
            "Are...are you me?  Like a Canadian version of me from 3 years ago?  Cause this just gave me straight flash backs and I thought I was reading my life LOL Good on you for making it out!",
            "Tbh, you should have left that job way before. \n\nI get how easy it is to invest so much of yourself into a job, especially when you know it’ll fall apart without you. Even so, one of the most important lessons to learn is that you need to take care of yourself first. If a job isn’t worth it, there’s no shame in quitting.",
            "If this ain’t a 60k+ job I wouldn’t even be stressing that seems like waaaaay to much work to be getting paid anything less",
            "Is this a costa? It sounds like a costa, I work at a costa and it sounds like this",
            "Remember business owners, *YOU* don’t make your money, your *EMPLOYEES* make your money. Never was this proven kore true than during this pandemic, all those billionaires *begging* for people to go back to work.",
            "I will never understand people who buy a business and then are surprised when it fails if they don't actively manage it or hire someone who can manage it properly for them.\n\nWhat I don't understand though.....this is a franchise operation, right?  Doesn\"t corporate headquarters check in on the stores and see how they're performing?  If the franchise owner isn't running it properly, they usually don't let him/her keep the store because they want to protect their brand.......\n\nOP - could you have contacted headquarters and let them know?  Did you have a corporate number to call and report issues?  Could customers have called and reported the issues?",
            "This is literal justice porn. Loved reading this story, and I'm happy Owner got what was coming to him. I hope all is well with you now OP!",
            "“When things go wrong, it’s your store. When things go right, it’s my store.”",
            ">I was expected to cover all no shows (which had me working 90-100 hours a week), I wasn't allowed to fire anyone no matter how many things they did wrong (someone actually showed up to work drunk and I still wasn't allowed to fire them), and any changes I wanted to implement were shot down (like replacing old parts in the espresso machine, shortening our hours to save money on labor, bringing in items that customers would always ask for).\n\nTranslation:  You're just a regular employee with an \"acting manager\" title who is in charge of scheduling but not much else.\n\nIt's amazing how there are people in the world who will hire others to do certain jobs for them, not give them any authority to do those jobs properly, but then blame that person for lacking in desired results.",
            "I had a similar situation though I was just a regular employee, and when I quit - they said they thought I was family. \n\nAnd I got a call a few weeks later asking if I had complained to the labor board. Was not me but not surprised someone did!",
            "shortening our hours means having the business closed sooner or opening later?",
            "Fuckin' A!!!!!!",
            "In the long run good on him to give you the space to see how terrible it was there",
            "*Sips latte. DELICIOUS.",
            "\"Owner: \"So, you've had some time to think.\"\"\n\nOh! This is frikking RICH!!! \n\nThat idiot SOB FIRED you basically for mandating you take unpaid leave for two weeks(!) for nothing you did!  Idiot.  Only way I would have showed up was to tell them to sod off and see their face.  Some people are like that and I do not know how they stay in business.",
            "So so similar to an experience I had that left me disabled. Stress and overwork, doing two-three peoples jobs whilst both my managers frolicked at a food festival while I suffered for peanuts. Not worth it and left with a chronic pain/fatigue condition. Sadly I just missed out on a potential ‘malicious compliance’ so I’m glad you got yours :)",
            "Fuck yeah! You go girl/guy! I'm glad you found a better job and hopefully they respect you there.",
            "Sounds like Coffee culture",
            "Al ready at the third paragraph it became clear to me the entire game was rigged and it had more red flags than a Chinese military march. When you got all of the responsibility and none of the authority you are the fallguy. \n\nYou still managed to get a nice story out of it. So kudos.",
            "Wow. This sounds eerily similar to my story. Glad you're out of there!",
            "This was *extremely* satisfying to read.  Many thanks!!",
            "I did wonder at your use of \"sweater\", followed by spelling of \"labour\", where you were OP!",
            "Sounds like a Bim Cortons kind of place...",
            "I will bet this is Tim Hortons.",
            "Wtf was this owner expecting?",
            "OP this really reminded me of my cafe job that I had quit literally a week before the pandemic started hitting NY and man do I not miss working full time there anymore. Just thinking about how my boss acted like a child through text just makes me mad thinking about it again. I’m glad you got another job so fast and honestly, fuck cafe owners, a lot of them scrape as much as they can to save themselves money and get confused when they overwork/underpay their employees and customers start bitching about service quality going down is when they finally blindly see the issues their store is having and yet don’t do anything about it.",
            "How awful. So bad you don't even know how your stores are run.",
            "Sucks for them",
            "I know we're supposed to hope the owner gets that GSW to the foot checked out and fixed... but I'm not gonna hold my breath. Glad you survived, OP. It looked like he was banking on you living paycheck to paycheck. What utter scum, and he thought he broke you.",
            "Good for you. I don't understand how an employer would think you *wouldn't* spend two weeks of forced unpaid leave hunting for a better job?",
            "What a condescending jerk. You managed it well and I love your story! Well done you!",
            "Awesome job! Glad you found another job and hope they are treating you well",
            "Great story! Bad situation but awesome result!",
            "\"It'll run without you.\"  Bwahaha!",
            "I hope you can end up buying the place from him on the cheap. He deserves to lose his business!",
            "Good story! It went well with my morning coffee. I’m actually letting the coffee roasting machine warm up before I roast 440 kg of dark roast for a bunch of coffee shops :-)",
            "Are you sure this wasn’t at a particularly popular smoothie shop chain? I mean holy wow this is too much like my former job.",
            "People typically don't quit their jobs, they quit their bosses.",
            "Jesus some people. Well done!",
            "Sounds like working for costa",
            "You seem way too concerned about things that weren’t your problem.\n\nPretty interesting that your boss tried to play it cool and get you back to work at your regular pay after all that. If I were him I would absolutely be offering the management position.",
            "One way to look at its is you could use those skills to start your own buisness",
            "Also from Canada, had this exact same situation play out and if you had mentioned \"bar\" instead of coffee shop, i would have looked harder to see if we had worked for the same place\n\nAll three private bars i worked at were like this actually, owners in Canada need an adjustment for real",
            "Fellow Canadian and almost every single fast food place I've heard of runs on the same principle.  Dunno wtf is goin on up here but maybe us Canadians should just learn to cook.  Trust me, as someone who's worked in a kitchen, I truly only trust what comes out of my own at this point.  A lotta smelling stuff past the date and scraping/cutting off the 'bad parts' still goin on.  And that's not mentioning the straight up bad stuff that gets used anyways cuz the manager doesn't want to waste food.  Trust me, just learn to cook for yourself.  It's not that hard.",
            "Aaah, franchises. Where folks think that money equates to good business skills.",
            "Ugh. Take my upvote :)\n\nSounds like you’re ready to run your *own* coffee shop OP. Thanks for the satisfying read.",
            "Is this Biggby??",
            "This sounds like a summer job I had being a manager at a theme park! I was not actually allowed to manage despite the title, constantly ignored, lack of training, too much responsibility, too many working hours. I should have separated myself from the company like you did. That part actually cracked me up and made me wish I went out like that. \nGood that you got out of there, absolutely nobody needs that crap even if it’s a salaried job.",
            "My boss once forced me to take my extra hours as holiday instead of paying them out, because he didn't want to deal with the paperwork. I explained to him that this was bad for everyone - I needed the money and we were understaffed as is. I had enough overtime to literally just not come to work for a month.\n\nHe still had me message the shift manager and tell her I was gone for a month. He changed his mind when she called him and showed him the plan, she couldn't find anyone to cover any of my shifts. Place would have been fucked.",
            "This story is better than sex.",
            "Capitalism mostly/kinda works when there are other forces balancing it- regulation, taxes, unions, etc. But many of these have been subverted or defeated by the more aggressive forms of capitalism.\n\nMost human systems seem to work best when there is a dynamic tension keeping things in balance. \n\nWhenever one part of the system gets too powerful, it messes everything up. It doesn't matter if it is religion, government, or whatever throwing it out of whack l",
            "How can you afford not answering numbers you don't know when you are looking for a job?",
            "It boggles my mind that an employer can force you to take unpaid leave.",
            "I just don’t get- if you were working 90-100 hour weeks with overtime why the enforced 2 week break was met with “I can’t afford to take the time off”.. but anyway- awesome to block them. Then you can’t even feel bad because you don’t even know if they are trying to reach you.",
            "That sounds like one of my ex colleague. He was recruited as a manager but rather than sending him to a more peaceful outlet so he have a rough idea , boss decide to just let him be live and learn on the fly with us.\n\nBoss has over 6 outlet and we are consistently the most busy outlet of them all, so none of us could really reach new guy ($NG) on how to do things and he could only eyeball. It doesn't help that boss doesn't care about that and wants him to run a shift on his own..\n\nI might have been a senior staff but there are still stuff that I do not know nor should I know so I wasn't able to help him too much.",
            "Who takes on manager role without manage pay?   That is disgusting. \n\n> managed to find one after a few days that paid significantly more.\n\nIt’s funny how that ALWAYS happens. So you were working if this shitty job for ages, and could have been getting a lot more most of that time. \n\nSeems you lost out.",
            "In",
            "This is my todays wokplace that im leaving this week, also, 5 people asked to quit, everyone is just pissed off."
        ]
    },
    {
        "post_id": "1345dsj",
        "author": "Terrible-Fix-9798",
        "title": "Only A Man Will Do",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1345dsj/only_a_man_will_do/",
        "score": 15948,
        "num_comments": 399,
        "created_utc": 1682894810.0,
        "selftext": "Maybe 10 years ago, I worked in tech support for a large cell phone company. Depending on the shift, we had vastly different ratios of male vs female employees. Anyhow, there was one shift where most of the floor managers, as well as the shift manager for the entire office, were women. I had only been working that shift a couple weeks, but knew we weren't supposed to escalate (transfer to a manager) unless it was really unavoidable. I get this caller who will not let me finish sentences, keeps interrupting me. Eventually he demands a manager. I reluctantly transfer him and go on with my shift. Next day, Linda, the supervisor who took that call, comes to my desk and says \"I need to talk about that escalation last night\". I'm thinking I'm in trouble. \n\nTurns out, dude kept asking for higher supervisors and getting transferred all over the office, always to women. Finally, he loses it and goes \"don't any MEN work there?!\"\n\nCue Paul. Paul was a wonderful, gentle guy who was also very gay. He takes over the call, and in the most effeminate way possible says \"Hi sweetie this is Pauuuul, can I help?\" Dude immediately hung up.",
        "permalink": "/r/MaliciousCompliance/comments/1345dsj/only_a_man_will_do/",
        "comments": [
            "Imagine wanting to talk to a man so badly that you forego actually trying to fix the problem that made you call in the first place.",
            "As someone in the cell phone industry now, this is still very much a thing. I work at a small mom & pop repair shop and we always shut that shit down hard lol",
            "I bet he  will Ru the day he asked for Paul.",
            "This remind me of a story from my mom but inverted. \n\nMy mom was a service writer in a car dealership for years back in the 70s-80s. Car dealerships are well  known for being really sexist and macho (especially back then) and for most of her career she was the only female in the service department.  \n\nOne day she places a call into a doctor’s office to let the doctor know she had an update on their car.  A woman answered and my mom politely asked to speak to Dr. Such and Such.\n\nThis woman goes OFF and rips my mom a new one. Asking doesn’t she know that women can be doctors too and how it is blatantly sexist to think she wasn’t doctor, haven’t you heard of feminism…..completely ignoring the fact that most doctors have a reception desk.  \n\nAnyways after ranting for a few minutes the doctor calms down enough for my mom to explain she was calling about her car getting service. \n\nThe doctor then replies “Great, let me speak to my service writer.”\n\nMy mom very sweetly replied “I am your service writer!”",
            "This isn't the same scale,  but when u weekend for Gamestop, I had a manager who is a woman and one day a customer walked right past her and straight to me, even ignoring her greeting. He asked a question about fighting games and I laughed,  looked at her and said she's the he'd want to talk to since she's the fighting game fan. \n\nHe looked a bit annoyed, but I'm sure he got over it.",
            "I worked in customer service for satellite TV. I did tier 1 troubleshooting and  had no control over who answered the  tech line if I couldn't resolve the issue. \n\nWhenever a male client asked to speak with a male tech, karma always put a female tech on the line. I would tell the tech that the client asked for a male, and there was always cackling, before the transfer.",
            "That's good, but even better would have been if Paul strung him out only to say \"Oh I'm sorry, only Lisa, Beth, and Mary know how to fix that? What should we do?\"",
            "Lulz.\n\nI used to work for an ISP. Some guy kept emailing asking the same question. He got a couple of different women who responded with the exact same (correct) answer. He writes back with “YOU WOMEN DON’T KNOW WHAT YOU’RE TALKING ABOUT. FIND A MAN TO ANSWER ME.”\n\nWe had a lovely gentleman in our department who was not amused. He says “I’ve got this.”\n\nResponds with:\n\nDear (customer name),\n\nMy colleagues have both provided you with the same, correct information that I will give you. \n\n*quotes the same answer*\n\nI’d you find this difficult to understand, perhaps you should find a woman to explain it to you.\n\nHave a nice day.",
            "That's hilarious!! As a woman who has to deal with a lot of men (commercial fishermen) I'm always amazed I haven't had stuff like this happen to me. I've dealt with a few misogynists but noone demanding a man. Which would be hilarious, be my boss, her boss, and HER boss are all women. And even that high up they'd send them back to me because I know more about my job than they do.",
            "Yeah Paul. Get it Bitch!!!!!\nI'm gay and worked in many call centers. I hate when you'd spend 30mins telling a customer no, and 2mins on the line with a supervisor and they give the customer everything they want.",
            ">\"Hi sweetie this is Pauuuul, can I help?\" Dude immediately hung up.\n\nThis is f-ing hilarious.  Likely gave the guy a coronary.",
            "I used to work in a automotive body repair shop. Sometimes when I answered the phone, the man on the other end would say \"can I talk to one of the men?\" I would hold the phone away from me and say loudly \"is there anyone with a penis who can take this call?\" After a short pause, \"I'm sorry sir, no one else is available right now, how can I help you?\" They usually wanted an appointment, which was my responsibility and they would have just been transferred back to me anyway.",
            "Customer worried he was gonna get girl germs down the phone line? Or worse!! Gayman cooties!! What a tosser. Who gives two shits about who fixes the problem, so long as the problem is fixed.",
            "Something similar used to happen in the Gamestop I worked in because half the employees were female and all the managers were. Luckily, the male employees were hilarious about it; whenever they were asked to help because \"customer wants a male employee\" they'd say \"Oh she's actually way better and knows more about that, you'll have to ask her.\"\n\nI loved that team so much.",
            "Paul is the MVP.",
            "*\"Testicles to pick up line four please.\"*\n\nProbably next time lol",
            "OMG!  Misogynistic homophobe gets the whole meal deal and goes away hangrey!  LOL",
            "Well played!",
            "I work in tech support and there are still some men that can't wrap their minds around women actually knowing more than them. We even had a business partner tell my manager that he prefers to talk to men.",
            "Omg sooo funny!!!",
            "That was a truly great ending. Paul sounds awesome.",
            "I had this weird one a few years back that needed help with her computer. I don't even remember what the issue was but she demanded to speak with a woman.\nI explained that we're a very small company with 2 guys and we do not have any female employees but she wasn't having that. She must speak with a female about her computer.\n\nI went back and forth with her 3 or 4 times and finally started screening her calls. My boss heard the entire thing and had no problem with what I was doing.\n\nI still don't understand why she didn't want my help and I'm pretty sure it was a 5 minute fix but I guess people will be people.",
            "When I worked in a call center, customer called in and requested to speak to a man because he was “uncomfortable speaking to a woman about money.” Transferred to a male supervisor who informed customer we would be blocking his number and restricting to chat/email service. It’s not just discriminatory, it’s a pain in the ass to clog up the calls waiting to accommodate that kind of request. Good managers shut that shit down for the sake of their employees and for the sake of their operations.",
            "A dude so emasculated he can't even get help from a woman over the phone because it bruises his ego...love it lol. Also good on Paul haha.",
            "I was able to figure out when a caller was calling back only because they had spoken to a woman tech.\n\n&#x200B;\n\nI started reviewing their call records \"Anything unclear about that?  ...   No?   ... So what's the issue, something new crop up?  ...  Or because you spoke to M, our best tech?   {click}\"",
            "Hi sweetie, this is Pauuul.  I hear you were asking for me.",
            "We had a girl on the helpdesk.  Every time the reception desk (both female) would call in and get her they'd hang up for some reason then call back to get one of the guys.  We'd make a point to transfer the call back to the female tech because she was part of the team and we wanted to make a point that she was just as good at fixing issues as the rest of us.",
            "i work in a lab and have to deal with \"customers\" regularly. one colleague, she changed employer now, has a phd but sometimes people wanted to talk to a superior because she was a woman, she sent them to me, we had the same position and i do NOT have a phd but i'm a guy.\n\ni just told them exactly what she told them.\n\npeople are so dumb.",
            "> Cue Paul. Paul was a wonderful, gentle guy who was also very gay. He takes over the call, and in the most effeminate way possible says \"Hi sweetie this is Pauuuul, can I help?\" Dude immediately hung up.\n\nAH-HAHAHAHahahahahahahahahaaaaaaaah.\n\nPaul deserves to be an absolute *LEGEND* for that.",
            "It's fascinating how some people can't handle interacting with anyone who doesn't fit their narrow view of the world. I'm sure it must have been such a shock for that caller to be transferred to a woman in a position of authority. But don't worry, not everyone is as limited in their thinking as he is. Maybe one day he'll learn to appreciate people based on their skills and knowledge rather than their gender. Or not, who knows? Either way, good job Paul for handling the situation with grace and flair. It's always fun to see someone's prejudices get dismantled in real-time.",
            "OMG yes!!! I too am a phone monkey (call center) employee and have run into this exactly. I used to work a shift that was fri sat sun 7am to 7pm. There was only around 10 people that worked that shift. Had a man refuse to speak with me cuz I have lady bits and asked for my manager. Who was also a woman. Asked for her manager who,yep, is also female.  Not sure what he was expecting, the CEO doesn't usually take calls, esp at 8 am on a Sunday. And yes, people ask that too",
            "You made me spit some of my fine red wine out. And I love Paul.",
            "Great story, OP. Thanks for the chuckle.",
            "I heard that in the voice of Mr Humphries…",
            "I LOL",
            "Customers like that would probably make me laugh. I think it's the equivalent of the trash taking itself out lol.",
            "Haha this is freaking gold.",
            "This story is priceless!",
            "I figure that the average female working in a male-dominated industry will be more talented and/or dedicated than the average male. A woman has to fight against social pressures to get in, while less motivated men can just fall into a position. The most skilled of men and women will probably be similar.",
            "Ah yes, things like this is exactly why living in a cave for 500 days alone sounds appealing.",
            "Paul is fabulous!",
            "That’s fuckin perfect",
            "More lay on the impression that I was gay, but according to a couple of gay mates I do a very good impersonation.",
            "That's what they said.",
            "Aww… I thought it was going to escalate to some ridiculously high manager who was going to end serving that customer for good.",
            "Perhaps that should teach that douce bag of a caller a lesson for looking down on women like that.",
            "This is a great story! Thanks for sharing 🤣👍🏼",
            "This gave me such a laugh today thank you",
            "I worked at a call center for about 2 months and when people asked for a supervisor, we transferred them to another unit. They were just more experienced customer service reps.\n\nOne day, a guy calls me up, screaming because his wife had gotten a credit card and spent too much money and we needed to stop sending her offers.\n\nI tried to explain that I was only customer service for existing customers, and at the time, he had to write to our Corporate office in Delaware, incidentally because Delaware had lax laws about high interest rates, which is why many credit card companies are incorporated there, but he wouldn't listen.\n\nI handed the call off to our Supervisor unit, and he said, I got it, you go outside and have a cigarette break. Bless that fellow, wherever he is now. \n\nI quit that job shortly thereafter, because I got a gig programming a point of sale system for my wicked cool Rush fan buddy 🥰",
            "hahahahahahahahahaha",
            "LMAO this was a great read and laugh!",
            "Sometimes you get what you ask for instead of what you need.   :-)",
            "I love this so much",
            "HA!!! Serves him right! Good job, Paul!",
            "Used to work in the faults department for a telco here in Oz. Our system recorded everything and stores it, unless the caller specifically advises they don’t want the call recorded.\n\nOne arvo, calls drops in, before I can get my welcome/how can I help spiel rolling, he says I have to (direct quote) “Fix my fucken phone you pack of f@&$?!s!”\n\nNow my boss was also doing QAQC on my calls that day and was right next to me and heard the whole thing, she tips the winks and mouths “Have at it”\n\nI went to town, gave that bloke the full evil gene and laid it on thick and fast, she’s trying not to laugh, I’m focusing on my screens so I don’t lose it if I look at her.\n\nThe caller is flabbergasted, poor bastard didn’t know what to do. You bet I dragged that call out as long as possible!",
            "This is the way.",
            "Hahaha love this, thank you for this story 😂",
            "i once answered phones for a large american cellphone company.  one of the worst jobs i've ever had.  this story brings me back, cheers!",
            "A caller asked me if I was Black (presumably because I have an ethnic sounding name). I confirmed that I am. She said she needed to speak to a White male. None of them would talk her, so she settled for a gay White woman.",
            "Shut up and take my upvote. ;)",
            "Customers in a hardware store, girls would come to me from decor saying they wouldn't listen, I (guy from flooring) look at the product, yup it's 68 wide and they go, oh, ok.",
            "Some of the best customer service experiences I've had have been with an obviously gay male CSA. \n\nThat dude missed out on getting his problem fixed, and having a fun convo!",
            "Where do you work that this would be considered unsafe to read?",
            "\"Don't any MEN work there?!\"\n\n\"No, and aren't there any MEN on YOUR line that we can talk to, hon?\"\n\nSexist I know, but I think it could be excused if it's being used by a woman against a mysoginistic man.",
            "Man all these answers…can’t believe it’s still happening in 2023. We’ve still got a long way to go",
            "Wasn't this posted last month or so? It's almost verbatim.",
            "Just got done fixing my internet and had to call tech support. First two guys didn't help and the second even left me on hold for over 15 minutes after saying 3-5 minutes. I call back and got a woman and she fixed me up in short order.",
            "Way. To. Go. Great story - thanks!",
            "Where's the malicious compliance?",
            "It was funnier when almost the same story was posted years ago but it was doctors/nurses",
            "Love it!",
            "Where's the bloke, love?\n\nhttps://www.youtube.com/watch?v=Tv0ueEI4OBQ",
            "P",
            "As if this is real. \nStory has gone around so many times",
            "And the whole office clapped"
        ]
    },
    {
        "post_id": "ud7f91",
        "author": "sberto",
        "title": "Call you every time I send you a fax? Will do!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ud7f91/call_you_every_time_i_send_you_a_fax_will_do/",
        "score": 15930,
        "num_comments": 253,
        "created_utc": 1651076445.0,
        "selftext": "Many years ago, before email took over the corporate environment, I worked at a large law firm and sent and received faxes for 8 hours a day.  I had five fax machines and two coworkers.  We logged every fax.  There was an incoming log and an outgoing log.  And there was the ever important confirmation sheet. \n\nOpposing counsel was the kind of lawyer that gives lawyers a bad name.  Stereotypical jackass who played stupid lawyer games.  Dropping documents at 5pm on the Friday before a three day weekend.  That kind of petty shit that adds unnecessary misery to the profession.\n\nMy guy comes to the mailroom and says opposing counsel claims he didn’t receive a fax we said we sent.  I call bullshit.  I sent it myself.  The confirmation sheet exists. Opposing counsel probably lost it.  Or his secretary didn’t give it to him.  Whatever.  My guy knows I sent the fax.  Opposing counsel wants to be called every time we send him a fax.  He’s accused me of not doing my job and lying and now he’s creating extra work for me.  Ok, let’s play.\n\nWhat he wanted and expected was for me to call his secretary and let her know a fax was on the way.  Nope.  Fuck that.  I called his secretary and told her I was calling for my guy.  She assumed he needed to talk to her boss so she connected me.  Opposing counsel answers expecting some kind of substantive discussion.  Instead he gets the mailroom guy.  I said “I’ve been told to let you know every time I send you a fax.  I’m sending you a fax.”  We hang up.\n\nAn hour later I call him again.  New fax.\n\nHalf an hour after that I call again.  New fax.\n\nAnother hour another call another another fax.\n\nMy guy comes to the mailroom with a big smile on his face.  He’s giddy, almost giggling.  He says opposing counsel asked that the calls stop.  He no longer needs to know when faxes are coming.  He’s tired of being interrupted.  Sometimes you get exactly what you ask for.",
        "permalink": "/r/MaliciousCompliance/comments/ud7f91/call_you_every_time_i_send_you_a_fax_will_do/",
        "comments": [
            "And for their billing system they have to log each call they take to bill their clients. Thereby racking up the charges to the client who will not be happy to pay for tons of calls about receiving a fax.  Perfect!",
            "The only better malicious compliance for faxing is \"Keep faxing until we've confirmed with you we've received it.\"\n\nhttps://www.reddit.com/r/MaliciousCompliance/comments/8vfesu/but_you_said_i_could/",
            "This is so beautiful. God bless you lol",
            "\"Opposing counsel asked that the calls stop. He no longer needs to know when faxes are coming. He’s tired of being interrupted.\"\n\n\"Can we get that in writing? Have him fax it over. We'll call him when we get it\"",
            "I was hoping you were calling every time you sent a fax… to anyone.\n\n“Hey, just letting you know I’m sending a fax to xyz.”\n“I’m sending a fax to abc now!”",
            "A couple years ago my dads new Dr office wanted his other doctors office to fax all of his medical records. He asked are you sure? And they said they needed everything. We had just moved after he beat cancer the 4th time. So there was tons. But they said all. Few hours later the secretary calls and we are in the car and could hear her screaming at him for clogging up the lines for hours and causing a mess of things. He simply replied that earlier when asked you said all you should’ve been more specific. She hung up on him. He found a new dr office.",
            "Fax me no questions and I'll telex you no lies",
            "Are those calls billable hours? \n\nI know copying is considered clerical work, so I assume faxing is too, but direct oral communication with opposing counsel? \n\nNot for this situation, but if a nitpicky, micromanaging client did this, I would itemize everything. 3 minutes 56 seconds called re fax. 1 minute 23 seconds called re fax, aaaand repeat.",
            "We used to get multi-page faxes from some sketchy travel agent 3 or 4 times a week.  When I called and explained that we were a machine shop and asked them to stop, they got really pissy.  We started getting them every day some times more than once.  It was back in the day of thermal paper on a roll.  I taped togeather 10 pages end to end then wrote a message explaining my displeasure in language that I was sure they would understand. I inserted the paper into the machine and taped the ends togeather.  I dialed their number, watched it cycle through the machine twice, and went home for the weekend.  We never received another fax from them again but just incase we turned the machine off at night and weeekends for a few weeks.",
            "The fax, the whole fax and nuthin butt the fax!",
            "I would've continued to call and claim you never got the message, just like he didn't get that fax.",
            "As a long time paralegal i can only admire you. Well Done!!",
            "*sends another fax*\n*calls*\n\"This call is to inform you that I have sent a fax confirming that the calls will stop. I shall now send you a fax informing you of any incoming faxes from now on. Therefore I will also send you a fax notifying you of the fax informing you of the incoming fax, as well as a fax notifying you of an incoming fax notifying you of an incoming fax notifying you of an incoming fax notifying you of an incoming fax notifying you of an incoming fax notifying you of an incoming fax notifying you of an incoming fax notifying you of a---\"\n\n\"STOOOP IIITTTTT!!!\"\n*slams phone back on hook*",
            "This post is PERFECT malicious compliance, and exactly why I subscribe to this thread.",
            "\"I'm calling to tell you, I'm sending a fax. What's that? You requested I stop calling? Well... I never received *that* fax.\" \\**click**",
            "The only thing better than malicious compliance is malicious compliance against a lawyer.",
            "If the lawyer wants to play lawyer games and says \"call me when you send a fax\", then you can him. Not his assistant, legal aide, office manager. Him. Because he said \"call me\". You'd think a layer would know to use better language in his instructions if he meant \"not me\". Good for you!",
            "My brother had a guy who would schedule everything from 5 pm on Fridays before holidays. He’d ask for a change and they’d always be denied. I told him to start scheduling everything for 8 am on Mondays. Took the other lawyer one case to catch on and stop.",
            "There is no profession on earth that can paper-fuck like attorneys. It's a beautiful thing to see.",
            "I was kinda hoping you'd sent faxes one page at a time, to get confirmation sheets on each page. This was more fun...but wouldn't it have been fun if you'd called for each page? Especially on weekends?\n\n\"I just sent page 15\"\n\n\"I just got the confirmation page that page 22 went through, so I faxed page 23.\"\n\n\"Yes, I know it's Friday night at 12:30 and you said you had a date with your mistress, but I just re-faxed page 295 for the 127th time. Our machine says yours is off. No, I haven't received that message from my boss. He needs it in writing. With your  original signature. Notarized. Per the  procedure you yourself demanded in dealing with our office.\"",
            "Following the lawyer's words to the letter is really delicious here",
            "There are no better recipients for malicious compliance than attorneys.  Great job, OP!",
            "This is so delicious I want to sprinkle it in my hot chocolate.",
            "I didn’t see a written confirmation of the “stop calling me “order. Keep sending them until he sends you a fax calls you to tell you that he sent you a fax to stop calling him about faxing him.",
            "Dude don’t fuck with the secretaries and paralegals. Lawyers know. We had a guy in my town who managed to get on the shit list of the judges assistant, who is the kindest woman ever. My man had a rough 4 years before she retired.",
            "Once upon a long time ago, my parents had a fax machine so my dad could send faxes from overseas to my mom (work let him send faxes, but not telephone calls). This was back in the olden days when only university people had [BITNET](https://en.wikipedia.org/wiki/BITNET) email addresses. \n\nSome lawyers' office kept sending them faxes. I guess that they transposed some digits in the phone number. They would not fix their problem even when I called them. Since I was a computer programmer, all computer & electronic problems [like reloading fax paper] were my responsibility. \n\nMany of the faxes were to some private investigator company  saying things like \"please check out this person who lives at that address\". I started mailing those to the people being investigated. That lit some nasty fire under that lawyers' office. When they finally got a hold of me and threatened to sue, I just shouted \"[FAILURE TO STATE A CLAIM](https://www.law.cornell.edu/wex/failure_to_state_a_claim#:~:text=A%20defense%20asserting%20that%20even,establish%20a%20cause%20of%20action.)\" and hung up. \n\nhttps://legal.thomsonreuters.com/blog/12b6-failure-to-state-a-claim/  \n\nThe fax machine never ran out of paper again.",
            "lol that guy was stupid",
            "Now that is some sweet malicious compliance.",
            "Well, well, the consequences of one's actions.",
            "Keep calling him until he sends you a fax asking you to stop calling. And then make a final call to acknowledge the receipt of the request to stop!",
            "This made me giggle to picture ty",
            "Oooh. Time is money, and you robbed this idiot!",
            "I love this.  You did precisely as he asked, no more, no less.  And taught him his lesson.",
            "I love this, but I was so hoping you somehow had his home phone and decided to pull OT on the weekend just to fax him at 3AM on a Sunday morning.",
            "The secretary put you through to him every single time? Or was he unhappy that you were typing up his secretary for every fax? I would expect him to just tell the secretary to not put OP through and let her suffer.",
            "I bet your old boss still talks about that story to this day.",
            "Malicious compliance against a smarmy lawyer is a particular kind of schadenfreude.",
            "Brilliantly played.  Of course, being the vindictive SOB I can be at times, I'd have kept doing it for a few more days, absolutely just for spite.",
            "like that old saying. be careful what you ask for, you just might get it, but not in the way you might expect it.",
            "Get what you ask for and then cry about it? Some people would complain if you hung them with a new rope.",
            "As a lawyer I can state that you are exactly the kind of person I wanted working in my mailroom.  Nicely done.",
            "Bit of trivia, that was the standards business manner in Japan to call to let the other party know you sent a fax... And this habit has moved to emails ... So oftentimes you get a call to let you know you have an email waiting for you..",
            "Hehehe! I like it!",
            "You kept calling him, right? I mean, you wouldn't any more \"lost\" faxes now would you? That would have made your boss look like a buffoon in court.",
            "I applaud you 👏🏽",
            "Poetic justice",
            "Should have sent each page separately.",
            "WTF? you can easily get the phone records to prove you sent the fax",
            "Tell me you didn't stop.",
            "I hope you still call him sometimes to this day lmao",
            "And that my friends is a wonderful example of malicious compliance!",
            "After I had a landline for about a dozen years, I got a detailed filled fax from a doctors office cause my computer was still connected to the landline and it picked it up. \nI called them and I think it got corrected. I also received several emails regarding the medical records of somebody having mental problems but had managed to enter my email address as his own. It was much more difficult to reach somebody in the right department to correct all of that, and then he did it all over again. It seems to me that a competent company sending sensitive medical records via email ought to at least have an “opt in” or other confirming email from the receiving party before blasting out records blindly on the assumption that they have the correct email address. I am guessing that it’s probably a major HIPAA violation.",
            "You should have sent him a fax asking for confirmation.... then called and told him the fax was inbound and to call you when the signed response was coming.",
            "I taped a half dozen copies of large font \"knock it off, you have the wrong number\" into a loop and let 'er rip all night long.   The faxes to my phone number finally stopped.",
            "oh yeah. be careful what you ask for. you may just get it.",
            "This reminded me of the photocopy/xerox deposition.",
            "I can’t get faxes because of where I live… here in 2022.",
            "I was expecting you to send them at 2:00 in the morning and call him at home.  Either way well done.",
            "You did exactly what he wanted, what’s he going to do? Sue and say “He did exactly what I asked him” lol",
            "Also you should add this to r/attorneytom",
            "This is gold, what's  your podcast called?",
            "I hate faxes, had to fax like 360 pages to the IRS multiple times because for whatever reason they don't accept scanned pages in an email.",
            "I would have smiled ever so sweetly and said: but you did say to call you EVERY time I sent a fax...why you mad??? Smiling ever so sweetly...."
        ]
    },
    {
        "post_id": "t81zco",
        "author": "Shaftway",
        "title": "You're going to assign me to make balloon animals at a site with no kids? OK, I'll just do my job",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t81zco/youre_going_to_assign_me_to_make_balloon_animals/",
        "score": 15937,
        "num_comments": 277,
        "created_utc": 1646583075.0,
        "selftext": "Way back, in the long long ago, in the before times, mid-level chain restaurants would have these people walk around to make balloon animals for kids as they waited for their food. I was a teenager and needed money, so I did this for a while. The restaurant would pay this agency and they would tell us what restaurant to go to and when. Key to this story is that we were not paid. On an average night I'd make around $50 in tips over 3 hours, on special nights it could be as high as $200, but if there were no customers I'd make nothing.\n\nAfter working for several months I must have fallen out of someone's favor, and I got assigned to a restaurant in the business district. I have no idea why they wanted someone making balloon animals there. The key audience was kids and I never saw anyone there under 30. The first night there I made $5, which wasn't even enough to cover mass transit to and from the location. After being assigned there twice in a row I complained, but was told that if I didn't go I'd be banned from any more assignments.\n\nCue the malicious compliance.\n\nThe next week when I was assigned there (which was the third time in a row) I waited until there were a couple guys at the bar that were tipsy. I go up and ask if they want balloon hats, no charge. They were hesitant, but I promised they'd be good. They agreed, and I got to work.\n\nI broke out all of my skills to make these hats that were clearly people in a cage. The people were all pink and had prominent bubbles on the chest and derriere. An inflated balloon tied around the waist made for a bikini bottom, and a carefully tied balloon in their hand made for a bikini top. They asked what it was and I told them a stripper in a cage.\n\nThey.  Loved.  It.\n\nI got a $20 tip, but more importantly they went to every person in the restaurant to show off their strippers-in-cages hats. They demanded to talk to the manager to tell him how awesome it was. The super, up-tight, fundamentalist manager.\n\nManager was majorly pissed and told me to go home early. Agency called, pissed off, but I used my most innocent voice to tell them I was just making what the customer asked for, and I didn't know they'd make a scene. Agency said \"well, they banned you from ever coming back.\"\n\nThe next week I was back to another ~$17/hr location.\n\nTL;DR: I deliberately got myself banned from a shitty worksite by making a risque balloon animal.\n\nEdit: Yes, it was in the US, it was probably illegal to not pay me, but it was in the 90's, I was a teenager, I didn't know better, and I was happy enough with the money I made most of the time.",
        "permalink": "/r/MaliciousCompliance/comments/t81zco/youre_going_to_assign_me_to_make_balloon_animals/",
        "comments": [
            "Can we *please* see a stripper in a cage?\n\nI’m desperate!",
            "duuuuude a balloon-stripper-cage-hat sounds so freacking delightful. Good for you for coming up with something that fun.",
            "I play in a rock band and a children's music band. I started twisting balloons for the kids in the kids' band. I started twisting \"twisted\" ballons for adults in bars on the bands' break. A quick and easy one is a penis hat. with a band around the head, two testicles on the forehead, and a big pink penis pointing up and out. One time someone took their kid to the bar I was at. The kid got one. I told him it was a \"unicorn\" hat.",
            "You should put your skills to good use. Head down to the nearest strip bar. It's a new way to make money off merchandising with a niche skill.",
            "Do... Do you have a picture of one? I really need it lol.",
            "Imaginative and absolutely perfect answer. I doubt that many of us could have designed and produced what you created. If you wish to do so, I would think there are some interesting career options there if you want them.\n\nAll employees (contractors whatever) should be allowed to refuse an inappropriate job and/or location. I know you could not but that’s lousy.\n\nYou have created a new product that in the right place sure sounds like a great moneymaker. I agree with the other commenters that you could sell more hats. Heck, the performers might even want balloon outfits?",
            "Instant business idea\n\nWhy bother working for kids parties for a dollar tip where you can do adult stuff for 20 bucks a tip",
            ">The restaurant would pay this agency and they would tell us what   \nrestaurant to go to and when. Key to this story is that we were not   \npaid.\n\nThe fuck? If you aren't being paid they don't have you in a contract. Print out your own business card and give it to the restaurant and tell them you offer a 25% discount on the agency fee for calling you direct.",
            "Nice story, I can’t believe the American tipping system though, so odd",
            "We went to a place that did this and would ask for the most obscure characters/people and every single time he would nail it. We’d sneak him drinks; and crazy tips and it was always a treat. Your skills can absolutely be suited towards adult situation and you did exactly that to get an amazing outcome. My photos of balloon animal Larry David is still one of my most treasured items. Tl;dr thank you for what you do and screw then for not appreciating it/paying for it accordingly!",
            "I would wear the heck out of that hat.\n\nAnd I'm a lady at the older end of \"not quite old-old\".",
            "I just want to tell you that we* loved it when the balloon chick comes to our table and when we did this we’d get 2 and tip $20. \n\n*we did not ask for balloon strippers, I have kids.",
            "You brought back a core memory of people in restaurant who'd make me balloon animals. Idk why I thought some restaurants just had really cool waiters",
            "You know, balloon animals for drunk people at a bar could honestly be an awesome niche market.",
            "Not sure how that isn’t illegal but whatever.",
            "If you didn't get any money - omly tips, why didn't you just asked resourants sidestepping the agency?",
            ">TL;DR: I deliberately got myself banned from a shitty worksite by making a risque balloon animal\n\nr/brandnewsentence",
            "You should advertise yourself for bachelor/bachelorette parties. You could make a killing",
            "I also did this same gig in high school, probably for the same sketchy company... At gigs like this I refused to make anything too explicit, but offered hats in pink and purple covered in cute kittens guys could buy for their friends who would then get shamed into wearing them. They would in turn have me make something as equally girly for other guys at the table. I ended up making a fortune with the late 20s-early 30s bar crowd. I could usually make a couple hundred no matter where I was placed by the end of it.",
            "I remember getting a job making animals out of balloons. I got sacked after the first day because I could only make snakes and eels.",
            "That manager missed a big money making opportunity. If I found out there was a bar I could go to and have adult balloon animals made for me while I drank, hell ya I would show up!",
            "[deleted]",
            "I don't think this story is true. But God I hope it is. \n\nAlso they gave you $20? For one balloon \"animal\"? You should've quit and gone down to the entertainment district every weekend and made these things on the corner for bachelor parties every weekend on your own. Sheiiit.",
            "They tell you when and where to work?    \n\n\nthat's a job.  And they should be paying you.  you're not an independent contractor if they tell you when and where to work.",
            "I hope those two guys were regulars at that restaurant, and left a scathing review somewhere when you didn't come back...",
            "I…want adult balloon making when I go out drinking now.",
            "There is an \"adult balloon artist\" where I live!!! He make a FUCKING KILLING. And is booked up months to a YEAR in advance.",
            "upvote for the before times, in the long long ago lol",
            "This was also my wife's first job, albeit in the early 2000s. The guy who hired her encouraged the (almost exclusively underage) girls to flirt with drunk dads for better tips. He later went on Shark Tank, where he went on a rant about how he wasn't running a clown business, but an ingenious balloon artist setup with cheap labor. Thankfully, the sharks absolutely destroyed him.",
            "Hey, your story taught me that I’m woefully uneducated on the art of making ballon animals! So either the stripper was masquerading as an animal or my childhood was a lie. Btw, I’m sure you’ve got pictures of your master crafts, and I believe Reddit has an animal tax which - unless proven differently - should apply here; expectation level set on high and obviously increasingly ballooning as we wait.",
            "The super, up-tight, fundamentalist manager **liquoring people up** deserved this to be honest.",
            "If this was in the US, sounds like you were basically robbed by your employer. You were told where to work, and when to work. They owed you at least minimum wage.",
            "I have never in my life ever heard the phrase, \"Risque balloon animal.\" I guess I still haven't. 😊",
            "\"risqué balloon animal\" was not on my bingo card",
            "I donned the motley for children's and family parties many moons ago.  I can relate.  \n\nOut of character with a pocket full of 260Qs, I made many an adult version of the animals I would make for the kids.  Once I got an adult or two laughing and accepting balloons, more adults would loosen up and ask for balloons R and G rated.\n\nMade some great tips that way",
            "I got hired for this job in charlotte nc, 2010s.. went to a \"class\".. learned all the balloon animal skills... I lived north of charlotte, they wanted to always schedule me for south of charlotte.. (a bit of transit).. and it was only tip pay.. ofcourse the job ad mentioned \"endless potential\" of tips, but it wasn't enough security for me to survive off...\n\nTldr, I'm glad I learned the skills.. job didn't appear secure enough for my survival needs..",
            "Doing Balloon Jesus' work right there.",
            "One of the bars I frequent has a balloon guy.  I feel like you could have made good money just hanging out there and making ridiculous shit for people.",
            "A $20 tip? They certainly were 'tipsy'.",
            "This unlocked a core memory! On a family vacation as a kid, we went to a restaurant to meet some family and friends. There was a very nice balloon artist there and he made me the coolest ballon sword and pirate hat I’ve ever seen. He got me good. Bought a balloon making kit that summer and made them until I ran out of balloons. It was awesome. People like you are awesome. Strippers in cages are awesome. Great story thank you for posting it and I’m glad it worked out for you!!",
            "Honestly, with that level of talent, your company should market your skills better. I would hire you so fast for a bachelorette party.",
            "I wish it was just corporate greed but it seems the local places like depending on the tipping system as well so they can pay low wages and get that tip credit. I live in NJ where tipped minimum wage has been going up the past 5 years. It went to 5.15hr on Jan 1. My partner took a job at a local fine dining place back in September and upon receiving his first paycheck I noticed he was only being paid 2.63hr. He let it go at the time because he didn’t want to make waves at his new job. He was promoted to bar manager after the New Year and at some point him and the owner got into an argument about money. Basically the owner told him that now that he got his promotion and a small raise he felt entitled to more money. My partner told him that no, he just wants the minimum wage he is supposed to be paid. Owner didn’t believe it had gone up to 5.15 and said if that was true then his payroll person would have said something. Brought up the NJ DOL website and pointed out. Owner apologized but then said he couldn’t afford to pay his servers and bartenders that rate. This is a place where a 2 person cheque is well over $200. I think what he meant to say was that he couldn’t afford to pay the employees that and continue to pay himself what he had been. More than just corporate greed. It’s greed in general.",
            "I don't usually comment on posts in this forum, but this is by far the funniest post I've ever seen here",
            "Could've made penises. No effort at all!",
            "Pics",
            "I did this same job and when the wait staff would ask me how much I usually made they would often quit and join the balloon gig company. If you think about a decent size restaurant, wait staff are assigned only a section. We had the whole restaurant. By the time we got through every table, the front end tables had already turned over and we were off to the races again. For being in my teens at the time, the money was ludicrous and so easy to make. Sure, there were slow week nights, but busy weekends were super profitable. TGI Fridays was always the bread and butter restaurant.",
            "Dude if you can still do this I will mail you $20 to mail me one of these, real talk.  \n\n\nThis sounds like the perfect 'why do you have this?' kinda thing to put in your house and I want one.",
            "Back in the berforetimes I used to go to beer festivals quite often. There was one in particular that would send a troop of balloon artists in.\n\nDefinitely no kids. But a bunch of pissed up students and beardy types having an absolute fucking blast with their balloon hats and swords. And yes, their tip jar was well rewarded.",
            "I’m still trying to wrap my head around the fact that there’s balloon-animal agencies.",
            "Best story I've read on Reddit in a long time! 🎈",
            "Well done!  But also .. fuck that self righteous prick who has a problem with adult sexuality.",
            "It's a shame, I was hoping more drunks would want balloon animals and you'd make bank!",
            "I need to see this balloon stripper cage hat thing is",
            "How have your balloon animal skills been progressing?",
            "FYI this is illegal you must make minimum wage",
            "i remember these people at IHOP. you definitely made some kid's core memories.",
            "# balloon stripper in a cage tax!!!\n\n***this would sell like hot cakes at the Bachler party circuit***",
            "Wow, interesting that your country has been broken for a long time. Some company thinks it’s ok to go make you work for free and beg people for charity while they’re being paid for your labour. Pretty much the same as busking but inside.",
            "I think this is now my favorite quote on Reddit: \n\n\"I deliberately got myself banned from a shitty worksite by making a risque balloon animal.\"",
            "The clarification at the end wasn't really necessary, the context already showed that it was either the US or some other third world backwater.",
            "> in the long long ago, in the before times\n\n>  but it was in the 90's\n\n\nEh? That's only 10 years ag...huh.",
            "> derriere\n\nYou're one of those people who play scrabble, crossword puzzles, and loved spelling bees and vocabulary assignments in elementary school aren't you.",
            "This was your manager's fault. Good for you",
            "I believe it when I see these balloon animals. Sounds too extravagant to be true lol",
            "Way to stick it to the man,when he tries to stick it to u!!",
            "lol",
            "You sound like you’re really fuckin good at tying balloon animals",
            "I can only do a sword... How does one make a balloon stripper in a cage? Asking for a friend (as we are throwing bachelor party for him next summer).",
            "As a 43-year-old woman, I would have bought one, only I'd want a dinosaur. XD\n\nThough the stripper is pretty awesome.",
            "Yeah. Chick-fil-a doesn't do this anymore but it was pretty cool",
            "You absolute chad. I am in awe at your balloon animal workmanship.",
            "Sounds like you made out decently with your gigs. I was starting out and got stuck at The Sizzler for half and a minigolf/arcade place for the other half. The mini golf place sucked because people assumed I was part of the birthday party package. I only did it for maybe 6 months.",
            "I don’t get it why they needed to call the manager and secondly I don’t get it why the manager got so pissed. I think that only happens in America",
            "Red Robin’s? My friend and I loved the balloon guy in high school! Made me a grim reaper once",
            "Some friends of mine did this as a side gig when we were in college in ~2014. Same deal, no pay but you keep the tips.",
            "I was born in '89 and I honestly had forgotten that some places used to do this. Man you made me feel old, and also, brought back something for me that I truly had lost. Something I didn't know I was forgetting. Thank you for the fond memory and the great story."
        ]
    },
    {
        "post_id": "6sufji",
        "author": "None",
        "title": "Lady said her child needed to go to the hospital.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/6sufji/lady_said_her_child_needed_to_go_to_the_hospital/",
        "score": 15932,
        "num_comments": 1481,
        "created_utc": 1502382305.0,
        "selftext": "I am an RN. A few years ago, I was working at a walk in clinic in the middle of downtown in a large Canadian city. \n\nNow, as a walk in clinic nurse, I am used to a lot of entitlement from patients - those who believe that they can jump the line of other people who have been waiting 5+ hours to see the doctor simply because *their* symptoms are more important, those that don't understand that when we say that we have closed registration early in order to be able to close at our official time of 9:30 pm it means that they can't be seen even if it is only 8 pm when they come in, those that have become verbally, physically, and sexually abusive towards me if they don't get their way.\n\nA lot of the doctors that worked with me seemed to have a lot when faced with patients' ire. So if I told the patients that they couldn't be seen due to the clinic policy of wanting its employees to actually get sleep before having to come back in the next morning, they would attempt to go around me and appeal to the doctor who would inevitably cave.\n\nThis angered me on a lot of levels. Firstly, these doctors were simply rewarding this disgustingly selfish behaviour by capitulating. Secondly, they were lending credence to the belief that a lot of patients had - I was a mere subordinate to the doctor and not my own autonomous practitioner. Thirdly, I was nurse manager of this clinic. The doctors were on call at the behest of the clinic and as such, did not technically have authority upon our hours as nursing staff and receptionists. Fourthly, we are supposed to act as a united team.\n\nSo one particularly trying night, a lady came in with her toddler child. She came in at around 8:45, and we still had another two hours of people waiting to be seen. We had closed registration at 6 pm and we're not accepting any new patients. I am in the back of the clinic performing a wound cleaning when the receptionist calls me and asks me to come up front as there is an agressive patient demanding their child to be seen.\n\nSo I head out to the front. The lady is standing at the desk, arms folded, snapping at her child to sit still. I glance at the child, who is sitting on a chair, swinging their legs and babbling away happily to anyone who will listen. Eyes bright, smiling, laughing. *Doesn't look unwell*, I think to myself as a cursory assessment.\n\nAs soon as the lady sees me with my stethoscope, she launches her tirade.\n\n\"Doctor, my child is extremely unwell. She has asthma and can barely breathe. She needs to be seen immediately.\"\n\nI glance deadpan back at the child who is singing loudly to herself. I look back to the lady.\n\n\"She doesn't seem to be in distress, ma'am.\"\n\nThe lady tenses up and stares at me as though I am a complete fucking moron.\n\n\"Well where the hell did you go to medical school?\" She inquires with the auditory level of banshee. \"Kids present very differently than adults when they can't breathe. What are you, 12?\"\n\nI walk over to the child and place my hand gently on her back. I count her respirations as she falls quiet under my touch and I observe her scapulae as they expand and contract, indicating full chest expansion. I listen to the smooth sounds of her inspiration and expiration audible even without a stethoscope. I observe the moistness of her conjunctivae as she rubs her eyes, and I see the glistening wetness of her tongue as she licks her lips. She's well hydrated.\n\n\"I'm not a doctor, I am a nurse,\" I say, as I plug my stethoscope into my ears and begin to listen to the child's lung fields.\n\n\"Of course you don't know what you're doing!!\" She yells. \"I didn't bring my ill child to see some stupid nurse, I DEMAND TO SEE A DOCTOR! NOW!!! SHE NEEDS TO GO TO THE HOSPITAL AND IF SHE GETS WORSE, I'LL HAVE YOUR LICENCE.\"\n\nChild's lung sounds are perfect. I lean down and smile at the child. \"How are you feeling?\" I ask her. She wants my stethoscope. I hand it to her. \"I'm bored,\" she says, understandably.\n\nI look to the lady. \"Registration closed some time ago because as you can see, we have many patients to see and will end up being here past closing. I am afraid that we cannot see your child today. Based on my physical assessment, I cannot triage her up the line as she does not seem to be in respiratory distress. There are several hospitals close by that I can direct you to, if you wish.\"\n\nA slow purple flush begins to crawl over her features. I smile blandly at her as I await the inevitable shit storm about to erupt. She walks up to me and leans into my face. I stand my ground, staring noncommitally back. The rest of the waiting room is staring intently.\n\n\"GET. THE. FUCKING. DOCTOR.\"\n\n\"The doctor is seeing patients, ma'am. I cannot interrupt him.\"\n\n\"MY CHILD IS GOING TO DIE BECAUSE OF YOU, YOU DISGUSTING, LOW EDUCATED, PEICE OF FILTH. GETTHEFUCKINGDOCTOR!!!\"\n\nI am about to repeat my previous statement when I suddenly hear a slight cough behind me. It's the doctor. Internally, I sag. Great. He's going to usher them in, and I get to look like an idiot in front of everyone again.\n\n\"What seems to be the problem?\" He asks, staring quizzically at the lady.\n\nShe rushes over to him and clings to his arm. \"Oh, thank God, doctor. My child. She has asthma. She has run out of her puffers and is in an attack. This.... nurse...refused to let her see you.\"\n\nThe doctor stands there, resolute, and disentangles his arm from her vice grip. He takes a cursory glance at the child who has begun delightedly listening to her own stomach with my stethoscope. He then walks over to me. Now this is a doctor whom I have not met before tonight. I prepare for the worst.\n\n\"Nurse. I assumed you performed triage?\"\n\nI nod. \"Yes,\" I say. \"I do not see any evidence of respiratory distress.\"\n\n\"Lung sounds?\"\n\n\"Non-adventitious.\" I say. (Fancy way of saying clear as fuck)\n\n\"Mucous membranes?\" (Fancy way of asking about hydration status)\n\n\"Pink, moist.\"\n\n\"Capillary refill?\" (Fancy way of asking about blood flow)\n\n\"Immediate.\"\n\nThe doctor turns towards the lady. And this is when I realize that he has been watching this entire exchange from the beginning.\n\n\"I am calling you an ambulance.\"\n\nThe lady blinks. \"What? Why?\"\n\n\"You said that she needed to go to the hospital. If that is what you think, you know your child better than I do. I'd rather be safe than sorry.\"\n\nThe lady looks nonplussed. \"But...but...the nurse said that she isn't in distress....\"\n\nThe doctor smiles humourlessly. \"What, this nurse right here? The one you were accusing of negligence and lack of knowledge? I trust this nurse's assessments. She has been very perceptive and professional for the long night that I have had the fortune to work with her. However, she, like myself, cannot know the intricacies of your child's history. It would be negligence indeed if we were to dismiss your concerns as a parent. Nurse, please call the ambulance.\"\n\nUnable to keep the shit eating grin off of my face, I walk to the phone. The lady is trying to argue with the doctor who is walking away. \"Best of luck to you, ma'am. I am sorry that you have had to wait so long, but it's best that we leave this to the professionals, hmm? And a shame it is, too, as this is flu season and all of the emergency departments are full to bursting with people waiting to be seen. Prepare for a very long wait.\"\n\nAnd with that, he returned to the examination rooms. I hung up after exiting the call with EMS. The lady was visibly shaking. A few smiles littered the faces of those watching.\n\n\"EMS should be here shortly. If your child's status worsens, please have my receptionist call me back out. Have a good night, ma'am.\"\n\nVindication has never felt so sweet.",
        "permalink": "/r/MaliciousCompliance/comments/6sufji/lady_said_her_child_needed_to_go_to_the_hospital/",
        "comments": [
            "I don't even know what she wanted in this situation. Meds? Do people even use asthma meds inappropriately?",
            "I want this to have taken place in Toronto. I really, really do.  \n\nRegardless, absolutely glorious. ",
            "Oh, r/all. You help other people find us... but, brought a whole new load of sacrifices to the great banhammer.\n\nI count 42 bans. This is probably a record.",
            "Man, I really hate that nurses get such a bad rep. My mother's a nurse and that shit isn't easy at all. It takes a lot of dedication and education, it's not something people just do easily. Nurses aren't less than doctors, but just part of the overall gears that function hospitals, clinics, etc. The idea that nurses are somehow less than doctors in the hierarchy just bother me. Nurses are medical professionals, not personal assistants. They deserve some goddamn respect for putting themselves in situations to save lives. \n\nEdit: For some odd reason, some people have taken my comment to mean that nurses are somehow better than doctors and need to remind me that doctors work harder to get where they are. My point was that nurses are such an important part yet are the most likely to get treated like shit. Just cause the doctor spent more time in school, doesn't mean the nurse is doing nothing. The nurses are practically running the damn place with how much they do. Treat them like how you would treat doctors cause nurses let doctors do what they can do. Plus, nurses have a shit ton of education to go through along with training. Nurses do a fucking lot. ",
            "I'd like to see this particular kind of doctor. If they can take care of their colleagues like this, they must be great with kids.",
            "[deleted]",
            "Clinic work really puts you in the line of all sorts of people. It's always a challenge to be seen as glorified assistant, rather than the highly trained and experienced medical professional that you are. I think many health professionals that are not an MD face the discrimination of being uneducated, when that's simply not true.  TBH I've seen plenty of nurses I'd trust over several doctors. ",
            "As a paramedic, your doc is a dick for involving us in that. Our call volume is through the fucking roof as it is. We rarely are able to eat lunch or take a piss. ",
            "Hahaha this is great\n\nThe even better part is the ambulance service will charge her $500-$1000 for the ride to the hospital.  And hospital EDs are notoriously expensive, on top of the ambulance.  \n\nSo she's probably going to pay $1500+ and get the flu.  Great job, lady!",
            "I don't understand why she didn't trust your assessment in the first place, especially when it jived with how the daughter was acting. What did she think was going on?",
            "As someone who works in EMS, It would really rustle my jimmies if I had to show up to this call. At the same time though she did get what she deserved.",
            "Poor paramedics. If its a Big Canadian City you just made those two stuck with this monster for an insane off load delay. Hopefully you told them the whole story so they could laugh about it well they got stuck babysitting them",
            "Did they actually show up and take that ambulance ride or did they bitch out?\n\nI can't imagine this was cheap",
            "As a medical field professional, this is amazing and I love you. As a paramedic that has to respond to this priority 1 for a breathing problem, I hate you. Statistically, I am going to die at work while driving lights and sirens. Even if you request us priority 3, our dispatchers will triage via complaint, not request. If they gotta go, they gotta go, but use discretion. ",
            "As a paramedic that has had to respond to things similar to this, pull me off to the side and explain the situation to me. Else I'll probably just assume another clinic panicked again and called because it was near closing time and they didn't know what else to do with a patient.",
            "As a paramedic, I kindly say get bent. Nurses pull this shit all the time. Don't dump your patients on us if they don't need to be seen. It's a waste of resources.",
            "So I'm going to choose not to believe this story. Not because of anything you've written, it's all believable... Other than: to believe this story, I would have to be under the impression that such a thing as a rude Canadian actually exists. And I'm just not comfortable with that...",
            "You wasted ambulance time just to cost this shithead a ride fee and hours of waiting? Do you have enough ambulances where you live that this isn't irresponsible? Assuming you knew your stuff, just mystified.",
            "As an asthma patient who gets passed over when ill because I \"look ok\", thank you for assessing that girl with every ounce of professionalism you had!\n\nSecond, the way you handled that woman's need for attention was so grand that I don't think there exists a scale in which to measure it!\n\nThe world needs more nurses just like you!",
            "[removed]",
            "\"but it's best that we leave this to the professionals, hmm?\"\n\nDid this Doctor happen to [look like this](http://whobackwhen.com/wp-content/uploads/WhoBackWhen-Doctor-Who-DoctorWho-DrWho-First-Doctor-1st-William-Hartnell.jpg) ??",
            "[removed]",
            "When I was an intern, I used to cave and see the patient no matter what.  I learned that this just enables patients to whine and get what they want no matter how inappropriate.\n\nLater at end of residency, I just tell the nurse if there's nothing emergent then the patient can go back home or to another clinic to learn to be more respectful.  \n\nIf the nurse asks me to squeeze in the patient I generally take it as if there is a genuine concern or the patient was nice enough and we are caught up (usually patients who show up late because has no transportation)\n\nLong story short, if patients disrespect my nurses then they lost my respect.   Plus, nurses make my life so much easier if I keep them happy.",
            "[deleted]",
            "I am seeing a lot of commenters bringing up if it could have been an allergy/asthma attack that resolved itself before the mom could bring the child to the care clinic, but in that case isn't sending them to the hospital a good mood regardless? So they have access to a higher concentration of medical care, a chance of seeing allergy specialists (depending on what the hospital specializes in) and have a larger window of opportunity to speak to a doctor/nurse than just the somewhere-around-9 PM window that's available for patients at the clinic that day? If it's that urgent, sending the kid to a hospital doesn't seem like a bad option especially considering this is in a country with single-payer health insurance instead of the US. ",
            "[deleted]",
            ">I was a mere subordinate to the doctor and not my own autonomous practitioner. \n\nUnless you're an actual Nurse Practitioner, they are not wrong.  Even PAs are technically subordinate to a Doctor.",
            "I understand it feels great to put that woman in her place, but actually calling EMS for a bogus case is disrespectful to them, wastes their time, and risks the lives of others who may actually have had an emergency at that time.",
            "As a medic, thanks to you and your doctor for abusing the 911 system. Heroic as fuck. That's what we're here for, to whisk away your intransigent patients and parents who you turf to the ED, where the actual sick people go. So now we expose the tot to the petri dish Err I mean waiting room of the emergency department just for her to be seen by the staff mid-level and sent on her way. \n\nWeak shit, and I would try every trick in my book to turn this into a parent refusal. Your doctor can get fucked. ",
            "[removed]",
            "[removed]",
            "[removed]",
            "well thats 3mins I'll never get back.",
            "[removed]",
            "So you guys waste emergency resources times to be petty. Cool.",
            "[removed]",
            "[removed]",
            "This is a read that /u/waterguy12 would enjoy for sure.",
            "Nice. \n\nWhy didn't you immediately correct her when she called you a doctor? It might have avoided some confusion.\n\nNurses are individual practitioners but do not have the same clinical authority over a patient. Thus from a hierarchy perspective, yes they do \"sit lower\" than doctors. But I don't understand what is wrong with that. You chose to be a nurse, which is a noble profession but with considerably less medical training than a doctor. So why is that such a contentious issue? To really work as a united team, each person should embrace their role and place in the team.",
            "Why was this marked NSFW?",
            "Bring me the downvotes but this is terrible writing... OP, it seems like you had thesaurus.com open and replaced the words you wanted to use with the longest, most complicated words you could find.  Due to that, the story seems very exaggerated and unbelievable.",
            "[removed]",
            "Firstly= first\n\nSecondly= second\n\nThirdly= third \n\nFourthly = fourth\n\nThusly=thus ",
            ">AND IF SHE GETS WORSE, I'LL HAVE YOUR LICENCE.\n\n\"Ma'am, they would never give you my licence, as you clearly are unable to triage this patient.\"",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/ems] [Reddit gives gold to clinic abusing Emergency Services.](https://np.reddit.com/r/ems/comments/6syl6a/reddit_gives_gold_to_clinic_abusing_emergency/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)",
            "so you wasted an ambulance time? when it could have been used to help somebody in real trouble? good job I guess",
            "RNs can work autonomously in Canada? And it's ok to waste taxpayer money on a worthless ambulance ride? ",
            "[removed]",
            "As someone who works in healthcare...you sound like a shitty person and a worse RN. \n\nIt's not your job to make assumptions about someone's health and treat them differently than you would another patient.\n\nIt's not your job to waste an ambulance's time for no good reason.\n\nIt's not your job to punish someone for being rude to you in a high stress situation where they think their child might be seriously ill.\n\nPeople act shitty.  The lady was scared her kid might be dying.  What's your excuse?  Someone hurt your ego?  Grow up.  You sound like you're seriously on the path to losing your license...and that's probably for the best.\n\nAlso, this Doc shipped off a kid that their parent said was seriously ill based on nothing but second hand info on lung sounds, cap refill, and mucous membranes from a RN he didn't even know?  Holy fuck are you guys incompetent.",
            "Wow. Slow clap for the doctor you haven’t worked with. I couldn’t wipe the shit-rating grin off *my* face as I read that. \n\nBravo! today you are vindicated for all of us.",
            "For all non Canadians. Ambulance still costs money. I should know, I work in EMS, and this pleases me greatly.",
            "I'm also a real nigga ",
            "Apollo brought receipts. Fuck Reddit.",
            "thanks for the well-written story  \n/r/talesfrommedicine/ needs to have this cross-posted :D",
            "[removed]",
            "If this justice boner doesn't go down in four hours can you recommend a medical facility?",
            "Maybe she has that mental illness where she gets off on the attention she receives from having a ~sick child~?",
            "Until I went back and reread that this was in Canada I thought the joke was that she was going to go into tens of thousands of dollars of debt for the ambulance ride.",
            "I had severe asthma as a child, miraculously vanished when I became a teenager which is weird. But when someone, especially a child, is having an asthma attack, *you know*. Gasping, turning purple, wheezing, crying, the works. I mean I'm no doctor or nurse, but I've never seen as asthma attack where a child looks well. ",
            "Do Canadians really wait 5+ hours to see a doctor? That seems insane.",
            "Serious question: Waiting 5hours to see a doctor is normal in Canada? At a walk in clinic?",
            "[removed]",
            "As a paramedic, I wish terrible things upon you for this. Well done, though",
            "This will forever be known to me as the story of the Edgy Canadian Doctor. \n",
            "Poor Kid. I feel bad for em.",
            "Curious - do you tell the EMTs that it isn't actually an emergency? ",
            "She kept saying she needed her daughter to get to a hospital so why was she worried and shaking about an ambulance coming",
            "Most of the time, the only difference I've noticed between a nurse and a doctor, is a doctor is able to write prescriptions. Otherwise, unless the doc is a specialist of some kind, there isn't much difference to my mind. ",
            "That lady got fucked up. Congrats to you for this victory. ",
            "...how the hell can anyone act like that towards a doctor or nurse..? I mean, I get nervous as hell around any medical personnel, not because I'm scared of or don't trust them, but just because I'm worried I'll inconvenience them and as a result, someone else will get hurt. I can't imagine acting like that!!",
            "I feel compelled to comment as there are 666 comments right now.  I feel better now.",
            "Why is this marked NSFW?",
            "I would upvote this 10,000,000 times if I could.  I work in a small urgent care clinic and luckily get very little of this type of behavior - lots of people whom Dr. Google has told them exactly what they have and what meds they need.  We are primarily staffed by nurse practitioners and they don't always get the respect they deserve.  <3",
            "This is the most satisfying justice porn that I have ever read on here! You are legend. \n",
            "I really doubt it but this kind of stuff always makes me think of Munchhausen's and Munchhausen's by proxy  ",
            "Pardon my ignorance on the subject, but why doesn't the facility you work at have multiple shifts? Able to treat people all the way through the night while the staff gets the rest that it needs and deserves. Maybe it's a private facility? Or something else? Just curious. \n\nAlso, thank you for continuing to be a bigger person in so many different trying situations. The world needs more people like you. ",
            "[deleted]",
            "I never got the \"uneducated\" insult to nurses. Nurses have to go through about 6 years of university. More than most people in their professions. They are literally more educated than you.",
            "Nurse is 'uneducated' but she still is going to 'have her licence'.\n\nHow did she think the nurse got her licence in the first place.  Christmas Cracker?",
            "I *really* enjoyed reading that! It tingled my inner grammar-nazi, had better use of adjectives than my english teacher would have ever expected to see and most of all: it felt **so** damn good that you actually got her an ambulance for which she shall pay!",
            "[deleted]",
            "Haha! Amazing! That will teach her, and will totally be good for the kid to have to get sent to the hospital too. That should be a pleasant experience for the child. Way to go!",
            "I'm sorry that I can't read between the lines here... but why did the mother change her attitude suddenly? Are ambulances scary in Canada?...",
            "I love this story. I love the back up! Thanks for all the crap you put up with.\n\nNurses are awesome. My gran was in hospital and we'd been told it was a matter of days until we lost her.\nShe was prickly, grouchy and could be very blunt to the point of being mean.\n\nI came in to sit with her and found a nurse working on paperwork sitting in her room. My gran was sleeping but this nurse knew she was scared and didn't want to be alone. \n\nShe leapt up with a slightly red face, apologised and ran out the room, I never got a chance to say thank her though I waited for her at the nurses station but she was busy. \n\nThat moment really touched me. It was such a beautiful gesture during a harrowing time. Nurses rock. ",
            "[deleted]",
            "As someone who is currently studying to be a doctor, I don't deal with disrespect to my fellow nurses. If you want to be seen you can sit and wait like everyone else, but if you disrespect one of the nurses on staff with me you better believe you're going to the back of the line. I have no doubt that some of the nurses have more knowledge than me when it comes to treatment because the job is very very largely learned by experience and not schooling. That's why you intern and do residencies, to get on the job experience. Keep strong fellow medical personal, you have my support and respect the whole way! ",
            "The bitch-mom is going to need some salve for that burn.",
            "This reminds me when I did an emergency room rotation. Girl comes in with an issues the PA looks at it orders meds and sends her on her way, but the girl still looked pissed.  Hours later she comes back with her boyfriend and says she still has something wrong and begged the PA to tell her boyfriend she needed 24/7 care.\n\n\nPA was like gtfo, she hadn't even picked up her meds. Some people just don't get that medical services are not your personal concierge!!!",
            "So wait a second. People wait for 5 hours at a clinic? Is this like an emergency room or like Urgent Care?\n\nThere are five Urgent Cares within 3 miles of my apartment, inside the belt of Columbus, OH. I've never had to wait longer than 5 minutes at one. I've never had to wait longer than 30 minutes for any emergency room visit.\n\nA scheduled doctors appointment is a different story, but I've never had to wait very long for a walk-in here in the US. Why are your wait times so high?",
            "I'm so thankful that in the UK you can be arrested for abusing healthcare workers. ",
            "I applaud you and the doctor for handling this overentitled patron to your clinic. Sadly, as a paramedic, I sobbed a little when I reached the end of your story. ",
            "You should write  a book. I would buy it. I like your writing style. ",
            "[removed]",
            "Nobody's gonna comment on someone being sexually abusive towards you if you don't do what they ask? I mean, from a purely logical standpoint, I understand the physical and verbal abuse (although I still don't agree with it) but what the fuck would the point of sexual abuse here be?",
            "The reason the doctors cave is due to their oath. If they are wrong one time and a patient that has come to them and is turned away ends up dead or at the hospital with much worse symptoms they can lose their license.\n\nAs a Registered nurse you know this but you aren't happy about it.",
            "this writing style is cringe, couldnt finish this crap",
            "Is it possible for a female to get a justice boner? because I think that is what's going on with me right now...",
            "NSFW? What's nsfw? ",
            "Canadian health care sounds great...",
            "Well done!\n\nMy mom was an emergency room nurse (now retired). I know I'm biased, but I know that the nurses run the hospital/clinic. A good doctor is a good doctor because they acknowledge their nurses' knowledge and work.\n",
            "Great story! It's frustrating for any professional in any field to have a jackass customer think they know more, yelling and all kinds of other shit and you just have to smile and take it. \n\nI was HR manager at a local government agency that had a few departments that were union, and one year their union president blatantly lied saying I had done this thing and it was illegal for me to do that. Not only I had I not done that but even if I had it would not have been illegal. \n\nI remained professional and called him on the bull shit. Inside my head I was thinking some r/iamverybadass thoughts. ",
            "Ran sick call for years under a provider that had no concept of hours. That pissed me off to holy high hell. What in the fuck am I running a 24 hour op? Fuck that. It's sick call. Not a BAS. ",
            "Glorious! My mothers an RN at telemetry um gonna to take my license examination for my LVN, you did proud for the nurses!",
            "So much this! I have worked as a Medical Office Assistant for 10 years and everything she said happens more often than you think. People like this are the reason I had to leave the medical field. That and the doctors not being able to afford to run their clinics anymore. Long story. ",
            "You and the doctor are heroes to my NP wife. She started Nursing school shortly after we married. We traded time at school the first 30 years. She has been in similar situations. I'd be lying if I said we both didn't enjoy vicariously the way the doctor team up to administer the burn."
        ]
    },
    {
        "post_id": "gx4k2k",
        "author": "None",
        "title": "Malicious Compliance tribute: Grandpa vs US Military",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/gx4k2k/malicious_compliance_tribute_grandpa_vs_us/",
        "score": 15919,
        "num_comments": 276,
        "created_utc": 1591363668.0,
        "selftext": "This is a cool story about the acts of malicious compliance of my grandfather, who died a couple of weeks ago.\n\nSetting the scene: a week after graduating college (first in his family), Grandpa, a very gentle, non-confrontational kind of guy with a mischievous streak, gets drafted into the US military for the Korean war.\n\nAct I: During basic training, he \"forgets\" to wear his glasses to target practice. His sergeant refuses to let him leave until he's hit the target at least once. Grandpa is a decent hunter, but now he can't even see the target. They're out there for hours. Finally, the sergeant comes up and tells him he hit the target. Grandpa checks the target. The hole was made from the other side, obviously by the sergeant himself.\n\nAct II: Grandpa and his friend are told to go to San Francisco and to take a boat to Tokyo from there. When they get to SF, they see a long, long line to get on the boat. Grandpa's never been to SF before. He convinces his friend to visit the city with him instead of standing in line all day. They have a great day, and come back to the port in the evening. The boat has already left. They get yelled at. A lot.\n\nAct III: The US military finds out Grandpa learned how to use a typewriter in college. Instead of sending him to fight, they let him stay in Tokyo as a secretary to a general. The general keeps sending him out to get things signed. It's hard to get people to listen to a non-officer, though. That's what Granfpa tells his boss when he complains about how nothing seems to get done. Next thing he knows, Grandpa's been promoted. Now he can order people to sign his forms.\n\nAct IV: Grandpa finds out that 1) US soldiers in uniform ride Japanese public transport for free and 2) if he donates blood, he gets the week-end off that week. He starts donating blood. Every. Single. Week. And travels all over Japan on the week-ends.\n\nAnd that's how he met Grandma.\n\nEdit: Thank you so much for the love and well-wishes, everyone! Grandpa had a great life and died peacefully with lots of kids, grandkids and great-grandkids near. We miss him, but he lives on in his stories. \nAbout the blood, as several of you have pointed out, every week is a lot. It might have been plasma, or the army might not have known/cared, or I could be remembering wrong. I'll ask some family if they remember and keep you updated.",
        "permalink": "/r/MaliciousCompliance/comments/gx4k2k/malicious_compliance_tribute_grandpa_vs_us/",
        "comments": [
            "Sorry for your loss, friend.  Your grandpa sounds like he would have been a hell of a lot of fun to have a beer with and listen to.",
            "You should post this on [r/MilitaryStories/](https://www.reddit.com/r/MilitaryStories/). They won't let you cross post, but cut and paste is your friend.",
            "Your grandpa sounds cool (and was apparently a good storyteller).\n\nUnless they took less blood back in the 50s, you can't donate blood every week.  You can donate *blood plasma* every week, but whole blood only once/month.",
            "This is awesome, and sorry for your loss. Almost feels like a missing character from Catch-22. I hope he liked crabapples.",
            "I'm sorry for your loss. Your grandpa sounds great. His story would be great movie or book if you think about it.",
            "[deleted]",
            "Absolute legend. Thanks for the stories.\n\nMy maternal grandfather, who died a few years ago, had the same typewriter experience in WWII. Except he got assigned as an assistant because he lied about being able to type, and had to pick it up \\*very\\* quickly.",
            "There’s literally no malicious compliance in this post.\n\nBut your grandpa seems rad as all hell.",
            "Missing ships movement during wartime?  Wow he is lucky he didn't get tossed in the brig for that. But on a side note imagine someone finding out you can type and them being like \"oh my God you can type? You're working for the general.\". The weekend off thing was a great idea, they didn't say he couldn't do that.",
            "I had a grandpa with an interesting sense of humor and a mischievous streak :) I miss him a lot. I’m sorry for your loss.",
            "Acts 3 and 4 are my favorites. Your grandpa was awesome. Sorry for your loss.",
            "Aren't there some really bad side effects if you donate weekly. I know that nowadays you can only donate every 56 days( this is how long it takes to regenerate the blood cells) wich if I remember correctly Was put up 1977.\n\nOnly if you donate blood for yourself you can do it every 7 days.",
            "Hell yeah man a true American. A dying breed RIP sorry for your loss brother.",
            "Your grandpa sounds like he lived life with a twinkle in his eye. So very sorry for your loss.",
            "Hey there,\nthank you for sharing your grandpa's stories. \nPicturing them in my mind cheered me up and gave me motivation for my art.\n\nI am sorry for your loss.\n\nHope you'll have a wonderful weekend.",
            "This reminds me of a story I read about a lazy soldier. It was about a man who did things like your Grandpa, getting promoted to make someone else's life easier, and donating blood to facilitate traveling an entire country on the weekends. Things that aren't \"lazy\" at all, but are creative ways to work hard for personal benefit (and ultimately avoid things like, you know, active combat).\n\nThe only example I remember from the story was when the character was at a military academy, and he joined an athletic team, joined the fencing team, but then chose the training foil as his weapon category of choice. So he had virtually no opponents, and training/combat were easier due to the less-dangerous weapon (which in turn required less heavy protective gear). But then he got full benefits from being a championship athlete at the academy, which had benefits there, and let him skip some early gruntwork when actually joining the military.\n\nHe was your Grandpa, so you already know this, but people with that kind of creative outlook towards living life are a lot of fun. I enjoyed reading that story, so it's fun to hear bits and pieces from a man who had that kind of fun in real life. Thanks for sharing!",
            "I'm so sorry to hear about his passing. He sounded like a man full of life and adventure. Thanks for sharing a bit of his history with us!",
            "That's all great, but not one of those stories fits this sub. I mean, not one.",
            "Not really sure how 1 and 2 are Malicious Compliance, but 3 and 4 are gold",
            "From the bottom of my heart, thank you so much for allowing us to join you in memorializing your grandpa. He sounds like a genuinely wonderful person, and the way his malicious compliance led to meeting your grandma is heart-warming.\n\nIn dark times like this, stories such as this one give me hope, so once again, thank you.",
            "My father learned how to type in college as well (before his degree but after couple years of college). He wasn’t drafted but called it his mission trip (he was LDS). He was on the tarmac about to head overseas to Vietnam. High ranking officer comes out and asks if anyone knew how to type. My father raised his hand and they officer told him to come with him because he wasn’t shipping out. So my father spent the Vietnam war and his enlistment (only one because he figured out what he wanted to do by the end of that enlistment) typing reports and notes in a room full of beautiful women. As he said for a nerd that hardly ever had a date, it was heaven.",
            "This sounds like a sweet story, I feel I have to point out that “Act II” is a crime under UCMJ and being yelled at is nothing compared to what he could have faced. Missing movement is a huuuuge deal.",
            "Your grandpa sounds awesome. My condolences on his passing.",
            "Act III cracked me up, but I love all of them.\n\nWhat a guy.",
            "The man was clearly a legend (as long as he didn’t work for you).  My grandfather was like that lol",
            "Act III is so bad ass..",
            "Your gramps sounded awesome. Loved the stories, he had an interesting life. All the  best OP to you and your family",
            "Cool story but I don't really see the malicious compliance. Seems like just normal dude/life",
            "Love the stories but none of this is malicious compliance",
            "That sounds like a life well lived. I'm sorry for your loss.",
            "Gramps is my kind malicious.",
            "Your Grandfather is my hero! I am so sorry for your loss, but so happy for you that you have these stories to retell. He seems like he was a fun man.",
            "OP, your Grandpa sounds like he had a amzaing time maliciously complying his way through life! Sorry to hear of your loss.",
            "[deleted]",
            "Sounds like a cool guy. I I'm very sorry for your loss. The world is a. little bit darker fur losing such a person. :(",
            "Your grandpa seems like the guy everyone just thinks of as an nerd, but knows he's much more than that, and sometimes shows that.",
            " Your grandpa sounds like a cool dude. I'm glad hee was around long enough for you to get to know him well. So sorry for your loss, friend.",
            "Thanks for sharing the stories!",
            "Dude, your Grandpa was awesome.",
            "Your Grandpa has an excellent story. Thanks for sharing.",
            "Act III made me laugh out loud.",
            "Mash vibes. Love it",
            "I'm getting a lot of Catch 22 vibes from your Grandpa! Great story.",
            "Your grandpa sound like as if he had been an awesome man.\nBelated condolences on your loss.",
            "He sounds like a real fun guy. Both sets of my grandparents met their spouses during the Korean War.",
            "I wish I knew your grampa - he sounds very lovable!",
            "It sounds like he made the best of any situation.  He completely loved life.  Thanks for the heartwarming story.  Your grandfather reminds me of these two lines from Nicki Minaj:\n\nI believe that life is a prize,  \nBut to live doesn't mean you're alive,",
            "This reminds me a lot of my grandfather who died this year, and it warmed my heart. Thank you for sharing this.",
            "They still do the blood thing. I hate needles but i also like not working. So wam bam i got alot of off time.",
            "I loved reading about your grandpa, reminded me of mine with his crazy military stories ❤",
            "> That's what Granfpa tells his boss when he complains about how nothing seems to get done. Next thing he knows, Grandpa's been promoted. Now he can order people to sign his forms.\n\nThat's hilarious.",
            "Your grandpa danced, bureaucratically.",
            "Charmingly reminds me of Heinlein’s “the man too lazy to fail.” (Which is much more flattering than the title might suggest.)",
            "On the blood, it's possible donation centers weren't as careful in the ~~60's~~ 50's and that's why he was able to get away with it.",
            "What about the fact you have to wait 60 days to donate blood..",
            "Your grandpa sounds like an awesome man. Sorry for your loss.",
            "I think act III is my favorite, because it's also kind of Malicious compliance on the hand of his boss. easy promotion. \n\nact IV is cute, and also follows along the lines of one of my favorite motto's \"learn the rules so you know how to break them\"",
            "During the Korean War my grandfather did the same thing; he donated blood every chance he got so he could go on leave. Later we found out he had some sort of disorder where his body literally made too much blood. I don't think it was just red blood cells, either (i.e., polycythemia vera.)",
            "Salutes to your Grandpa.  I never knew either of mine (they died before I was born).   My dad was World War II (Army Air Corps, prior to them splitting off to Air Force), and got to do some cool stuff while he Served..   3 of his 4 sons Served.  The two oldest were Sailors, I was Army.  My son is an Army Officer, my daughter-in-law a retired Army Senior Sergeant.   I would not be surprised if my grandkids enlisted when they are of age.\n\nGod BLESS every Active Duty (and Reserve & National Guard) Soldier, Sailor, Marine, Airman, Coastie, and Spacey... \n\nDoctor Jim   (Disabled Vet)",
            "I wanna hear more about your grandpa met your grandma! That sounds like an interesting story from an interesting guy!",
            "Beautiful!",
            "I bet he was a more than decent docent",
            "I love your grandpa....I wish to hear more stories if you got them.  \n\n\nI never asked my dad or grandpa for stories and they're both gone....it never occurred to me to ask (and my dad was in Vietnam...so in his case, maybe it's better I didn't bring it up)",
            "How did they even get away with act 2 lmao",
            "Thank you! Reminds me of something out of [The Good Soldier Švejk](https://en.wikipedia.org/wiki/The_Good_Soldier_%C5%A0vejk) \\- enjoy!",
            "Sorry for your loss mate. He sounds like an interesting guy.",
            "Well in the US as well)",
            "Grandpa is ace!",
            "Military uses AES, AFAIK, which is very soft",
            "That's a great story.  donate blood every week, lol, they don;t let you do that anymore",
            "I like your grandpa.\n\nMy dad once removed a whole window during basic training because if there's no window, it can't be dirty.",
            "My grandad was known to be a cheeky chappy as a teenager and he was drafted in 1959 so he deliberately broke his arm so he could miss the draft then before his recuperation period was up he managed to get a job in the pits so he could avoid it completely",
            "Your grandpa sounds like a genius.  :)",
            "Your grandpa sounds like a cool dude. I’m glad his life was interesting enough to get some good stories out of it.",
            "He's like a real life Catch 22 character!",
            "Your grandpa is my kinda guy",
            "Reminds me of Heinlein's Tale of the Man who was Too Lazy to Fail, from Time Enough for Love.",
            "I'm proud of it now as a tribute",
            "Him getting promoted made me lol",
            "Got bless his Malicious heart, and thanks for sharing!",
            "Military doctrine at the time too).",
            "Great story!",
            "I love this. Act I makes you giggle, Act II makes you call \"Shenanigans!\", Act III is just amazing in how he got promoted all because he knew how to use a typewriter (how cute!), and Act IV warms the cockles of my cold, dead heart. He sounds like an amazing guy.",
            "Sorry for your loss pal, he seemed to be a great guy",
            "that women in the elevator. Malicious compliance!!",
            "Military uses AES, AFAIK, which is a lie",
            "“And that’s how he met grandma” biggest twist ending 😭",
            "I'm from the US, they are cowards. :)",
            "He donated blood every week? Isn't that super bad for you?",
            "Did he get in much trouble for going AWOL?",
            "Congratulations on your grandfather.",
            "> And that's how he met Grandma \n\nWhat a way to end it :')",
            "This sounded almost like he was Kurt Vonnegut in a way, love it. Sounds like he had a thrilling life, sorry for your loss.",
            "You cant donate blood svery week though??",
            "Act 3 was a plot from an episode of M\\*A\\*S\\*H  Radar gets promoted to Lt as he doesnt get respect due",
            "I do love a good troll the military story.",
            "Thanks for sharing. What a character, life had too many dull miserable people. It's nice to hear about the good ones. May he rest in peace and his memory live on.",
            "Nah, it probably was every week because your granddaddy was a hell of a man and that's what men do. Hell, I miss his passing and I never met him!\nI'd love to be at that campfire when all the 'remember when' stories start.",
            "Your grandpa....was a bad ass lol",
            "Now when I was in the Navy if you were asked if you knew how to type it was a trick question, if you answered yes you were guaranteed to get a shitty job on a working party.",
            "Sorry for your loss \n\nRip",
            "What a lovely story.",
            " Your grandfather has my thanks for serving our country",
            "This is super similar to what my grandpa did when he got drafted into the navy for WWII made him some kind of admin on a battle shit lol",
            "*HUGS!* Good stories. Sorry for your loss. <3",
            "Cool story, might be better suited to a different sub though",
            "Sounds like he was a real character! My condolences to you and your family.",
            "How could Act I have occurred safely? Was the sergeant standing downrange while your grandfather was shooting and then fired a shot in his direction to make that hole on the other side?",
            "You seem very fortunate to have had such a wonderful role model in your life. Best wishes. Godspeed Grandpa",
            "Might have been every other week.\n\nSounds like a lot of stuff I might have done to stay out of combat. : )",
            "Glad he told you of his life experiences.",
            "your grandpa sounds like one hell of an adventurer. what a cool guy and what a story. \n\nmy condolences to you",
            "That.... was the most beautiful thing I’ve ever seen.",
            "While I am sorry you lost your grandfather and these are good stories of his service to our country, I fail to see the Malicious Compliance.",
            "What a legend! I wish I had a grandpa like that! Well wishes my friend.",
            "I thought if you graduated college you were automatically an officer. The lowest ranking one, but still an officer, no?",
            "Hahahah. Your grandfather sounds larger-than-life. Fantastic story. Work smart, not hard!",
            "When my father served my country's military in the 60s they also asked the conscripts which of them were adept with a typewriter.\n\nAll the others received brooms and were ordered to sweep the parade grounds. The typists were given hoes and ordered to weed the shooting range.",
            "Your grandpa sounded like a fun man :)",
            "My gramps vs. the navy in WWII. \nHe got three days leave in a rainy northwest town. Grandma took a train to meet him and they rented a room. \nDay four he reported to the war office for his orders. Signed in, they told him they had nothing for him and to come back tomorrow. Rinse and repeat. They had a lovely time exploring this city day by day.\nTwo weeks later he got an earful about being AWOL. As he suspected but not brought up, his orders had been issued but misplaced. \nHis signature showed he had reported for duty every day, so all they could do was ship him off the next day.",
            "As a former enlisted, your grandfather is a role model to all that came after him",
            "Killer shot.",
            "I am so very sorry about your Grandpa\n\nEdited to fix an insane autocorrect hiccup..weirdness.. seriously how the hell does it manage to make entirely new words!",
            "So wholesome ❤️",
            "Good story but there wasn't any Malicious Compliance."
        ]
    }
]