[
    {
        "post_id": "t4hrj6",
        "author": "TachyQueen",
        "title": "Won’t Honor the Contract? Fine, hope you like Hot Pink Duct Tape",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t4hrj6/wont_honor_the_contract_fine_hope_you_like_hot/",
        "score": 15837,
        "num_comments": 358,
        "created_utc": 1646167243.0,
        "selftext": "Many years ago I was an elected union president at a Fortune 500 company, but I was only in charge of one contracted group. As such the bargaining power of the main company was much higher than my own, but even they couldn’t intervene too much. My groups contract switched from company A to company B in 2012, but the contract remained unchanged. Company B inherited all of the contract requirements of company A and agreed to meet them, but opted to fight me on several minor clauses when it came down to it. Most were solved without much conflict, but the major sticking point was in regard to uniforms. \n\nOur contract ensured that we were given an allowance to pay for new uniforms and vouchers for steel toe boots every year. When it came time for our new vouchers, they refused, citing that they’d given us a slight raise which should offset the cost of boots. I informed them that a cost of living raise didn’t void the portion of the contract requiring them to provide vouchers for shoes, to which they responded they just hadn’t figured out how to provide vouchers yet. After assurances they would provide the vouchers as soon as they could work it out, I dropped the issue. \n\nUnsurprisingly, months later they still hadn’t provided vouchers for replacement shoes. It should be noted that this was a very large campus and many of us walked several miles a day in these shoes, and the shoes were caked with chemicals and dirt and started to look pretty vile within a year. We had to wear the same work shoes in office areas and we had started to get complaints. I decided to lean in to this. This is where malicious compliance begins.\n\nNo new shoes? Fine. I’ll rig them up to last longer. I went out and bought several rolls of the flashiest and most obnoxious duct tape I could find. I began to “repair” holes in my shoes with duct tape and extra fabric to the point that my hot pink shoes became easily recognizable. The safety team for the main company was so amused they gifted me hot pink safety glasses and gloves to match. I also lent out my gaudy duct tape collection to any employee needing to “upgrade” their shoes. \n\nSuddenly the complaints about our dirty shoes were replaced by complaints about obviously duct taped shoes. Whenever we were asked we’d tell both union and non union coworkers that it was a small protest against the refusal to honor the shoe vouchers in the contract. \n\nThe next year rolls around and still no shoe vouchers, but suddenly our uniform allowance was increased ~$150 to allow for new steel toed shoes to be purchased. After speaking to the union members, I agreed to allow that in place of the vouchers.\n\nI kept my duct tape collection permanently on display as a threat and would use it any time safety equipment wasn’t being replaced and required “repair”.",
        "permalink": "/r/MaliciousCompliance/comments/t4hrj6/wont_honor_the_contract_fine_hope_you_like_hot/",
        "comments": [
            "I mean, they got away that first year not having to pay, but at what price? What loud, flashy, and *fabulous!!!!!* price?",
            "Way back in the day, I carried obnoxious girly pink Bic lighters, or Zippos...kept My lighters from ending in my fireklepto buddies pocket... had to hold him upside down and shake him at the end of the night...lol",
            "They still got away with not paying for your new shoes for a year though?",
            "I love that you kept your pink pair on display as a warning. Companies need reminders like that.",
            "I hate the color pink, but in this case, I fully support it!",
            "I love being in a union just for the pettiness game you get to play with management.",
            "Union, compliance, and duct tape, my 3 favorite tools.",
            "Please let us see those pink shoes.",
            "I totally assumed (you know what they say) that you were a dude and I was just imagining some man in pink work boots, gloves, and goggles doing business as usual, fabulously. I even had a MoneySuperMarket Epic Squads danceoff going through my head as I read your story. XD",
            "Ferengi rule of Acquisition #17\n\n\"A contract is a contract is a contract... but only between Ferengi\"",
            "Depending on the chemicals that were eating at your shoes, OSHA (if in US) may have been an option.\n\nAt least the safety group should have been on them as it could habe been framed as a safety issue if the chemical can eat through leather, duct tape won't be appropriate. \n\nMost companies want to screw you over using safety as a weapon, but absolutely hate when it is used back on them.\n\nSlam dunk malicious compliance.",
            "I drive buses in my state's capital city.  We were issued a staff alert last year stating we need to wear a hi vis vest everywhere in the depot, except for walking between and in the admin buildings.  I went out and bought a bright pink one, and had \"Don't hit me idiot\" put on the back in reflective vinyl.  Nowhere in the staff alert did it mention that it had to be the company issued vest.",
            "At one of my former workplaces, my safety boots started to fall apart. Noticed my boss plenty of times for a whole week, answer always was \"wait a bit more, we don't have them in your size\".\n\nSo I got equally bored and fed up with the situation. Took duct tape, taped my boots. It had a quite annoying sound every step I've made in the office of my boss. And safety guys noticed. Asked what it is. I flatly told them: \"I've been requesting new safety boots for a week now, as these are clearly unsafe. Got told repeatedly there's none in my size\".\n\nIt should be noted that in my country, companies are required to have a stock of all needed safety equipment in all sizes at all time, so they can replace broken ones. My exchange with the safety guys happened at an afternoon, at the end of my shift. Miraculously, next morning a new pair of boots in my size awaited me.\n\nThey want to avoid costs? Push the problem into the face of as many people as you can, and you'll find someone who's annoyed with it enough that you get what you need.",
            "I love stories involving duct tape, masterfully done",
            "That actually sounds like it pulls double-duty: hot pink duct tape on a piece of equipment is a gaudy eyesore for the officeworkers and business-individuals who are opposed to paying you, but they also tell your people \"this piece of equipment should have been replaced but was not, handle with care/beware malfunctions\" etc. It's like the older equipment got its own high-vis vest to warn people of the danger.",
            "I hope everyone went out and bought hot pink boots",
            "My Dad worked for the U.S.Postal Service in the 1970s and 1980s. He joined the Postal Workers Union.\n\nHe told me that every time the members voted a competent Union Representative the Post Office would promote them into management within a few months. When a Union Rep who was just killing time got elected, the Post Office would leave them there as long as the Union allowed.\n\nAfter several years at the Post Office, my Dad was elected Union Rep. He said the post office offered him promotions at least two times a month, for the next five years while he refused the promotions and stayed Union Rep until six months before he retired. He said strangely enough, the offers of promotion stopped when he stepped down as Union Rep.",
            "Nice!",
            "I think this is kinda nuts.  \nIn the UK it's a legal requirement that employers must provide all relevant PPE for the job, it's mandated by the HSE (I guess the UK equivalent of OSHA) of course it's also a legal requirement that employees actually use it",
            "As a shop steward at a place that's interested in generally doing the right thing, I appreciate the reminder of what I don't have to deal with. Solidarity and keep up the awesome work!",
            "$150 is kinda stingy for new boots.",
            "*insert wolf of wall street clap gif here*\n\nBRAVO GOOD SIR BRAVO",
            "When ever I have to “repair” a company vehicle, I use colorful, girly duct tape. Broken window? Duct tape! Work phone case cracking? Duct tape! Loose bumper/panel? DUCT TAPE!\n\nGotta love colored duct tape! A really Hard to miss “oi! This NEEDS fixed!”",
            "FYI, PPE like steel toe boots, hard hats, specific uniforms etc, is an OSHA requirement that the employer MUST pay for or provide free. Also, the second you have a hole or duct tape on PPE, it's no good and an OSHA violation.  I had a similar issue with my company years ago.",
            "For our cnc class at school we needed to buy steel toe boots. The only other girl in class besides me, ordered pink steel toe boots. All of our male teachers tought the shoes were great.",
            "When my sister separated from her then husband and went to live on her own she didn't get to take the tools along. I bought her a tool chest with €200 of tools, including one roll of hot pink duct tape (and the rest all normal). She loved it :-)",
            "Exactly ! LOL",
            "It should be noted that these boots are also equipped with nonslip coating that wears off within a year of walking around. This is an OSHA issue, if you work around chemicals that could be spilled. I admire your moxey, sir, but it burns me up that they did that.",
            "[deleted]",
            "This is an awesome story. I love it!",
            "Was this in the US? Cause their required by 1910 to provide safety shoes.",
            "....\n\n\nThis sounds *familiar*. Would that union happen to be CWA by any chance?",
            "If I had awards, they would all go to you. This is absolutely beautiful MC.",
            "they were more than a hero, they were a union OP",
            "Hilarious..\n\nDunno if someone asked already, but would love to see a picture..",
            "If you give me a raise and then force me to use it on work stuff then it's not really a raise, is it?",
            "\"Don't test me, I will make this place more _fabulous_ than a gay strip bar if I have to\"",
            "Any chance of a 'hot pink shoe' tax? I wanna see these things",
            "[deleted]",
            "This post includes two of my favorite things: malicious compliance and UNIONS getting. Shit. Done.\n\nFuck yes, madame president.",
            "Good job!",
            "Personally, I love hot pink duct tape. Just saying.",
            "Solidarity",
            "Glorious!",
            "A simple and effective protest. Nicely done.",
            "You are a god!",
            "They missed the trick my old company used. They'd replace your boots, but when they were new, it was like wearing solid plastic on bare feet regardless of how thick your socks were. It takes about 2 months before they wear in. You can wear the same boots for up to 6 months or until you tear through to the steel. We were working with steel in a rough environment and against health and safety standards to meet deadlines we climbed all over the place as well as kicking large pieces of steel into place. \n\nBy the time your boots wore in enough to not be distracting, that steel was already exposed and we should have asked for replacements. What would you go for? Safer boots? or boots you can walk in? Because every one of us opted for ones we could walk in. Which must have saved the company anywhere from 50%-66% on boots. I'm torn between them just being cheap and that being a happy coincidence and that being well considered because they're scummy with how they treat their employees.",
            "Kid Tested ...Union approved",
            "That's excellent",
            "Well done for keeping the reminder hanging around!",
            "What kind of place makes you buy your own safety equipement and your equipement in general with your own salary?",
            "Good for you Op, my son just had his toe injured by an appliance dropping on it. Steel toes not being a requirement in the US to operate a pallet jack or move >50 lbs is stupid. Im making him buy safety shoes as soon as he can try them on. (Im Canadian and its law up there at least in BC\\Alta afaik)",
            "My husband is a union president of a big pharma factory site. His malicious compliance jibes with yours!",
            "good for you. it was easier than suing.",
            "This is a great story but I don't understand why it fits this sub. Where's the compliance? Was there a rule or an order being followed?",
            "Why didn't you file a grievance?",
            "But u",
            "The company got away with it basically.... yeah this one isn't great.",
            "One whole year you went without proper shoes. And instead of encouraging your colleagues to speak up, you gave them pink tape as well? Worst protest I've ever heard about. You could have gathered your work colleagues in a fortnightly basis to speak with your manager regarding this. \n\nYou should have kept bringing it up to your manager in a weekly basis until it was resolved. Not wait a year while company gets away with it. You gained nothing your employer got what they wanted. \n\nThe rise in allowance was probably due to inflation and was due an increase anyway.",
            "Good work! Were there any injuries throughout the year due to broken-down boots?",
            "Paid for that tape out of your own pocket,  didn't you?",
            "good one dude! lmao!",
            "Respect 🙏 ."
        ]
    },
    {
        "post_id": "s1cubp",
        "author": "iamjayjayisme",
        "title": "Don't want to sit inside even though a storm is coming? Okay",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/s1cubp/dont_want_to_sit_inside_even_though_a_storm_is/",
        "score": 15835,
        "num_comments": 450,
        "created_utc": 1641907506.0,
        "selftext": "This happened to me a few years ago and I just remembered it recently.\n\n\nI was working at a restaurant waiting tables in a very affluent area on the Jersey Shore.  We had our fair share of entitled people who were under the impression that if you throw enough money around you can do whatever you want and treat people however you want.  And when your income depends on their tips, you kind of just have to deal with it.\n\n\nThe restaurant had an outdoor dining and bar area that overlooked the ocean with an amazing view.  During the summer this was pretty much where everyone wanted to sit rather than our indoor dining area.  And for anyone who works someplace with outdoor dining, you know the one monkey wrench that can ruin a very profitable dinner shift: the weather.  No matter how accurate the forecast says it’s going to be, you can never know for sure.  For the most part we never had an issue, because if it started to abruptly rain there would usually be more than enough room inside for all the people who were sitting outside to move it.  It’s usually a clusterfuck to keep track of which table moved where, but we always handled it without any issue.  Until that one day.\n\n\nWe had a large party booked one day in our indoor area that took up more than half our tables.  (a 50th birthday I believe)  So our indoor capacity was limited.  And even on top of the party, there were customers who were weary about the weather so they decided to sit inside also.  And then more and more people started sitting outside.  My manager did a quick assessment and realized that if it started raining, we would barely have enough room inside to accommodate everyone who was sitting outside.  He told us we had to stop seating our outdoor area and to start recommending to our outdoor tables to move inside because of the impending weather to be on the safe side.  (Everyone's weather app was saying there was a downpour coming up the coast).  Everyone was okay with it, except…..\n\n\nI had a table of nine people who seemed fairly middle-aged and very wealthy.  (Margarita’s with top-top shelf tequila, gaudy looking jewelry etc etc.)  Each end of the table seemed to be in their own conversation not paying attention to the other.  Upon hearing about the incoming rain, I go to the woman whom I thought was in charge (she had the fakest tan of them all), and I tell her (Lets call her Karen) “Ma’am I’m really sorry, but because of the weather coming in and our limited seating inside, I’m going to have to move you folks inside so you don’t get caught in the rain.”  This Karen is so entrenched in her conversation she doesn’t even register that I, a lowly waiter, was talking to her.  So I try again, “Ma’am I’m sorry for interrupting, but-.”  She cuts me off exasperated, “What? What are you saying?”  I begin again.  “Ma’am I’m sorry because of the weather coming and our inside filling up, we need to move you inside.  We have a table ready for you, I can move all your drinks and everything for you”  She snaps back with “The only reason we came here was to sit outside. We’ll deal with the weather”.  I realize she doesn’t grasp what I’m saying so I try again.  “Ma’am just in case the-” And then she goes from zero to a hundred and yells “We’ll fucking deal with it!”  She yelled so loudly that the people on the other half of her table heard.  They didn’t hear our prior exchange but only heard her outburst and went back to their conversation, assuming this must be normal behavior for her.  She wants to deal with it on her own?  You got it.\n\n    So I began to take their order.  Filet Mignons.  A few lobster tails.  Expensive shit.  I put the order in and I look back and all the other tables had moved inside (because they all were rational human beings) and my table of nine entitled jerks were the only ones out there.  I heard the leathery-looking Karen say to the rest of the table “Wow we have the entire patio to ourselves, what luxury”.  After a while I looked inside and saw that the table I had held for them was taken by another party that had just walked in (the last available table).  And just as the last butt hit the seat, I felt the best feeling I possibly could have felt at that moment.  A glorious rain drop tapped on the top of my head.  Oh sweet glory.  Within seconds it went from beautiful blue skies to torrential downpour.  Everyone at the table grabbed their drinks (a little watered down at this point) and ran inside.  After they shook themselves dry, they looked around and realized there was nowhere for them to sit.  Most of them looked dumbfounded, like a lost child in a supermarket.  Karen makes a b-line to me and screams “We need a table!”.  I reply, “I’m sorry ma’am, we’re fully seated and on a wait for our indoor seating.”  (Maybe one table on the waiting list, but a list is a list)  “Well what are we supposed to do now?”  she hawked back at me which led to me so eloquently saying “Ma’am as you said you would, you ‘fucking deal with it’”.  I airquoted the ‘fucking dealing it’ to really emphasize that that was her response and as I said that everyone else at the table realized that was our interaction earlier and Karen had dug their graves.  I felt bad for most of them because if they had all known the circumstances they probably would have convinced Karen to move in.  But after she raised her voice and cursed at me, all bets were off.  And as serendipity would have it, at that moment their food came out and we handed it to them.  There they were.  Nine people in damp clothes holding a cosmo in one hand and Filet Mignon in another with nowhere to sit to eat.  The rest of her party convinced her just to get some boxes for their food and pay their check and leave.   As I hand Karen the check, she smugly says “Well this will be reflected in your tip” to which I replied “Ma’am we implement a 20% tip on parties of eight or more.  It’s our policy, and it’s clearly stated in our menu”  She paid and then they left with their boxed up food leaving behind their half-full drinks.  Best $60 I ever made.\n\nEDIT:  I definitely got the numbers wrong with how much they tipped and what not. It was a while ago. All I remember was the satisfaction.",
        "permalink": "/r/MaliciousCompliance/comments/s1cubp/dont_want_to_sit_inside_even_though_a_storm_is/",
        "comments": [
            " “Ma’am we implement a 20% tip on parties of eight or more.  It’s our policy, and it’s clearly stated in our menu” \n\nWay to just stick the landing. That was so satisfying! What a great read",
            "I laughed out loud when you found the QueenBee by a tan lineup.",
            "Don't fuck with the people that handle your food. It's a simple rule and yet people seem determined to break it in every way possible.",
            "[deleted]",
            "That was a satisfying read. Well played.",
            "> Well this will be reflected in your tip\n\nAnd rightly so.\n\nHow dare you not stop the rain from falling on Karen's head! It's all your fault!\n\n... seriously, people. You need to figure out who can influence what.",
            "...and I wonder, still I wonder,  \nWho'll stop the rain?",
            "So in my younger days after a long day of drinking a few friends and I went to a BBQ place to eat and sober up it was within walking distance from where I was so it was perfect. \n\nAfter ordering the waitress says it's gonna rain and if we would like to come inside. It was way too hot in there and was giving me the beer sweats so I said I would deal with the rain it was summer after all so was hot outside too. \n\nAfter I got my food the down pour started and I just sat out there eating my pulled pork sandwich without a care in the world. Wait staff tried to get us inside but like a reluctant  group of huskies we stayed outside. \n\nAfter we were done went inside paid and gave a good tip since our waitress came out in the rain to check on us.",
            "Raindrops start falling on their heads\n\nOf course that means that Karen’s face will soon turn red\n\nNothing’s good enough, no\n\nRaindrops keep fallin’ on their heads, they keep fallin’…",
            "I had to work a shift at a high-end celebrity outdoor burger joint at the Venetian pool on the Vegas strip. We had a forecast for rain; the manager refused to let us close until it actually rained and forced me to keep on accepting tables, claiming that if I warned them then it was on them.\n\nI remember the last table that came in scoffed at my warning even as we could see the storm moving in, claiming 'we are already in bathing suits and wet, who cares about the rain?' I placed their burgers and fries down right as the downpour really started, like desert flash-flood type of downpour. Their burgers were instantly in a half inch of water.\n\nJust like I predicted, every one of my tables sprinted inside and abandoned their food and any thought of paying when the rain hit. My manager claimed it was my responsibility to make sure the customers paid and I needed to make up for it all. \n\nHe didn't back down until I finally agreed with him and stated my intention of walking into the casino sopping wet and tracking down every one of my customers and physically dragging them back to pay for their wet food. I told him I would tackle anyone who refused, as they were stealing from my pocket.",
            "I HOPE you made more that $60!!!  $300 divided by 9 people is $33/person which ordered filet mignon, lobster and top-shelf drinks.  Please tell me where I can get this kind of food for that kind of money :-)\n\n(yeah, I'm prolly the only one doing the math here)",
            "The numbers don't really mean much at this point, it's the satisfaction that counts.",
            "I can't believe you airquoted 'we'll fucking deal with it'. Or I should rephrase, I do believe it, but it's awesome :D",
            "“We have the entire patio to ourselves, what luxury.” I can’t quite explain why, but this right here gets under my skin SO MUCH. Spoken like a true entitled piece of shit. \n\nNice work, OP. You did everyone a favour that day.",
            "9 people drinking top shelf and ordering filet mignon and lobster tails and their tab was 300$? They got off easy...",
            "One of the best, purest MC's I've read. Congrats!",
            "I'm glad that this worked out for you. Did she make the threat, \"I won't ever come back here again?\" Cause I'm sure you would be thinking, 'don't threaten me with a good time,' hehe.",
            "When he wanted to move her party inside, it would have been so easy for her to say \"We're not sure the rain is going to come before we're finished, can you hold that inside table and let us stay out here until it rains? We'll deal with it and bring our food in if it happens. And yes, this will be reflected (positively) in your tip!\"",
            "Nine people eating like that for only $300? Top shelf tequila, lobster tail and all? Must have been quite a few years ago",
            "How is that only $60? \n\nYou're telling me 9 people's drinks with top, top shelf liquor and 9 entrees of filet mignon and lobster was only $300?",
            "Leaving with wet clothing as well I can bet none of it was going to survive that night without being ruined as well.",
            "Thank you for sharing that hilarious story. My sides hurt from laughing so much :D",
            "You can't put a price on satisfaction. 1 or 100... that satisfaction is worth more and lasts so much longer than the money.",
            "As someone who works in the restaurant industry and has to deal with these types of people daily, take my Silver",
            "This had me laughing so damn loud! I would have paid money to witness this debacle firsthand. Way to go OP, stand your ground and give them exactly what they asked for! 👏 I hate entitled people!",
            "Fucking nice",
            "Be serious, there are no affluent parts of the Jersey shore. Bunch of grease balls with bad spray tans and alleyway plastic surgeries.",
            "r/TalesFromYourServer would love this",
            "I love that you weren't afraid to repeat her words back to her, with air quotes and everything. Keep up the good work OP",
            "Beautiful malicious compliance. Would have relished responding to her bitching about the tip with another \"As I recall you reminding me more than once. You 'fucking deal with it'\"",
            "I would say the only thing I would do differently is address the whole table, not just one person.\n\nI mean, other than that, this is just perfect. I always detest people like this. Just that whole attitude, fuck them.",
            "I would love to be a fly on the wall to hear them all tell her she's a rude count and needs to stop being one.",
            "That was SO satisfying to read",
            "This was glorious to hear. \n\nI worked at a fancy outdoor restaurant/vineyard in the middle of nowhere of the Midwest. Thank goodness nearly every person I served was kind because I could never have imagined of the situation working out as perfectly as it did for you. This sounded like an absolute dream, and on behalf of all restaurant staff across the globe, you're doing God's work and we thank you",
            ">\\[…\\] fair share of entitled people who were under the impression that if you throw enough money around you can do whatever you want and treat people however you want.  And when your income depends on their tips, you kind of just have to deal with it.\n\nSadly this basically means they were kind of right with their impression to some degree. As much as I hate it...",
            "> “Well this will be reflected in your tip”    \n  \nWhat, her shitty behaviour, or her inability to grasp the consequences of her actions? The world is truly better without some people in it, and I hope she sees my comment and realizes that I'm convinced she's one of them.",
            "Great mc! I'm glad you fed her the words she so rudely screamed at you.",
            "As a European, American tipping culture just doesn't make any sense. If you do a good enough job, your employer should reflect that on your wages. Why would a customer be forced to compliment an employees wage? It sounds like a socially accepted form of scamming.",
            "Thought you should know your story was sort of stolen. \n\nhttps://www.boredpanda.com/dont-want-to-sit-inside-storm-coming-reddit/?utm_source=google&utm_medium=organic&utm_campaign=organic\n\nShe does mention you but only once. Do cheers. \n\nGreat story BTW. Loved it and love that part “A Cosmo In One Hand And Filet Mignon In Another”",
            "I read this and thought of Mccloones, but not sure if that's fancy enough.",
            "Excellently played!\n\nYou turned that Karen into a stand-up citizen.",
            "God, nothing would ever feel so good to say as that last sentence... good for you.",
            "That uplifted my soul. Thank you",
            ">Nine people in damp clothes holding a cosmo in one hand...\n\nA cosmo, huh...local police love to nab drunk drivers...",
            "When I read the \"we implement a 20% tip\" bit, I was thinking it was code for \"Bad attitude fee\", until I read on.",
            "The minute she said “we’ll fucking deal with it” she and her entire group should have been asked to leave.  But this was a great malicious compliance",
            "That 20% at the end. *(chef kiss)*",
            "I find it funny that people think they’re “wealthy” but but a house at the Jersey Shore.",
            "As someone who’s been serving for 15 years, this story makes me smile so much",
            "Oh man I think I’m hard",
            ">“Ma’am we implement a 20% tip on parties of eight or more.  It’s our policy, and it’s clearly stated in our menu”\n\nAmerican tipping culture is so fucking dumb",
            "Was this at the Windrift in Avalon? \n\nGreat story and well played.",
            "Glorious!",
            "So...help a girl out to get the right accent while reading this...was Karen a \"Bennie\" or a \"Shoobie\"?",
            "This screams Mcloone’s haha. Love the waspy Monmouth County crowd.",
            "EFF that ho, take your food and go!",
            "I'm sharing in your satisfaction with this story! 😀",
            "Weary. Wary.",
            "Man, patio seating. There was a place here that had patio seating that was never used because it looked out on a gray parking lot but they still opened the umbrellas daily. One day I go to grab some togo food from there, completely unaware a storm was coming. Apparently the restaurant didn't know either. Within the 2 minutes I was inside picking up food, the weather went from normal to feeling like we were inside a tornado. The umbrellas were still open. The waitresses ran out trying to close them but they lost a few umbrellas that day. One took off across the parking lot as a waitress chased it, she gave up as it went over the train tracks across the street and into the houses. Another umbrella must have had a hit out on me because as I was leaving, I'm halfway across the parking lot when another waitress screamed. I turned around to see an umbrella pinwheeling towards me and jumped just in time to avoid my legs being taken out by the post. My car didn't fare as well as I did.\n\nI just immediately left once I got in the car, it wasn't safe to be there with rogue umbrellas flying around. Tried to drive the 2 miles home but had to go slow because several garbage cans and even a bush flew out into the road in front of my car. Saw a trampoline rolling down the side of the railroad tracks. Best part was the whole thing lasted 10 minutes. Just complete abrupt chaos.",
            "I'm sure it's not the same place you're talking about, but I've seen the same situation play over so many times at On the Deck in NJ 😂",
            "GOOOOOOOOOOAL!!",
            "Hot damn, I love a story with a happy ending",
            "\"A glorious rain drop tapped on the top of my head.  Oh sweet glory.\"\n\nThis is poetry...",
            ">I felt bad for most of them because if they had all known the circumstances they probably would have convinced Karen to move in.\n\nMust be the nasty part of me, but no empathy for anyone in a vortex like that. That's not her first \"I rule the world\" grandstanding rodeo nor will it be the last until she is left in the tanning bed too long and splits like a hot dog",
            "Instant Karma is a bitch.",
            "This sounds suspiciously like my ex-MIL!",
            "I was and am in a different economic class than these people, but years ago, I stopped dining with a lot of acquaintances for this very reason--turning reasonable requests and attempts at good service into pissing-on-the-peasants sessions.  What is so difficult about treating people who are trying to help you with a certain amount of respect?",
            "Karma is one satisfying bitch.",
            "Why didn't you call for the table's attention insted of only one person attention?",
            ">“Wow we have the entire patio to ourselves, what luxury”\n\nit's at this point the rest of the group should have been asking themselves \"why?\"",
            "20% = $60\nSo total bill was $33/person for top top shelf tequila drinks and steaks and lobster? Wow",
            "Where are you that top shelf tequila margaritas, felt mignon and lobster tails are only $33 a person?",
            "Fucking a",
            "Could this have been Stone Harbor, or perhaps Avalon? 😊\n\nWe frequently vacation at the Jersey shore, but in more humble towns like Sea Isle City. No (or much less) entitled attitude!",
            "shouldn't have told her about the mandatory tip, they might have given you a few extra bucks thinking they were stiffing you.",
            "What exactly would be reflected in the tip? Ooh I was a shitty self important bitch so because of that I'll tip you less?",
            "Man I listen to these malicious compliances on youtube all the time and totally forgot that I, a redditor, could simply join and read these hahahaha. This is just...delicious. *\"cosmo in one hand and Filet Mignon in another with nowhere to sit to eat\"* sent me to an early grave no lie. This damn sure was the beat $60 you ever earned!",
            "There’s an article with your story in it\n\nhttps://www.boredpanda.com/dont-want-to-sit-inside-storm-coming-reddit/?utm_source=google&utm_medium=organic&utm_campaign=organic\n\nI found this as a little google articles for me",
            "Forced tips are the scum of the earth",
            "That's \"wary\" of the weather, not \"weary\" of the weather.\n\nGreat story. Most people are too afraid of losing their jobs to treat such people as our Dear Karen in such a clearly just manner.",
            "I'm going to have to argue with you on one tiny detail. They left behind half empty drinks not half full as they had been in the process of emptying them not filling them.",
            "I can’t wait for your next NOVEL!",
            "My friends lived in some condos on the 2nd floor just across from a place like this on the shore. One day we were visiting and we brought spaghetti and meatballs. Their kids ate on the patio but the youngest was not a fan of meatballs- instead of just leaving it on the plate she chucked it off the balcony/patio.  About 5 minutes later the cops showed up with a big hair Benny lady- apparently the meatball hit her and she wanted justice. My friends had to apologize to this seriously mad lady and the cop who was struggling to keep a straight face when he learned the offending projectile was a meatball thrown by a cute little 3 year old girl.",
            "[deleted]",
            ">EDIT\n\nWhy did you capitalize this?",
            "\"there were customers who were weary about the weather\"\n\nThey were tired about the weather? I can understand that actually, 'cause I'm fucking sick of this whole warm weather crap. where's my gd snow? it's supposed to be the middle of winter here and I'm barefoot hanging out in the yard. major feels, my dude.\n\nUnless you meant they were *wary* about the weather, in which case, yeah, I'll start to get twitchy about it too, in another month or two when tornado season kicks up.",
            "I’m assuming Monmouth County?",
            "That was a great read!",
            "> leathery-looking Karen\n\n&#x200B;\n\nLOLOLOLOL",
            "> All I remember was the satisfaction.  \n  \nNice",
            "This is some good shit",
            "Sounds like long branch NJ :-D",
            "That's really funny.\n\nCustomers are the worst!",
            "Entitled are they.......you are also entitle to get rained on!",
            "This is the first time I’ve ever appreciated an included gratuity.",
            "I'd sit in HR while doing it.",
            "As a former server, this was so glorious I had to immediately read it a second time.  So good.  Thanks!",
            "Get rekt Karen! 😂",
            "I think this is the first time I actually laughed out loud from a malicious reddit story.",
            "$33 a person for drinks, filet mignons? What a steal.",
            "That was an extremely satisfying read, well done.",
            "What a C word. Well done OP.",
            "Really stupid on their part. Anybody who vacations down the shore knows those storms move in fast. LOL we weather watch on LBI every summer. Mmm now I’m craving lobster bisque from Howard’s and some shrimp from Pinky’s.",
            "This sounds like a Martels tiki bar story!",
            "Glorious! \n\nfeelsgoodman.jpg",
            "She watered down her own drinks and fun.",
            "Why didn’t they just sit at the bar? Easy to double row people there..",
            "All I know is at the grocery store Filet is $25/pound.  I can't imagine what a restaurant charges.",
            "Nothing beats the weather for sudden ferocity than the North Atlantic. It can go from sunny to deadly like the flip of a switch. Anyone living along the coat  with more than 2 working braincells knows this. Clearly Karen left her spare brain matter at home! (Lifelong Bluenoser)",
            "This story just made my day. Sometimes karma comes through in the most delicious and delightful way . .",
            "We've all met this woman.  She is a VERY IMPORTANT VP of Marketing for a software company.  She enjoys hiring unpaid interns to torture and has a handshake like a vice.\n\nShe is extremely sexually frustrated.",
            "Oh Man, I love it. The tip was the icing on the cake",
            "Ate without table -3",
            "An outright ban might have been in order.",
            "Classic Jersey. Fuckin dickheads",
            "Beautiful",
            "You monster!  How dare you do that to rich people?!  hehehehheeheh!",
            "If this sub had a best MC of the year award I'd nominate this one.\n\nThis one truly embodies the spirit and essence of MC.",
            "That was worth reading aloud to hubs!",
            "Jersey shore summer storm. I'm guessing your guests weren't locals.",
            "What did she say when you quoted her?",
            "When I read the title I thought it was going to be about children that wanted to play outside not adults at a restaurant",
            "Wow that was brilliant,  well done op. Thank you for posting that. 💖",
            "Ocean Grove, Sea Isle City or Asbury Park?",
            "This was so delicious.",
            "Feel good Story.\n\n\nBut how the hell you implement tip? It is nothing you can add automatically, is it?",
            "I grew up in a very affluent area of the Jersey shore and I am so curious as to what restaurant this is! I also worked in the industry there so I know the boss-level Karen’s you must have experienced",
            "That’s awesome!",
            "this is beautiful !",
            "Proud of you for quoting her back, language and all.  Very few things in life are worse than entitled Karen's getting away with it.",
            "\"We had our fair share of entitled people who were under the impression that if you throw enough money around you can do whatever you want and treat people however you want.\"\n\nSeems it's not just an impression, as per your very next sentence: \"And when your income depends on their tips, you kind of just have to deal with it.\"\n\nThis tipping culture sucks!",
            "\"Oh sweet glory.\" Love it when outside forces cooperate with MC.",
            "Oh the beauty of a story of pettiness.  You the imagery? It was like I was there, watching you do your job, following instructions to the letter. Chef’s kiss!",
            "@op bored panda is monetizing your story https://www.boredpanda.com/dont-want-to-sit-inside-storm-coming-reddit/",
            "Hey, I found this post because there are like 5 different websites publishing it now... Don't know if you care, but they are also butchering your story trying to paraphrase it",
            "Sounds like BS. The math doesn't add up. A group of 9 people drinking top shelf and eating filets only runs $300??? I would expect at least $100 per person, and that is where cost of living is a lot better in a \"flyover state\"!!  Even at $50 per person you're at $450 total...\n\nGood story tho.",
            "sometimes mother nature dishes out the karma.....\n\n&#x200B;\n\nBUHAHAHAHH"
        ]
    },
    {
        "post_id": "9l2lh4",
        "author": "mouseasw",
        "title": "I'm not allowed to shoot back at night snipers in Vietnam, but I am allowed to launch a flare to illuminate the situation? OK.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9l2lh4/im_not_allowed_to_shoot_back_at_night_snipers_in/",
        "score": 15824,
        "num_comments": 776,
        "created_utc": 1538583242.0,
        "selftext": "This is a story from my father, who was an American grunt in the Vietnam War.\n\nThis was during one of his assignments in/near a Vietnamese village. Because they were trying to avoid killing the local civilians they had orders expressly prohibiting them from shooting back (maybe just at night?), and the guerrillas knew about it. So every single night the guerrillas would climb up on rooftops in the village and take pot shots at my father's group.\n\nNow, because the guerrillas were effectively using the civilians as a shield, the men weren't allowed to shoot back. They were, however, allowed to launch a flare, which would light things up enough that the guerrillas didn't feel safe continuing to shoot at them. But the shooting would start back up again the next night.\n\nOne night my father had had enough, and he had a devious idea. When a sniper started taking pot shots that night, he immediately launched a flare. Horizontally. Right at the sniper.\n\nHis commanding officer reamed him for it, but after that the night-time pot shots stopped.\n\n(Edit: for clarity)",
        "permalink": "/r/MaliciousCompliance/comments/9l2lh4/im_not_allowed_to_shoot_back_at_night_snipers_in/",
        "comments": [
            "If you weren't expecting it, being on the receiving end of that would probably look like a missile or RPG heading your way.  ",
            "[deleted]",
            "I’m surprised he obeyed orders honestly. My great uncle was in Vietnam (interred at Arlington) and when I interviewed him in elementary school for class he was really upset with how our books portrayed the war. I asked him, “How did it feel knowing you couldn’t shoot someone unless they shot first?” And he said, “Who told you that crock of shit? We didn’t care if they were a four year old child if they had a gun within arms reach they got one between the eyes. It was war!”\n\nMy teacher did not let me read my report for the class and I learned a lot of new swear words. My mom was not happy with him.",
            "Seems like a thing that could be explained as a fortuitous accident.",
            "My brother told me a story from his time in the USMC back in the 80s. His battalion had just rotated back from an overseas \"peacekeeping\" duty in Beirut where many of their friends did not make it home after a terrorist car bomb hit their barracks. Some genius in command then decided that these battle-hardened, homesick, grieving Marines should go to urban combat school at Camp Lejeune, NC.\n\nSo these guys are already half-crazed, it's hot as balls, and now they're doing some chicken-shit training for the shit they just _came_ from. Some of these Marines got pissed off when they \"lost\" a simulated engagement, and that's when they started shooting flare guns at each other.\n\nHe said only one had to go to the hospital though, so it was like a normal Tuesday or something.",
            "I can only imagine the bricks that were shit by the guerrilla's taking potshots... could probably build a small house with em!",
            "Incoming fire has the right-of-way",
            "This reads like a readers digest submission. ",
            "And that kids, is how the Pyro class was started.",
            "Call of Duty: Modern War-Flare\n\nLove it. :) Your dad was awesome!",
            "*Fortunate son heard in the distance",
            "That's one way to get around it. ",
            "Did it ever escalate with that village? Or was that the last of it?",
            "That’s worse than shooting I’d think. Can sort of aim a gun with a little more accuracy and it’s not gonna burn the civilians house down. ",
            "Yes. Flare guns are good. In 1970s America they were a sort of dirt cheap firearm you could legally buy and carry in your car for various 'contingencies'. I discuss such contingencies in books about my real life youth in those days. :-)",
            "\"WHAT ARE YOU DOING SOLDIER?\"\n\n\"IM LIGHTIN HIS ASS UP SARGE!\"",
            "\"Malfunction, sir!\"",
            "Disproportionate response. That was what it was.\n\nMy old man is a Vietnam vet. (Marine - Combat Engineer)  He told me about one time he was on patrol in the jungle. It was a long line of heavily armed young men. Just within shouting distance of each other. They would slowly walk through the jungle... Until they heard a single shot fired. Then they would all fall back. Then they would spend the next 60 minutes firing every gun into the forest while a different squad would launch mortars.\n\nSo many forests, jungles, and *mountains* were **flattened** in that manner.\n\nThat's why they weren't allowed to fire back.\n",
            "r/tf2\n\nSeems perfectly normal to me",
            "Would they have been allowed to shoot back if the snipers aimed at them instead of the pots? ",
            "Am from Nam. This story made me laugh and feel annoyed at the same time lol",
            "Then the planes came in and napalmed the town. ",
            "This is beautiful",
            "If it was a white phosphorus flare he should have been more than reamed out. To use white phosphorus in any way other than as a flare, say shooting it at someone, could break international wartime law IIRC.",
            "If memory serves me right, this is a grey area close to a war crime.",
            "Isn't that how the My Lai Massacre started?",
            "I haven't played TF2 in way too long",
            "Yeah shot the civilians in the day, much easier right?\n\nEdit: *sarcasm",
            "There are fake sounding stories, there are reasonable, everyday stories, and then there's this awesome shit.",
            "I love when posts on this sub are tagged as small but are still great.",
            "Funny, that reminds me of a story my grandfather told me. So my grandfather was a sniper for the Vietnam war and he said they knew that the US couldn't shoot back at them so he took pot shots and one day, they shot a flare at him! \n\nHe said it almost hit him. So after that they knew that they were allowed to shoot flares so they went to a different position.\n\n/s",
            "And thus the Viet Cong were prevented from overrunning America",
            "\"come here son, did I ever tell you about the time I did war crimes? \" ",
            "Next time try not invading someone's country and attacking their people, and you won't experience armed resistance. ",
            "Hope it wasn't willy pete.",
            "A new definition for \"the light at the end of the tunnel\".",
            "If you have the time, watch Ken Burns Vietnam documentary. It’s fucking harsh as hell but incredibly made. ",
            "The rules of wars don't totally prohibit the killing of civilians if there is a military justification for opening fire, you know, like if you're being shot at.  Plus the US and other allied forces would bulldoze Vietnamese villages that were near their bases to stop what you claim happened. \n\nSounds like a bit of a bs story.  ",
            "Technically following orders while also technically disobeying them. Depends on the definition of launch vs shoot. ",
            "His CO probably gave him the \"I'm yelling at you because I have to\" look and everyone read it as such. \n\nAnd then later his CO brought him some beer or weed. ",
            "Was your dad stationed anywhere near the log ride?  We had a sweet rollercoaster but all we ever wanted was a log ride.",
            "did US win tho",
            "[deleted]",
            "This sounds like something out of a movie. Respectfully not buying this one. Cool story though.",
            "> The US intentionally targeted and massacred civilians the entire conflict\n\n> but MY DAD, specifically, had specific orders not to\n\n[x] Doubt",
            "Your uncle is murderer lmao great story",
            "First thought. Did it burn down the building the sniper was on?",
            "For everyone who is interested in the history of this post, check out the ken burns documentary on netflix. I just finished it, it was great.",
            "How'd he know exactly where the sniper was to hit him?",
            "Imagine the flare landing on the rooftop next to the sniper...   \n  \n  \nThe whole village on flames. Dammit.",
            "This is as cool as fuck. Does anyone have any other sub Reddits or places with more stories like this?",
            "Your father is a genius.",
            "Make sure you post this to /r/militarystories . They'll love it.",
            "To be fair, shouldn't have been in Nam. "
        ]
    },
    {
        "post_id": "l7hezb",
        "author": "KiKi_BTW",
        "title": "New HR manager pisses off hardworking employees. Mass malicious compliance.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/l7hezb/new_hr_manager_pisses_off_hardworking_employees/",
        "score": 15818,
        "num_comments": 432,
        "created_utc": 1611889670.0,
        "selftext": "Years ago I worked for an awesome company that understood workplace culture and fun was a huge part in keeping employees happy and productive. \n\nIn our office, people would often cycle to work and therefore needed to shower and get ready at work. That meant that sometimes they didn’t get to their desk until after 9am, however nearly everyone worked back without being asked to deliver on deadlines. \n\nManagement didn’t care because they knew the work was being done and everyone always went over and above. \n\nEnter new HR manager, we had never really had one before but were growing so needed one. Within her first few weeks she sent out an email saying that everyone needed to be seated and ready to go at 9am and that we needed to stop having social chats and getting ready at work, or if we did, do it earlier. She never acknowledged the fact that everyone put in unpaid overtime. \n\nCue mass malicious compliance. Everyone would start at 9am as per email and then leave at 5pm. Projects started running behind and clients started getting pissed off because their product was not being delivered on time. \n\nNew HR manager was confused as to why work was not being delivered on time anymore, people were starting on time! She made sure of it! \n\nNeedless to say, upper management removed the rule and she quit shortly after. \n\nWe all went back to our normal ways and would you know it! Projects were back on track. \n\nDon’t walk into a new company and try to change something that isn’t broken. The people will revolt.\n\nEdit: this was my first post and I didn’t think anyone would see it! \nI want to clarify that OT was never expected or forced upon us but due to awesome management, cool projects and great perks we didn’t mind when we did do it.\n\nEdit: I see a lot of people confused about why HR would be involved with such matters. In smaller companies in Australia, HR oversees a lot more than the usual. It depends on the company really, and this company was approx 50 people.",
        "permalink": "/r/MaliciousCompliance/comments/l7hezb/new_hr_manager_pisses_off_hardworking_employees/",
        "comments": [
            "Best department manager I ever had came in and when asked what he was going to change he replied \"I'm going to spend a month seeing how things run. Then we'll expand upon the good and fix the bad.\"",
            "I have been in the military 23+ years now, and have grown accustomed to frequent changes in leadership. The good leaders always come in and observe for a time, only changing things that are blatantly wrong, against policy, or negatively impacting performance. After observation time they will .make adjustments where needed. The bad leaders come in like a drunk uncle, flipping tables and making unnecessary changes just to make the point that they are in charge and everyone needs a wake-up call. These types of leaders only kill morale and performance in the end.",
            "I worked for a big company that was run like a start up.  There was a huge emphasis on our customers and supporting them, and doing what was needed to make sure those customers were successful.  \n\nIt was high pressure but paid really well, was filled with scary smart people and was usually a fun place to work.  We did what was needed with few barriers, and it wasn't unusual for a VP to get a call from a front line worker trying to fix a problem.\n\nThat all changed when they brought in a HR director from an old style telecom company.  She instituted rigid processes that could not be bypassed and things that could previously be resolved with a single call required following the chain of command.  That chain of command routinely refused to deal with problems and things that could previously be fixed in a week simply never got fixed.\n\nWithin months the entire company took on the characteristics of a stodgy old telecom, and although the pay remained the same the pressure increased, the fun evaporated and it became a difficult and frustrating place to work.\n\nI wish I could say the HR director was forced out, but that didn't happen.  Instead people left in droves and the place is a shadow of what it once was.",
            "I worked for a very small company that had an unlimited vacation and sick time policy. If you wanted or needed time for anything, you just told the boss and took it. The company had like 8 people and we all really loved our work and worked overtime more or less constantly and didn't take much time off (I don't think I took a sick day the entire time I worked there - I could work from home so if I had a cold I'd just sit at my desk at home and work), so this really wasn't a problem. I'm sure the boss would have made the policy more strict if there was a problem.\n\nAfter 3 years with the company, during which time I'd only taken a day or two off around thanksgiving and christmas, I took a 2 week vacation (with my boss's approval), during which time I took my close friend of 30 years on a 4 day trip to Las Vegas, spent a week with my aunt (who I hadn't seen for about 15 years) in San Francisco, and attended my best friend's funeral. (That wasn't planned, he died of a heart attack while I was in SF.)\n\nThe HR guy was \\*not pleased\\* that I'd been away for so long. He immediately emailed everyone a policy that all time off had to be approved a month in advance by him and specifying a rate of accruing time off so we'd have a limited number of days off per year.\n\nEveryone  said \"yeah right!\" and ignored him. He discovered the hard way that he actually had no power over anyone.",
            "IMO, HR department must keep people motivated, with good health and happy, unless you want high rotation or run a sweatshop...",
            "Amazing how treating workers as if they are actual human beings gets better results.\n\nHope she's out there somewhere being condescended to by Karens on a daily basis now.",
            "I used to work in a support department in the UK and would regularly leave a hour or 4 after my shift when I was working on customer tickets and/or calls. We had a rule that we answer the phone up until the last moments of our shifts. Trouble is that a call might be 2 minutes or 4 hours. You just never knew.\n\nOne day I was 4 minutes late logging into the phone system as I was as early as I normally am and my archaic PC took forever to boot. Well I got written up and I signed a chit saying that I should be at my desk and ready to work at 0700. \n\nI suggested that my team leader and myself should review all the door swipes for the past 12 months and work out how much time I owe them...or they owe me. \n\nI offered to pay anything I owed as long as they pay me anything I was owed... not much was said about those four minutes after that.\n\nWhat annoyed me was that I was at my desk on time, but the crappy workstation took a while to boot and log in..  We asked for new equipment and was told that they are waiting for \"prices to go down and specs to go up\" which means nothing! They essentially wanted me to come in early to avoid spending money on kit upgrades.\n\nSorry to rant.. I just hate the entitled attitude from managers who would rather spend my time everyday rather than fixing issues.",
            "I've seen very similar malicious compliance in response to attempts to crack the whip on start times. While there are situations where widespread tardiness can become a problem, there's not *usually* a compelling reason to nickel-and-dime most white-collar/knowledge-worker type roles on start time if they're performing fine.",
            "In 2019, after many years working in manufacturing environments, I got a job as a drafter. In an office. I dress nice, work in the climate control, go home approximately as clean as I showed up. It's weird. \n\nAnyway, I'm running late one day. I'm supposed to be there at 8 am, looks like I'm going to be 5-10 minutes late, not calling in for this situation was an *unforgivable sin* in pretty much every previous job I had. So I call the boss critter, tell him what's going on (He sounds asleep) and he says \"Ok, we will discuss it when we are both at the office\". Well. New boss is a hardass I suppose. \n\nI showed up around 8:10, boss man rolls in around 9. Comes and gets me. \"Lets go to my office. Close the door behind you.\" Gah. And he sits me down and explains to me that being a few minutes late, or even an hour late, doesn't matter. At all. He just says he needs the work done, and that the *office* opens at 8 am, that doesn't mean I *need to be there* at 8 am. \n\nAlmost 2 years later I'm still not used to it. But I haven't woke my boss up to tell him I'll be late again.",
            "There used to be a really good private golf course in the northern Twin Cities that ran really well. Busy with banquets, good usage of the club dining facilities by the members, etc..then a new F&B Director came aboard and ruined it. I mean, he ruined everything by not seeing what was running so well but changing everything to how he wanted. The long term staff was let go and the members were not happy. He lied to people, treated the staff like crap, and just made work miserable. The GM was not innocent because he made a horrible hiring but would never admit to it so he let it all be. F! you to Brent and Alan!",
            "Best new manager I had chatted with each staff member individually and found out what they enjoyed and what irked them about work and the work place.\n\nHe also asked what one thing he would like us to do to make the physical environment better.\n\nWithin three months we had a ramp for disabled and pushchair access, film on the windows to stop the searing heat from the sun, working air conditioning and toilets that didn’t make you wretch.\n\nHe also changed working practices as well.  One thing we did was to job shadow someone else.  We then understood each other’s roles and responsibilities and made improvements.\n\nThe guy was amazing.  He got everyone on his side and he still spoken about In revered terms.",
            "I had an office supervisor that when a three day weekend was coming up, he would lean back in his chair and say that he wasn't feeling it. It was always around 11 o'clock and we still had at least four hours left in our work day. He would walk out for a few minutes and then walk back in his office and walk out with his bag. So this meant that if we were caught up on our projects or were at a point that they could be done by 10 o'clock on the following Tuesday, we would get an early start but all we would have to do is give him a 30 minute head start and one by one, we could leave. We had six guys in our office and there was other six guys in an office down the hall. We would call one of them and just say that \"We are clear.\" So 30 minutes later, half our parking was empty.",
            "Best description I've ever heard of these type of managers are \"Seagull Managers\"\n\nThey swoop in. Do a lot of squawking. Leave shit all over everything. And usually fly out just as quick.",
            "When I first became a manager, I saw the HR book as a guide on how to achieve results. If someone was breaking our attendance policy and had poor performance, the textbook comes out. Followed by a discussion on what they can do to improve their attendance and therefore improve their performance. \n\nI managed this way for about 3 years until I got a new boss. Now, the book was our guide to make sure no one claimed we were being “unfair.” Mind you, in these three years I only ever had ONE person claim I was unfair - and it was someone who fell asleep first day on the job and was therefore fired. Not anyone I actually worked with and developed a work relationship where it was clear the better the performance the looser the oversight. I ended up having MORE complaints when I brought out the rule book for EVERY SINGLE THING.\n\nIn our store, 5 absences without sick time to cover and you get a write up. I had one woman who EXCEEDED expectations on attendance for years, but nevertheless had to write up when she had health issues complicate her attendance. \n\nHowever, the DM’s MOM (DM being my bosses boss’s) worked for us. She missed 13 shifts without coverage and I was told not to write her up. This direction wasn’t by the DM, it was my boss. When I eventually spoke up - he was SHOCKED to learn she missed so much time. My boss even once said “I think we should send DM’s Mom home, she looks so sick.” When I, myself, had been told leaving sick any day I could physically be at work reflected I didn’t take my job seriously. \n\nThis once was a job I once *loved* with a staff that actually respected me. By the end of it, I was worn down, coached out of my own personality and compromising my own ethics and integrity for what I can only describe as a corporate monster.",
            "It’s amazing how well a company can run when it’s employees are actually happy",
            "I guess I always thought of HR as the people who do hiring, pay you, take care of benefits, and when necessary firing. Why HR would be the people micromanaging the day to day makes zero sense to me. That's the manager's job, and that stuff should be dealt with in a team by team basis, especially since some teams may upstate differently than others.",
            "> Don’t walk into a new company and try to change something that isn’t broken.\n\nUnfortunately, that goes against the management mindset:  when a new manager comes in, in their minds they can't just maintain the status quo because (a) they get no visibility that way and (b) their bosses might start to wonder why they were hired.\n\nSo (s)he immediately identifies what was \"wrong\" with the previous person's management style and points out how only (s)he can solve it.\n\nThis mindset becomes more pervasive the further up the management chain you get.",
            "Biggest mistake of “new management” is thinking you have to leave your mark right away. Based on how you tell it this may not have been what she was doing but being unable to see what was working is always going to be a problem. On the other side if shit isn’t getting done something definitely needs to change, sometimes it’s not always the right thing and that’s where I feel a lot of stories of this sub stem from.",
            "\"The employees are revolting!\"\n\n\"Yes, thats because you won't give them enough to shower after cycling to work.\"",
            "Good managers manage output. Bad managers manage input.",
            "Not an unfamiliar story to me. I worked in business in management and then in management consulting for 35 years, engaged in depth with over 200 companies. In my observation, when HR stuck strictly to the legalities, its impact was more or less positive. When HR was permitted to roam far and wide and take upon itself (as in this noxious case) bogus authority, bad things ensued. This happens, I think, because a) some HR are drawn to HR because they see it as a shortcut to power (i.e. without having to prove themselves and work their way up), and b) certain (NOT all, but some) top- and executive-managements, being essentially cowards and lazy entitled fuck-offs to boot, are happy to hand over to HR the authority to enforce bogus by-the-book nonsense without regard to the bigger more strategic picture that they (i.e. top- and executive-managements) are at least in theory responsible for.",
            "Worked in telesales back in the late '80 early '90s. middle sized double-glazing firm. Happy bunch of 8 tele-marketers. New Marketing manager started. He had a great idea for motivating us... mirrors! We normally sat in individual booths, 4 on one side of the room, 4 on the other, backs to the opposite booths.\n\nHe decides to put up 1 foot square mirrors in front of each person so that we should look at our own faces and 'smile' as we talked to potential customers. The reasoning being that our 'smile' would come across in our voices and we would sound happy and trustworthy to the callee. \n\nGlitch was we could see the faces of the people on the opposite side of the room. This was an entirely novel situation. Naturally, we regressed to being schoolchildren. We spent so much time trying to make the person opposite laugh that our call rates plummeted.\n\nThe following week the mirrors were gone.\n\nHappy days.",
            "Part of the issue is that she was HR, not anyone's supervisor.  She should have had no business telling anyone when or where to be.",
            "> upper management removed the rule and she quit shortly after.\n\nIn touch management would have shut that BS down the moment they got a whiff of it.  (Or in my case I'd would tell the HR person should just part ways as not a good fit, and then apologize to the crew.)\n\nSeriously, this stuff can kill the momentum of a small company, when people are really invested...into (intentional) cogs just doing the motions.\n\nSure you have to deal with issues, but until something becomes a pattern of being a demonstrable repeating problem -- don't change crap for the worse (for employees).  (Schedules do really matter when say, you have a 24/7 shift team, and people rely on others to get in on time so they can leave, etc.)",
            "In my experience, when employees are given more free time, they end up working more. In my previous company, the norm was to immediately go home on \"planning day\" once all your meetings were done, even if it was still lunchtime. On some days people would work 4 hours, on others they'd be there for 12, most of the time for free. Everyone including managers even openly discussed when they would use their \"sick leave\" instead of their vacation leave and to schedule all or \"sick\" days so we don't conflict with each other. And outside of managers dealing with demanding clients, no one was stressed. Sometimes I wish I was a psychologist so I could study this stuff",
            "So the company successfully got you to continue donating free time?  This is a story about wage theft",
            "[deleted]",
            "How stupid do you have to be before starting a new role/job and not assessing the way things are working before you see if you can improve them!",
            "Working unpaid overtime is crazy IMO. If a company has so much work it requires o/t it should be able to pay.",
            "I had a manager (who was also the owner's nephew) who was pissed off at the fact that we would take our laptops to the garden and work from there instead of at our desks. Told everyone to sit at their desks from 9-5. Morale dropped quite rapidly. He didn't understand why projects were late or of poor quality. Owner stepped in. Let us do what we used to do. Nephew quit. Said \"This nursery school you are running will fail\". Company bought by bigger company and all our salaries nearly doubled in 2 years.",
            "I have never been able to understand why new people or companies coming in will try and make changes without talking to the feet on the ground, the people who actually do the job that can tell you how it is without blowing smoke up your arse. They'll tell you what's good and what's bad if they feel like you'll listen and try to change things for the better!",
            "I work corporate. Our old manager knew what we do, cared about employee engagement, and didn't care about enforcing starting time as long as the work got done since she knew that we usually put extra hours when all was said and done (our department's such that there's always more work than time to do it). \n\nNew manager is sadly a micromanager who doesn't understand what we do and likes to monitor people's schedules. Every now and then we get asked for our time (we don't all start and stop at the same time) with the implication that we need to start right on the dot. Whenever it happens, the overtime stops and work piles up even more. Manager gets frustrated about work not being done, and people tell them to hire more workers and to put system improvement in place (neither of which will happen because reasons). Manager backs off. People start doing their own thing again, relaxing on the schedule but also putting in overtime as needed to get as much done as possible.\n\nWhat makes all this so idiotic is that we're salaried, so overtime doesn't mean more pay.",
            " I expected you to arrive sweaty at work and start working stinking with sweat all day",
            "many people don't understand that I could stay at my desk 9-5 and still do absolutely nothing. It's important to check the performance of people, and try to help them if they underperform, not put rigid rules just for the sake of it.\n\nI was working in a team where we were could work from home 1-2 days per week, the team was relative small 6-7 people, but we were organised and we have never had communication problem between us, even if we were working from home. If we have to have a meeting in person between all of us, we just checked to be sure that everybody was in the office that day, and if not, ask if the person could move his WFH to a different day.\n\nAs team we were very productive, and the client we were working for was very happy with our job.\n\nOne day, one manager saw that at our desks there were only 2 people, as the other that day decided to work from home, so he started to send email explaining that we should always be in the office, we shouldn't work from home as this would have an impact on communication and performance.\n\nAfter that, we were forced to always work from the office, the team mood went very down and performance started to drop significantly.\n\nSo the manager enforced a non written rule just because he is old school, without realising he made it worse",
            "I used to work with a guy who would come in between 10 and 11 most days. An HR type noticed and brought it up with our boss as it apparently didn't look good for someone to be sauntering in near lunch time. Boss very quickly shut her down by pointing out that this guy rarely took a full lunch break, always stayed until at least 7:30 at night, and was effectively our team's out of hours support. HR dropped the matter quite quickly",
            "New managers always have something to prove...\n\nWhat they should be doing, unless the place is already on fire, is spend a little time hanging back, watching their new team operate, and try to merge with the flow. Over time, they can slowly integrate their management style. If they see room for improvement after an appropriate observation period, great, but don't fix it if it ain't broke.\n\nGood managers support their team, not rule it. You're a leader, not a warden. Good managers also know their particular skill set is management and not necessarily producing whatever the company produces. They defer to the expertise of the team, and don't try to micromanage everything.\n\nIf they rush in, all go no quit like this person did, you get a revolt, every time.\n\nPeople don't quit jobs; they quit bosses.",
            "I have a F*ck You HR story. And it’s pretty damn glorious\n\n\nI work in a procedural area of a hospital that has its on problems but it not about us right now\n\n\nWith everything going on in hospitals, drs, nurses, X-ray, housekeeping, everyone is spread thin. Well, travel nursing is paying really, really good right now. Can potentially quadruple your bi-weekly pay in a week.\nWell, one of our floors (all actually) is spread pretty thin. So, they set up an in house group of nurses with a spokes nurse as the head to combat the horrible circumstances they are being put in. With no help and honestly unsafe work for workers and patients.\n\n\nSo they told HR they weren’t going to do that. HR (who nobody gives a shit about this person) tells them they will either do it or will be fired immediately and put on a no hire list for at least 2 years. So the head nurse asks to double check if what they heard was correct. HR says absolutely. So, head nurse says OK. Hands them a list with ~75% of the names of nurses in that area and said effective at 7pm tonight we no longer work here. And the names on that list that work night will be told and won’t be coming in anymore.\n\n\nNeedless to say HRs head exploded and no idea what they were gonna do now.\n\n\nGood for them and f*ck HR.\n\nI reposted this because I used the name of the cause of the pandemic and it was removed",
            "Corporate America really needs a policy that no one is allowed to be in a position where you can make rules unless you come from those lower ranks that have to follow them",
            "HRs tend to only exist to restrain business.",
            "Some people will poison a well and then act surprised when people get sick. Like “oh no, what happened?” Good for you fixing it as a team.",
            "I had a boss like OP once. She was out manager that didn't like to be seen as someone's \"boss\". She was there to answer any questions and didn't mind if we came in a bit late (like 20 mins) or left work early (sometimes 30-40mins at a time) as long as we do our work. She left to a different role and we have a new manager now. She is completely 180 from our old boss. She was strict about the 9am-5pm rule. We had to text her or email her if we were running late (can be docked late if we came in at 9:02am) and no way we can leave even 5 mins early. She micromanaged the shit out of us. Our work culture fell apart. My coworker and her are having a feud right now which involves nasty emails, tons of awkwardness, and (before covid) bi weekly meetings with HR about the situation. Shes still our manager to this day, im planing on leaving my job tho this year. I can only take so much.",
            "I mean, that's why theres the say if it ain't broke, don't fix it.",
            "the workers are revolting",
            "One of the best pieces of advice I got when I became a new manager was to never go into a new place and start changing things. It never works. Things will always stop working and everyone will hate you for it. Instead just stand back and observe and ask a lot of questions. That way you see what’s actually happening and how you can best fit into an already working machine\n\nEdit: spelling",
            "Ex HR manager here. I never liked other HR people for this very reason. I just don’t understand why so many people work in HR when they clearly don’t understand people and more often than not treat employees like naughty children. HR is like the SAS.",
            "The WISE HR manager would have looked at the situation and come up with a method of turning these people into salaried vs hourly employees. They were already happy donating their time to the company; let's make it legal, make sure they are covered by insurance, and otherwise up to code and safe.\n\nThis unwise HR manager looked at the problem and tried to apply an immediate \"fix\" rather than a solution.",
            "Haha no more bad HR lady! Now me work long hour again no pay. That show her!",
            "Ugh, my previous company the CEO made the HR manager rip is a new one about something similar. We couldn’t be late (fair enough) but leaving on time made it look like we weren’t working hard enough... we were not impressed. Needless to say several of us voted with our feet and left for new, better paid, jobs",
            "I got asked in an interview 'whats the first thing you'd change'.\n\nMy response ' the expectation that change is immediately needed'\n\nI didn't get the job, but I'm kinda glad",
            "These are some of my favourite MCs. When employers try getting uppity and people in the workforce take back their goodwill.",
            "something similar happened in an office I temped at. Office was zen. We had lots of fun, and everyone took a break at 10:15, lunch, and 2:30 together.  Work never suffered. New HR person came, required staggered breaks, staggered lunches, etc. Zen died. I quit for new job. \n\nNot exactly sure what happened, but it seems like that lunch rule died because when I was at my new job, I ran into a bunch of folks from there out and about together.",
            "I had one of those managers, he decided that we must work 8 to 5 despite being salary and being on call as well.  I came in at 7 and left at 4 because if I left at 4 it would take me 30 minutes to get home, if I left around 4:30 it took an hour, if I left at 5 it took 1.5 hours due to traffic.\nWhat broke him of this rule was the couple times he had to ask why I didn't respond to a page at 5:30 with me explaining i was stuck in traffic.",
            "Nice story. I can't imagine ever working for a place where getting to your desk at a certain time is viewed as important. Or where a strict 9-5 is expected. 20th century is over, folks, it's time to move on.\n\nJust get your shit done. That's the beginning middle and end of it, right?",
            "Business Proverb #2: I can't fix a problem if nobody tells me that there is one....",
            "While HR managers can be shitty, sometimes the case is that the upper management specifically tell them to do that while they hide behind the covers. It seems that in this case their strategy to get more unpaid work done failed, so they put all the blame on the HR manager and forced her to quit. The manager is obviously still shitty, but so are the upper management so never trust them either. :)",
            "Unionise. You're giving your labour for free",
            "Honestly. Y'all spot yourself in the foot. Getting to come in a few minutes late Vs a bunch of unpaid overtime, seems like a raw deal to me.",
            "Wow. Im studying HR and I am hoping to continue my study so I can look into ways to get people more productive with positive reinforcement and alternate methods.\n\nIf I ever end up like that, I have failed myself.",
            "To paraphrase my dad, paraphrasing a famous quote..\n\n> If it ain't broken don't fix it... don't even focken touch it! Don't!",
            "Trying to show you have a bigger dick than your subordinates on day one without understanding the consequences of your actions is always the sign of a bad manager.",
            "This is what happens when people manage to metrics, instead of the thing they really care about.\n\nBecause leadership doesn't understand the work being done, they come up with metrics that they *think* lead to great outcomes.  Then people comply with the metrics instead of the outcomes.\n\nGood leaders understand that they need to drive for desired outcomes, not minutia.",
            "In my former jobs as a government contractor, managers were cycled out every two years with the goal of diversifying manager experience. \n\nEvery manager jumped in and quickly concluded the previous manager was doing it wrong.  This caused constant flip flopping between approaches where the current drawbacks are only compared to the potential benefits.  The bad leaders (most of them, because good leaders leave) ignored the experienced inferior-class long term contractors that were blamed as part of the problem.  \n\n“The last manager wasn’t as good as me, but he had no chance considering the lame generic contractors.  Replace Java with JavaScript because it is newer.”\n\nThe good ones try to stick around to actually accomplish something but eventually get frustrated and leave for the private sector.  I have predicted their decision by noticing whether they paid attention to basic logic and considered others’ views.",
            "A HR manager that makes rules?\n\nWhat the hell is up with that?",
            "This us a case of HR not knowing its place. HR doesn't manage anyone outside of its own department.",
            "I don’t get why new bosses or managers come in and fuck shit up. My wife’s company got a new president. He tanked a sister company and the parent company thought “oh let’s make him president of this one” and my wife has been miserable ever since.",
            "I worked for a countertop company for a summer. They had an shop crew and a install crew. Being summer business was booming. The shop crew was working tons of overtime just to get projects done on schedule. Suddenly the owner of the company got sick of all the overtime and only let the shop crew work 40 hours. Projects got behind and the install crew weren't leaving until 9 or even 10 am. They worked until the project was installed. Sometimes they weren't getting back to the shop until 5,6,7 PM.",
            "I deal with probably 80-120 different companies each month and you get to know people and what they do pretty well.  It is always interesting to see someone new come in with a head full of steam, ready to shake things up.  The more they do, the faster they are typically gone.",
            "Working overtime without pay is against the law. Not getting paid is not an option employees have.  You could’ve done more harm to the company by not getting paid.",
            "At my last job there was a complete change in ownership of the store, the great boss we had was getting too old to keep working 7 days a week, doing open to close shifts half the time, and wanted to retire finally. He thought he had set up some good new owners for the store that would really help keep things going strong, and so everyone got to meet the new owners who said they weren't planning any changes since we were doing so well and even managed to be profitable during the pandemic, they went so far as to say they would be joining us on the team for the couple weeks before the changeover so they could see first hand how things worked and how we did things.   \n\n\nOver those couple weeks, one of the new owners showed up almost every day, in uniform, and just sat on her phone or brought her laptop and worked on it. She never spoke to any of the staff, only the old owner, and never did anything with the workers to see how we did things. During this time we only got one single opportunity to talk to the new owners one on one, where they just said the same things they said at the group meeting and more or less ignored everything we tried to tell them about the store and just kept repeating \"We'll see how things go.\" The only issue they listened to us about at all was the fact we were understaffed.   \n\n\nCut to the first day of the new owners taking over, they got some additional help from the corporate office for the first week, and proceeded to change damn near everything overnight. Our understaffing issue got worse due to how they \"managed\" different tasks by splitting the remaining staff up even more and interfering in our work constantly to make sure we were doing it the \"new, improved\" way and proceeded to not just ignore complaints, but outright tell the workers that we didn't know what we were talking about and that clearly corporate knew more than us. Needless to say, I quit by the end of that first week, followed by pretty much every remaining staff member, managers included.   \n\n\nFor additional fun, why don't I mention that the new owners also brought with them a price hike on every product, except the ones that weren't selling which they began pushing hard on customers. They also changed how most of the products were prepared and made, causing complaints and confusion from customers. Again, this was during the pandemic. I don't know what things look like there now since I don't know anyone that still works there, but last I heard most of the regular customers weren't coming in anymore and loses were mounting.",
            "I always used to say, \"let me run this department for three weeks.\"   \nYou will be BEGGING for you old boss back.",
            "I have been a manager of Service departments (motorcycle and automotive).\n\nI have always followed a 2 month rule.\n\nLearn the processes already in place. \n\nLearn the strengths and weaknesses (professional who's better at what ie Transmission guy, Performance guy etc)\n\nThen tweak and streamline the process.\n\nSet up rewards for excelling You did X dollars above goal here is a gift card or cash bonus/ Day off with pay sorta thing.\n\nVery Very Rarely have I had to make a big change",
            "Had an HR manager like this,  one time who tried to Discipline me up for lateness.\n\nI asked for a breakdown of my hours worked (as we logged into phone & coded in/out of our breaks this was all documented) She initially said no & I advised that I wished to see it to help plead my case.\n\nWe were contracted for 9 hrs - 1 hr in breaks.\n\nWhile I was sometimes 1,2 mins late logging in some mornings I very rarely finished bang on my scheduled leave time, nor did I ever really take my scheduled breaks.\n\nShe gave me my sheet & there was 1 day out of 2 months where I worked under my contracted hours, I worked 3 mins less than my contracted hours. When I pointed this out she claimed that didn't matter as this was a meeting about lateness. She then had the cheek to say due to the amount of times I was late I owed the business 73 mins. Again I pointed out the staffed hours & she wasn't getting it & she gave me a verbal warning which I refused. This led to a standoff she just wanted the sign off for the ticking box exercise she was doing. Asked for another HR manager which again she refused so I offered to walk to the office & see if anyone else was available. She went got her manager who was initially on her side until I pointed out that my hours worked were always above the 9 hrs & my breaks were always under 1 hour. While I appreciated that I was late this was offset by working on & not taking breaks which she agreed. Removed the verbal warning but gave me a spiteful we will be watching you closely.",
            "Since when is an HR rep managing a floor of employees? I have never worked for a company with that type of setup. There was always an office manager and the HR rep was a \"neutral\" third party",
            "The only thing I would say in defense of the HR manager... part of their job is to make sure the company won’t end up in hot water. Unpaid overtime is fine to some employees, but there may be one person who finds it not great and then whistle blows. And then the company is in the hole thousands to hundreds of thousands of unpaid time to its employees.\n\nIve never understood pushing strict rules... were all adults until proven otherwise. I would have been on the side of “please don’t clock in until you’re ready for work. Please track overtime appropriately so we can pay you correctly for your work. We are trying to limit that need for OT and limit client expectations based in reality but it is understood that OT should be expected.” It seems more fair to ask that... than to be strict about a 9am.",
            "At least the took a shower. We had a woman who would brag about biking in 20 miles each way to work but she didn't shower...ew.",
            "we experienced the same kind of thing where i work \n\nit was a relaxed atmosphere and a fun place to and staff enjoyed there work life \n\nuntil the changes in hr and higher management \n\nnow its a chore to get up and go",
            "Oh, I see you've worked with Susan too.",
            "Did you forget the phrase ‘above and beyond’ when you said ‘over and above’? That might be a completely random thought but I just started laughing at the idea of it",
            "As i said to my former boss - you cannot expect me to work longer if you even look into the time we spend on private conversation and cut it off after a minute or so for wasting your money.",
            "It’s so crazy how management just doesn’t understand that treating employees well increases productivity. It’s a lesson we have yet to learn",
            "It’s called the Boimler effect.",
            "I had a friend who worked in a fast-growing software company in the early 2000s. The culture was as casual as you would expect for the industry. The dress code was essentially \"cover your genitals\" so flip-flops and shorts were the norm. As the company was rapidly expanding, management figured they better expand and update the HR department. The new director came in and in an effort to \"improve professionalism\" (her words), instituted a business attire policy.\n\nThere was resistance to this change, as you might imagine. She was gone in a week.\n\nAs others here have said, don't go mistaking that your opinion on the first day matters.",
            "Were you hourly? If so, the owners correct on hiring someone  to crack down on \"unpaid overtime\" because all it takes is one person complaining to a labor board and ownership is in deep shit.",
            "Insane to do this on a org that is based on specialists. I assume this as there are projects.",
            "Sounds like the HR from \"the office\" called toby",
            "I will never understand people who gleefully work unpaid overtime",
            "Yeah, pretty much she broke the first rule of going into a middle or upper management position. Understand what people are doing, how, and why before changing anything.  Just like you stated it, people will revolt if something unbroken is changed.",
            "There are two kinds of managers:\n\n1.  Those that serve their boss by cracking the whip on their employees\n2. Those that serve their employees by getting the things they need to be productive from their boss",
            "I've seen HR do some strange stuff. I used to be contracted out to a law firm. Probably 30-40 employees. They hired a new payroll / HR lady. Within a week, she decided that she would drop pay and benefits by 10% in order to increase morale and work ethic.\n\n&#x200B;\n\nThat worked ... well. They lost a few of the top people in an hour.",
            "Had a job like that once.. management/owners called in a consultant to assess things and offer suggestions.  \n\nFirst thing was to poll everyone about job satisfaction.\n\nResult was *One* (1) person voiced dissatisfaction. (I suggested *fire him* and satisfaction would be unanimous!)\n\nThey made changes.. reporting structure mostly, and seating arrangement.\n\nWithin *one year* 40% of the company had quit, and 90% of my department was among them. 2 years later, opinion was very low, and 2 of the 4 *founders* had quit!",
            "HR is often poisonous to a highly functional but laid-back workplace. It can't recognize a tacit culture of flexibility and must impose unnecessary order.",
            "_\"New HR manager was confused as to why work was not being delivered on time anymore, people were starting on time! She made sure of it!_\n\n_Needless to say, upper management removed the rule and she quit shortly after.\"_\n\nI'm glad they quickly saw sense.  The vast majority of this type of story goes along the lines of _\"Am I out of touch?  No, it is **everyone else** who is wrong!\"_",
            "And when it comes to HR Mgrs. like her, ALWAYS assume her only role/purpose is to protect the company, all the other moral boosting nonsense that comes out of HR is bullshit.",
            "But don't other managers - like operations managers - have to agree with the HR manager before she could send out e-mails like this?",
            "Bloody Toby Flenderson",
            "Fun at work? Bike to work? And showers available ...Either California or Austin... Jealous, yes. Obtainable for the rest of us, probably not.",
            "Had a Similiar situation at a job i worked at.  Dude's buying lunch for everyone, and dinner for the night guys even though they got lunch.   \nregion wide competition, each winner gets 2k towards company xmas party.  \n\nOur branch wins 3 out of 5, Manager puts up another 4k so we have 10k to spend on our party. open bar, all you can eat, skiiing, snowmobiles, horse drawn carriage rides.    Was dope.\n\nnext year we get a new boss, hit 3 of 5 again.   We got a bring your own chili dog party.   people left pretty quickly.",
            "Why are you all giving the company free work?\n\nThey already set it up such that they are giving you less money than your labour is worth.",
            "Wage theft is still theft even if you are doing it of your own free will.",
            ">Needless to say, upper management removed the rule and she quit shortly after.  \n>  \n>We all went back to our normal ways and would you know it! Projects were back on track.\n\nSo what you're saying is that everyone went back to donating their time to the company by doing unpaid overtime?\n\nYeah, you really won there.",
            "I was a coordinator of a department in a store, basically a manager, but not salaried. I had complete control over the department. For 2 years, it had been unprofitable and they had burned through 7 coordinators until they got to me. I turned the place around, started making profits for them, and mostly stayed within my designated number of labor hours to get the job done. The trick behind it all? I worked hours off the clock. I was dedicated and it was the highest paying job I had ever had, so if I needed to cheat a little, it didn't bother me. The managers knew, but turned a blind eye to it. I never got any flack for anything because they knew I was working for free, a lot. I was invincible, but hey - their department was immaculate and profitable.",
            "This is called “work to rule” and it is a powerful tactic in labor contract negotiations. When I was a teacher we did it once when our superintendent was refusing to compromise on some issues. It only took two days to get him back to the table.",
            "Compliance on the surface and passive aggressiveness underneath=toxic work environment. The only fun in those places are the meetings after the meeting!",
            "I hate that this is considered a\"good\" company even though you all had to work unpaid overtime to meet your deadlines.",
            "Unpaid overtime?\n\nAre y'all salary and just chose to work more than 8 hours?",
            "God these stories are so transparently bullshit.\n\nFirstly, anything the HR dictates comes from higher up, and secondly, HR would NEVER care about the work getting done on time. Why the fuck would hr even know? These are strategically separated departments.  What's also funny is from a workers perspective who is trying to ascend the ranks and make more money has a much better shot with the actual policy they are trying to introduce. People making their own schedules never works. This reads more like a teenagers fantasy. Now add in reddits obsessions with hating on HR.\n\n\"*And they lived happily ever after, without the HR manager\"*",
            "Honestly though you can't blame her, it made sense from her perspective.",
            "She was probably just following policy that wasn’t enforced, ie doing her job. She is HR remember. It’s a crap situation. As you said they changed the rules later.",
            "I’ve seen this exact same scenario throughout my career. Instead of acting like actual grownups employees do exactly what you described here. The adult way to deal with this is to talk to the person who tried to implement the change and explain the full picture to them- problem solved. But no- people punish the very managers they profess to love and put them under pressure for something out of their control. It’s quite pathetic and it’s usually the catalyst for us v’s them mentalities that follow. This HR manager will have been asked by the leadership team to implement and/or tighten up policies and procedures, she was then thrown under the bus for doing exactly that and was then blamed to the point she left her job- that’s disgraceful. Your company sounds quite toxic but it’s hiding behind the “fun” “we’re all in it together” facade that obscures the reality.",
            "[removed]",
            "You say not to walk into a new company and try to change something because people will revolt. \n\nThat is a very immature reaction. You revolt because you’ve been getting away with doing whatever you want, however you want, for a long time, and thought that just because the work was getting done, it’s okay. \n\nThere’s more to it than that. You work overtime for free, but in truth, you work when you feel like it, and you don’t when you don’t. \n\nIf you can get the work done in 8 hours, and management set the hours as 8-12 and 1-5, then that’s when you should be working. It does matter which 8 hours you work. \n\nYou sound like someone who thinks he’s above the rules.",
            "improvements can be made - but this is basically inserting herself as new ruler.\n\nit's just simply shitty management. There is good management and then there is THAT",
            "Man, it really sounds like she would’ve had an easy job if she just stuck to serious HR issues like harassment or something rather than change a good work culture.",
            "\"The employees are revolting!\"\n\n\n\"You said it, they stink on ice!\"",
            "You can either tell people what to do, or how to do it, then let the people decide the other one\n\nGood management will usually tell you the desired end result and let you choose your way to do it, no micromanaging whatsoever, just a random checkup to make sure you have all you need to accomplish the end goal.",
            "[deleted]",
            "Ya LOVE ta hear it",
            "If it ain’t broke, don’t fix it",
            "Surprised that HR folks are allowed to have that much power. That in and of itself sounds like a horrible idea.",
            "Protip, if you're a new, high level employee for a company. Always learn how it operates before making changes. Learn processes and make improvements on the existing company. Especially when it's working.",
            "\"fixing things that aren't broken\" literally that moto of my company so that managers can justify their existence. It creates an extremely toxic environment",
            "Beautiful",
            "Unfortunately there are a lot of business minded people who believe in the motto “if it isn’t broken, break it” because in their eyes there is no such thing as staying the same, you’re either getting better or getting worse. I worked for one such company and anytime things would be going smoothly, if profits weren’t rising enough then those unbroken systems would need to be broken in order to make them into something better. It’s a mindset that can be wonderful but can also be equally disasterous.",
            "Im sorry. Unpaid overtime? What they fuck?",
            "So I read this reddit's stories that involve HR, the more I read, I start to get why in \"The Office\", everyone hated Toby, the HR rep.  At my job in a small business,  I don't have a HR, my General Manager also acts as a HR, amongst his other duties.  He's a worker that actually knows what's going on, and don't make decisions arbitrarily or based on rigid rules and not reality of the situations.  That's why we never had a problem with management.",
            ">Don’t walk into a new company and try to change something that isn’t broken. The people will revolt.\n\nOr when you do, first check why a policy exists with the people using it. Then learn. And adapt."
        ]
    },
    {
        "post_id": "tsr5lu",
        "author": "Controlled01",
        "title": "How much water do you want... exactly?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/tsr5lu/how_much_water_do_you_want_exactly/",
        "score": 15813,
        "num_comments": 659,
        "created_utc": 1648698812.0,
        "selftext": "TL:DR  Customer choses to ignore simple procedure and receives 800 gallons of water in their living room.\n\nI deliver bulk water to people who don't have access to city water or their own private well.  For nearly all customers its a simple process, either they call for deliveries, or they have agreed to automatic deliveries.  When I show up, I hook the truck up to the fill pipe and start pumping and either listen at the vent or hook up to an installed alarm in order to know when the holding tank is full.\n\nThis particular customer had their holding tank installed in a small utility room next to their living room and didn't install a vent to the outside, and refused to allow us to install an alarm because they didn't want us to put the 1/4 inch hole in the wall to run the alarm wire.  Solution?  They call when they need 2000 gallons of water and we show up and pump exactly 2000 gallons of water.\n\nThis procedure worked without flaw for over a decade.  Literally hundreds of deliveries with no issue.  Que owner deciding to sell.  We are contacted by the new owners and set them up as a new account and head over for our first delivery and meeting.  We especially go over the issue with us being totally unable to tell when the tank is full.  We offered to install the alarm again for free, but they declined.  So we let them know when they call for water they MUST be sure they have enough room in the tank for 2000 gal.  Or to let us know how much water they have room for.  We went over this several times and they laughed saying they understood and would be calling when they were below the 2000 gallon mark. \n\nTwo weeks go by, and we receive a message on our answering machine from the new customer,  no gallon amount is specified.  This set off a warning bell though because it was a household of two, and its only been two weeks since we filled them last.  Thats HIGHLY abnormal.  We expected more like five weeks.  So we call back just to double check.  No answer so we leave a message asking for confirmation.  Couple hours later we try again.  By the next day we had left four messages asking to confirm that they were ready for a full load.  No reply.  Well, they did call so boss sends me out.  I nock on door as a last attempt, still no answer so I hook up, start the pump and set the timer so I don't over pump while reading my book.\n\n15 minutes later I hop out to check the water meter, 1700 gallons. I'll watch for the next couple minutes and shut it down.  Thats when I hear the front door burst open and the woman who bought the house and had called us in yesterday is SCREAMING to shut the water down.  There is water everywhere!  What the hell are we doing!  This woman has been ignoring our calls and even ignored me at her door and now she is screaming at me.\n\nApparently she had called when the tank was half full instead of down below the mark showing where the 2000 gallons is.  And just disregarded all our messages and didn't feel like talking to me when I nocked.  So now she has 700+ gallons of water in her living room. Boss was called out so she could scream at him.  Husband came home from work so he too could scream at us... for reasons I guess.  They made a lot of demands about how we were going to pay to fix it... nope.  Boss laid down how we saw the situation: you can keep the water free of charge just don't call us for water anymore.  Yall are too stupid to work with.\n\nNever heard from them again.  Lol broken heart.",
        "permalink": "/r/MaliciousCompliance/comments/tsr5lu/how_much_water_do_you_want_exactly/",
        "comments": [
            "Former environmental consultant.   Back in the 90's we got called up to investigate an \"overfill\" by the insurance company for a gas station out in the sticks.\n\nNew delivery driver showed up,  asked where the underground tanks were, got instructions to fill up the kerosene tank and went around back. A while later, he comes back in with an invoice for 900 gallons.\n\nThe owner did the numbers, having measured the level beforehand, and told him there was only room for about 500 gallons. \n\nThe driver showed him where the tank fill was...\n\nThe guy had put 900 gallons of kerosene into a 200' deep water supply well going straight into a limestone aquifer. \n\nThe worst part is that since petroleum is lighter than water,  it was almost completely unrecoverable as it had \"floated\" to the top of the aquifer and spread out.  We recovered what we could (<50 gallons) and submitted the report to the state.   I was told that the lawyers would take it from there...",
            "Also, *how* did she not come out and stop you way before there were 700 gallons in her living room? Surely she would have heard/seen it way before that?",
            "New employee first day on the job hooked the fill hose up to the dryer vent & pumped all the water straight into my friends house instead of the water tank. Worst first (& last) day on the job ever.",
            "Did they ever explain why they didn't answer the door or return your calls?",
            "The Great Flood\n\nFriend of mine lived on a street with a slight incline. Owned the house on the highest part of the street. Decided to replace the tankless hot water heater with a regular one, gas fired like the one originally there. Was always looking for a way to save a buck,and quite often it backfired in her but nothing like this. Found someone in the parking lot of home Depot who said \nhe would install it for $50. He went to the house, made a list of fittings and such and was provided with what he asked for. Came time to fire up the new heater. He turned on the water and the gas valve and filled all the gas lines all the way down the street with water. Most of these homes had the old gas heaters that were in the floor. Everyone got several inches up to a foot of water before it sunk in up the street something wasn't right. I wanted to go take a look at how many fittings this plumber had to put together to come up with a way to feed water into the gas line but it was quickly disassembled and the tankless was put back in its place.",
            "People that dumb should not be walking around loose.",
            "When it rains it pours.",
            "Great Boss you have there, OP! You should keep him.",
            "TIL some people get bulk water delivered to their house.",
            "Had a guy come out from a big box store to install a washer and dryer. Instead of opening the receded wall panel to put the drain hose the drain. They cut a hole in the wall and put the hose in. New construction 2 inches of water.",
            "Moist",
            "I hope the previous homeowner doesn't hear about it.\n\nHaving kept something nice the entire time you had it only to sell it and see it get fucked up by the fault of the new owners hurts.",
            "I also deliver bulk water to people's houses up here in Alaska who aren't connected to city water and I get this probably better than anyone else here in the sub and it's hilarious... what I don't get is you said 17 minutes for 2000 gallons of water how fast do you guys pump at? Our trucks pump at about 250 gallons a minute or more.",
            "Perhaps they had water on the brain?",
            "WHY would you risk that sort of flooding when a quarter inch hole and a sensor can keep that from being a problem? It was even FREE?! Some people are just beyond help, man...",
            "Could be worse, could be heating oil.\n\nI remember watching an old renovation show... heating oil was popular, but due to DIY renovation, the tank (and boiler) were removed.  What was not removed was the pipe and access-point from the outside.\n\nNew deliver driver, saw the hookup and proceeded to pump heating oil into the basement...\n\nwhoopsie.\n\nLock-out Tag-out your shit!  even if it's DIY.",
            "That is a great story! Too bad we can’t tax stupidity or turn it into gasoline, that would actually benefit the rest of us",
            "> Yall are too stupid to work with.\n\nSOOOOooooo many times I've wanted to shut down customers with that line.",
            "For those that cannot see the malicious compliance...\n\nCustomer placed an order,  company did their due diligence to verify amount,  customer went no-contact, company did the fill amount per standard agreement.\n\nFor all the company knew the costumer went through a REALLY high usage period.",
            "What country is this? I’ve never heard of this kind of thing as a service.",
            "> que owner deciding to sell\n\nWhy is no one on this sub able to spell “cue”. \n\nQue is not a word.",
            "….why didn’t you just wait for them to call you back?",
            "I really don't understand why you drove to their place to fill water on,  when you didn't have any confirmation from them and couldn't get in contact with them?",
            "\"you can keep the water free of charge just don't call us for water anymore. Yall are too stupid to work with.\"\n\nCapitalism would work well, if every business could do this to every customer.  The problem is, sometimes idiots can get rich, and demand unreasonable things, because people want their money so badly that they put in additional labour for dumb peoples' stupid whims, and that labour is thus less efficient as a result, and thus more productivity is lost to the idiocy despite the fact that the company employing the labourer is making more money.",
            "Wild… WhT is the price on such a service? I truck in all my water in the winter months, wondering how much cash I’m saving lol.",
            "I’ll never understand why people don’t return calls, texts, emails (when they reach out first). But the most outrageous part is that she didn’t answer the door.",
            "Dude, your employer should have been sued for damages. First, the customer didn't specify an amount. Second,  you couldn't get verification on the amount so you opted for an amount that was known to be too large for the timeframe.\n\nSorry but without a proper work order, I didn't think you should have even got in the truck. This could have all been fixed with a simple \"Your order needs clarification. Please call us.' and you could have supplied them for another 10 happy years",
            ">Que owner deciding to sell\n\nIt's *cue*, hombre.",
            ">bulk water\n\nNo wonder people are having problems losing weight!   \n(*sorry, couldn't help myself even though I realize it probably is only funny to me.)*\n\nWow, that is a customer no one needs.",
            "Amazing story but I'm left wanting more info. \n\nI wholeheartedly agree theyre a bit ignorant. Not getting the alarm, not specifying the amount, not returning calls/answering/responding. \n\nBut unless they've used this service or a similar one before, what are the chances they knew you would just show up and start pumping water without them responding? Is it just a protocol that you must deliver the water to houses once they call and notify? Where I'm from, your water can't be turned off by the water company no matter what the outstanding balance is. It's cruel/ illegal to leave houses without running water, and it also causes safety issues/child neglect issues/etc. Is it that kind of issue?\n\nI'm from a big city and never even knew this service was a thing, \n\nbut I'd imagine this is definitely more popular where this took place and they mightve known about this ? If they never answered you or told you how much they needed, and you have no way of knowing how much water to pump into their tank, then what exactly was the exit plan here? Just assuming they needed 2000 gallons and to pump it all? Even after the collective thinking it was suspicious they called so soon and it was unlikely they needed that much?",
            "This is an absolutely nightmarish way to have to acquire water",
            "I love this story. I wish more managers had the guts to fire stupid customers.\n\nFYI:\n\nQueue: English, line, as in line of shoppers waiting to check out at store\n\nCue: English, prompt, as in director pointing to actor when time to speak",
            "[deleted]",
            "Whats the cost per gallon for the water you provide? I work with utilities so im curious",
            "Why wouldn't they take the free alert deal....?\n\nFucking Weird!",
            "Put the TLDR at the bottom!! Having it at the top is like a spoiler.\n\nAlso *cue and *knock",
            "so you guys knew that there's no chance they used 2000 gallons in 2 weeks and they didn't confirm how much water they needed so you proceeded to drive over there anyway and, without confirmation, start pumping and dump 700 gallons of water into their living room? and we're meant to be laughing at the customers for being stupid?",
            "Wait, so you started filling the tank without any other communication than a voice message saying they will need a water delivery and no other info? And unanswered phone calls and doorbell just means that you will start filling it up for the maximum amount without actually consulting it with the owners?\n\nHonestly that sounds like a lawsuit waiting to happen.",
            "You nock arrows, knock on doors.",
            "I'm sorry, but why are you filling up a water tank without a confirmed order when you knew the 2000 gallons would never fit?",
            "This may not be a fair question, since describing sound can be very hard in text, but what does a full tank sound like? What changes when you listen at the vent that lets you know the tank is full?",
            "OMG it must be in the boonies where you go.",
            "Does anyone want to bet that they will demand that their next water supplier will install an alarm?",
            "not to make you feel shitty, but its \"knock\" and not \"nock\" but yeah blame the Brits for that silent k",
            "Knock",
            "Cue",
            "Knock. A nock is the groove on the end of arrow or the grooves on the Bow where the bow string attaches.",
            "Well...that was a washout.",
            "\"Too stupid to work with!\" I die.",
            "This isn't malicious compliance because they gave your company nothing to comply _with_. Surely the only sensible thing to do in this scenario is to cancel or postpone pending clarification on volume. It's just malicious.",
            "I mean... it's a bit weird you just continued to go out even after leaving multiple messages with no reply.\n\nThis really does seem like your/your companies fault. Like you just wanted to trash their house because they didn't reply to you.",
            "sounds more like compliance against the boss, if he made you go, that’s on him. and the boss knows it which is why he’s defending it.",
            "[deleted]",
            "How does the tank not have an overflow system? Just run the excess in the drain?\n\nI mean, there are obviously even better solutions available here. But you know, as a minimum at least?",
            "Funny, but the company should REQUIRE an fill alarm before service s allowed",
            "How fucking stupid do you have to be to ignore calls about how much water you can fit into a holding tank? Especially after blowing off the careful instructions about exactly that. Fucking idiots.",
            "This has got to be my favorite one of these. Thanks for sharing OP. I wish I could've heard your boss tell them how they're too dumb to do business with. Fucking classic.",
            "This honestly doesn’t seem like malicious compliance just malicious. You knew something was up. Your business ruined someone’s house to be petty. They didn’t say how much water or even confirm the delivery.  I mean what is the end goal? Be sued? Lose the customers business?",
            "Not only are you and your boss dicks, you’re almost certainly liable for damages. I hope y’all have a good lawyer on retainer. What a clown post.",
            "<facepalm> Stupidity, the gift that keeps on giving.  Sometimes you just can't save people from themselves.",
            "Keep the water!  LOL  Love it!",
            "Screw them, they owe us for 2000gal and delivery.",
            "If there's no way for you to check how much water is in the thing, how do they know when to order more water?",
            "Best thing I've read all day.",
            "This is a complete lack of professionalism and a totally inappropriate response to the situation, especially when declining the delivery was an option. If this story is true, you should be ashamed of yourself, fired, and sued for the damages. I hope you reflect on the consequences of your actions and become a better person from this.",
            "YAY.\n\nGood boss.",
            "Yeah, this sure sounds like the company’s fault. The customers didn’t really make any mistakes. They didn’t tell you how much to put in, so likely didn’t know they had to. And they’re not obligated to return calls (obviously if they did it would make the process easier, but this doesn’t mean they deserved to have their home flooded). I hope they sue for lots of money.",
            "They didnt specify a gallon amount.\n\nYou were uncertain and knew the risks, but did it anyway.\n\n100% you're liable. \n\nDont worry, under the circumstances I'd definitely cap your prison time at 15 years (though the civil damages for you personally would likely be in the millions).",
            "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA",
            "[deleted]",
            "If this is true then he’ll yeah",
            "Omg I laughed so hard!!!",
            "Try to but the TL:DR at the end",
            "This story filled me with satisfaction",
            "Was your boss angry at the new customer since before the first delivery? I can't think of why anyone would want to pump in 2000 gallons when everyone with any experience and sense was certain it couldn't hold that much. Unless they're just mad.",
            "What area would this be legal in?",
            "This is pretty fucked up tbh\n\nKnowingly flooding a house fucked up"
        ]
    },
    {
        "post_id": "9w6b75",
        "author": "tiptoe_only",
        "title": "You prefer crappy cheap wine? OK, here you go!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9w6b75/you_prefer_crappy_cheap_wine_ok_here_you_go/",
        "score": 15802,
        "num_comments": 768,
        "created_utc": 1541962198.0,
        "selftext": "This is a story my father-in-law (F) told me about his mother-in-law (MIL) who had money but was notoriously cheap with it. Dinner at her place could be a bit of an ordeal. Food was the cheapest available, the portions were so tiny you'd be hungrier when you finished than before you started and she would do things like buy a super value no-frills supermarket own brand pack of mini bite size pies or chicken Kiev intended for parties and serve one per person as a main dish. She also watered down sauces, soups and drinks mercilessly. \n\nOne year the extended family were getting together as usual for Christmas dinner at MIL's house. This comprised several nuclear family groups, each of which traditionally provided one course and this year it was MIL's turn to provide the wine. \n\nWhen MIL sent F to the kitchen to fetch the wine, all he could see was a single bottle of the cheapest substance you could possibly call wine. It had a plain white label with no text other than \"value sweet dessert wine\" and the supermarket's logo. F said he wouldn't even have risked cooking with the stuff. Even if it were higher quality, sweet dessert wine would probably not have been a pleasant accompaniment for the main course.\n\nFortunately, F had a trick up his sleeve.\n\nReturning to the dining room, he asked MIL as discreetly as he could if she didn't have anything a bit nicer for Christmas dinner. Her response was, \"No. I prefer this. It's my favourite, you'll like it just fine.\"\n\nSo F went back and opened MIL's crappy cheap dessert wine and also a bottle of really nice wine he'd brought with him, which he hid behind his back as he poured MIL's glass of plonk. When she saw the other bottle she started yelling about having some respect for his mother-in-law. All he said in response was, \"You said you preferred this one, so I made sure you got your favourite. What's the problem here?\"\n\nEveryone else really enjoyed the nice wine.\n\n\n\n\nEdit: I may have inadvertently made my father-in-law come across as a wine snob. He definitely isn't a wine snob, but by all accounts this stuff was so poor quality it was pretty much undrinkable (it was also too sweet to go with the food). The stuff he brought wouldn't have been show-off expensive, just nice. He doesn't drink wine often.",
        "permalink": "/r/MaliciousCompliance/comments/9w6b75/you_prefer_crappy_cheap_wine_ok_here_you_go/",
        "comments": [
            "I know someone like this, she'd always bring the crappiest 6 pack of beer then drink all of our more expensive beers or spirits and when we asked her why she'd get the crappy beer when she could easily afford better stuff she said she loved it. So when she had a barbecue we all showed up with a 6 pack of the crappy beer and she was beyond furious.. But she said she loved it right? ",
            "You know what they say. \"cheaping out is expensive\"\n\nBeautiful clapback and worthy of r/pettyrevenge too! ",
            "[deleted]",
            "\"This is legally called 'wine drink'.\"",
            "I actually know someone like this. they'll buy the cheapest stuff because everyone else brings the expensive stuff they can leech off.\n\none year, he was supposed to provide the alcohol, and everyone came with their own bottles/cans. he had nothing. never tried it again",
            "My family had to start a \"bring your own hot dog\" 0olicy at cookouts because certain family members always brought the crappiest food products then ate all the good stuff ",
            "Good thinking from F! 😂 Reminds me of a time my sisters and I threw an Australia Day BBQ and invited all our friends from work. One of them brought his sister who in turn brought a six pack of Carlton stubbies. Bbq is going great, everyones eating and drinking having fun and then it's time to go. I'm packing up and bring plates in from outside into the kitchen and I see my co-worker's sister and other plus one friend standing in front if the fridge stuffing stubbies of the good stuff into her overfilled bag. I'm literally gobsmacked. WTF. Never invited that co-worker over for parties ever again and was so pissed off. To top it off she thought someone stole her rollies pouch which turned out to be in her own damn bag.",
            "Love this story.\n\nI have a similar situation with my family, we generally go down to my sisters or mothers house (since they live kinda close to each other and my sister has young kids) and because it is that side of the family, my brother in laws family always attend.\n\nThey never contribute, and feel just fine and dandy eating all of our food. \n\nOne year I was tasked with bringing the seafood, and I spent almost $200 on oysters and prawns, the best ones I could find. My sister is also a bit of a tightwad and all she did was cook a bit of pork on a small spit (prob cost $30 but she hosted so gets a pass). \n\nBIL mother and 2 brothers rock up (one is special needs so gets a pass), mother brings nothing and the brother brings a half eaten roast chicken from the previous place he was at. Both of them start digging into oysters and prawns. I was absolutely livid.\n\nThe next year we made sure we were overseas for xmas/NYE to avoid it. This year we will have our own little one so we are hosting and BIL family are not invited. ",
            "Love the pettiness. But on another note only 2 bottles of wine at a Christmas dinner either the extended family?",
            "My dad told me a story about one of his cheapskate friends from when they were young adults.  His friend would show up to parties with 6 pack of beer, drink tones of other people's beer all night and the have the audacity to try and take the \"rest of his 6 pack\" home with him.  Would also come to BBQs with cheap ass little steaks and when dinner was finally served, he would have the nerve to try and take one of the bigger nicer t-bones that my dad would usually bring.   My dad isn't no chump though and would always put him in it place when he would try that shit.   I was good friends with that man's son growing up and once we got into high school he also stated showing the same tendencies.  Coming to smoke up with us and never pitching weed, coming to drink with us and always drinking more than what he paid for. I'm not really good friends with him any more.  Like father like son I guess....",
            "What’s the use of money if you don’t enjoy it?",
            "My Nan is a bit like that. Loves the cheapest alcohol until someone else is buying them she’ll drink all the brandy going. ",
            "Watermelon MD 20/20 or Boone's Farm would have been better.  Lol",
            "I have an aunt like this, we always got weird crappy gifts as kids that she'd bought or got from someone else and then regifted, (she'd also had a tendency to pick up things she'd like from out house and just put it in her pocket), so my mom made sure when we'd have birthdays and when things got given to her us kids would draw on it or make it so it was unregiftable again. She's also a huge cheapskate and by god if it cost her more then a dolor you'd better be thankful for it! ",
            "Dessert wine, as long as it's something proper like ice wine or ice cider, can be pretty damned fantastic. For dessert.\n\nThat said, I would not trust store branded [edit] dessert [/edit] wine as far as I could throw OP's FIL's MIL.",
            "Used to work in a pub kitchen.   Every Sunday the same couple were regulars for lunch.   \nShe didn’t like cask wine... only bottles even if it was the same brand. \nUsed to refill the bottle they used to fill her glass from the cask in our coolroom    ",
            "It bothers me way too much that you abbreviated father-in-law as F and mother-in-law as MIL.",
            "“...glass of plonk.\"\n\nLove this. ",
            "Why would anyone eat at her house? Coming from a family of generous but food and wine snobs she would be ostracized.\n\nEdit. And I'm not boasting, it's actually kind of annoying being a chef and having my family. Everyone thinks they are an expert yet they don't even know how to use a chefs knife.",
            "Ever read Maus? That’s all I can think of when reading this.",
            ">Everyone else really enjoyed the nice wine.\n\nTell me what was MIL's reaction when she drank what probably amounts to a bottled piss?  My brother's wife once bought a cheap bottle, a cooking sherry.  She was wondering why it was \"so fucking salty\"  (even I wouldn't touch cooking sherry for actual cooking, too salty for most of my recipes)",
            "Without any sort of evidence to support this, I have a theroy. Your father in law's, mother in law is probably quite old I imagine? Possibly being born sometime around the great depression? The behavior (at least the being cheap despite moderate wealth) likely stems from growing up in an environment where the behavior was necessary, and she likely never grew out of it. I remember my great-great grandmother was like this to a degree.  \n  \nIn any case, it's a great tale of malicious compliance.",
            "Had a mate whose mum would give us 50% pure delicious orange juice and 50% water. Also told me that I should buy tapes instead of vinyl because I could 'record over them'.\n\nThe orange juice was one thing, but I could never forgive her for her suggestion for my relationship with music. Absolute evil. ",
            "[deleted]",
            "Just an interesting note: expensive wines aren't necessarily better, and in blind taste tests sommeliers have incorrectly identified between bottles in the 10-20 dollar range, and those that are a few hundred.\n\nChoosing the type correctly (like not serving a sweet desert wine for your main course of steak) is way more important than how much you spend on it.",
            "Why would you agree to Christmas dinner at this person’s place? Why?\n\nRather than some slight of hand, just make your own plans for dinner and invite her. She’ll still be miserable but at least she wouldn’t ruin everyone else’s holiday. ",
            "Beer geek here.  I try to find something the geek will approve but won't scare off the non beer guy...think a good Pilsner.  I'll bring some heavy ales or stouts for me, though, knowing a lot of people don't like \"dark\" beer",
            "Me sitting here confused after reading “father-in-law (F)” as if the “F” was the gender",
            "My parents have friends worth at least 100 mil who make a sport of buying the cheapest shit possible.\n\nWhen they come over I just fill the glasses in the kitchen so I can poor my mom a nice chablis and they get their own plonk.",
            "I seriously thought I was in r/justnomil.\n\n\nPlease please go share that there. They will absolutely love it!!! ",
            "When I saw the title I thought this was r/gatesopencomeonin",
            "I always bring a moderate quality wine or a random whiskey im wanting to try instead of food. Found that easier and people are alway pleased.\n\n",
            "I don’t know why, but for me all wine taste the same. Only differences are whether they are white or red. ",
            "Wait for clarification everyone got the nice wine except mil?",
            "Reminds me of getting \"Buttershitty\" on Butterscotch schnapps ... yeah, you shouldn't have brought that, but no way are you taking it home *hit it from the bottle, pass it around*",
            "Lol.  Wine snobs are so full of it.\n\nMULTIPLE times professional wine tasters have been fooled by cheap wine in fancy bottles, heck some of them couldn't even tell the difference between white wine dyed red.\n\nYou probably could have gotten away with pouring the expensive stuff then pouring the cheaper stuff into that bottle back in the kitchen and play like it's a new bottle.\n\nI've re-bottled boxed wine and nobody knew the difference, even someone who swore thay stuff was gross raved over it unknowingly.",
            "Work with a guy like this, only think he brings for friendsgiving is a costco pumping pie.complains about we don't have kids so we can afford all the other stuff like Turley an sided.usually 10-20 adults plus kids that was 10 years ago.now all of the group has kids.so yeah",
            "What do you do if you can't afford decent alcohol or have to choose between buying alcohol or getting there but still want to see your friends?",
            "You know, wine connoisseurs were unable to tell the difference between a cheap and expensive wine even going so far as to rate the same wife differently dependent on the bottle it came out of. The fact that she had the same perception that cheap = crap and acted accordingly is pretty terrible but taste is too subjective for price of wine to actually be a determining factor for your ability to enjoy it.",
            "When I was a kid I went camping with my dad and this older couple that he was friends with. The older lady insisted on making lunch. PB&J sandwich. Every day.  She put them in ziplock bags, but always insisted we give them back and not throw them away. We thought she was recycling, and then I went into their RV and saw our sandwich bags drying on the counter. Fucking pathological.",
            "Did she change after that lesson? Even a little? ",
            "It remembers me new eve party few years ago. \n\nIt was a friend's cousin place. He warned us she is cheap on the food, to the point that if guests comes with food for the dinner, she will take her personal part out of it, for later, before to serve the guests. \n\nSo we eaten a huge plate of spaghetti before to go there. \n\nOnce arrived there, surprise. The cousin's friends spent the whole day to cool at the friend's place. \n\nThere was plenty of food everywhere...",
            "For anyone else as confused as I was about that family tree bit in the beginning, I THINK it's op's spouse' grandmother.",
            "Sucks for everyone else, and I've lived on the receiving end, but..did she grow up in extreme poverty? \n\nIt would explain her behavior, despite having money, and a little understanding could lessen your frustrations.\n\nIf not, then maybe she's an irredeemable jerk.",
            "All these comments about people who who don't bring good alcohol to share. Every party I go to is byob & drink your own alcohol. It's not even a thing to take a beer that you didn't bring. Unless you run out then someone will share but it's never expected to be given drinks. Sometimes you trade but if theres a bottle of vodka on the counter and I want some I ask but anyone that helps themselves is looked at as a mooch. ",
            "I have a friend who will always ask for a drink when someone pays for the round, but will never buy a round herself. ",
            "+1 for using the word “comprised” correctly.",
            "MIL and F in the in the same sentence... Hmmm "
        ]
    },
    {
        "post_id": "zkx4n2",
        "author": "clisterdelister",
        "title": "Following the court order",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkx4n2/following_the_court_order/",
        "score": 15779,
        "num_comments": 482,
        "created_utc": 1670941851.0,
        "selftext": "Alt account, mobile. This is the first half of a decade long tale that is currently resolving in a delightful way. \n\nSecond part here linked to comments, was deleted on other sub: https://www.reddit.com/r/MaliciousCompliance/comments/zkx4n2/following_the_court_order/j03smtq/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nOver a decade ago, I came home to find I was being moved out by my wife. We weren’t in a great place, but I was blindsided. I was also served with a protection order that stated I could not come home without prior written permission, I had to go through my wife to see the kids etc. and it was in effect for 90 days. I was devastated. \n\nA relative connected me with a bulldog of a lawyer. This lady was brilliant and no-nonsense. She filed a rebuttal to the protection order, but told me these things take time and we were unlikely to see a judge before the 90 days were up. She was VERY clear that I must follow the court order to the letter. If there was ANY evidence otherwise, I’d be in an uphill battle if/when my wife renewed it. \n\nIt only took one day before my now ex needed me to take the kids. I had crashed at a friend’s house, so I had no place to take them. So we agreed I’d watch them at home. I waited a few blocks away while waiting for an email. Ex called me and I reminded her of the details of the order and that I wouldn’t come until I had permission. This happened twice more that I waited down the street within the first week. So I told her I wouldn’t leave where I was staying until I had the email.  It was about 20 minutes away. I texted her to remind her. \n\nThe very next day she again didn’t email. We were planning on me picking up the kids to take them to school since their school was only a few minutes from my work. However, because I had not received written permission, I ran out of time to drive to pick up the kids and then make it to their school and work. \n\nShe called furious that I wasn’t there. I reminded her about the permission, and that I was out of time. She ended up being VERY late to work that day. \n\nShe then wanted to write me blanket permission to come and go “as needed,” but my lawyer advised against it. Follow the order. \n\nThe culmination of this was a few weeks later when she again forgot to send permission. Her boyfriend was staying over, but didn’t have his car with him. They both had to get to work, and that was the day I learned that he was her direct supervisor. Ex had to call a friend from work to pick up kids and take them to school, and the friend found out. Of course it got out at their work. Within a week of that, the boyfriend was fired over their relationship and my ex was suspended. \n\nBy this time, I had my own place, so the kids ended up staying with me most days. \n\nI later learned that the protection order was the boyfriend’s idea.  Ex was quite mad about it as it  turned into evidence that I wasn’t a threat to her or the family, and the judge was quite harsh with her over it when we settled for support and parenting time. She called it “intentional and harmful parental alienation.”",
        "permalink": "/r/MaliciousCompliance/comments/zkx4n2/following_the_court_order/",
        "comments": [
            "Selfish people love to shoot themselves in the foot and claim you should have been there to stop them. You reap what you sow.",
            "This is the second part that was removed from pro revenge. I’ll maybe fix it later there. This is the second half of a decade long tale that is currently resolving in a delightful way.  \n\nA decade ago my then-wife (now ex-wife) began a relationship with a guy and kicked me out of my house. The boyfriend was instrumental in blindsiding me and planning on how to keep me from my own kids. Ever since, I’ve kinda hated him. \n\nI’ve always been polite and respectful with Boyfriend because he’d become my kids step dad. But if swore if ever I had the chance I’d get back at him. I figured it would be something petty, but then he gift wrapped my revenge and I’ve been running with it for ALMOST 3 WEEKS NOW.\n\nMy kids are mostly grown now. Some in university some in grades 11-12. The uni kids live with me while the high school still go back and forth with their mom. I’m also remarried now. \n\nMy wife and I each have our own vehicles, but my wife owns and insures a minivan for when we all are going somewhere together. The kids are free to use it too as only one has a car. We only have one set of keys, so I put and AirTag on it. It’s a little transponder that tracks its location. I put it on there in case the keys were lost. \n\nAbout 3 weeks ago, one of my older kids took the van out for the night, but ended up staying at his mom’s on the couch. Around 7am the next day, another kid asked to use the van. I pinged the AirTag only to find out it was hours away in an industrial section of another town. I was quite concerned why my kid was out there. \n\nI called him up, and he was at his moms where he said he’d be. He had no idea the van was missing. I called the police and gave them the location of the van. Within 20 minutes they had stopped the van and the driver said he had permission to use it. Lo and behold, it’s my ex wife’s Boyfriend. \n\nThe police weren’t very interested in detaining him as it would be easier for him to just drive the van back to our town and we could sort it out here. However, it wasn’t my van nor was he listed on the insurance to drive it. I asked that it be impounded. In Canada we can’t “press charges” but I was adamant that this was theft and that I wasn’t going to let it go. Since the guy was out of town with no ride, the police did end up detaining him probably because it was easier. \n\nI was given info for the yard where the van was impounded. Since we had the next day off, my wife and I drove out to the yard to pick it up. When we got there, I first checked for damage since it was sitting a little low. Nothing outside. When I checked inside, I found that it was was LOADED with industrial fasteners and cable. Think seismic mitigation. Turns out Boyfriend used my wife’s van to pick up stuff for work. \n\nMy wife turns on her heels and walks to the office. I had to jog to keep up. She asks who has access to the van? They have the only set of keys, so my wife is assured only her or me. At this point I get where she’s going with this. I instruct them that NO ONE access the van but us. I had $35 with me, so I gave it to them as a tip. They promised me that no one would get in there, and they actually moved the van into a secured area within the yard.  Then we went home without the van. \n\nWe weren’t even home from the long drive when I got the first text from Boyfriend about getting the equipment. I explain that we left the van as there were expenses we were not going to pay. Towing, impounding fees, daily storage. I told him that he’d have to pay for them BEFORE I pick up the van. He was super mad and swore he’ll pay me back. I said no way. \n\nWithin an hour I got a call from his boss. They need the equipment ASAP for a time sensitive job. I explain that it was impounded and that I won’t have time to get it until next week now. And it has to be paid in advance. Boss swears up and down at me. I calmly explain that I didn’t steal a vehicle to transport his stuff. Boss was having none of that so I said I won’t tolerates that abuse and hung up. Then I blocked him and his company on every platform I’m reachable on. \n\nAnd that was three weeks ago. Since then I’ve been able to make excuses every single time Boyfriend tries to arrange picking up the van. Often because the kids don’t have the van so I have to drive them. Boss has gotten through a few times using other numbers and sent a ton of emails that I ignore, but I did reply and explain that both my wife and I need about 4 hours to do the round trip and that it needs to be paid for ahead of time. And it’s added up. $25 a day for secure storage plus towing and impound fees, etc. Plus I wanted to be paid for the fuel BF used as well as our travel. Boyfriend and I  agreed on the standard $0.58 per km, and so the boss e-transferred us for the total cost of our driving. By now the van has made 1 trip and our car has done 2. It came to almost $600. \n\nSo on Friday it finally happened. My wife and I drove out and picked up the van. It was prepaid and ready to be released. I dropped off a dozen beer at the office when I picked up the keys and went to grab the van. However, I wasn’t going to transport boss and Boyfriend’s stuff so I arranged for it to be held at the yard at the same rate as a vehicle, unloaded it and left right before it closed for the weekend. I got a call from Boyfriend asking when he can come by with a work truck to get the stuff. I told him it’s still at the impound almost 2 hours away and the office opens Monday at 9. There was only silence on the other end, so I hung up after about 10 seconds. \n\nThrough this I’ve been getting vague updates from my ex, who I’ve got a good relationship with now. She was livid with Boyfriend and was clear with me that any and all consequences were squarely on him. He’s kept his job, but is missing the next pay increase and is not getting his year end bonus. Ex said they’re way to short staffed to let him go, but he’s in the dog house at home and at work. No word on criminal charges for taking the van, but crown handles that, and I’m not suing in civil court.",
            "I hate that the kids were caught in the middle of a pissing contest she created, but good on you for sticking it out and making her deal with the bed she made. I honestly hope the judge throws everything they can at her for weaponizing the system (I hope your attorney also uses this and anything else she happens to feed you as ammunition as well). Good luck, and remember to document anything she says or does in writing.",
            "I love this. There is a special place in hell for the kind of parents that file unnecessary protection orders against their exes or withhold their kids out of spite.",
            "Considering that the protection order was the boyfriend's idea, it sounds like she was cheating before they separated.",
            "My mom tried this and a million other things to screw my dad over but when we (my 2 sisters - now sister and brother) went infront of the judge before he had even finished the question to us we all basically went:\n\nSo who do you want to-\n\nDad.\n\nOk but let me finish the-\n\nDad.\n\nYou don't even know what I'm going to sa-\n\nWe want to stay with our dad. No question.\n\n..............Ok full visitation given to the father.\n\nShould also mention she showed up to court drunk more than once, slurred her speech drunk or sobor (if she ever was) and the judge saw she was trying to pull the same alienation tactics against my dad, who was working full time, ging to school to get a better job etc etc so it was more than just our word.\n\nAfter myself and older sis moved out and my brother went to my Grandmother he ended up falling into severe alcoholism and dieing of it a couple years ago. Yet the Devil Cow still breathes... Oh how life can be an insult sometimes...",
            "The deleted part two, I don’t know how to fancy quote so I’ll just paste below:\n\nAlt account, mobile. This is the second half of a decade long tale that is currently resolving in a delightful way.\nFirst part here: https://www.reddit.com/r/MaliciousCompliance/comments/zkx4n2/following_the_court_order/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\nA decade ago my then-wife began a relationship with a guy and kicked me out of my house. The boyfriend (BF) was instrumental in blindsiding me and planning on how to keep me from my own kids. Ever since, I’ve kinda hated him.\nI’ve always been polite and respectful with BF because he’d become my kids step dad. But if swore if ever I had the chance I’d get back at him. I figured it would be something petty, but then he gift wrapped my revenge and I’ve been running with it for ALMOST 3 WEEKS NOW.\nMy kids are mostly grown now. Some in university some in grades 11-12. The uni kids live with me while the high school still go back and forth with their mom. I’m also remarried now.\nMy wife and I each have our own vehicles, but my wife owns and insures a minivan for when we all are going somewhere together. The kids are free to use it too as only one has a car. We only have one set of keys, so I put and AirTag on it. It’s a little transponder that tracks its location. I put it on there in case the keys were lost.\nAbout 3 weeks ago, one of my older kids took the van out for the night, but ended up staying at his mom’s on the couch. Around 7am the next day, another kid asked to use the van. I pinged the AirTag only to find out it was hours away in an industrial section of another town. I was quite concerned why my kid was out there.\nI called him up, and he was at his moms where he said he’d be. He had no idea the van was missing. I called the police and gave them the location of the van. Within 20 minutes they had stopped the van and the driver said he had permission to use it. Lo and behold, it’s my ex wife’s BF.\nThe police weren’t very interested in detaining him as it would be easier for him to just drive the van back to our town and we could sort it out here. However, it wasn’t my van nor was he listed on the insurance to drive it. I asked that it be impounded. In Canada we can’t “press charges” but I was adamant that this was theft and that I wasn’t going to let it go. Since the guy was out of town with no ride, the police did end up detaining him probably because it was easier.\nI was given info for the yard where the van was impounded. Since we had the next day off, my wife and I drove out to the yard to pick it up. When we got there, I first checked for damage since it was sitting a little low. Nothing outside. When I checked inside, I found that it was was LOADED with industrial fasteners and cable. Think seismic mitigation. Turns out BF used my wife’s van to pick up stuff for work.\nMy wife turns on her heels and walks to the office. I had to jog to keep up. She asks who has access to the van? They have the only set of keys, so my wife is assured only her or me. At this point I get where she’s going with this. I instruct them that NO ONE access the van but us. I had $35 with me, so I gave it to them as a tip. They promised me that no one would get in there, and they actually moved the van into a secured area within the yard. Then we went home without the van.\nWe weren’t even home from the long drive when I got the first text from BF about getting the equipment. I explain that we left the van as there were expenses we were not going to pay. Towing, impounding fees, daily storage. I told him that he’d have to pay for them BEFORE I pick up the van. He was super mad and swore he’ll pay me back. I said no way.\nWithin an hour I got a call from his boss. They need the equipment ASAP for a time sensitive job. I explain that it was impounded and that I won’t have time to get it until next week now. And it has to be paid in advance. Boss swears up and down at me. I calmly explain that I didn’t steal a vehicle to transport his stuff. Boss was having none of that so I said I won’t tolerates that abuse and hung up. Then I blocked him and his company on every platform I’m reachable on.\nAnd that was three weeks ago. Since then I’ve been able to make excuses every single time BF tries to arrange picking up the van. Often because the kids don’t have the van so I have to drive them. Boss has gotten through a few times using other numbers and sent a ton of emails that I ignore, but I did reply and explain that both my wife and I need about 4 hours to do the round trip and that it needs to be paid for ahead of time. And it’s added up. $25 a day for secure storage plus towing and impound fees, etc. Plus I wanted to be paid for the fuel BF used as well as our travel. BF and I agreed on the standard $0.58 per km, and so the boss e-transferred us for the total cost of our driving. By now the van has made 1 trip and our car has done 2. It came to almost $600.\nSo on Friday it finally happened. My wife and I drove out and picked up the van. It was prepaid and ready to be released. I dropped off a dozen beer at the office when I picked up the keys and went to grab the van. However, I wasn’t going to transport boss and BF’s stuff so I arranged for it to be held at the yard at the same rate as a vehicle, unloaded it and left right before it closed for the weekend. I got a call from BF asking when he can come by with a work truck to get the stuff. I told him it’s still at the impound almost 2 hours away and the office opens Monday at 9. There was only silence on the other end, so I hung up after about 10 seconds.\nThrough this I’ve been getting vague updates from my ex, who I’ve got a good relationship with now. She was livid with BF and was clear with me that any and all consequences were squarely on him. He’s kept his job, but is missing the next pay increase and is not getting his year end bonus. Ex said they’re way to short staffed to let him go, but he’s in the dog house at home and at work. No word on criminal charges for taking the van, but crown handles that, and I’m not suing in civil court.\nEdits for clarity and a link.",
            "Dude what a shit boyfriend for having her file an unnecessary protective order. Those are typically used for domestic violence cases for a fucking reason, holy shit. \n\nGood on you for doing your best to stay safe with it though. I'm sorry your kids got caught in it but it sounds like things mostly turned out.",
            "That’s for the inspiration. Currently dealing with something stupid with the ex wife right now. I’m going to text her that we will follow the court ordered agreement with no exceptions going forward. Wish me luck!",
            "Anyone have the second part? It was removed due to acronyms from r/prorevenge",
            "As they said is Star Wars, \"It is a trap.\"  I wouldn't have trusted her with out the permission.",
            "That felt good to read.",
            "I know you did what was right but I can't help but feel for the kids, I hope they come through this with some happiness and no twisted \"Mom\" truths.",
            "Perfect example of FAFO.",
            "Hey u/clisterdelister part 2 was removed. Any chance for an alternative way to read the second half here?\n\nEDIT: u/clisterdelister comes though! A+ OP.",
            "Second half is the best part.",
            "I hope you got full custody of your kids after this. \n\nAnd I wish more judges see through some people’s bullshit and also call out “intentional and harmful parental alienation.”",
            "I am a (young) manager of 90 people. I can't imagine making a move on one of my people. It's not forbidden here but it just feels wrong using a position of perceived power for it.",
            "She forgot to email you the first time. OK, that kind of thing happens. She forgets the second time; kinda weird. By the fourth or fifth time, you’ve got to figure there’s something not wired correctly in her brain. Sounds like she did you a favor by leaving you.",
            "Unfortunately the post has been removed due to acronyms.\n\n Please fix, as I want to hear the whole story.",
            "Part 2 removed because of acronyms",
            "I really want to read the part 2 but it seems to have been deleted, can you share it another way?",
            "It goes to show you need to listen to your lawyer. Props to you for fighting through it and staying in the lines, even with the odds stacked against you.",
            " Ugh second part was deleted but based on comments sounded juicy.",
            "Words cannot describe how spectacularly hard my justice boner is right now. The second part was even better.",
            "Follow up post have been removed.",
            "Second part was removed! Hoping it will repost soon! *Edited for typo\n\nUpdateme",
            "You got a copy/paste of part 2? Looks like it was mod-locked",
            "Reading this I'm so happy that my ex wife and I stayed good friends, co-parent well, don't criticise each other to the kids (if at all).  I've moved on with a new relationship how my ex welcomed to our lives and encourages the kids to have a relationship with.\n\nWhy be so toxic to someone you loved with all your heart.",
            "Good lawyers are worth their weight in whatever currency, Belgian chocolate, or latinum, you use.",
            "This reminds me of my ex. She kicked me out and all that but still demanded that I have access to her apartment at any time to cook, bathe our daughter, and so on. When I finally grew a spine, gave the key back, and cut her off, she called the cops on me who basically told her not to waste their time again. She wanted to have her cake and eat it too, and didn't expect me to stand up for myself, and life slapped her pretty hard when she realized that divorce meant that I had no obligation to help her or listen to her whatsoever.",
            "The continuation is just perfect. Applause for you!",
            "Part 2 has been removed",
            "Can't see part 2. Got deleted",
            "Second part has been removed by the mods. Anyone willing to give me a quick recap, please?",
            "SOS, part two is no longer available. I need to hear the second half!",
            "Your lawyer was 100% right.  I've seen women call the ex to come over. He takes her to the grocery store and buys her groceries. She then goes into another room and calls the cops, telling him that he is there. Guess who gets arrested?",
            "I'm in the middle of 3 years' worth of parental alienation, fraudulent and subsequently dismissed EPO, a court order being violated.. \n\n\nThis story gives me hope 💜",
            "> Ex had to call a friend from work to pick up kids and take them to school, and the friend found out. Of course it got out at their work. Within a week of that, the boyfriend was fired over their relationship and my ex was suspended. \n\nLol. She literally fucked around and found out.",
            "Need to make another link, that second part link was removed.  Im VERY interested!",
            "Part 2 was deleted. What did it say?",
            "Part 2 is gone. The suspense is killing me.",
            "Your story got supposedly got removed from Prorevenge for using acronyms, and unless you edited it, you use 'BF' in place boyfriend once. And even if every instance of boyfriend was BF I feel frigging embarrassed that anyone would complain about that.",
            "As a woman, who had a history of picking wrong, this pisses me off, and is why so many people don't take situations, that can be damn fatal, seriously. I'm glad the judge got in her ass.",
            "Sun tzu says never interrupt your enemy when they are making a mistake",
            "Good for you bro.   \n\n:)",
            "RiP update",
            "Please repost the second part, i am dying to see if she gets all the hell she deserves.",
            "Part Two has been removed.",
            "The prorevenge mods are the absolute worst",
            "prorevenge mods are fucking trash",
            "Part two was deleted, anyone able to recap?",
            "So frustrating, 2nd part removed! Please fix as it is soooo good to read about a***hole parents (and partners in cheating) getting their comeuppance.",
            "God can you fucking imagine how WHIPPED this chick had to have been to cheat on her husband for months, then have hi. Legally kicked out and banned from his home because some guy you work with told you to? I imagine because they both thought it was hot?!? \n\nAbsolutely insane. The things people do to each other.",
            "This is the best malicious post I have seen.  Just bravo , I just keep reading it .",
            "Well, the ex wife literally fu\\*\\*ed around and found out!",
            "This is less MC and more protecting your ass.\n\nYou’re supposed to follow court orders.",
            "Popcorn time.",
            "This and the update are epic OP. Love it!!!",
            "Congratulations 💐  She won the battle, but you won the war 🏅",
            "Priceless updates!! Thanks",
            "Love your attorney. She is amazing!",
            "The post in your link for part 2 has been removed, can you post it here?",
            "Op your other link got removed",
            "Second part was removed.",
            "Second part is deleted",
            "Why did you remove part two? I want to read it.",
            "It seems the second part was removed and we really would love to read the end of the story ....",
            "The second part has been removed 😩",
            "It's fucked that she can just go to the courts and say anything she wants and get orders of protection like this with ZERO evidence.",
            "I wish judges were always this reasonable.\n\nBy the way, if you ever need to go before a judge, do your damnedest to do it early in the morning or after lunch. They're less lenient when they're hungry (https://en.m.wikipedia.org/wiki/Hungry_judge_effect).",
            "“intentional and harmful parental alienation”\n\nand how much blame was placed on the judge that approved the order in the first place?",
            ">She thought she’d be living off me and I’d be poor paying support. Opposite happened. \n\nIn the comments of your Pro Revenge post, you mentioned the above.  Could you elaborate?  Did her income become higher than yours during the divorce process, or was she expecting to get more custody?",
            "Never EVER use children as a weapon. Not only does it hurt them, that weapon almost ALWAYS backfires.",
            "That was epic!",
            "Ex was gaslit and abused, but she passed it along, so no sympathy for her.",
            "Good for you, bud.",
            "I'd get full custody. Make her pay child support.",
            "Good to know that it works out following the orders.",
            "Beautiful.",
            "Congrats on the judge seeing the games.  My ex played games for years, judge let her, friend of the court let her.  Both groups need oversight.",
            "Applaud this man 👏👏👏👏👏",
            "Good lawyer and GOOD FOR YOU FOLLOWING HER ADVICE!\n\nI cannot say how many times clients ignore their lawyers' advice and make things worse.",
            "This hit the spot, both parts of the story. Very good job on your end OP!",
            "So happy for you..glad you got to see your children,and the judge saw it for what it is..parental alienation is a truly vile thing.",
            "Cheating on you and then getting her life utterly fucked. I love you OP. King.",
            "Part 2 was deleted! Could you Maybe post it somewhere else?",
            "u/clisterdelister your second half has been removed by that sub’s mods :-(",
            "As someone fighting the prevalence of parental alienation this is the most amazing Justice story I’ve ever read. Thank you. And glad things worked out in your favour. I think I have a lady crush on your lawyer.",
            "This reminds me of a guy that I worked with years ago. He wasn’t married but had children with his live in girlfriend. They broke up and he offered an amount per month for child support. She agreed but later took him to court to try to get more money. The judgment was for less than he had been paying so he gladly paid the smaller amount while his ex complained that he should keep paying at least what he had been. Sometimes it backfires when you go in front of a judge.",
            " u/clisterdelister Bro, your pro revenge post got removed for having acronyms in it. Hurry and repost it. I wanna read!",
            "The second half got deleted!",
            "Second part is gone",
            "Need to make a new 2nd post/ just place it here…",
            "i want to see the second half but it got removed for violating the sub's rules",
            "The 2nd part got taken down and now I can't read it :(",
            "Second post was removed",
            "Does anyone have the other update? it was removed by mods",
            "Your part 2 got removed by prorevenge mods for using acronyms.  :(",
            "The second half was removed",
            "Part 2 was removed. I need to know what happens?",
            "So good. Well done.",
            "Second part was deleted ;< What happened??!",
            "This is excellent",
            "*chefs kiss*\n\nI’m pretty good at serving revenge cold-but I must bow to the new King. \n\nSir-I must applaud you levels. This is fucking epic",
            "Excellent work.",
            "A decade is a long time. But he played right into your hands. Well done.",
            "This is delicious ! Job well done mate .",
            "That second update is so satisfying. Best kind of revenge",
            "That was absolutely delicious! So wonderful that your ex’s BF gets his just desserts by your own beautifully surgical hand.",
            "Epic! That is brilliant 👏",
            "What BF did comes close to what they call TWOCing here in England. Taking Without Owners Consent. It might not count in Canada though. Either way, good work OP.",
            "Slow clap for the man! Well done!",
            "All because of a jealous bf smh 🤦🏻‍♀️",
            "Revenge is a dish best served cold.",
            "Wear your crown proudly \\*\\*\\*KING\\*\\*\\*",
            "I'm SO fucking glad the judge didn't screw you around with dumb shit. Family court is ALWAYS stacked against the men, even when it's her fault. She got what she fucking deserved",
            "What? A women losing in court when harassing her ex? That never happens!\n\nI know I sound really bad but my brother is also a victim of abusive ex girlfriends who lie and abuse the court system",
            "Nice\n\nvery satisfying read",
            "An ex parte CPO issued with no hearing for 90 days? Uh, where do you live?",
            "\"Over a decade ago, I came home to find I was being moved out by my wife. We weren’t in a great place, but I was blindsided\"\n\n&#x200B;\n\nRight, this is the way it happens to most of the chumps who go into marriage with a 1950's mindset. \n\n&#x200B;\n\nIt usually goes 3 divorces deep and alimony payments in the thousands every month that they finally realize that while they played by the old rulebook, the rulebook actually in use by the wifey and goverment is the new rulebook.",
            "[https://media.tenor.com/ZHZFwArmFiEAAAAC/i-will-nod.gif](https://media.tenor.com/ZHZFwArmFiEAAAAC/i-will-nod.gif)",
            "I don't generally side with the ex-husb, but there's a first time for everything. Good for you!",
            "too many women just really takin  that bitch mode to the nth level. No Wonder Men can't figure them Out. And she let her puss rule over her kids needs. Wow.",
            "Please re-write part 2 because the revenge sub you used removed it over some idiotic rule.",
            "FFS. Half way through the story and second half is removed. And this half doesn't even have malicious compliance in it.",
            "Well now I'm curious. Is this something that could easily be done with any game if you have a secondary display?\n\nEdit: I was wondering why I was getting downvotes for asking such an innocuous question.  Then I realized I meant to comment on another post in r/pcgaming",
            "You sound like a fucking trainwreck",
            "I hope everyone clicked through and read the followup.  As good as this is, it's ten times better!!",
            "!remind me 3 days",
            "Supervise this!",
            "I’m so sad I can’t read part 2",
            "Unfortunately it seems the second part was removed",
            "Part two is removed :(",
            "Fix the second part that’s on ProRevenge!! I want to read the second part!!",
            "Wishing the part two was still available",
            "Bruh does no one see that she was doing it on purpose? She wanted you to violate the terms and come over so she could get more money from you in child support.",
            "Godspeed bro.  As a family law attorney, this sounds like a worse-than-usual situation.. but I'm glad you got outta there, hope everything is good now!\n\nYour lawyer sounds like she was awesome.  It was prudent advice to follow the courts order more rigidly than to work it out.  Usually courts don't mind when parties agree to something, but in a situation like yours (restraining order) it's definitely wiser to be cautious--especially with an ex like that!",
            "That is a great outcome.  I love when cheaters get found out like that, whether infidelity, or lying to get their way.",
            "Is there a mirror on part 2? That sub locked the post and deleted it.",
            "Linked 2nd part is now deleted",
            "my first thought was that the request followed by no written permission was an attempt at getting evidence to bury you in the divorce",
            "Well, the comment (or a post's seftext) that was here, is no more. I'm leaving just whatever I wrote in the past 48 hours or so.\n\nF acing a goodbye.    \nU gly as it may be.    \nC alculating pros and cons.    \nK illing my texts is, really, the best I can do.    \n     \n       \nS o, some reddit's honcho thought it would be nice to kill third-party apps.       \nP als, it's great to delete whatever I wrote in here. It's cathartic in a way.    \nE agerly going away, to greener pastures.     \nZ illion reasons, and you'll find many at the subreddit called Save3rdPartyApps.\n\nAs of June 30th. 2023, goodbye.",
            "Part 2 got removed because “no acronyms”… what??? Anyways, what’s the follow-up Op?",
            "godamnit part 2 got nuked by mods",
            "It’s dumb, I heard your story on Tiktok already with those stupid robot voices and dumb mobile game playing below. Stupid content thieves.",
            "How the fuck do you not kill this man? I mean christ. Someone did me in like that I would have his murder planned before the end of the week.",
            "You had kids with this woman?? Jeez.",
            "I just read the 2nd part. Delicious.",
            "Epic! That is brilliant 👏",
            "Had permission to take the van, my foot! He probably grabbed the keys and left before your kid woke up!",
            "Delicious.",
            "This is great. My favorite post here so far.",
            "Dude, this was so freaking sweet.  Thanks, I loved it!",
            "You totally owe your attorney.",
            "This was such a satisfying read!  Go get em’ tiger.",
            "Freaking brilliant. Omg, just brilliant. I think I actually wept a little.",
            "Beautiful. 😆",
            "The grind the ex wife much harder to the extent she pay compensation."
        ]
    },
    {
        "post_id": "10uxibt",
        "author": "Crafty_Editor_4155",
        "title": "Dead dog wasn’t an acceptable excuse to miss work.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10uxibt/dead_dog_wasnt_an_acceptable_excuse_to_miss_work/",
        "score": 15741,
        "num_comments": 598,
        "created_utc": 1675657593.0,
        "selftext": "another post on the sub (r/anti-work) reminded me of this story. actually commented this but decided to post it here since i think it fits. \n\n(sorry bad grammar, writing on mobile)\n\nso when i was entry level a long time ago, my boss made me come in the day after i discovered my dog dead in my room from choking on something it grabbed and swallowed on my desk. there were obvious signs she panicked before she passed away. tried to call in a sick day because i had a combo of grief and guilt but employer wasn’t having it, i was only a few weeks into the job so didn’t have any sick days (was technically on contract in my probationary phase) and i was fresh off of unemployment and needed this job.\n\ncame in visibly sad. tried to ask to go home one more time. boss didn’t care and told me to “man up it’s just a dog” so i was like “fuck it” and just let my feelings take over. i was openly crying and sobbing at my desk while working on my project and answering emails (this is one of those modern open floor plan offices / design studios with no walls and tiny partitions instead of cubicles) and EVERYONE can see and hear me. i’m literally wiping tears off my face and desk as i work. This is also early 2000s where the term “toxic masculinity” wasn’t coined so seeing a grown man openly sobbing at his desk like this really threw people off.\n\nwhen asked by coworkers and people passing by what happened, i told everyone what happened to my dog AND that i didn’t even have a chance to take care of her body so she was lying in my bed dead wrapped in my blanket until i could get home and figure out her cremation/burial stuff. when they asked why i was even at work, i very loudly stated that my manager didn’t think it was an acceptable excuse to miss work. \n\nneedless to say, she looked like a monster and i was told by her boss i’d have 2 days paid to mourn and take care of my dog and i shouldn’t have had to come in.\n\nEDIT: didn’t realize this post would get so much attention. also love all the people sharing their stories. this has been an uncharacteristically uplifting post on this sub with mostly warm comments and only one toxic/troll comment that i’ve counted haha.",
        "permalink": "/r/MaliciousCompliance/comments/10uxibt/dead_dog_wasnt_an_acceptable_excuse_to_miss_work/",
        "comments": [
            "i remember going to school the day after my dog died.\n\ni guess i looked shell shocked cause a teacher pulled me aside and said i could have 'study period' for the rest of the day.\n\nbe kind, everyone.",
            "We all need to take a moment to applaud this incredible level of vulnerability. You sir have no fear. I wanna be you when I grow up.",
            "We had to euthanize our cat over the days between Xmas and NY.  His urethra blocked the day after Christmas, and despite us doing surgery to unblock him, he was re-blocking. \n\nI sent a message from the fucking euthanizarion mourning room that we were about to say our last goodbye and that I wouldn't be back till the day after NY.   I was told that \"no company gives time off for pets and it's not fair to the one other person who was in the office that I was going to be gone\" (office owner and her kids (managers) were off on vacation #15 in Michigan for the holidays, and didn't want to have to answer the few emails that came in).  I walked in the next day, left my badge, turned in my hours, and sent a message that I was resigning. \n\nLast I heard they've gone through 2 folks in the last month because of the stress and workload I dealth with.  \n\nI wasn't asking.",
            "She didn't look like a monster. She was a monster.",
            "That's absolutely horrid. Some people have no empathy. One time, I was tearing up at work because my guinea pig was having emergency surgery. I told my boss and she laughed.  The guinea pig didn't make it through the surgery, so I took 2 days off.",
            "2 days after my grandpa died the head of the nursing home I work at said I had to come into work \n\nI was very close to him so I was basically a zombie numbly going through the motions \n\nPeople kept asking me what was wrong because I'm usually talkative\n\nI tell them \n\nALOT of people lost respect for the boss for not giving me the 3-4 days everyone usually gets surrounding a death of a loved one",
            "That must have been absolutely devastating :( \n\nWhat an absolutely horrid manager, she 100% deserved all the flak she would have coped from making you come in.",
            "\"Just a dog.\" What the ever-lovin'.... pets are not objects, they are beloved friends and family.\n\nEven from a purely ice-cold pragmatic view, there's a deceased animal that needs to be returned to the earth in a living space. That could get them in all kinds of trouble if someone notices. Give them time to cremate or bury their pet!\n\nSorry for  your loss, and I'm glad grandboss had a functioning sense of empathy.",
            "My mom beat my child hood dog one night for peeing on the floor, found her dead the next morning, made me help her bury it in the backyard and got to school 5 minutes later.  And she was a teacher!  Turned out she was just old and potty on the floor due to undiagnosed issues because mom wouldn’t take her to the vet and she died.  And yes, mom made me handle the body and bury it then go to school.",
            "Every person in the office who owned a dog went home and gave it a hug that day. And looked side-eyed at the manager.",
            "The only malice here is from your boss.\n\n\nI am.so sorry for your loss. That's heartbreaking.",
            "I had to put my cat down, who I had since I was 11, and my sociopath of a boss asked me if I could schedule it when I wasn't working. Like, I wasn't asking permission, I wanted to be with my cat for her last moments. She actually died on the table before they could give her the euthanasia drugs, she was ready to go.\n\nI have PTSD from working for this monster. Way more awful stories.",
            "I had people I barely knew ask me to let them know if there was anything they could do to help after a beloved cat of mine passed away suddenly of unknown causes and I was severely distraught. I took a couple of days out of classes and nobody thought that was unacceptable or unexcusable when they asked about it. Some people may not treat their pet as family but not everyone is a monster and it's still reasonable to understand someone would grieve. People take personal days for less.\n\nBoss needs to learn the word discretion and use it.",
            "\"just a dog\" always boils my piss.. Fuck man i think a dog is possibly the only animal that'll love their person more than they love themselves",
            "This will surely get lost in the comments but saying \"man up its just a dog\" reminds me off an old roman inscription on the grave of someones dog:\n\"Thou who passest on this path, If haply thou dost mark this monument, Laugh not, I pray thee, though it is a dog’s grave. Tears fell for me, and the dust was heaped above me By a master’s hand.\"",
            "Last year my cat who I had for almost 20 years past away. I didn't have any paid time off so I had to go into work. I was in no shape to be there which anyone who looked at me could see.  After an hour of being there I told my manager I needed to leave. I work in a grocery store in a small department as a personal shopper. It's a very busy department and we were very short on staff so she called her boss to find me coverage from another store. It took a few hours but 3 people showed up so I could go home. Losing your pet is like losing apart of yourself. It takes time to heal from that loss.",
            "I’m laughing so hard at the fact that your manager got what he deserved for being so heartless — you told him you weren’t mentally able to work and then he’s surprised to find that you… actually aren’t mentally able to work! \n\nSorry to hear about the traumatic death of your dog. He’s safe in doggo heaven :)",
            "I’m so sorry for your loss.  I’m crying just reading this story.  I lost 2 beloved pets to a tick and to a busy road and was inconsolable both times.  Your manager was heartless!",
            "I am so so sorry you had to deal with such a horrid manager when going through probably one of the worst days of your life. No one should have to feel that pain. \nThat managers Karma will find them. \n\nWhen we had to put one of our boys down. He kept getting blocked even after surgery.  Nothing worked. He was in too much pain & his diabetes was getting worse by this point. The vet told us the best thing was to say goodbye.. He was scheduled for 7am, and we had to rush him in at 4 am, to say goodbye.. \n\nI went to work that day because I couldn't reach anyone on the sick line or work line. My boss & HR pulled me aside and asked me if I was okay, as I had obviously been crying. \nI told them what happened. \nThey gave me 3 days off paid for mourning. \nI was very lucky.",
            "I am so very sorry for your loss.\n\nI keep this comment on hand that helped me when I lost two of mine over the past few years. Sharing in case it helps you. It makes me cry every time I read it but in a clean kind of way.\n\nComment by u/Kromulent posted [here](https://www.reddit.com/r/Stoicism/comments/oshe2b/i_would_like_to_make_sense_of_having_to_put_my/).\n\nI have an old dog in kidney failure too. Haven't told her yet, she just keeps being happy.\n\nI'm old too, and I've had animals my whole life, mostly cats and dogs in various multiples. Do the math and you can see I've been here before.\n\nThe way I reconcile it is pretty straightforward, and well in line with the overall Stoic approach to things. It always begins the same way- see things plainly for what they are, understand the natures of the things involved, and respond reasonably and virtuously to the reality around us.\n\nEvery day I care for my animals, keeping them happy, keeping them safe, shepherding them through their day with joy, and without harm. When they get old and approach death, nothing changes. As crazy as it sounds, the day I take them to the vet to be put down is the day that I have been working for all this time - I have successfully taken them the whole way. They did not get lost, they were not unhappy, they got to live their whole natural lives the way I wanted them to live it. We made it. We got there together.\n\nWhen they are gone, my feelings for them don't change. Their bodies are taken but my feelings are my own; I still love them, I am still happy to think of them, my heart is still open.\n\nWhat has changed is that I have a space for another thing to love, and the cycle continues again, when I'm ready to start anew.\n\nTheir bodies, our bodies, everything external to us will always change and always come and go. Our love, our care, our joy belongs to us, and we apply it to what we have and to what is new.",
            "I had a coworker who's family dog died, and our boss wouldn't let her take time off despite her having PTO available. A month later, the boss's dog died and she took a whole week off.\n\nAt that same company, the dad of an employee in a different department died. One of his supervisors made him bring in a copy of the death certificate.\n\nToo many employers are pure evil.",
            "She didn’t just look like a monster - she is a monster.\n\nOur business has a very open bereavement policy where most members of a person’s family are covered for a week’s pay while they mourn their death. I’ve had a member of staff tell me “my dad died - I only need a day off to pay my respects at his funeral (they were estranged) - can I bank the rest of this bereavement entitlement for the day my dog dies? I’ll be a mess and will need the time more then”\n\nMy answer was “absolutely”",
            "I was sitting in one of my college classes when my dad sent a text to me and my sister to let us know our dog had passed (he texted because he knew i was in class and my sister was at work). I was shocked and looked at my phone for probably a solid minute. I then proceeded to cry my heart out, trying to be quiet as possible as to not disturb anyone around me. My professor was walking around the class to make sure we were doing our work correctly, stopped at my station because he noticed my head was down and I'm not doing anything, and asked me what was up. \n\nI couldn't speak without being too loud (i cry pretty hard), so I typed out on the computer that my dog had just passed. He told me to save my work and head out for the day. I also had the same professor in the following class that day and he let me skip that class as well. He was genuinely the best professor i had while at that school.\n\nHe also had known me due to being in his classes previously and knows that I don't show how sad/down I am in front of others, so I think in his mind he figured that if its bad enough for me to burst into tears in the middle of a class, I must've been devastated (I was).",
            "I'm sorry for your loss (regardless how long ago it was)\n\nThat boss shouldn't be a manager of people! If you have no compassion for another human then don't be in charge of managing people! \n\nWhen we lost our puppy my boss proactively told me to take time off, I only took a day (I don't have a strenuous job and work from home mostly so I didn't need the time I could self manage around workload) and I still got a telling off for coming back to early! \n\nHe was a great boss though, I understand people are in different situations but just having compassion for how someone else feels goes a long way!",
            "I'm sorry, for your loss. The manager must've gotten a lot of dirty looks after you revealed of what she/he said.",
            "I would have brought the dead dog in, citing you couldn't leave a dead animal in you home or vehicle so you needed to bring it with you to work until such a time that you were able make it to an open non emergency clinic to take care of it.\n\nBonus points for asking the same boss if you could store in their office while you worked",
            "One of my coworkers was chewed out because his cat died. Our boss ranted you could get them free in the Pennysaver, they always had tons of kittens available, and were replacements as common as \"flashlight batteries.\" For the next few days, he teased my coworker about it in meetings, saying stuff like, \"In case of a critical event, or in \\[coworker's\\] case, his fuckin' cat has hairballs or something,\" and stuff like that.\n\nFinally, another coworker called him out, stating his behavior was psychotic and cruel.  He then said he was reporting our boss to HR for sadistic behavior if the coworker didn't. And while our boss was later forced to apologize, you could tell he was doing so \"because of some bullshit HR thing,\" with the speed-reading speech and eye rolling. I am so glad I don't work for that guy anymore.\n\nI haven't had a cat since I was a kid, but if someone said that about one of my dogs? I would really had to suppress some of my baser instincts to correct my boss' behavior permanently, and would probably just walk out of the building without another word. I don't care if your beloved snake or lizard died: a pet is a pet, and a member of the family. I don't get the machismo some people have \"getting over it.\"  I can't conceive of what horrible childhood someone must have had.\n\nBut then again, I have seen actual documented work policies about funeral leave that confuse me.  One place I worked at said you could take at maximum 3 days of bereavement for a parent, sibling, or biological child, but only one for a grandparent, step parent, step child, adopted child (!), or half-sibling, and only with prior manager's authorization. Anything else was considered a day without pay. Like, what psycho sorts these categories? God damn.",
            "tangential to this, but I had a thing in highschool where if I ran into a situation where someone tried to escalate manliness with me I would say \"if you do that I'll use my ultimate attack\" \"Oh YEAH?!and WHAT is THAT??!\" \n\n\"I'll hug you and have a good cry... no one knows what to do with a big man crying all over them\" and it would always defuse the situation because they didn't know what to do and I legit scared them.",
            "I lost my dog to an accident many years ago.  My wife & I lost a cat to CHF about 4 years ago.  \n\nGrief never goes away & neither does the hurt, but know in your heart, OP, your companion is looking down on you & sometimes coming to say Hi.  When you’re ready & when they see it, they’ll send you a new companion to love.",
            "I had an interview and mentioned in the interview I had a dog. After, I drove back to my apartment which was a few hours from my family. When I called my mom to let her know I was home and the interview went really well, she said that they had taken our dog to the vet to be put down. I had seen him that morning, he was old and tired but I had expected to see him over the weekend.\n\nShortly after, the recruiter called to tell me that I got the job, and to let him know if I wanted it. I started crying and told him our dog had been put down, and he very calmly told me he was sorry, that he had lost his cat recently, and to give him a call in the morning. In the meantime, take it easy, the job was mine if I wanted it.\n\nI took the job. I still work there.",
            "Oh man, this brings some stuff back up! \n\nIn high school, my grandfather who I was very close to passed away. I missed an afternoon for his cremation and my AP chemistry teacher made a big deal out of it, scolding me in front of the whole class about not taking her class seriously and missing a quiz (I arranged to take it early, so I didn’t even actually miss it), and so on. She spent a full half hour on it, and made me cry in front of everyone. \n\nI spent the rest of the year making a big show of sleeping in her class and made sure to ace every quiz, homework and exam. Got the highest grade and made her feel like total shit for making me cry. I made a point of loudly commenting multiple times a week that the material was so easy it didn’t even need a teacher. Still hate that lady and hope she has horribly irritating days every day.",
            "Boss not a pet owner, her boss is and understands how much a part of your family they really are.\n\nSorry to hear of your loss. We have lost three dogs over the years. It's always tough.",
            "At least in this modern age we have John Wick to teach people that it's never \"Just a dog\"",
            "Some people just have no sympathy. I had a teacher in 10th grade who wouldn’t let me make up a test I missed when my grandma died. The Vice Principal ended up having to force her to. Like the VP actually stood in the classroom until I’d turned in the test.",
            "I think this is a classic example of the transactional manager vs the people manager. Not many employers have rules around pet grievance so the transactional manager looks at the rules, doesn’t see anything and says that nothing can be done. The people manager has the empathy to look beyond the rules and make a decision based on what’s best for the employee.",
            "I wish I had what you did. When I put my kitten (yes. Kitten. 3 months old) down, I called in. They told me they'd write me up. I told them go for it. I'd take a write up over me unable to do my work (truck gate security officer) and or end up killing myself driving there because it takes 45 minutes to get there, which I havnt been able to stop crying, and my life wasn't worth my job. Didn't get wrote up. But I told him I'd choose my pets and family over my job any day.",
            "This is absolutely killing me.  \n\nMy good boy, Loki, recently passed.  He died while my daughter was at school.  Her dad and I made sure to align our schedules to pick her up together from school that day so we could tell her together and be with her.  She cried and cried and cried. \n\nIt was fucking heartbreaking. I can't imagine not giving a child space to grieve a profound loss.",
            "Your first mistake was giving a reason. You called in because you're not feeling well. Because, well, you weren't!\n\nIf they ask why, or what's wrong, you tell them it's personal. End of conversation.\n\nSo many times these days we feel like we need to explain everything. We really don't. It's okay to say, \"it's personal\", and repeat it as often as you need to. If your manager persists, you tell them to talk to HR.",
            "I'm sorry you had to deal with such a traumatic situation and experience. I can't imagine not having any time to grieve for one of my dogs. 😢",
            "Hopefully that manager learned the lesson that so many need to learn. People are the top resource any business has. Take care of people and people will take care of the business. So many managers have zero idea how to lead it isn’t funny. \n\nSorry this happened OP, I’d have been a total wreck myself. You should have been treated by your boss better.",
            "One of the worst managers I’ve ever had gave me the day off when she learned my cat that I’d had for 15 years died…\nI’m sorry you had a worse manager",
            "I had a German Shepherd. She was 12 and a half when I had to put her down. I was so utterly devastated and just destroyed inside. I can't remember crying that hard ever. I wore myself down so much that I ended up missing half a week of work because I ended up with a sinus infection and ear infection and bronchitis because I let my immune system down to nothing from grief.\n\nJust a dog? No. A family member. My best friend. My first child.",
            "Many years ago we had a puppy that ended up having a lot of medical issues.  I'm an elementary school teacher.  I get ONE paid day to set up my classroom before school starts.  I had already put in many unpaid days on my own to get ready, and trust me, there is no reason in the world that I would want to make up some excuse to miss this one day that I desperately need to work in my classroom.  On this day the puppy was very ill and my vet told me to take him to a specialist several cities away.  I called my principal to explain and he was rather a jerk about it, but he did let me go.  I took the puppy in, and long story short we had to put him to sleep and it was terribly traumatic. I went back in to school and worked late into the evening because my classroom still needed to be ready.  Next day, my principal asks me, VERY sarcastically, \"Sooooo, how's the dog?\" Looked him right in the eye and just said, \"He's dead\" and kept walking.\n\nHe was VERY contrite and apologized to me afterwards.  He really wasn't that bad of a guy.  He had his own dog that he seemed to really love. Don't know what got into him that day. I rarely ever missed work, so it made no sense to give me a hard time, but I think he learned a really good lesson that day.",
            "just gave my employee the day off to mourn his dog. \n\nfuck that, it’s not worth a good employee",
            "Some managers are reprehensible pieces of shit.",
            "Dogs are family.    She's terrible.   Good for you!",
            "Can say there are a lot of things I hate about my job but there are things like this they do care about.  When my dog died I literally told my boss I'm not coming in till I feel better.  He said ok and didn't comment further.",
            "Employee at a major pet retailer here. They recently instated a pet bereavement policy to give time off for these circumstances. Sure this is wide open for abuse, but for those who need it, it really makes these situations so much easier. \nThis is for any pet. Dog, cat, reptile, bird, hamster, yes, even a fish.",
            "I had an employee of mine take a full three day bereavement leave because her pet rat died. I worked in hospice and had to model that grief is grief and although I may not have an affinity for rats, this nurse did and it was her pet so….I okeyed days off.  \n\nYou have to take care of your employees.  I just left an incredibly toxic workplace for a much better job.  Others are leaving my old place in droves and they can’t find replacements.  It’s all because of how people are treated.  No way I’m going to spend an entire ten or twelve hour shift surrounded by toxicity and drama and endure micro aggressions from my boss at every corner.  Sit and spin",
            "Much love. If you give me your dog's name I'll plant a succulent. Hell. I'll do it anyway. For all the loved good boys and girls. \n\n\nMy brother died and I just broke down. My nurse boss said go outside and smoke. And if you need another day off we have you covered. \n\n\nGood job vs bad job. They gave me 2 days off for my cat too. He was 19. Rimmy.",
            "When I had to put my first dog to sleep after her lymphoma was no longer treatable, it was the worst day of my life. I could not imagine feeling such grief again. I began volunteering in dog rescue to honor her, and over the years I adopted and subsequently lost 6 more of my beloved friends.  It never got easier. Yet I will continue to expand “my pack” because there are so many dogs waiting for a forever home, and I can’t imagine a happy life without being surrounded by their joyful, unconditional love. People either get this, or they don’t, and generally I’m not interested in being around the latter.",
            "Last October, we had five cats in our house. By December 1st, we were done to three. Three were my roommates/best friends cats. Two of them belonged to me. In October, my roommates 22 year old cat let us know it was time. It was incredibly difficult but he had the means to have the vet do a house call and that made it easier. It still sucked. My manager at the time was beyond understanding and let me take off the full day and part of the next. \n\nThen, the day after US Thanksgiving, we had a knock on our door in the evening. It was a neighbor two doors down letting us know that my cat had been hit by a car. I had a whole weekend to grieve (tbh, I’m still randomly hit in the gut with grief) and my boss still allowed me the space I needed from work to take care of his body and my emotional well-being. I don’t simp for capitalism, but companies that have understanding for significant life events are the best.",
            "If *anyone* said \"It's just a dog\" to me in that situation I wouldn't be able to stop myself from throwing a punch. I'm glad the supervisor was a human, and sorry for your loss.",
            "I'm so sorry this happened to you. Damn that must have hurt.",
            "I worked for a Japanese manufacturing company a few years ago. I'd been there for over seven years, they wouldn't give me a day off after my one of my dogs passed from cancer. I told em to eat a bag of dicks and I took that afternoon and the next day. Fuck your employer, they don't care about you.",
            "“Just a dog.” = fighting words",
            "she didnt just look like a monster, she is a monster.   \npets are family.",
            "I have a human baby and two fur babies. Although my love for my human child is far and away superior to my love for my dogs, I still feel comfortable saying I love them like they are my children. They are a part of my family and if I found either of them like that I would not be fit for work for at least a day. Sorry you had to go through that.",
            "Nah. Nah. Dead pets are a valid reason. Fuck this. Entirely.",
            "Dude, I so feel for you. I was a wet and blubbery mess when our first dog passed (looked like a heart attack on our walk, barely a block away from home), and I stayed that way for a while.\n\nNo one has ever said it to me, but I hate the saying \"its just a dog,\" or \"its just a pet.\" No, its not \"just\" anything. Its a family member, plain and simple.",
            "Reading this made me thankful for my employer. I lost my little guy last year, and they were nothing but understanding and kind. My CEO even gave me a quick call, told me everything would be ok and that I was supported (I had only started 3 months earlier, and was nervous about any time off). Their kindness and understanding have genuinely made me a devoted employee. I’m sorry you weren’t given the same understanding OP from the beginning.",
            "Your boss’ boss takes the win for being a champ.",
            "At my old job I worked overnights, so my dog was really sick to the point we had to put him down so we scheduled the appointment a few weeks in advance and when they did my work schedule, I was working overnight the night before. So I got off at 7am, and his appointment was at 9am that same day. \n\nMy coworker texted me the night before asking me if I could stay late that morning and I said no and explained why (usually I would've said yes but obviously these were extenuating circumstances) and she said okay. The next morning comes along and she shows up late and didn't understand why I was pissed at her because she was late because of some thing with her kids school and her living kids were more important than a dying dog. \n\nLuckily, my mom picked me up and had my dog in the car so I got a little extra time with my boy (she was pissed at the lady too since she had to sit out there and wait for me to come out)",
            "This is why you never give a reason for PTO, you just state “I am taking the day”, they don’t need to know anymore.",
            "Your manager didn't look like a monster she fucking was one. At least in that moment she was monstrous.",
            "My mom forced me to go to school after every death in our family including grandparents, uncles, pets, etc... I will always hate her for that. People grave in different ways and forcing how you think someone should grieve is massively fucked up.",
            "I used to work at a small grocery store in the produce section. I lived with my mom, who went to work at 5am as a courier, and my handicapped little brother. My brother had a dog that died suddenly one morning in his sleep. He loved this dog so much. My mom couldn't come home to take care of the situation, and her job is more important anyways. So I call out from work, it was only a four hour shift anyways. My mom calls the vet that she's friends with, who gets someone to come over and take care of his body. He was a big dog, so it took me, my girlfriend, and the helper to lift him. It was a very hard day with a lot of crying, but I was there for my brother and he wasn't left alone with the body of his dog in the kitchen.\n\nWhen I come in to work the next day, my manager has the audacity to tell me \"It was just a dog\". He thought it was more important that I come in to sort fruit for four hours than to prevent my handicapped little brother from being traumatized and alone. He knew our family, he knew what that meant. \n\nSome people are incapable of empathy, especially if money is involved.",
            "Fuck. That. Manager. Also, even though this happened some time back. I'm sorry for your loss.",
            "Had something slightly similar, not as bad, happened to me. My cat was dying, laying in the bathroom for 2 days in a corner. It happened during the weekend so Monday I had to call the vet to euthanize her, call the cremation center and everything while I was at work. Eventually the most heated hours at work were over and my coworker send me home because I couldn’t keep working in this state. (Disabled care) so I went home and called my manager, telling him I needed to call in sick for the next day because I was euthanizing my cat in the evening. He started screaming through the phone that it’s not his problem and why did I have to choose that day. I tried to explain the situation, but he wouldn’t have it. He even told me that my coworker (who saw the state I was in, knew I wasn’t fit to care for people who are very sensitive to any change in behavior) should’ve never send me home because it’s not his choice to make and I should just come in the next morning. Personal life should NEVER interfere with work and I should plan around it. Eventually I just told him ‘one way or another, I won’t be able tomorrow with a massive migraine. Take it or leave it. You can find my replacement now or wait for my coworker to call you in panic tomorrow when she finds out she has to work alone.’ When I told this story the next time I was at work all my coworkers were baffled that our so sweet manager would say things like that! \n\nI had that cat for 13 years, I almost can’t remember my life before we got her because I was a kid, they can say ‘it’s just a pet’ all they want, but I don’t care.\n\nHe pulled the same shit when my uncle died and I asked for a day off to go to the funeral.",
            "man this feels so fucking good to read. when my cat died unexpectedly at a young age i was devastated but also working at a mcdo. which didnt care. and customers didnt care either. i was openly crying \\[not for the first or last time, same place forced me to work on a freshly sprained ankle\\] and no customer said a word. its so normalized to mistreat fast food people",
            "\"just a dog\" man that made my blood boil reading that, what a sociopathic thing to say",
            "When I had a pet pass away (I’ve had two pas in the same three months) I told my work relatives passed away. Fuck em. I cried harder for my dog and cat than I did for anyone except my grandfather.",
            "The line \"it's just a dog\" absolutely boils my piss. 1. I have several family members I'd rather lose than my dog. 2. How dare you dictate to me what I'm allowed to grieve about.\n\nI had to treat patients the day I lost my dog, and it was extremely hard to concentrate, let alone have empathy.",
            "You don't ask to not come in, you tell them that you are unable to come in.",
            "That fucking sucks I'm so sorry",
            "Anyone who says “just a dog” is a psychopath.",
            "Some people don’t view dogs the same way other people do. For some of us, they’re family, and some people, they really are “just dogs.”  \n\nAnyways, glad you got the time off, sucked you even had to go in.",
            "This is also great r/maliciouscompliance but I’m so sorry you had to go through that.",
            "Wow that’s so effed up. “Just a dog?” Smh. I hate that u went thru this but props to u for ur “compliance”- now everyone saw what a AH she is.",
            "My partner let my two small dogs out to potty and they escaped yesterday morning. We live next to a busy road next to an even busier interstate and I spent the next 30 minutes looking like an absolute lunatic as I bawled looking for my dogs in my pajamas. At that point I didn’t care how I looked to people, though. I am so so sorry you had to deal with that.",
            "Fuck this manager who denied you personal time.",
            "Wait, people arent thrown off by others crying in public? Women or men crying in public always throw me off. One of my coworkers who was always joyfull and joking around came to work a few years back and, with a serious face, just said that his dad's dog just died and it was the last thing he had from his dad. That fully threw me off i didnt know what to answer. I still remember everything from this even though its been years",
            "Dude this is so fucked and reminds me of the last time I worked in restaurants. At a place seven years while my GMA was living with me on hospice. She passed at five in the evening while I was at work. Owner wouldn't let me leave as I was the only manager there. Then he told me I could only have ten mins for the funeral a few days later. I also had to wear my work attire as I had no time to change. Now when an employer asks me for ANYTHING extra I tell em to get fucked.",
            "EXCELLENT.  Literally if anyone did that to me they would definitely suffer some consequences.",
            "My dog passes, I'm taking a week off. She's my best friend and she familiar!",
            "So we are clear…an employer doesn’t get to decide what and “acceptable” excuse is. Simply state that you have a critical personal matter that demands your attention.",
            "Yikes, I kind of want to know what she choked on so I can keep it away from pets 😬 \n\nNothing to feel guilty about though, pets and even kids do dumb stuff all the time, you can’t really prevent every possible mistake. Usually it doesn’t kill them. Occasionally, it does.",
            "Props to the bosses boss for making it right, as best they could. \n\nAs a boss I’ve given people paid days for the loss of a pet.  They’re family and I cannot reasonably expect somebody to be anywhere near their best, to say nothing of how morally wrong it would be. \n\nI likewise have been given time off by my boss when I’ve had to see to a dog (never a death but for emergency vet visits, surgery, and such)",
            "I was just saying last night, I hate when people treat a pet death like it’s not a big deal. For many people, they lost their best friend, the only thing who didn’t judge them. Good for you for openly grieving.",
            "People that don't understand the loss of a family pet are just monsters. I'm sorry you had to go through this but great payback on your boss.",
            "I feel that people reacting like that to someone's pet's death is a likely indicator of some kind of sociopathic tendency.",
            "This is horrible, Im so sorry Op. So thankful to work for people who, when my dog died, said to take whatever time i needed and not to worry about coming back until i was good. I seriously cant believe some people. Honestly, its as equivalent to me as waking up to a child dead. Some people just dont get it.",
            "My mum went into work the day after she had our dog put to sleep. Her boss told her not to come in the rest of the week but she couldn't bare an empty home and work was somewhat of a distraction. \n\nSome people will never understand what pets mean to others and how they change your life.",
            "Why is it so often that people disregard basic human functions, the very characteristics that make us human, and insist that we must be perfect robots who do everything they say with no complications.",
            "It's been half a decade since I lost my last dog and I'm still not over it. I still see her in the corner of my eye when I forget she's not here. I'm so sorry, can't imagine your shock. Good on her superior at least!",
            ">she looked like a monster\n\nIt's \"was\" a monster.  That shit is messed up.",
            "At the complete opposite end of this spectrum, I feel blessed to have worked at a company where *everybody* cared.\n\nBoth of my cats died within six months of one another...one was fast and unexpected, the other I had time to say goodbye, but neither was easy and I had to make the decision for both.\n\nAfter the second one went, I just couldn't face being at home alone, and my work at the time was low key enough that I figured I could get through it and keep myself busy in the process. I let my boss know I was coming in even though I'd been told I could take a few days...and holy crap, everybody knew by the time I arrived, nobody gave me any grief about it, and everybody - from the CEO on down - kept an eye out for me and helped me through it.\n\nI miss that job and those people a lot. Wish the company hadn't gone under.",
            "Really grateful my workplace literally has it written in our policies that you can use sick time to mourn the loss of a pet. It's a unique love, and a unique loss.",
            "Jesus fucking Christ. Wtf is up with American work culture?",
            "I thought you were going to say that you brought your dead dog in with you.",
            "Sending love and hugs\n\nI had a boss like this.  My kitty passed less than 1 month after my boss's kitty passed.   My boss took off over a week.   I got yelled at when I asked for 1 day.   Because I had an 'essential' job.    \n\nSo glad I left those fine upstanding religious nuts.",
            "I am forever grateful to the boss I had at the time when I had to put down my beloved Susan (the cat). He was so understanding - “She was your baby for 14 years, you do what you need to do.”",
            "WOW. Don’t DM me their address or i might have to relocate the next hornets nest I find to their bathroom exhaust vent",
            "I showed up to our team call for work the day after my dad died in 2019. My boss asked if I was OK, and I started crying and told her what happened. Luckily, we were a small, close team. She was like, \"What are you even doing here, take the time off you need.\" I said, \"I didn't know what else to do or where to be. Thank you. I'll check in in a few days\". Then I drove out to mom's to help her make arrangements, and it was like, \"oh yeah, this is where I'm needed\". \n\nI was just still numb from the news, and existing on autopilot made it \"not true\" for a few hours. Denial really was my first stage if grief. I'm grateful Lingda kicked me in the pants.",
            "This is heartbreaking . I’m sorry for your loss",
            "I really can't understand people who think a dead pet isn't a reason to mourn. Pets, especially larger & intelligent ones like Cats and Dogs are essentially family members, even if they are merely considered 'objects' by Law. When you live with an animal, you have a bond to it in some way or another, and if that bond suddenly rips apart because the pet dies? You bet it's gonna hurt.\n\nAs a fellow pet owner, I know the feeling of loss ; In total, I lost 3 Cats in my lifetime ; we later found out that one of them must've been terminally ill in the animal shelter when we got him already ; They didn't tell us - maybe they didn't even knew - but I like to think that due to us his last few months were at least very pleasant. I still remember him vividly, he was a big cat, pure black and nothing but muscles. He looked like a miniature black panther, had a fitting personality too and when you looked in his eyes you could've gotten lost in them. Anyways, the other two died of old age with 17 and 18 respectively. Say what you want, we take good care of them, that's a pretty decent age, especially since one of them was a stray who lived on the street for quite a while before we got her. But yeah, I dealt with that same loss.  \nI would ALWAYS give someone paid leave for several days, until they took care of everything and were at least somewhat stable again. Sure, One can't expect to get weeks off, but a few days should always be the case for something like this. I have to assume OP's boss never had pets, or else they would be able to understand. A shame, really.",
            "I am so sorry you had to go through that.",
            "I was talking with one of my coworkers about how I needed a day off next week, and the last time I made a request to use my acumulated vacation time for 2 days, it was denied. Like when companies do that they just remove any incentive for employees to be honest about why they wont be at work. \n\nTelling you the truth wont get me the time off i need? Guess im going to lie to you and tell you the \"right\" reason no matter what im doing, and youll just have to deal with it. Such a fcken power trip",
            "This makes me so mad! I was at work one day and my husband called to tell me my dog had died. I was a nurse. My boss said go home, take care of yourself and your baby.",
            "Workplace bereavement policies really should include pets and not just humans.",
            "I'm sorry you had to experience this.",
            "i am so sorry you experienced this. i can’t even imagine. i’m glad the higher up had a heart (and a brain) and let you take those couple of days that you so clearly needed.",
            "Never understood the logic of employers not giving sick days.\n\nLike, imagine you were sick with a stomach bug... Do they want you puking and shitting yourself at your desk?  Is their goal to see how much of their staff they can get sick at once?",
            "May the happy memories you share with your dog bring you joy. You’re an amazing person, don’t let anyone tell you otherwise.",
            "Bravo. \n\nI'm currently at home from work because I had to bury my childhood cat on Saturday and it finally hit me.",
            "It’s that whole “pets are property” mentality. I’m sorry, when was the last time my sweater cuddled me? These are living beings that we love and share our lives with! The people who don’t understand that truly boggle my mind",
            "People are real AHs.  I went back to work after my grandma died and one of my supervisers told me that people die and I needed to grow up.  She had cancer.  I was 23.  I'm 37 now and still mad at her even though I haven't worked there for 12 years.",
            "After my first Weimaraner died ( on my birthday while I was working overtime) I had a boss come up to me and say “ you look like you lost your best friend” I responded “I Did.” Good ol Disney leadership.",
            "I was fired cause my brother died and I took one day to grief. I was new there and we have \"Probezeit\" we're they can fire you without telling the reason.\n\nIt was the biggest Employer in my area and payed very well. I not only lost one of the most important people in my life, but a job with amazing payment too.\n\nI Miss you Jan.",
            "Unfortunately, something similar happened to me about six months ago. Had a surgery scheduled for my dog and I had negotiated working from home for a week to take care of his surgery wounds. Found out the weekend before his surgery that we had to put him to sleep as there was nothing they could do so I requested that I work from home that week to grieve. Note: I didn't ask for any time off! I only asked to work from my home so that I wasn't crying in the office and that was denied. I guess its my fault for being honest but I could have said nothing and worked from home that week like I had planned. Either way it left a bad taste in my mouth being denied time to grieve in peace.",
            "I need to go hug my dog now...this is just horrible I'm so sorry you went through that.",
            "I’m so sorry for your loss",
            "I'm sorry that you had to go through that. I know how hard it is to lose a pet and I couldn't even imagine being denied time off to grieve.",
            "I don't bother explaining the loss of a pet to people anymore. How can they understand? Instead I lost a close family I tell them and I'm uncomfortable discussing it further but that they were someone important to me.\n\nBecause my pets are family, not having much for actual family, the bonds I form with pets are stronger than most of my other relationships.",
            "That is majorly fucked up. Please accept this belated hug from me. *Hugs*",
            "Good god, I'm crying for you 😭\n\nOne of the hardest day at my last job was the day after my beloved best friend cat had to be euthanised unexpectedly. I worked at an animal charity, yet my boss had zero sympathy or empathy. I'm so sorry you had a similar experience, but I'm glad you made your boss look bad.",
            "So sorry for your loss.",
            "I’m sorry for your loss. God!! You made me remember Brandy. She was our Golden Retriever puppy. She was a super hyper super lovable goof ball. She would wait with us everyday at the bus stop and she’d be there waiting when we got home. One morning she saw a squirrel and ran after it. Right onto the highway and got hit by a pickup truck. I knew the truck and the owner. He didn’t stop just kept going. The bus was right behind him and if we missed that bus our mom would kill us!! So we had to get on the bus all of us crying our eyes out. I was in high school and I balled my eyes out for the 1 st 3 periods of classes. Then comes 4th period. NJROTC! I walk in and put my books down. I overhear one of the instructors GUNNY talking about how he needs to take his truck and get it cleaned so he can assess the damage at lunch period which was next. I walk in and look at that man with all the anger, hurt, and disgust I felt and said “yeah since you ran over our damn dog and just kept going!” I was just sooo mad and hurt. He turned bright red and mumbled an apology and then walked off. My mom came and checked me out before then end of class. My baby brother who was in kindergarten was having issues so the teacher called her. When she got there he told her what happened so checked all of out of school. I thought it was so we could mourn nope!! She made us go get the carcass and carry it home and bury her. Mind you we lived about half a mile or so from the busstop that on the hwy. At least when my Dad found out about it he lost his shit on her. But me and Gunny never really did get past that",
            "After my grandma died, the job I had at the time, required me to come in. Unless I could get a coworker to cover for me, which I couldn't get anyone to switch shifts with me, and I didn't really have the heart to try. So I just cried on everyone until they very awkwardly asked me to leave for a few days. They should have let me stay at home to grieve when I told them. \n\nSometimes the only way to get sympathy that should have been offered with the disclosure of the situation is to let the emotions out on everyone. For some reason our culture is extremely bad at dealing with grieving people.",
            "I have made it known that I will be requiring full on bereavement leave when my corgis pass. Not negotiable.",
            "I remember the day my nan and grandads dog died, I had grown up with her so it was really hard to accept she was gone. She died on a Sunday and I remember my parents deciding to let me have the next day off school. They tried to give me anything thing I wanted but mostly made sure I felt loved.\nI still miss her nearly 18 years later",
            "My sister's first horse was out on loan with a friend when he bolted into a cattle grid. He sadly broke two legs and had to be put down at the scene before we could get out to him. \n\nI phoned work, a cleaning job I'd had 3 or 4 weeks at that point, to say I had to go to a funeral and wouldn't be in. \n\nCouple of days later, when I saw boss next, he tried a few different ways to get out of me who had died, but I just looked sad and said it was very difficult to talk about. But there was no way I'd expect sister to go through that alone.",
            "I lived in Kuwait for 8 years. When I came back to Texas, I brought the dog I had inherited from a roommate with me. He lived to almost 16. When he had to leave me, I was on staycation from work. I called a friend of mine at work and asked him to take down all the pictured on my desk of my dog. I didn't want to see them when I came back.\n\nAn hour later, a different coworker was at my door with flowers to make sure I was okay. Later that day, flowers from all of my coworkers showed up. Then the flowers from Chewy's arrived. \n\nThat was five years ago and I still really miss him.",
            "5th grade, came home one evening to find my dog floating in the pool. Mom made me go to school the next day. Thank god my teacher was a saint and a huge animals lover and she gave me my own space to mourn because my mom refused to pick me up from school when she called",
            "Sorry for your loss. I was informed my cat was put to sleep on my way to work. Had a picture of her on my desk. Couldn’t hold it together between calls. Again, my condolences.",
            "I’m so sorry for your loss.  My partner and I had to get our little furball pts last month as he had zero quality of life.  15 years old he was, blind and deaf and was beginning to not eat.  Would sleep 22+ hours a day, the last week it was taking me half an hour to walk him 500m around the green outside the front of our house.  RIP Rafa. 😢",
            "I lost my sweet boy a few months ago to heart failure. I’m fortunate that my manager understood that my little guy was my whole world and didn’t question it at all when I said I’d be taking the rest of the week off. \nI don’t understand companies that don’t get that things like that are how you get and keep good employees. If I feel like they care about me then I care about them. I do a better job because of situations like that where they understand that I’m a person with feelings and let me have my time to grieve.",
            "When my dog died I didn’t go to work for at least a week",
            "I’m in my 40s and at the first company that’s ever seemed to actually care. I recently had quite a scare with my kitty and thought I was losing him. My boss sent me home “as long as you need” to either get him better or spend his last days together.",
            "My dog died and I had to come in the next day. She was my everything, and i mean my fucking heart the entirety of our 12 goofy years together. It's still very hard to think on now, and it's been since July 2021. Anyway, a customer complained about me for not being able to answer a question they had, despite the fact I'd told them multiple times i didn't know the answer to. My manager told me he \"understood about the dog thing, but I need to walk that off\". Apparently, no one's dogs or feelings are important, but if one of his dogs so much as farted weird, he'd be out of the door within moments. I don't hate a lot of people, but he's definitely up there. I've also gone from liking my job to being indifferent towards it ever since. To basically tell someone their loved ones (yes, our pets are our loved ones, too) aren't important is a pretty serious and shit thing to say. I don't forgive that sort of bs and have low regard for anyone who lets those words pass through their mouths.\n\n&#x200B;\n\nSorry for the rant, this story really got me feeling some kind of way.",
            "Oh my god I am so so so sorry this happened to you. \n\nTwo of my cats had to be put to sleep due to incurable health issues this year, and it was awful. My first cat I had had for six years and felt like I was going to die after he passed. I honestly contemplated suicide, but thankfully managed to pull through that with the help of my mum and boyfriend. When he died my boyfriend told his boss he was taking time off and made it clear it wasn’t a question. I found it so touching because it became clear how much he loved my cat and saw him as our baby. I’m disabled and can’t work, but I couldn’t imagine having an sort of responsibility at that point in time, never mind imagining if my boyfriend hadn’t been there with me.\n\nWhat you went through is traumatic. Your dog’s death wasn’t your fault though and it’s clear you loved them. Good for you for not concealing your emotions and for telling your colleagues the truth. Fuck your boss.",
            "I’m so sorry, I couldn’t imagine having that kind of weight on your shoulders from that. Even if it was a long time ago, I’m still very sorry for your loss. Sending you prayers, and I hope you find comfort knowing they’re waiting to see you again✝️🤍",
            "We had to put my dog down one Sunday morning. It was his time & he needed rest. I was a couple months into my job (security guard), so I didn’t even think of calling off. I did call, audibly sobbing, to let them know I would be late to work. My manager who answered the phone said I didn’t have to come in, but I showed up anyway & they let me just drive around outside for the next week. So I did my job with only a few crying breaks sprinkled in, better in my mind than sitting in my grief & not being able to distract myself from it.",
            "Very sorry for your loss and for having a heartless p o s manager.",
            "This is ABHORRENT. I took a day off work when my ex's dog died because I LOVED that dog and I couldn't stop crying. I was still in my probationary period but they were so kind about it.",
            "Manager should have allowed you to stay home at least to handle the body. Im sorry for your loss and i would have been a wreck to.",
            "Everyone whose pet passes away needs to take time to grieve! \n\n2 days in the immediate aftermath is far better than pushing it away because it’s not ‘convenient’ for everyone else that you’re upset, because it will last weeks!\n\nI mean, grieving itself will always last weeks, but repressing it will cause other issues that last weeks - and are harder to cope with! \n\nPets are IMPORTANT, people. Even if you don’t like animals yourself, they matter to the people who DO. \n\nAlways remember that, and never ever shame anyone for grieving a lost pet. 😢😢",
            "This happened to me once too… forced me to come in so they could fire me. HR literally laughed about my childhood cat of 18 years having died that morning.",
            "one of my senior dogs had to be put down due to an aggressive cancer. i had 4 dogs that were all seniors 12 years and up.\nmy boss asked if i really needed a day off and made it seem i shouldn’t be so upset over my dog (she had kids, i do not). \nthe sympathy was not in her voice and i just agreed to come in. \n\ni worked in a substance treatment facility and had a particularly difficult client wanting to leave against medical advice and i was supposed to assist in redirecting the client. the client was adamant about leaving and proceeded to stand over me ( a foot taller than me) and berate me.\n\n it got so bad multiple staff jumped in to get the client away from me. i burst into tears and ran away. i felt so lost and hurt. i felt that a place that focused on caring for others should have some compassion for my loss, but i was wrong.\nmy colleagues were supportive and consoled me.\nabout 5 months later my 17 year old chihuahua passed from heart disease. i took off multiple days, my supervisor didn’t question me that time and asked me to let her know when i was ready to come back.",
            "A lot of good stories in this thread.  Mine is about childhood Concrete Thinking.  I was in 3rd grade. We had a Golden Retriever that was at the end of her lifespan, was ailing, could hardly walk or get up to use the bathroom, it was time to say goodbye.  Parents gathered us kids to tell us they were taking the dog to be \"put to sleep.\"  I thought, \"Great! The dog is really sick and some sleep will make her better\" and went off to play, didn't even tell her goodbye.    When the folks came back home I was like, \"Where's the dog?\"  Yeah it sucked.",
            "I remember having to take the family cat to the vet at the end when parents and brother were on holiday, I went to work after explaining I would be late, my boss checked up on me and asked if would rather go home and was proper helpful. One of the few times I really appreciated him as a boss.",
            "Y’all cutting onions in the comments? Because my eyes are leaking.\n\nI’ve got a soon-to-be 8-year-old pup. Husband and I were commenting last night how she’s starting to get slower and will soon be considered a senior dog. We’ve had her our entire marriage. She has always been a part of our little family.",
            "Similar story, but it was my cat. My sister saw the whole thing, an arsehole swerved to hit her on purpose. I asked to leave, and my manager tried to stop me, but his boss said no, let her go. I came back the next day and my manager called me in his office showed me a picture of his dogs and said when he thought about what he would feel like if it was his pet, he apologized and gave me the day if I needed it.",
            "Once a pet it's a family I know how you feel I had a few animals pass away",
            "I am so very sorry for your loss.",
            "Your manager was exhibiting toxic feminity",
            "I understand the grief and guilt. We had a new cat when I was 17 and pretty quickly he developed balance and coordination issues that no one could figure out. We had a big garden (with a pool) but decided that we would keep him inside because of this issue. We would only open windows fully if he was closed in a different part of the house. One day I brought him into the bedroom area but forgot to tell my family… my mother decided to air out her room. He got out and we soon started searching. I will never forget the scream of pain and anguish my mother let out after finding him in the pool. I tried in vain to give cpr… he was foaming from the mouth and stone cold. And his eyes… I’m crying just typing this and still blame myself for not telling anyone. My therapist tried her best to assure me that with his lung size he would have drowned quickly “probably before he realised”.",
            "I am a multi tour combat vet with the USMC 2/7 Wardogs.  Lost many brothers including my bestfriend I was in the delayed entry program with.  In my Mid 30s now, Union ironworker, tattooed face head everywhere and have lost friends, family, and a fiance by suicide. EVEN THRU ALL OF THAT  I still bawl my eyes out everytime I have a dog best friend die.  I felt your story and she was a B!  I remember every single dog I was ever fortunate to share years of my life with.  I dread the day it happens with the two waiting for me at home right now",
            "When I lose a dog, I take time off. The bond is real, the loss is devastating.\n\nAnd anybody who doesn't understand why people need that time can suck on my shit.",
            "Omg she should not be allowed as a manager. I recently had to rush my cat to the ER vet cause I found his litter box looked like a murder scene (in comparison to a 8 lbs cat it was). He was peeing blood which is never good on anything or anyone. I'm sure she is the type if you say you need to take someone to the ER she would not care. 😠",
            "When I had to put my dog down at the same clinic I used to work at, I had forgotten to clock out. The next day, my boss comes up to me and asks me why I didn't clock out for working on my personal pet. Like ma'am really?",
            "The most horrific thing is that the dogs body was still inside the house and there was no time to take care of it before being forced to go to work. THAT is horrific - imagine having to go to work, absolutely distraught and then come home to a slowly decomposing body later. The trauma would be insurmountable. The fact that the boss thinks that is acceptable is beyond comprehension.",
            "This isn’t malicious compliance dude you went though it. That sucks",
            "You got 2 days paid mourn leave for a DOG & I couldn’t even get that for a family member? Yikes.",
            "It was a WOMAN who told you to \"get over it\"? Jesus Christ, women have a long history of working with each other and sharing their honest feelings, what a witch. Good to know there's some humanity left in the world.",
            "I just want to say that this makes me so sad for you.  That must have been so very hard. I hope you have been able to find other wonderful animals in your life.",
            "Yes grief over a beloved pet sucks. That's why you have PTO.",
            "I'm really sorry about your dog, they're family just the same as human relatives. And your employer is an arse.\n\nI was so well taken care of when my cat, who I saw like a child, was found dead by a neighbour when I was working from home one morning. There was absolutely no question as to what happened with work - my boss urged me not to come back too soon and actually sent me home when she felt I had returned before I was ready. My team gladly picked up the slack whilst I was grieving and sent gifts to my home. I do work for an animal charity so it helps that my colleagues are animal people but even still you should have been treated with so much more dignity and respect",
            "I had a college professor reschedule an exam for me when my dog passed away. I will always remember it. A little kindness goes a long way.",
            "I told my union steward this spring I had to take a day off work to get my dog put down. He said ok, do what you have to do. Then he still got me paid for the day. \n\nThat's how it's supposed to be taken care of.",
            "Yesterday was the 11th anniversary of my boy passing. I woke up in a funk and didn't know why until something on my computer drew my attention to the date. Somehow, I knew. Took until I was already at work to get out of the funk. Wild how fast time has passed.",
            "Man I must be a monster myself. I just don’t have feelings for pets like this. Cats, dogs, fish, nada. What’s wrong with me???? If I were in the OPs position I’d have come to work and taken care of my dead dog afterwards.",
            "Where does it end? Next it's dead insects and imaginary friends at Foster's home...",
            "7",
            "I agree with your boss on this one. You were on a probationary period. A dead pet is not an excuse to miss work (when you have no sick time), and everyone knows this. Your being sad should not grant you any free days off. I'm not saying I don't want you to have grieving time. I'm just saying it's not the employers responsibility to give you free days off when you're sad. A pet isn't a free get-out-of-work card. *You* may treat your dog like it's a person, but that doesn't mean everyone else in the world has to agree with you.",
            "Omg. I can’t believe you actually left your deceased dog on you bed, in a room that was probably warm, for hours. It had to have stunk up your room. \n\nI’m having trouble believing this part of your story. Only because I know what happens to a pet once it dies and you can’t take care of the body for a few hours. Please tell me you exaggerated that part.",
            "> This is also early 2000s where the term “toxic masculinity” wasn’t coined so seeing a grown man openly sobbing at his desk like this really threw people off.  \n\nFWIW   \n\nhttps://en.wikipedia.org/wiki/Toxic_masculinity#Terminology\n\nThe term toxic masculinity originated in the mythopoetic men's movement of the 1980s and 1990s.[2] It later found wide use in both academic and popular writing.[3] Popular and media discussions in the 2010s have used the term to refer to traditional and stereotypical norms of masculinity and manhood. According to the sociologist Michael Flood, these include \"expectations that boys and men must be active, aggressive, tough, daring, and dominant\".[4]",
            "If one of my employees wants to take off to mourn their dog, it’ll be under personal leave.",
            "I went to school at 16 6 hours after my grandpa passed away, alone, in a hospital.",
            "I had a wonderful, 16 year old cat. Towards the end of his life, I was giving him IV fluids, three times a week to keep him hydrated. One morning, I was getting ready for work, and he collapsed and had a seizure, with the most ungodly cry I have ever heard. I called the vet, picked him up, wrapped him in a blanket, and took him over. The vet said that he was so anemic, his blood was pink, not red. It was time to make that very tough decision. I was due at work in half an hour and I went to work after that. I was very sad and upset. People wanted to know what was going on, I told them I just had to put my cat to sleep, and they were sympathetic, that it was more like yeah, shit happens, you gotta go to work anyway. I asked my manager if there was any way I could get off work early and she said no. I told her that the secretary had been off for three days with her dog died and the manager said well that was the secretary. she’s easier to replace or cover or whatever. Yeah I got over it, and I still miss my kitty, but he’s a lot happier now."
        ]
    },
    {
        "post_id": "hwhffe",
        "author": "fionasapphire",
        "title": "You want to take my security deposit? Perhaps you should read your own contract...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/hwhffe/you_want_to_take_my_security_deposit_perhaps_you/",
        "score": 15747,
        "num_comments": 361,
        "created_utc": 1595517414.0,
        "selftext": "A few years ago I was looking for a place to live and I came across an interesting advertisement looking for \"Property guardians\". The idea behind property guardians is that disused buildings are far more secure if they are occupied, so owners of empty properties will allow people to live there temporarily for incredibly cheap price. So the guardian gets to live in a (usually quite interesting) disused building incredibly cheaply, the owner makes a small additional bit of income and has someone keeping their eye on the place. This arrangement is usually done through a 3rd party Guardian company, who act as the intermediary.\n\nThis particular advert was for a pub that had recently closed, my interest piqued so I went along to a viewing. The space was huge, and they were only asking for a few hundred pounds, all bills included, so I went for it, along with a group of other people. We all picked our rooms, I got the bar area - a huge room with en suite ladies and gents toilets, a big fireplace and cosy pub decor. We also had full use of the sizeable pub kitchen, beer cellar, dish washing room, double garage, car park and a massive garden with a BBQ area.\n\nFor the most part, it was a great gig. I got to live in a pub, have all the space I wanted, and as the building was due to be destroyed, we could pretty much do what we liked with the internals. I put up curtains and temporary walls and made it my cosy home for the next couple of years. Other guardians moved in and out over the months, but myself and a couple of others were there for the long term. Aside from the odd dodgy person coming and going (I had two of my tyres slashed at one point, but that's another story), all was pretty cushy.\n\nThe owner of the Guardian company, and thus the person I paid my rent to, was a large red faced man who was quite full of himself. He tended to be quite bossy and sometimes aggressive, but I stayed out of his way. As long as I paid my rent and didn't cause him trouble, he left me alone. All until the end of the \"tenancy\". I had moved out, returned my keys and I was awaiting the return of my security deposit.\n\nAt some point, a car had been dumped on the property. I hadn't noticed, because one of the previous guardians, who I will call Rob, had pushed it round to the back of the property and had been working on it. I just assumed it was his car. The first of the emails from The Guardian Company read:\n\n>The Volvo dumped in the car park was not reported to us and must be removed from the site. Rob has declined to take responsibility of the vehicle and has alleged it was reported to the police and yet none of you have reported to us on such a serious issue. I would suggest that it be placed on the public highway and then the police will deal with whomever owns the vehicle.\n\nWait... did you just incite us to commit fly tipping?\n\nI emailed back and said the car wasn't my responsibility, and thus I won't be moving it. Things went back and forth like this for a while, withe the owner insisting that we were all responsible. (Emphasis here means it's important later.)\n\n>Stop arguing as I don't care and if it's not gone then you will all be accountable to the issue. Rob was contacted and has said its not his and now **the burden falls on all of you** that knew about the car and failed to report it.\n\nAt this point, I mentioned small claims court as an idle threat to see what would happen...\n\n>You have failed to report an incident that is something that is detrimental to the property. You are in breach of the license for failing to do so. Happy to see you in court and explaining that **you were put into the building to act as security by occupation** and while there you failed to report a dumped car.\n\nRight. It's on. I pulled out the contract and went back over it with a fine tooth comb. At this point, another email came through...\n\n>Dear All,  \n>  \n>Please be aware that you were all under license at the property and not tenants and had no tenancy rights as is clearly stated in the license that you all agreed to and signed. Under the license **you act as security for the property** and were responsible for reporting any incidents and also were responsible for keeping the property safe, secure and as stated any items left will be charged for removal. The items left were dumped outside and certainly were not there throughout your time on site and must have been placed there by one or more of you.\n\nThis was accompanied by photographs of even more stuff that other guardians had left in the property, furniture etc. But I wasn't going to be responsible for any of their stuff. This guy thought he could bully us out of our money because we didn't have a legal tenancy and were therefore not covered by UK laws protecting tenants. I wasn't going down without a fight.\n\nWe may not be covered by tenants rights, so everything would fall back to basic contract law. I found the interesting parts of the occupation licence agreement that I had with the Guardian company:\n\n>\"Damage Security Payment' means the amount payable by the guardian \\[...\\] to cover the cost of any damages caused by the guardian.\n\nBut not anybody else... and since this contract is between myself and The Guardian Company with no \"jointly and severally liable\" clause, I can't be held responsible for anyone else's mess. Great. But there's more... this one is interesting:\n\n>\"3.1 The Guardian Company provide services to property owners to, among other benefits, secure premises against trespassers and protect such premises from damage. The Guardian Company has agreed to provide such services to the owner in respect of the property.\"\n\nSo WE don't provide security, that's the responsibility of The Guardian Company, which we're not a part of. But wait, there's more:\n\n>The Guardian will:  \n>  \n>10.1.10 Not remove anything from the property, other than things that s/he brought there\n\nBOOM. Gotcha.\n\nI fired back an email:\n\n>Please see Section 3.1 of the Licence Agreement signed by myself and The Guardian Company owner. It stipulates that You, The Guardian Company, provide security. Not us, the guardians.  \n>  \n>Please also see Section 10.1.10. Given that I did not bring either the car or the furniture onto the property, it would in fact be a breach of your own licence agreement for me to remove it. In this case, I will be complying with your contract and thus will not remove the items that I did not bring on to the property.  \n>  \n>Please return my security deposit within 3 working days, or I will be forced to take legal action.\n\nTheir response:\n\n>At this point we are happy to see you in court and please do not contact us unless via your solicitor as we will be charging for our time to deal with such matters. If you can demonstrate who is responsible for leaving the items for us to deal with we will look at this. But as stated previously these items were not there previously and have dumped them outside. All of you failed to report the car.\n\nSounds like he was shaken up a little and probably hoped I was bluffing. Unfortunately for him, I wasn't. I filed the court papers after three working days.\n\nHe caved as soon as he received the court papers, and realised that I wasn't bluffing. He repaid our deposits, along with my court fees the very next day.\n\nVictory.  \n\n\n*Edit: Formatting, and re-worded the ending because people were getting confused.*",
        "permalink": "/r/MaliciousCompliance/comments/hwhffe/you_want_to_take_my_security_deposit_perhaps_you/",
        "comments": [
            "Good for you for using the contract to your advantage! But this whole \"guardian\" thing sounds sketchy as hell. Sounds like a way for an owner to make money off of abandoned property by renting commercially zoned property for residential use while dodging tenant protection laws",
            "Good for you! One of these days these “landlords” will need to read their own contracts...",
            "I had to threaten my former landlord to get my security deposit back after a month of “it should be in the mail.” Was completely bluffing when I said I would be contacting a lawyer for guidance, and I received the check 2 days later. So surprised that it only took a few days after filing your papers to get your money",
            "Glorious.",
            "Awesome! Well done for sticking it to the greedy sod!",
            "Dick headed landlord assumes law is on his side, gets beaten by his own contract. Classic and I love it, great job.",
            ">and as the building was due to be destroyed, we could pretty much do what we liked\n\nWho requires a security deposit on a building that is going to destroyed? I mean the whole idea of a security deposit is to repair damage by the tenant. This smells to me.....",
            "That felt good to read.",
            "Hehhehehehe fuck that guy.",
            "Uhn... I am just curious. Besides the toilet, does the building have any shower/bathing facilities?",
            "So this guy Rob was the one who moved the car around on the property, but since he threw up his hands and went \"nah\" he's totally off the hook? I would think he would be the easiest one to pin it on since I feel like you could say him moving it is taking responsibility for it.  \n\n\nI also find it odd that all it took for them to leave him alone about it was just him verbally saying it wasn't his problem, but all the rest of you are somehow still at fault...",
            "As an American, I was fascinated by the whole Guardian idea. Like that Phoebe Waller Bridge show Crashing. This would have made an excellent storyline!",
            "I was reading about this a few days ago, and signing that contract does not protect the company from having to follow tenant rights. Apparently a lot of people just don’t know their rights.",
            "I just want to say thank you for making me google that, i have just found out that in the city im in there is 1 bed flats for 250 a month, and man as im homeless that may happen quicker than a council flat, and id be able to have an address and not be worried about as much.\n\nI really cant thank you enough, id just need to get some money together.",
            "[deleted]",
            "Guardianships are tenancies. They like to claim they're not but they're renting you a space to live in which makes it a tenancy. They can't override the legal definition of a tenancy because they find the protections you get legally inconvinent.\n\nhttps://www.landlordlawblog.co.uk/2018/08/30/guardian-article/",
            "Thanks for teaching me new British term, “fly-tipping”.  In America we have a much less colorful phrase, we just call it illegal dumping. According to the OED, the term \"on the fly\" being used around 1851 to mean \"on the move\". This saying coupled with the act of tipping something out created fly-tipping.",
            "I think he was all bluster and probably cons everyone out of their deposits unless, like you, they stand their ground.",
            "Whatever happened to Rob? Did they come after him?",
            "Congratulations. Unfortunately a lot of people don’t take the time or understand these lease agreements. Glad it worked out for you.",
            "Sounds like it was the Guardian Company that was supposed to do their due diligence and not sign on sketchy guardians that are going to do stuff like dump garbage furniture and stuff into the property.\n\nThat's his fault, and you don't owe him your deposit for HIM having picked out guardians that treat the place like a flea motel.",
            "Congrats on prevailing! Also, I now want to live in a pub...",
            "I own my own house now but when I rented it was rare indeed to get back a security deposit witout some issue cropping up.",
            "The real problem here isn't the tenant or the landlord being jerks. The contract just didn't seem to cover the arrangement the Guardian company actually wanted. If they wanted the occupants to actually act as security, they needed to put that shit in the contract.\n\n\nGlad you were able to work the contract in your favour. Hopefully they settle the issue without a big fight",
            "God I wish it were that easy to get your court fees repaid in the US. Would make it a lot easier to deal with scumbags like this.",
            "I love the idea of guardianship, but because of the lack of protections, it's too easy to abuse tenants.",
            "> fly tipping\n\nEvery time I learn a new British-English word I feel that we are using the language wrong here in the US.",
            "Man, small claims court is awesome. I wish we'd have it in my country.",
            "American here.  What is “fly tipping” and what is its origin?",
            "[deleted]",
            "I can’t read this without hearing Rik Mayall’s voice, and Alexie Sayle as the Guardian guy :)",
            "It feels so gooood. Nice going!",
            "Shame about that Volvo though. Nice work, OP!",
            "Well done! He wasn't expecting you to fight back and didn't know how to handle it hahaha",
            "Hey just so you know, those boxes you placed around the legal stuff don't automatically resize, and are going under the sidebar, making the ends unreadable.",
            "What they say:\n\n> I'll see you in court!\n\nWhat they're thinking:\n\n> Bah! These fucking kids are too broke, dumb and scared to file, they'll cave in!\n\nWhat they do when you actually see them in court:\n\n> Surpised_Pikachu_Face.jpg",
            "I was hoping that since the landlord was  adamant that you were hired security (labor) and not tenants that you ended up getting 2 years of back pay for living there or something like that.",
            "Somehow I expected this to end up with him being liable to pay you minimum wage, 24/7 for all the time you were there proving security..",
            "I did a Guardianship in a closed school once. Lived out of the staffroom. Definitely one of the most interesting places I've ever lived.\n\nThankfully didn't have any such issues and only had to move out when they demolished the school. \n\nIt was noted though that providing security by occupation isn't the same as providing security. The former means that because the building is in use it will deter criminals with greater effectiveness that an abandoned building to which a security guard rocks up to onve or twice a day, or is only monitored on CCTV if at all.",
            "One time my landlord charged me $100 because I lost my key. When I moved out he asked for the key's back. I said no problem. As soon as I get that money back it's all yours :)",
            "Not sure how it is in the UK,\nbut you often cannot opt out of tenancy law through dodges like this.  Otherwise everyone would do it. \n\nAnyway, shame you didn’t get damages from this jackasss.",
            "\\*stands and loudly applauds, along with whistles\\* yeah baby!",
            ">The owner of the Guardian company, and thus the person I paid my rent to, was a large red faced man who was quite full of himself. He tended to be quite bossy and sometimes aggressive\n\nWas his name Vernon Dursley? I swear your description sounds exactly like him.",
            "Two sections are unreadable when viewing this in Chrome. I presume your use of a different font changed the margin of the layout.\n\nThe two sections which start with \n\n\"3.1 The Guardian Company provide services to property owners to...\" \n\nand \n\n\"...The Guardian will: 10.1.10 Not remove anything from the property, other than things that s/he brought there...\" \n\ncannot be read as they extend out to the right of the web page. Please change the font so as to make this readable.\n\nThank you!",
            "You got the court fees and security deposit back within a few days of filing, is smalls claims court really that fast?",
            "Good job!",
            "Well played.",
            "Sounds like you were living the book \"Pirate Cinema\" in real life.  :D",
            "r/badlandlords, r/prorevenge.",
            "Am I the only one curious about a the story around the slashed tires?",
            "nooice",
            "Pretty plus ultra of you. \n\nI enjoyed this.",
            "It would have been interesting if you had taken the bit where he said you were acting as security to whoever issues security licenses where you live. I am sure they would have loved to see a legal document naming you guys as security guards without proper licensing.",
            "I have such a justice boner right now. Give me more.",
            "Omg are you in Brum?! This sounds so much like the place I used to work! Luckily it was a short stint but was proper dodgy.",
            "Nice, i was hoping for you took him to court and he had to pay you all minimum wage for all of your time there. You weren't a tennant, you were security as it says in the contract so surely you should be paid!",
            "Good job!",
            "/u/fionasapphire don't use backticks (`) for complete lines of text, since doing to disables word-wrap, and the lines go off screen to the right one some clients, including old.reddit.com. Just quote the text (>).",
            "Slow clap, that was brilliant!",
            "There's a fair bit of case law that suggests you were indeed tenants, no matter what your agreement might say and if they dont protect you deposit you can sue.",
            "Sounds potentially like r/prematurecelebration. Hopefully you'll still be happy after the lawyers are done.",
            "Tip a fly?\n\nIs this British slang for...?",
            "Legit question. How did you take a shower while living there? Did the pub have a shower in it?",
            "This is some downright JUICY legal contract detail here. Realky wanna see it crosspost to r/legaladviceoffropic .  Bet they'd love it too.",
            "That victory had to feel better than sex.",
            "Nice!",
            "I'm just surprised that in your jurisdiction putting \"you are not considered tenants\" in a contract actually makes it so. Normally if it walks like a tenancy agreement and quacks like a tenancy agreement, then it doesn't matter how many \"magic words\" you add to try to say it's not.",
            "Quite a few dense creatures replying here, declaring OP as responsible or negligent... Just wow.\n\nAlso - Guardianship company in question - Global?",
            ">\"3.1 The Guardian Company provide services to property owners to, among other benefits, secure premises against trespassers and protect such premises from damage. The Guardian Company has agreed to provide such services to the owner in respect of the property.\"\n\nThe company \"provides a service,\" which is what you and the other people were; you were the security service. Secondly, \"among other benefits\" is what puts you guys on the hook for taking care of the abandoned car. You should have gotten clarification as to what \"other benefits\" includes, before your signed.",
            "If you aren't a tenant, what are you? If you're supposed to be 24/7 security, you might have a claim for unpaid wages.",
            "Wow, I never knew that was a thing, property guardians. It'd be cool if this was possible in the US too!",
            "What country are you living in where you can't leave buildings unattended? I've never heard of such an arrangement or service before.",
            "The UK government has a fact sheet on their website in relation to Property Guardians.",
            "So. if the building was set to be demolished, why hire guardians to keep it in good repair?",
            "Asking out of ignorance. If the pub was due to be demolished, why were you able to live there for a few years? Did it just take that long for the demo team to have an opening?",
            "[victory music begins]",
            "Might Have missed it in comments but:\n\nHow long did you leave there, you mentioned it was years ? and out of curiosity which part of UK was this in ?",
            "I had an encounter with a squatting group somewhere in the UK, and they showed me ‘our electricity at the moment is being paid for by Margaret Thatcher. Cheers Margaret.’ Because you don’t even have to use your actual name to sign up, they would try and come up with the most bizarre possible people. Thatcher was a particular stroke of genius.",
            "Excellent read! Sounds like such a unique place to live, would have been right up my alley in the younger days.",
            "Yes, victory! I love when you find the smoking gun in a contract and it perfectly proves your point.",
            "[deleted]",
            "Bruh you’re here to do an AMA.",
            "[deleted]",
            "Good take if you actually did something.",
            "“I want to go.",
            "“I don’t read them.",
            "Looks like Himmler cut his own hair.",
            "He sounds like my ex. 🤣.",
            "Could you not have called a scrapie and got paid to tow the car away?\n\nI guess you'd have to legally own the car to do that? Idk how it works in the uk",
            "Well done!",
            "Sounds like a nice deal that you had on rent. Question,why couldn’t you just push the car out onto a road in a parking space?",
            "So wait... you rented a place from Dana White?",
            "Sounds like he should go back to selling drills...",
            "POV you are looking for a tldr",
            "Honestly? It sounds like you didn't do what you were hired to do. \n\nYou were given cheap rent in return for caring for the property and that meant taking responsibility for any spare cars dumped on it. Now, you've won on a technicality and because you don't care for your boss you seem proud of that?",
            "> `\"3.1 The Guardian Company provide services to property owners to, among other benefits, secure premises against trespassers and protect such premises from damage. The Guardian Company has agreed to provide such services to the owner in respect of the property.\"`\n\n> So WE don't provide security, that's the responsibility of The Guardian Company, which we're not a part of. But wait, there's more:\n\nAnd how do you think the company goes about providing that security service? Oh that's right, by having folks (read: you) stay there and keep watch, as *guardians.*\n\n> `The Guardian will:`\n`10.1.10 Not remove anything from the property, other than things that s/he brought there` BOOM. Gotcha.\n\nExcept you were never asked to remove the car. You were asked to contact the police so THEY could remove it. You're right about the other items not being your responsibility, however.",
            "Perhaps it’s hypocritical.",
            "If Mao did one thing right, it was rounding up every landlord into a group and blowing them all away.",
            "make a tldr please",
            "[deleted]"
        ]
    },
    {
        "post_id": "m4dzar",
        "author": "UnFocusMyChi",
        "title": "\"Just do your job and shut up!\" Noooooo problem.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m4dzar/just_do_your_job_and_shut_up_noooooo_problem/",
        "score": 15744,
        "num_comments": 308,
        "created_utc": 1615665437.0,
        "selftext": "The software company I worked for got acquired.  Some people were let go, some were added, and some teams and functions were restructured.  Prior to acquisition, we had a \"multiple hats\" situation where you basically did whatever was in your capacity, teams played to each other's strengths, and one person would generally take a client from the first demo right through the configuration, implementing, and training phases of the software.  Some of us had strengths in technical areas, others had a decade+ in the clients' subject matter.  Clients would give us some feedback or wish lists.  We'd talk amongst the team about how the functionality could be added or changed, make a functional mock-up, and then bring that to the Development team for polish and integration into the production code.  It worked wonderfully.  Like, 100% positive feedback and nothing broken when it went to production.  We had a good rapport with the Dev guys and some of us were able to write queries or code portions that would save them from having to ask a billion subject matter questions.  When we weren't dedicated to a task, we'd handle support calls.  Clients would call up, receptionist learned who to pass things to based on clients and the nature of issues, and resolution was typically instantaneous unless the problem required research.  Clients loved that and had the understanding that if we couldn't resolve their problem right away, it was because we needed to look into it.\n\nAfter the acquisition, the parent company reorganized things into a much more rigid \"you have one job\" type of scenario.  The trouble was, with the people they let go, I was the singular remaining source of a lot of the capacities we provided.  It left me working with the Sales, Product Improvement/Concept, Product Evangelism, Implementation, Development, Data Conversion, and Support teams.  Initially, I didn't mind.  Wasn't any different than my previous role.  Things started nicely enough with the company CEO genuinely asking, \"Would you mind helping X team with Y project?\", and he'd pick up my travel bar tabs and toss me a day off here and there.  It was a fair exchange and he treated it as though I was doing him a favor.  But at some point all these other departments expected then demanded my time.  Instead of people asking when I could help them on a project, I would just find time blocks added to my schedule for various things.  A couple of times I was supposed to be chairing these meetings and having things prepared and no one even bothered to tell me.  Around this same time, I noticed a lot of recommendations I made when asked for input were being overturned by people in new roles who had no idea what they were talking about.  As in literally had no exposure to the subject matter and had never even seen the software, plus no programming/logic or database experience.  So my input is demanded but also ignored.  And this was causing more demands on my time when things were broken or didn't meet client expectation.  Plus, the new Dev team I was working with made every excuse not to act unless someone went and confirmed and fetched everything they needed.  The external demands on my time had increased and I had coincidentally hit a few walls with my actual job in that clients were unresponsive and couldn't get me the data or access I needed to complete tasks.  But that didn't stop my boss from demanding documentation and results and documentation about the results.  There was no such thing as \"waiting\", it's your duty to call and harass the powerless client until whatever third party involved enables whatever we need.\n\nI was really unhappy in a job I had previously loved.  Every day was worse than the last.  And then I got my employee review.  It was top notch and yet I got the same \"cost of living\" raise as everyone else.  It particularly burned my ass that the Sales guys were getting commission on sales that I FUCKING MADE and I was just shafted.  At the original company, effort above and beyond was WELL-rewarded.  I doubled my starting salary in a few years' time for hard work.  Now, I was miserable, overdrawn, AND got nothing for it.  I was having daily arguments with my boss who was completely indifferent to all my commitments and refused to understand  that I couldn't compel third party companies to do my timely bidding to get client data or access.\n\nOut of nowhere I get a call from the head of the Data Conversions department.  He says a few of his people have noticed some high-level solutions to Dev or data problems in the Teams chats \"come out of some random guy from Implementations in no-time.\"  Then he was talking to a preexisting client about converting a set of financial data from a legacy system I had converted some Building, Code, Fire, Planning, and Police data from and they asked if they could have me do it specifically because my conversion of their other data was \"flawless\" and I granted them some change requests on the way through to make their lives easier(simple changes to record type names for easier identification, clip leading spaces or extra zeroes so they could put reports in Excel...stuff like that). He said the client, \"wouldn't stop fucking gushing\" about me and he was floored to hear that I had done the whole thing myself where his team typically breaks the responsibilities between 5 or more people.  He offered me a position on the spot and I told him I was interested and I'd think about it. He told me I could start doing some part time stuff with him a few hours a week if I wanted it that way.  Then he told me he \"saw the bullshit I was dealing with\" and said he'd \"get the other departments off my fucking plate.\"  I liked him right away.  My current boss then interrupted our call seeing me talking to that guy on our in-house phone app and demanded to know what I was wasting my time on.  Then she proceeded to berate me about open orders and my lack of documentation about their lack of progress.  \"You got time to bullshit with him but you can't call a client.\" I tried to tell her for the millionth time about all the expectations from the other departments, the obligations they leave beyond their allotted timeframes, the inability I have to force other companies do things for us no matter how many times I tell the client...  She told me, \"I'm done with your excuses.  Just do your job and shut up.\"  I called the Conversions head right back and asked how soon I could transfer to his Department full time.  He said, \"Fuckin....YESTERDAY, man, this is such good news!  I was just talking to [Assistant Department Manager] and he 'bout shit his pants when I said I think I got you part time!  Take the rest of the day off, have a beer to celebrate, I'll handle the transfer and we'll see you in the morning.\"  And that was that.\n\nI did as my new boss commanded and had a beer to celebrate.  A wave of relief came over me after months of tension.  The following day I told the vampire departments and my previous boss in no uncertain terms that I was done helping them.  It went unacknowledged and they continued adding things to my calendar.  So I deleted them, did MY job, and shut up.  THINGS. GOT. UGLY.  I'm not super-talented or anything but I was literally the only person they had for a lot of things and things went to shit.  Most of it requires institutional knowledge I had spent years acquiring so they couldn't even hire someone to do the things.  And rather than come ask me for help, people made demands and attacks!  And I got flat out beligerant about it.  In an email with the CEO cced, the Support manager asked why I \"couldn't be bothered\" to help them anymore.  I said, \"for the same reason you can't 'be bothered' to clean the toilets or recable the building.  Not my job.  [Previous Boss] told me to 'just do my job and shut up.'  Take it up with her.\"  The Sales/Evangelist guys tried to go over my head and asked my new boss if I could do some of their demos.  He said, \"sure, if you come over here and do some of his conversions.\"  Numbers tanked for the departments I was previously involved with.  Support in particular.  They went from a 2 hour avg resolution time to EIGHT DAYS.  Sales for my product line went down from 85% success to less than 25%(CEO reported that sales dropped over 60 percent from 85, don't know the exact).  Dev and product went from 100% customer satisfaction to 60%.  Implementations has been completely unable to install certain components which led to at least one contract cancellation and demand for a refund.\n\nAnd in true storybook fashion, my previous boss's boss, the one who gave me my previous employee review and who is a childhood friend of the CEO, told me privately that the CEO noticed, \"all the departments UnFocusMyChi stopped working for suddenly saw their worst numbers in company history...weird.\", and asked, \"anything in particular that pushed the guy over the edge?\"  Previous boss's boss explained that I was pissed about the review/raise having nothing to do with merit or effort, the demand from other departments, unrealistic and impossible expectations, and the idiotic requirement for documentation.  So, this year and going forward there are two criteria for yearly raises.  Individual output, and department output.  No raises for people with negative performance numbers.  Upon that announcement, some department heads up and quit and others changed positions internally.  Meanwhile, I have written a few utilities for my team that have saved THOUSANDS of hours of manual work.  Our numbers are SOARING where they were previously up and down and my new boss is \"driving the whole bus full of our laughing asses all the way to the bank.\"",
        "permalink": "/r/MaliciousCompliance/comments/m4dzar/just_do_your_job_and_shut_up_noooooo_problem/",
        "comments": [
            "New boss sounds like a good guy.  I especially liked his response to the sales guys' request for your time.",
            "It’s rare that someone’s impact is that tangible that it goes noticed several levels up. Lots of times the contributions of a key player are less tractable, especially on new products or with new clients — poor metrics can be chalked up to other causes even if that’s not the reality. You were the last linchpin holding your former company together. Very satisfying to read.",
            "Proud of you. Don't juggle it all, especially when they don't respect you for it.",
            "Sounds a lot like \"Do more work, then we will consider giving you more money\"  instead of \"Here is more money, do more work\"  however every single job I have had always seemed to under the mindset of the former, not the latter because they realize that forcing more work on you will get it done for the same amount of $ they were paying already instead of paying you more $ for doing more jobs.",
            "I kind of wonder why you didn't leave and start your own company?  You could probably have charged your previous company mega-bucks as a consultant......I don't know...$1,000 an hour?\n\nI mean if they don't want to pay it......GOOD LUCK!!",
            "Can we also have you at r/talesfromtechsupport?",
            "So satisfying!",
            "Every single place that I've ever worked that has increased demands for documentation of exactly what employees have been spending time on has tanked shortly after in some fashion.  When it reaches the point where I have to spend 10% of my time writing down a description of what I was doing and why, it just becomes too much trouble to help someone with their issues quickly - they need to schedule a meeting so it can be documented and several tasks can be covered under that one umbrella.  Now when I see someplace wanting increased tracking, I start looking for someplace else to work.",
            "I love this whole story, but I keep coming back to the part where under the original owner, even the *receptionist* had picked up enough diagnostic knowledge to route the caller to the right person.  \n\n\nIt's not remarkable because receptionists are \"supposed\" to be dumb; it's remarkable because the workplace culture encouraged everyone to share what they knew in a way that organically enriched and optimized the entire workforce.  A particular employee might have some special skill, but the comprehension required to grasp that *this* call is best resolved by *this* skillholder might well be described as basic while also acknowledging that few people grasp the required basis.  No one schooled the receptionist; they picked it up by actually listening to callers, by talking to the employees they routed the calls to, by maybe initially just being curious how Joe Codeguy helped Jane Prodline stop the edges coming out square. The skill to route calls to the right person the first time around is as valuable as the grasp of a particular client's setup and needs.  \n\n\nThe second you start trying to quantify and mass produce that kind of magic, it evaporates.  If this were a romantic scenario we'd call it chemistry, and we'd all know why selling a kit that recreates everything from the place settings at the restaurant to the outfits a famously compatible couple were wearing on their first date could only strike that spark of connection in another couple by accident.  \n\n\nSince this is a business dealing in technology, people only see the technology and forget the people involved, and thus the \"winning formula\" is somehow consistently and tragically diminished in a way that can't possibly be anyone's *fault*, even if it is dumped on someone to fix.  \n\n\nI keep coming back to the receptionist because that sounds like someone on the front line of the chopping block when the company is acquired.  And if the acquiring CEO had bothered to ask why stuff was going wrong, the receptionist might also have been one of the people so \"low\" that their perspective might be considered objective in regard to why stuff wasn't working out.",
            "In my experience, if you can wear several hats at work you are lucky to get paid for one.",
            "Employees don’t quit jobs. They quit bosses. \n\n\nAlso, if your company relies upon one employee for their success, they should make damn sure they keep that employee happy.",
            "About 20 years ago, I started planning my exit after annual raises paid out equally regardless of merit, for the 2nd year in a row. I was pissed off. Me and a handful of other road warriors spent weeks and months onsite, sometimes on the other side of the country, only to get the same shitty raises as those who rarely worked on the road. Why should I/we spend so much time away from our families for no extra compensation. \"Atta boys\" don't read to my child. One of the office ladies had the audacity to say we were lucky to get to travel all over for free. Although I did do some sightseeing of cool places, I was usually too tired after working 7am to 9pm to do so. Except when we were on the road for 2-3 weeks straight and got Sundays off. 80+ hours per week on salary. I was gone in a few months and will never work like that again. My lovely wife was understanding but there were several divorces and the road time def had a part in it.",
            "I think you need to find out your bosses favorite type of alcohol and splurge in a very nice bottle with a note saying my sanity thanks you and my stress levels love you, never change!",
            "Happy for you!!",
            "I'm in almost exactly the same sort of position, but the new manager has only just come onboard and I'm still waiting to see how he shakes out.\n\nI'm a loyal mug of a person and I really take ownership of the systems I'm responsible for: but if some current warning signs turn out to be correct I'll be trying to move out to a different dept too. I would never choose to move away and leave them in the lurch, but they could definitely drive me out. Watch this space!",
            "That was a great read. Congrats on the good transition!",
            "You said “I’m not super talented or anything”... well yes indeed you are!  They were pulling you around like a piece of taffy and you got the last laugh!  Great job on doing your job!",
            "[deleted]",
            "I felt this one, been there except I completely left the company. Good on you.",
            "Have seen a couple rounds of \"been acquired.\" What you described is not unusual - new convoluted processes put in, under the assumption that everyone is equally useful and are in fact interchangeable parts. The old system maximized the unique talents that worked there, and the benefits flowed from it.\n\nIn fact their \"just do your job\" attitude leads to overstaffing. Instead of having a data conversion wizard do that task when needed and be a superstar at it, they make data conversion a required duty for a bunch of people who aren't nowhere near as good at it. So it takes longer and has rework.\n\nI had a similar experience of working for a boss that just wanted the work done and didn't micromanage, dictate the \"how\" or pile on a bunch of processes that had no value. It was wonderful. He re-wrote our processes to be exceptionally vague and let us do it whatever way we thought best. Sometimes it blew up, but not often, and no process would have prevented it. But each of us got to contribute our best skills and contribute to great results for a while.\n\nHappy for you, OP!",
            "Might not fully understood the job side of the story, but definitely a good read!  Glad things worked out for you.",
            "This story is the epitome of people don't quit bad jobs, they quit bad managers. Awesome story, and the ending is the best.",
            "Jesus, can I come work for your new boss too? My software engineering department has gotten itself into the same situation yours was in...",
            "[deleted]",
            "This is sooo great! New boss sounds like a dream!\nAnd holy shit, OP you are talented. I work in IT too, and I know what goes behind doing everything you mentioned. I aspire to be someone as talented and smart as you!",
            "If the productivity numbers and the impact of your leaving your previous position are indeed correct, i think maybe you are now working well under your salary / bonus / position capability. that company should have made a department for you, setting your own remit and responsibilities with a more senior reporting structure. And paying you a fuckton more.",
            "“If it ain’t broke don’t fix it.” Why don’t some people learn?!?",
            "This was a great story, I'm glad you found your place after dealing with all that bullshit!",
            "...I would like a boss that your new one...",
            "I am very happy you are now treated with the respect you deserve.\n\nIt sucks that one staff change (I know your change was huge) can take a great job a person is happy in to a shitty job they hate.",
            "Just do your job and sh...noooo, I mean I'll buy you your morning specialty coffees and donuts, will that persuade you into coming back? Like, I'm sooo super duper sorry!!",
            "I’m in the same boat except this is no great manager in another department To swoop in and save me.  :(",
            "Departmental siloing is real. Such a shitty way for an organization to operate, but it's good you're able to navigate that clusterfuck.",
            "Long wall of text but a great outcome.  \n\nMake friends with the tech writers at work ;-)",
            "Thanks for sharing, that felt good to read.",
            "Sounds like you do have an actual talent and amazing skills, don’t put up with bullshit or sell yourself short anymore! What an amazing story!",
            "God... I actually miss being in a position where I could write code to help out my team or automate work. That was so much fun.",
            "Yup. Economics 101. If they don’t pay you for your work, don’t do it.",
            "Ho Lee Shit this was a satisfying read, my soul feels cleansed and I feel full of hope lmfao this is awesome, congratulations dude",
            "Dude i got nothing to say other than congratulations, you fucking earned it lol",
            "I enjoyed this so much, I might as well sum up your events as a 10 minute Pixar short.",
            "It’s so weird to me how management ever thinks it’ll be fine if they don’t reward outstanding performance with more money. You think I’m just not going to notice? Lmao. \n\nEven if things are not going well for the company overall, they will sure as hell be going much worse if you sour your best employees’ motivation. \n\nIf they have equity, that’s a different matter, I guess.",
            "This is like porn for me, working in a similar situation.",
            "I work at a company where I am not IT but am held to their standards. I hear you. Overworked and underappreciated. Not enough can be said for how amazing IT people are. Just please stop asking if I tried to reset my computer before reaching out.....",
            "I'm going into a similar company as the one you're working for and recognise the benefits to working this way. I can also see that any future takeover will probably lead to me having a similar story! Well done on all your success and I'm glad you have found peace.",
            "I'm surprised that no one went \"UnFocusMyChi is the only one who knows this stuff, let's put them on  training so that they aren't the only one who can understand everything.\"",
            "Love this... so much",
            "So typical. People at the top or in positions of power treat everyone below them like children. Doesn't matter what company, what field. All they ever want is obedient underlings who will do whatever they say, and if you complain they treat you like children, with threats of disciplinary actions.\nLike companies or corporations that shout WE'RE A FAMILY HERE, but never seem to ever treat anyone as individuals. These people, like your people, don't want to negotiate, they just want",
            "This story sounds so familiar. Sadly, there's no one at my company to bail me out and my title/experience are so specific that I'm stuck reading dozens of rejection emails from other companies all day.",
            "[deleted]",
            "Your boss could see what others and management couldn't, why a startup or business was successful.\n\nRecognise who was involved, what was being done by whom and why it was working and efficient.\n\nTheir loss.",
            "Now THIS is satisfying. All the best to you and the boss man👍",
            "What does the Evangelism team do?",
            "Wow. I read this ENTIRE story, and it was WORTH it. What an amazing experience! I hope that you're still happy in your newer position!",
            "So old job was great, everyone worked together willingly\n\nNew boss makes it corporate hell because they don't know how to actually work a job efficiently and everyone demands help instead of asking you, and you're like the only person running half the fucking company\n\nEventually, after many attempts to un fuck what they've done, they continue treating you this way and worse and don't care, so you stop caring and specifically do only your job\n\nSomeone that knows of your work before new bosses wants to poach you from the new shitty bosses and they get mad that you have time to talk to non work related stuff even though you literally do because stuff is out of your control\n\nYou leave, previous job that treated you like shit essentially *collapses* and new place you work at is literally rolling in cash stacks with easy work because of you\n\nDid I tl:Dr it good enough?",
            "Amazing.",
            "Good job buddy hope things keep going well for you!!!",
            "This story got more and more beautiful with every line. Love it! 👏👏👏",
            "I’m literally going through this exact thing right now, minus the happy ending. Glad it worked out for you!",
            "they should have been paying you 200k+ a year",
            "quit because raises are performance based, that says a lot.",
            "> Around this same time, I noticed a lot of recommendations I made when asked for input were being overturned by people in new roles who had no idea what they were talking about. As in literally had no exposure to the subject matter and had never even seen the software, plus no programming/logic or database experience. \n\nWow. This is how you destroy a company. My father could give a seminar on \"Sears: How upper management destroyed a successful business by hiring shiny new decision makers from outside the company who had never worked in retail.\"",
            "I don’t know if I need to write up my story anymore cos it’s almost identical to this! Only difference is I am still a little behind you time wise, as people are still coming to me for b******t that I haven’t been able to completely shake!",
            "Well done. Sounds like you should cross post to r/prorevenge too.",
            "OMG Thanks for posting. I loved the malicious compliance and feel soooo glad I’m out of that toxic corporate environment.",
            "i already like your boss",
            "I Just want to give money away.",
            "It's the difference between being goal orientated and procedure orientated.",
            "Sounds like you helped clean house!",
            "I swear I know where you work and who your boss is. Oh my god. This sounds too familiar to what happened when large tech company bought out largest data storage company. I'll say no more.\n\nEdit: your boss is female so I'm wrong but I'm also not wrong because I see this shit happening to my husband too",
            "For a long time there I thought you were talking about a division we sold off to another company. While I don't work with them anymore I still hear stories about how bad shits gotten, and I still know when employees quit because I manage their phone system and building access.",
            "Jesus that was long.",
            "Honestly, you missed an opportunity.  If I were doing special favors for the CEO, eventually I would have pulled him aside and said, 'listen, I'm doing x,y, and z for departments a,b, and c.  Given my contribution (follow up with proof of your outsized contribution), I'd like to build a special team directly reporting to you, and I'd like to be compensated appropriately'.\n\nGranted, it's a ballsy move, but this is how you move from just another dev to someone making a 1%er income.",
            "You sould truly do a tldr: summary at the bottom 👍\n\nOtherwise great revenge.",
            "You should use more paragraphs",
            "tldr please omg",
            "Can I get a TL:DR ?",
            "Can someone give me a TL;DR 😅To lazy to read...",
            "Take note. This is a huge problem. This guy was a bottleneck. He was supposed to document all he did but made excuses. He wasn’t even smart enough to get a pay rise out of it.",
            "Damn. That’s a helluva story. Are you still working for this company?",
            "I am so happy for you man, congrats on the turnaround to a great position!",
            "Just reading this has stressed me out.",
            "x7",
            "Good for u",
            "It's basically the same everywhere. People imagine how the world should work in their little heads and then behave as it the world really was the way they imagined. Result: The world goes about its business.\n\nPeople are not medicines or need fulfillment automatons. If they can go, they will, if they can't they'll find a million and one way to sabotage their work. \n\nFar too many managers don't understand this.",
            "The first half reads pretty much like the time the startup I was in got acquired by a large company. As is usual in those situations (I'm told), the larger company starts messing around with things that previously worked well, and things slowly but surely go to shit.\n\nGranted, the multiple-hat process you described (which was also the case for us) works well in small, and probably wouldn't have scaled to larger volume. But that just means they should recognize that and figure out a new process that works and doesn't rely on a few people like you going above and beyond.",
            "Wow sounded like a previous boss I worked for in terms of not getting anything done and got worse than a cost of living wage.  Then got a no cost of living wage.  I was doing network engineering/architecture, SRE and train release engineering.  I am so much happier where I am now where people understand people/time and technology and making more to boot.",
            "Bravo, congratulations, and good work! \n\nThat last line is what got me, though. i was enjoying every step of the way, but the quote from you boss made me chortle out loud.",
            "Good on you.  Vampire bosses need to stop being stupid and see where the blood comes from.",
            "playing the long game and making yourself indispensable\n\ninspiring",
            "I’d love to see an update after the next reviews and raises just to see if they stuck to it and you got what you deserved for the hard work. lol"
        ]
    }
]