[
    {
        "post_id": "a1n0dq",
        "author": "Chaosmusic",
        "title": "Temp ban. Please reconsider? OK, perma ban!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a1n0dq/temp_ban_please_reconsider_ok_perma_ban/",
        "score": 15731,
        "num_comments": 534,
        "created_utc": 1543536230.0,
        "selftext": "My nephew is really into online gaming.  He knows I am as well so thought I would appreciate this story.  Sorry if some of the details are fuzzy, it is a retelling from something told to me by a hyperactive 16 year old.\n\nCompanies that do online gaming are starting to push back against toxic players that make the game less fun for everyone by issuing bans for racist comments, threats, etc.  Depending on the game it might start with a warning, then a 24 hour ban, then a 7 day ban, then a permanent ban.  A lot of these games are free so a perma banned player could create a new account, but all progress and benefits they earned are lost, so it's still a big deal.  This one game in particular has a forum where players can discuss and appeal bans.  \n\nSo, one day a person posts complaining they received a 24 hour ban for what they considered minor offenses, like saying butts or boobs, and could they check the chat logs to reconsider the temp ban?\n\nTheir response: We checked the chat logs and over the course of that single gaming session you made several racist, homophobic and sexist remarks as well as threatened to go to another player's home and punch them in the face.  We're not sure how we missed that.  The 24 hour ban is overturned.  Your account is now permanently suspended.  Thanks for bringing this to our attention!\n\nEdit: thank you for those who educated me on what being \"a little\" means.  ",
        "permalink": "/r/MaliciousCompliance/comments/a1n0dq/temp_ban_please_reconsider_ok_perma_ban/",
        "comments": [
            "I used to browse the suspension/console ban forum on Microsofts xbox 360 forum years ago. Fuxk me some of the posts were great. One was like\n\n\"I demand u unban my sons xbox he has done nothing wrong I watch him every time he plays etc etc.....\"\n\nResponse \n\n\"Your son was exposing himself using the xbox camera while playing uno....\"",
            "Sounds like league of legends to me...",
            "I feel like I've heard this before, if I recall, it was on a steam review or reddit where they complained about being banned and the dev posted their chat log. But I could be misremembering.",
            "What game is this?",
            "Reminds me of one time a particularly annoying kid in my class asked the teacher (who justifiedly hated him) to regrade a project because he thought he didn't score high enough. The teacher found a few more mistakes and gave him a lower grade.",
            "I wish the website \"whywasibanned.com\" still existed. It was a blog highlighting the best complaints to the XBOX ban team and was full of shit like this. [Wayback](https://web.archive.org/web/20120103090733/http://whywasibanned.com/) has some of it.",
            "It happens playing online poker too. Language from one player got so bad one time, I asked that the transcript of the session be reviewed. The site turned off his ability to chat! Blessed silence. ",
            "Bungie used to do this for Halo, I believe. They'd host a forum thread for 48 hours and people could appeal their bans as long as they were ok with their infractions being made public. Lots of stories like this.",
            "There used to be a Rioter called Light or something that worked for League of Legends and people used to post that they were unfairly temp banned in the forums. Light would look up the player and post their chat logs where of course they were way worse then what they were saying they did, often times being extremely toxic or racist. Light would then upgrade the temp suspension to a full account ban as well, we would call it getting smited by Light. It was always hilarious to see toxic players get their just deserts. It can be hard to not retaliate against verbally abusive players but you can mute people which is normally the best course of option. Edit: Lyte**",
            "I love it.  Used to be a great Xbox live blog called \"Why was I banned?\" which covered stuff like this.  My favorite story along that lines was a confession that he cheated in a particular game and that he'd never do it again.  The response was \"we didn't catch you cheating in that particular game.  The ban stands.\"",
            "Gods I love this sub.",
            "Its so bad/sad but finally, big companies are catching up from MMO starter years. There is/was a very old MMO called subspace (now continuum).  since the mid to late 90's.  (MMO from the time of dial up. )  Not talking 4 player doom, I mean 30 players in one map.  It was by Virgin Interactive, but it died, so all servers were player owned,paid for, operated, map content player made.  There were \"zones\" (back then, there were only 3-4 major servers, each hosting multiple zones, with their own settings and staff ) that had a anti-hate policy (basically anti-toxic behavior)  enforced by the voluntary player mods.\n\nlots of the chat, ban features in that game showed up in all subsequent MMO games.  I wonder if that was one of the progenitors.\n\n",
            ">My nephew is really into online gaming.  He knows I am a little so thought I would appreciate this story. \n\n\n\nOhhh. You're a little (bit into online gaming.) \n\nComing from the kink community, I was really curious how ageplay was going to be relevant to the story. ",
            "Tried to find a similar story that was on Reddit recently (2 years ago actually, not so recent), not directly related but still good:\n\nhttps://www.reddit.com/r/Rainbow6/comments/50ijgc/banned_by_fairfight_for_multiple_cheating_offenses/d74cg0a",
            "Can you please reconsider the permanent ban?\n\nWe have found several links to child porn images in your chatlogs, the FBI have been contacted and are on their way to your billing address. Thanks for bringing this to our attention!",
            "Sounds like a Lyte Smite to me.",
            "[deleted]",
            ">He knows I am a little\n\nI was really confused about which sub I was in for a beat. ",
            "\\#LyteSmite Never Forget.",
            "Yeah this happens a fair bit in LoL. Some idiots occasionally try to bitch about a temp ban on either r/leagueoflegends or the forums, and every so often a Rioter sees it, gives a screenshot of the lots, and ups it to a permaban. It's honestly quite cathartic to watch happen.",
            "I have seen a lot of this by Arenanet over the years in what limited support they provide people in public forums. There has been one community manager specifically who would serve as a contact for appeals and for folks who their support team had failed to actually help. Only sparse details were ever dropped but, it was interesting to see when they did.",
            "Xbox live is getting really strict. Sending the message \"bitch\" to someone will net you a 2 week chat ban if reported.",
            "I use to be a mod on a very popular and busy cs:source server for many years. I use to love banning people for being racist abusive fucktards. They’d then get on steam chat and say some shit like “that wasn’t me, I was letting a friend play” and stuff. We had a mod forum where we’d share screenshots. Ah, good times. ",
            "Its just lazy when there are so many horrific things you can say to someone that aren't bigoted.",
            "There's one game that is absolutely spectacular at this: iRacing. That's partially because your ingame name is your real name. It confirms that with your credit card. I don't think I've ever seen anyone in that game resort to racism or hate speech. At most they're briefly angry about being crashed off and people complain that they're an idiot - any threats would probably get them a lifetime ban. Also, everyone pays to be there. It's worth it though.\n\nThis also means you can know when you're racing against professional racing drivers. You'll know because they are so much faster than you, but you'll also know because they have the name Rubens Barichello. ",
            "Sound like that TeamExtreme Minecraft server. The ban appeals section in their forums is a fucking goldmine.",
            "Sound like league of legends but not riot games.... hmm",
            ">Temp ban. Please reconsider? OK, perma ban!\n\nAs a reddit mod, I can tell you something like this happens at least once a week on my more active subs lol",
            "When you said you were \"a little\" in the second sentence, I was so intrigued by the relevance of your DD/lg interest in this story. ",
            "THEN STOP BUYING YOUR KIDS ADULT GAMES!!!",
            "I don't get the point of banning people for what they say in chat. I don't think I've ever played an online game that didn't have a block/ignore feature, or an option to turn off chat. ",
            "And then there are the forums where the people managing them really don’t know what they’re doing. Last week I was muted on one because my message contained “raci.”\n   \n*It was a racing game.*\n   \nI never got banned— the experience just got so fucking anal I just left.\n  \nEdit: Obviously this wasn’t a MOBA game",
            "This is my Reddit experience in a nutshell. \n\nGets temp banned from r/subreddit \n\nMe: Apologizes and explains why the ban is unjustified with FACTS to a mod. \n\n\"You are now permanently banned from the subreddit and can't message the mods anymore\" \n\nMe (talking to myself) : welp time to make a new account ",
            "I'm just impressed he got a reply from Support within 24hrs of being banned.",
            "/r/lytesmites",
            "/r/lytesmites hope I linked that correctly a LoL staff member that when on the forums after people complained about their bans and provided proof and even made the ban permanent.",
            "Almost this exact situation was on the league of legends forums not too long ago, not sure if actually your nephew or just typing it in your own words for karma",
            "Sounds like SAMP",
            "Thats why Im just super passive aggressive\n",
            "Oh god. I worked as an admin for a free2play game once. \n\nStuff like that is so much common and we loved checking chatlogs. Because that beats hunting down China farm bots and ban IPs. \n\nWe had several players who were known to the entire team (!) by IP and we’re so notorious and dumb about using bots and buying in game gold.\nSomeone went to far as asking why the bot he was using was not ok. Like is there something in the code that’ll harm my computer? \n🤦🏼‍♀️",
            "Nice.\n\nI would like to mention that this isn't 100% a good thing, in the case of steam at least.\n\nFriend's account got hacked, hacker got VAC banned on CSGO, and moved on. A few months later, we realize the account was hacked and banned. Thankfully, Steam returned the account within 12, or maybe even 6 hours, even late at night.\n\nBut despite IP evidence that it wasn't my friend doing the CSGO hacking (Russia vs US), their account's fucked.\n\nVac bans, btw, affect the whole account. They can't be overturned for any reason, and prevent a ton of features, like trading, and are generally really annoying. The typical advice is to buy a new copy of CS:GO on a new account, but it pisses me off that it screwed over the rest of their account and achievements and what not.\n\nThe hacker also deleted all the friends of their account. At the very least, my paranoia about security is validated, and my account is fine. But it pisses me off that their account is screwed. They even had more games than me...",
            "That makes me happy.",
            "My recent fave was the group \"leader\" who didn't know how to lead worth a damn (the rest of us were okay with that) but decided to get snippy when things weren't perfect, then immediately died due to not doing the very things she was being rude about, while the two players she put down heroically battled the boss for another five minutes.",
            "This is so incredibly MOBA",
            "This is the issue with LoL. \n\nWish cancer on your opponents: no ban. \n\nTell the feeder on your team to stop flaming: ban. \n\nSo glad I don’t play that shit any more lol. ",
            "This is why I hate MOBAS just the worst garbage community.",
            "Well in games removing saying stuff like that make it more enjoyable unless it was in a joking way. Removing stuff like that is good it doesn't remove fun at least in my view if you want that play Rust!",
            "> He knows I am a little\n\nI can't be the only one who read this differently than intended...",
            "It's lol, remember this one from the forums exactly. The ban appeal forum there is a good read for any sub from here",
            "I play Battlfront II.  A couple months back Lando and Chewbacca were just hanging in a room on Kamino shooting swastika's and the N-word in the walls and on the floors.  When I brought it to the community subreddit they defended the guys, saying that they were just blowing off steam, being edgy, etc.  I found that line of reasoning disappointing.  Since then I've learned how to properly document and report behavior like that but have not seen another instance as egregious.  I also don't use game chat to avoid having to listen to morons like this.",
            "That's beautiful.",
            "Am mod, I do this too.",
            "Warframe?",
            "It may not be the same game, but League of Legends had a former moderator famous for this kind of action.  If anybody wants to read some entertaining stories of gamers feeling entitled to their temp banned accounts only to have their chat logs posted and prolonging their ban, search 'riot lyte smite' on google and you'll find a lot of forum posts on the subject",
            "It upsets me most that you use ban and suspended incorrectly. Ban is perm, susp is temp. \n\nKids these days. ",
            "As someone who has (and occasionally still does) reviewed ban appeals, there is nothing more annoying in the process than someone who thinks they did nothing wrong and doesn’t want to wait out a rather minor ban time.  I never took pleasure in banning people (it sucks to have to do, especially in a tight-knit community), but I’d be lying if I said I didn’t like finding enough cause to make it that much more severe of a ban for toxic people.",
            "Okay",
            "You can't just ban someone from a game only because he was flaming, you could mute him, banning him would be excessive. It's not like he was using cheats or hacks(online game cheaters deserve to be banned thou).",
            "Hey buddy fuck you",
            "Whenever I make something up from now on I'm going to say a ten year old hyperactive kid told it to me.",
            "Back in my day, when someone was offensive, we just muted them instead of stifling speech through bans. We also had to walk 15 miles uphill barefoot to accept quests. ",
            "Lol i recently got Pokemon Let's Go\n\n&#x200B;\n\nI was banned from Pokemon Go for cheating (was running a bot farm..... no excuse for my actions). This was shortly after it launched. Its been well over 18 months so i have submitted an appeal, basically saying i have learned my lesson and would love another chance\n\n&#x200B;\n\nStill havent heard back but am hoping i have more luck than this dude did",
            "I really wish they had some kind of unmoderated chat option on games so that people can let off steam and call each other terrible things. I get it isn't nice for younger children and sensitive people but in the new gaming age I feel if they are willing to take my adult money maybe they could give me some adult choices.",
            "I haven't seen such a smackdown since back in nineteen ninety eight when the undertaker threw mankind off hеll in a cell, and plummeted sixteen feet through an announcer's table.\n\n\n\nShoutout to shittymorph; I can't get this line out of my head.",
            "[removed]",
            "Nowadays I wouldn’t be surprised if a game company considered “boobs” as a sexist remark",
            "Dorky ass post. We don't need censorship in video games cuz ur kid got their feelings hurt. There is a mute button",
            "Speech: 0",
            "One of my most satisfying gaming moments was seeing a message in Rocket League indicating that action was taken against a toxic piece of shit I reported. "
        ]
    },
    {
        "post_id": "n11o9a",
        "author": "Gralb_the_muffin",
        "title": "Get cracking on an essay about Arthritis? Sure mom",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/n11o9a/get_cracking_on_an_essay_about_arthritis_sure_mom/",
        "score": 15724,
        "num_comments": 279,
        "created_utc": 1619693072.0,
        "selftext": "I was reminiscing after I made the poor nurse shudder after cracking my knuckles at my doctor's appointment. It reminded me of a funny story with my mom. \n\nMy mom absolutely *loathed* whenever I cracked my knuckles around her. I can't help myself, it's a bad habit and once I start I have to do all of them. She would constantly yell for me to stop. She would tell me it's bad for me and that I'm gonna get arthritis from doing that. \n\n One day at home I started making my fingers into rice crispy treats; snap, crackle, pop. Mom had enough and snapped herself.\n\n\"I want you to write a 2 page essay about cracking your fingers including about arthritis.  No more than double space, 12 point font and all of that. I don't want you trying anything funny.\"\n\n... Well of course I'm going to try something funny. We wouldn't be here if I didn't... so cue that malicious compliance. \n\nI sat at the computer and pulled open google and typed in \"how cracking your fingers does not cause arthritis\". Turned out that was correct. I had plenty of sources including one guy who cracked his knuckles regularly on one hand and not at all on the other. The other hand got arthritis and the cracking hand did not. I included that, a few other truthful things like it does cause loss of grip but ultimately it was about how it helped prevent arthritis in the long term. \n\nShe took the essay without a word, skimmed it and called it good to my surprise. Couldn't believe I got away with it. \n\nBut\n\nI also remember that it got brought up in a conversation in my adult years before cancer claimed her.\n\nMom: what did I tell you about cracking your knuckles? I had you write an essay on that and everything!\n\nMe: you.... didn't read that did you? \n\nMom: what makes you think that? \n\nMe smiling like a fox in a hen house: cause I wrote it on how it prevents arthritis\n\nMom with surprise Pikachu face: no you didn't! \n\nMe: Cited sources and everything!\n\nMom: you brat!\n\nMe: Apple doesn't fall far from the tree!\n\nI loved my mom.",
        "permalink": "/r/MaliciousCompliance/comments/n11o9a/get_cracking_on_an_essay_about_arthritis_sure_mom/",
        "comments": [
            "I’m glad we got to take this trip down memory lane with you.",
            "Amazing. My dad thought of doing that once, but since he was a teacher he decided he didn't want to add to BOTH our work loads. \n\nI know the doctor you're talking about. I remember reading that neither of his hands had any noticeable difference in terms of arthritis. Of course, I'm sure it's been retold more than a few times and no one has done a follow up study yet.",
            "[deleted]",
            "My late mother-in-law would scold anyone who cracked their knuckles. She was a sweet lady, so I tried to avoid doing that to humor her.\n\nOne day I must have unconsciously started cracking them, stopped, and apologized. At that point she exclaimed that she had just read an article about how cracking does NOT cause arthritis.  I replied, \"yes, I've heard that.\"  Her: \"You did? Then why did you let me scold you?\" Me: \"Because you're my mother-in-law,  and I didn't want to disrespect you. \"\n\nShe nodded her head and smiled.  I miss her.",
            "My aunt used to rouse on me for cracking my knuckles.  (She has severe arthritis in her right hand.) Now I have arthritis in my left foot but nothing in my hands!",
            "I remember the story of the guy who only cracked the knuckles of one of his hands. He’d done it since he was a kid; something like 50 years of research!",
            "Book man Old Style is the font that looks the most “normal” and takes up the most amount of room, just so anyone in an English class knows. Try it. You’ll take a like two page times new Roman paper and turn it into a three page paper just by changing the font to Bookman Old Style. (Maybe not quite that much, but it’s a significant difference)",
            "My parents tried to pull the same thing. My evidence? I pointed out that Liberace famously and showily cracked his knuckles after sitting down at the piano before he played. I said, if this guy of all people thinks it's good for his hands, then I think it must be.",
            "Anybody else had to crack their knuckles after this?",
            "Get cracking. LOL",
            "I enjoyed reading that 👍",
            "this\n\n&#x200B;\n\nthis is why im on reddit",
            "The guy who did the experiment did not get arthritis within the knuckle joints he did not \"pop\", nor did he get it in the ones he did \"pop\", as far as I recall.\n\nThat study was how he showed his mother over 60 years that she wasn't always right.\n\nWhat studies did you show her that popping one's joints actually prevents arthritis?",
            "The sound when pop your knuckles (or others joints) comes from bubbles popping in the joint fluid.\nIt has nothing to do with athritis even remotely.",
            "Lol, that’s adorable. My mum used to punish us by making us write essays too. Once I wrote an essay on why I was correct and she was wrong. She made me write another one. I again reiterated the points in essay 1. Now, I got my stubbornness from my mother. Neither of us were going to back down. She made me write yet a 3rd essay. For the 3rd time i reiterated the points in essay 1 and 2 and being a little smartarse i used university style referencing in the 3rd one citing my 2 earlier essays. We eventually talked it out over a packet of cookies. She admired my determination but on this occasion pulled rank as mum and basically said I don’t need you to understand it I just need you to accept that it needs to be this way for now. I don’t even remember what we disagreed about but I remember writing the essays 😂",
            "Me: has arthritis and also pops every joint in my body like a glowstick on crack",
            "For one brain-fade moment I somehow thought of arthritis as Alzheimer's and it made no sense how his one hand forgot, but the other didn't.",
            "As someone who cracks their knuckles, and almost every joint thank you for sharing this story!",
            "I didn't even finish the first paragraph before I got this overwhelming urge to crack all of my knuckles",
            "In a rebellious phase while I was in jr high school (years 7-8, ages 12-14), I started smoking Pall Mall cigarettes, the ones without a filter. My dad smoked, and would have me walk down to the corner store to get him some smokes, so I’d get a pack for myself at the same time. (This was in the ‘70’s in North Carolina, tobacco country, and perfectly legal at the time.)\n\nMy mom, a non-smoker, caught me and made me sit down and read a government pamphlet on smoking and cancer. \n\nIt wasn’t what I read, but that she made me read it, that got me to quit smoking. I haven’t smoked since.",
            "At 3 years old my mom took me to get a check up. While there the doctor grinned devilishly and showed me how to pull on my fingers to dislocated them briefly (also popping them). My mother was horrified. Now it's my boyfriend that's horrified. He actually can't do it. Maybe the doctor realized that I could and decided to teach me, regardless I find it fun to disgust my boyfriend from time to time lol",
            "I love your mom too. She sounds fun. Thanks for sharing.",
            "Cracking your nuckles is actually a good habit. Its allowing air that gets trapped in your knuckles out, stopping it from building up and causing problems in the future.",
            "I'm sure your mom was very proud of you!",
            "Hmmm, what's your source on \"The other hand got arthritis and the cracking hand did not\"? Are you sure you're not confusing it with [this study by Dr. Donald L. Unger](https://onlinelibrary.wiley.com/doi/epdf/10.1002/1529-0131%28199805%2941%3A5%3C949%3A%3AAID-ART36%3E3.0.CO%3B2-3), where he found **no** arthritis in either the hand where he cracked his knuckles nor the hand he did not?",
            "I used to do similar stuff. \n\nI had four kids as a single mom, the younger three all boys. So the fights could get legendary. And there’s nothing better than three arguing boys at the end of a 10 hour work day /S\n\nSo I’d make them sit, spaced out, at the kitchen table and write an essay about what the liked about their brothers. \n\nThe length of the essay varied by age of the combatants. \n\nThe best part was that by the end, they were united in their annoyance with me, not each other. I could deal with that, you know?",
            "Being slandered in jest is somehow the most endearing thing ever",
            "A number of years ago a survey was done at a range of nursing homes about knuckle cracking. \n\nFairly large number in the survey. \n\nResults? Arthritis in crackers and non-crackers was essentially equal.",
            "Rarely do we get a feel-good malicious compliance... Well done! Hallmark movie material",
            "Chiropractors pop your joints, and after several sessions may say that they're \"well lubricated now\".  That sounds like a good thing to me!",
            "That title really popped for me",
            "\"I'm not a brat. I'm just a son of a bitch.\"",
            "Had something similar happen when I was being homeschooled.  But my mom said that in front of my instructor who showed up periodically who was also a chiropractor and he corrected her, heh.",
            "If my kids ever write me a damn essay, I am reading that through and possibly framing it. I get so proud of the work they do",
            "I just find it annoying, and don't care about the arthritis part. One of my kids does it all the time. I tell her to stop, she can do it when I'm not around to hear it.",
            "Lol, my dad went through a brief phase of assigning essays as punishment. I imagine he also stopped when he realized he had to read them.",
            "To be fair, I know it doesn't cause arthritis but the sound makes me viscerally sick. I yell at my husband when he cracks or pops joints when we're snuggling. \n\nPartly, I think, because when I pop or Crack my joints it usually hurts so much I want to puke. I have a fucked up skeleton.",
            "I've started to develop arthritis in a couple of knuckles, and find that cracking them relieves the pressure somewhat.",
            "My mom did a similar thing when she caught me playing on my tablet after bed time. Made me write a 3 page paper on how the screen light is bad for your eyes and ruins your ability to sleep.",
            "Your mum sounds fantastic",
            "My dad told me the same thing for years. Finally I got pissed off and looked it up, asked my one friend's parents who are both doctors, and then told him all the evidence that it actually helps prevent arthritis and that it's basically air escaping from the joint",
            "There was a study done in nursing homes about the prevalence of arthritis vs cracking or not cracking your your fingers a. They found no statistical difference.",
            "I have arthritis in my fingers and  carpal tunnel. I had read somewhere that cracking your fingers { they call  it finger pulling LOL} so I started doing it regularly. That was the only thing I did  differently, and my pain symptoms went away. it lubricates the joints I guess. I am a sign language interpreter so it saved my career!.",
            "That was wonderful!  The happiest malicious compliance story I've ever read.  Thank you for sharing!",
            "r/mademesmile",
            "I would have loved your mom too!",
            "My mom can't stand it either, and I have to pop all of them if I pop one, just like you. \n\nAlso, r/creativecompliance would enjoy this too.",
            "Its nice to see a malicious compliance where the two people actually don't hate each other but love each other and the malicious compliance leads to a genuinely funny moment and clearing up some misunderstandings. This stuff is rare to see.",
            "I have arthritis and it’s INSANE how many random people tell me I need to stop cracking my joints. Unless I was regularly cracking everything as a baby I’m pretty sure it didn’t cause it!",
            "I can absolutely see every one of my kids pulling this kind of shit on me. (I'm the same way!)\n\n Well done, u/Gralb_the_muffin!",
            "I love your mom too!  No getting upset, that’s great.",
            "Aw wholesome compliance!",
            "I love her too you little brat!!!",
            "I would have loved your Mom, too! She sounds amazing:)",
            "That title made me think I was on a pun page.",
            "I’ve noticed diet has a lot to do whether knuckles pop.",
            "Malicious-Wholesome Compliance. ❤️",
            "What a surprisingly wholesome story!",
            "You actually made an effort, so nothing at fault there hehehe. I’m too lazy so I’d pull some other stunt. Like I did for biology one day, I had to write some lines for punishment, something like “I should not interrupt teacher and class with my shenanigans again.” \n\nLike I said I’m lazy. The day it was due, I wrapped my right (writing hand) in bandages and told her i broke it while skating. My only error? I took it off next class and guess who walked in? Yes. Didn’t end up writing the lines though, because she found it original.(which it wasn’t)",
            "I actually learned that recently. Still hate when hubby does it but since I have arthritis and he doesn't...*Pikachu face* lol",
            "That’s a great story. Sorry for the loss of the loss of your mom, she sounded like one of a kind",
            "For fuck's sake, I had to prove to my mother that the Salk institute found in a study that there was no correlation between arthritic hands and knuckle cracking.\n\nEven then, she didn't believe that I hadn't made it all up.",
            "Do you have the paper?",
            "Shit got sad at the end",
            "That’s an awesome memory",
            "The guy who cracked knuckles on one hand but not the other for years (actually 50 years!)  won an IgNoble Prize for his work!",
            "When I was a teenager, my dad made me write a full research paper on all the main STDs to scare me out of ever having sex.",
            "Had to crack some serious knuckle reading this",
            "You still do.",
            "How many cracked your knuckles while reading this?\n🙋‍♀️",
            "If it’s still tucked away in a box somewhere, I’d love to give that to my mom as a gag gift for Mother’s Day. I can make copies and send it back to you. You are brilliant and a hero.",
            "My mom wouldn’t haven’t sent it back and said know ur audience. And edited it",
            "Blah blah something.  \n\nWas distracted something something else.\n\n“I loved my mom.”    Automatic upvote and small award.",
            "Awsome!\n\nReminded me of a friend now sadly passed. She had cancer and became a christian, a very conservative in your face type christian. I the eternal atheist was one of her favorite potential converts. \n\nShe also tried to argue with me that the US should be a christian based nation insisting the founding fathers were all devout christians who meant for the US to be fundamentally a christian country.  \n\nShe started sending me articles her friends collected to prove her point. Fortunately her friends were just as intellectually lazy as she was. The crowning article she sent consisted of a quote of a pro christian nation article in the first few paragraphs and a scathing rebuttal in the rest of the article. \n\nThanks for sending me a great resource. Apparently none of her bible study friends had bothered to read the article just the first few paragraphs that agreed with their point of view and then they passed it on. \n\nI still miss her though.",
            "Here's the shtick:  Arthritis causes enlarged knuckle.  Cracking your knuckles can cause them to enlarge.  *Ipso alternative facto*, cracking your knuckles causes arthritis.  (No truth to it.)\n\nI believe it was Dr. Kenneth Cooper (author of *Aerobics*, and numerous sequels) who noted that some athletes were found to have enlarged hearts and, since asthmatics can have enlarged hearts, were orders to stop participating.  I'm not sure about asthmatics, but some athletes have enlarged hearts due to increased vascularization -- because they are athletes!\n\nDon't believe everything you hear, even from \"experts.\"",
            "Please, can you give me the sources on how it prevents it? I need to show this to my dad who gets reeeally mad at me for cracking my fingers xD",
            ">one guy who cracked his knuckles regularly on one hand and not at all on the other. The other hand got arthritis and the cracking hand did not\n\nI think I know the story you are talking about. The guy did it for 50 years and found that it didn't make a difference either way because neither hand ended up getting arthritis. Not sure if it's the same story as what you found but it might be. Definitely interesting though since he tested it for 50 years and found that (in his case at least) it didn't make a difference if you cracked your knuckles or not",
            "Brb— I gotta grab some tissue *sobs*",
            "Probably the best story I've read on this sub. Thanks for sharing",
            "loved?",
            "Ugh. Cannot stand the sound of cracking knuckles. I'm taking a test and have to listen to that shit. They might as well be clipping their toenails, it's so inconsiderate to force someone else to listen to that.",
            "I‘m a compulsive knuckle cracker and tbh it makes my finger hurt like hell and swell up if I don‘t remind myself to stop regularly. Preventing arthritis sounds like a stretch, but if it at least doesn‘t cause it I‘m a little relieved.",
            "I'm going to keep \"Apple doesn't fall from tree\" in my 'to use' file :-)\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n'",
            "I'm glad we could all take this trip down memory lane with you. I miss my mom too. Sorry for your loss.",
            "powermove",
            "This makes me so happy I don’t have kids for them to be little shits.",
            "That story is a great one, because that guy won a Nobel prize for that study. Donald Unger, he spent 60 years only popping the knuckles on his left hand, disproving the link between knuckle popping and arthritis.\n\nI studied it when I was younger for pretty much exactly the same reason, since my fingers get stiff if I don’t regularly pop them, and my mom also always hated it.",
            "I crack all my fingers and toes.  With all this, that means I shouldn’t get arthritis!",
            "I have arthritis. Started at age 4. JRA. Remission as a teenager. My daughter cracks her knuckles and has forever. I always told her she would get arthritis from knuckle cracking. She finally went online and printed out a medical report showing it did not give you arthritis. It is still really hard for me not to worry about every time she cracks those knuckles.",
            "Let's clear one thing up. The guy that cracked only one hand was one example. There's no way to apply it broadly.",
            "I have heard about the man who cracked one hands knuckles but not the other, along with how it DOESN'T cause arthritis. \nIt feels more like a release to me honestly.",
            "What about an essay about an essay?",
            "Your mom still exists.",
            "Yeah this made me cry. My mom was the same way with making me write essays and silly things like that. Onrey until the day she passed. Thanks for sharing.",
            "oops - left out the \"far\"",
            "What a great story!",
            "I can hear the sounds of your knuckles cracking and it’s making me shudder and want to throat punch you"
        ]
    },
    {
        "post_id": "81znq7",
        "author": "None",
        "title": "I don't care about your excuse, hand it in or you get a 0.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/81znq7/i_dont_care_about_your_excuse_hand_it_in_or_you/",
        "score": 15727,
        "num_comments": 421,
        "created_utc": 1520189740.0,
        "selftext": "Please excuse the terrible writing. \n\nThis is a story from 4th grade. We were given a major project in english where we had to write and \"publish\" our own children's books, including drawing pictures and binding them. \n\nI went all out on this thing working on it during class, lunch, and at home. I finished it at home two days before it was due and put it in my bag to take to school the next day.\n\n(Now a little bit of a backstory, my mom and brother (3 years younger) were extremely abusive to me with my brother constantly tormenting me and destroying my stuff with no consequences.)\n\nSo my brother went through my room (again,) destroying anything he could get his hands on, snapping my pencils, my CDs, and tearing up my project into little pieces.\n\nI went in the next day and told my teacher that my brother destroyed my project and could I please have a week to turn in a replacement. She told me that she doesn't care about my excuses and that if I don't get it in the next day I would get a fail on the project. \n\nThe next day I delivered a ziplock containing the pieces of my project and dropped it on her desk, she gave me a B+ out of pity I think.",
        "permalink": "/r/MaliciousCompliance/comments/81znq7/i_dont_care_about_your_excuse_hand_it_in_or_you/",
        "comments": [
            "I was expecting a good feeling, instead I got the sads.",
            "When I was in middle school, I had this cool erasable pen. I had this project for my history class that was to make a poster with a bunch of dates or something. I did the entire project in my cool erasable pen. \n\nMy mom was a teacher in the 5-6th grade school across the street, and they had an earlier starting time, so I’d go to class with her in the mornings then walk across the street to my middle school. So the morning the project was due, I decided to head down to my Mom’s school’s library and laminate my poster for the extra brownie points. \n\nIn doing so, the heat from the laminator acted similarly to the heat from the friction used to erase my cool erasable pen, and my poster came out the other end of the machine completely blank. \n\nMy teacher took pity and gave me an A. \n\nEdit: if I’d known I could’ve put it in a freezer like 8 years ago, I wouldn’t have this story, so..",
            "Hope you're in better circumstances now, that sounds horrible.",
            "Why do i have a feeling you have a plethora of depressing stories.",
            "Sounds like your teacher gained insight & compassion for you. ",
            "Fuck your brother. Fuck your mother for not punishing him.  I felt frustrated AF reading this.",
            "Maybe you can get something out of /r/raisedbynarcissists - sounds like your brother was her golden child. ",
            "I've been holding onto this story for a long-ass time. seems relevant now that we're talking about bitchy teachers. \n\nwhen I was in 4th grade, I had a few really nice, tolerant teachers (I was in a special needs school for my autism. this was also a less enlightened time (early 2000s hahaha) with time-out rooms that locked from the outside (yes, it was a fire hazard, not that anyone seemed to notice))\nbut as their stress seemed to grow, there was increasing mentions that they might have to bring in a teacher by the name of, we'll call her Ms. Fisher. \n\nnow, EVERY student in the class had horror stories about what a psycho this teacher was and how she treated every kid like crap, but I was always taught never to judge someone by the stories others told you, and I took that to heart. when she was inevitably unleashed upon the class, I made sure to try to be on my best behavior. unlike all other days, I had all of my things in my assigned cubby, jacket hung up, you name it. I'd show my classmates she wasn't that bad.\n\nthen she walked in. the first thing I tried to do was introduce myself. upon my introduction, as if I hadn't said anything, she ordered me to get to my seat, and that the bell - which had gone off a few minutes earlier at most - meant it was time for class, not chit-chat. a little disappointed but still optimistic, I hurried to my seat without a word, staying attentive and trying to answer any question I could.\n\nnow, I was a very talkative child, overly eager to share everything i knew, (and I was definitely a know-it-all) so every question my hand would shoot up, and sometimes I would simply say it without thinking. this, of course, was a mistake, and had me sent to time-out. this I understood, because I knew I'd spoken out of turn. I asked how long it would be, and she told me ten minutes. I took note of the clock and knew the class would be over in about fifteen minutes and we would be transitioning to another subject, signalled by the bell. I waited patiently by the door, listening under the crack for more of the lesson and waiting for her to let me go. this didn't happen, and class changed over without ceremony.\n\nknowing it had been over 15 minutes now, I knocked on the door to get their attention. I was ignored, so I started knocking on the door more insistently, probably for a few minutes until my knuckles hurt, but it got her attention. when she opened the door, I told her it had been more than 15 minutes and asked if I could learn with the rest of the class. her exact words in response were: no. now you've disturbed the class again and you can stay here until the next period. I tried to understand why her mistake was my fault, and in that time, she closed the door on me again.\n\nI lost it. utterly lost my mind. I don't remember much about the next 10-15 minutes, but I remember screaming as loud as my lungs would allow and and kicking and punching at the thick oak door, protesting and saying that I want to learn over and over again. by the time the principal came to restrain me, I was in hysterics and they had to call my mother to get me to calm down properly while two teachers had to keep me still during my freakout. \n\nto be honest, I don't remember much about the time after that, but as far as I can remember, I never saw that teacher again. quite frankly, I hope the rotten hag was fired on the spot.",
            "Now hear me out. I do believe that your project was destroyed (unfortunately), but I also don’t blame the teacher for being a little skeptical of a “my dog ate my homework” excuse. Unless your teacher was already aware of your home life situation I wouldn’t blame her for refusing an extension. \n\nThat said, she could have easily just asked you to bring in the destroyed project and it would have been pretty easy to confirm that effort was put (what remained) of your work, at which point an extension would seem fair.\n\nI do rather like your response though!",
            "But, are you okay NOW though? 😞",
            "Geez you were only in 4th grade! I would probably be a hardass like that teacher if you were in high school or college. But 4th grade???",
            "Are you Matilda? Harry Potter?\nLittle brother? Did he have a mental condition? ",
            "Destroying someones stuff is something that really hits me hard. I'm glad you seem like such a competent person, despite your upbringing. Good on ya",
            "You need a hug",
            "In 2nd grade we were poor and living in a trailer. Life was kind of shitty but I was young enough to be pretty upbeat anyway. We got a new kitten one weekend and on Monday morning before school my brother and I were walking into the kitchen when the kitten appeared from beneath the couch and attacked my brother's foot. My brother was walking and accidentally stepped on the kitten's head. It went south real quick. We rushed to the vet and it was dead on arrival. Blood was leaking from its ear and nose. We were a bawling mess. My mom had to work (single mother of 2 boys) and dropped us off at school. I walked in and my shrew of a teacher asked where I had been and explained I was an hour late. I was crying still and a complete fucking mess. I explained in front of everyone my cat had died. Her response, I kid you not was, \"My dog died a while ago and I still made it to school on time.\" I was fucking confused and angry as fuck. I'll stop venting now and go smoke a cigarette. ",
            "OP, I feel your pain. My brother was the same way. He liked to aggravate and beat me up. He would try to act like he was going to slap me to try to get me to flinch. He would do it until I wouldn't flinch and then he actually hit me causing me to flinch and repeat the process. It has scarred me for life. If a colleague is talking with their hands and their hands get too close to my face, it makes it flinch. It's been over 20 years and it still happens.\n\nI remember he would also destroy my stuff. One time I made a big lego city with a bunch of builds. I had just finished it and he comes over and proceeded to kick and stomp the shit out of it.\n\nIn middle school, I remember him coming over and trying to slam my head on the dinner table while I trying to do homework.\n\nI hope life got better for you OP.",
            "I did a similar thing once. My dog ~~ate~~ tore up my homework and my teacher didn’t believe me so I brought it in a plastic bag. You could clearly see the writing where my answers were too.",
            "I did one of these in 3rd grade. I refused to turn it in and my teacher got mad at me. She told me it was very wasteful and inconsiderate seeing as she gave the class lots of time away from school work to work on these books.\n\nHer guilt trip worked. I turned it in and the guilt shifted. It was a story about my abuse as a child. In hind sight it was an incredible thing because she notified DCFS. I was placed in a foster home until my mom could get her shit together.",
            "Reminds me of a story my fourth grade teacher told about one of his past students.\n\nEvery year, each of his classes took a trip to a state historical park (an old fort), for an overnight trip. As a prerequisite for going on the trip, each student had to write a report on a historical figure who lived at the fort (and dress as them for the trip), and also make a model of the fort.\n\nThis one kid decided to make his model out of food. The family dog ate it. Of course, the teacher didn’t believe the oldest cliche in the book, so the student ended up bringing the vet bill in as proof.",
            "Man, my mother and brother did the same shit... He usta play that knock out game, randomly he would just punch me in the head trying to see if he could k.o. me with one hit over the 8+ years he got real good. I'm 32 and wake up thinking about it every morning and why my mother let him... He now has 2 boys the same ages apart and I hope karma is real.",
            "Maybe head across to r/raisedbynarcissists there are some good things to read which may help you. I'm so sorry for what you want through ",
            "Had a dog tear up just regular homework in 3rd/4th grade, somewhere in that time frame. My teacher found it hilarious when I turned in a bag of what was basically confetti.",
            "I had a friend who got constantly abused by his brother until he was 9 years old, at which point he'd decided he'd had enough, grabbed a baseball bat, and smacked his brother hard enough, and enough times, that the brother had to go to the hospital.\n\nBecause this was a crime, the friend had to go to a foster home, and the abuse came out.  Fortunately for my friend, when the abuse came out, he was moved to Boys Town, and started getting help for the nightmares and the depression that followed.\n\nBut I found out what he did to his older brother.  Multiple broken bones and a massive concussion.  Man, did he have some issues.",
            "/r/raisedbynarcicist is leaking",
            "I've been holding onto this story for a long-ass time. seems relevant now that we're talking about bitchy teachers. \n\nwhen I was in 4th grade, I had a few really nice, tolerant teachers (I was in a special needs school for my autism. this was also a less enlightened time (early 2000s hahaha) with time-out rooms that locked from the outside (yes, it was a fire hazard, not that anyone seemed to notice))\nbut as their stress seemed to grow, there was increasing mentions that they might have to bring in a teacher by the name of, we'll call her Ms. Fisher. \n\nnow, EVERY student in the class had horror stories about what a psycho this teacher was and how she treated every kid like crap, but I was always taught never to judge someone by the stories others told you, and I took that to heart. when she was inevitably unleashed upon the class, I made sure to try to be on my best behavior. unlike all other days, I had all of my things in my assigned cubby, jacket hung up, you name it. I'd show my classmates she wasn't that bad.\n\nthen she walked in. the first thing I tried to do was introduce myself. upon my introduction, as if I hadn't said anything, she ordered me to get to my seat, and that the bell - which had gone off a few minutes earlier at most - meant it was time for class, not chit-chat. a little disappointed but still optimistic, I hurried to my seat without a word, staying attentive and trying to answer any question I could.\n\nnow, I was a very talkative child, overly eager to share everything i knew, (and I was definitely a know-it-all) so every question my hand would shoot up, and sometimes I would simply say it without thinking. this, of course, was a mistake, and had me sent to time-out. this I understood, because I knew I'd spoken out of turn. I asked how long it would be, and she told me ten minutes. I took note of the clock and knew the class would be over in about fifteen minutes and we would be transitioning to another subject, signalled by the bell. I waited patiently by the door, listening under the crack for more of the lesson and waiting for her to let me go. this didn't happen, and class changed over without ceremony.\n\nknowing it had been over 15 minutes now, I knocked on the door to get their attention. I was ignored, so I started knocking on the door more insistently, probably for a few minutes until my knuckles hurt, but it got her attention. when she opened the door, I told her it had been more than 15 minutes and asked if I could learn with the rest of the class. her exact words in response were: no. now you've disturbed the class again and you can stay here until the next period. I tried to understand why her mistake was my fault, and in that time, she closed the door on me again.\n\nI lost it. utterly lost my mind. I don't remember much about the next 10-15 minutes, but I remember screaming as loud as my lungs would allow and and kicking and punching at the thick oak door, protesting and saying that I want to learn over and over again. by the time the principal came to restrain me, I was in hysterics and they had to call my mother to get me to calm down properly while two teachers had to keep me still during my freakout. \n\nto be honest, I don't remember much about the time after that, but as far as I can remember, I never saw that teacher again. quite frankly, I hope the rotten hag was fired on the spot.",
            "My stepbrother told our teacher his dog ate his homework.\n\nThe teacher didn't believe him until she saw the ziploc bag with it.\n\nI think all the saliva sold her.",
            "I did this same project and had an asshole teacher try to fail me because I didn’t draw it, I did it in some glorified PS ripoff with a bunch of clip art. \n\nShe was pissed I wasn’t “creative enough” to draw until my dad went all poppa bear on her ass not so politely explaining that I basically did a graphic designers job in 4th fucking grade bitch. Still have that book. Proud AF of that thing my kids will read it dammit. ",
            "As someone who has younger brothers who'd pull this shit all the time, this hits home. Eventually I ended up finding out the only way to male sure they wouldn't destroy something is if they use it just as much as I do, such as video games and game consoles that were too expensive for them to replace as a kid. Regardless, you gotta hide stuff where no one would look without a bit of effort (behind the bed frame, in that high kitchen drawer no one uses, even a friend's house) or else they'll get at it. This is why I lock shit up and have trust issues.",
            "I had something similar in elementary school where my dog tore up my homework.\n\nMy teacher thought I was joking when i said my dog ate my homework, but then I pulled out the ziplock bag with the shredded assignment",
            "I don't care about your teacher now. Please tell me how things turned out with your mom and brother.",
            "We're poking fun and all, but we wish you and your family the best.",
            "Your elementary school gave out letter grades? We just got\n\n\nO = outstanding\n\nS = Satisfactory\n\nN = Needs improvement.",
            "Aww, OP deleted it. ",
            "My teacher would've done the same. They grade you more on character than anything. I think it's important though that yes, effort can be rewarded.",
            "i would have beat the living shit out of my brother.",
            "Unethical LPT: Do a shoddy job on your project, tear it to pieces, then bring some of the pieces in and say your dog/brother destroyed it.",
            "Is your brother still an asshole?",
            "But how are you now?",
            "Damn your family members are shite ",
            "i can just imagine the teacher looking at the words and art on the paper thinking, \"he actually worked on this. that sucks\"",
            "I hate your kid brother.",
            "That's how a school shooter is born",
            "God, I relate to this. My parents were very physically/emotionally abusive, and if I didn't bring home A+'s on everything, it wasn't a fun time. I also had to do a project like this in fourth grade, and I don't remember how many times my mom made me redo my book to make it perfect. \nGlad you're in a better situation now, OP. ",
            "Plz op bring it back",
            "Great, it's removed",
            "ok, gonna need a mirror for this one",
            "[deleted]",
            "Dude. I have no words. I hope you have gotten yourself away from them and have gone no contact.",
            "If my brother did that I would probably break his nose and beat his eyes out. I feel so sorry for you. I couldn't last in that family without going fucking ape shit. ",
            "I wish I could read this but the mods are  f a g s",
            "[deleted]",
            "In reality, I don't blame the  teacher. You hear a plethora of excuses as a teacher and would not have any reason to believe that yours was true. I think if you brought that zip-lock bag when you went to ask for a deadline extension, she would have given you the extension, considering you got an above average grade without even evaluating.",
            "Should have broke your brothers arms. Would have sucked for you and you would have gotten severely punished but your brother wouldn't ever be a shithead to you again, unless he's mentally challenged or just really really stupid.\n\nPlus then your mom would have had to give him a helping hand and they would both get put away for incest, win-win situation",
            "Sorry if this comes across as insensitive (not meant that way) but why didn't you just kick your little brothers ass? I mean he is 3 years younger and you are still in school. Just kick his ass and make sure he knows if he tells mom he gets it worse.",
            "So so sorry my dude. Raisedby narcissist subreddit is good place to vent if you need it. I hope you’re living a good life away from those two monsters. ",
            "Got em ",
            "I feel for you.  I had a similar situation with my mom and my younger brother of 5 years and this sort of thing happened all the time to me.  ",
            "I had to do that same project in the 4th grade. I've never heard of anyone else having to do something like that.",
            "OP's name? Matilda.",
            "Are they narcissistic?",
            "So after all these years, I trust you are preparing a very cold dish.",
            "Is your brother still a dick hole?",
            "Similar story, exept my cat peed on it.\n\nSimilar solution, but the bag smelled a bit.",
            "Are your little brother and mine related? I had those same problems and it sucked.",
            "\"MARK IT ZERO!\"",
            "This is so sad but glad she gave you a mark! And glad you are doing better now. Being a kid sucks when you feel powerless like that. ",
            "hm.. i don’t remember having letter grades until middle school. and it’s odd that someone teaching 4th graders would be harsh about that. elementary teachers are usually very tolerant with young children",
            "I remember that project in 4th grade! I wrote something about my little brother being annoying lol",
            "damn that's sad :( I remember doing that project in 3rd grade and it was super fun and I still have my book!",
            "Jeez what was the logic behind your mom & bro being like that to you in the first place if you don’t mind me asking?",
            "[deleted]",
            "Yeah, I’m going to need a follow up on when/how the abuse stopped/you escaped",
            "I did the exact same thing in fourth grade. I wish I could find the book. It was terrible, but awesome for fourth-grade me.",
            "Sorry to hear that. Hope you and your brother are good now.\nAbused siblings have a really hard time getting along.",
            "Sending you love. I hope you’re doing better now. ",
            "I kind of want to hear tales of your vengeance upon little bro...",
            "We're poking fun and all, but we wish you and your family the best.\n\n",
            "Should’ve tipped the whole thing on her desk and walked out of the room like a boss",
            "Sorry for your hardship but kudos to that teacher for recognizing the work you did.",
            "Your entire post history is about knitting and parenting\n\nAre you role playing for your future child?",
            "You sound like your mom wrote this. You're gonna go far, kid. ",
            "This isn't malicious compliance...",
            "Hope you assaulted the mfker at one point in your life. Bullying is a serious problem. ",
            "Why didn’t you ask to keep your project at school? ",
            "[deleted]",
            "[deleted]",
            "Well, if it happened once already (your brother breaking things in your room) then why didn't you take precautions and put this book somewhere safer."
        ]
    },
    {
        "post_id": "die4r9",
        "author": "wss1252",
        "title": "Manager wouldn’t help when short staffed. Had to do the work herself at the end of the night.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/die4r9/manager_wouldnt_help_when_short_staffed_had_to_do/",
        "score": 15718,
        "num_comments": 282,
        "created_utc": 1571172252.0,
        "selftext": "When I was in high school I had a part time job working at a local restaurant. One day I came in and was scheduled to wash dishes, no big deal. I walked into the back and came to find out that the morning shift did not have a dish washer therefore there was a mountain of dishes. No bueno. On top of all of that, we got slammed that night. \n\nAs a minor, I was required to take a 30 minute break in order to work my full shift (4-10pm I believe). As I clocked out for my break I asked my manager if she could have someone cover my position while I was on break to prevent an even worse situation than was already at hand. She responded ‘Won’t be able to. You’ll just have to stay late and finish it’.\n\nAn important thing to keep in mind is that this manager was notoriously lazy and unhelpful. She never lended a helping had to get things done faster. She would rather stay 3 hours past close sitting in the office waiting for us to finish our closing duties instead of coming out and helping and getting everything done in a timely manner. She also was not very familiar with child labor laws in Ohio.\n\nSince I was a minor, not only did I have to take a 30 minute break, I also could not work past 11pm on school nights. So after clocking back in from my break, I resumed washing the mountain of dishes that had accumulated. I took my time and didn’t rush to get everything cleaned, but also wasn’t going extremely slow on purpose. \n\n10:59 rolls around and I walk into the office to tell her that I am leaving. She asked ‘got everything done?’\n‘Nope!’ I said. ‘It’s a Wednesday night. Can’t work past 11pm. Labor laws. I left the water turned on for you. There’s still a lot left!’\n\nThe look on her face was priceless. I clocked out with the biggest smile on my face knowing that she was going to have to leave the office and do something for once.  Asked another manager the next day to see what time she clocked out. 1:15am!",
        "permalink": "/r/MaliciousCompliance/comments/die4r9/manager_wouldnt_help_when_short_staffed_had_to_do/",
        "comments": [
            "I always had the most respect for the people who worked the dish pit. Whenever I had to pitch in as a manager or a server (that silverware ain't gonna roll itself) I hated that feeling of being overwhelmed and sweaty and dirty.......",
            "Here’s a secret to being a successful and respected manager- Your staff is not there to serve YOU, rather you are there to support the staff. \n\nPerson can’t make it to work on time- you help them arrange a ride or pick them up yourself. \n\nPerson can’t do the job correctly- you train them yourself. \n\nWork in the outdoors- you go on runs for cold drinks or hand warmers\n\nYou lead by service and example and anyone who would tell you differently isn’t doing it right. Nobody will willingly do things for you if they know you wouldn’t do for them.",
            "Zero respect here for managers who won't get their hands dirty. I came up through the ranks and I absolutely expect to be doing any job from top to bottom as needed. That's why I get paid more - nothing magic about my job.",
            "Was the senior assistant manager for a Taco Bell with the big tumbler sink and I made it a point to do dishes regularly. Your staff won't respect you if you lead from the back and ask them to do things you aren't willing to do. I remember bugging out one night because someone tossed two french knives in the sink with it tumbling. Found the first one without losing a finger thankfully. That was one of my more rare moments as management for sure. Whole place went silent while I turned three different shades of red and started shouting. Afaik nobody ever tossed sharps in the sink again lol.",
            "Everyone depends on a dishwasher in a restaurant. So its not very wise to be rude to them",
            "A manager who won't do any job that they assign to someone else is useless. \n\nWhen I had people working for me in a manufacturing environment if I wasn't at a meeting or doing a required task I would take the hardest, dirtiest job available. \n\nThen when anyone came to me and complained my first response was do you want to do what I'm doing so I can go do your job. Most people said no thank you.",
            "She doesn’t deserve that position.",
            "I'm surprised she didn't leave them for the morning shift to do.",
            "Perfect. My mum did something similar a few years ago when her union went on strike. She works nights and usually does an 8pm to 8am shift. She went in and worked as normal the day before the strike and at the stroke of midnight she logged off and left. Her manager asked where she was going, laughing, and didn't take her seriously until she left the building to picket outside.",
            "Sounds like the majority of my managers in FF. Only one actually does work because it’s left to be done. Another will do it if it’s required and clearly won’t be getting done. I do have one manager who busts her ass on everything but she’s a rare gem. The other 5 don’t do shit unless it’s rush. And even then it’s only what’s required of the position during rush 🙄",
            "Got promoted to manager at the age of 18 at a fast food chain, over a 23 and 25 year old. Didnt want it at first because I have massive anxiety of competence and didnt want to be in charge of my 5 or so good friends who also worked there. Surprisingly I loved it. Got to organise things properly, jump in the dish pit when things got hectic, jump on burgers etc when the dockets started to pile up. \n\nSorry to ramble, had a tiring stressful day and need to share.",
            "I had one of my bosses recently who asked me what I had left to do because \"I'm not staying past 7 I wanna get out of here.\" (I have keys but she technically can't leave before I finish)\n\nSo I told her what I had left, laundry wasn't going to be ready until close to close and there was a lot to button up. Still had to sweep, wipe down tables, restock a thing or two, and get that laundry folded. And I stressed to her that I was NOT going to leave the morning shift with nothing and make them scramble to get ready. She had everything she needed to be done finished already. So I'm just going at my regular pace (my shift is supposed to end 30 minutes past close). She sat at the desk on her phone clearly miffed that I was still working. If she had lifted a single finger to help me, we would've been out real close to 7 like she wanted.\n\nPart of being a manager is stepping up when your team needs help.",
            "Always help the dish fits out. I give em a fist bump when I first see them, ask how their family is, and throughout the shift if I see several racks coming out of the machine I'll grab and pull plates off a few  before moving on. You want them to have your back.",
            "Best manager I ever had was in the basement helping housekeeping mop a flooded bathroom the first time I met him. This was a 125 room hotel in the middle of a city, he could have given that job to anyone, but he had his sleeves rolled up and was working his butt off. That kind of thing leaves an impression.",
            "I worked the dish pit in the military. You have my utmost respect.",
            "[removed]",
            "Sorry, not sorry. Part of being a manager is *managing.* \n\nNot paying attention to jobs that need completing and being unaware of the status of given employees are not signs of good management.",
            "I liked the ending, made me chuckle",
            "I always tried to scrape off as much as I could for the dish pot guys. That job has to suck. It’s already hot in the kitchen, now youre next to a literal steam machine. \n\nIn my restaurant he would have to clean the floors afterwards, too. I didn’t work their for long when I saw the GM constantly sitting at the bar while we were slammed.",
            "Serious question: would an adult worker get a break in a 6 hr shift?",
            "When the first jobs I ever had I was a dishwasher at Tony Roma's. Mother's Day was a nightmare it was a mountain of dishes that I could not get down it was horrible. The worst thing ever was that night I went home and had a nightmare about washing dishes",
            "Ugh I know that feeling.\n\nBreakfast people either do a shit job washing the dishes or they don’t bother doing them.\n\nAnd guess who’s stuck doing it. The closers.\n\nAnnoying af.",
            "Was a dish washer for a few weeks. Apparently there's a technique to it I was supposed to have just known....",
            "I figured this would end with . Tons of dishes left for the morning dish washer",
            "Speaking as a former restaurant manager, she deserved every dirty dish. First rule of management: Don't ask your employees to do anything you're not willing to do yourself.",
            "Managers that think they are too good for work are the worst.",
            "When I worked in a restaurant the dishwasher told me that he once beat a guys head in with a shovel. Made sure to be careful around him",
            "I don’t miss my time at Chipotle. I learned to respect those in the restaurant industry but Chipotle was a mad house. Deep clean every night and we had to recites company mottos which I thought was bullshit.",
            "So 2h15 extra work ? Even if she had found a replacement during your 30 MN break, you wouldn't have finished by 11pm.",
            "Sounds like Bob Evans.",
            "This is yet another example of why I believe any dishwasher/kitchenhand is pretty much the most important person in any business with a kitchen! Especially when busy!",
            "but where's the compliance?",
            "Dish pit is seriously the easiest job in a kitchen lol. Barring some old ass reastraunt with no machine and just like a 3 piece sink system... one efficient person in dish could easily handle 50..80..100 customers worth of dishes / hour\n\nI get the shitty atmosphere of an understaffed kitchen... but I also get the frustration of watching a coworker sluff off all shift in gear 1 only to ask for help at the end of the night... nahhh",
            "And THIS is why labor laws have to be posted where employees are guaranteed to see them during a workday.  So asshats like this manager can’t trick you into breaking the law for them.\n\nGood job, kid. :)",
            "This gives me the biggest justice boner! My first job when I was 16 was at a pizza place as dishwasher and like you I was only legally allowed to work till 11 on school nights! The cooks and bartenders would hold all their dirty dishes till after closing and then all go on a smoke break or leave and i'd be stuck washing half the kitchen or more. \n\nI would normally have it done by 11 but some nights nowhere close and always had this one manager that would demand me rewash something or deep clean the grills at like 1045. Well one day my dad was outside waiting for me to get off and I did what you did and right at 11 went into the office to clock out and watched my manager realize she had to deep clean and finish my mountain of dishes and sauce pots!",
            "This sounds like my job at KFC in perrysburg OH",
            "It's a good story, but I'm surprised at how management didn't tell you just to continue otherwise.  As a dishwasher where I work, I end up taking a maximum of a 15 minute break during 8-9 hour shifts, when the law states 30 minutes is needed.",
            "I’m not mad at you OP",
            "I thank my dishwasher bc I am well aware just how much work I am not required to do bc of them.",
            "I haven’t been to bed before 1:15 AM in about 8 years. And I definitely clock out twice a week after 2:30 am.",
            "Worked dish for like a year once. No worse feeling than coming in to work to a mountain of dirty plates and pans",
            "As a busboy, I would always go back and help the dishwasher when things got completely wrecked. Just the fact that what I was doing was extra and that I’d be fresh on that job, made the job easier to do quickly, compared to the fisher who was fatigued from slogging away all day back there. The wait staff knew what was up and would pick up my bussing slack while it was manageable, then tell me when it wasn’t. \n\nDishing is somehow super easy and fun when it’s not entirely your responsibility.",
            "In western New York State FOH do not tip out BOH. \n\nDish washers start at about $11/hour \n\nServers make $7.50/ hour + tips. Which translates on the low end to $20/hr. On the high end $40/hr\n\n\nEven the best cooks top out at about $18/hr. Most experienced cooks are making more like $14-15\n\nDishwashers are treated like trash. Turnover is extremely high. \n\nAssistant managers make 45-55k a year and work 50 hour weeks. If servers were allowed to work 50 hours they’d be pulling way more money than their bosses. \n\nWages in the US are so messed up.",
            "Was her name Janet?",
            "I always showered after work as a dishwasher.  I liked that I am there by myself , but I felt very dirty by the end.",
            "Ding !\n\nScore !!",
            "Honestly you should have stayed later, and then sue their asses",
            "I don’t think this is really malicious compliance. Good story tho",
            "my only issue with this is that u left the water on because environment",
            "Worked at a pizza place for a few weeks. I was hired on to do prep work and make the pizza dough. This position specifically did not include doing dishes even though I know prep work and dishes are often combined. After a week the 2 dishwashers left to go back to school. Something the manager knew ahead of time. Since my station was directly next to the sink and i was very good at timing my tasks with the mixer so i could get stuff done while waiting for it, I started doing my own dishes as I went along to stay on top of things. This gradually turned into me doing EVERYONE'S dishes. I didnt mind at first bc if I have no tasks of my own to do Im down to help out others. But it turned into one of MY responsibilities and ended up staying later than everyone else after we closed. My last week there I just stopped doing dishes and at the end of the first night the manager just stared appalled at the mountain of dishes left as everyone walked out. I didnt feel bad bc 1) he knew we didnt have a dishwasher and instead of making sure everyone picked up the slack he just let it all be dumped onto me. 2) he still hadnt put me on payroll so I hadnt been paid. 3) he started me out at a lower wage and saif after a couple of weeks he would give me what I wanted if i was a good worker. And I was as him and the owners said I was the best at that station they'd ever had. learning new stations was also supposed to come with a pay raise. and the dishwasher position alone is paid more bc it sucks. So after 3.5 weeks of no pay I just said I quit. You owe me money and a $4 raise."
        ]
    },
    {
        "post_id": "f70lxv",
        "author": "filipinopanda",
        "title": "This lady wanted a fresh donut so I gave it to her",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f70lxv/this_lady_wanted_a_fresh_donut_so_i_gave_it_to_her/",
        "score": 15701,
        "num_comments": 429,
        "created_utc": 1582236099.0,
        "selftext": "So I wasn't sure if this was malicious compliance and I posted it in Entitledpeople but someone said this would be great here. So here it is. Also Thank you to RSlash on youtube for making me realize I have so many stories to share.\n\nHere's my story\n\nWhen I was 15 I got my first paid job working for the fair. It was a pretty big fair that travelled across Canada and along the east coast of the US ending in Florida for Christmas. If you've ever been to the PNE(Pacific National Exhibition), CNE (Canadian National Exhibition), Red River Ex, Calgary Stampede and whatever they call it in Edmonton and Regina, that's the one. I loved this summer job because it was short (only a week as I did not travel) and gave me enough cash to get through the summer. I worked for the privately owned donut vender which tasted better and paid better than the show donut venders.\n\nFast forward 4 years when I decided to travel with the show. I was 19 and it was easier to travel at this point cause I could sign my own forms, and being 19 I needed more money for school and the like. We start in my home city and make our way across the country visiting city after city. We were in Edmonton when our story really begins.\n\nNow the travel crew is pretty small and we hire our bagging/cashier locally. I, along with senior crew members, are in charge of training the baggers, re-oiling the machines, switching out the dough canisters and making sure they are running and putting out donuts in a consistent manner. As I am checking dough levels and teaching a bagger how to efficiently fill bags for the evening rush I hear a commotion behind me.\n\nQue Entitled Woman\n\nKaren: \"No! I want the *fresh* ones!”\n\nBagger: “Ma’am these are fresh, I just made them.”\n\nKaren: “No, I want them to be fresh. Make me new ones, I didn't see you make those, they could be old.” It was 9 in the morning. At this point in the day, most donuts are made to order so those donuts wouldn't have been older than 5 minutes.\n\nThe Bagger calls me to turn on his machine to start the donuts. These machines are so temperamental and really old because the owner built them himself many moons ago. But I love them cause they make perfect donuts that travel in a circular conveyor belt in 400-degree oil. They're a lot of fun to watch. I start the machine and scoop out the first few rejects and make 15 donuts.\n\nThe donuts fall off the belt into the glass case and the bagger slots them into the sugar and into a bag.\n\nHe hands them to her and she dramatically sighs\n\nKaren: “uuuugh, No. I want the fresh ones and those have touched the old ones. How do I know you didn't mix them up. I don't believe they're fresh. I want *FRESH* DONUTS!”\n\nBagger: “Ma’am those are fresh. I made sure to pick only the new ones out.”\n\nAgain she huffs and puffs, so I fire up the machine again, scoop out the rejects and make 15 donuts. This time I grab the new bag and place the bag right under the shoot so the donuts have no choice but to fall into the bag. They do I hand it to the bagger and walk away just to have to turn around again.\n\nKaren: “No I want the one’s directly out of the oil, that way I know they're fresh. Those ones have cooled down and are not fresh anymore.\"\n\nMe: “Sorry ma’am but that is against the policy, the oil is 400 degrees, and besides, they’re not done cooking”\n\nKaren: “I want the fresh ones! Get me your supervisor.”\n\nMy “supervisor” is off doing supervisor things, and I don’t feel like calling her. She’s also a lifer and doesn’t take flack from anyone and I know if I call her, and she’s busy, this woman will leave crying. So to avoid this and say\n\n“I am the supervisor on duty right now and the policy states we can’t give you donuts from the oil.” There is no policy but its common fucking sense.\n\nKaren: “I have been a patron of this company for so many plus years. I have never been denied a fresh donut. this is so unprofessional! I want to talk to the owner right now!”\n\nAt this point, I’m on day 5 of this show and we work an hour before open to an hour after the close (depending on the show and after some new laws, roughly 16 hours daily).\n\nI’m tired of her and in general. That's when I get a brilliant idea. I smile,\n\nMe: “there is no need for that, I will get you your *FRESH* donuts.”\n\nI start up the machine again and discard the rejects. I then grab a bag and let the donuts plop into the oil for half a second and scoop them out immediately. Not long enough to get hot, but also not long enough to hold a shape. I then take the bag of dough and sprinkle in some cinnamon sugar and say as sugary as I can muster “here you go, sorry for the inconvenience, enjoy the rest of your day.”\n\nShe smiles smugly having thought she got her way. About 10 paces later she stuck her hand into the bag and I hear a squeal, a snarl and then swearing.\n\nThat’s when Gregg (not his real name), one of the senior machine guys, returned from his break. Gregg was a FUCKING LEGEND when it comes to dealing with Karen's. He makes it a hobby to seek them out for fun on his breaks so he can tear into them. He once told a heavy customer in a scooter he would not sell her 50 bags of donuts because he didn’t want to be responsible for her coronary and could not have that on his heart and that she should take her business to the other donut stall. He can be quite savage. I don't condone his behaviour and sometimes he scares me but this is also why I like working under him because it means Karen's never get away with their shit.\n\nThe women came storming back and demanded a refund and demanded I be fired. He asked why and she screamed, “THAT BITCH SOLD ME A BAG OF DOUGH!”\n\nGregg asked me if that was true. I smile sheepishly and said yes and explained she did not want the fresh donuts off the belt she wanted the fresh donuts from the oil and would not leave till I gave them to her.\n\nGregg turned to her and said “sorry for that but we don’t issue refunds to dumbasses so take your fresh donuts and leave before I start pelting you with these donuts. You have 5 seconds. 5, 4, 3...\" She tried to huff and puff at which point he took the bag of donuts she did not want and began pelting her with them.\n\nAfter she left he told me he was proud of me and would let the Boss know. I got an extra hundred bucks in my per diem for that week.",
        "permalink": "/r/MaliciousCompliance/comments/f70lxv/this_lady_wanted_a_fresh_donut_so_i_gave_it_to_her/",
        "comments": [
            "[deleted]",
            "Damn now I really want some fresh donuts 😂",
            "You don't understand, she wants the fresh 400 degree ones. She can't sue you for letting her burn herself if you give her the cooled down ones!",
            "Never go Karen on a Carnie. They will be in a new city next week, so they don’t give a fuck.",
            "Still genuinely a little mystified as to what she wanted then.  The only thing I can think of is that she didn't want her donut(s) mass produced like the others and wanted you to stop what you were doing and individually make hers....because she's entitled.",
            "That. Is . One. Of. The. Best. Bosses. Ever\n\nThanks for the chuckle.\n\nI once long ago worked in hospitality and had a boss like that. His name was Marco.\n\nWhen Karens or Richards would ask to speak to the manager(Marco was owner and manager) everyone would smile sweetly and say okay and stand back and watch him work.",
            "Great!  Grew up in Edmonton, been to Klondike Days many a time (now in a different province, west ;)).  Are these the mini donuts? hhmm, called Tom Thumb? or something like that.  They are soooooo goooooood!!!! :)",
            "I now hate the phrase \"I want the *fresh* ones.\"",
            "Lol. My first job was at the PNE. Would get a bag of your donuts everyday after the shift. I remember that machine!",
            "Reject doughnuts?  I should never work at a place like this, I would probably have eaten the reject doughnuts until I was sick.",
            "[removed]",
            "I traveled with an elephant ear/ funnel cake trailer for a couple summers.   I think every fair gets a few of these people.   Everyone else is having a blast.   None of our product sits for longer than ten seconds out takes too sugar them.   Lady asks for a \"fresh funnel cake\"  Get her money and Oops, powdered sugar and hot greasy funnel cake all down the front of them.   \"Want extra napkins? \"",
            "Why does it take five paragraphs for your story to begin",
            ">Save post\n\nI bestow upon you the highest of honors I can grant.",
            "\"whatever they call it in Edmonton\", dude I've lived here most of my 32 years and I still don't know what it's called at this point. I'm fairly certain there are like 4 names that rotate at this point. K days, capital X? I don't know...",
            "[deleted]",
            "[removed]",
            "Rslash is a shitty youtuber",
            "[removed]",
            "The pro-move would have been to charge her for 5 bags of donuts, \"Because the ones we made fresh for you will become stale and un-sellable by the time more customers come in.\"",
            "This story could've been told in two paragraphs. Why everyone on this sub just have to share all their life story before the actual MC.",
            "[removed]",
            "Can we have a \"no pandering to YT karma whores\" rule?",
            "Fuck rslash",
            "I'm unsubscribing",
            "As a former carnie. (Wade shows!) You do not want to Karen the fair workers.",
            "Excuse me there is a job in Canada where you sling donuts for one week and make enough money to last your whole summer???",
            "Sigh.  Now I want to make some donuts.  The only thing stopping me is my desire to eat well.  Also, being tired, which is actually a more effective deterrent.",
            "Those little donuts.",
            "As an Edmontonian, I apologize for this Karen. If she was keeping me from getting those donuts, I would have drowned her in that little fishing game.\n\nYou do God's work.",
            " It’s 1:30am and I really want donuts now",
            "Oh, you just brought back so many memories.  And they're still rushing in.  I used to ***love*** those little donuts that I would get at the flea market as a kid.  I haven't had any in probably 30 years, and that's not a good thing!  But now I'm remembering stalls I haven't thought of in forever.  Thank you!!!",
            "Lucky she didn't do you both for battery.\n\n*Bah-dum tissh.*",
            "To be a real Karen's advocate about it, those aren't technically \"made to order\". You made \"just in time\" batches which is obviously better in this case, but she thought she was entitled to you seeing her single donut through the oil and directly into her gob.",
            "I just imagine some dude chucking doughnuts at a disgruntled Karen yelling \"Git' on, now! Git!\"",
            "People who don't believe people like this exist have never worked with the public.",
            "Delicious compliance!  \n\nI burnt my tongue on a jam filled donut at a market 25 years ago... was in pain for days.  FYI  I just took the donut they gave me... I hadn't asked for a \"fresh\" one.",
            "Never mess with the donut workers.  They can make or break your day!\n\nI too worked a cafe at our local fair, for tuition money.  Every year without fail, we had an independent donut stand directly across from us.  The owner was awesome!\n\nOne year, the County tried to make more money on his \"spot\" by bringing a new vendor in, who would pay the ridiculous amount of money for that \"spot\".\n\nThis ruffled the feathers of my school, because our buddy the donut guy drew a good crowd in the early morning, which also brought in breakfast diners to the school's permanent fair stand.\n\nAlumni and parents adored independent donut guy so much, they hatched a plan.\n\n  The school decided to \"upgrade\" their cafe the next year.  They built a large chalet type structure, that turned that vendor \"spot\", into part of the school's permanent cafe.\n\nNow independent donut guy has a nice little permanent spot, because the school made sure there would be enough room for him to operate too!",
            "They sound delicious and now I want donuts",
            "What a fucking donut of a person",
            "OK but can we get back to someone buying 50 BAGS of donuts?!",
            "You want loyal employees?  Because THAT'S how you get fucking loyal employees!",
            "Back in my Sbux days, I had a customer complain to my manager that her extra hot white mocha latte wasn't made with fresh, cold milk.\n\nIt was mid morning rush and the gallon of milk hadn't been put down since the partner on bar first pulled it from the fridge and opened it.\n\nBut sure Karen, we'll go to the back fridge and pull a brand new gallon jug to remake your drink, even though the temperature of the milk going into the steaming pitcher has no bearing on the end result of your drink.",
            "Damn you! Now I NEED some of those little doughnuts, and I’m north of 60, in February, and the PNE isn’t until forever.",
            "You and Gregg are my heroes of the day!",
            "I made donuts with my Mom yesterday and contactlessly delivered them to my aunt for her birthday, and started thinking about this story. I loved thinking about that guy throwing donuts at Karen and had to read it again.  Thanks for a second round of quarantinertainment.",
            "*Cue.  Also, very funny karma story!",
            "I work in a Deli, Will litterally get fried chicken from the oil, put it in a box and set in our rack. Before I can even get it moved over I already have a lady screaming about how it's not fresh enough and they want it \"fresh\"",
            "/r/JustAnotherRSlashHo",
            "[removed]",
            "This is absolute gold",
            "You had me laughing out loud at the “THAT BITCH SOLD ME A BAG OF DOUGH!!!”",
            "Nothing's fresher than dough.",
            "I want to see the machine and Gregg",
            "Mmmmmmm, Tiny Tom donuts, they're awesome!",
            "This looks awesome. I would love to hear.",
            "New band name: **Pelted With Donuts™**\n\nPatent pending.",
            "Santa's Enchanted Forest!!!",
            "Were these Tiny Tom donuts?",
            "This seems like an interesting place to work lol",
            "Correct me if I’m wrong, but did you guys go to Toronto during late summer? Great story by the way!",
            "Brava!  More, please.",
            "I nominate her for an attempt of the Darwin Award",
            "It's called Buffalo Days in Regina.",
            "I loved that the story didn't end when it could have.",
            "Legend. Absolute legend. Both of you. As a former fast food worker and retail worker I literally give you a standing ovation.   \nWhen I was at McDonalds at people asked for 'fresh' fries when I literally just took fries out of the oil, I would simply get them the saltiest, most oil drenched fries I possibly could. This beats that by a long shot.",
            "Do you know how much I would pay to see a video of Gregg just pelting a Karen with donuts? A lot... I would pay a lot...",
            "I love Gregg.",
            "Gregg rulz ok",
            "Just give her a burning cup of oil and she can fry up the dough herself",
            "Our college band used to sell fried dough (now called funnel cakes) at spring fair every year to raise money. Maybe this \"Karen\" was looking for something like that, because we pretty much scooped the dough out of the deep fryer the second it was done, dabbed off the excess oil, sprinkled it with powdered sugar, and handed it to the customer.\n\nSide note - one of our best friends is named Karen; she's the sweetest, least confrontational person I know, and a great tipper. I don't know if she reddits, but she would probably be amused to see what kind of reputation her name has here!",
            "I'm glad sticking up for yourself got you a bonus",
            "I've had that kind of boss. I would have thrown a Karen in front of a speeding bus for him.",
            "This comment has been overwritten because I share way too much on this site.",
            "Those little donuts are awesome! Good story bro!",
            "Everyone that has EVER worked any kind of customer service is so satisfied by this story",
            "shoulda made her eat them. \n\nupvote",
            "Gregg is that Jack Black character from High Fidelity if they ever make this a film.",
            "This lady wanted a double entendre so I gave her one... ;)",
            "Possibly the best MC I've read. Thank you.",
            "Now I want donuts 😐",
            "This post inspired me to eat donuts today.",
            "Fucking legends",
            "I can already picture this woman’s haircut.",
            "I condone Gregg's methods",
            "You shoulda done that but with a 400 degree donut",
            "I used to manage a donut shop. Hell, I might have give you a bonus myself for that one...",
            "r/LegendaryCompliance",
            "Fking awesome. Wow. Professionals including people who work in and around dangerous equipment know what they are doing. O love doughnuts at Krispy Kreme but I would jump over the counter to grab the \"fresh\" ones.\n\nEdit. I love doughnuts at Krispy Kreme but I wouldn't jump over the counter.",
            "beautiful",
            "My god this was a ride",
            "ROFL, what a lovely ending. \n\nYa, Karens.... where did those come from...",
            "EPIC!",
            "Shoutout to Gregg in this story! He’s the anti-Karen every business needs",
            "It’s Buffalo Days in Regina and love those donuts. Best part of the ex.",
            "You made me remember the only enjoyable part of working retail - telling off the Karens!",
            "Those little donuts?!",
            "I'm pretty sure I've sold a metric tonne of costume jewellery to the folks working with this group. \n\nAlso may have consumed a few hundred pounds of those doughnuts (the midway mini doughnuts) over the years while working as a vendor (average 1.5 bags a show over a span of 30 years with a minimum of 3 shows a year with midway).",
            "You were amazing and boss Gregg is the man! Well done!",
            "I know exactly what fairs you’re talking about and love their mini donuts. I would have guessed this was in Regina but we have more crazies than Karen’s lol",
            "I swear... Some of these stories would make great scripts for short movies to watch online.  \nA+++",
            "well shit, my only carnival story is when a couple of girls offered to flash me for a free game of skee-ball",
            "I have lived this for the last decade. When they’re still dripping with oil, they smoosh at the slightest touch and the powdered sugar turns into a wet sludge. Or, they ask for light sugar on hot donuts and are absolutely incensed that the sugar has disappeared.",
            "I can just see the provincial court judge just trying not to laugh in her face.",
            "We talking mini donuts?",
            "I know Those Little Doughnuts so damned well and I love and cherish them and that woman is a monster who got what she deserved!",
            "You have a great management culture there... Hope you appreciate it!",
            "good one!",
            "I can just see a guy trowing donuts at this Lady, i fucking love it!",
            "You're sure this wasn't at the YYC Stampede? Lol",
            "I’ve had your donuts at the ex! The ones that float in the river of oil, coated in cinnamon sugar! I thank you for your service",
            "Yeeeeeeees! Awesome lol",
            "Should have let her pick the donuts directly from the oil.",
            "Eye CNE. Love the tiny toms doughnuts! Always get 3 bags when I go :)",
            "leaving a comment so I can save this for l8tr!! XD",
            "I know this takes place in Canada, but that Karen sounds awfully 'Merican...",
            "I'm confused as to the term 'lifer'. To me, that means someone who's in the pen for the rest of their life, so they wouldn't be out doing supervisory things...\n\n&#x200B;\n\nGood story though.",
            "I would have refused to serve her after she rejected the third bag of donuts.",
            "Man, this story leaves me craving a fresh donut.",
            "Sometimes you just have to hit Karens in the face with \"fresh\" donuts lol. God I wish I could've seen that.",
            "Ya Don't fuck w/ a carnie.  Stupid Karen.",
            "I wish we could all pelt doughnuts at people like her",
            "Sounds like some of what Gregg did/does rubbed off on you with this Karen and glad he had your back for it.",
            "We need more Greg's hahaha what a fucking legend",
            "Gregg sounds awesome.",
            "I thought the $100 bonus was the best punch line.  Even better than her getting punched with her dough(y)nuts.",
            "I wouldn't have believed this if it wasn't a carnival lol 100% epic...I used to work markets n know what the vans that sell food are like.  you're in a field and it's hot food...just fucking eat it",
            "Automatic upvote because you had to deal with a shitty edmontonian!",
            "[deleted]",
            "You don't condone his behavior and be scares you? Why? The example you listed of the scooter person sounded completely reasonable.",
            "Tiny toms doughnuts? Just wondering",
            "Did she also ask for a double entendre?",
            "Way too long,  suck my balls"
        ]
    },
    {
        "post_id": "g1leee",
        "author": "Tinawebmom",
        "title": "They fired me before I finished my day.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/g1leee/they_fired_me_before_i_finished_my_day/",
        "score": 15693,
        "num_comments": 720,
        "created_utc": 1586926887.0,
        "selftext": "I'm a nurse. I work in nursing homes (rehabs, old folks home etcetera). I do the paperwork that is sent to Medicare. That paperwork has to be submitted in a timely manner or the facility goes from $700/day to $200/day (just tossing numbers out. Don't remember the amount) This is important in a second.\n\nI worked for a facility that I loved. The people were wonderful. It was like a huge family. The staff ate their meals with patients, the independent people visited often, and our bosses were easy to approach. Then the bosses retired. At the same time.\n\nOur board then decided that maybe we would make more money if we hired a management company. All of these changes happened within weeks of each other.\n\nThey hired a traveling nurse to head up the skilled nursing unit for a year. We didn't react well to her. She never smiled, she would just look  at you if you asked a question, and she decided that new rules (that didn't apply to her) were needed.\n\nShortly after her hiring she began firing everybody. It was like a war zone had erupted on the floor! Nobody smiled, no laughter, no visitors, no family meals and loads of stress.\n\nI was the last one fired. Oh I had been written up (zero write ups when she walked in) for things like cell phone in the floor (my pocket), drink on my desk in my office (water) and filling a certification form late (doctor signed it the day it was due but they photocopied it before I had left for the doctor's office). So they had their three write ups.\n\nAt 1500 on Friday the administrator calls me into his office. I'm informed that I've been terminated. I'm floored. I work my ass off. I am actually great at my job! I've been there seven years. I'm escorted to my office to gather my stuff. They have turned off my computer, asked for my passwords and escorted me from the building. \n\nHere's where the malicious compliance comes in. \n\nThey called me in to fire me just as I was creating the packet to send to Medicare. I was never able to send it. They never asked if things were situated since it was Friday. I volunteered no information. \n\nRemember that timely manner? Well that Friday was the very last day to submit about 30 different forms. Most were 14 day assessments that literally covered 14 days! Billing (friend) called and let me know that the default cost over $100,000 by the time they figured everything out.\n\n\nEdit: the passwords they needed were system admin. I ran two different systems for the campus. They couldn't access either without the password. As for my other passwords? Hell no. Which includes the filing one which created a longer delay! \n\nTL:DR job fires me at the wrong time and costs them over $100,000.",
        "permalink": "/r/MaliciousCompliance/comments/g1leee/they_fired_me_before_i_finished_my_day/",
        "comments": [
            "Hilarious story about a board of directors who does not have a clue. They will lay blame on the management company. Business 101 don’t fix what ain’t broke.",
            ">  asked for my passwords \n\n\"I'm sorry, as per IT Security instructions, I'm not allowed to give out my passwords.\"",
            "I suspect it cost them much more than that.  Good nurses are invaluable.",
            "Satisfying conclusion. Glad they got fucked over",
            "IF A FORMER EMPLOYER ASKS FOR YOUR PASSWORDS DO NOT GIVE IT TO THEM! I can not stress this enough. They can log into your computer do a bunch of illegal stuff then blame it on you. They can say look what we found on their computer, or log into sensitive systems and delete information. Then say you did it on the way out to be spiteful. Your employer should have access to any system you do. If there is something they need to access they can do it under their user name and have it logged as them. Do not put yourself in a position to get screwed over by a vindictive spiteful person.\n\nEnd of rant.",
            "I imagine somehow they will be in touch with you. They have royally fucked up and generally speaking someone does a follow up contact with the employee who got screwed over.\n\nI wish you luck on your next adventure, and thanks for sharing this great story of management screwing themselves!",
            "I absolutely love the ending, except for the effect on your residents. I grew up around an old folk’s home (my family worked there and I spent a lot of time there), and I’ve personally seen what happens when management shifts for the worse and it’s so sad. My heart goes out to you for the home that you lost and that you no longer get to be a part of and contribute to.\n\nBut thumbs up to those idiots screwing themselves!",
            "Sounds like manglement wanted to eliminate your department, but didn't want to pay unemployment or severance.",
            "Never give your password. Ever.  It opens you up to someone using your ID when you aren’t there.\n\nIf they need access to your account, they can reset your password which will leave an audit trail. Plus, they should disable delete your account anyway. \n\nThen they can’t claim you did something after you left.",
            "You never surrender your passwords. If you do, they can wreak havoc on the system under your name and then say you did it. IT should revoke your access immediately upon termination, or even before, that's the correct procedure.",
            "So how did they do after all this happened? Did they have to close? I mean after fireing most of the staff and becpming such a hostile workplace somethings must have happened right?",
            "Surely this was unfair dismissal. You were fired for having a drink, not doing something you were in the process of doing and having your mobile on your person (who doesn't?).",
            "This makes me furious.\n\nI'm gathering there's no staff left and the place has gone to the ground?",
            "> They have turned off my computer, asked for my passwords\n\nWell they can go fuck themselves.\n\nDisclaimer: IANAL. But I am in IT and the above is my actual professional opinion.\n\nYou should never give out your passwords to anyone for any reason because it opens you up to identity theft and may make you liable for any fraud committed with whatever those passwords protect.\n\nIf anyone takes anything away from this, I hope it's these two things:\n\n- **Passwords are secret.** They are secret for a reason. They must never be shared with anyone who does not need to know them for any reason.\n- Nobody but you needs to know your passwords to things that have your identity attached to them. Ever.\n\nInstead what should have happened is that the company protect itself from the result of terminating their employees, and have proper offboarding procedures in place.\n\nIf they need access to any of your accounts, they are doing it wrong. They should have put themselves in a position where they can just freeze, reset, or discontinue any and all accounts you have access to. It's not your problem that they failed to do that.",
            "> hired a management company \n\nThis is secret code for \"plummeting customer service, absent leadership, abysmal working conditions, and no accountability\"\n\nSeriously.  Any company that moves away from in-house anything to outsourced versions deserves the horrible service they've signed up for.  It's *almost* comical to watch, except that it hurts so many people.",
            "You got fired for three minor infractions, like having a glass of water, after working there for seven years? What sort of dystopian society do you live in? Are there no employee protections?",
            "Glad they got fucked proper.",
            "This type of thing happens all the time.  When the board decides a \"management company\" can do the work less expensively or more efficiently, that board needs to be fired.  I was a manager for a Pulmonology office in the early 2000's and when I resigned they had to hire three people to replace me.  Not only did I manage the office and personnel I was also a certified coder and did the billing.  That same management company had 17 doctors' offices under their umbrella and two Fridays ago they laid off 320 people.  I feel bad for the people who were laid off but the management company never had their bests interest at heart.\n\nI'm happy to hear your group lost $100k.  Karma, baby!",
            "[What the traveling nurse might've looked like...](https://goofybeast.files.wordpress.com/2012/05/nurse-ratched.jpg)",
            "Wonder if they ever realized that they had the worst possible timing when firing you. That's an expensive lesson to learn.",
            "You should talk to a lawyer for wrongful termination or targeted harassment. 3 write-ups in a short amount of time after 7 years of none is very good evidence that they wanted you gone. I'm glad they cost themselves $100,000 but hope you didn't suffer from losing your job unexpectantly.",
            "Very similar thing happened to my mom. She wasnt fired but she did the majority of the medical coding for the home she worked at which gets sent in for funding. People constantly did things wrong it would take her too long to fix it on the back end. \n\nThe problem continued to grow and she told management she needed help (because retraining everyone did nothing) and they denied it. They also denied her overtime. They said she was exaggerating and to calm down. She moved to another job.\n\n The home nearly shut down. It cost them well over 500k in lost funding by the time they realized their idiocy.",
            "I think it was the right call. Management can easily abuse people who are caretakers because they know that caretakers will often feel an obligation to do right by thee people they take care of... working extra hours without pay, covering for someone who is just bad at their job ...\n\nCaretakers are put in an unfair situation and most will just get the job done because they are good people who care. It is heartbreaking.\n\nHowever if you fix the problems then there are no problems to be fixed. Management almost never will fix stuff because the staff is miserable or because they see an unfair situation.\n\nYou have to just leave it alone and let it fall apart. It sucks.",
            "I guarantee that the new nurses have less experience or are from countries that work for less( but are still highly qualified). Sounds like that manager was concerned about a bonus.",
            "Are/were you an MDS nurse? As a nursing home administrator (currently going through absolute hell) this is sweet to me. I’ve been in some of those types of companies. Good for you!",
            "That write-up about not being allowed access to water should be forwarded to your state and federal department of labor.\n\nAccess to drinkable water is virtually the only federal worker protection allowed federally, they WILL investigate allegations of breaking federal labor law.",
            "Which country allows this kind of behaviour by an employer? Some 3rd world hellhole? Just firing somebody for unrelated minor (and debatable) offenses after working there for more than 3 months, let alone 7 years?\n\nSorry, no civilized society with at least a touch of social conscience would stand for this. Therefore... I guess you are writing about experiences in the U.S.?",
            "Bravo.  I feel so bad for your residents after that change of ownership.",
            "Company - \"We need your password\"  \n\n\nYou - \"I don't work for you any more, i don't have a password\"",
            "When micromanaging and useless policies end up terminating the literal heart and soul of a workplace .... good riddance! \n\n\nWhy did the people who brought in the traveling nurse think she was a keeper? With all the terminations and culture change, it would be obvious she was the catalyst. If you all had great reviews, patients doing well, etc- why would they think anything she was doing was justified?",
            "Classic! I absolutely love this! I feel your pain. I've been a MDS coordinator before as well as ADON, Charge nurse, Medicare nurse, etc. I know how the system is and it sucks. I had all these jobs as an LPN. The administration knew my reputation for doing well and they would use me up for 6 months to get straight and then screw me over... \"you're just and LPN, you're now just a med nurse\"... Frustrating as hell. I should have become and Administrator and run the facilities myself! Don't give up because of the bureaucratic bullshit! Move on, reset your strength and remember why you became a nurse!",
            "I'm going to assume that the mis-management company that got you fired continued on until the state stepped in about patient neglect.",
            "CMS passwords specifically are not to be shared. That they would fire a MDS coordinator on a Friday is horrifying. I work in a similar facility that's very family. I've been there for 10 years. And the thought that they might sell us to some Corporation that will just start firing people, it's just unthinkable. I'd say the only people that know what MDS coordinators do are MDS coordinators.",
            "“ ask for my passwords” that’s 1234 capital f, Fuck You !",
            "I would be willing to bet that the care for the residents went down as well.",
            "This belongs on pro revenge, possible even nuclear revenge.",
            "This wasn't in California by any chance, was it?  Sounds like my dads nursing home.  Some outfit took charge last year and fired everyone, changed all the rules, the food stinks now, and everyone hates working there.",
            "Oh, God Bless the MDS!",
            "I hope you also filed for wrongful termination.",
            ">Billing (friend) called and let me know that the default cost over $100,000 by the time they figured everything out.\n\nNow i'm waiting for the update where they beg you to come back or something.",
            "this sounds awful. corporate nightmare. plz tell me that you've moved on to a nice job and that you are happy/happier now.",
            "Lol good luck getting my passwords. They're not entitled to that.",
            "Ha ha ha! Good job.",
            "Sounds shit but glad they got a good dose of karma. What a bunch of a-holes.",
            "Boss sounds like nurse Ratchet",
            "Omg, I love you. I'm a CNA, but would love to work with you.",
            "What a great story to share about ownership of these nursing homes.",
            "In Canada this would never happen, and if it did this place would be in a lot of trouble. Hope your doing okay hun, I know it is expensive if it is worth it look up a good lawyer, usually they wont charge for an initial consultation.",
            "Sorry you lost your job. Now she will bring in her horrible friends and within 12 months it will be shut. In the uk we have the CQC care quality commission. Who anyone can complain to about a hospital nursing home etc and they can close places down. If you can think of anything worth complaining about abuse to toxic work / care environment contact your equivalent",
            "Wait etcetera is a word? Wtf",
            "Great story but I feel bad for the people y'all had to take care of. They didn't deserve what will happen due to the negligence of management.",
            "As soon as you get fired forget your password. It's no longer your problem.",
            "Fuck yea. I just wanna watch the world burn sometimes",
            "If a single person was responsible for submitting forms that could cost over $100K, I can understand why they wanted to bring in new management.",
            "This is the result when our healthcare is commoditized rather than being focused on the patient as it should be.",
            "Not for nothing, but I trust my intuition.",
            "This must not be a recent story. Right now nursing homes are begging for workers.",
            "Now THIS is why I come here ! WOW!!",
            "When i read stories like this i think, \n\nWhy arent the people who work on the floor the ones making the important decisions?",
            "That sucks that they ran this facility into the ground. But  I'm confused, won't that lack of budget hurt the residents not the people in charge?",
            "This warms my little nursey heart.",
            "I work in this field doing VERY similar things. Cheers to you! ;)",
            "Holy moly lol.",
            "I hope you let them know what happened and why!",
            "Any idea how the residents fared from all this? I couldn't imagine they were treated as well as when you were there.",
            "OMG that is soooo good.",
            "BWAHAHAHA!",
            "[deleted]",
            "Okay, so like, my mother used to work as a traveling nurse going around to different facilities to temporarily take over as the DoN until someone else came in to do it, and even though I know that she’s great at her job, some part of me always gets worried when I hear stories like this that somehow, somewhere out there, is a person writing a reddit post about my mother actually being a shitty, dictatorial boss lol"
        ]
    },
    {
        "post_id": "mwqvw7",
        "author": "CaraAsha",
        "title": "Cancel your car insurance and screw up your life? Sure.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mwqvw7/cancel_your_car_insurance_and_screw_up_your_life/",
        "score": 15686,
        "num_comments": 967,
        "created_utc": 1619167516.0,
        "selftext": "Former car insurance agent, \n\nHad someone screaming at me that if we didn't do what he wanted,  then he wanted to cancel his policy.  What he wanted was illegal so it wasn't happening no matter who he bitched to.  After he was repeatedly denied he kept saying to cancel his policy.   I told him he should really get new insurance first as my state has mandatory insurance requirements on active registration; but he said to cancel it anyway, right NOW!! so I did.  Well a couple days later he calls back VERY pissed because he couldn't find new insurance and now his driver's license is suspended, he has a court appearance, and is suspended from his job.  He was caught driving without valid insurance so on top of the normal issues of no insurance on active registration, so he now has a very expensive ticket too. His job also required a valid license so he couldn't work until everything was resolved.  I warned him but he didn't listen; so sucks to be you dude.  \n\nI'm not commissioned, when I tell you something try listening; I'm just trying to help you and advise you about the law.",
        "permalink": "/r/MaliciousCompliance/comments/mwqvw7/cancel_your_car_insurance_and_screw_up_your_life/",
        "comments": [
            "[deleted]",
            "Wait, there are states where insurance isn't mandatory?",
            "In Texas if you are making payments on your car the lender is allowed to dictate the level and types of coverage, and that is usually a fully coverage requirement to protect them.  If you do not have the proper insurance then they can default your loan.  They also have print in the loan contract that allows them to purchase insurance on your behalf if you do not have it, and add the cost to your car note.  The insurance they purchase is usually about double what you'd pay if you got your own insurance.  Gotta protect their investment.",
            "Which state is that man? In NC, you can drive a car with expired tags, expired registration, expired license, no insurance, and hit someone and play dumb.. you get away without a ticket. \n\nWhile the other party (like me) will pay for the deductible and go through liability coverage to fix the car.\n\n\nEdit: to clear the confusion, I'm the party who paid out of pocket for liability claim. Fucking $500 down the drain because some dimwit kid wanted taco Bell and without looking back he reversed into my vehicle.\n\nhttps://youtu.be/z9JlTg_hWP8\n\nI have even contacted the head of the police (from where the cop on scene let go of the kid) and the chief said there is nothing wrong and the kid won't get a ticket.\n\n\nEdit2: when I moved to NJ and surrendered my NC plates (I actively - while in the line) I transferred my NC insurance to NJ. Still got a ticket for lapsing the insurance. I had to submit proofs that I moved to NJ with registration. \n\n\nI still wonder how that family got off the hook.\n\nEdit 3: \n\nhttps://mbworld.org/forums/e-class-w212/724745-dude-ran-into-my-car.html\n\n\nEdit4: TIL, Even though driving the car with expired mentioned above is illegal, since the accident happened *what can be called technically is* a parking lot, he got Scott free, but they didn't tow the vehicle back home. The dad drove it off, while the cop is still there. \n\n\nI didn't want to mention this before, but the mom greet the cop with a big smile when she got down from the car and they've known to each, because the cop greeted her with something similar to \"you're not coming to that church/sports place anymore?\" Or similar.",
            "I’ve had it both ways with car, equipment and crop insurance on my farm. First agency didn’t tell me about new farmer programs and had strange coverage levels for my equipment so I was paying $10k a year more than I had to. Switched agencies and now have an agent that will explain “hey, this policy will be bumped up X dollars, but here is your increased coverage level.” Or remove unnecessary endorsements to save money, etc \n\nBut holy shit did this guy have it coming to him lmao",
            "Jake? Khakis?",
            "What did he want you to do?",
            "In minnesota your license gets REVOKED. No simple reinstatement fee. You gotta take your \"written\" exam again.",
            "Yikes",
            "As a non-American, this may be a bit of a silly question but what exactly is the insurance you're required to have?\n\nIs it for a) death or injury to someone, b) damage to someone else's property or someone else's vehicle, c) damage to your own vehicle or some combination of the above?\n\nIs having insurance on a car universal across the USA or does it vary between states?  And is the insurance always on the vehicle or is it on the driver's licence too?",
            "When I got pulled over without insurance in AZ my plates were taken away by the cop and I had a $1k ticket for the insurance alone. I was 18 and thought I was slick by saving money on a car I couldn’t afford. License was suspended for 4 months after I got everything sorted out. Few years later in OR I was driving to work in my moms car and she hadn’t added me to her policy, I got caught speeding and my license was suspended again bc I didn’t have insurance. Had to carry an SR-22 for 3 years and I’ve worked hard to not make those mistakes again. Don’t be this guy, not having insurance will get you into a slew of trouble and cost more if you get caught than trying to save by not having a policy.",
            "What about when a car turns into you when you're more than half way through a stop sign intersection. Then as insurance is fighting it, you move to a different state. Try to transfer the insurance, but they cancel that policy and then create a new one. Thus canceling the fight for not at fault. And now I have that on my record.... Driving half my life, only accident I've been in. Smh.",
            "Heh. Once had a lady call who was very upset that she was paying for towing on her policy. Very angry, the works. Mind you, towing per month is seriously like $6. So, we took the towing off. I shit you not, the very next day she crashed her car and needed it towed. She was beyond pissed when she called in, and said she never asked for it to be removed. Luckily, we kept very good notes :)",
            "Current insurance adjuster,\n\nYears back I had to deal with someone who, angry over an increase in their auto insurance rates, told their broker that they were pulling all of their business and to cancel everything. A month or so later the supply line for their upstairs toilet burst and basically took out most of their main floor and their finished basement.  The “your policy was cancelled” conversation was not a good time for anyone considering we were looking at well over $150,000 in damage. \n\nDo not ever dick around with your insurance.",
            "When I lived in El Paso I bought my first car (%18.9 interest on a 5 year old cobalt), I had no clue about how to go about insurance. So, the dealer \"helped\" me find one, Fred Loya, it was almost $200 a month, this was back in 2009. But, me being dumb, I agreed to the insurance after he convinced me that when I turn 25, about 6 months from when i bought it, that the insurance will go down significantly. So, i went there the day after my birthday, all happy that i was going to save some money, and they told me that it was not stated in my contract that it would be decrease based off of me turning 25. I then said, I want to cancel my insurance and go with someone else, they then began speaking in Spanish (which I do not understand, and they would do this a lot if I asked them a question). They then decided, out of their generosity, to give me a $10 decrease, which is not significant at all. I decided to stay with them, because again I was dumb at this stage of my life, and when i deployed to Iraq for 1 year I was paying my regular price on the insurance, after telling my boss about this he told me there is such a thing called storage insurance, since my car was in a car holding area, where people would start it every day and make sure everything was ok while i was deployed, that the insurance place would only charge storage insurance fee, not the regulars price. This was after being there for 2 months that I figured this out, so i decided to contact the insurance place. They \"thanked\" me for my service and protecting our country, but unfortunately the only way to change the type of insurance i have, is to go there in person.......... I am sitting 1000's of miles away in the 120 heat, and they have the disrespect to tell me that they are thankful for my service, but can't do anything unless I go there in person. This resulted in me paying them almost 200 a month for a year of my car sitting in a parking garage. (if they did change it to storage insurance, it would have been 35 a month).\n\n&#x200B;\n\nThey are the worst, most deceitful business i have used while i was in the military. This place is like vultures when they see services members, they get a hard on screwing over the military. I have been living here in Colorado Springs, and they started to open up shops here and each time i see one, i just want to yell.",
            "Sounds like you were an insurance agent who knew what you were talking about and gave good advice.\n\nIn my experience, that is not always the case. Two stories of my experiences with incompetent insurance agents:\n\n1.) Decades ago, I moved from one US state to another. My old insurance would only cover me for the first 30 days in the new state.\n\nI got busy on the telephone, calling around to arrange new coverage. An \"Everystate\" agent in my new state offered coverage at a reasonable price. He said he was \"binding\" coverage over the telephone and would mail me the paperwork. He said I was covered from the moment I hung up the phone.\n\nI had never heard of binding coverage over the phone. I wanted proof in writing. So, I waited for the new policy to arrive in the mail before cancelling my old policy. When a week passed with no policy in the mail, I called the Everystate agent back. He lied through his teeth to me and claimed that he had never agreed to bind coverage for me at all. Turned out he had not done anything to even begin processing my new insurance. I didn't want to do business with a liar, so I took time off work to go in person to a different agent's office to arrange coverage with proof in writing, and only then cancelled my old insurance.\n\nBut what would have happened if I had believed and trusted the lying Everystate agent, and then had an accident?\n\n2.) More recently I bought a newer car and then sold my old car to \"John,\" a friend of our family. We filled out the paperwork so John could transfer the title to his name at the courthouse. *As is legal in our state*, we checked the box on the title transfer form telling the state that my old license plates remained on the car.\n\nThe next morning I called our current insurance company's call center to have the old car removed from our policy. The agent who answered my call got agitated when I told him the license plates had stayed with the car. He told me (incorrectly) that that was illegal in our state and that he was going to have to report me to the DMV for breaking the law. (I'm not making this up.)\n\nThe agent and I went round and round a few times over this. (He couldn't explain why the title transfer form had a box to check whether I was keeping the plates on the car or removing them. He couldn't explain why I had left plates on cars I had sold in this state in the past without any problem. He just kept saying I'd broken the law and he was going to report me.)\n\nI finally said that he could just go right ahead and report me to the state, but I wanted him to confirm that he was taking the old car off the policy first. Before he would do that, he said he needed to confirm some policy details with me.\n\nThe agent proceeded to accuse me of lying when I gave the estimated mileage I thought I'd be driving in the newer car. (I'm retired. I don't go many places in my less-nice car because if we're going to go on a trip we would take my wife's nicer car. We report higher estimated  mileage on her car and less estimated mileage on mine.)\n\nAt that point I had had enough. I hung up on the call center employee.\n\nLooking back, I wish I had called back and filed a complaint.\n\nInstead, I just called back and spoke with a different agent. When I explained what had happened in the previous call, the second agent agreed with me that leaving the license plates on the car when it is sold is completely legal in my state. She also took a look at my estimated mileage in the newer car and told me that she believed me when I explained how I'd come up with the number. \n\n&#x200B;\n\nThe whole point of telling those two stories was to say that I've found that I cannot always trust what an insurance agent tells me.",
            "Seeing some of the comments saying about tags, what are they?. I'm in UK and don't have them on our cars so just wondering, is it like an mot?",
            "I changed insurance companies and my dealership called me asking what's up, cuz my loan is with the car manufacturer. The dealership also wouldn't let me drive the car off the lot until I proved I had insurance. This is in Canada though. I was surprised the dealership went that far to ask why there was a change in insurance. Not that I really mind.",
            "I accidentally let my insurance lapse once. I was on automatic payments and they stopped being taken out. By the time I realized it a few months later my insurance had already dropped me and said they wouldn't insure me anymore I had to pay a $700 fee to my state because they have mandatory insurance requirement. It ended up working out in the long run though because I ended up saving $150 a month on less overpriced car insurance with better service.",
            "In Idaho your insurance is connected to your car registration. If it is cancelled or invalid, they know automatically.  You will receive a letter requesting proof of insurance. If you don’t provide it, your registration is also cancelled.",
            "Insurance companies are leaches on working peoples backs",
            "This could also be in leopardsatemyface\n\nPerson asks to have insurance cancelled, complains when insurance is cancelled.",
            "Please tell me that he was also ineligible for coverage with your company because of the lapse so you couldn't rewrite... I'm an insurance agent and I love those natural consequences when someone is nasty then tries to come back.",
            "Love it! I also work in auto insurance and our office started to get documentation of an email say \n\n“per your request today you want to cancel your policy. Is this correct?”\n\nThen love it when they come in bitching you go this is your email with written proof of saying yes. Love when people get pissed at you and you no it’s your fault.",
            "Sounds like Florida.\n\nThey do not fuck around with this.  A friend moved to Texas for school, kept his FL plates but got Texas insurance on his car since it was cheaper. Within two weeks he received notice in the mail that his registration and drivers license were suspended.",
            "Thanks for reminding me to update my address on my motorcycle insurance! Haha",
            "I wonder what the illegal request was.",
            "The sad part is clearly he didn't learn anything.",
            "I used to sell car rentals internationally. Credit Cards do not cover Italy and Ireland for CDW and LDW (collision and theft). Italy because cars get stolen a lot and both countries have fucked up roads with high rates of damage. I would clearly and painstakingly advise Americans that thier CC would likely not cover Ireland. They would argue. I'd advise that if they booked a basic rental upon pick up they would be required to pay triple the amount for insurance compared to what I would charge them up front. They would argue thinking I was trying to upsell them. I made no commission and would explain that. I wanted to avoid the continuous inevitable call from the rental desk where they would be screaming because the insurance was as much as the rental.  Long story short, prepay for insurance if you're renting in Italy or Ireland, trust me",
            "[deleted]",
            "Work for a credit union and I had to give some guy some really bad news one time, His wife cancelled the collateral portion of their insurance while the vehicle still had a lien. This goes against the contract they signed for the loan. Typically when this happens CPI  (consumer protection insurance) Is added to the loan. They totaled the car in the time between when the insurance was cancelled and before CPI was placed so they had to pay the loan back in full with getting nothing from the accident.",
            "I did 11 years at geico in NY and the last year as an independent agent. \n\nThe amount of times I get asked to commit fraud on a daily basis is astounding.",
            "I get it and all, but why wouldn’t you cancel my insurance after I sold my car?",
            "That's crazy that you would get both calls...",
            "All that in a couple days, eh?",
            "Even insurance professionals on commission will give you good advice.  I make a lot more money by having you be a happy customer for three, five, ten, twenty, even thirty years than I do by doing something that helps me in the short term but doesn't serve you in the long term.",
            "I had a caller insisting he did not cancel his policy. Pulled the calls. Told 2 different reps to cancel. Hmmm",
            "Man I feel your pain. Dealt with many A* holes in the insurance field.",
            "Good story! Just be careful using the words \"advising about the law\" to your customers, if you are not an attorney. By choosing slightly different terminology, you will protect yourself from potential a-holes (like the guy in the story) who could claim that you gave him poor legal advice, or depending on the state, any legal advice - which could potentially give him a route to pursue recourse against your company (even if you're 100% right).\n\nI am not a lawyer, but have had the questionable privilege to work for them.",
            "Pa is this way. I’m an Ohio driver. I have bare minimum on my daily and nothing on my other two cars. When I decide I want to fix those cars to drive I can just call put coverage on it.",
            "HaHaHa...I hope you denied his belated desperate request and hung up, then wrote a note for all employees to do the same if this jerk calls again.",
            "Plus if you have car loan, most financing companies will put force placed insurance on your car and it will be MUCH more expensive than if you just bought it yourself.",
            "*\"... a couple days later he calls back VERY pissed ...\"*\n\nWas he pissed at you, or at himself for putting himself in an incredibly financially vulnerable position?\n\nYes, this is a rhetorical question.  I already know the answer.",
            "Current insurance agent. I hate the way the general public thinks about insurance. They don’t take it seriously enough and think it’s some magic non existent tool in the sky until they need to make a claim or get consequences for not taking it seriously.",
            "Ah, I am an agent and these are the sweetest stories when it comes to the jerks we deal with. I would much rather help people and give them good advice but some people are hopeless.",
            "Sounds like a fine, upstanding member of the community... of rabid dickheads who refuse to listen to reason. I'm always astonished when I encounter one in the wild, and they've somehow built a (somewhat) normal life.",
            "After he called back asking to reinstate his policy...\n\n\"I'm terribly sorry sir.  Our company rules forbid us from underwriting new policies for customers who have been convicted of driving without insurance within the last year.  Our actuaries believe that it implies an unacceptable degree of reckless behavior on the part of the prospective customer.  Our competitors may not have such rules in place so we recommend that you check with them.\"",
            "Damnn what a bitch ass state",
            "So what's it like working directly for Satan?",
            "Fuck insurance companies",
            "Insurance is such bullshit",
            "Great story.\n\nWhat is it that he wanted you to do that was illegal?",
            "I did something similar, only it was more negligence on my part. I was pissed that they charged me when over a short period my car was off the road, and then I got a ticket overnight when they ran the plates and saw my registration was cancelled. I was fortunate to get a restricted license for I think 6 months, so I could still drive to work and function pretty normally. I tend to resent a system that seems so biased to a corporation (or whole industry) I suppose it's the price we pay to be free. Lol",
            "I'm in Missouri and right wt the Kansas State Line. I see pickup trucks without real license plates all the time. Then if I have my sticker get stolen I get pulled over the instant I drive anywhere. And I'm white.",
            "As a Canadian I always found our southern neighbour’s approach to vehicle ownership and operation puzzling. Between titling, lax insurance and registration requirements no wonder everyone has to sue one another to ensure your personal rights are maintained. In Canada when you buy a car you own it outright, you do not also need to get the title. The previous owner surrenders all rights to the vehicle, and while turning in plates is voluntary you have to cancel the registration.\n\nThe new owner has to show proof of ownership (Bill of Sale) and proof of active insurance (Pink Card) to be issued new or transfer existing plates and register the vehicle. Being caught without current registration is an immediate fine, being caught without insurance is a **big** fine and a license suspension. Registrations must be renewed annually. \n\nIs it a pain in the ass? Yes. Is it a big expense? Yes. But it is also a process that ensures every vehicle on the road is insured so that accidents are largely appropriately covered, of course there are exceptions, but you don’t need to sue the guy that hit you in the Wendy’s drive-thru to get your car fixed because he chose not be a responsible vehicle operator.\n\nCan someone explain to me the rationale behind the lax US standards for vehicular ownership and operation?",
            "My state doesnt require car insurance. I drive that bitch *raw*. My Corolla was only $1000, go ahead and hit me with your BMW.",
            "The condescending tone you have makes me hate you as much as the guy birching at you. Like we're all just supposed to blindly trust every insurance agent?",
            "Why is this being posted again?",
            "Question: Why is insurance mandatory?",
            "I mean it costs like 10 bucks to get your license unsuspended not that big of a deal lol",
            "Health insurance agent and benefits counselor here. Noncommissioned too.   Yep.  Listen to us when we are explaining your benefits as a new hire or during open enrollment.  We are looking out for your well being.",
            "When I lived In MI not only was car insurance required but it was no fault.",
            "[removed]",
            "But being required to have health insurance is the oppressive hand of \"BiG gOveRnMeNT\". 🙄"
        ]
    },
    {
        "post_id": "ocvka7",
        "author": "I_Hate_Usernames_Too",
        "title": "Apartment complex rented my apartment while I still had an active lease.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ocvka7/apartment_complex_rented_my_apartment_while_i/",
        "score": 15684,
        "num_comments": 416,
        "created_utc": 1625308308.0,
        "selftext": "Arkansas has well known laws that lean heavily on the side of the property owner which leaves the renter pretty vulnerable to owners who want to be difficult to say the least. Or at least they did when I lived there, I doubt much has changed since.\n\nSo I move into town and find a 2/2 apartment, intending for it to be a short period of time while I scout the town and look for a more permanent place. As for paying rent, they wouldn’t/couldn’t take an automatic monthly check from my bank or charge my debit card monthly, it had to be a paper check from me, with a 4 day late fee window. I hate writing checks and I had the cash so I paid out the 12 month lease all at once. \n\nI find a great place about 6 months later, thinking I’ll just break my lease and pay the extra one month penalty and walk away from my apartment. I call and let them know I’ll be moving out, long conversation short, the way the lease is written makes you think that’s how it works when in reality, at a second or third read, I’m still liable for the entire 12 month lease, and to break the lease essentially adds a 13th month worth of rent money. Knowing that upfront, why anybody would break a lease is beyond me. \n\nSo at this point I’ve already made the deposits on my new place when all this comes to light so I’m stuck with two places. I tell the apartment complex I won’t be moving out, figure I’ll just go ahead and let the lease run out, set the AC to 80, and open the breakers to keep costs low. I slowly move my stuff to my new place since I have plenty of time now and in the end I leave behind my ironing board and iron just to leave something and I never really use them anyways.\n\nAbout 2 months later I get a call from the power company asking if it’s okay to transfer power into somebody else’s name. Shocked, I reply, “Absolutely not”, while laughing a little on the inside. I decide to give it a day before I call the apartment complex. First thing the next morning I get a call from the apartment complex and with a super snarky entitled tone I hear “We need you to drop the power from your name so the new tenant can take over and move in.” I explain that I still have an active lease on the place and can’t fathom why they’d rent it out. She accuses me of abandonment and therefore she is allowed to rent the apartment. My reply went along the lines of, “I rent that apartment with the sole intent of having somewhere to iron my clothes. Did you not see my iron and ironing board there?” She said she did and she took it to the office to get it out of the apartment.\n\nWe go back and forth on the semantics for a little. I let her know that I’m open to receiving a refund to the date on the new tenants lease and at that time I’d be happy to drop my name from the power. She refused and the call ended with getting her boss’s number from corporate. After mentioning to her boss that I can recognize a breach of contract when I see it, and that nowhere in the lease does it say I actually have to live there, not to mention her employee admitted to entering my apartment and stealing items of mine from inside. She quickly assured me they are putting a check in the mail that day refunding my money to the first of that month and told me I could go to the office to pick up my iron and board anytime. \n\nYes I know they could have run up the power bill but they’d only be able to do so much really and a few days isn’t that huge, and they didn’t do it anyways. Even if they had it would still be worth the expense considering the refund.",
        "permalink": "/r/MaliciousCompliance/comments/ocvka7/apartment_complex_rented_my_apartment_while_i/",
        "comments": [
            "A place to iron my clothes- that one is brilliant!! I actually chuckled imagining her thought process upon hearing that sentence!",
            "That all sounds super illegal on the part of the apartment complex.",
            "Was this a Lindsey property?  This sounds like lots of stories I’ve heard about them.",
            "That sounds like they were trying to get double lease payments on one apartment. Very illegal",
            "Sounds like my experience to a T with Lindsey Management in Arkansas. All apartments here tend to share the same behavior though. This is one of the few stories where the tenant actually gets a win lol. I so hope you went back for the ironing board just to annoy the lady from the office.",
            "Sounds like you lived at a Lindsey Management property.",
            "My dad told me to never ever prepay rent bc people can pull shit once they have your money, I guess this is why",
            "I used to work at an apartment complex and if something like this happened, we would offer to sublet the apartment. We would have leasers move home for the remainder of the summer and essentially clean out the apartment. But we would never just move in a new person while the original lease is active lol, that's illegal in my state. We would arrange for original leasehold to relinquish the lease and sublet to the new person (with permission!), it was a win win for the person moved out and the person moving in because original owner no longer had to pay for the apt once it was taken over. \n\nIt was always more difficult to claim they had abandoned, so for them to do that leads me.to believe they wanted to double dip.",
            "Even with states that favor the landlord, double dipping is still illegal, and that's what this would have been. They absolutely would have been on the hook if you reported that they were renting out the apartment you had a signed lease for. \n\nIt would have also triggered a major audit for them.",
            "Ahh Arkansas. Where Tenants and Employees have 0 rights and can be fucked over at any time for any reason.",
            "I'm sure a lot of people have a crappy landlord story, so I'll contribute mine.  \n\nMy lease had an early termination option of 60 days notice + 1 month rent.  So basically, I wanted to move out immediately and knew I'd be on the hook for 3 months rent.  Both I and the current property manager (PM) were OK with this, so I went ahead and gave written notice and agreed to pay the full amount in installments.\n\n1 month before \"move out\" date, I showed up to the office to pay (part 2 of 3) on the empty apartment and chatted with the PM.  She told me a new owner had bought the complex and laid off everyone but her, and she figured she was next.  \n\nSure enough, on move-out day next month, I show up for the move-out inspection and to pay the final $650 termination fee.  But, nobody is in the office.  It's closed and locked with a new company logo and phone number taped to the door.\n\nI tried to call the apartment complex phone first, and it just rang and went to a full mailbox with the old PM's voicemail message still on it.  They hadn't even bothered to change it or forward the old phone number to the new company.  I called the new number and it's a 3rd party property management company.  They had no idea who I was or that I was due to move out that day.  What pissed me off was that they refused to send anyone out and refused to re-schedule a move-out inspection (which I knew is illegal in my state) and told me to just drop the keys in the box. They said nothing about the early termination fee, so I didn't feel the need to mention it and just dropped the keys in as instructed.\n\nSince the new PM company was already being shady and disorganized on my very first interaction with them, I had a few hunches.  First, they probably didn't know I owed them more money (ETF fee) than they owed me (security deposit).  Second, they probably were going to dick me out of my deposit.  And third, they probably weren't going to follow the state's security deposit laws.  In my state, if a landlord doesn't refund your deposit they have 30 days to notify you in writing of why they kept it.  If they don't do this, they legally owe you 3x the deposit.\n\nIt's now been 2 months, and my hunches paid off.  They haven't returned my security deposit and haven't provided me anything in writing.  If they had just followed the law in the first place and did the walk-through inspection with me, I probably would have handed them the $650 check I had already prepared along with the keys.  And they probably never would have refunded my $300 security deposit either.  But since they didn't provide me anything in writing, they now legally owe me $900 while I only owe them $650.  By not following the rental laws, they actually saved me from paying that ETF fee.\n\nSorry for the super long comment.\n\nTL;DR: New owner fires their staff, hires a shitty property management company to replace them, and misses out on up to $950 from me because of it.  And since they broke the law, they actually owe me money now.",
            "Anyone remember the early web trend of “extreme ironing”? Renting an apartment just for ironing fits in well.",
            "My old apartment complex tried something similar. I bought a house but still had two months left on the lease. They didnt want to release it so I paid the last two months and moved out almost everything. Knowing the manager would try some bullshit, I checked on the place a few times and didnt plan to clean it completely until the end of the last month. One day I went to check and found the maintenance guy was working on prepping the place for new tenants. I moved all his stuff out and let them know we weren't done there. They had changed the key to enter the building but not the apartment so I got the new key fob from the maintenance guy and told him we would clean it at the end of the lease. \n\nThe bitch manager knew she was wrong and tried to let the maintenance guy take all the blame telling him I moved out even though I still had stuff there. He was apologetic even though it wasn't his fault. She really thought I would let them get the place ready while I still paid for it.",
            "I had a landlord try and keep my deposit and pay the last 2 months of my lease. \n\n This was after a hurricane Ike tore off part of the roof and destroyed pretty much everything I owned at the time. \n\nHe was going to fix it back up but did want to loose out on the 2 month rent during repairs and tried to claim my dog  destroyed the wood floors - not the 6 inches of rain that sat in there for a week.",
            "Wow, they actually did you a favor by being shitty apartment managers.   So glad they ironed that out in the end.",
            "Read the contract once more carefully. Your landlord might owe you now one month rent for breaking the lease.\n\nThe clause in its form is probably meant for tenants who break their lease and refuse to pay for the remaining month. This gives the landlord a way to recoup legal cost if he has to go after them.",
            "The same thing sorta happened to me in Los Angeles!  I was living with my then-boyfriend at the time at an apartment that we signed a year lease for. Four or so months into our lease, we broke up. I moved out within 1-2 weeks and he did the same. We told our landlord that we were going to break our lease and were going to have to pay an enormous fee for doing so. We had until the end of the month to vacate and pay the fee. A week before the end of the month, I go back to the apartment to clean up a bit with the cleaning supplies I left there and the entire apartment was empty. I called the apartment complex and they said they noticed we had moving trucks there earlier so assumed we had left the items in the apartment as trash and they wanted us to charge us another fee for leaving the apartment dirty. We had left a vacuum, a bunch of cleaning supplies, and a grill on the balcony that still needed to be picked up. All gone and never to be recovered. So they had gone into my apartment without notice, stolen our stuff, and never gave it back. Long story short, the fee for breaking the lease was waived and we got a month’s rent back. Along with fair-compensation for the items lost.",
            "If actually living in a property were so important, then single people who travel for work a lot would find themselves in difficult circumstances. \n\n\nWhat if you needed an apartment because you travel regularly between USA and Europe for instance, and don’t want a hotel?\n\n\nThat wouldn’t be abandonment right?\n\n\nHere they paid for a year, so they get a year. The landlord was highly out of order.\n\n\nThere were no complaints from other tenants, no illegal activity, no damage... so the landlord should not have even turned the key and opened the door, let alone removed belongings and re-let the apartment.\n\n\nOP should have gone to court. Nice lump sum on a House deposit coming their way had they done so I think.",
            "Kind of funny you mentioned the iron and ironing board as being yours, since every apartment I have rented (4 of them in the same city in Ontario) have come with an ironing board and iron for some reason like it's a motel. Im starting to think someone has mandated they be provided to tenants or something dumb.",
            "I'm not sure how long ago this happened and if it's worthwhile to you, but you could take a few minutes to read over the landlord-tenant statues in Arkansas.  I once had a landlord try to keep my full security deposit because they were upset that I invoked a clause in my lease to terminate halfway through the lease when I opted to take a job out of state. \n\n I advised them under the laws of that state it's not legal to collect rent from two tenants for the same rental at the same time.  I'd vacated before the end of the month but had paid through the end of the month.  They moved tenants in there a day after I moved out and charged them a prorated rent for the remainder of that month.  They'd double collected rent for that last week and a half of the month.",
            "I’m trying to figure out why you didn’t try to sublet it. We had to bail once on a 1 year lease after 3 months as we were going onto build but ended up buying. It was easy. I told the property manager the situation, advertised and found a renter myself, got them the contracts from the property manager, collected the first and last for them, and off we went. It happens all the time. Some places just don’t want to tell you I guess. They don’t really care as long as they’re getting rent every month, as you could see by your situation.",
            "It wasn't a Lindsay Management complex was it? Easily the worst landlord I had. \"Live on a golf course, live in luxury!\" My fat arse.",
            "Was this apt complex on Pleasant Ridge?",
            "Just a friendly reminder: always get anything important in writing. It will save your ass just as it did with my Keller Williams rental nightmare which saved me about 16 grand.\n\nIf they insist on calling you, insist on a damn email.",
            "In most states, it’s illegal to collect double rent.  Well done. I’m a former apartment manager very long ago by the way but I always kept the rules and tried to help people out whenever I could.  It just goes to being a decent human being and doing what’s right. I never understood the ‘rip people off’ form of management. It just isn’t right",
            "I knew a guy who rented an apartment close to work to have a place to poop. He was real wierd, but I admired his ability to shit in peace.",
            "Somebody has \"fuck you\" money",
            "Out where I live, if the landlord intends to enter property they are required to give the tenant 24 hours notice.",
            "If you think residential leases are bad, try a commercial one. Basically all 150 pages of legalese boils down to \"we're not responsible for anything and you're responsible for the rest. I ran my own business for 20 yrs, man I could write a book. \n\nLandlord wanted me to replace a condemned furnace that'd been there for 30 yrs. Nope, capital expenditure, I'm only responsible for maintenance and replacement of parts, not replacement of said furnace. I got \"you're splitting hairs\" , my reply, \" yup, and that's what lawyers are for\". He bought the furnace.\n\nThe best one was when I moved out. I wanted to move in March and told him I'd still fulfill my lease and pay til June 30. He said no, you have to stay til your lease is up because of a clause that states I have to run my business in a 1st class manor for the duration of my lease, but if I was paid in full they'd let me leave June 15. Hmm, don't like that, but hey, it doesn't say I can't run 2 locations. He came back after a weekend in March and my store had all the equipment and 80% of the stock and fixtures moved and installed in new location. He went bat shit crazy, started sending all kinds of threatening letters. Corporate stepped in after 2 weeks and numerous letters from my lawyer (I don't think he realized I was cc'ing his boss) and told him to back the f off, I was a lawsuit waiting to happen.\n\nWhenever I've won its by using their own lease or laws against them.",
            "Laws haven't changed at all.  \n\nAs for the company...Lindsey?",
            "That board and appliance really helped to IRON OUT the issues you were having!",
            "Interesting. I myself am fighting a legal battle over an Emotional Support Animal with my Arkansan landlord. Arkansas renters rights suck, and landlords are cocky.",
            "This almost happened to me, but instead of new tenants the land lord just stole our ac unit and washer (both of which we had to buy ourselves and we're not included with the unit)",
            "I'm a long term property management professional. It is illegal in all US states, I believe, to charge double rent. The lease most likely said you were responsible for rent until the end of your lease or until a new person moves in, plus an early termination fee equal to one months' rent. If that was the case, then that kind of early termination structure is pretty common.\n\nBut even if that was the case, they should not have assumed possession back if your rent was paid and you still had keys and electric in your name.",
            "At my last place the previous tenant rented it for 10 years and never moved in. She just kept the place to use as an address because she was afraid her ex husband would find her and murder her.",
            "They are paying you out to avoid getting legal issues from their attempt to double-dip.",
            "Fuck pirate Kansas",
            "Apartment complex? I find it quite simple",
            "I was glad how this turned out, but confused by the first paragraph. How did property-owner-friendly laws come into play?",
            "I've heard Arkansas has some pretty anti gay laws too",
            "> it had to be a paper check from me\n\nWTF?  This is 2021, not 1980!",
            "So glad you won this fight!!\n\nApartment and house rental leases can be horrible. I wish we could all stop signing them so that they would change them to be more fair to the renter.\n\nI hate leasing for an entire year. I should be able to give a 30-day or 60-day notice at any time and then leave without owing any additional rent. How am I supposed to know whether or not I can commit to an entire year of living somewhere. In a year's time so much can change in my life!\n\nI am also sick of landlords who want to enter my apartment or house once a month, once a quarter, or at all while I am paying rent. It is such an invasion of privacy.",
            "From working in the apartment industry for several years, they probably knew exactly what they were doing. The correct way would be for maintenance to do a vacancy check then send notices/call to see what was going on. An iron and an ironing board would be enough to stop me as a maintenance person from telling the office it was empty.",
            "> Arkansas has well known laws that lean heavily on the side of the property owner which leaves the renter pretty vulnerable to owners who want to be difficult to say the least.\n\nThat's being polite...Arkansas is the only jurisdiction in the US that doesn't legally require a warranty of habitability for residential apartments. Your landlord could literally tear down a side of the building and you'd still be liable for the lease period. \n\nArkansas is a shithole for many reasons, but jfc their landlord/tenant laws are third world.",
            "Almost skipped cause i thought it was on legaladvice. Saw that it was MC and went \"oooh this oughta be good.\"",
            ">  “I rent that apartment with the sole intent of having somewhere to iron my clothes. Did you not see my iron and ironing board there?” She said she did and she took it to the office to get it out of the apartment.\n\nYou should have gone to the police so they whould be charged with breaking-and-entering & theft...",
            "Damn -- you could have told them you were recreating the 1960 movie \"The Apartment\", where a low-level employee rises through the ranks at his company by letting his bosses use his place for \"extramarital affairs\".\n\nhttps://en.wikipedia.org/wiki/The_Apartment",
            "[deleted]",
            "How were you able to afford renting two places? I can barely afford one place",
            "Side note, Arkansas is the only states that makes it a criminal offense if you don't pay your rent and remain in the apartment. It is called Failure to Vacate.",
            "Can second this. Arkansas renter laws are draconian.",
            "lease companies have gotten so used to shitting on the little guys, they do it without thinking these days.\n\nyou shoulda SUED them for a lot because FUKEM.",
            "[deleted]",
            "Wow. Even in Arkansas you have the right to sole possession of the property you're renting, even if there aren't much of any other protections. What was that manager thinking.",
            "Super shitty that they didn’t even contact you.  \n\nThat said I believe there is usually language in the standard rental lease, at least here in FL, requiring tenants to actually occupy the place.",
            "When I started reading, I thought it was going to end with you walking in and sitting on the new tenant's furniture, to make the point of it still being your apartment.",
            "[deleted]",
            "WELL PLAYED SIR.  I will not be playing strategy video games against you.",
            "You absolutely 100% should have gotten the police involved and pressed for WAY more of a refund than simply first of the month. They want a scuzzy contract? They can deal with a motherfucker of a tenant",
            "Don’t live in a hillbilly state. Solves lots of problems.",
            "I’m going to get downvoted for this OP pit himself in a legal grey area as abandonment is a legally recognized defense to reclaiming possession of a unit from a renter. That being said…it would have been super illegal to collect rent from both renters at the same time.",
            ">the way the lease is written makes you think that’s how it works when in reality, at a second or third read, I’m still liable for the entire 12 month lease, and to break the lease essentially adds a 13th month worth of rent money. Knowing that upfront, why anybody would break a lease is beyond me.\n\nNAL AFIK all states require the landlord to mitigate your loss, so if you break a lease and leave within two months in, after communicating it with required notice, it’s up to the landlord to repair whatever needs repairing and find another renter.  If the other renter can move in say for example on what would have been month 4th of your lease, then you’re out 5 months of rent and whatever other fees and whatever was itemized on your security deposit.  Not the 13 months.\n\nAbandonment is a valid reason to terminate a lease typically.  Whether or not you paid for the whole term.\n\nIt actually sounds like your misunderstanding of the above made this more challenging to get your money back.",
            "Oooh, I love this,  well done for not letting them have their cake and eat it too.",
            "Hi start a tenants union 👊",
            "This is my favorite post on the whole subreddit.  Bravo OP, well played",
            "you have no idea what i and bitcoin can do to your powerbill\n\n&#x200B;\n\noh btw do you rent out your apartment when you go on vacation? i promise i wont even sleep there xDD",
            "[removed]",
            "L",
            "I get if they can’t fill your apartment, but if they have a renter available, why hold you hostage",
            "Why not just get a lease takeover?",
            "> Knowing that upfront, why anybody would break a lease is beyond me.\n\n>So at this point I’ve already made the deposits on my new place when all this comes to light so I’m stuck with two places.\n\nThis is your fault for not fully understanding the terms of the lease prior to entering into the agreement. “When all this (SHOULD HAVE) came to light” was the day you signed your lease, but instead you just signed a legal agreement without reading or understanding the terms. How much you want to bet the last paragraph of your lease reads: I have fully read and understand the terms of this agreement.",
            "As a renter in the past and a landlord now, what I have to say is, read the damn contract. If you need help understanding it ask for help. Then abide by the agreement and expect the property manager to do the same. Study up on your rights and responsibilities. Unless you have a disability, there's no reason not to look out for your self.",
            "They're still trying to break 20k lol",
            "Well played.",
            "If they made income on your rental they should have paid you the rent they collected.\n\nI find it very bad this encourages the landlord to do more of these tricks.",
            "Get a lawyer that specializes in housing and rent disputes. Show him the lease, my guess is that there are clauses in it that are illegal and you have good grounds to sue for at least the value of the lease in damages. The renter will probably settle and you will get more money than trying to maliciously comply.",
            "Call the police and report the stolen ironing board",
            "Lol",
            "there is only one state in the USA that does not require landlords to make sure a home is liveable, and I think its Arkansas",
            "What nerve! Once had a new tenant break into my house and use my phone while I was still paying rent on the place!\nIt was the owners nephew, I could have had him arrested, but was so shocked!",
            "Yup, that sounds like Arkansas",
            "Lucky you didnt sit in there, and blow them away the moment they entered your domicile.",
            "Even if you had \"abandoned\" it, since your lease is still active, wouldn't it still be yours until the lease expired?  Sounds like some shady bullshit to me.",
            "Noice"
        ]
    },
    {
        "post_id": "n7saiz",
        "author": "smiffynotts",
        "title": "You've not ordered the offer anymore, so there's nothing we can do!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/n7saiz/youve_not_ordered_the_offer_anymore_so_theres/",
        "score": 15666,
        "num_comments": 559,
        "created_utc": 1620489757.0,
        "selftext": "Before the pandemic, my significant other & I were doing some shopping and decided to eat at a Harvester (a large chain here in the UK). It's 'reasonable' food at the cheaper end of the scale, and ok when you're not looking for a posh dining experience or anything.\n\nThere was a daytime 'soft drink, salad bar buffet, main course & dessert' offer on which came to £30 for two people. A bargain, which we ordered.\n\nThe food turned out to be pretty good; we made more than one trip to the buffet and suffice to say by the time we'd finished our main courses we didn't feel we needed the dessert, so I instead asked the server for the bill.\n\nThe bill arrives and we have been charged an additional £9 for £39 in total. I query this with the server;\n\n\n**Server:** \"that offers only valid with desserts, and you said you didn't want desserts anymore\".\n\n\n**Me:** \"We intended to have the desserts but we're too full for them now so we don't want them, but I didn't expect we would be charged more?\"\n\n\n**Server:** \"Well you've not ordered the offer anymore so there's nothing we can do\".\n\n\n*(Que the malicious compliance you can see coming by now);*\n\n\n**Me:** \"Well then I'd like to order two desserts please. You can bring them over, we won't eat them, and you can get the £9 knocked off the bill for us?\"\n\n\nAt this point the server looks at me with a bewildered look and says she'll get the manager. My other half who is more of a shrinking violet in these situations is looking a little uncomfortable. A few moments later the manager comes over and asks why we don't want to pay! I explain that I do, but I don't expect to pay *more* for saving waste but by all means to bring over the desserts and we will leave them there on the table when we leave. Comprehending this she agrees to just charge us for the meal deal.\n\n*Edit*\nJesus Christ Reddit, I get it!; \"You would have requested the desserts to be boxed up and taken them home for later\". The only dessert with the meal deal was ice cream. And regardless, we wouldnt have wanted to carry boxed up food around with us for the rest of the day.",
        "permalink": "/r/MaliciousCompliance/comments/n7saiz/youve_not_ordered_the_offer_anymore_so_theres/",
        "comments": [
            "At least the manager understood what was going on!",
            "*Threatened* malicious compliance is so satisfying when it works!",
            "That's the dumbest thing I've ever heard. Probably works on people who don't complain, but then they don't go back.",
            "A little while after my second was born, I took my eldest then 3 years old to the Harrison Hot Springs Resort in British Columbia for the weekend to give her a small break from the new baby.\n\nWhen I booked the one night stay, there was a deal on a Bed & Breakfast rate (room plus breakfast for 2).\n\nAt check in, I was given 2 meal vouchers.\n\nSkip ahead to checkout...\n\nI like many, didn't read the bill as I paid because I had pre paid for the stay and did not have any additional charges.\n\nAs I was loading up the car, I glanced at the receipt and saw that there was an additional charge for a child's breakfast.\n\nI went back to the reception and inquired about the charge as I had paid for the meals in the package.\n\nThey said the charge was for a child's meal and that I had prepaid for 2 adult meals.\n\nI asked for a refund of the 1 adult meal, to which they refused as it was a package.\n\nI explained that my child was 3 and only ate 1 pancake and fruit and it was absurd to charge her for a adult meal and a child meal. \n\nI asked to speak with the customer service manager, they wouldn't budge,. I then asked to speak with the F&B manager, they wouldn't budge.\n\nI asked for my meal voucher back as I didn't actually use it.\n\nI noticed that there was no date on it, so I turned to the guest behind me waiting to check in and asked if they had pre purchased breakfast. They hadn't so I handed them the voucher. I then turned back to the reception manager and proceeded to cancel the two other weekends I had booked.",
            "Pay Double.\nThis reminds me of a really nice Chinese buffet. They encouraged you to try new things, but only take a small amount if you're not sure. If you fill your plate up with something new and don't like it, you get charged Double for wasting food!",
            "Why couldn't you take the desserts home?",
            "Burger King would have deals on cheeseburgers, making them cheaper than hamburgers. So my friend, who didn’t like cheese, would order cheeseburgers…with no cheese. \n\nThat always took some explaining. “So…you want a hamburger.” “No, I want a cheeseburger with no cheese.”",
            "Reminds me of the time we had the opposite happen.  We were in Reno and settled on an all-you-can-eat deal at a Sushi Bar.  It wasn't a buffet, they gave you a list and you just checked off anything you wanted.  We selected a bunch of items.  The server says \"We'll start with half of the list.\"  We were stuffed before we finished the first \"half\", so we told them not to bother with the rest.  The guy was ringing up the bill and said \"You guys didn't eat very much, I'm just going to charge you for the items.\" and we saved $20-30 bucks from what I was expecting to pay.",
            "Alternate petty ending:  They bring desserts and you send them back to be remade for picky reasons and then don't touch them.",
            "This sounds like when I used to work on a bar (my University’s Students Union). We had a deal of double spirit (of a selected range and reasonably good stuff, Gordon’s Gin, Whyte & McKay whiskey, etc.) and mixer for £2.50.\n\nWe had some students who wanted either a double Scotch without mixer or the cheapest spirits for shots. We were told we couldn’t sell them without the mixer so I queried what counted as a mixer. They said any fruit juice, tonic water, tap mixer and cheaper. Well, water is free so that counted and ice is, primarily water. So the guy who wanted whiskey got a single ice cube and the guys wanting shots got a cola/lemonade chaser.\n\nIf that hadn’t been done, their £2.50 drinks would have been £5.",
            "At a drive through, I said, \"Hold the biscuits, please,\" and they tried to charge me $6-$7? more.  At the window, I said, \"Okay. I'll take the biscuits, will you please charge me for the meal deal?\"  When we were done with the money/food exchange, I handed her the biscuits back, and asked her to toss or feed to the little critters out back.  She was equally confused.\n\nSame reason - I didn't want the waste.  (Their \"biscuits\" are nothing like a \"biscuit\" as I understand them. We'll make our own, thanks anyway.)",
            "[deleted]",
            "Something similar happened to me with a food delivery app.\n\nI ordered just about enough to qualify for a certain discount and paid for it through the app. Later on it notified me that the restaurant was out of a dish so they took it out of my order, and the app asked me to pay MORE for less food because I didn't qualify for that discount anymore (but still qualify for different ones, it just didn't let me choose again).\n\nThe customer support rep refused to budge even after I talked and explained it to them, so I just went Karen for a moment and refused the (already made) food altogether. I know the rep can add/remove coupons/discounts. The least they could do was to add the \"free delivery\" coupon which my order was well qualified for. Kinda sucked for the delivery guy and the restaurant though. :(",
            "I suppose maybe it’s a point of sale issue. Like you need to plug in the right items to get the deal added on and off you don’t have them this would be the waiter effectively lying (I worked at one place that took any divergence from the order as fraud). Manager was probably the right call",
            "Should have taken the dessert and left it by the salad bar.",
            "I had it the other way around once, where a server was totally baffled that I didn’t want the deal of 3 things for €5,00, but bought 2 things for €4,50.\n\nI had to explain multiple times that I also thought it was a better deal to buy 3, but I wasn’t hungry enough for 3, so buying something I wasn’t going to eat would be a waste of €0,50.",
            "At McDonald's once I got a soda and they said \"that's 2.50\".  I said but the sign says $1 any size drink.  Their response \"oh, you have to tell me that you want the $1 drink\".  fokkin' tosser.",
            "OP didn’t want dessert? 😮How about getting it in a to-go container OR just eating it using their  pudding stomach?",
            "Ahh... Harvester experience.. screeching kids in the background, dirty toilets, salad bar that looks like a town after carpet bombing.. and cheap food.",
            "If you don't eat your meat, you can't have any pudding!  \nHow can you have any pudding, if you don't eat your meat?",
            "I woulda taken the dessert boxed for a snack later, if allowed of course.",
            "I work with a guy that would do exactly the same as the waiter. He is certainly somewhere on the spectrum and takes everything very very literally. I normally get told to listen in on him just in case things like this happen.",
            "Unreal that places can be that silly and stick to the letter of a policy when the policy isn’t meant to make a situation a farse.  Glad you stood up for yourself.  I too hate needless waste.",
            "Somehow I read it as \"soft drink, salad bar buffet, **mini golf** & dessert\" and was real confused for a couple seconds",
            "Reminds me of the experience I had at subway. They had an offer on the footlong Italian BMT for 8 Aus dollars. While they prepare mine I requested to not add ham as I am not a fan of its texture. She seemed ok but while billing she said that would be 11 dollars. When I asked why I am not getting the deal price she was like ‘oh your sub is a pizza melt and that’s the price for the melt’. After a little back and forth she finally agreed for the deal price but with a warning not to do it again. I was like whatever and off I went with my sub.",
            "¿\"Que\"?",
            "My first job at McDonald's in the late 90s they had 29 cent hamburgers on Tuesdays and 39 cent cheeseburgers on Wednesdays.  I was working the register and my supervisor was on the other one.  \n\nIt was cheeseburger day, and a customer wanted like 10 cheeseburgers, without cheese.  My supervisor refused to give them the discounted price....  I thought it was the dumbest shit ever so I told the customer to come to my register and made it happen.\n\nSupervisor was at least smart enough to not berate me in the lobby, but she called up the owner and we had to have a conversation.  Even though the owner was a complete tool, he did agree with me that we can take ingredients out for the discount price.  But even though I was right, I was told to never question a supervisors decision again.",
            "I bloody hope they still have the chocolate orange slice on their dessert menu. Screw the salad bar of stale food, get the chocolate orange slice. It's probably the best thing they've ever had on their menu. Still trying to find a recipe to make it myself.",
            "I had the pleasure of working with a waitress once upon a time who would have ordered the desserts,  given them the offer price. Then she would have gone off to hide whilst gobbling up those 'spare' desserts. \n\nShe was also stealing tips which was what eventually did for her. \n\n\"Steal\" from the boss all you want but touch our tips at your peril.",
            "I've seen SO MANY SERVERS around me go to the manager and say \"tHiS tAbLe WoNt PaY\" but I heard the whole table/server interaction. Usually as the manager walks by to talk to the table, ill saying passing \"they never said they didn't want to pay, they're probably gonna complain about how rude the server is...\"",
            "As soon as I read “I took my significant other to Harvester” I had to check this wasn’t AITA",
            "You ever watch the total increment up on the drive-thru screen at McDonald's? As you order items separately, the computer combines them into \"Extra Value Meal\" items which often cost more than the items separately. See: when coffee is on sale any size for $1. You order a Sausage McMuffin ($1.99) Hash Brown ($1.99) and Large Coffee ($1) and the machine combines it into an EVM for $5.00 BUT ADDS 60 CENT UPCHARGE for the large coffee. When you bring this up with the cashier, you generally get a glazed-over look; they don't know what you're talking about and don't care, they get paid minimum wage to push buttons on a terminal.",
            "I've worked at a couple restaurants, and some deals are just *like* that based on how it gets rung-up on the register. I would do my best to explain it to people \"It's cheaper overall if you add on this item\" but very few of them took it seriously and thought I was just trying to up-sell. \n\n The server should've just informed you that it would be cheaper to get the deserts. It's really not a big deal.",
            "Honestly this is a symptom of people not paying attention to their pricing.\n\nDeals like this should be cheaper than all parts of the deal individually ordered, but more expensive than the whole meal minus one part of it. So like, if the salad buffet costs $5, the main course $10, the drink $3, and the dessert $3, that's $21 each, for $42 for two people. Your meal deal should cost no less than $36, which is the cost of the two meals minus the cheapest component (the drinks or the dessert, which are the same price). \n\nThese kind of problems are caused by people making deals without considering the math behind them.",
            "Why not just get the desserts in take out containers? Seems like an easy solution plus you sti get the dessert when youre not as full",
            "This chain oncd locked my group in the restaurant and wouldn't let us out until we coughed up £10 we didn't owe them. We all paid, had receipts saying we paid and I'm sure I saw one of the girls slip a £10 note into her tip thing she was wearing or maybe it was a pot on the side. I really can't remember the specifics, it was over ten years ago... They wouldn't let us leave. We were there about 45 minutes extra. I just sat quietly and watched the chaos, receipt in hand. They had to let us out eventually but when I mentioned one of the girls putting £10 into the tip thing, things were sorted very quickly. This was after the manager came out to deal with us. I was keeping it quiet just in case she hid the note.",
            "That was the employee doing.\nAnyone with a minimum of experience knows that anything saved from a set meal can be \"re-sold\" to another customer.\nThis way you help the business meet the monthly criteria set by the brand owner.\n\nAnother example is, When you serve a pint of lager shandy, you charge it as a regular pint. Same price but different result in the system when it comes to stock counting.\nFor the system it result as a full pint lager sold, in reality you sold just half pint of lager and the other half can be sold again.",
            "Orders a flavored (Syrup added to reg ice tea at bar) ice tea with free refills, didn't like the favor so asked the waitress to skip it on the refill and she charged me for a second iced tea.....",
            "I’m glad to see that you got your...\n\n(removes sunglasses)\n\n... just desserts.",
            "Well yeah makes sense. Then again I work retail. Our meal deal is a sandwich, crisps and drink. I've had multiple customers leave behind their crisps or drink because they didn't want it, and it's cheaper to buy all three than just a sandwich and drink/crisps. It just looks good on the sales end I guess",
            "Malicious compliance would have been insisting on the desserts at that point",
            "You could have just taken the desserts home for later in a to-go box.",
            "OK, good information. When in UK, if you must eat at Harvester then eat to the letter of the dining deal, or get spanked. Harvester==Spank.",
            "Sounds like a UK Golden Corral.",
            "That's great, but weren't there any desserts you could have walked out with like a brownie?",
            "Reminded me of Costco Churros which come with chocolate or caramel sauce. \n\nWe don’t use either. \n\nI always say I don’t want them. \n\nKeep them for another customer. \n\nEven put in a suggestion so that when you order at the kiosk to have option of no sauce—still need to select one. \n\nTold person last trip to keep it otherwise I am merely a holding point from the food court and the bin three foot away from the counter.",
            "At that point I would have demanded the dessert be brought out so I could lick it and they could throw it away. Treating customers like that is how you make them not your customer anymore.",
            "I would have taken it to go",
            "This is the kind of \"store policy\" bullshit that makes my blood boil. Order the dessert and leave your silverware gooshed in it. No tip for you!",
            "I had almost the same thing happen to me at a local restaurant. 3 course menu - starter, main, dessert - for €30. We requested to get coffee INSTEAD of the dessert. They were happy to do so but didn’t tell us they would now change the bill and charge a separate starter, main and coffee which would total at €37. They would NOT get into a discussion about it when we noticed it on the bill. It was just ridiculous, they didn’t have to prepare a dessert, only thing they had to do was brew the coffee and it cost us €7 more. We went back a few weeks later with a plan. We ordered the 3 course menu again. Coming to the dessert we chose what we thought would be the most work to prepare. When they served the desserts we asked for coffee to go along with the dessert. We enjoyed the coffee, let the dessert melt to crap and requested the bill. Sure enough it’s €30 menu + €4 coffee. We only saved €3 each but the look on the managers face when he figured it out as we walked out was priceless. We were satisfied knowing they had been preparing desserts for absolutely nothing.",
            "When did harvester do buffet? Have I missed out on something here?",
            "We ~~have~~ had a local Harvester. Do not order steak",
            "Doesn’t surprise me the staff in Harvesters usually get pressured into this sort of crap.",
            "American here ...\n\nWhy couldn't you order the dessert, and take it with you to eat later.",
            "Worked for Harvester for years, there’s not been one day since leaving that I miss it.",
            "I greatly admire you sir or madam. *Cue applause*",
            "Why not order the dessert to go?",
            "You pay for the years, not the mama.",
            "Why not just get the desserts to take home?",
            "Harvester hasn’t been the same since they took kidney beans out of the salad bar. Also, they changed the chips a couple of years ago. Devastated me, I loved their old chips.",
            "You could’ve asked for the deserts to go.",
            "I actually think ordering the desserts and leaving them on the table, especially ice cream, was an ingenious display of just what they were doing...wasting food. For the sake of starving people in Lithuania or whatever, I’m glad they knocked the bill down, but this is yet another example of employees getting sooo obsessed with rules when they don’t make sense.",
            "thanks for not being mean to the server. a lot of people don’t understand that servers and customer service assistants are just doing their job, following orders. \n\nit’s so embarrassing when a manager insists on following the rules and then comes over and all of that flies right out the window. \n\nremember the managers call the shots when it comes to over riding prices and offers/deals, not the server or assistant. don’t be afraid to ask for a manager, just don’t waste their time for something like a 50p difference, etc. \n\notherwise, they are happy to help because they have that authority.",
            "In the United States I would very much pull a dinner was great, can we get our desserts to go? Is that an option at this place?",
            "Ugh this reminds me of when I went to Taco Bell and my husband ordered one of the current specials without sour cream, and they tried to charge us two times as much because the resulting item wasn't a 'special' item, it was a 'custom' item!",
            "I witnessed the very opposite of this. I saw someone willfully refuse an offer in the co-op and pay more money not to have the extra item\n\nI think they had like 2 frozen pizzas and the deal was 2 frozen pizzas and 4 cans of beer for like £5. It was an absolute bargain because the pizzas were like £3 on their own.\n\nThe guy was like. If you take the beer its £1 cheaper and they refused. He was like just take the beer im sure someone behind you in the queue would take it off your hands and they still refused.",
            "Do the server get extra money for that?, Because if they don't i can't understand.",
            "*cue",
            "At a restaurant, I ordered from the menu and my friend took buffet. I tasted two spoons of his ice cream, and when it was time to pay they forced me to pay for my meal PLUS buffet, \"because I ate my friends ice cream and therefore ate buffet too\". Like, come on...",
            "I thought the whole point of an offer was to get stuff for cheaper *but only if the whole offer is fulfilled* \\- for a supermarket meal deal you don't automatically get the offer if you only buy the sandwich and drink but not the snack etc... if I were you I would've taken the desserts home for later",
            "Because it's the only option available?",
            "This sounds like a switch & bait tactic by the company.",
            "Reminds me of when I went to a Cracker Barrel once when I was really little. They wouldn't give me a kids bacon cheeseburger but they would give me a kids cheeseburger with bacon",
            "Demonetized channels are where the real proof is LMAO",
            "you could've just gotten them to go in the first place",
            "One of my past orders at Mermaid coffee was a Venti (which has 4 shots). I ordered a Grande (next size down with 3 shots in the base drink) add a shot, and it was 15 cents more. Less of all the other ingredients in the drink, same amount of espresso, higher price.",
            "Ahh nothing like *just* dessert.",
            "My favourite Malicious compliance with these deals is \"What's your favourite item in category X?\"\n\nAnd then just leave it there, don't touch it and say to them, that's for you. If it's in a restaurant setting, I guess I'd just tell the manager to \"give my free dessert to a staff member\". It's prompted more than one smile on the past.\n\nThe one time someone was shirty about it was in a train station, and I just have the chocolate bar he was kicking up a fuss about to the homeless guy outside.",
            "I would have asked for the desert as a doggie bag and had it later :P",
            "This is a bit like my car insurance. I've recently bought a new car, and my old insurer can't offer a sensible policy for my new car because it is unusual.\n\nSo I've got to a specialist insurer for my new car, but my current insurers want more in ammendment fees to cancel my policy than I would get back for ending it early - so it would actually cost *me* money for them to be taken off the risk.\n\nSo, as I am giving my old car to someone who is already insured for it on my policy, I am keeping ownership of it until the absolute end of the policy, and they can remain responsible for any losses.",
            "Thanks for that, you just resuscitated one of my nightmare meals. \n\nIt was at a Harvester. \n\nIt was fish and chips. \n\nIt arrived at my table with watery cauliflower and boiled carrots on the plate. Who in their right mind servers fish and chips with the leftover veg from a Sunday dinner on the plate? Peas yes, but carrots and cauliflower???",
            "Consider yourself lucky.   I booked a week at an extended stay hotel at the weekly rate, then checked out after only 5 days.   My balance charged was more than the weekly rate.  So of course I ask \"well then can you just add two more days on to my stay\",  they say they will get back to me, and after the message goes through several people at the hotel I get a message asking if I would like to add a reservation for 2 days at normal rates.   After a couple of rounds of calling and finding nobody who can help, I end up just giving up and eating the extra charges.   Now that I'm posting this months later it occurs to me that I should have contacted my credit card company; they charged me more than we agreed in writing.",
            "Life is short - eat dessert first.",
            "There is something just so *British* about the server proactively changing your bill.",
            "Regarding your edit: most buffet places don’t let you have Togo boxes",
            "Server tries to maliciously comply, instead they get their just desserts.",
            "When McDonald's had a Dollar Menu, cheeseburgers were one of the items that were on it.  One day I felt like a hamburger, so I ordered that but was charged regular menu price.  I asked why I was being charged more when a cheeseburger was just a dollar.  They said if I wanted a hamburger at the dollar menu price I had to order a cheeseburger without cheese.\n\nI don't know why they make us play those silly games, but, okay-fine...",
            "Does the UK not have the concept of \"to-go\". I'm not a big eater, and I'm always full well before dessert. Whenever I eat out they offer me a dessert to go. They just pack it up for us to take with us and eat at home. I always have leftovers at restaurants, but when I was in France that was clearly not a practice that they were accustomed to. Honestly, eating out seems like such a waste if I have to throw away half of the meal afterward.",
            "Why not just get them to takeaway?",
            "I love how the server is so dumb all he can do is just go to the manager and say \"They don't want to pay.\" Seems like he didn't include any details whatsoever and he easily could've handled the situation without a manager.",
            "And, people wonder why they are stuck in a shitty job.",
            "Could have asked for them to go",
            "Why not take the desserts to go?",
            "Googled it because it sounds like golden corral over here. More like a western sizzlin, ponderosa, applebees kinda vibe",
            "We would've just taken the desserts to go.",
            "This sounds like more of r/maliciouscompliance by the server if you ask me.",
            "Harvester is g r o s s but I can’t lie, the deal makes sense to me.",
            "*cue the malicious compliance\n\nNot que \n\nQue isn’t a word\n\nNot que, not queue, CUE\n\nIt’s not difficult",
            "Just had to ask, and yes it is your language (English is from UK), and no I'm not being mean. Sincere question.\n\nIs it actually que or cue? Que is short for queue?",
            "Huh. I decided to look at their menu, and it seems that your food isn’t that different across the pond. \n\nChicken wings, potato skins, chicken tenders, calamari ... \n\nchicken bacon and waffle... ribs?! Jim beam glazed beef brisket?! Southern fried chicken breasts?!\n\nWait - is this restaurant supposed to be American styled or something?",
            "Having been a server and dealt with stuff like this, it pains me to try to make sense why the server went down that road. Especially in an environment where tipping occurs. Why would you make it harder on the customer, all but guaranteeing a low tip?\n\nTHIS IS NOT A TIPPING VS NON-TIPPING THREAD. IF YOU DONT HAVE TIPPING IN YOUR COUNTRYSIDE THEN KEEP YOUR \"WE DONT TIP OVER IN ______ COUNTRY\" TO YOURSELF\"",
            "What a weird and bazaar pricing model",
            "Are you an American living in the UK perchance? Or is your American just really good?! If the former, how does lower end restaurant food compare with the US?",
            "Its 20 usd for a buffet in usa with dessert included for 2 people. That wasn't a bargain lmao",
            "So I’m guessing this is your way of begging for the United Stares to come and settle your conflict. Again. Oh U.K. When are you going to learn to stop picking fights you can never win.",
            "I mean sure but the food is wasted as I'm pretty they aren't allowed to re-serve the desserts to someone else. Even if it wasn't touched. Coulda just gotten the desserts to go and kept for a later time or given away to a friend or what have you.",
            "> Edit Jesus Christ Reddit, I get it!; \"You would have requested the desserts to be boxed up and take them home for later\". The only dessert with the meal deal was ice cream. And regardless of that, not all of us want to carry boxed food up around us for the rest of the day.\n\nYeah, it was not clear that (a) you were not proceeding directly home after this, and (b) you did not have an automobile.\n\nAlso, conventionally speaking, they wouldn't box up ice cream, but put it in a plastic tub.",
            "It’s harvester.  If you’re going to eat there then pay via their app. And leave.  Don’t make the overworked under payed staff do more than they have to.",
            "You might not have saved them waste, as youbordered thefull meal the desserts might have already been accounted for. Strqnge but true...\n\nThat being said... why not just take the dessert home for a snack the day after?",
            "Why didn't you just get non melty desserts and take them home? This seems heavily malicious and lacking in compliance.",
            "You’re being a karen, the offer was only valid for desserts and you obviously didn’t order any dessert, so why should you get the discount? It’s so weird to see this post being upvoted like what\n\nSure good malicious compliance but karen style, don’t like seeing that at all",
            "Box the desserts and take them home?",
            "Could you have taken the desserts home for later? That's what I would have done.",
            "What a ridiculous situation.",
            "You can't take the dessert to go? I know you can't take salad because it is buffet style, but its silly not to take dessert.",
            "I am confused. Why didn't you get a To Go box for your desserts?",
            "Something like this happened to me once. It's completely baffling. Maybe it's intentional and they hope no one will notice the extra charge.\n\nHow can the server say it with a straight face though? I guess if it's your job, you gotta do it.",
            "Couldn't you have just taken the 2 desserts home with you? That way you get what you paid for, stuck to their rules and you didn't have to overeat to do it.",
            "Bring them home!",
            "Yeah, having worked in hospitality, I wouldn’t be a Karen, but that server was just simple. \n\nSure, try it on, but as soon as the customer realised they’re getting a shoddy deal, apologise and fix it up.",
            "manager had your back, take the win!",
            "Harvester not been to one I'm in North Wales lol so not many here",
            "I think there's plenty of on this sub?",
            "I once went for a £5 Indian buffet in London. Worst decision of my life.",
            "This is why I don’t go to harvester or toby carvery.. plus I worked taking the kitchen orders for places like that and saw all the ‘fresh’ food and mainly microwave meals going out  and put me off for life",
            "Ha haaa, you just reminded me of the diner scene in the Jack Nicholson movie 'Five Easy Pieces.' Thanks!",
            "Why not take the dessert with you in either case?",
            "Love the story but having been to a harvester once I have to object the food is not reasonable it’s super low quality beige.",
            "I would just take the desserts to go.",
            "I would have requested the desserts to be boxed up and take them home for later.",
            "The wife and myself eat out alot. Being childless we can. The one thing we seem to do about every third time out is forget the leftovers in the car. Quarantine has really helped out with that.",
            "Honestly that's how deals work. You have to do the thing they actually are to be redeemed for."
        ]
    },
    {
        "post_id": "mmhml9",
        "author": "CHAINSMOKERMAGIC",
        "title": "Customer thought we were moving her stuff too slow and wearing her tone, so we hurried up.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/mmhml9/customer_thought_we_were_moving_her_stuff_too/",
        "score": 15633,
        "num_comments": 389,
        "created_utc": 1617847665.0,
        "selftext": "Edit: Title should read.\"Wasting her time\" not \"wearing her tone\". Sorry. Super tired from work when I wrote this and I missed the autocorrect.\n\nSo I work as a mover for a very small moving company. My boss, let's call him Mike, is a really nice guy. It's really just a two-man operation, with me working as a subcontractor under him with a few regular guys we call in for bigger moves.\n It's really physically demanding work sometimes, but typically our customers are super nice and the pay is pretty good. Most people are just happy to have someone else to lift their heavy stuff and get it into a truck. And we're always super careful to not cause ANY DAMAGE to the buildings we're moving in and out of or the items we're moving, which most people appreciate. \n\nNot this lady. Let's call her Darcy.\n\nSo Darcy booked a move with Mike, and told him she had a small storage unit she wanted us to load up into a 20 foot truck. We said \"no problem!\". As the date of her move approached, though, so did a huge snow storm. \n\nDays before her move the news started reporting that the weather was expected to take a severe turn for the worst. Not uncommon for the time of year in our state, but also something not to be trifled with. \n\nWe called Darcy a couple days before the move to see about rescheduling to avoid the storm and she said she absolutely HAD to move that day, no other days would work. A lot of (probably much smarter) movers would have cancelled, but after talking, Mike and I thought it was no big deal. We move in the snow all the time. Just meant we would have to dress appropriately and be extra careful not to injure ourselves or damage any property. \n\nCut to the day of the move. We get to Darcy's storage unit, expecting a 10x10x15 standard storage unit full of your usual stuff based on what she'd indicated on the phone, and load it into a 20 foot truck. That's a pretty easy job to get done in the 2 hours that she'd already prepaid for.\n\nAs we pulled up the snow was already coming down pretty heavily, and the first thing that made us nervous was the truck. Instead of a 20 foot truck, there was a HUGE 26 foot truck. Darcy greeted us by the truck and showed us the storage unit.\n\n*Darcy*: Okay! So, this is our unit. We shut down our businesses and I'm moving it out of town to pursue other opportunities, and I need all of this loaded up in 2 hours. The last movers I had got it unloaded in about that long. \n\nMike said something about the truck being bigger than she told us. \n\n*Darcy*: Yeah, it's the biggest one Uhaul had. Last time we used a another company and it was much bigger. I'm worried about getting it all, but you guys will have to figure it out. I *need* all of it.\n\nThis was a **HUGE** storage unit. Like the kind you'd store a few cars or some farm equipment in. When we opened it up it was filled with what appeared to be the contents of a couple of pretty decently sized businesses. A dozen of those huge floor-to ceiling filling cabinets, several desks, office chairs, some really huge glass tables. And all of it was *incredibly heavy*.\n\nNow, our company safety guidelines for weight limits are 100lbs per person lifting an item, but there's no real practical way to enforce that in the field, so we usually wind up using our best judgement, even if the item is over that limit. Nearly everything there was over limit, but we had our equipment and we were pretty confident we could handle everything, weight-wise. Mike and I are both pretty strong. But in my estimation, this was definitely going to take a bit longer than 2 hours.\n\nMike told her that we would do our absolute best. To be fair, he should have leveled with her then and there that it would take a bit more time, but he probably wanted to see if we could just get it busted out as quick as possible and see where we were at before getting the customer needlessly worried. \n\nDarcy sat in her truck nearly the whole time we were working, so she could stay warm. Perfectly understandable since it was -2°F outside and the snow was coming down pretty hard. Though she'd occasionally roll down her window to offer up critiques. Mostly about how much time we were taking going up and down the metal ramp of the truck, which was now COVERED in ice and snow.\n\nAbout an hour and some change into the move, Darcy gets out of her truck and starts chatting with Mike about her previous movers, and how they did cause some damage to her stuff, but they were SO fast. It was weird. She went back and forth between complaining about them and praising them for their speed. And she kept referring to them as \"the *professional* moving service I hired\", which really bugged me, because the way she said it seemed to be implying that because we aren't a big national company like Mayflower, then somehow Mike and I weren't professional movers. Despite the fact that this is literally our full-time jobs.\n\nNow we're far enough into this move that we could tell this was going to run long. Mike decides it's a good idea to let her know that it's probably going to take a half hour or so longer than expected (which was still a feat, considering how much there was to move and how well-packed this truck was. I pride myself on playing a mean game of Truck Tetris). \n\nDarcy was NOT having this. She started to get upset and started saying how we were just trying to get more money out of her, and we were \"Dilly Dallying\" (yes, those words actually left the mouth of a grown woman). Then she starts in on how \"the *professional* movers got this same stuff unloaded in 2 hours, it should take the same time to load it!\"\n\nMike explains to her that unloading always takes less time than loading, because you're moving it into a bigger space and you don't have to pack and pad the stuff to fit into a truck. \n\nI also mention that there's literally a blizzard coming down, and we're only going to go a little over. \n\nShe gets quiet and seething. Mike can tell how angry she is and let's her know we won't charge her for any extra time since it's not her fault the weather is crappy. He also brings up that they damaged her stuff, and we've done a pretty good job.\n\n*Darcy*:I don't CARE! YOU SAID TWO HOURS, I EXPECT IT DONE! JUST GET IT DONE! I'm going to leave you guys a TERRIBLE review!\n\nShe stomps back to her truck without saying a word.\n\nI'm usually pretty chill, but I was already getting increasingly mad at this woman. Her yelling at my boss and calling us lazy when we were risking our health and safety to move her stuff in a blizzard was just too much for me. \n\nMike thinks about this for a moment. I know customer reviews are super important to us as a small business. The booking site we use highlights the last handful of reviews, so a bad one takes FOREVER to stop showing up as basically the first thing people see when they click on your page. So I'm expecting Mike to try and keep her happy, but instead he just grins and turns to me\n\n*Mike*: Fuck it. You heard her!\n\nCue malicious compliance.\n\nShe wanted it all loaded in 2 hours? That's exactly what we'd do.\n\nThe front half of her truck was loaded up neatly, with everything padded and stacked tightly floor-to ceiling to keep it from moving on the road. I pride myself on my ability to load a truck properly and safely without wasting any space. The second half of her truck was the worst, jankiest truck I've ever loaded in my life. We're talking huge heavy office furniture haphazardly stacked on top of each other at the weirdest angles. Heavy stuff on top of light stuff, anything to just get the storage unit empty and the truck door closed. We even stacked REALLY heavy office chairs on top of glass table tops.By the end of it, the truck looked like you'd asked Escher or Giger to draw you a picture of an office.\n\nI just wanna be clear, we've never intentionally damaged a customer's property, and we never would. We pride ourselves on our professionalism, courtesy, and specifically our ability to get your stuff where it's going safely. But the particular combination of unsafe conditions and this lady's outright disregard for our safety and feelings was just too much. And technically we didn't damage anything. Nothing was broken when we closed the truck doors. But literally the first bump in the road or decently tight turn was definitely going to cause hundreds, maybe even thousands of dollars in damage. \n\n We closed the truck door and walked over to Darcy's truck and let her know. \n\nMike went to her truck. He told her that we were done and that he wasn't going to charge her at all for the move. She insisted that \"She's not poor, and doesn't need charity\" and Mike just said that it was clear that she wasn't happy, and that he didn't need her $150 (that's right, we charge $75/hr, so the extra half hour we needed to do it right would have cost her a whopping $37). \n\nHe cancelled the job and refunded her what she'd already prepaid. \n\nAs we drove away in Mike's car, I looked at him. \n\n*Me*: You realize that by the time she gets where she's going, she's looking at a LOT of damaged furniture, right? She's going to hit us with a bad review and maybe even try to sue.\n\n*Mike*: She was worried about paying an extra $37. I doubt she'll risk more money on hiring a lawyer. And besides, you can't leave a review on the site if the job gets cancelled. We just gave her exactly what she wanted. And besides, it's worth losing out on the money I would have made just to see her face when I said I didn't need her $150. \n\nWhen he dropped me off he still paid me for my time because \"Fuck that lady\". My boss, Mike, is a really nice guy.",
        "permalink": "/r/MaliciousCompliance/comments/mmhml9/customer_thought_we_were_moving_her_stuff_too/",
        "comments": [
            "I like how he was smart enough to refund the money to avoid getting a bad review",
            "Oh, how I would have *loved* to have seen her face at the end of the move, when that truck door opens, and she sees whatever goods were damaged in transit.",
            "[fuck u spez] -- mass edited with redact.dev",
            "Your owner knows how to play the game..... Seems like no matter how clear you try to make things to some people, it goes in one ear and out the other and then they get pissed at you in the end. I hope her shit got trashed good on the ride. My days of helping people move are over cause I’m not lifting that shit anymore....",
            "Please don't leave us hanging! Please tell us she at least called you guys later screaming!",
            "Now I need an after truck packing picture. But I'm sure that'd dox you pretty hard. \n\nBut man I want to see the truck after it was driven. Something tells me she had issues driving it.",
            " Dilly Dallying is perfectly acceptable for adults to say when someone is lolligagging.",
            "I think I know why she wasn't using 'that other company'...",
            "I wish movers charged me only that much! Every time I've moved I've ended up paying over 300 for 2 hours. And this lady had the balls to complain when you guys were still risking your safety with the bad weather? She deserves whatever happened to her furniture. Hopefully her new beginning included a new attitude after that.",
            "You can have it fast, have it good, have it cheap. Pick any two.  If you want it fast and cheap, it won't be good.",
            "I have a friend who worked as a \"helper\" , not sure the official term, but basically when a moving truck driver arrives to unload he would get a call and show up to help unload if it was a full truck. Well this one time the guy who usually went with him couldn't be reached so he asked me if I wanted to come along and get paid since I had crashed at his house the night before. When he told me how much they usually get paid for the days work I was like hell yeah, that will be club money for tonight. It was honestly the most labor intensive work I have done in my life...and I'm career military so that says something. I was seriously exhausted at the end of the job. I definitely had a new level of respect for movers after that.\n\nAnd of course, being military I move every couple of years. The military of course contracts the movers, you just have to be home when they come. A lot of people complain about damaged goods when they unpacking, but I have always been one to go pick up some fast food for the movers, or offer to let them have a couple bottles of the liquor they aren't allowed to pack when they are done....and I have never had to file a claim for damage... I imagine it's like any other service job, treat people with dignity and respect and they take a hell of a lot better care of you.",
            "*this* is one of my favorite MC stories. Would have loved to see her face.",
            "The most surprising part of the story is that the boss is only charging $75 per hour for two guys. No travel time, no fees, how is he making a reasonable profit?",
            "I will never understand people who tell others how to do their jobs. Especially when you have *hired someone to do a job*. It's rediculous. \n\nAlso, on a different note. Tomorrow, for the first time in my life, I will be having movers help me with my apartment move. I was raised in a house that taught me you tip people who you have help you (like contractors or builders etc.) and I would like to tip the movers, but I don't know what would be appropriate. Or if it even *is* appropriate. \n\nBesides my plan on buying a few bottles of water, do you have any suggestions as to what an appropriate tip would be for a 3 man moving team for a 1 bedroom apartment?",
            "Could have just canceled the job and walked away entirely after refunding it. Let her sort out how to put the rest of the stuff in that truck without any help.. unlikely she could of gotten another business to help out in such short notice and weather..",
            "Please don’t risk your health for money, OP",
            "Haha, She definitely \"wore her tone\", but you out-vibed her, showing what a classy man knows bout dignity and pride :D",
            "Wow i used to do removals, and my boss was not like yours! LMAO\n\nAnd those customers seem to be every other in this countryy omg I always wondered where it said \"donkeys for hire\" with the attitude we got off some people.\n\nTaking care of the shit your moving, AND the property your moving in/out is exactly what theyre paying for, and they think they just want a man with a van!",
            "As a former driver for Two Men and a Truck, I know exactly the kind of customer you are referring to and I have done a very similar thing. Sometimes you just gotta do what you gotta do to get out of a shitty situation. We always had the customer sign a release of liability if we were loading another truck than ours, so if they wanted us to rush, we would ask if they wanted us to skip using padding or even skip using shrink wrap and start hustling it in. Occasionally this left us with hefty tips.",
            "Wish y'all could've seen the aftermath of it all!",
            "Normally, malicious compliance is just mildly funny things that make a fun, quick read. \n\nThis was thoroughly satisfying. Bravo to your boss, man.",
            "Speaking as someone who has moved many times, I am always in awe at the truck Tetris skills of movers.",
            "Great MC post, finally",
            "I really wanna hear an update about how pissed that lady was lmfao.",
            "Is Darcy the new Karen?",
            "Holy hell, $75 BUCKS AN HOUR?!? Now I’m mad at what I spent on my last move...\n\nBrilliant move by Mike though. Good on him.",
            "Mike is the best and a very smart man!\n the fact of refunding her the money protected you against a lawsuit since there would be no valid consideration to prove there was a contract in court, this was considered gratuitous agreement and it is not binding!\n\nThat lady sucked big time but this a perfect malicious compliance",
            "“I play a mean game of Truck Tetris” is what tells me this guy is the real deal.",
            "> \"wearing her tone\"\n\nNow I'm imagining a group of big burly removals men opening up this lady's makeup box and liberally applying her favourite foundation to themselves.\n\nUnderstandably she'd be upset by this!",
            "I ... I think I may have feelings for Mike",
            "Shit, you guys should have looked at the unit before you priced the work.",
            "Glad you guys weren’t hurt, moving heavy stuff in a snow storm sounds horrible",
            "Yeah telling movers to hurry up just seems like a stupid ass thing to do. They're already thinking about how to do it efficiently and carefully at the same time so as not to damage anything. SO now you have damaged furniture and probably damaged doorframes and walls and yeah no.",
            "I totally understand why this woman had two businesses fail on her watch.",
            "just as an aside, and this is incredibly petty, Geiger is the machine that measures radiation. Named after Hans Geiger. Giger is the Swiss artist who designed the creature for Alien. [Hans Ruedi Giger](https://en.wikipedia.org/wiki/H._R._Giger) is one of my favorite artists. \n\nThat misspelling of his name is very common because Americans tend to mispronounce his name so sound like Geiger counter. Hans Ruedi pronounced his name gheeger with a had g as in go. \n\nHe's one of my favorite artists. \n\nIf you don't care just downvote me and forget about it.",
            "You get what you pay for, Darcy.",
            "I hope she slides into a mcdonald's as she turns and gets her ass sued off.",
            "I'd like to hear the followup",
            "I need the update. Did the lady call ur boss n scream?",
            "She could've avoided all of this if she'd just swallowed her pride and paid the extra $37 for you guys to take another half hour to do it right, or better yet, if she would've let you guys reschedule the move to another day and not risk your lives in a snowstorm.",
            "Nicely told story. Good luck to you & your boss.",
            "I helped someone move during a snowstorm and it deserves to be highlighted that the metal ramp to the truck gets extremely slippery in snow! My partner even sprained his ankle that day.",
            "Wow, what a heinous bitch! Who the hell treats people doing them a favor like that?!?!? I am so mad on your behalf. I don't care that you were hired for a job, you still deserve respect, especially being willing to move during a snowstorm.\n\nI was unhappy with the first movers I hired (they took the full 3 hrs they bill to move items, while I didn't care about the cost of having to pay for 3hrs when it would have only taken them maybe 1.5hrs to 2hrs to move stuff, I did care about the time it took). I just went with different movers the next time around, and I was very happy for it.\n\nI always strive to treat people doing me these kinds of favors with respect, even if it's \"just a job\" to them. I'm not willing to drive a large truck, and at times, I haven't been able to move/lift some of my heavier boxes (filled with books). I am just so glad & grateful there is someone out there willing to do both for me. I'm especially unwilling to do either during a snow storm, and I definitely wouldn't ask someone else to do it during a snow storm, either. That just seems like a recipe for disaster.\n\nI am glad you & Mike were able to be safe during this adventure! And I hope your other customers are nicer than that bitch.",
            "Her real name was Karen, so you had to name her Darcy, right?",
            "Props to being chads in the situation. Hope you guys didn't get sick after being in the cold for so long. Did you guys ever receive any phone calls or anything about her move? \n\nI'm assuming nothing happened in the end.",
            "I think doing a walk though and getting a sense of what you are moving before the date should be a good idea for the future. At least get pictures. When I worked for a moving company we always knew exactly what we were picking up that day.",
            "This ended exactly as I had hoped. Even better than leaving her there with an unfinished truck in a blizzard that I was dreaming of.",
            "Well, they do say \"the customers always right\"",
            "The world needs more business owners like Mike. I like Mike.",
            "Only $75 per hour!?? Holy shit where were you guys when I was moving?",
            "Box truck, Escher, *and* Giger? I love it.",
            "$75 an hour is crazy low. Honestly, for that kind of money I wouldn’t expect good service at all, let alone very good service. This lady is a nut job",
            "I have anxiety bringing a relatively light Tote down the stairs at U haul. You guys are doing this shit on an ice covered ramp and that takes balls my friend. She should’ve been less rude",
            "Has she called you guys back yet to complain?",
            "I don’t think she was concerned about money or hiring a lawyer honestly. I think she just wanted to be a dick. Watch out for legal action dude.",
            "my first job was as a mover, i was 17 and lasted 2 days",
            ">Mostly about how much time we were taking going up and down the metal ramp of the truck, which was now COVERED in ice and snow.\n\nSo go to Penske and get a proper-sized truck with a lift gate, you goon.\n\nMy heart hurts for whoever that woman (under)paid to unload that thing, but I hate those ramps even in just rain.  I live in FL but think I can still confidently say: fuck ice.",
            "I would have refunded her after unloading fast and haphazardly, back into the storage unit.",
            "MikE is really nice boss.",
            "DAMN IT, I want closure, I hate when you don't get to see the fruits of your labor!",
            "Anyone else think that \"wearing her tone\" makes absolute sense?",
            "Mike is brilliant, but more importantly, a really, really nice guy. Too good for this world.  \n  \nAdditionally, fuck that lady.",
            "Woo. Hats off to you! Moving sucks so hard..I absolutely hate moving boxes and furniture- we've had to do it too many times on our own. The last 3 times we've hired it our and,man...I really appreciate having young, strong men come in and do all that heavy lifting. This past July we moved on a freaking hot and humid day...I am always happy to pay for such services...who cares if it runs over? So glad you have a great boss,too!",
            "$75/hr? for 2 guys? Where you guys located?",
            "I love how you made such a large post only to mess up the title xd",
            "I wish I could see her face when she realized that her equipment is damaged",
            "I would have just left. You guys did all that work for free just to see her face when your boss said you didn’t need her money? My time is worth more than that for me. And on top of that you risk the possibility of further issues if she does decide to pursue anything about the damage. I think you would have been equally satisfied driving away watching her realize that she has a half loaded truck in the middle of a blizzard.",
            "Imaging booking a storage move-out in a snowstorm and not confirming vital details with the client such as size of the unit, contents, and value.",
            "This was a GREAT combination of firing one's client and punishing them for being way beyond unreasonable!",
            "I like Mike.",
            "So well deserved, good one, and nice reverse on that one with the cancel so she can't even leave a review.",
            "Mike sounds like my kind of guy.",
            " I would have loved to see her face when the truck door was opened.",
            "I would have just left her shit there in the snow and refunded her so she couldn't leave a review. What an awful person.",
            "Most moving companies will come have a look at what they're moving before quoting a price or agreeing to a job. Maybe Mike should consider this in the future.",
            "Your boss did it right at the end but screwed up earlier not asking the unit size. When a customer says \"small\" unit, that can mean different things, get dimensions.",
            "Your Boss is 'Ta Boss' <3",
            "Taskrabbit?",
            "I don't understand how refunding her prevents her from making reviews online.",
            "I WISH I WAS THERE!  EPIC",
            "I think that you are at least half to blame. You say you \"expected\" a standard-size storage unit. You should have asked. You accepted to do it in two hours. You should've said no and told her it'd take longer. You said you couldn't work in a snowstorm. You shouldn't have done it in a snowstorm.\n\nIn other words: if you can't do a job on the conditions posed, don't do it. And if you do take it, don't blame the other party.\n\nAnd frankly, I don't even believe this is true, because whether she had to pay you or not, she still could've left you a bad review.",
            "Here’s the real problem....\n\n1. By giving the work to her for free, you have encouraged her behavior AND rewarded her for it. \n\n2. Now since the full cost of the job was incurred with no income, the next person who comes along with a legitimate and reasonable complaint doesn’t get treated properly because the money isn’t available to cover it properly. \n\nOther customers and businesses in general all suffer when the people that act unreasonable get away with it.",
            "he didn't pay you because 'fuck that lady' he paid you because Federal fucking law dude. \n\nMike ain't a nice guy, he's an employer.",
            "Tldr",
            "L and XL post should be required to have TLDRs. I simply cannot focus long enough staring at a wall of text.",
            "That evil part of me hopes that stuff broke",
            "> I pride myself on playing a mean game of Truck Tetris. \n\n\nI love it!!\n\n\nI'd 100% be able to relate to this if I were a mover; it sounds exactly like the way my mind would approach the job.",
            "I cant believe i just read a book about this bitch darcy and mike is a good boss ive had one of those mikes as a boss and i can confirm they good guys",
            "Seems like you were dealing with a black belt Karen. I hope she's happy with what she got!",
            "Movers are saints. Fuck that lady",
            "We need an update? She never called to yell at him?",
            "You guys should’ve followed her to see her face!",
            "I just don't understand why people throw fits at someone doing a job to make their lives easier -- I don't know how I managed before I could afford a mover and I always tip a stupid amount to make up for the sheer bliss that I don't have to move all my own shit.",
            "Mike is a damn cool guy! I would have loved to see her face when she saw that half her stuffed was wrecked. It's so fucking easy to be nice and polite to people. Especially people who are doing something that you can't do yourself. So many people seem to think that if you're paying someone to do a job for you that somehow entitles you to treat them like shit. She got what she deserved.",
            "I'd like to see that -2F snow blizzard.",
            "what a satisfying story 👏🏽",
            "Mike must have gone to the same school one of my best bosses did. He always told me \"Some customers just aren't worth the trouble and expense.\"",
            "I would certainly ***never*** wear that lady's tone! You couldn't pay me to!\n\nYour boss is the kind of boss I would work for. \n\nI don't get the customer though, why didn't she disclose all of the details honestly beforehand? It would have saved time and effort and goodwill to the guys who are carrying your breakable stuff. And, with the snow making the move more difficult and time-consuming (despite your boss trying to get her to reschedule the move), she should have realized that the extra time was her fault. \n\nI get that sometimes you're in a bind, you have to move on *this* particular day, no other, and nothing can change it. But when you're in a bind like that, you should be extra **nice** to your hired help, not extra **nasty**. \n\nTell Mike we all think he's a really nice guy too.",
            "God I hate moving. Kudoes to you guys who do it as a profession and I definitely understand the compliance need here.",
            "I worked as a mover for 3 years. I've worked retail, food service, factory work, was in the military, telemarketing, and all sorts of other low-tier jobs. All have their bad customers, but the worst ones I ever encountered was when I was a mover.",
            "SHOUTOUT TO FUCKING MIKEEEEEE!",
            "This is so satisfying.",
            "Sounds like a moving company i used to work for in the north shore of MA",
            "I wore a customer's tone one time. Didn't turn out well.",
            "01",
            "Love this!"
        ]
    }
]