[
    {
        "post_id": "klh40p",
        "author": "ruckh",
        "title": "Lindt Chocolates",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/klh40p/lindt_chocolates/",
        "score": 15529,
        "num_comments": 893,
        "created_utc": 1609122105.0,
        "selftext": "Mobile format blah blah\n\nThis past Christmas my Mom just told me her malicious story. She was looking for stocking stuffers for the whole family and found a Lindor chocolate coupon online. 150 pieces for like 40 bucks - which is a pretty good deal. She did not read the coupon but screenshot it and brought it to her local outlet store to pick out the treats in person.  \n\nIt was a tad busy in the store so she waited in line, when it was her turn she showed the coupon. The conversation went as such.\n\nMom: “hi I have this coupon, I’d like to pick out my chocolates.”\n\nClerk: *inspects coupon* “sorry that is for online orders or if you call it in we can package it for you.”\n\nMom: “Ok so I can’t pick out the chocolates, I will need to call it in? I’m here now”\n\nClerk: “sorry that’s what the coupon says, next in line.” *again it’s pretty busy inside*\n\nMom: *side steps out of line and pulls out phone*\n\nClerk: *turns around answers the phone.*\n\nMom: *Audibly so she would hear her twice through the phone and in person* “Hi, I’d like to place an order for 150 pieces of chocolate, can you please provide me with your full menu one by one”\n\nClerk: *Turns around mortified and quietly says* “please just pick out the chocolates you want we will honor the coupon.”",
        "permalink": "/r/MaliciousCompliance/comments/klh40p/lindt_chocolates/",
        "comments": [
            "There was a takeout place I liked and there was ALWAYS a long line. If I was at home I would call it in and by the time I had walked over my order would usually be ready. Sometimes it would be more spontaneous and I would decide that I wanted to eat there as the bus went by. So, I would get off at that bus stop and get in the back of the long line. Then I would pull my phone out, call in my order, and walk up to the front, bypassing the entire line. \n\nAITA? Absolutely. But I didn't do anything wrong, just inconsiderate.",
            "I used to work at a fast food place, and when people ordered to go I would give them a large drink no matter what size they pay for and then explain that I'm giving them their refills to go. Well, I was in the process of doing this once in the drive through with a customer who came there a lot. Right in front of the customer my manager came over and started scolding me for it, saying if she wanted a large she would have ordered it and then takes the large out of my hand, throws it away, and gives her the medium that she ordered. The customer, who was familiar with my line of reasoning, circled through the drive through about 5 or 6 more times for refills. I was the one who had to keep giving them to her, so it didn't really prove any points. Just thought it was kind of funny.",
            "Former Lindt shift supervisor here.\n\nThat company prides itself on \"premium\" chocolate and for that reason, pretty much no exceptions or clerk discretion was allowed - at least in my district. Could have been different for others. I'd be written up if I made an exception or allowed a customer service rep to.\n\nThe 150 for $40 deal is great. Especially when running alongside 100 for $33...might as well get the other 50",
            "A few years ago the local electronics store had much cheaper prices online than in store, but I hadn't realised.\n\nI picked up what I wanted in store and was shocked when the higher price rang up. I asked them for the online price and the smug guy behind the counter said they couldn't do that. I walked off and left it by the checkout.\n\n...then walked outside, ordered it online for 'collect in store', and walked back in.\n\nSmug checkout guy wasn't happy when I went back to his checkout to collect my order and pointed to it sat next to the till already.\n\nWithin a few months they had made the prices the same everywhere, I guess I wasn't the only one doing this!",
            "She didn’t read the coupon and the store was busy, She is petty indeed.",
            "This story is *awful*. Working in retail, people like your mother are my nightmare. The clerk is just there trying to earn a living and deal with ten demanding people, and we have people like her a) not properly reading the coupon in the first place, b) not taking the polite first answer, and c) actively trying to make someone’s shift more difficult - someone *completely innocent who has nothing to do with the coupon or store policy except being forced to enforce it to keep their job not to inconvenience the customer*. And it was busy! She chose to act like a complete child. Shame on her.",
            "I mean, this feels more like a Karen move.\n\n Employee at a retail chain following the rules and being made to suffer by a woman with a coupon?\n\n I get that they weren't super helpful but also it's store policy and they definitely shouldn't be expected to violate that just because your mom didn't read the coupon.",
            "I work in retail. Our online and phone orders are taken and processed by a specific worker, that is their job in the store. If people who were serving out front were continually taking calls and looking at computers to see the orders coming through, the customers actually in the store wouldn’t get served, not in a timely manner anyway. \nWhen you place an order over the phone or online you’re given a time frame too for pick up, so the order can be ready when you walk in store. One of the reasons people prefer online orders, as well as some specific discounts that come with it. \n\nNow, this might not be how this store works, and the poor servers might have to do everything, as well as serving a busy store, which make this situation worse. \n\nThe thing that Karen’s don’t realise, is that at the end of the day, that worker goes home and when asked how work was, doesn’t say “this woman customer sure showed me, I was so wrong in this situation and I’ll be more lenient next time” \nThey say “today this bitch comes in....”\n\nRead the policy, and don’t take it out on a server. You say it would have made the servers day easier, but she still had to answer the phone and leave other workers to pick up the slack. She probably agreed to let your mum pick the chocolates in store because she didn’t want to leave the other servers in the lurch by being on the phone with someone who demanded the full menu!  All the while putting her employment at risk because your mum didn’t read the coupon. I can guarantee you, that incident would have left a sour taste in the servers mouth for the rest of the day and make working and smiling just a little bit harder.",
            "[removed]",
            "imagine just taking a random picture of a coupon without reading it and then going to a store and getting upset that they didn't honor the conditions that you made up in your own head so you just try to waste their time until they just give you what you want to get rid the nuisance that you are.",
            "They probably want it ordered in order to prevent customers from coming in and cleaning out what is stocked in the front, thus, having to constantly restock if lots of people come in with coupons for 150 chocolates. \n\nIf an employee fills the order then they can pull from the back stock making their job easier as they don’t have to constantly be restocking the front. The part that makes this sound like a Karen moment is that she spoke loud enough to be heard by the employee...and everyone else in the store. And also by the request of reading every menu item when she was there. \n\nThe only way this would not be Karen, but still malicious compliance is if she placed the order while standing in the store. Guaranteed the employee just let her go ahead and do it so she wouldn’t cause more of a scene then she already was. \n\nBeing hateful to the employee for just following company/store policy isn’t funny. And purposely making their job harder by requesting the entire menu  vs just placing the order while you are looking at the chocolates is a total Karen move.",
            "So she inconvenienced the employees and customers because she didn’t bother reading the coupon? Malicious compliance maybe but more like selfish Karen.",
            "Poor employee, what a stupid policy. I've been there, it sucks being the messenger.",
            "This is more a story of your mom being an absolute asshat. Yes, let's make the cashiers job a living hell because I didn't read the coupon.",
            "[deleted]",
            "Option one was to accept what she was told and leave. Option two was to do what she did. Why didn't she do option three instead? Just look around and see what was available, then make an online order for in-store pickup? Sometimes just because one can doesn't mean one should.",
            "Bless me father for I have sinned: I have often called in my order if the line at Starbucks is ridiculously long...",
            "I don't understand why stores don't accept their online deals in store.  I get it if it is different products but just honor it.\n\nI worked for Lindt for two months this summer after being laid off and before I have my current job.  We just opened up a new store and it was the worst.  The job paid well for mall retail and the people were nice.  But you couldn't have your phone out (which I understand the thought process) even when nobody is around.  We were a new store this summer we would go and hour without anyone coming in.  We didn't have anything to restock ect.  Ok no phone, fine.  You couldn't lean in counters and I am not talking bent over with your arms in the counter or leaning back far.  You can't even stand with your ass against the side. On top of it all they watched us.  We didn't cover something the way the DM liked and she called and said she saw it on camera. This is a mall retail part time job.  I have no customers nothing to do and you expect me to stand in dress shoes like it's the military.  Fuck that place.\n\nBTW we were told not to honor the online prices.  If we discount the product in store it devalues the brand.  You are in a mall in Northern Virginia that likes to pretend to be high end but is quite low class.",
            "This isn’t even compliance, she’s forcing the employee who has nothing to do with the coupon rules to break policy for her because she couldn’t even read the coupon. Your mom is a nightmare for anyone working in service.",
            "Everybody telling OP that his mom is a dick: *exists*\n\nOP: Everybody is wrong except for me",
            "From this, I decided to not like your mum.",
            "Sad that OP can’t accept that his mom was just being a dick. I work retail and get shit all the time from customers for things like this and they expect me to make an exception for them, even though I’m a minimum wage college student who has literally no control over policy and will get yelled at if I change it. Tell your mom to grow up",
            "Yeah great job hassling a low wage essential worker over following store policy. This is less malicious compliance and more just being a Karen literally over a coupon.",
            "The clerk who answered the phone should have put her on hold.",
            "I feel like this is more of someone being a karen instead of malicious compliance. If anything, I praise the customer service worker since they are dealing with someone who clearly couldn’t read a coupon",
            "MC would have been pulling up the store's website on her phone and placing an order through the appropriate channel, **then** collecting the merchandise and walking out.\n\nTying up everyone else while she refused to follow the rules is just Karenning.",
            "🙋🏻‍♀️ have been in long line at Panera and ordered on the mobile app. By the time I get to the speaker, my order is in progress and at the window, hot and ready. 👍🏼",
            "Oh, the horror she must have faced when told by the clerk that she had to follow the rules for the coupon",
            "I had something similar happen this week. I needed a flea and tick collar for my dog and tried to order it for pickup so I would get 20% off. The app said they had low quantities so I couldn’t place the order with the discount. I get there and they have a dozen of them. I explain the situation to the manager and he just exclaims how weird it was since they had so many on hand. I asked if he could honor it and he said no. I wasn’t going to fight about it, but it was kinda BS.",
            "Tbh I feel bad for that employee. Corporate is always on their asses about doing things correctly, it's not their fault for trying to do their job correctly. It would have been easier for the employee and your mom if she just did it online or called after looking up which ones she wanted.",
            "There is a thin line between clever and karen.",
            "/r/amitheasshole is leaking? \n\nIs this christmas 2020? \n\nAre you serious OP?\n\n&#x200B;\n\nI have so many questions",
            "It’s not the retail workers’ fault stuff like this happens and they’re usually instructed deliberately not to do that and probably had to face consequences for taking it anyways. Nice job making it their problem you didn’t read the coupon.",
            "I'll admit in the beginning I thought I understood the retailer's perspective. Often there are more moving parts and nuances with B2B vs B2C vs C2C that can dictate discounts.\n\nBut the last thing I expected was the phone to ring at the retail location, for the same employee lol.",
            "Your mom's a Karen who should've read the coupon.",
            "So basically, your mom did not read the coupon, asked to use it at a store, then got annoyed at and inconvenienced an employee when told that she could not use the coupon that she didn't bother to read? The employee who had no control over how the coupons work? Wow what a hero.",
            ">150 pieces for like 40 bucks - which is a pretty good deal.\n\nThat is indeed a good deal.  On Amazon, 60 for \\~$20.  Not a bad deal there either, but not as good as what she got.",
            "[removed]",
            "This is a story about entitlement.",
            "Seems more of an AITA than MC. I feel bad for that poor cashier being abused like that.",
            "It's like people on this sub doesn't know the difference between \"malicious\" (an act which causes harm, physical, material or mental) and petty.",
            "1st world problems",
            "i remember the first time I figured out booking a hotel online was way easier that way. I did that while traveling cross country with my dad (driving) and we found a hotel for the night in some random city. I logged onto their website (this was back before mobile phones had great internet and we had dedicated mobile cards (this was a PCMCIA card that actually still had an unlimited data plan with verizon). I booted up my netbook (lol yes netbook, the Toshiba first entry) and booked a room for the night just as we pulled into the parking lot. Walked right inside and got our room key.",
            "I mean, your mom is kind of in the wrong here. The whole reason they make the coupon online orders only is so the the store doesn’t get congested with people picking out 140 chocolates. She didn’t read the coupon AND the store was already busy...",
            "Stores that answer phones rather than deal with lines (or have one server doing both) give me the shits.",
            "This is awful. Anyone who works in retail will tell you that your mom is an entitled Karen. She was so lazy as to take a picture of an online coupon without reading it? Come on.\n\nI understand that retailers are making it harder for the older generation to save money by making everyone download the store apps on their smartphone, make an account, load the coupons...etc. But she should by no means feel that entitled when she’s in the wrong. Simply asking for help placing the order would’ve been a nice solution to her problem.",
            "I joined this community because of this post.",
            "I mean...should have read the instructions in the first place.",
            "Yeah, fuck that worker trying to just do what they were told from their boss. You sure showed their minimum wage making ass!",
            "I used to work in retail. I hate your Karen, mom.",
            "This is awful, your Mom was doing a full on Karen level of entitlement. There's a reason why that coupon was for online only, and she shouldu have respected that and left to do her shopping online. Instead she made a show and put more stress on a retail worker who's just trying to do their job. So can have it her way.",
            "Definitly malicious compliance, definitly also a massive Karen.",
            "I’d be emberassed if my mom acted like this. I guess only retail employees can agree on what kind of shitty move this is. This would not have been an issue if she had followed the rules in the first place.",
            "Assuming you mean 2020: Isn’t it possible that the coupon terms were to encourage quick pickup orders since we are in the middle of a pandemic? Your mom isn’t the hero here.",
            "Sucks that the low person on the totem pole, the clerk, has to deal with all of the ridiculous policies set by management. Policies that, when you look at them, don’t make an ounce of sense when you are actually on the sales floor helping actual customers.",
            "This was so funny that is exactly what I would have done",
            "Your mom is a Karen.",
            "This isn’t malicious compliance. This is your mom being an ignorant jerk and not following the rules and proceeding to make s retail workers life harder during the holidays  because they followed procedures of their place of employment. \n\nYou and your mom aren’t cute. Read the rules before you complain, Karen(s)",
            "Went to order pizza for pick up yesterday.  I see on the company website that they have a meal deal going, so I ask for that.  I get told that’s for online ordering only, so I hang up, order online,  they make it in store for me and I pick it up.  What are earth sort of stupid store policy means they can’t take the same order over the phone ?",
            "she should try reading the coupon next time 👍",
            "This story legitimately made me angry",
            "I love how wholesome this is. The clerk was just doing his job, and your mum just used the technicalities to make it work. Nobody being rude about it. Class acts all round",
            "[deleted]",
            "Your mom sounds like a bad person.",
            "No offense but we get Karen’s all the time in a certain red arts and crafts store that may or may not be a guy’s name that try this stuff, like “can I just make an online order right now, I’m already here, you just go get for me” most of time, it’s when we’re very busy and all of our employees are of course at the front trying to get the line down.",
            "Karening",
            "The clerk and literally everyone in that line probably (and rightfully) hate OP’s mom’s guts",
            "A few years back my husband wanted pocket squares for his suit for a wedding. He found ones that went well at JC Penney, and bought them on line for pick up. I was looking for a bead necklace, to go with my fairly plain dress, for the same wedding, so I went too. I didn't find what I was looking for (no surprise, I'm picky about jewelry, even if its single use) but I spot a really cute dress on a clearance rack right next to the jewelry department. It was something like $15 So we get in line. He complains about having to wait and finds the dress on line and bought is for an additional $4 off, so it was now $11, while we were waiting. The internet was slow, so as we get to the cashier he had not quite completed the purchase. So they knew exactly what we were doing. The cashier bags the dress and tells us they don't really get it, but the company always has things like 10-15% of for \"online purchase\", its how they tell their friends to shop at their store.",
            "Ahh she was just trying to get through the line and probably assumed your mom would walk out and do the order later 😂",
            "That clerk potentially lost a job for this.",
            "Dude your moms a total Karen. Retail people just follow the rules and get in trouble for bending them, even if doing so makes more sense. I suggest you let your mom know she should read the fine print on coupons instead of being petty.",
            "Has she tried learning to read a coupon?",
            "Borderline Karenesque",
            "I like your mom",
            "Awesome!!",
            "Your mom sounds like a karen",
            "A million upvotes or not doesn’t matter. Damn I’d be so embarrassed if my parent or anyone for that matter did this at a store.\n\nEdit:\n\nWhoever gave silver thank you \n\nWhoever sees this comment\n\nI looked up the coupon on lindtusa \n\nThe fine print is quite clear and concise and not trying to bamboozle anyone\n\nMom is a Karen.",
            "Reddit, where everyone is a cashier and the home of \"it doesn't pay much but I get by\" at the start of every work related post.\n\nBut post a story about sticking it to someone just doing their job for minimum wage and here come the upvotes. Y'all are a special bunch.",
            "r/deliciouscompliance Lindt makes good stuff.",
            "Nice your mother is fucking smart and that poor clerk",
            "LOL yas mom",
            "“Sure, we can do it your way, but you’re not gonna like it!” Textbook malicious compliance. Not sure why people are saying it’s not.",
            "I love this. 😂",
            "If there is a line out the door don't you dare answer that fucking phone.",
            "Online only coupons are just DUMB.",
            "“When to Blindly Follow Instructions and When to Apply Common Sense”",
            "My fun Lindt story is that I used to go to high school not too far from their factory in Stratham, NH. They had a \"factory outlet\" type store nearby that would throw out expired chocolate products — not usually expired for more than a few weeks. They would just sit in these boxes next to the dumpster in their parking lot.\n\nSo we would walk over to the store at night and go dumpster diving for free chocolate... hundreds of boxes of more-or-less perfectly fine chocolate! We hauled back quite a bit until the local police caught on. Lindt actually asked them to stake out the location and when they caught us they made us put all the chocolate we took that day back. Good, blissfully ignorant times...",
            "Wait...are Lindt and Lindor the same company?",
            "rude selfish mom, rude hardheaded OP.",
            "I think what your mom did was perfectly acceptable...",
            "bitch",
            "LMAO why are people getting so salty about this. The Clerk wanted to get technical (within their rights and completely reasonable). OPs Mom also behaved as a customer and within reason. \n\n \nPretty funny if you ask me, and yeah y'all need to calm down, if you're working one of these jobs your life just isn't that serious.",
            "Seems like a lot of people didn't read or only half-read your post. Your mum followed the rules that the clerk enforced. Not her fault the rules were to the clerk's detriment."
        ]
    },
    {
        "post_id": "aj1vp6",
        "author": "Universal_Binary",
        "title": "How about a good teacher for a change? Art teacher turns the tables on students with MC after a 2-month wind-up",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aj1vp6/how_about_a_good_teacher_for_a_change_art_teacher/",
        "score": 15522,
        "num_comments": 233,
        "created_utc": 1548263335.0,
        "selftext": "I think it's still malicious compliance if you goad people into demanding the thing you maliciously comply with, right?\n\nSetting: Elementary school\n\nMe: 4th grade or so\n\nOur class had been complaining about our projects in art.  The art teacher was going over painting and drawing and we were getting bored and begging to do something else.  OK, he says, we'll do some other stuff.  We had two months of pottery, carving sculptures out of bars of soap, all sorts of fun stuff.\n\nWhile we'd work on our projects, the teacher always told us stories.  Some true, some not, but his favorite kind were ghost stories.  Eventually he figured the stories about ghosts in the school were the scariest.  Pretty soon he started telling (made-up) stories about the ghost that lived in the school. Over the course of the weeks, while we shaped our pottery and did our carving, the stories grew to include sightings of the ghost in the school's basement.\n\nThis basement was really a cellar.  Perfectly safe but the floor was usually a bit damp, it was dusty and dingy, etc.  We only ever went there for tornado drills.\n\nEventually he started telling us how HE saw the ghost down there.  Then how the ghost was even there DURING THE DAY.  All in a way designed to intrigue, and perhaps scare, 4th graders.  Pretty soon my classmates were DEMANDING to go down to the basement and see the ghost.  He'd say, \"no, it's too scary\".  That made people more demanding.  Finally he said, \"Do you want to see a ghost in the basement?\"  \"YEAH!\"  \"Are you SURE?\"  \"YES!\"  \"It's pretty scary.\"  \"LET US SEE!\"  \"You'll scream.\"  \"NO WE WONT!\" \"OK, OK, have it your way.  But don't say I didn't warn you\".\n\nThe boys in class were all bragging about how they weren't scared.  The girls were all huddled with their friends.  Finally the day arrived.\n\n\"Now, this is going to be scary.  It's OK to scream, but don't try to run -- I don't want anyone to fall down there, OK?\"  Nervous laughs and nods from the class.  \"Does anybody want to stay in the classroom instead of going down?\"  No raised hands, but some apprehensive looks.\n\nWe all went down to the basement.  All was normal.  Then the teacher suddenly switched off the lights.\n\nAnd that was when we saw a ghost, shimmering in the distance, with its eerily human-like face peering at us.\n\nThere were screams, from both boys and girls.  It was loud.\n\nThen he switched the light back on and we heard the teacher laughing.  Loudly.\n\nAfter some badgering, he pointed to the large white towel hanging from a pipe at the far end of the basement, gently waving in the breeze.  \"Is there where you saw the ghost?\"  \"Y-y-yes...\"  \"Was it glowing?\"  \"Y-y-yes...\"   \"Did you know that you can buy paint that glows in the dark?\"\n\nCue the predictable responses from the 4th graders, and demands for him to show us how he did it and let us try.  It didn't dawn on me until yesterday, when I told this story to my kids a couple of decades after it happened, that this whole thing was a 2-month windup on the teacher's part.  Because after we saw the ghost, of course we demanded to know how he did it.  We demanded to try the glow-in-the-dark paint ourselves, and did.  We got a lesson on using paint you can't see very well (similar to glaze).  We learned about unusual mediums (including cotton towels).  We then went back to other painting-type items in art with excitement and demands to the teacher to try all sorts of kinds of paint and painting.  Which was probably his plan all along.  I'm sure he covered everything in his lesson plan that year, just slightly out of order, and with much more enthusiastic kids.\n\nWe were had, and good.",
        "permalink": "/r/MaliciousCompliance/comments/aj1vp6/how_about_a_good_teacher_for_a_change_art_teacher/",
        "comments": [
            "That's a clever teacher! I had a teacher in 2nd grade that had lined up finger painting for art class one day and the whole class was complaining that finger painting was for babies and also complaining that all the paints were weird colors. This teacher was a little eccentric (she always played Simon and Garfunkel during art time...Art Garfunkel) and we usually had a good time during art.  \n\nAnyway, we all grumble and start finger painting. Everything is going along, and then I get a nudge from my neighbor - I look up and she looks over at the teacher, so I look too - annnnd the teacher is licking finger paint off her fingers. My classmate and I look at each other, and then look again. More students are starting to notice. I mean, this teacher is weird, but eating paint? The teacher waits until we're all looking and eats some more, but doesn't say anything. Finally one kid tentatively puts a finger in his mouth and then laughs. Turns out, the teacher made all different kinds of jello pudding and that's what we were using for paint! Another clever teacher showing us not to take the world at face value  :)",
            "And that's how the best teachers work.  If you can get your kids excited about learning the subject and maybe prank a few others along the way, then they will be eager to learn.",
            "Wow. A great leader who decided to be a teacher.\n\nMotivating kids to actually want to learn something is a skill apart from simply possessing the ability to teach the subject.\n\nI hope they've been treated well by their administrator and haven't gotten burned out.",
            "That's excellent. My high school chemistry teacher used to tell tales of the time he worked in industry and how people got blown to pieces or lost something rather important like an arm because they forgot to use the fume cupboard.\n\n\nWe never forgot to use the fume cupboard.\n\n\nHe also used to come up behind us while were lighting Bunsen burners and shout \"BANG!\".\n\n\nRIP Mr Clarke!",
            "Sounds like a truly great teacher!    \n\n\nSadly in today's environment though I'm sure some over eager parent (probably a Karen type) would complain and make sure it never happens again since poor Timmy or Sallie got startled.  \n\n&#x200B;\n\n\\*Note, not truly scared... but I've seen the parent type go to extremes trying to say something was much more egregious than it actually was and put words into their kids mouth.",
            "Wholesome AF.",
            "Almost all the stories that involve teachers in this subreddit are bad teachers, it’s nice to see something about a good teacher.",
            "I had a science teacher in high school who was amazing! I really credit him with my love of science and getting my degree in that field. \n\nWe had a lab on liquid nitrogen, and he had the usual safety talk of ‘don’t put anything in or near the nitrogen that you don’t want to lose’. We’ve all heard this before, since it was day 3 or 4 of the lab. He suddenly plunged his hand into the liquid nitrogen container, pulled out an, obviously frozen, gloves hand, placed said hand on the lab bench, and proceeded to shatter it with a hammer. \n\nAfter we finished screaming, he told us he’d made a fake hand with a burger and 5 hot dogs, and had purposefully worn gloves beforehand to play said prank. We were all a LOT more careful around the nitrogen after that. \n\nWe also had a 2 week microbiology lab, and when we got sick of all the microscope work halfway through, he rubbed black powder around the lenses so we had Harry Potter style ‘glasses’ for days. We loved them, and he put the powder on his own microscope, so we had fun with that for days!\n\n",
            "So you said that it clicked as you were telling your kids about it. Did you stop in mid sentence, filled with awe and respect for your teacher? ",
            "That is genius! I have so much respect for that teacher and his good-natured fun and brilliant way to get the class excited. We need more teachers like him!",
            "That's awesome. I bet you all had a good laugh after that. Thanks for sharing! ",
            "Oh my God.  He sounds like the best teacher ever.  Today they'd probably fire him.",
            "r/wholesomecompliance",
            "As a public school teacher myself I know that while that is a cute story, now he would not be allowed to do that and would definitely get in trouble. One helicopter parent would complain and say that their kid was traumatized. This is the world we live in. ",
            "There are few things in this world more valuable than a teacher who makes coming to class everyday feel like a joy. I'm reminded of my first grade teacher.   \n\n\nShe had Irish-heritage, so we learned super important stuff like what a shillelagh was and how to properly greet someone with a boisterous \"Top of the mornin'.\" She also sang the school song with us every morning while playing the piano, and would write the sweetest responses to our daily writing journal entries--journals that I kept until this day. She was such a joyful and animated person that I've always felt okay about being a little weird and animated myself.",
            "Teacher Level: God",
            "Sounds like a great teacher... My art teacher got busted for being a pedophile...",
            "r/wholesomecompliance\n\nCool that he tried to engage everyone in a unique way and have a little fun with it.",
            "This is why interdisciplinary education needs to be everywhere (not just Finland). You thought you were in an art class, the teacher incorporated both literature/story-telling and theatre/drama aspects into a course, which turned into a better art class and a story which resonates with OP to this day.\n\nI had an English teacher who taught my grade 9 English course through the lens of a historical time. More compelling than many university-level courses I've taken were.\n\nMore of this, please.",
            "I WISH I had an art teacher as cool as that. My elementary school art teachers mostly hated me because I was shit at art and they practically bullied me because of it. ",
            "Some people were born to teach. ",
            "Definitely A+ lesson planning! His plot twist gave me a good chuckle, thank you.",
            "\"Well-played, sir. Well-played.\"",
            "Great to see a change from negligent teachers who don’t care to a funny creative teacher who knows how to inspire ",
            "Damn son, you just got got.",
            "Neat story! My school malicious compliance isn’t as sweet. My school was tiny and ran from pre-k to 12. It had started as a Christian pre-school and added a grade each year. I was the second graduating class. We had a strict dress code. But fashion in the early 2000s made complying difficult. It was hard to find decent mid rise pants and tops that didn’t show your belly when you raised your hand. The solution to this was uniforms my 10th grade year. Sounds good? Nope. \n\nWe had to shop at actual stores for uniform- like clothing. It was a joke. To further make it difficult, the French Toast brand didn’t fit at all. This brand was the most affordable at Kmart and Sears. Most kids just bought button downs and khakis from American Eagle. Guess what happened? Same problems. Girls skirts were still too short and their bellies still showed when they raised their hands. \n \nIt didn’t end there. The problem worsened. The administration got fed up. Especially with my class since by then we reached grade 12. Two years had passed and the uniforms were doing nothing, as predicted. \n\nAdministration decided that they would revoke the senior high banquet (our version of prom, except with no dancing). \n\nThis didn’t go too well. We wanted a banquet and many had already spent hundreds on dresses.  Then we realized that we could just have a prom. An ACTUAL PROM! \n\nAdministration got wind of our plans (which were being planned outside of the school) was were furious. They decided that they would hold an assembly on how awful dancing was and ‘encourage’ us to not have it. \n\nWe had a prom that year. Administration couldn’t do anything. The same parents who volunteered as lunch ladies and for field trips put together the prom. \n\n",
            "Wow, this is the most wholesome experience I've had on this subject. Reading this story and the comments are probably a good way for me to end the night. ",
            "This feels so wholesome, I was feeling a bit sad today but your story lifted me a bit, thanks!",
            "This is beautiful. I love this teacher.",
            ">It didn't dawn on me until yesterday, when I told this story to my kids a couple of decades after it happened, that this whole thing was a 2-month windup on the teacher's part. \n\n>We were had, and good.  \n\nIf you're still telling the story 20 years later, I'd say it's worth looking up old dude and telling him he did a good job. Teachers don't get enough of that.",
            "Wholesome Malicious Compliance",
            "This isn't malicious compliance. It is, if anything, delicious compliance. ",
            "Wholesome malicious compliance is some of the best, I wish the art teachers I had as a kid were anything like this.",
            "Great story!",
            "This is brilliant! Is there a sub Reddit for pranks? ",
            "Smart teacher, this guy is definitely going places",
            "Brilliant. ",
            "wow, he really schooled you. ",
            "This may be the least malicious compliance I’ve seen in this sub. Well done to that teacher! ",
            "That sounds like one awesome teacher! They must of really cared that the kids actually learned something and wanted them to be excited to learn. That is truely awesome! GG teacher",
            "All I'm getting from this thread is a whole lot of hilarious, -best kind of nerd- teachers. ",
            "I'd stay in the classroom actually, I genuinely don't like scary things (I'm not saying that I don't love your teacher - I do, he's amazing)",
            "r/wholesomecompliance",
            "And wholesome. Great change indeed.",
            "In high school one of our teachers took us to the janitor’s closet to dispel rumors about how creepy and haunted it was.\n\nThe door opened directly onto a steep concrete slope (not stairs, I guess for the supply cart?) to some kind of basement area, complete with old pipes and peeling paint. Creepy as fuck and you couldn’t see any of what was actually down there. When our teacher heard us talking about it, he was like “I’ve never been in there either but we can take a trip over there and see if you want.” \n\nWe did want, so he lined us up and twenty-some-odd kids filed down into the janitor closet. And it wasn’t too bad, just old and musty and a little creepy, except for the two foot wide pit that was too deep to see the bottom of, which was VERY creepy. Teacher couldn’t explain it. Rumors after that included the hole, which had definitely had dead students thrown down it at some point, and probably that was what really happened to you if you got sent to “alternative school”. \n\nI still don’t know what it could have been, other than maybe a sewer access missing a cover. Not sure, weird as hell, did not dispel spookiness.",
            "how is this malicious?\n\nor compliance?\n\nI don't think OP understands the premise of this sub",
            "I love this story, thank you for sharing it.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/awesomecompliance] [(copied from \\/r\\/MaliciousCompliance) The Ghost in the School Cellar](https://www.reddit.com/r/AwesomeCompliance/comments/aj42p7/copied_from_rmaliciouscompliance_the_ghost_in_the/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Wholesom malicious compliance. I can dig it.",
            "That is brilliant",
            " I was lucky enough to have a handful of teachers like this.   It really makes a difference. ",
            "If this happened today, some parent would complain that their kid was traumatized by it and try to get the teacher fired.",
            "Was not expecting such wholesome MC.  \n\nWhat a great teacher!",
            "My later art teacher had us draw the bricks on the wall to train us on noticing detail.\n\nThat was a complete waste of time.\n\nWe did get to make some claymation videos and use a kiln to make our own projects (even after telling some of the younger idiot students to put a hole in the bottom we still had a few explosions/cracks because it couldn't breathe while being heated). I made an apple. Not a very good one, either.\n\nWasn't a *great* art teacher or whatever curriculum he was forced to cover sucked, but I still have both of those art projects in some form. The claymation I did with my friend I have in a video and the  apple is safely tucked away somewhere on a shelf in my mother's house. I think the bottle my other friend let me use, and keep, when I forgot I was supposed to bring one (we were creating mirrors inside of bottles in chemistry class) is there, too, still. Turned out really cool because the bottle was a [Gold Peak tea bottle](https://cdn.instructables.com/FFH/4XXR/FAQEDEEL/FFH4XXRFAQEDEEL.LARGE.jpg) so the mirror looked like it had a golden tint to it through the glass.",
            "Disgusting MC. Belongs in r/prorevenge ",
            "[deleted]",
            "r/wholesomemaliciouscompliance",
            "Wait.......Where did the breeze come from",
            "He totally Huck Finn'ed you.",
            "and how ",
            "That's absolutely brilliant! ",
            "Finally a good teacher story!",
            "this is so nice and wholesome",
            "This is so wholesome, made me giggle.",
            "Great teacher. Good luck doing that today. Teacher would be out of a job from a single complaint. ",
            "This is amazing!",
            "It's a nice story, but not MC. More like benevolent manipulation. Or unwitting compliance."
        ]
    },
    {
        "post_id": "9qe0go",
        "author": "chewy_mcchewster",
        "title": "I need to shut up and just do my job? Alright",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9qe0go/i_need_to_shut_up_and_just_do_my_job_alright/",
        "score": 15509,
        "num_comments": 618,
        "created_utc": 1540216403.0,
        "selftext": "I'm a custodian at a local school board, our cleaning section is broke down into square footage and how long it takes to clean it. \n\nKinder rooms are 25.8 minutes, regular classrooms are 12.3, portables 19.8, set of washrooms 25.6, so on.. \n\nThis kindergarten classroom had glitter everywhere and the kids absolutely destroyed the room on a regular basis, i put up with it for the whole month of September and part of this month. I finally mentioned to the principal that it's taking me longer than normal to clean the room - as glitter takes months to get rid of and I'm short on other rooms.. She said ' your a custodian, just do your damn job '. \n\nOh, ok, my apologies, no problem! \n\nI put my phone by the door recording me cleaning the room, at the 25.8 minute mark (that would be 25 mins, 50 seconds) my alarm went off. I dropped everything, grabbed my phone, turned the light off and locked the door.\n\nI didn't have time for the kinder washroom, vac the carpets or take the garbage out. Oh well.\n\nI got called in for answers the next morning, I stated my case, my supervisor was called, and I called my union. I am in the right, however i should of consulted the union before... Oh well ! They are looking at increasing supervision now..\n\n\nedit: just want to personally thank those of you who appreciate us custodians, i know im not the only one out there, we get shit on a lot, and its nice to know you treat us as actual people :)\n\nEdit2: for those who asked, here's one of our schools (not the school in question - trying to stay anonymous): https://imgur.com/a/MNNZhrc\n\nMisc time includes dealing with rentals, additional cleanup (extra spills) troubleshooting stuff like our buffers, attending to setups for events (movie night/parent interviews) + tear downs, etc.",
        "permalink": "/r/MaliciousCompliance/comments/9qe0go/i_need_to_shut_up_and_just_do_my_job_alright/",
        "comments": [
            "Am I the only one who finds it disturbing that custodians apparently have their time mapped out to the _second_? How awful.",
            "As a kindergarten teacher I can say occasional glitter is one thing- completely trashing room  really is NOT okay. Kindergarten is messy but part of teaching young grades is teaching them to clean up and be responsible. My kids typically knew the custodians and if they were being gross I would remind them that Mr. Whoever or Ms. whoever will not be happy - We are responsible for keeping classroom clean.\n\nHuge messes ( glitter, Christmas cookie decorating) always got apologies and my participation in cleaning up anything kids left. Your custodian is a huge ally as an educator and you need to treat them right.",
            "Increased supervision for the kindergarteners? Or for you?",
            ">i should of consulted the union before\n\nIts easier to get forgiveness than permission.",
            "Increased supervision *always* helps you work faster. /s",
            "I want you to know your work is appreciated. \n\nI'm sorry the principal is an asshat.",
            "> They are looking at increasing supervision now..\n\nWhat, so somebody can stand at the door with their own stopwatch and tell you when you've hit the 25.8 mark?",
            "What the *hell* is that teacher doing that the room is covered in glitter every day...and WHY is she not cleaning up some of it?",
            "This problem got exacerbated by your principal saying 'just do your dam job'. That is no way to handle a complaint by an employee. That principal is in the wrong.",
            "Ah, the joys of being an elementary school custodian.  Keep all the pathways clear during a snowstorm and clean all the rooms by the end of your shift.  No you can't work overtime!",
            "You lucky SoB. That's more than twice the amount of time we get at my school board. =(",
            "I have a better solution.\n\nBan glitter. Fuck that stuff, stays for years.",
            "Hopefully the union has your back, glitter everywhere is not fun to clean. Is it loose glitter or the type that's pre-mixed with glue?",
            "I am an IT person for a school district. The custodians put up with some bullshit. Fuck that administrator for talking to you like that. The teacher needs to have more control of her classroom,",
            "After I got back from Iraq (As a reservist), but before the fall of my first semester back in college in the spring of 2010.  I got a job as a custodian at a public school.  2nd shift.  3pm-Midnight.   I was to clean classroom/restrooms in 2 schools, first 4 hours in one, the second in the other 4 hours.  I drove across town during my lunch hour, but wasn't paid for that time in transit, it was part of my break.  (I didn't know better)  \n\n\nKindergarten rooms where the worst, crap ground into the carpet, once a urine/poop smell.  My first 3 nights I had someone with me to show me what needed to be done.  Except that we never left at midnight.  It was always later.  I was told by the guy with me that with no exception to never clock more than 40 hours in a week.  And because I started on Monday, and was shadowing someone I was alone on Thursday & Friday night not knowing what to do.  I went ahead and worked late each of the remanding 2 days, because it look me even longer to do the work alone than with help.  I was suppose to get all of the paperwork done the next Monday.  I also had to turn in my timecard.    \n\n\nI met with the boss at the paperwork meeting.  He asked for my time card, noticed I claimed more than 40 hours on it and told me I needed to amend it to 40.  I told him that I didn't see how I could achieve the tasks set before me in the time allotted.  He told me I would get faster as I got more experienced. (I have plenty of experience cleaning from the military FFS) To which I replied that I wasn't going to get it thoroughly cleaned in that time.   What corners was I suppose to cut.  He says none, do it all, take all of the time needed.  Just don't clock more than 40 hours.  The paperwork meeting was about to start.  So faced with the prospect of being abused and manipulated into working OT without OT pay on a regular basis and being made to feel like an idiot.  I walked out of the meeting after giving the boss building keys.  Was a gut wrenching choice, I had no other options at that moment.  But I \\*refused\\* to be abused and told I didn't know what I was doing when I knew I was right.  \n\n\nSkated over the summer off of money I made in Iraq, then lived off school loans. ",
            "YOU brought it up to HER, and she chastised you? \"Oh hey boss, just so ya know: lately there's been more mess in this one room than usual, and I've been going a little overt-\"\n\n*unholy shrieking*\n\n\"oh fuckin kay then\"\n\nI'd sort of understand if you were approached about an \"operational issue\" but if you brought the problem to them... eeefh.",
            "This remind me of when I used to do in home assembly. I had a work order to go deliver and assemble a rather large all in one gym set for a school once. It meant driving for an hour or more and spending 30+ minutes setting the thing up, then dragging the box to a dumpster. This particular all in one gym system didn't take much time to assemble and paid well due to it's weight and size. I called the school 30 minutes before getting there asking for them to send a person from maintenance to assist me in lifting it with a dolly since it needed to go down several halls to get to its forever home. Now I made up my own schedule but I wasn't in any real hurry so when they made me wait for an hour and no one showed up at the bay door to help me with this thing, I decided to take matters into my own hands i did not get paid by the hour but per assembly so I didn't plan an extra hour into my schedule. I had to literally drag this huge heavy box down the hallways of this school until I got to the room it was to be assembled in. It left very noticeable scratch marks in the vinyl flooring. I assembled the item, got a gym teacher to sign off on it and left. I also told them about the drag marks at that time, explaining to them no one met me with a dolly for this thing.\n\n A whole week later I get an angry email from some teacher there at the school about how I didn't assemble the thing right and it was missing some parts. I also left drag marks up and down the hallway according to them. So my company paid me to deliver another one of these monsters, pack up the one that was \"incomplete\", and reassemble a second one. I happily complied, as it turns out i was met by the principal and her \"security team\" who helped me load the second one on a dolly, scrutinized my every move while i was there waited for me to complete assembly and disassembly. They were missing a single piece of equipment that one of the kids left on the floor behind some mats I noticed, to bad they had to pay for the same thing twice , then pay for the floor that got damaged and, pay me for wasting my time. Sound like someone had a head up their but if you ask me but hey whats a few more hundred taxpayer dollars to the deficit eh?",
            "Thank you for taking care of our kids!",
            "I fucking despise people who are mean to public servants. Like, the only point of their job is to serve.",
            "I've never understood why people treat custodians like shit. They want the place clean and wont do it themselves, yet the person who actually cleans up after them is beneath them? Same goes for cashiers, wait staff, cooks, security, and on and on and on.\n\nA modicum of respect for putting up with other people's bullshit without ripping them a new asshole isnt too much to ask for. Or hell, just some common decency would be nice.\n\nMy grandpa gave me a bit of advice when I was a kid. It's always served me well. \"There are just some people you dont fuck with. Your barber, your butcher, anyone who handles your money, anyone who handles your food, and anyone who cleans up after you.\"\n\nBut no. You get fuckwits like the principal in OP's tale, or really damn near any given post in any talesfrom____ subreddit. And they wonder why people in \"bottom of the totem pole\" positions tend to get really jaded really fast. They should try getting shit on daily and still having to plaster on a smile all while struggling not to verbally (or literally) eviscerate the self-righteous prick that's treating them like they're something to be scraped off a shoe.\n\nYou can't demand a service of someone and then turn around and look down on them for providing that service. Just as bad is when you know what you're doing, you know that what they're asking isn't going to work, you KNOW THE LIMITS OF YOU OR YOUR TEAM, and they completely ignore that, demanding it be their way. No matter how batshit their idea is. Try doing it yourself next time you prick.\n\nSorry if I got a little ranty or rambled a bit. Just reeeeally pisses me off, and I'm currently dealing with a supervisor at work who acts like we're all some sort of mental defectives.",
            "I can’t believe you’re literally timed to the minute on how long you can work on an area. That’s seriously so ridiculous! ",
            "I just want to thank you for all your hard work. ",
            "When I was a teacher, I refused to use glitter after a couple times and realizing how awful it was.  I've come across many-a-parents whining about the lack of glitter in classrooms today, but they don't understand the pain.",
            "Your time is scheduled to a tenth of a minute. That sounds absolutely insane to me. ",
            "I've always said, never fuck with the people who control the Toilet Paper supply.",
            "I was a janitor from when I was 15-18 (most of it under the table helping out my friends dad who was a franchisee for a cleaning company). Mainly clearing garbage and mopping up office buildings.\n\nI think everyone should have to spend some time as a custodian for at least a summer. You really get a new respect for the job and how much they do. I find I'm much more aware of any messes I'm leaving when I'm in a public space and make sure to always clean up after myself.",
            "I went to an alternative school for my entire elementary level. One of our task as a child was to clean up before going out in the afternoon. We would be assigned a task (broom, chairs on table, blackboard, table cleaning, ...) and it would be done every day of the week. Even there, the custodian/janitor had a lot to do in its day. But we were to respect its job and make sure to help as much as we could.\n\nEvery school should do that.",
            "I tell you what, when I was in the classroom, I took care of my custodians. I knew they took care of me. When I coached, I always orders them sweatshirts or t shirts when I got team shirts. One of my students threw garbage in the floor and I told them to pick it up. They said, “ that’s what we have janitors for”. I jumped all over that kid and made them sweep the classroom every day for a week before the custodian came in. They learned really quick it was not fun when people just threw things all over. But, when I asked for something to be done in my room, they always made sure it was done. I have deep respect for the people that make sure I have the environment to do my job correctly.",
            "I'm very irritated at the kindergarten teacher for being so thoughtless, by the way. I was an elementary teacher and if we used glitter I would ALWAYS clean up as thoroughly as I could because our custodian was the best. Custodians and secretaries typically have more power to make a teacher's life better than anyone else in the building. ",
            "I am a kindergarten teacher and I teach my children that our custodians do not clean up our messes from art projects, food, etc. I keep a dust pan handy that’s child size so they have to sweep. It makes me sad that glitter is misused. There shouldn’t be tons of it scattered in large amounts. To me that is poor management of whatever craft supplies is being used. There are so many ways to prevent it from being spread. Custodians help classroom teachers in amazing ways. I’ve had them clean up poop, pee, vomit, blood, old milk, and mice from my classroom. We are all a team and need to pull our weight. ",
            "Our high school custodians are great. I routinely stay after school because of sports, and I know for a fact that the top floor guys have an old school boombox they blast jazz and ACDC out of.\n\nWeird combination, but whatever works I suppose. ",
            "That principal is also a C-U word, but it is not custodian!",
            "Having your union back you is good. More voices backing your claim might (\"might\") get your principal to back down. Best of luck to you! ",
            "I am a middle school teacher, and on behalf of all other teachers out there, thank you for all the hard work you do to make our schools presentable and clean. We can't do our job without you doing yours. I do whatever I can to make my hallway custodian's job easier, such as having my kids police a two foot radius around each desk for anything that doesn't belong there. Yes, some trash escapes them, but not as much in other rooms I've walked in on.",
            "The teacher should be spending their time teaching the messy kids to respect others. Custodians are people too. My teachers always made us clean up after ourselves in elementary. ",
            "I remember always liking the cool custodians at school growing up and talking to them. But I haven't thought much about what my interactions with them will be like as a teacher since I got to uni. Thank you for reminding me that there is a responsibility for the teachers here. I will now be thinking about that when I'm in my teaching placements and as a teacher after I graduate. ",
            "When I was in college to become a teacher, more than one professor said that we HAVE to make friends with the custodians. And they were right.\n\nIt’s baffling to me that a principal would behave that way toward you. ",
            "It makes me sad that you have to thank people for appreciating you. You are legit the glue that holds the world together. I spend 8 hrs sitting at a computer, eating, and leaving crumbs everywhere. I try to be clean but I know I'd be a bumbling mess living in my own filth without custodians/housekeeping. I don't just appreciate you, I admire you. You are amazing and if anyone wants to devalue what you do they can live a week without you and come crawling back through their heaping piles of Nast. \n\nEdit: I like to think I can spell, I cannot",
            "My kids clean our room by sweeping, mopping, washing desks and sometimes taking trash. It is not our custodians job to tidy. They do deep cleaning that is considered “unsafe” for our kids to do (like bleaching bathrooms, etc). They aren’t allowed to get their things for the end of the day if they haven’t cleaned up. Also, our custodian was out for a couple of days due to illness and since we are the oldest in the school (8th grade), we took care of emptying trash and help ing out. Granted it is a small charter school with only 12 classrooms, but it is important to teach the kids that it isn’t anyone’s job to clean up after them. ",
            "Bro as a housekeeper I understand how hard it is to be heard and everything you try to improve on is considered a complaint. When you do get noticed and appreciated it's the best but for the work that's done compared to the rest of the staff it's severely underpaying for the literal trash and metaphoric trash we put up with. ",
            "25.8 is 25mins and 52 second btw\n0.1 = 6 secs\n\nEdit am fool 48 seconds",
            "I don't remember kindergarten being that fun...wish I had been in the glitter class as a kid. ",
            "Good for you! School custodians are way too under appreciated. I can’t even imagine some of the crap (literally) you guys have to deal with, on top of being treated like 2nd class. ",
            "I love that the answer is that you need more supervision.  You clearly need more time or some help.  (Or a ban on glitter!  [Perhaps it causes cancer or something...\\)](https://www.google.com/search?q=glitter+causes+cancer)  Ask your union about hazardous waste pay.",
            "Sounds like teacher should be teaching her students how to clean up after themselves. ",
            "I'm currently a custodian. I'm actually sitting in our office now on break. We're not unionized, nor are we well managed. I mean that at every level - literally from the top down its a shit show. There's no SOPs on how to do anything in the whole district. Some locations do it one way, while others do it another. Which leads to a whole lot of work that really has no oversight. I guess maybe this worked fine in 1960 but I'd do just about anything to have this job unionized. \n\nWe collectively get shit on by everyone. Literally from our buddies in maintenance to pta, to teachers and office. Any time there's an issue it's the custodians fault because everyone just hands us their work and issues. Definately getting out of this job ASAP. My hats off to the guys who do this for decades. Ive been here around 3 years and I feel ive aged 10. Where I live It's truly a thankless job, where people arent afraid to throw you under the bus in a second. Our district doesnt even offer a livable wage either. Yet DO sits and wonders why they havent been able to hire a single custodian for nearly 11 months now. Which at least gives me job security.",
            "If you give custodians shit you're just a bad person tbh, and beyond that she's a shit boss who doesn't respect her employees. ",
            "I appreciate unions.  If it weren't for that, that asshole would have likely fired you and found someone else to do the work.  Fuck right to work states (love you Montana)",
            "I used to work as a lunch lady and subbed as a janitor when the school needed. I took the lunch room job bc I wanted to have the same days off as my kids when they were younger and I loved it honestly-summers, holidays, snow days, and weekends off! Who wouldn’t?. That being said, I definitely know the feeling of being looked down upon by other personal (teachers, administrators) because they consider your job position in a school to be below theirs. However, sweet karma came when my kids were older and I started my career as a Sheriff’s deputy. I have since seen two teachers who acted in this exact manner behind the same bars of the jail I work for (for stealing school funds nonetheless) and I have to say it made me smile perhaps a little bit more than it should of. ",
            "As a kinder teacher, I know how the school treats the custodial staff. There are always the same two calling off last minute for vague reasons and that means the rest of the crew has to cover them - with no extra time or pay. I always have my students clean as much as they can and we only ever do glitter in small groups at my teacher table. Plus, the vacuums they are given to use are shit - not electric and basically just push everything deeper into the carpet. \nI love my custodian and we make her birthday cards and thank you cards to try to show our appreciation. I explain to my students her role and how much of a help she is to our classroom. Not only does she clean my room every day but also is often called if one of my student’s have an accident (which sometimes is not just #1...). You have my upmost respect! ",
            "High school student here, regardless of what anyone else says about you, you guys do wonders.",
            "My grandpa was the head custodian at an elementary school for years and years. He lived basically on the campus and had to chase people out bare handed on a regular basis and he helped put out some fires. Basically, he put up with some shit. \n    \n\nI can tell you right now that he would have done exactly what you’re doing. I hope those kids and teachers appreciate you, and if not please know that I do! ",
            "You’re the salt of the earth ... know that even strangers appreciate the fuck out of you. ",
            "I’m a senior and work in stagecraft so I talk with the custodians a lot and I have got to say they are the nicest people in the school. I know teachers that care less about the students than the custodian. Never once has a custodian been even slightly rude. Shout out to op and all the custodians out there. ",
            "I'm working at an IT company and most people barely greet our custodian. I do, and I also often stop for a short talk when getting a tea or a coffee. She's probably one of the nicest persons in the whole company.\n\nAnd as my my also worked as a custodian for a long time, I really can feel ya.",
            ">it's nice to know you treat us like real people\n\nboi without you society would collapse wym real people\n\nlike imagine farmers suddenly quit, how would we cope",
            "Custodians / the company or school handy man are the people you should always be friends with. The are usually full of knowledge and very nice.\n\nAt my university campus the handy man was such a resource for us in the student union that you can't begin to imagine. ",
            "Always go to your union BA right away if something like that happens, that's what the union is there for brother!",
            "I read union as onion and got very confused",
            "What a rude teacher! My son is in special education and if those kids can clean up after themselves, surely these kids can too. Just unacceptable. OP has got to do what needs to be done. ",
            "The janitor at the first school I taught at was the only person I legitimately liked. I know just how hard y’all work and it’s a tragedy that room is so messy. She didn’t even have the decency to leave you candy or anything?\n\nI always left my Janitor stuff to eat along with cleaning up 70% of the mess myself. I felt it was the least I could do. ",
            "Wow what a cunt",
            "I teach middle school.  Custodians are God’s.  I cook for mine ALL the time!  ",
            "Talk to the teacher. I’m a teacher and I’m aware that wonderful people like you clean up everyday and I try to clean up as much as I can. Let her know! ",
            "So you are saying, that instead giving you extra time for cleaning, or hire someone to help you, they are gonna pay more to someone that will scream at you? For sure no one would do it for free. \nSad :/\n",
            ">They are looking at increasing supervision now..\n\nWat",
            "When I was a custodian years ago at a large church that had sunday schools , pre-schools, etc. we called glitter \"God's Love\" because it is everywhere, and in everything. Nothing you do can remove all of it.",
            "I believe the politically correct term is “Master of the Custodial Arts”",
            "One rule in working at school, don't piss off the custodian/maintenance people. They're almost as important as the office assistants. Those people keep the school running, not admins hah",
            "I work at a medium sized branch of the USPS. Our 3 custodians are easily the most loved individuals in our office. Myles, Marty and Dan if you're reading this WE APPRECIATE YOU!",
            "A real MVP indeed. Keep it up",
            "Bless the custodians at our schools. We love you for all your hard work and dedication. You don’t get appreciated enough. ",
            "Ah I used to clean health clinics including free ones in the evenings and sometimes they were just straight up nasty. People literally leaving crap filled diapers from sick babies in the sitting areas. I'm glad I don't do that anymore but I have a new appreciation for those who clean public places including bathrooms. Thank you.",
            "I think everyone is missing the biggest point here: \n\n&#x200B;\n\n**FUCK GLITTER!** ",
            "Fuck the principal. Without you and your crew/tools our children and teachers would come to school/work in a filthy shit show. I sincerely appreciate your work. Fuck that dumb principle bitch. ",
            "I learned early on that the two people in the school you do not want to piss off are the secretaries and the custodians. Be kind to them and your life goes much, much more easily. \n\nIt's never a good idea to irritate someone who can decide to DELIVER trash rather than carry it off. ",
            "My kids pre k goes though 2-3 small tubes of clorex wipes a week. They litterally take time every day to do a clean up and wipe all the tables and chairs, the toys. Its to help the janitors at the end of the day. The kids do a pretty good job",
            "The kindergarten teacher should be playing the clean up game everyday. I know it’s not really the teachers responsibility to teach children to be neat, but it’s always a great integration into the daily routing to clean up after crafts and such. ",
            "Kindergarten age is old enough for kids to start learning how to cut down on mess, & how to clean up after themselves - at least in a cursory manner - purely to get them into good habits. Yes, the room will still be a mess, but it won't be as bad.",
            "My custodian in highschool was awesome. All guys school, he would do stuff that would crack up 15/16 yr olds. Then boom ghost as soon as a teach realized we were laughing at the door",
            "As a teacher, I always try to sweep my room before I leave in order to ease it for our custodians.  Thanks for all you do.  ",
            "I have been an elementary school teacher and I have to say that teacher is an idiot for letting them have glitter. What are you thinking. You should have asked the principal to ask the teacher not to use glitter any more. ",
            "This is teaching people to not clean after themselves, it is everyone's responsibility to do their part in the best manner they can. \n\nFor example at home, I don't do the dishes but my aunt does.\n\nSo i try not to make a huge mess or use only a minimum of 1 cup or 1 dish and re use it and not make a huge mess because i'm considerate that she washes those things after me. \n\nI don't go over board and use way more dishes that I need to because I know my aunt cleans it up.\n\nPeople need to be considerate and think of other peoples feelings and not just themselves, that's called being selfish.\n\nSomeone needs to teach those kids to clean up after themselves, or they'll grow up spoiled as hell.\n\nYour principle is a fucking asshole also, I'm completely on your side on this one man 100%",
            "I didn't even know the guy was called a custodian. But this dude Damien who was what i called the guy who fixed the school. He would make alot of the kids in my schools day better just a funny guy from Northern Ireland doing his best not to swear in front of the kids ",
            "I can remember going through school and the teachers would have us pick up after ourselves and put our chairs on the tables to make the custodian's job slightly easier.   \n\nI think that's where we are losing hope in this world : consideration for others.    \n\nNo, it's not my job to pick up after other people, but why make it harder on the person who does have the job?  Don't be a lazy fucking shit and think of others, basically.  Teach it.",
            "As a parent who has had to enter the kindergarten washroom, you're a soldier. There's never a way to determine how long it'll take to clean if there are children, old people or sick people involved. \n\n",
            "I do custodial at a high school. My crew and the teacher have a great understanding about that kind of stuff. But there is always that one teacher that takes issue with things and refuses to change. I know you pain. Good luck. \n\nI am interested in the run calculators you use for your buildings.",
            "At my old job I used to make stuff (beer and cookies) at Christmas for my fellow colleagues but the first people I all ways put on my list were the cleaners.",
            "I worked as a floor tech (fancy janitorial title) in a hospital for a good little while. I just wanna say that, for what it's worth, you have major balls for taking action instead of settling into compliance. Good job and keep up the good work cause we all know what little shits kids in school can be.",
            "Good on you! I bet that felt amazing!! ",
            "I had this at the hotel I worked at and fought tooth and nail about their damn rules. Whether a room is just a touch-up, linen change or complete tear down, they wanted it done in 30 minutes. 14 Rooms a Day. Our Carts hold enough linens for four beds. Running to the laundry room for linens they may not have takes 5.  \n\n\nThey never understood. Why should they. This was on a university, the staff all had business degrees. And when you get a degree, you don't listen to anyone who DOESN'T have a degree, no matter how much firsthand experience and evidence you supply.",
            "You are on the right and I hope things turn out good for you.",
            "Here’s a novel idea, teach the kids to clean up after themselves. Hmmmm",
            "Glitter is banned in our kindergarten room. You would love it!",
            "Technically, wouldn't 25.8 minutes by 25 minutes and 48 seconds, not 50 seconds?",
            "I felt with you until I read should of. Now I despise you.",
            "Holy crap.... I clean a HS and if they ever start timing us like that everyone would quit. I'm sorry your work environment is like that. Have you looked into other districts? ",
            "Damn, how many times do they get to play with glitter? In my entire memory of kindergarten I think we might've broke the glitter out once or twice but it never got all over the place like you're depicting. ",
            "I would just dump garbage and toilet cleaning water on that principal, then hand  her mop, broom and tell to clean that glitter while I stand over with stopwatch.  Stay strong, OP!",
            "The way I have seen this dealt with is to state the amount of time it requires you to clean up a room with glitter vs without and then asking them how to prioritize the rooms you clean. Then whatever they say it was their plan so can't be blamed if work isn't finished ( you told me to clean. X first and X took Your minutes)",
            "Right, because micromanaging what couldn't be managed in the first place with reasonable management-to-employee relationship skills will fucking fix everything!\n\nYou keep doing what you're doing - it's not your fault your employers are too lazy to investigate further than their policy.  Your union's going to push their shit back in.",
            "You’re lucky. I’m a facility tech at an elementary school and we only get 15 minutes a room doesn’t matter if you’re doing a portable or a bathroom 15 minutes. ",
            "Had the same issue when I was a custodian at a middle school. I always wondered why the principles would disrespect and piss off us custodians. We literally allow the school to function. Not like anyone else would clean the bathrooms or take the trash out. \n\nSure thing though boss! I'll work my exact time and nope I'm not helping when the parents come wanting meetings with you because the school their children are attending is absolutely disgusting. ",
            "It's already bad enough school districts skimp out on good cleaning supplies. The least they can do is help out with details like this. ",
            "I recently learned that Canadians call districts boards. Not sure if this helps anyone else ...",
            "That’s a poor ranking system..... tell him this.... if one day you take 35 Minutes to clean that room, and the next day you take 15, that’s still gives you the 25 minute average time between the two ",
            "That kindergarten class needs their own damn vacuum.  Kids can vacuum.  ",
            "They love to clean. It’s a break and it’s a grownup job.",
            "You’re completely right in this situation. The adults working in that kindergarten room are being completely unreasonable, unprofessional and inconsiderate. They should be teaching students to clean up after themselves and glitter is something that should be used by adults only, not four and five year olds on a daily basis. I hope that this gets resolved. Get as much evidence as possible to support your case! ",
            "I think you should have go-pro'd the whole shift, if it was possible.\n\nNo doubt the kinders are going to be the messiest of the school and require the most attention.\n\nCould you shave time off the other classrooms to donate more time to the kinder classes?\n\nBTW, you're not an invisible member of the school faculty; we parents appreciate your efforts and your voice is being heard.\n\nedit: THIS > [https://www.reddit.com/r/gifs/comments/9p2oqt/kids\\_in\\_elementary\\_school\\_hold\\_a\\_surprise\\_party/](https://www.reddit.com/r/gifs/comments/9p2oqt/kids_in_elementary_school_hold_a_surprise_party/)",
            "Everyone likes the custodians in my school lol, we eat lunch with them a lot, one of them is practically my best friend",
            "Thank you for your service <3",
            "That’s inexcusable behavior coming from your colleagues. My thoughts are with you. I hope it gets better! ",
            "As a night custodian at a high school I can say our areas we have to clean are complete bullshit for the time we get. We have one person for our gym that includes the main gym and locker rooms. One person for our pool and the locker rooms. One for the main section of the school about 25 class rooms and sets of rest rooms. My area is a complete outside stadium includes a full size football field 3 baseball fields 2 locker 2 large restrooms 4 tennis courts and home and away stadium seating. On top of that I have the new side of the school that has 9 classrooms and 4 restrooms. When I say restrooms I mean 6 toilets for women and 3 urinals and 2 toilets for men. So essentially my area is about 3x the size of the other custodians. We need extra help but our district allows custodian based off of class size not facility size. I can tell you right that I Never finish my area. I always have my boss riding my ass asking why I don't have enough time when we are all on a 9hr shift every night. It sucks there's nothing you can do but get over worked underpaid and yelled at constantly. ",
            "This bothers me so much.  I teach 1st grade and on Friday my kids left the room a mess.  I asked our custodian to not clean it because that will be the kids responsibility when we come back.  \n\nI cannot believe a teacher would leave the room such a mess all the time.  So disrespectful.",
            "I just started working at a school, I used to be a custodian, I thank ours every time I see her. It goes a long way when you appreciate someone. ",
            "Also a school custodian rn, sorry you have to put up with that toxicity, hang in there. You should reach out to your teachers,  most are very understanding about glitter and what not.",
            "Thanks",
            "Custodians get real shit sometimes. Hope you are well by now.",
            "I think on this you would have been better served to ask the Principal for a solution in writting.  IE \"Should I just leave the room as it is when my time is up?  Would you like to allocate more time to these rooms? And can I get this in writing please?\"\n\nThen if she refuses and sends you on your way you contact your union and start that process after documenting how long it takes to clean these rooms. \n\nI think just taking it on yourself to stop after the budgeted time is going to be a tough sell, and has the possibility of biting you in your butt down the road.  Always CYA when possible.  Let other people hang themselves while sticking your neck out as little as possible.",
            "When I was a teacher I had my students pick up at the end of the day.  No reason to encourage their laziness.",
            "You can do only accomplish thing in the time allotted. Fuck everything else!! ",
            "As a former teacher im appalled. One thing our profs told us at my school was ALWAYS treat your custodial and admin assistants with a lot of gratitude and respect because it will make your life better. Dump on them and you risk everything going to hell. ",
            "Everyone else told you already, but just one more for good measure. THANK YOU ❤️",
            "My elementary school teachers had us clean up after ourselves (somewhat) then cleaned up some more after us while we worked on stuff. It wasn't a perfect cleaning job but our custodians didn't have to deal with that bs",
            "Where do schools still have custodians? I'm in Utah, and we have to clean our own classrooms each day.  The cleaning staff are only responsible for the halls and stairs.",
            "My wife is an art teacher, she has been teaching for 20 years. The person she always makes a point to be friends with, and treat with respect is the custodian. ",
            "Man, I was a contract based janitor in my town for about half a year before getting a new job, and I feel your pain. People treated me like trash, ironically. And also all the passive aggressive notes they leave at the end of the day for you, yeesh. ( I went in after the place closed)",
            "I admire the work custodians do. Thank you soooo much.\n\nI taught kindergarten last year and it takes work to teach kids to clean up. Still, I spend time at lunch and after school tidying and making it so the custodian doesn't have to mother my students. \n\n",
            "Union? Are you contracted by the school system? I'm a custodian in a middle school but I'm in a small town so i guess things are different. ",
            "as a fellow custodian, good luck to you.",
            "My kids school has a competition every month. Whatever class has the cleanest room get to hold onto the golden plunger( last year) and golden dustpan(this year). I also think they get popsicle too. It is a fun way of encouraging the kids to pick up after themselves.  \nOn the other hand cover your ass and keep your union involved. That's why you pay dues.\nEdit: Thank you for your service. I hope everything works out for you.",
            "This is amazing. Good for you for sticking to your guns. ",
            "\n>I put my phone by the door recording me cleaning the room, at the 25.8 minute mark (that would be 25 mins, 50 seconds) my alarm went off. I dropped everything, grabbed my phone, turned the light off and locked the door.\n>\nIt would be 25 minutes, 48 seconds.\n",
            "We used to clean our classrooms ourselves, not some extended kind of cleaning but we made sure, our teacher made sure, that the custodian would have a minimal job to do. It’s not the kids fault, kids are kids but the teachers shouldn’t just teach the curriculum but also educate them",
            "I only taught for a year before needing to switch to an at home dad for my daughter, but I made sure to go out of my way to make sure the custodians were thanked and appreciated for their job. Most important people in the building!",
            ">as glitter takes months to get rid of\n\nYou don't have to tell me that. Someone dumped a giant coffee can full of glitter in my hair in eighth grade.",
            "Thank you, you absolute fucking marines. I looked around all the schools I’ve ever attended and always thought “man it’s gonna suck for whoever is gonna clean this up.” Thank you ",
            "I'm so sorry they were dicks to you it! I have to clean my own toddler classroom every night and be done by six while I still have kids running around. I'd be blessed if we had custodians. Y'all the real heros ",
            "I cleaned medical clinics while I was in college. It was often a thankless job with doctors and nurses making crazy demands. It was also common to hear, \"don't worry about that we pay somebody to clean up.\" \n\nNow, I greet every custodian at work and try to minimize my mess. The job can be emotionally and mentally trying at times. It gets even worse when you feel unappreciated and disrespected. So, I try hard to always say thank custodians and do little things like take them food if we have some kind of event. Without them we couldn't do our job and they deserve some form of recognition. \n\nI hope everything works out for you OP.",
            "Sounds to me like you did your job perfectly.",
            "You seem like a well rounded individual for a janitor. Perhaps a job in electrical might suite your needs😎",
            "Man that’s crazy. I feel like the custodial staff I’ve know at schools have always been treated a lot better then this. I know my family that teach are always pretty conscious of them and try to make their jobs easier by keeping things as clean as they can. \n\nInsane though that you have to deal with this.",
            "This reminds me of one of my previous jobs as a barista. The personnel worked overtime there as it was their main profession (no studying beside the work, etc.) and had a fixed salary. They expected me, as a high school student, to work overtime without pay just because they did. Started closing up shop at 2200 on the dot, as according to my schedule, but they did *not* like that lol.\n\nedit: I also remembered just now that they liked putting me on +30h a month even though it said 20h max in my contract… malicious compliance sure helped me get through that stressful period\n",
            "Am I being blind or are you being paid for a break that you then don't have in your schedule?",
            "I remember that back in kindergarten/elementary the whole class wasn't allowed to leave the school untill we had properly cleaned up all our mess. \n\nI feel like more schools should implement something like this.",
            "At least you guys are unionised thats a plus but hahaha nice",
            "I noticed the edit and I used to have a custodian in my elementary school who was absolutley HUUUUGE (tall, not fat) to all us little elementary kids, he was one of the nicest people ever and we all loved him, at the end of my third grade I think he either got transferred somewhere else or moved away because I never saw him again and all my friends, me, and most of the school were a bit sad after that, but he was seriously one helluva guy"
        ]
    },
    {
        "post_id": "f2gr4p",
        "author": "apocolypseamy",
        "title": "\"Try to be more like the other tellers\"",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f2gr4p/try_to_be_more_like_the_other_tellers/",
        "score": 15510,
        "num_comments": 698,
        "created_utc": 1581461671.0,
        "selftext": "I worked as a bank teller. The other tellers were all female. Our Sales & Service Manager expected us to greet customers warmly the second they entered... from across the bank.\n\n\"Helloooo thereeee!\" \"Hiiii!! Welcome to US Bank!\"\n\nIt was even turned into a competition- when he heard/noticed tellers greeting customers he gave them a 'point' on his tally\n\nMy greeting strategy was to wait for initial eye contact after they entered the building and began approaching my window, then say \"hello!\" in a friendly way, and give a polite little head nod and smile.\n\nThis was apparently unsatisfactory. I was talked to because I wasn't bubbly enough. It was pointed out to me how well the other tellers were greeting people walking in, how many 'points' they all had accumulated, and I was told I needed to be more like my female co-workers.\n\nThis sounded great in theory, but I am a 6'4\" 290lb male and I knew it would be easy to show them the error of their ways.\n\nThe next person entering the bank received a bellowing sing-songy \"HIIII THEREEEE!!! WELCOME TO US BANKKK\" from 60ft away, with a dozen people in between.\n\nTo say it startled the shit out of everyone in the bank would be an understatement.\n\nI was informed my polite \"hello!\" & nod would be fine going forward.",
        "permalink": "/r/MaliciousCompliance/comments/f2gr4p/try_to_be_more_like_the_other_tellers/",
        "comments": [
            "I hate being yelled at when I walk into a place.",
            "It creeps me out when I'm greeted as soon as I walk through the door. Like, give me a second to adjust to my surroundings! I prefer greetings that happen as I approach an employee. If you have to shout at me, I'm not close enough yet. If you see me and I see you, a smile and a nod is all you need until I'm closer. And once I actually had a bank teller stop in the middle of our conversation (interrupting me talking) to greet someone else as they came through the front door. It was so weird, I forgot why I was even there for a second.  Lol",
            "Can I just say that that bank sounds TERRIFYING! Like that store Lush that I can't go into cos the staff are so on top of you immediately!",
            "Not sure if OP's bank or other banks do it for this reason, but I worked as a teller and we were trained to greet people as soon as they walked in the door for security reasons. Management wanted people coming in to know that employees were aware of them and paying attention to them. I think the thought was that it would deter potential bank robbers who were trying to avoid drawing attention. Your bellowing, sing-songy voice would certainly be one way to deter robbers. Hahaha.",
            "Maybe you needed more pieces of flair.",
            "The new tellers at my credit union do this, but they usually knock it off after a few months. \nOne kept greeting me and asking for my account number while I was still on the other side of the lobby. Every time, I told her I was not going to scream my account information across the room.",
            "Fully expected you to come to work dressed as a woman",
            "(originally posted [as a comment](https://www.reddit.com/r/TwoXChromosomes/comments/f29uh2/the_new_receptionist_doesnt_smile_at_me_every/fhbni4f/), was told y'all might like this)",
            "I understand why RETAIL shops greet me when I enter (so I know THEY know they see me/security/shoplifting deterrent) and I’m OK with that... maybe the bank thinks this will also work on would be bank robbers? “YOOHOO!! BURLY GUY WITH THE SAWED OFF SHOTGUN? WELCOME!!! HAPPY TO TAKE YOU AT MY WINDOW!! YOU WANT THAT ALL IN 20’S?”",
            "Many many moons ago, I worked for BK and got shoved in the drive thru, well I always greeted the car with a \"Welcome to BK, let me know when you are ready to order\", I did this for months until one day the store manager was working the shift and she told me that I should just say \"Can I take your order?\" so as long as she was there, I did that, but when the regular manager was back, i was free to do it my way!",
            "Visiting Germany and Austria, one piece of culture shock is that whenever you enter a shop or business you're supposed to announce yourself and greet the shopkeepers, it felt so strange to do. Took awhile to adjust and still never felt quite right",
            "Fun fact: actively engaging with people as soon as they walk through the door weeds out a lot of sketchy folks, because they don't want the attention. It's demonstrably effective and fairly safe to do, I've even seen some of the thrift stores around me employ this to cut down on shoplifters. I've used it myself back when I owned a business, shower sketchballs with attention and they leave pretty fast.\n\nhttps://archives.fbi.gov/archives/news/stories/2009/august/safecatch_080609",
            "My wife was fired from her bank job for being too bubbly.  They kept a more stern, serious professional demeanor.",
            "Honestly, I probably would have turned around and walked away if I was greeted from across the bank. Or at the very least, if going to another office was unfeasible for some reason, I'd have done my best to avoid such a rude teller.\nI definitely like your way much better.",
            "I have a counterargument to your awesome story. I usually worked at  bank branch. Our main branch needed a personal banker to fill in so I was sent there. It. Was. So. Quiet. A funeral home would have been livelier and louder. I could not help any client because the 2 or 3 other personal bankers wanted blood if you dared to take their client. Well after they gave me a sweet old little lady who I spent 20 minutes helping to balance her checkbook, I made the horrifying mistake of ripping a piece of paper in half. No customer was in the lobby. Apparently 2 or 3 tellers fainted from my behavior, 5 other employees clutched their pearls, and one ran to the manager so fast to report me. I was taken to her office and lectured about 3 minutes on this unprofessional behavior. I refused to work there again. Later on I became a branch manager myself and had to go to the main branch frequently for meetings. I just walked past them as fast as possible. Funny thing was I technically had more clout than the bankers and tellers and was on equal ground with the manager who scolded me. Meanwhile my branch was in Walmart, we never got a break and half the branches called me for approval when most of the other branch managers left. But I worked right along and did the same things my staff did and supported them when a customer complained. And they would have killed for me. One time we were slammed and my regional manager stopped by and casually asked if he could help (You know he did not want to, he was beneath that) but my assistant manager said sure Tom, you can start waiting on the customers and answer the phones and sure enough he did! I was never prouder of her:)",
            "I love it! I think most customers hate being yelled at when they walk into businesses. I would hazard to guess all employees hate yelling greetings when we walk in too. \n\nWe used to joke around the marijuana dispensary that this sort of greeting just wouldn't work there. \n\nUs: Welcome to Pot-R-Us Dispensary. Wanna buy some pot today? We got joints, we got resins, we got brownies, we got potcorn . . . \n\nManager: Please stop\n\nUs: Pothead Emporium, we roll them, you toke 'em.\n\nManager: I'm BEGGING you, STOP!\n\nUs: Maryjane's Secret Garden, please be welcome. Can I interest you in a bong today?\n\nManager: Next person who comes up with another one of these stupid sayings is going home ASAP!\n\nME: Weed & Wenches. We blunt them, you blaze them! \n\nManager: OUT! \n\nI should mention, I was in charge of the website listings. :D",
            "I am a US Bank customer and have noticed recently the new creepy, rabid, screechy welcome immediately upon entry.  I don't care for it.",
            "This isn’t something that happens in my country thank GOD\n\nCustomer service people here DONT greet you unless you go up to them. In fact they’ll leave you tf alone which is great because in England we’re all a bunch of antisocial twats",
            "Ahahaha, that shit made my day because I'd do the same thing maybe throw in a falsetto.",
            "I loath places that do this. I don't want to be ganged up on as soon as I walk into a business, especially a bank.",
            "This is my favorite post of the day!  Thank you for the giggle!",
            "Honestly I would have continued to fuck with that manager. \n\nOh did I do that wrong? Let me try again...\n\n *Voice so gay Elton John looks hetero*: \"Hiiiii there! Welcome to the bank\" \n\nStill wrong?  Let me James Earl Jones this bitch.\n\nOrder me to go back to the smile and nod?  If so now you are implementing a policy that singles me out, I believe that is an equal opportunity/sexual harassment dispute waiting to happen.\n\nIt is said you can't fix stupid, but it sure is fun watching it fall to pieces from its own policies.",
            "GAWD!\n\nSometimes, you gotta give 'em what they ask for, so they can better appreciate what you were doing before, and leave you TF alone.",
            "This is great lol",
            "Oh My God....I am \\*dying\\* here....I can only imagine how many people would've jumped to the ceiling upon hearing you call out.\n\nHow did your coworkers react when they heard you calling out like that?",
            "Lol. I had kinda hoped that you would go with a woman's wig, and high pitched voice so that you were \"one of the girls\".😂",
            "We need to talk about your flair.",
            "Maybe the way to stop all this greeting when customers enter an establishment is for customers to loudly respond: THANK YOU FOR WELCOMING ME!  I FEEL AT HOME NOW.  MAY I TAKE MY SHOES OFF?",
            "This sounds terrifying! In the UK banks are super quiet whispery places. I would be so freaked out if someone spoke to me like that.",
            "Worked a retail job where we they tried to push those annoying membership keychain cards on everyone. No offense but attractive girls have an unfair advantage w that shit and our performance and raises were almost entirely based on how many signups we got. There’s no happy ending to this story. That job just sucked and I eventually quit. :)",
            "Worked at a bank for six years; hilarious",
            "This reminds me of Grand Theft Auto 5 online. When you buy a hangar at Fort Zancudo, There will be a random soldier that will say, \"HEY. HEY. How you doing?\"\n\nUse the same tone of voice a bank robber would use. \n\n\"WELCOME TO THE BANK. I SAID WELCOME TO THE BANK. Have a good day.\"\n\nUse a low pitch voice. Use a high pitch voice.\n\nDo your best Samuel L Jackson impersonation.",
            "[Welcome to Costco. I love you](https://www.youtube.com/watch?v=Z8zNsUTWsOc)",
            "As a similarly sized man, this brought a big belly laugh out of me. I've had similar experiences with employers who don't seem to realize that not everyone is meant to sound like a 5ft tall cheerleader.",
            "Can we talk about Penn Station for a minute and the million questions they ask?  Maybe it's just mine?  Right when I walk in the door...\n\n\"Welcome to Penn Station!\"\n\n\"Hi can I get your name?\"  \"Is it for here or to go?\" Hold on I haven't even looked up at the menu...\n\n\"Lettuce, mayo, onion, tomato?\" \"6, 8, 10, or 12 inch?\"\n\nI'm trying to tell you.\n\nWould you like a hot fresh chocolate chip cookie?  How about a fresh squeezed Lemonade?  Pepsi product?  Are you part of our loyalty program?  Would you like vinegar with your fries?\n\nI even try to politely tell them I don't know want anything anything so those poor souls don't have to repeat it but they just ignore it and keep going.\n\nThey are such a well oiled, fast paced machine it gives me more anxiety.  I love them, but the place stresses me out.  \n\nWe can all just relax.. everything is fine...\n\nAnd then I start to leave.\n\n\"Thanks for stopping by!\"",
            "WILL YOU JUST LEAVE ME ALONE? I'M BROWSING! MAYBE I'LL BUY THIS BOOK, MAYBE I WON'T, BUT YOU CANNOT INFLUENCE ME ONE IOTA, NOT ONE JOT! NOW THAT I'M DONE WITH YOU, YOU MAY GO!!",
            "This made me laugh out loud, imagining the bellow across the bank. Sure gives me the warm and fuzzies to be hollered at from across the room!",
            "Oh behalf of a customer, thank you. I hate hate hate being greeted before I make eye contact. Let me approach you instead, no matter how much you weigh or how booming your voice is. Give me, like, 10 seconds to collect my thoughts at least. But this is why I just use the ATMs now. I miss the human interaction, sure, but it’s so misguided. I don’t need to be talked at when I first walk in; it’s disorienting and I refuse to talk across a room.",
            "I think it would have been even better if you had dressed like your female coworkers.",
            "Lol, if a business in a Nordic country was this \"bubbly\", they'd go out of business in a month. Who the fuck wants their clerk to be a manic pixie?",
            "As a man close to your size, I think my reaction to being told I need to be more like my female coworkers would be to just file a sex-discrimination complaint with the state.",
            "Had a similar situation at a retail store with three B's that may have things for the bed, the bath, and even beyond. I was told that when I was on the floor I was to approach guests every ten minutes or so to ask \"What can I help you find today?\"\n\nYeah that shit got old quick.",
            "I absolutely despised my previous workplace because they wanted me to greet every person who walked in. Keep in mind that people walking in are not only 20 feet from my desk, but not facing me NOR heading in my direction when they walk in. (My desk was at a 45 degree angle from the door and people generally walked straight past it unless they need account info.)\n\nMy previous manager had been ok with people greeting others as was comfortable. Head nod? Sure. Cheerful wave? Why not. Smile and head tilt? Sure. Quiet Hello or How you doin? Absolutely!\n\nBut the new one was absolutely toxic and demanded that we all say \"Welcome!\" or \"Hello!\" whenever anyone walked in. It was borderline rude and VERY obnoxious.",
            "Jesus when will the \"retail\" world learn. Toouch customer service is a bad thing. Exactly why Amazon owns it now",
            "I would close my account and change banks if this happened to me. I don't need anyone saying yoo hooo hi cutie when I enter a bank. It's meant to be a professional environment.",
            "the eye contact thing is how it should be done. i never say hi until i make eye contact with somebody.",
            "I'm just thinking about the amount of tallying one guy was doing. Did they hire an intern for that?",
            "My local chippy (fish and chip takeaway) It is \"What can I get you love?\", much better.",
            "Reminds me of a time when I was working in fast food, we talked a shy kid into calling out \"Order up!\". He sounded like a drill instructor barking out that order! A few customers stood up from their tables, and everyone in the restaurant was looking at him. We had a good time with that while he was there over the summer.",
            "I always thought that banks greeting you when you come in is to discourage a robbery. By greeting someone they know you're there, seen, and sized up.\n\nI just made this up on my own so it's probably completely wrong.",
            "This drives me crazy too. Let me get close enough where I can tell who exactly is greeting me. As soon as I step in the door, I am still doing my primal/instinctual & subconscious scan to ensure there are no hidden saber-toothed tigers or anything. Give me a few seconds.",
            "There’s a restaurant near me where they (like every employee) have to yell “WELCOME TO SHABUYA!!!” every time someone walks in. It’s so annoying.",
            "God, I hate when they do that. I just walk in, someone greets me, and I can't even figure out where they are. So I look around, see that nobody is within talking distance of me, and decide not to try to reply to the mystery voice. It makes me feel so awkward. Please just follow the social norms when it's easier for everyone including yourself.",
            "I would've shouted \"WELCOME TO THE BANK\" in my loudest drill sergeant voice",
            "I literally walked in a CiCis Pizza and walked out blatantly turning around because of the “deer in headlights” feeling with how aggressive they all welcomed me lol",
            "This. This is my favorite",
            "They want overkill? Give em overkill.",
            "I read your hi there in the exact same voice as Alex from Madagascar and it made the whole visual so much better, just this giant man screening in the middle of a bank in a slightly babyish voice and scaring the shit out of everyone, glad you got that cleared up the way you did, always satisfying to do so",
            "Recently I became a teller and during my training they explained it is a great deterrent for robberies. I greet from afar so they know I’m aware they’re in the building, not for customer service purposes. I’ve learned that some financial institutions can be vulnerable and precautions should be taken.",
            "When I read “all the other tellers were female” I thought this was going in a totally different kinky direction.",
            "Why in the world do managers everywhere think that people want this?? Please don't yell at me from the other side of the room. Whenever employees are forced to do this I want to look around, confused, and then say, \"Oh sorry! I thought I was at [competitor]!\" And turn around and walk out in full view of the manager, but I'm pretty sure the irony would be lost on them.",
            "The US is a creepy place",
            "Welcome to Costco. I love you.",
            "I imagined this perfectly. Lol.  Fuck those idiots micromanaging like that",
            "You sound like the best kind of employee.  \nGood on ya mate. :-)",
            "I hate to be greeted at door.    I think it is rude to stop a conversation with someone in front of you...to answer phone or gteet new person.   Nod and wave ok.  But keep your focus on your current customer.  Def dont approach me.  Im a huge fellow...yet im timid. (Not sure if right word)",
            "When one innocent person has to suffer before the higher ups in any capacity realise their stupidity",
            "Our general rule for greeting customers is “eye contact and smile at 10ft, verbal greeting at 5ft.” Make yourself approachable but don’t startle.",
            "Sounds like you need more pieces of flair. You do want to express yourself don’t you?",
            "My wife and I used to frequent a certain restaurant that focused on pizza (not Pizza Hut, though).\n\nThe staff would always call out a friendly “Hi! Welcome to [Pizza Shop]!” shortly after the chime on the front door rang out. (The delay, I suspect, was to give customers the chance to get inside first.)\n\nI got to the point where I would try to beat them to the punch by calling “Hi! Welcome me to [Pizza Shop]!”",
            "I was hoping the entire story you were going to end up going to work in a wig and women's clothing.\n\n\nAlso side note: Your boss is the reason I only use the ATM unless its absolutely necessary to use a teller.",
            "I thought this was going to end with you in drag. Good for you.",
            "I was a bank teller for a few months. Definitely tops the list of worst jobs ever. My least favorite part was being forced to swindle the old ladies (who came to the bank every single day) into opening credit cards they didn’t need or want. I mean, the same ladies would literally come every day, and if I didn’t try to force them into sitting down with the credit card people EVERY time, my boss was all over me. Made me feel like scum. I hated that job.",
            "I work in a cafe and they push this annoying greeting on everyone. They said we need more customer engagement, that we need to initiate conversation to keep our \"connection\" scores up (based on an email survey customers get). I hate it. SO. MUCH. One person comes in an immediately 2-3 baristas will start yelling different greetings all at the same time. I doesn't feel genuine at all.",
            "I worked as a teller at Wells Fargo from 2011-2014 before going into a few other positions at the bank and then moving into something entirely different. \n\nAs well as greeting immediately with “Welcome to Wells Fargo” we also had to use the persons name 5 times during each interaction, ask them open ended questions to try and sell a product. It was also mandatory to say say “value your business” somewhere in the interaction and here is the best part.....at the end of the transaction you had to say\n\nMr/Mrs Smith to ensure you are PLEASED WITH MY SERVICE is there anything else I can do for you today? \n\nAlso in college I worked at Abercrombie and was forced to ask every person who entered “Have you tried out our new sexy shorts” or something like that even to the 70 year olds in there with their grandkids. There was also a manual about the number of times per hour to spritz the mannequin displays with cologne. I want to say it was like 6 times per hour. I believe I made $7.25 per hour and got a $.15 cent raise 😂",
            "\"Welcome to Dominos\" is bad enough, but now with the new app we're supposed to yell the customers name, too.",
            "I haven't actually laughed out loud when reading a story in a while, but the imagery you provided was absolutely perfect! Great story and perfect malicious compliance!",
            "I have to greet people at my job, and I always get a little bit of anxiety because what if I time it wrong and seem overeager? What if it’s too late and then they awkwardly turn to reply? What if they completely ignore me (a thing that happens on occasion and drives me crazy)? There are too many variables and I am not the type of person who’s cut out for forced interactions.",
            "The whole American concept of being greeted as soon as you stoat in just makes no sense to me. An “awright,” “morning” or even just a nod as you wander up is more than enough anywhere else i think.",
            "Meanwhile in Japan:\n\n###IRASSHAIMASE!!!",
            "Yes, I get that at a chain thrift store near me; everybody who walks in the door gets a hail by whoever's at the register.  The employees are all underpaid and turn over quickly, so I know it's forced friendliness and really, kind of a turnoff.  Only one person can carry it off, and that's because she's friendly by nature and a joy to talk to anyway.",
            "I am also a teller, they try to train our mannerisms almost as much as Chick-fil-A with their \"my pleasures\"",
            "Man I would switch banks if I was yelled at from 60ft away lol. That's awkward for everyone.",
            "\"Welcome to Costco.  \nI love you.\"",
            "\"Welcome to Waffle House!\" \n\nYeah, no. I'm here because either I really need some coffee, or I'm drunk. I want my first interaction to be placing my order, thanks. (And it's gonna be one of two things: \"Order scrambled, cheese, raisin, make it a plate, scattered and covered well. Coffee, a glass of water, and I don't need creamer nor apple butter. Thanks.\" Or \"BLT on wheat plate, scattered and covered well. Coffee, a glass of water, I don't need creamer, but I'd like a packet of mayonnaise with my sandwich. Thanks.\" \n\nI tip well, but the waiters aren't making enough to holler at someone every time the front door opens. \n\nMy worst phone greeting disasters happened when I was in charge of training front desk agents at a hotel group. During the span of a few weeks, our group had opened two properties in one city (different brands,) built another branded hotel in another city 90 miles away, and bought a fourth property that reopened under our proprietary name. After a couple of times answering the phone and not knowing where the hell I was, I used the label maker to print a script and taped it to the front desk at each of our properties. That was a nightmarish couple of months!",
            "They kept trying that rule when I worked at Cracker Barrel. I get it, people enjoy the friendly atmosphere, but having a bigger due scream \"welcome\" from the furthest register (because otherwise I wouldn't have been heard at all) did not actually create the warm fuzzies for anyone.",
            "I work in a bank. Usually, greeting clients when they walk in is part of safety and security procedure. It lets people know you see them and potentially have  noticed identifying info in the off-chance they wanted to rob the bank. It is a deterrent. Robbers would prefer to go unnoticed.",
            "When the first Disney stores opened in the UK, the \"cast members\", used to walk around the store singing Disney tunes to customers.\n\nThis scared the shit out of customers, as we're just not used to store employees being \"friendly\".\n\nThey quickly stopped that, when the stores were empty, because customers were terrified of the nutters working there.",
            "I'd rather walk I to a bank and everyone leave me alone.  If I need help I know nwhere to go.  I just want to cash in my check and steal a free pen.",
            "I’ve experienced being the only customer in a bank and being greeted enthusiastically by at least 3 salespeople when I walked in. Made it super awkward to admit I just wanted to get some quarters...",
            "what if mandated store greetings like this are a way to get customers to turn their faces towards the hidden surveillance camera upon entering?",
            "Lmao that's hilarious, made my day!",
            "To Hell with that \"manager\".",
            "Well played good sir, well played. Slow clap",
            "The real question is: how many pieces of flair do you wear at work?",
            ">My greeting strategy was to wait for initial eye contact after they entered the building and began approaching my window, then say \"hello!\" in a friendly way, and give a polite little head nod and smile.\n\nOne key method of robbery prevention at a bank is to greet the person as soon as they walk in, don't let them get to the counter to write the note, change their mind before they've committed.",
            "I use to be the \"greeter\" at a bank in Canada. It scares everyone. It was also fun to see the people who clearly didn't want to talk to anyone but squirm to be polite and say hi back. \n\nIt was irritating for them to think by me saying hi to them that i could help them with their tellering needs, but I couldn't because I did other functions. I couldn't blame then though because this man was saying hi to them.",
            "You gave me a good laugh. Thanks OP.",
            "[removed]",
            "Lmao. I‘m absolutely glad that it isn‘t a custom anywhere in my country to be that exaggeratedly friendly.",
            "I am so glad my credit union doesn't make its employees do this.",
            "And this is why I don't go to your bank.\n\nNot you, the policy and those who follow it.",
            "I KNEW it was going to be US Bank before you stated it!",
            "HI WELCOME TO CHILLIS",
            "This actually happens? In the UK they just say nothing and let you approach them",
            "If a bank teller greets me I’m walking up to that teller. \n\nAt my bank the greet the next person in line",
            ">all female\n\nI was really hoping you were going to put on a dress and heels or something, lol.",
            "Hello, Mr. Yakamoto!  Welcome back to the Gap.\nHow'd those assorted tank tops work out for you?",
            "HI WELCOME TO SUBWAY!",
            "In hospitality (hotels) we have the 10/5 rule. At 10 feet away, we make eye contact, when they’re 5 feet away, that’s when you start greeting people. It works, otherwise it wouldn’t be a rule",
            "LOL so funny\n\nI hate at Best Buy when it seems like the workers are stalking you. Every corner you turn, \"Can I help you find something?\" No dude leave me the fuck alone.",
            "Lol...managers are not experts.",
            "We have to greet people when they get off the elevator. I just say hi. Sometimes \"hi, again\" when I've seen them multiple times lol.",
            "Shit like this is one reason why I avoid major banks. I'll take the normal humans at my credit union, thanks.",
            "If I went to a bank and got forcefully greeted on the regular I would find a new back immediately",
            "A Lush employee managed to intimidate/chase me clean out of the store by doing something similar, didn't end up buying a single thing. Which sucked because I was really looking forward to a bath bomb.",
            "This made me laugh so hard",
            "Why dont you offer to try again and next time use your deep voice if you have it, that would be even better.",
            "Why would anyone want that?? Female or not, I'd rather just have a small greeting... I've got social anxiety so maybe it's just me but I wouldn't really want that much attention drawn to myself in the first place. That's kinda dumb",
            "Here, in Germany, people who are employed to greet people at the entrance are a rare occasion and I'm really thankful for that. They are in fact so rare, that I was really confused when the mall in my city employed greeters for Christmas. Having 4 of those people at a single entrance, was also a little bit overwhelming.",
            "that's a big bank, I don't think that my bank even has 60ft from one side of the main room to the other, much less to the door in the middle.",
            "Hahahahahahahah oh this made me laugh hard!",
            "(A perfect example of why you don't need to greet every customer)[https://youtu.be/IEhHEOIYgMY]",
            "Norrrrmmmm!",
            "This is Webster Bank, innit?",
            "> enter branch\n\n> get ~~greeted~~ yelled at\n\n> turn around and leave again\n\nNot with me, no. Would annoy me too much.",
            "Love it.",
            "Cant stand the piahu banks that force their personality onto you. I really dont understand what they are trying to achieve.",
            "Welcome to firehouse!",
            "Try roasting them... you’ll feel better",
            "Why do people have to be like 12 right",
            "WELCOME TO UNIQLO",
            "awesome",
            "Nailed it! **Pats self on back**",
            "Do you happen to be named josh?",
            "#WELCOME TO MOE'S!!",
            "WELCOME TO MOES. still hate that they do that.",
            "Irasshaimase!",
            "Does the \"Sales & Service Manager\" still have a job??",
            "You got a greeting.  It started with, \"H.\"",
            "Thank you for calling Radio Shack.  Home of the Sprint store. My name is Blast338. How may I help you?",
            "Heck yeah",
            "Did you said it with a feminine voice ?",
            "HAHAHAHA OMG",
            "https://image.eveonline.com/Character/2119334478\\_1024.jpg"
        ]
    },
    {
        "post_id": "7k2s4k",
        "author": "ConfusedNakedBroker",
        "title": "Must buy breakfast for the team if you are late",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7k2s4k/must_buy_breakfast_for_the_team_if_you_are_late/",
        "score": 15509,
        "num_comments": 641,
        "created_utc": 1513373439.0,
        "selftext": "Little background here. I work with a large multi-billion corporation in logistics where we are largely commission based doing sales. Everyone here is in control over their own clients and book of business. We have managers, but they aren't there to run your book or micromanage, they are there to help motivate you and find solutions to things you may have not run into yet. If I don't come in one day or am late it doesn't hurt anyone but myself, so I work as much as I possibly can. Being a little late shouldn't be a big deal, but it got to the point a large chunk of the office was routinely showing up 10-15 minutes after start (I agree being late shouldn't be a habit, but they are only hurting themselves, if they don't hit numbers they will just get fired). Living in a central state and having mainly east coast clients means I am in the office about an hour before most people anyway. Well, my team manager enacted a rule where if you are more than 10 minutes late, you have to bring breakfast for the team (my team is 16 people). So everyone showed up on time last week, then Thursday rolls around and I called him to explain how my dog is puking and I will be 30 minutes to an hour late. He just replies via text I better bring breakfast for everyone. Even though I am historically there well before anyone, I was to become his first subject and example. I called to say no I cannot do that, Christmas is coming up and I have travel plans I need the money for. Well, he pushes back and says to bring it anyway. Now I'm fairly pissed as my team originally thought the rule was a joke and in no way enforceable... So an idea forms in my mind, I was not going to take this. I call up Einstein Bros and order 16 double egg and bacon sandwiches and a 16 large orange juices. When I make it in about an hour late, the team loves the gesture and my manager doesn't say a word as he grabs his oj and sandwich. Now here's where the fun comes in, our expense reports were due the next day in order to receive it by the following paycheck. I expense the full ~180 and submit it without saying a word to him. The branch manager called me in the next morning (we are on extremely good terms, very chill guy) and asks what the expense is for. When I explain team breakfast and the rule, and show him the texts from my manager he gets red in the face and tells me okay no problem it will get paid and to be on my way. Not 5 minutes later my manager gets a call and everyone could immediately see on his face him getting yelled at. He goes into the branch managers office and proceeds to get a long talking to about what he can and cannot enforce on employees. Looking extremely defeated he sat down and didn't say a word the rest of the day. He had to send out an email to the team recalling the rule about breakfast and apologizing if he put undue pressure on us and that he just \"wants us to succeed, and being late is not the way to do so.\" The next week Monday morning, I brought in breakfast for the team again, a dozen and a half donuts for about $14. ",
        "permalink": "/r/MaliciousCompliance/comments/7k2s4k/must_buy_breakfast_for_the_team_if_you_are_late/",
        "comments": [
            "And that is why you always get a paper trail.",
            "We had a rule where I used to work that you had to bring in donuts if you were late.  Honestly, it was a great place to work and no one had issues with the rule.\n\nThat being said, you had to bring in donuts if you were late and we were hourly workers.  The punishment was defined and there was no rule for HOW late.  \n\nPeople very quickly realized that if they're going to be 5 minutes late, they may as well be 3 hours late and bring in donuts.\n\nOur boss just laughed and let people do it.\n\nPeople liked the job and tbh, no one took advantage.  If you were late you would come in an hour or two late but you didn't do it just to be able to come in late.",
            "At one point I thought you were going to bag up the dog's puke & bring it in.",
            "My professor had an alleged policy where if your phone went off in class then you had to buy ice cream for everyone. It was never enforced, and no one ever did it, but we sure did remind him of that policy when HIS phone went off once.",
            "I was initially hoping that you'd come in with a single cheerio for everyone. But your way worked much better.",
            "Is your dog okay?",
            "I'm worried about how this might impact your relationship with your boss now though.\n\nActually, I don't know you so I really don't give a shit. I guess more \"aren't you worried\"",
            "I love this sub.\n\nAlso, I read \"a dozen and a half donuts\" as 12.5 donuts. I'm not a smart man.",
            "With paragraphs... \n\n>Little background here. I work with a large multi-billion corporation in logistics where we are largely commission based doing sales. Everyone here is in control over their own clients and book of business. We have managers, but they aren't there to run your book or micromanage, they are there to help motivate you and find solutions to things you may have not run into yet. \n\n>If I don't come in one day or am late it doesn't hurt anyone but myself, so I work as much as I possibly can. Being a little late shouldn't be a big deal, but it got to the point a large chunk of the office was routinely showing up 10-15 minutes after start (I agree being late shouldn't be a habit, but they are only hurting themselves, if they don't hit numbers they will just get fired). Living in a central state and having mainly east coast clients means I am in the office about an hour before most people anyway. \n\n>Well, my team manager enacted a rule where if you are more than 10 minutes late, you have to bring breakfast for the team (my team is 16 people). So everyone showed up on time last week, then Thursday rolls around and I called him to explain how my dog is puking and I will be 30 minutes to an hour late. He just replies via text I better bring breakfast for everyone. \n\n>Even though I am historically there well before anyone, I was to become his first subject and example. I called to say no I cannot do that, Christmas is coming up and I have travel plans I need the money for. Well, he pushes back and says to bring it anyway. \n\n>Now I'm fairly pissed as my team originally thought the rule was a joke and in no way enforceable... So an idea forms in my mind, I was not going to take this. I call up Einstein Bros and order 16 double egg and bacon sandwiches and a 16 large orange juices. When I make it in about an hour late, the team loves the gesture and my manager doesn't say a word as he grabs his oj and sandwich. \n\n>Now here's where the fun comes in, our expense reports were due the next day in order to receive it by the following paycheck. I expense the full ~180 and submit it without saying a word to him. \n\n>The branch manager called me in the next morning (we are on extremely good terms, very chill guy) and asks what the expense is for. When I explain team breakfast and the rule, and show him the texts from my manager he gets red in the face and tells me okay no problem it will get paid and to be on my way. \n\n>Not 5 minutes later my manager gets a call and everyone could immediately see on his face him getting yelled at. He goes into the branch managers office and proceeds to get a long talking to about what he can and cannot enforce on employees. Looking extremely defeated he sat down and didn't say a word the rest of the day. He had to send out an email to the team recalling the rule about breakfast and apologizing if he put undue pressure on us and that he just \"wants us to succeed, and being late is not the way to do so.\" The next week Monday morning, I brought in breakfast for the team again, a dozen and a half donuts for about $14. \n\n",
            "Delicious compliance",
            "Dude, paragraphs... Fuck this is hard to read. ",
            "Wall of text hits you for 80 points of damage.",
            "Good job, I want a bacon roll now ",
            ">The next week Monday morning, I brought in breakfast for the team again, a dozen and a half donuts for about $14.\n\nThis is the absolute best part of this. It says to that guy \"yeah, I could've done it this way before. But I want it to be very clear to you that I'm sending a message.\"",
            "SMH. I would think that would be one of those fun good-natured rules that people can follow if they're just running late/feeling lazy one day but emergencies happen. My car window was busted in the morning once and I called my boss to say I'd be late since I'm dealing with a busted window, glass everywhere, filing a report, and then having to deal with insurance later. I'd be extra pissed if he was like, \"oh yea, bring breakfast.\" Fuck that. My morning is already bad! We're human beings people! Grr. Sorry! just this stuff makes my blood boil sometimes.\n\n",
            "TQL?",
            "A dozen and a half donuts would cost me $8 if I went high class- $14 seems like a lot!",
            "That was dang clever, well done. \n\nI was almost positive you were going to come in much later with a homemade breakfast spread. Your way was cheaper, faster, and smarter. ",
            "I was hoping for 16 pieces of buttered toast. Not that fancy \"two pieces of bread\" sandwich things either.\n\nOne piece of toast, and the worlds smallest stroke of butter. ",
            "USE PARAGRAPHS FOR THE LOVE OF GOD",
            "We used to do this when I played football in high school. If you left out a helmet or your pads, you owed whoever picked it up breakfast.\n\nA lot better than coach chewing you out and making the whole team do sprints the next day! ",
            "Lol TQL",
            "Clever marketing from Einstein Bros...",
            "Interesting your manager didn't see your expense report first, and that it went directly to the manager of the entire branch.\n\nAlso, 18 donuts for 16 people plus the managers?  \n\nSeems like a poorly executed time to embarrass your manager, as he is, well, your manager.",
            "So, like $12 for a bagel and orange juice? That seems a bit expensive. ",
            "I would have brought in a box of cereal.",
            "I hope you didn't work at a paragraph factory.",
            "What if everyone is late on the same day?  That's a shitload of wasted money and food.",
            "I would have brought in a loaf of bread and a toaster.",
            "Paragraphs, motherfucker! Do you use 'em!?!",
            "Man, I work for a company that makes only a few million a year and they dont bat an eye if I expense breakfast or a few dinners here and there for the guys. In fact,Im actively told to do so.",
            "I work with a billion dollar company doing logistics but somehow don’t understand how to paragraph.",
            "What I don't get about this rule, is if you're running late then buying breakfast for 14 people at peak times is probably going to add an extra 10-20 minutes to your commute unless there's a place right outside you can call up.",
            "Dang and here I was thinking you were going to bring in a container of dog puke to share with the team :)",
            "I had a bad day, i needed this",
            "but is your dog okay? ",
            "¶",
            "Nice thought just casually submitting the expense report.  I like it. ",
            "This post could also go into r/pettyrevenge maybe even r/prorevenge. If I were in your shoes I would’ve handled the situation a little differently by bringing one sandwich and making them split it 16 ways... but I like your version better. ",
            "Christ, does everyone at your company sound like a self help book?",
            "I’m sorry, this is dumb as shit. For $15, you could have bought good will and engagement with your team and manager.\n\nInstead you made enemies and come off as a complete twat. You’re now the person everyone is secretly talking about how much of a douche you are for ruining a fun thing. Every individual meeting with the manager your teammates will make jokes about you. \n\nGreat job. This is textbook definition malicious compliance. But it’s also douchey.",
            "You're a douche.\nBringing in breakfast/donuts/coffee is a pseudo-disciplinary thing.\n\nFirst prize is a showing up on time.\n\nAnybody wanna see second prize? \n\nSecond prize's is bringin' in breakfast.\n\nThird prize is you're fired",
            "I don't understand why a multi-billion dollar company gives a fuck about its salespeople (the engine that makes the company run) eating some breakfast on the company dime every once in a while. $180 is barely pocket change to a corporation that size.",
            "Wow you sound like a fucking asshole. You could have just, you know not have bought breakfast for 16 people. You knew that the breakfast rule was in no way enforceable you just wanted to be a vindictive asshole. Your manager is a dick too but you more so. ",
            "Why didn’t you just do the $14 box of donuts to begin with, instead of being a little bitch and pissing your leader off?  I’m in the same situation work wise.  I know I’m running late, I bring food.  When I show up late if bossman says “you’re late” I say “can’t be late when you bring food”.  He laughs and enjoys what I bring.  I pull above what’s needed sales wise and we have a great relationship.  So the moral of my story, you’re a little bitch. ",
            "I don't know, these stories always seem a bit off to me. I feel like the manager probably did have a reason he wanted people to be on time, if he was a proper cunt he could just dock your pay or make you make up the time. \n\nThe excuse of a dog puking, and saving for a holiday are basically as weak as it gets too.\n\nI think the manager was a little misguided as 16 people is a lot, but I think that he was probably thinking along the lines of your $14 donuts. Just a fun little penalty. \n\nI obviously can't know too much about you from this story, but it sounds like you are a petty person who thinks the rules don't apply to you.",
            "You're a good man, Charlie Brown.",
            "Belongs in either /r/PettyRevenge or /r/RegularRevenge for sure!!!",
            "I would have just brought in my puking dog like, \"Fine. We all deal with him. Go Team.\"",
            "Huh. Malicious compliance. I get it now.",
            "Nice job with that. I would have honestly just gone and brought in cereal and two packs of milk or something like that. Affordable and enough for everyone to eat, in theory.",
            "A better manager would have quietly paid for the breakfast you brought in and asked you not to tell anyone . This way everyone sees it as an incentive to come in on time and you wouldn’t be out any money. \n\n...and the ‘you’re not hurting anyone but yourself...not make numbers...get fired’ thing is not really right. It costs money to hire people and get them up to speed. \n\nThe thing most people don’t realize is that management needs you way more than you need them. ",
            "We have something like that at our small company. Even if it's a minute late, bring something. Everyone agreed to it a long time ago and if can't be brought in that day, just do it sometime soon. We've had donuts, bagels, fired chicken (came in around 11), breakfast sandwiches, and random stuff everyone will enjoy. ",
            "Where I work if you're late on occasion it's no big deal.   We aren't customer facing and so we have the flexibility much of the time to slide our day around a little.  It's one of the things that makes a workplace enjoyable IMHO and I think bosses who are dicks about start times often are happy to let you work late for free and that's not fair!",
            "Please put some paragraphs in. Wall of text hurts my eyes and soul.",
            "We have a list of \"donutable offenses\" where you are supposed to bring in breakfast (or snacks) when certain things happen like a promotion or birthday.\n\nNot enforced though, purely optional. ",
            "I would've shown up with two boxes of Captain Crunch (or a cheaper knock off cereal just to be mean), a gallon of milk, disposable bowls, & spoons. \n\nViola! Breakfast is served, mates.",
            "That would actually be a really fun rule if the team only had like 5 people on it ",
            "Plastic spoons\n\nindividual serving of cereal\n\ngallon of milk\n\nBreakfast is served.\n",
            "...you could have just bought some donuts and milk. Even Donettes, those poor excuse of donuts everyone eats when real donuts aren't available. \n\nIdk. I mean if you really didn't want to play along, you should have just said no and taken it up with management. ",
            "After reading this comment thread, all I can say is \"Fuck you Hostess© for making people think of fucking donuts as a breakfast food.\"  No wonder there's an obesity problem in the US.  People start their day with dessert.",
            "Honestly op you are kind of a prick",
            "I can understand this if you work with 5 people. But 16 is excessive ",
            "Kinda just looks like a decent boss trying to make adults turn up to their fucking job on time. You got to be the unlucky example for a pretty decent rule ",
            "So you're a fucking loser who's late to work constantly, when you even bother to show up, and went out of your way to \"stick it\" to your boss who was fed up with an employee who couldn't be bothered to show up on time, if at all?\n\nSeems legit.",
            "Congrats, you are an asshole .",
            "and this is how you get your card marked, the next time you so much as forget to dot an i, you'll be out the door.\n\npick your battles dude, pick your battles.",
            "And everyone applauded",
            ">We have managers, but they aren't there to run your book or micromanage, they are there to help motivate you and find solutions to things you may have not run into yet.\n\nhttps://www.youtube.com/watch?v=StIcRH_e6zQ\n\n",
            "I ain't reading your post until you learn what the  enter button does.",
            "But... don't come in late. Your manager was trying to positively effect your team culture. I am sure you telling on him and causing drama positively effected your cement in your position. Next time, dont text a lame ass excuse, just bring the box of 14$ dollar donuts and encourage your fellow salesman to not be late. Jesus... grow up kids, reddit is not the place to bitch and moan",
            "this seems really fucking stupid. You bitch that it costs you money and then spend the money anyway the next monday? He should've just fired your ass because you sound like a twat. ",
            "Oh my lord, you probably work at xpo right? I interned there until last year. Pretty cool people there.",
            "Vandalay industries?",
            "They make us sing if we are late to meetings.\n\nEveryone shows up on time, except this one chick.",
            "[removed]",
            "Did you expense the donuts?",
            "Here is a large dump, powdered with sugar, drizzled with large text blast. ",
            "Cover.\n\nYo.\n\nAss.\n\nGg",
            "This doesn’t really seem like a big deal... sounds like you have a fairly well paying job",
            "You should have bought one of those big off brand cereal bags and some milk. Would've been cheaper, funnier, and still made your point without ruining a genuinely pretty good idea.",
            "The Branch Manager aka Michael Scott called your boss to yell at him. That is legendary. ",
            "Great story, and sounds like a great place to work despite this hilarity. Do you mind me asking where you work?",
            "My dick is hard for you",
            "Well done",
            "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r7k2s4k?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[Receipt for Donut - Mitch Hedberg](http://www.youtube.com/watch?v=gWx6uA5aCrE)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/7k2s4k/_/drbgqbo?context=10#drbgqbo) - Instantly thought of Mitch 😂\n[Home-made Fish Fingers with a Chip Butty - Gordon Ramsay](http://www.youtube.com/watch?v=Qy0HncHOQe0)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/7k2s4k/_/drbq5wv?context=10#drbq5wv) - fish sticks\n[Office Space - What would you say you do here?](http://www.youtube.com/watch?v=StIcRH_e6zQ)|[+1](https://www.reddit.com/r/MaliciousCompliance/comments/7k2s4k/_/drbiu6x?context=10#drbiu6x) - We have managers, but they aren't there to run your book or micromanage, they are there to help motivate you and find solutions to things you may have not run into yet.\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r7k2s4k?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
            "Needs a TL;DR",
            "Prime? ",
            "Oh you’re a slippery little sneaky snake",
            "I once made this rule. If I recall we were a crew of 6, if you're late, bring a treat. Tims was down the block so often it was a dozen donuts. \nIt became so bad since one of us was always late that we had donuts every day for weeks. Some days we would have 2 dozen donuts or even 3 dozen donuts for 6 people!\nAnd then we started just grabbing donuts if we thought we would be late. Some days some of us would make it on time to work with donuts because they thought they'd be late! \nWe put a stop to the rule after about a month and 10lbs later....",
            "Technically 30 minutes+resincronization of team adds up to over 1 hour+16times that as loss(ie one power plant in us going down and others powering up it's amount.).  Happens....\n",
            "180 dollars for 16 sandwiches and juice?",
            "Wall of text crits you for 10000...",
            "Doughnuts is considered a breakfast in America?",
            "Expensing that would be against my company's policies.  They don't allow team meals.",
            "I typically run union crews to load in, run and load out shows. My main players or employees know that if they show up late, they better come with a coffee in hand as an excuse of why they weren't on time. \n\nIs this mandatory, of course not. Does it happen, yes, but they all enjoy working for me and know I'll give them as much work as I can. Is it a fun game we all play, for sure. I hate the days I am the late one and getting all of them a coffee, last time cost me about 30 minutes waiting and $150 at Starbucks. It's a game of give and take, but do I love getting coffees free most days we have a crew, yup. ",
            "Man where I work rn this is a rule, so if I’m ever late i end up ordering 2 large pizzas for the guys. I don’t really like the rule but I oh well.",
            "Should have just brought in Corn Flakes",
            "Just...beautiful",
            "Huh, i thought you were gunna plate the vomit and bring it in... Everything turned out better than expected"
        ]
    },
    {
        "post_id": "idz7xv",
        "author": "VividFiddlesticks",
        "title": "You want 10% off? OK!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/idz7xv/you_want_10_off_ok/",
        "score": 15495,
        "num_comments": 432,
        "created_utc": 1598024976.0,
        "selftext": "As a teen, I used to work for an import store named after a pier.  We sold a lot of wicker furniture.\n\nWicker furniture is not durable. It's the nature of the material.  We had white furniture that we sold, and it was so prone to scuffs and damage that it came with a little spray can of touch-up paint.  We (the staff) always made sure to point out how easily damaged it is.  Most people buying wicker furniture understood that, or would change their minds when they realized the upkeep needed.\n\nSo this guy comes in, and he wants a wicker chair.  Great.  They sold for $90.  Well he starts nitpicking every little scuff and mark on the chair, doesn't care that's just how it is, he wants a discount!\n\nSo I go ask my manager, she says, \"Fine, give him ten dollars off\"\n\nI go back and say, \"OK, I can give you ten bucks off\"\n\nHe says, \"Ten DOLLARS?  That's not good enough!!  I want ten PERCENT off!\"\n\nSo I say \"OK you got it!\", quickly ring him up, take the 10% discount (which is $9.00) and hand him his receipt with a big smille and a \"Thanks so much for coming in today!\"\n\nHe walks out (dragging the chair, lol) and is halfway to the door when he reads his receipt and realizes he's played himself.  He turns back and I just gave him a big cheshire smile.  He left without a word.\n\nOh, and I \"forgot\" to give him his touch-up paint too.  Dang.",
        "permalink": "/r/MaliciousCompliance/comments/idz7xv/you_want_10_off_ok/",
        "comments": [
            "If only they taught people maths in school.",
            "I’ll give you 100% of a *well done* for that.",
            "I used to work for that same store all their furniture was crap",
            "An old employer of mine used to do a deal with a local arts & crafts charity where we sold them paint for 5% over cost. \n\nIn a lot of cases they weren't picky about colors (it was kids making birdhouses and the like) so we'd clear out badly mixed paint and all those cans of \"What do you mean, Royal Blue? I asked for Robin Blue, I'm sure of it!\". Cans like that were half of our cost or less.\n\nSome new employee at the charity went through the old invoices, saw 5% somewhere, and fixated on it. She goes to another company and talks them into offering them 10% off.\n\nFuckers blew their entire supplies budget in the first month of a two month program.",
            "True wicker furniture is extremely durable. Too bad it’s made mostly of plastic now. Not at all durable.",
            "I dont know too many stores that would just let a person have a 10% discount because they demanded it. The last time I got a percentage off the retail price was when only 1 piece of the handbag was available and it had a big black eyeliner mark running across it.",
            "We were stuck with wicker furniture at a place we rented. When they built the family room they apparently brought the massive wicker sofa, love seat, chair, and coffee table set into the room before they installed the door. The only possible way to remove them was to completely remove the sliding door, which led to a balcony with no stairs. So we were stuck with them. Once you added lots of cushions they were comfortable enough, but they always seemed to wobble just a bit, and your cloths would catch on stray loose straws.  \n\nWicker is really only fit for r/PrimitiveTechnology, yet we still have a mode of flight which relys on wicker. It's bizarre.",
            "I worked for a company that sold liquor accessories and had a real jerk call an order in, he ended with “I expect the EXACT SAME PRICING AS MY LAST ORDER” and hung up the phone. \n\nThing was, we found a way to cut back pricing on some items since, but I did exactly as asked.\n\nI went through and manually increased the pricing to the old amount. Dude spent another hundred or so in total.",
            "When I worked retail and Karens would demand a discount, with dramatic niceness and a beaming smile, I’d say, “Ohh I’m so sorry! I should have guessed! The senior discount is 10% and there you go!”\n\nThe look on their faces was always worth it.",
            "We have some people who are way more annoying about asking for discounts. One dude asks for the Justin Bieber discount. Just realizing maybe since I’m a young white girl, he probably assumes I like him (never have). So I tell him “The Bieber discount adds $5 to your purchase”.",
            "I had a customer that I was going to give half the bill off for an internet trouble (important: they have internet and phone) but the customer wanted the whole month. I was like \"OK!  I can do that\" and followed the policy. Gave them the whole month _internet_ service off. My way would have been more when I did the math on it.",
            "I work in customer service calls. I’ve had multiple people pissed and wanting discounts (nothing new) until this one woman called pissed about a 15% discount not applied to order. No problem, happy to look into it. It was applied, informed the customer, however the customer was upset that it was the wrong discount code. She wanted to use a different one. No problem again, asked what the code was, ....that code was also 15%. I was like “Ma’am... it wouldn’t change anything. You wouldn’t receive any refund or anything.” The customer states she understood but wanted to use the coupon anyways. “Ma’am there really would be no use to apply it. The coupon you originally used has expired while the one you’re wanting to use is good for three more weeks. I think it would be better for you to wait until your next order to use this coupon.” BUT I WANT TO USE THIS ONE NOW! ..... wtf?",
            "Customer is \"always\" right..ish",
            "I had some jackasses not wear masks into our motorcycle dealership (Indiana) and they all bought youth goggles to go with their helmets. I didn’t say a fucking word.",
            "The moment when he realized he out \"assholed\" himself.",
            "I had a lady get pissed with me because I wouldn't give her the 40% coupon because the item was already discounted 40%. She didn't want both, she wanted the coupon. It didn't matter that I showed her it was gonna be the exact same price. She left without the item because damn it she wanted to use the coupon (side note... The computer literally wouldn't let me)",
            "I got a discount once, bought a piece of moulding that had a gouge in it.\n\nGot a nice $0.30 off of that $2 piece of wood, was totally worth it.",
            "I have a wicker thingy I bought over 30 years ago, still in decent shape. Easy for mom and I as we moved a lot.",
            "I wish I could award you just for this alone:\n\n>As a teen, I used to work for an import store named after a pier. We sold a lot of wicker furniture.",
            "NGL, after seeing the title, when you started talking about it not being durable, I was hoping you were going to smash a bit off and say “there, 10% of your chair is gone”. \n\nBoom, you looking for this?",
            "Fucking clutch",
            "Ha ha ha!! Gotta love when a customer plays himself!!",
            "Pier 1 Imports is going bankrupt, I think it's safe to say their name",
            "Oh, that's awesome!! I want 10%!! Okay sir, as you wish. You have yourself a great day and don't let the door hit you on the way out!!",
            "Great MC!  Great name, too!",
            "Ahhhh this is so satisfying. Thank you.",
            "Hahaha incredible!",
            "Let me guess, Pier Wan?",
            "Sadly, that store just declared bankruptcy. Pity, I have a bunch of their stuff and love it.",
            "Pretty sure I read this on notalwaysright.com.",
            "As a Canadian who taught in England one year, I had all of my report cards handed back to me so I could rewrite math as maths.",
            "Why can't you just say Pier One?",
            "Should get a game, I want one",
            "that feeling when someone was so focused on the discount he didn't do his mental math.",
            "pier one imports? lol",
            "That made me smile. Cheers OP :-)",
            "I used to work in a party supply rental shop. (Chairs, tables, utensils, plates, basically all the things you see at a wedding.)\n\nThose white folding chairs got lots of scuffs, and we just took white spray paint to them when they did.   This post dug that 27 year old memory up.",
            "Quick maths.",
            "Thanks from two of us for a jolly laugh!",
            "Instant karma",
            "Not exactly the same, but similar.. \n\nWaiting tables at a chain restaurant that was coming in my area, I get sat this pretty large table of adults, most of them upper middle aged. Overall, good table. The only really memorable part was when it came to the check. Someone asked, \"Do we get an AARP discount? We have two new members!\" \n\nI shrug, go to ask my manager and she tells me to give them 20%. I quickly say, \"no no, we should give them 2 discounts for 10% off. We'll save a little bit that way.\" Manager shrugs, I apply the discounts, the table is happy and none the wiser, and I felt pretty clever. Worked out pretty well overall.",
            "Yup, american's are kinda stupid.\n\nBecause apparently fractions are hard as well.\n\nThat's why the 3rd pounder hamburgers don't sell as well as the quarter pounder burgers do; '3 is smaller than 4' durr durr.",
            "You can post to your own sub r/RottingRavenn",
            "when i was a little kid i would play a rounding game with my grandfather if it was $4.83 it became $5 i fit was $3.04 it became $3 and so on, were it would a $200+ bill and we would usually be within +/-$1. i still use it today and i have caught several issues were they were fixed right away ."
        ]
    },
    {
        "post_id": "lqx0rm",
        "author": "CatDadMilhouse",
        "title": "Prove that you're just a bad photographer and your new camera is great? If you insist.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lqx0rm/prove_that_youre_just_a_bad_photographer_and_your/",
        "score": 15494,
        "num_comments": 362,
        "created_utc": 1614124219.0,
        "selftext": "This was over 15 years ago, when digital SLRs were first becoming somewhat affordable to anyone who wasn't either wealthy or a professional photographer.  I was in high school, had been a budding photographer for years already, and working in a small retail photo supply shop.\n\nI had a customer who appeared to be in his early 60s come in one Saturday and spend over an hour demoing just about every camera we sold.  I honestly looked forward to those customers because it made the time go faster and I generally enjoyed talking shop with people.  Eventually, he settled on one that we both thought would suit his needs and I rang him up.\n\nA few nights later, he comes back.  I've already been given a heads-up by the store's owner that this guy has called ahead, and he is *pissed*.  When the customer arrives, he immediately accuses me of selling him a camera that's either broken or simply not good enough for what he wants to use it for (taking pictures of his grandkids, who - like most tiny children - are not always sitting perfectly still).  It's too slow, it takes the picture after the kid's already done something, every photo is blurry, etc.  \n\nI take him at his word (I have no reason not to) and examine the camera, changing some settings and snapping a few pictures as I go.  I genuinely cannot find anything wrong with it at all.  As gently as I can, I try to tell him that it may be a combination of using the wrong settings on the camera for what he's trying to photograph (while teaching him the right ones), and maybe a bit of slow reflexes that will develop with practice.  Keep in mind that I'm young and terrified of losing my job, so believe me when I say I'm as delicate as I can be with the whole situation.  \n\nBut that was the wrong answer, apparently.  His solution: \"okay hotshot, let's see you make it work.  I'm going to wave my arms back and forth over my head, and I want you to take pictures when they're straight up.\"  He insists this will prove that the *camera* is too slow and can't take a sharp picture.  He hands me the camera, and starts doing his best \"wave your hands in the air like you just don't care\" right in the store.\n\nSnap, snap, snap.\n\nI hand the camera back and let him review the photos, each one showing the exact moment he wanted me to photograph, perfectly sharp and in focus.\n\nHe didn't say another word.  He huffed, hastily shoved everything back into his camera bag, and stormed off.  Sorry, sir.  Just doing what you asked me to.",
        "permalink": "/r/MaliciousCompliance/comments/lqx0rm/prove_that_youre_just_a_bad_photographer_and_your/",
        "comments": [
            "I wish I had realized it was my camera settings. I thought my pictures of blank carpet and random settings was because my niece wouldn’t stand still long enough for the camera to take the picture.",
            "This shakes loose a memory of my late grandmother.  She would carefully pose us for pictures and then complain we didn't look natural enough.  I loved her but her thing with photos drove us all nuts.",
            "It took me a while to get comfortable enough with camera settings to even know which one was off. Reminded me of a funny story tho. My grandpa gave me an old Nikon SLR (this was like 2013), nice camera and I was excited to use it for my high school photo class but when I tried to use it, it was jamming somehow, like I’d pull the handle thing to advance the film and it wouldn’t pull all the way. Photo teacher gave me the name of a local photography shop. Went there and the guy said he didn’t know, but he was about to make a trip to an older photo/camera guy down the road who might know and I could follow him there. Got to this tiny shop and this old man with a fantastic mustache and a European accent looked at it, dragged a (magnetized?) screwdriver over the bottom of it, then flipped it over and pulled the little handle perfectly a couple times. Guy from the first shop says “Well I could have done that!” Old European guy says “You don’t have screwdriver.” Didn’t charge me anything. I still have no idea what the hell he did. But I’m grateful I can use my grandfathers camera now.",
            "I worked in a camera shop doing sales and repair for 11 years and I have a good idea what his problem was. He probably wanted to just jam the trigger button at the exact moment he wanted to capture without giving it time to focus. Passive AF systems just don't work that way.",
            "I repair camera lenses for Canon, and we get things like this all the time... people say the equipment is broken, they want a new lens, but it turns out to be their settings... many times it is the gear being jacked up, but sometimes it's the customer not understanding their camera settings, and I get to write a very carefully worded customer letter detailing what they're doing wrong and how to correct it...",
            "LMAO That so reminds me of my sweet Grandma.  Back in the 80s , Grammie got a shiny new red camera. It was just one of those little 35mm point and click jobs, pop the film can in and push the button. She was very excited. Fast forward a few weeks and we were visiting her from our own province and she brought out her little camera to show us. While she had it out , she told us she thought something was wrong with it because every time she took a picture, she would see a bright light and her face would get warm and all of her pictures were coming out black.  \n\nMum asked her a few questions, decided there might be  something wonky with the camera so off they went to the shop to talk to the clerk.  Guy listened to Grammie's tale of woe then asked her to show him how she took a photo. Grammie demonstrated and the lad gently reached out - and turned the camera around, telling her the flash bulb goes to the front.",
            "My Mom likes to take photographs, but was always late to the picture and wanted people to recreate it for her.  She also wanted people to pose for 10 minutes at a time or more.\n\nI finally told her that part of being a good photographer (which I'm not) is learning to see a picture coming and being ready to shoot when it happens and not just reacting.\n\nShe took it seriously and got \\*much\\* better at it.  She never asks for people to recreate and rarely even to pose.  She watches and gets the shot she wants.  I was impressed that she learned to do it in her 70s.",
            "All the gear and no idea...",
            "One of the nice things about digital cameras; you don't have to waste lots of money on developing rolls and rolls of film with crappy shots.",
            "went out to dinner one time with my grandma and wife. At somepoint my gran whips out a camera wanting to take a pic of us. she stands there aiming it at us, perfectly steady\n\n\"alright say cheese!\"\n\nqueue a case of late stage parkinsons, no way are these turning out OK. She looks at the photo, it's blurry as fuck. \n\n\"Ill just take another photo\"\n\nsteady, steady steady, parkinsons \\*flash\\*",
            "The speed of light is too slow to capture my niece she is out of control and must be stopped",
            " Very good customer, Very good customer service. Started off unhappy because the camera didn’t work for him.\n\nYou educated him on settings, he saw with his own eyes and accepted he needs to practice. Everyones good!",
            "If I buy a new stove, expensive pots & pans, and expensive ingredients, that’s 100% going to ensure I’ll be a good cook. Yep. Can’t wait. This is gonna be good!",
            "That's why when I got a new DSLR I made sure to investigate how to actually use the thing first and then just start to play with it.  I guess you could just leave it on automatic, but that kind of defeats the purpose of having a nice camera.",
            "Why doesn't this work the way it should?!\n\nWell sir, there are these things called settings...",
            "[deleted]",
            "Oh boy. This reminds me of my ex's sister-in-law.  \n\nBackground: I've been into taking photos since I was around 10. I received my first \"real\" camera when I was 13.  It was just a spare point-and-shoot Pentax that an older friend had and gave to me. But, I loved it and I'd go through a roll of film almost every week. And use my pocket money to get the film's developed. I would rarely have a photo I wasn't happy with. \n\nSo, for my 21st I received my first DSLR. And I used it almost everyday. I took a lot of photos of my (ex's) niece's and nephews. And their parents loved having so many good photos of the kids. \n\nCut to a couple months later and SIL asking what kind of camera I had because \"I want to be able to take photos like yours!\" \n\nFlattering but, I had to try and tell her really nicely that it wasn't just the camera. I didn't want her spending $1200 on the same camera just to be disappointed.  So I explained which camera I had but also mentioned that I might have to show her how to use it a bit if she hasn't used one before. As the auto setting isn't great for taking photos of kids in action. \n\nShe was not happy. She took it as me insulting her ability to \"Point a camera at someone\". And proceeded to try and insult me by saying I don't actually know what I'm doing and that it's just the camera. \"Anyone can take a good photo if they waste money on an expensive camera.\" \n\nSo I left it. And she went and spent $1750 at a  department store, for the same camera but with a macro, flash and a full kit bag. They definitely saw her coming. \n\nShe came to me about a month or so after, saying \"I think I should take this camera back. I'm sure they've given me a faulty one. The photos are ALWAYS blurry and it keeps cutting the tops of the kids heads off in the actual photo, but it's not like that when I take the photo! They've ripped me off, I'm sure of it. Can you have a look at it? Does yours ever do that to your photos?\" \n\nMy response of \"Well, anyone should be able to take a good photo if they waste their money on an expensive camera. Especially with that flash. So, maybe you're right. Maybe it is the camera.\" didn't sit well. \n\n\nI know that sounds super conceited but, she was a massive shit. So, I don't feel bad about being cocky.",
            "As someone who has been a professional photographer for 13 years and simultaneously worked in specialist photographic retail for 10 years, this hits close to home, except I'm not as patient as you. I've had several of this exact same scenario happen to me and if the customer was rude or impatient, I simply told them it's not the camera's fault. It's yours. You're not skilled enough to know how to use it in the manner it needs to be (all totally true). A camera is tool that an artist needs to wield. Just like how a sculptor can't expect his chisel to make a beautiful marble statue by itself, you can't expect a camera to take good photos for you. You have to take the photos yourself. A great camera allows you to push the limits more than a bad camera, so a good quality camera is still important, but it's mostly the squishy bits behind the camera that matter. I have little patience when they're rude. If they're polite, I will literally spend hours with them showing them how the camera works in detail.",
            "Started working in a camera store in 2007. I cannot tell you how often I had to do this for the local soccer moms! \n\nThe second store I was at had a manager with the employee number of 58. (For context, I was 4179) For almost 4 years, I would go through this, and most customers would look down the counter, ask \"Manager, what's going on with this camera, really?\" or \"Manager, is he telling me the truth?\" This guy being this guy, *loved* the community relying on him, and he would play it up and go over the same stuff. Chapped my ass, but at least I knew I was explaining it right!",
            "[deleted]",
            "My favourite photo of my mother with my sister and I is to test her camera in the camera shop and was the last 2 taken on the film before being taken in. There is one that was over exposed to light and one of her ‘gently’ holding my sister and I still by our heads and we chose to stick our tongues at each other at that moment. My mum looks gorgeous and we look super cheeky and if it wasn’t for that photo I would have forgotten long ago the many times we went there after holidays to get the photos developed. She won that camera in a raffle when we were babies and it only died about 30 years later, which she used with her digital new one as we had such fond memories with it.",
            "Its not the machine\nIt's the operator \n\nDONE",
            "To be fair, he would’ve been better suited to a point and shoot, given his limited use case and lack of knowledge. That should have been the strong recommendation.",
            "I own a couple Pentax DSLRs from that era, and I can say they feel completely different than my older Pentax film SLRs. While he was short with you, I can understand him being frustrated, as it's a matter of what you're used to. For instance, I'm really used to my K1000, a manual SLR, which has a very crisp, quick shutter. Shoots the moment you want it to. And then I have my *ist D, a first gen Pentax Digicam, and that thing has significant lag before the shutter goes. Even without the different settings that you have to muck around with, I can understand him having problems with taking pictures the way he wanted if he was used to a film SLR.",
            "Back in 2006, I was that guy, though I didn't get angry at any clerks. :p\n\nI was just getting into photography and bought a Nikon DSLR. All my pictures were a bit blurry. I was like, man Nikon sucks. I returned it and got a Canon.  Same deal!\n\nThen I realized the problem was with me and not with the camera.\n\nEventually I learned it was mostly because I was a combination of (a) DSLRs having shallow depth of field, and (b) the kit lens being a bit less sharp with wide open aperture (even aside from shallower dof with wide open aperture).\n\nI stopped it down a bit and switched to center focus so I had more control, and voila, pictures no longer blurry!\n\nThen I got a prime lens, and they were better still!\n\nLesson learned is that you couldn't use a DSLR just like a point and shoot.\n\nI think these days autofocus is a bit smarter at least...",
            "[removed]",
            "At least he conceded in the end.",
            "If you give a Ferrari to a bad driver, the end result will be........CRASH.",
            "I did a version of this a couple of years ago in Amsterdam. A couple stopped us and asked my friend to take a picture of them on a bridge by the canal. He struggled to get one that wasn’t blurry / out of focus. The girl in the couple kept messing with the settings but he still couldn’t get a good one. \nI offered to have a go, and stealth changed the settings around a bit, and got a few nice pictures for them. \nWas a nice feeling to help them out!",
            "Apparently he was able to snap to the wrong conclusion than he could snap a photo.",
            "You won the battle AND the war. Knowledge trumps ignorance.",
            "I mean, to his credit he knew when he was wrong. Not happy but he knew.",
            "Known in broadcast as \"Finger Problems\"",
            "i was not particularly interested in photography but decades ago once borrowed a good SLR for my touristy snapshots - the only time my photos ever came out attractive.  it also pointed out for me the importance of various settings and what separates photographers from idiots with cameras.   \n\nsomething that disgruntles me usually are most any beautiful pictures of the sky - people think they are taking great photos but it is just the enhancement settings on all electronic devices - sometimes when someone shows me a nice photo i've had the opportunity to ask to borrow the camera, take a picture of the sky, and show them - look, the sky doesn't look like that, it's enhanced.  \n\nhaving an eye and faithful equipment and some knowledge are gifts.  and good for you for the devotion to your art and the patience to try to share that.",
            "Do you know of any settings on an iPhone camera that can help with this?  My daughter thinks you need to be moving to get a good picture which translates to something is blurry.  My solution was to switch to video.",
            "I have a very similar story, dude bought a Nikon P900 at a different store in our chain. Brought it to us in a camera bag, no receipt, no packaging, demanding a refund.He couldn't understand why he couldn't get good pictures out of it. Turned out most of what he was trying to do was handheld shots in low light at high zoom, holding the camera at arm's length. I couldn't make him understand why that's just not possible. It ended with security coming to us asking why there was a dude outside throwing a camera bag at passing cars. He left it in the parking lot, ran over by a car, all smashed up.",
            "Reminds me of some old western flick where the town bully challenges the gritty ranger to shoot a bottle off his head or something.",
            "Oh god I could’ve written this. Camera retail has its moments...\nFav was a man who insisted on buying an 1100D because even tho I explained the censor wasn’t great he “knows how to change the film speed” so he will be fine thanks. Have fun changing the film speed on a digital camera...",
            "Well, digital cameras do have more of a lag than film cameras.",
            "My family (6 of us) went visit my aunt and uncle (4 of them).  Uncle was trying to take a picture of the group but couldn't because everyone was moving around. He finally had enough, aimed the camera at the sky and said, \"I'll get a picture one way or another!\"",
            "Hey at least he backed down after.  He seemed upset but reasonable.",
            "This is a good case of RTFM, methinks....\n\nOr even just *Understanding Exposure* or any other guide on the Internet for how to use a cameras' settings...",
            "I believe an old saying from the gaming community very much applies to this gentleman.\n\n\"Git Gud.\"",
            "I appreciate this guy accepting that he was wrong and owning up to it (by his actions, even if he didn't say it outright).",
            "Surprised no one has said something like:\n\n&#x200B;\n\nNow that's a Kodak moment!",
            "SLR, self loading rifle?",
            "His pics were probably blurry because it was darker in his room and the camera increased the exposure time.",
            "I feel almost like I could have written this. I was in HS and working for photography company that we will just say was a bit...Ritzy...and isn't around anymore while it's other company that we will describe as a Warehouse for Boaters still is. \n\nBoomers were younger 20 years ago but still had the same entitlement complex and would blame me for their lack of photography talent.  \"When I was in college and took photography **with film** I never had issues taking action shots!  These digital cameras are supposed to make an amateur (because taking photography for one semester made you a pro) look like a skilled photographer. Your youth (ergo lack of experience) and ignorance made me choose the wrong camera.\" \n\nExplain the differences in technology and how a few tweeks in technique can solve this, they weren't having it.  Always the salespersons fault. Older coworker comes over and repeats the same points I made and the customer is fine or accepts the changes recommended because of the change in technology.",
            "I sometimes cringe when I see people wallking around with a DSLR... and the cheapest, crappiest, darkest lens they could find. Taking photos looking at the screen. Such a waste of money - they would have much better results with their phone. I am not saying that people can't buy those cameras, but... you should know how to use one before. People go like \"Oh, I want to get into photography!\" and buy a fancy camera, but don't know the basics of the basics of framing, composition or lighting.",
            "I mean this is hardly _malicious_ compliance, there's not much else you could do.",
            "A trick to get the grandkids to sit still, just say: \"on the count of 3, say 'OK boomer'\"",
            "Well, I've gotta say if you sold a semi-professional camera that needs deeper understanding of setup to an absolute amateur, then you were slightly in the wrong at the beginning.\n\nNot that he didn't err later, but you are also to blame.",
            "Being the difference between 4.7 and 4.8k? Don't mind if I do!",
            "That was not malicious but I like it",
            "Not malicious compliance, sorry... 'conforming to the letter but not the spirit of a request'\n\nYou literally did exactly what was asked of you.",
            "Lol",
            "lmfao. opz.",
            "I went to school to learn mine and now people pay me money to take pictures lol.",
            "If OP or anyone else wants it there's [multiple lists of subs](https://www.google.com/search?ie=UTF-8&client=ms-android-virgin-us&source=android-browser&q=photography+reddit) that are photography",
            "Most people just don't know how to take photos, be it with their phones or a dedicated camera, no matter how expensive or advanced, user stupidity allways finds a way. The main problem though is that they don't wait for autofocus to kick in before pressing the button all the way.\n\n&#x200B;\n\nCase in point, my sister and i have the same phone that takes decent pictures. When i snap a pic of my nephews, they are clear, well exposed and look great. When she takes a picture, it's a blurry mess. Same phone, same settings, different fingers (also her phone is filthy full of makeup and handcream).",
            "You seem too nice...that was barely malicious. \n\nBut satisfying nonetheless",
            "I had this issue all the time selling digital cameras when they came out.  People expected them just to shoot and work immediately.  I had to explain to everyone coming from a film camera that if they push down on the trigger half way, it would auto focus, and then they could snap their pic.",
            "Umm, can you describe the settings required to pull off this miracle?",
            "Crotchety ol' fool.  I would like to think I would return with a *show me* attitude, but even if not, would have stayed to ask you how to do the *magic*.",
            "Somewhere in my collection of things,  I've got a book (more like a small ring binder) which I think was published by Kodak.\n\nThe book covers off a lot of \"the basics of photography\" in a fairly oversone/unambiguous way. If memory serves, the person in every photo is a Japanese woman. As if to say \"yeah were not very good at this photo tech, let's just import it from the experts and get it translated\".\n\nIt's a book that used to belong to my dad. He would have been 87 now if he were still alive, for context. Probably published in the 50s.",
            "I missed a photo of my friend with Grant Imahara because my phones camera was legitimately slow. Cor whatever reason, on that day it decided it was going to wait about 2 seconds after hitting the button to fire the shutter. Still pisses me off",
            "Oh I feel this one to my core.\n\nI’ve got a saying here, if a customer comes in and tells us they’re a professional photographer, they’re not actually a professional photographer."
        ]
    },
    {
        "post_id": "11fpnub",
        "author": "Jeffrey_Friedl",
        "title": "We MUST use our initials as our username? Okay, fine...",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fpnub/we_must_use_our_initials_as_our_username_okay_fine/",
        "score": 15460,
        "num_comments": 1363,
        "created_utc": 1677722788.0,
        "selftext": "When I started graduate school in computer science in the late 80s, back when there was one monolithic mainframe that everyone had accounts on, I requested the username \"`jfriedl`\", as I'd had that on every system I'd ever been on.  The sysadmin, who was Master of his (tiny) domain, seemed to take great pleasure in denying my request, citing policy that people use their initials. EVERYONE had three-letter usernames, from the dean down to the sysadmin, down to the lowest student.\n\nFine, if your policy is that people use their initials, my username should be \"`jeff`\", as my legal name is Jeffrey Eric Francis Friedl. Forced-malicious compliance. You could tell he was positively *fuming* inside, but he had no choice but to comply with the policy. I had the only username that not only wasn't three-character line noise, it was my name. 😄\n\nEdit: actually, if there were two people with the same initials, the late arrival would get a \"2\" tacked on, e.g. if Jordan Edward Flumy Flinkmaster showed up while I was still there, he'd get \"`jeff2`\"\n\n&#x200B;\n\nEdit two weeks after posting:  The sysadmin in this story recognized himself and reached out and explained that he was probably just irritable because of the heavy start-of-the-year workload. As I told BoredPanda when they interviewed me about this post, he was chill and cool all the time after, so this is quite believable. He congratulated me for the upvotes, so still chill and cool. 👍",
        "permalink": "/r/MaliciousCompliance/comments/11fpnub/we_must_use_our_initials_as_our_username_okay_fine/",
        "comments": [
            "About 40 years ago,  i was working on unix systems.\nThe sys admins had rules for personal file naming that had a numeric department followed by a dot, then your initials, another dot then some other fields.\n\nThey started having trouble with people using 'inappropriate language' in the naming of temp files,  so they decided that they were going to do a keyword search and remove all files with any of these \"forbidden\" words. \n\nI came in the next Monday and my entire library was gone! \n\nMy initials are pms",
            "THE Jeffrey Friedl?  Mastering Regular Expressions Jeffry Friedl?  Your book is awesome!  Thank you!!!!",
            "Oh man, and as soon as everyone else saw your username, you KNOW he was flooded with change requests.",
            "My company, which makes employee management software, kept getting bug reports from a customer, saying just one of their employees never got entered into the database. They would keep trying, and that employee's name just wouldn't ever be added.\n\nEmployee's name was John Null, and you can guess there was a bug in our software that was attempting to send his name straight into a SQL command to insert a record with \"NULL\" in the last name field. Turns out there were hundreds of records with his name, just that the queries to retrieve it couldn't handle NULL for that field.",
            "A friend had *Tit* as her username at work, until after a month they caught on. Her name was Talia Isabella Thorn. She was amused. HR wasn't when they realized lol",
            "Protocol at my last job was first letter of first name and first three letters of last name. My username was TWAT. They never changed it.",
            "My university you had to use your legal initials,\n First,middle then first 3 of your last name then they add numbers if someone else has the same.  ( or first 2 letters of your first, then 3 of the last if you dont have a middle name).\n\nMine was ASSHO@university.edu\n\nI thought it was funny, so I didn't request a change.",
            "Only initials?  That seems rather shortsighted ... That's only about 17.5k possible addresses (assuming that everybody has only three initials which is obviously not true considering OP, but point stands).  At a couple hundred a year since the 80's they would be half empty by now.  And my guess is that they would have had a second JJS long before a QQQ enrolled, what did they do then?",
            "In the 90s, we were rolling out a WAN to all offices, and network IDs were mandated to be first four letters of your last name and first letter of your first name, plus a number if needed.  So, John Smith would be SMITJ  \n\n\nWe got a phone call from a very upset lady who insisted that her network ID had to be changed right away, but she refused to tell us what it was or why it had to be changed, just kept demanding a new ID.  \n\n\nTook several support desk people before we figured out her name was Theresa Cunningham.",
            "My favorite username was a co-worker's. His first name was Toshi and his last name started with a T. The username protocol was first name, first letter of last name.",
            "One of my personal favorites in this vein was what happened when an intern with the last name Cron joined our massive corporation with around 500,000 active servers running every imaginable variety of Unices and the IT department assigned him the username \"cron\".\n\nAnybody that's familiar with Unix and SMTP already knows what happened after that. And anybody who isn't familiar wouldn't think it made any sense and was actually funny.",
            "Man, that’s fuckin awesome! Bastards.\n\nI would’ve used Frank Adam Hinton Quincey. Ha ha ha. Fuck em!",
            "Because, you know, no one will EVER have the same three letter combination for their initials in the same department. I was a postdoc in Australia awhile back (he says looking at the gaping time gap between now and then) and the library called me up one day and said they needed to know my middle name. Turned out someone on campus had not only my last name, but my first name, and my same middle initial. However, this wasn't the main library on campus, this was the geology library attached to my research institute.  So someone using our specific library on this big campus had basically everything but my middle name but they needed my full middle name to disambiguate us.",
            "I bet he was less thrilled with Gregory Orson Davis",
            "Good baby name suggestion for maliciously compliant parents",
            "I have 2 middle names as well but not as cool as spelling my first name lol.   One of my former coworkers initials were F U and he LOVED initiallying things",
            "I once tried to get my title changed to Technology Information Trainer and Application Support Specialist.  My boss said it was too long for my business card.  I said he could abbreviate it, he laughed.",
            "I remember when I worked at a tech company that sounds like Crisco, the IT policy was similar: First Initial, Middle Initial, then Last Name.  \nWhich would be cool, except the username field was 8 letters, so anything beyond that was dropped.\n\nAnd username change requests were basically smugly denied to everyone. They had real problems with people changing their last name (marriage/divorce/etc; system was an old NIS-based one and set up by dudes who forgot stuff like \"Oh yeah, women get married\"). \n\nIf someone didn't like their username for any cosmetic reason, tough: It's what you get.\n\nBut they finally made an exception for Mandy I Nishitani (name changed slightly for anonymity), because her username was \"**MINISHIT**\".",
            "Our kid has a similar initial situation. It’s quite useful apparently.",
            "I'm RSLE but shortened it to RE in Highschool for simplicity reasons, lead to the nickname Religious Education (its abbreviatied to R.E in the UK) for like 2 weeks untill people realised I'm not interesting enough to have a nickname",
            "Back in the early 90s I worked at a corporation that used an IBM AS400 mainframe, and the IT department decreed that usernames would consist of a 2 letter code for the division plus the employee's first name plus last initial. Mine was something like NCSTEVEH. I felt very bad for Gina Scott who worked in the VA division. Her's was VAGINAS.",
            "My CS professors broke the university’s employee database. The university used first initial, middle initial, last name as the database key. They were married to each other so they shared a surname. They also had the same first and middle initials. So it was something like John Aaron Smith and Jane Amanda Smith which meant they were both mapped to JASMITH. As CS professors, one of who taught databases, they were not amused.",
            "Dear OP: if you're *the* Jeffery Friedl, just want you to know I'm a fan.\n\nGreat story.",
            "First job, my email was a 3 letter username, which was usually based on your initials, but never quite your initials. Anyway, my username was LMG, and the company's name started with a Y.\n\nI was looking through my home email sent items to find something my wife was looking for. All of a sudden she asks, \"Why do you keep emailing this 'I am gay' person?\"\n\nSure enough, the address was lmg@y...",
            "When naming our daughter, my wife and I were of one mind on her first name but had different ideas about her middle name. Rather than fight over it we simply hyphenated them. \n\nShe (now in her 20s) really enjoys the uniqueness of it and I’d imagine would have this same inclination to MC. Well done.",
            "My eldest daughters initials are MAD, which is, as she says, oddly appropriate.",
            "More than 20 years ago, a coworker had the userid of “geek”, as per similar naming rules at the time.",
            "That's crazy\n\nMy first names Debra \n\nMy initials are DEB\n\nNether me or my mom realized that until I got my class ring and they wanted to add my initials\n\nAccording to that ring guy \n\nThat was pretty random but not the wierdest initials he's ever encountered",
            "My company uses the format of the 1st 2 letters of your first name, then your full surname.\nSo, John Smith would be JoSmith.\nHad a guy who'se last name was Tan. Won't dox his first name, but his user name was Satan.",
            "For a long time we used an inventory system from the 80s at work. (I started in 2014.) Typically we used someone’s last name as their username. I have one of the top 3 most common last names in the US. When I first got my own login, my manager insistently tried to add me as (my last name).\n\n…She was really just resetting the other (last name)‘s password over and over again. Then they’d try to log in and lock the account out. Rinse and repeat. I finally convinced someone to add me as my first name, and that’s what I’ve always done for people with “repeat” last names.\n\nBut in one department I had (my last name)2. I get transferred. Next manager comes in, pays no attention to the social security number attached to that account. Doesn’t notice it’s an admin account. Resets the password, gives it to a newly hired associate. I get transferred back ten months later and I go to reset my old account. I get massive pushback saying, “That’s ____’s login!”\n\n“No, it’s not. That’s my old login. Y’all never noticed it was an admin account?” (Pushback continues.) “That’s my social.” Deleted it, made a new one with my first name, and made the associate his own account.\n\nFast forward to my current department. I have a “Casey Jones” and a “Carl Jones.” Someone added them as Jones and CJones. They’re the only people who can tell their accounts apart.",
            "I had a friend who was in high school back in the '60s whose initials were ME. \n\nWhen they played tennis for PE, they were told to bring in a certain number of tennis balls and mark them with their initials.\n\nHer teacher accused her of being a smartass.\n\nShe actually had to point out that those were her initials, not attempting to be clever.\n\nI couldn't help but wonder what kind of teacher doesn't know their student's name.\n\nEdit to fix embarrassing typo",
            "When I was in middle school, they started making usernames using first two letters of your first followed by the first three letters of your last name. \n\nWhen they realized that Sam Tank had the username SaTan, they switched the order to first three of last name followed by first two of first name. \n\nAs Megan Hughes, my username was now: HugMe.",
            "I remember reading somewhere that someone had the legal name of R B Smith, but company they worked for asked for his real name, he said it was R B Smith, but the computer rejected this as his name was too short, so he was asked again what his name was so he wrote R(only) B(only) Smith. He then got his payslip with Ronly Bonly Smith.",
            "I went to a college where the pattern *usually* was first initial, first 6 of the last name, then a sequence number starting at zero. But somebody decided to have fun with mine. My last name is almost twice as long as the requirement, but whoever created my username decided to use my first initial and just the first *four* of my last name, with the number. Which resulted in \"nbutt0\".",
            ">The sysadmin, who was Master of his (tiny) domain\n\nUnderrated IT pun.",
            "Mastering Regular Expressions Jeffrey Friedl?",
            "i appreciate the recursion in your name",
            "There are 3 people with my name living in a 5 mile radius. Two of us are registered with the same doctor, and two of us were claiming JSA at the same time. \n\nDuring COVID, one of them joined our local area community group. I sent her a friend request because that way if we got contacted by someone looking for the other, we could let them know. She has advised me that she is NOT the one registered with my GP - which is how I know that there are 3 of us.",
            "I always joke that since my initials are MAP, it means that I can tell you where to go",
            "I had a friend named Timothy Watt with a similar issue, except the policy was first initial, followed by last name, no exceptions.  His situation didn't work out quite so well.",
            "Similar story... CTO demanded no exceptions to usernames, policy was first initial + last name. We pointed out that some people have very long last names so he added \"cap of 12 characters, but that is the only change\".\n\nA few months go by and we hire a new Senior VP of Sales. CTO comes by mad that we hadn't gotten him an account or email yet. We explained we weren't going to be the person to give him his new email address. Told him because of his policy, it would be best politically for him to talk to the new SVP.\n\nNew guy's name was Tim Estes...",
            "Back when I was in college and the internet was a new thing, the geniuses decided that initials plus social security number @ university .edu was a perfectly okay naming convention.",
            "My initials are ICK, which is why I usually never include my middle name in initials lol",
            "My uncle's brother-in-law about 15 years ago was forced by his company to use his initials. This was after 6 or 7 years of using a made up initials that everybody knew was him. He all but begged for an exception. His Boss did not realize that his initials were FU.",
            "I have been privileged to know individuals assigned the names \"mrpric\" (mister prick) and \"dxlixx\" (dicks licks) by automatic assignment rules like these",
            "I do monogramming.  It is traditional to put the last initial in center; with first and middle flanking.  Occasionally I’ll have to suggest alternate arrangements on a child’s item.  Nobody wants a christening gown with ass, or sad embroidered on it.",
            "Airline ticket reference locators - the 6 character code you see on your ticket - are a frequent source of great stories. Many reservation systems to this day maintain a rude words program to filter out the codes which always seem to end up with our most deserving customers: FUCKU2, CUNTXX, ...",
            "My initials also spell my name, it's an actual superpower to some people.",
            "I got emailed from a company for my job and the email username was bitch@companyname\n\nGuy's first name was Charles, his last name started with Bit. I can only assume he fell victim to this.",
            "Kinda related, with a current generational twist - I work IT, and had to install some \"Wireless Access Points\" in certain areas, two of them being a medical area. So, going to \"Check on the WAP's in the infirmary\" would elicit chuckles from about 1/3 of the staff, while the other 2/3 would look perplexed.",
            "The best account I ever got to create was for a Swedish guy named Ulf Grimbringer. \n\nUlf my guy, if you're out there know that your name is undeniably badass and will ring out for all eternity.",
            "I knew of a username convention that is first initial, first three letters of the last name.\n\nThe person creating this particular account was literally going to give them the username 'shit'",
            "My university used to have our emails as our last name and first two letters of our first name as our email address. So if your name was John Smith, your email would be smithjo@university.edu. If someone else was named John Smith too, they would get a “2” tacked on at the end of “smithjo”\n\nI logged on to a computer in the library and the person before me forgot to log out. Her name was Meghan Finger.",
            "I thought your initials would be something crude or inappropriate. Like a story I remember hearing from the good old days when secretaries would type the boss's initials then their own at the end of a letter. I'm this story, the initials were GAS:BAG.",
            "In my high school, we had a few students whose parents REALLY thought out their children's name. \n\n\n1 girls initials spelled out Cat, and that is wut everyone called her. \n\n\n1 guys name was his initials think JON, and his full legal name was Jon Owen Noel. \n\n\nAnother guys initials spelled out the families \"traditional\" name. The story the guy told me was that for the past X number of generations, all the males born first were named Steven. His mom hated the idea of giving her son the same name as his dad. His mom's reason was that she didn't want to be spending alone time with her husband. Call out his name, and their son accidentally hear her and walk in on them. So, they made his initials spell out the \"family\" name.",
            "“Hello sysadmin. My name is Pablo Diego José Francisco de Paula Juan Nepomuceno María de los Remedios Cipriano de la Santísima Trinidad Martyr Patricio Clito Ruíz y Picasso.“",
            "I used to work for a company that insisted that we use first initial last name as the account/email address. So John Smith, would be jsmith. Luckily for Sharon Hart, upper management noticed after a few weeks, and requested that we allow hers to be different.",
            "[deleted]",
            "We do first initial last name. Thus far, I have met CRapp and ABoner.",
            "One of the training systems we use has a username rule of so many from surname, first initial of first name. I therefore got the name Butts……",
            "LOL, this reminds me of a place a friend of mine worked at long ago that forced you to use your first initial and last name as the basis for your log on, and the internal e-mail system they had.  They refused to make any exceptions to it.\n\nHis last name was Hitter, and his first name started with S.  He'd already had the nickname *Shitter* since grade school, now it was official at work too.",
            "One of my employers used first name initial and full last name for email addresses.  This occasionally gave rise to problems with especially common names, like Jones.  We already had a \"cjones\" on staff when they hired another Jones with a first name that started with C, so they added her middle initial.  This ended up being \"cajones.\"\n\nShe was on the support staff, so she regularly communicated with clients.  One day, her boss received an angry email from a client, complaining how they could allow someone to have such a vulgar name for an email address.  Unsure what the client meant, they eventually found out the client thought \"cajones\" was the Spanish slang for testicles.  In a cherry-on-top situation, miss Jones got to explain that her mother was, in fact, a high school Spanish teacher.  First, the email address was for her first name and middle initial, Christine Amy Jones (not her actual name, but the right initials), and second, the Spanish word was not \"cajones\" but \"cojones.\"  \n\nThe client was embarrassed and apologized for raising a stink.",
            "I was at a conference some years back and met a guy from a US finance company who was called Gaylon Aycock. Everyone was swapping email details at the end of the conference and I almost corpsed when he told us his username was gaycock",
            "When I was in college, a woman named Sarah Lavery had an email generated for her using the usual scheme: First initial + last name.  I’m sure she got it changed eventually but it was not a great look for her lol",
            "A friend of mine had ”toan”, which is Swedish for ”the toilet”. \n\nThe admin refused to change it.",
            "No joke at all, I had a female student adviser whose email was ibedwell@school.edu. It was first initial and last name. Felt bad for her.",
            "At my elementary school, our computer logins were first four letters of last name + first letter of first name. One of my classmate's username was HornE. You can imagine how fun that was at 12 years old",
            "My initials were for a while MS. MS was already taken. Thankfully, they didn't make me take SM",
            "I’m grad school, we got first initial and 4 letters of our last name. A friend of mine’s user name for about a week, before they saw fit to change it, was “fucke.” (Sorry, auto correct made me have to edit).",
            "Your parents knew what they were doing.",
            "I used to work at a place where you signed off pieces of work with the first two letters of your first name and the first two letters of your last name, so Joan Smith would be JOSM. One day I came across a piece of work signed off by Stuart Furniss and was momentarily very confused.",
            "My friend had to go through something similar recently when he got a new job. The policy is to use the first two letters of your first and first two letters of your last name as your login. Well, the first two letters of his first is Ni and the first two letters of his last is Gr. You can imagine how that conversation went. Didn't take long for them to back peddle on their policy.",
            "Mine would have been WANK.  I don't generally use the middle two initials (from maternal and paternal grandfathers).    \n\n\nWould have been worth it to troll the guy, though.  :D",
            "Had a lecturer at uni who told us about how the username policy where he used to work was the first three letters of the users surname, followed by the first letter of their first name followed by a number. The lecturer was called Peter Crane. His logon was crap1.",
            "My current job uses a 4 letter alphabetical identifier for your username for the main program we use for invoicing. The standard is first two letters of first name followed by first two letters of last name, so John Smith would be JOSM. There are a few exceptions when an ID already exists, they'll sometimes do three letters of first name, last initial, so John Smith would be JOHS.\n\nWe have an employee who's first name is Donald and last name starts with GI. I guess DOGI was taken already, so his username is DONG.",
            "My daughter's name is Brianna. Her nickname is Bri. Her initials are BRI. This was intentional.  I  did not foresee any problems.  Ooops.😮",
            "Place I used to work actually had a good IT team. All usernames were first initial + last name. Peter Rickman didn't even have to ask--they set him up as last name + first initial off the bat.",
            "We had the policy of first two letters of first and last name: KY + KE = bad time.",
            "For systems that made usernames based on the first letter of the first name and the whole last name... it sucked when my first name started with 'f' and my last name started with 'ag'...",
            "John Jacob Jingleheimer Schmidt!",
            "Man, kudos to your parents for giving you initials to match your first name. My parents tried to make all our initials spell words (with varying levels of success), but that’s next level.",
            "My initials are ALF",
            "My initials are BJS. I'd do terrible things to make this the thing that broke that rule for a business etc",
            "When I was in college and email was new, there was an apocryphal story about a student at Wake Forest, where usernames where the the first 6 letters of your last name followed by your first and middle initial. \n\nPoor Mary Elizabeth Cummings.",
            "I worked at a place where the usernames were \"first initial-up to seven letters of surname\".  Generally fine, but I had one coworker whose username ended up being \"KHAMILTO\".   Imagine being dubbed Cameltoe by your employer.  Thankfully, she thought it was hilarious.",
            "My company has a policy that usernames are first initial plus last name. Until they hired someone named Patrick Enis. He insisted on a different username and they wouldn't let him have it. He quit after less than a month.",
            "Not exactly the same issue, but I was handling the migration on one company's IT systems to another (partial buyout).  The new company had an account naming policy using first initial + surname. \n\nDuring the migration of one location, one user had the first name of (we'll say) Donna, surname of Runk. It didn't even click with me until I was walking her through signing into her new system. When I got to providing her username, I stammered a bit and caught myself, then explained the naming policy and quoted her username, \"drunk@[company name].com\". She just burst out laughing and called her husband on the spot to thank him for that surname.",
            "This is literally where my reddit username comes from. I was in admin at a company where the rule was: last name + first initial. There was a gentleman whose last name was Slappy and first initial was g. And once we saw SLAPPYG, it became an inside joke as some sort of a rapper name. And so I had to adopt it for my username.\n\nWe also had a nice woman with the last name of Vargas. She ended up with: VARGASM.",
            "I had a friend who was born to a single mom and had the initials K K H. Mom later got married and he adopted her and her initials became K K K. She was on the drill team in high school and before her, they would put all three initials on their uniforms. After she joined, they went to just two.",
            "I really thought this was going to be a case of your initials spelling something inappropriate. \n\nReminds me of the early days of the internet when the Lumbermans Exchange registered lumbermansexchange.com.",
            "I once met a woman with the surname 'A'.  \nHer firstname was Emma and her second and third name started with the letter 'M'.  \nHer parents were fantastic.\n\nHer initials were EMMA.  \nHer name was E.M.M. A\n\nAnd we call her 'Emma'.",
            "I had some freak out on me because we NEED 3 initials and I only had 2 (no middle name). He actually got mad at me, cause I definitely told my parents not to give me a middle name.",
            "There’s an old email forward joke from before social media, about when Steve Hitterman got a job at a company where their email was *first initial - first three letters of last name* at company… and how when he requested a special change, he got an email from the sysadmin telling him that “rules are rules” — signed Chris Untermeyer",
            "Same policy at a place I worked….until…\n\nKaren Kelly…can you guess her third initial? \n\nBest thing was it was her outbound username for mail, so having those initial before @organisationname.com was unsurprisingly seen as a big deal.",
            "I don't have a middle name so would mine just be 2 letters then?",
            "What’s your name?\n\n*My name Jeff*\n\n^Please ^laugh",
            "Used to be in charge of allocating usernames at a secondary school. For years the convention had been year of entry dash random number - so 23-345. Then we got a new boss who insisted it had to be first initial surname, no exceptions. Until the day we had a Thomas Watts start in year 7. His IT teacher pointed out that twatts was probably not appropriate for a 12 year old. Boss became a bit more flexible after that.",
            "My name is Jeff 😂\n\nhttps://youtu.be/AfIOBLr1NDU",
            "That's not what a proper computer person would do. The first Jeff would be Jeff0, so the second one ought to be Jeff1.",
            "Their head of HR was named Terry Iman Thurman. So \"@TIT\"",
            "Reminds me a little of how my mother was named.\n\nHer surname started with S. When she was born, my grandmother was pestered by her two sisters to name my mother after then. Their names were Ann and Sue, and they wanted those names to be in that order.\n\nI think you all can guess why my mother is named Sue Ann.",
            "I have a hyphenated last name, and I use the first initial of both if I need to initial anything. It's actually really frustrating that hyphens and 4 letter initials aren't commonly accepted. My phone company won't accept a hyphenated last name, and the company I was with before this one wouldn't let me use my visa debit card to pay my bill because the names didn't match because they wouldn't accept hyphens either. A couple companies I worked for in the past would assign a 3 letter username for the POS, and they said it had to be your first middle and last initials. But because of the system design, you literally couldn't have 4, so id always demand my middle initial be dropped. I hate my middle name so much lol we need to normalize having more than 3 names. I know people with two middle names, and people with two last names. Hell I knew someone that had 2 middle AND 2 last names.",
            "[deleted]",
            "My aunt has this. Her name is VAL and her initials line up. Her maiden name starts with a G. I think she was eager to get that changed.",
            "My parents purposely made up middle names so my (and my brother’s and sister’s)name would be exactly the same as my initials",
            "Last year I noticed that I hadn’t received a payslip in a while… they had started sending the pay slips from company initials expatpayroll@….\n\nCompany intitals end in S, so yeah, emails from […]sexpat were totally going to spam!",
            "I had a colleague stuck with Jack0ff. He protested hugely about it.",
            "first rule of programming anything about human names is to never assume there are rules with names.",
            "My university set all staff account names as 2-letter-department-code, followed by initials and then a number to make it unique. Plan got changed when a guy joined the arts department with initials SE and his account got set to ARSE1.",
            "I learned very early that I could have rules, and I could make exceptions.  \n\nThe rule before me was \"First Name + Last Initial\".  So Bill Smith, Bill Scott, Bill Schmidt would all get the same username.  Owners were kind of anal about it, so Scott got WillS and Schmidt got WilliamS.  Nevermind that they hated it.  \n\nSo I changed it to first name + last name, and even went so far as to ask for preferred name (like middle name).  And if a last name was really long (like Hernandez or some of the German names), they had the option to go for last initial.  \n\nIn other words, I had a standard starting point, and standard modifications that let us be sensible with user names.  Almost nobody complained.\n\nThe only person that didn't like it was the owner.  So I pointed out that I would have had the same username as one of the salesmen, except that our last names both start the same (and only differ by the last letter).  And anyone that calls me \"William\" is likely to get punched in the mouth.  WilliamS.  \n\nn.b. - I'm not Bill.  Different common name (and nickname).  Same kind of situation, though.",
            "I had to use DADI as my initials. Guess what nickname my coworkers gave me...",
            "> Edit: actually, if there were two people with the same initials, the late arrival would get a \"2\" tacked on, e.g. if Jordan Edward Flumy Flinkmaster showed up while I was still there, he'd get \"jeff2\" \n\nReminds me of a customer of mine. It's quite a big company and we are an external IT company, but we also have domain accounts in their active directory, since we do a lot of maintenance work on their machines and have to use dedicated accounts for this.\n\nTheir usernames consist of the first three letters of your first name and then the first 4 letters of your last name. Pretty standard.\n\nWhat is funny though is, that one of my colleagues shares the last name with one of their internal IT guys, and their first names both start with \"Ch\". But since my colleague is working for us for many years now, the internal guy had to get his username with a \"2\" at the end, because his username has already been in use by my colleague.",
            "As a Jeff, I approve of this MC.",
            "My company still uses the username format “max 6 chars. first character of first name and first 5 characters of last name. If a duplicate, drop last char and append a number if. If numbers go to double digits then cut another letter to still fit into 6 chars” which causes absurd repetition of usernames because the company is huge especially as you drop more letters from the last name so the duplicates accelerate. So they start appending numbers and after so many “Amy Chen” and “John Smith” we’re at like “ach101” and “jsm122”. It’s absurd.",
            "I went to a school where they used the first 3 letters of your first name and the first 3 of your last name. So I was stuck with Marnie for a while.",
            "They tell you when you are naming a child that you should never name your child a name you absolutely love, because you will learn to despise it as you scream it in anger and exasperation about 100,000 times before the child is three years old; you should never name a child a name that can have a nickname you hate, because, inevitably, the child will be called that very hated nickname and there isn't a blessed thing you can do except die mad about it; you should think of your child's initials as a stock ticker - would you invest in PIS, QIF, FLOT, etc. - and plan accordingly; don't get weird with \"unique\" spellings of traditional names, or your child will grow up with people assuming that you, the parent, have an IQ in the low double digits; imagine your child's name on a doctorate diploma, and if it looks silly, there's your answer; and imagine childhood friends calling your home, looking for your child using those worst nicknames you can imagine from that name, and also using your child's full name - if the full name is hard for a small child to say, it might be a terrible choice, no matter how nice it looks on a diploma.\n\nJEFF is a solid set of initials.  I have the initials of a defuct car manufacturer, a difficult-to-pronounce name (even for adults where I grew up, thanks to the regional accent) with a god-awful nickname; but it's spelled properly and my mother didn't pick it out - Dad chose it, so I kept it my whole life because it was a gift from him to me; I was the only child he named himself - so my mother was never upset about the number of times she yelled it in anger.  The kids at school also thought I had no nickname (they'd ask me if my family called me that, and I'd truthfully answer no), so the dreaded nickname was all but unheard.",
            "My dad doesn’t have a middle name but the system at one of his jobs when I was growing up required a middle initial. So he’d put the letter “V”, therefore making his initials MVP.",
            "from what I remember mainframes were resource limited. that's why in the 80's developers used 2 digit years and there was a big rush to fix stuff before the year 2000\n\n&#x200B;\n\nI used to create accounts in my old job and we did the same. we had a blanket policy of first initial and last name or something similar and if there was a conflict with another employee we would add a middle initial or number or whatever\n\n&#x200B;\n\nwhen I started doing database work in the 2000's there was a bunch of leftover knowledge from the old days of doing things to save every bit of resources that ended up being worse for performance in the long run",
            "I worked at a place where the rule was first letter of first name, and then last name. So you'd get your jfriedl. Much to their credit, they did make an exception when we hired Scott Wine.",
            "Went to UT Dallas in the mid 90s, we were on SunOS for CS dept servers. Usernames were simple - first initial, last name.  8 char limit was arbitrary. One of the kids in my intro to structured programming class was Christina (changed for this but started with a C) Unterbarger. She was therefore cunterba@utdallas. Her assignments had to be signed with this name, too. \n\nOne of the admins did agree to make a policy exception after a couple of weeks and let her use the first 3 letters of first name, last name, much to her relief. \n\nSometimes I wonder what they would have done if a hypothetical person named Robert Oot or some other R first name would have existed and decided to enroll...",
            "I was expecting your initials to be an abbreviated command to drop a table or remove a folder or something 🤣",
            "I used to work somewhere that did first initial plus first 3 letters of your last name. Steve Hitchens and Cynthia Litten were not very thrilled with their usernames.",
            "Those \"first initial+last name\" accidents are also great. I've changed the actual names here for privacy but a friend was Sam Avory. So his email was Savory@company. He worked at a company that had a *Steve* Avory and since the company couldn't have two of the same email address and they didn't want to do number suffixes, they said \"Let's include the middle-name initial.\" It worked okay for Steve because his middle name was Michael so he got Smavory@company. But my friends middle name was Laurent. So he got Slavory@company. Awkard.",
            "My university does first two letters of the first name, middle initial, and part of the last name. I got asswhipp as my username and refuse to get it changed, though it has caused some minorly uncomfortable conversations over the years",
            "Had a coworker whose name was B. Lumpkin. So his username was blumpkin. \nSearch for that on Urban Dictionary.",
            "Mine isn't as funny. It is funny to me. We were at a church function and they wanted us to put the first initial of everyone in our family on a piece of paper. We were supposed to use them to write a nice word about the person. Our little family couldn't stop giggling because when we did that we realized our initials spelled out smite.  That was the last church function we attended.",
            "At one of my old service desk jobs, usernames took the first few letters of your surname, and the first letter from your first name.\n\nSo if your name was Greg Snowdon you'd get the wholesome 'SNOWDOG'.\n\nIf you're less lucky... 'DICKEND', 'COCKS', and so on. \n\nUsername roulette was my favourite.",
            "All these stories about systems that use first middle and last initial makes me wonder what would happen when you don't have one. When I change my name legally, I plan not to get a new middle name for bureaucratic simplicity. (No one has the same first and last name as me, so that won't be a problem)",
            "That's exactly how my work was. Your 3 initials followed by a number. My number was 1 for 25 years.",
            "I changed my full legal name a few years ago. I specifically picked each name so that my initials are KAT, which is also the nickname I use (short for Kathryn) 😜",
            "At my last job, we had something similar to log into our main program. Another employee had the same initials as my legal name, so instead of putting my preferred initials in and just labeling it under my legal name like they could have, they changed my middle initial to be one key over. Annoying as all hell.",
            "Haha I worked at a place where the rule was first letter of first name then first 4 letters of last name.\n\nSo Alan Price became apric.",
            "I work in IT and there was a customer I had noticed that had a last name of Lutty and a first name that starts with an S. The correct format should be full first name . Then last name.\n\nSomeone had decided to have some fun and instead named it as S.lutty",
            "I consulted with Maytag shortly before they got acquired by Whirlpool, and they had pretty old school systems still in 2005. Folks had email addresses that were first initial and first 5 letters of their last name @maytag dot com.\n\nSome of the best I remember were Steve MacMillan being smacmi (smack me) and Dee Underwood, who really hated being dunder.",
            "Ahhh the good old days of BOFH!!",
            "I know someone whose initials spell out BAD. \n\nThis could be a problem.",
            "When my (now)wife and I were planning to get married, we briefly talked about if we wanted to hyphenate our last name. I did a quick mental calculation and said if we did, we had to use her last name first in the hyphenation. Unless she really wanted to have the initials AIDS then we could do that.",
            "My wife doesn’t have a middle name and it’s been the hardest thing for people to grasp. Lol",
            "I'm surprised you were the first person with more than 3 initials. Many people have more than that.",
            "At a previous employer the convention was first initial last name. No problem, but sometimes they had to make exceptions, and I fully understand. Imagine that your last name is Hohl and first name is Patricia. Yeah, that’s not going to fly in a corporate environment. It’s a good thing that her husband, Alex, didn’t work in the same office…",
            "I had a friend in the 90's that they insisted your user name be the first 3 letters of your last name followed by your first initials.  Hers was PRICK.  When they would print, the front page would be their user name 5 inches tall created from the individual letters.  It only took that coming across the printer a few times before they changed it to just her first name.\n\nSame Sys admin made Root directory path for everyone, think Local Federal Judges down, **FU**\\\\usersname\\\\\n\nYeah... that genius was fired.  He didn't think they would get it.",
            ">actually, if there were two people with the same initials, the late arrival would get a \"2\" tacked on, e.g. if Jordan Edward Flumy Flinkmaster showed up while I was still there, he'd get \"jeff2\" \n\n>\n\nThat is the stupidest fucking naming convention. Imagine they hire Jeff and jeff2, then fire Jeff and hire jeff3. They'd just have jeff2 and jeff3 with no Jeff. And they'd always mix up jeff2 and jeff3",
            "My work initials should be LDS but since someone already had those initials the company decided to give me LSD instead. Safe to say I enjoy my work initials and gives some coworkers a quick laugh",
            "Not sure of the likelihood of this, but if you're the same guy that makes plugins for Lightroom, then you're one of my favorite people on the planet. I just wanted to say that.",
            "My grandmothers married initials are ASS. I would have loved to see him when she sent that in 😂",
            "The place I work at creates all usernames using the first initial and last name. I had to send an email to someone recently.... to Twatkins. -sigh- I'm actually a little jealous of their username.",
            "My brother when he went to school kept trying to use his full initials on tests when they were grading your partner's test/paper. The teacher kept insisting that my brother only use his first and last. When he handed everything in his teacher heavily frowned but couldn't say anything. My brother's initials are NA!",
            "As a provisioning analyst, I don't follow any rules. I'm normally just trying to make the funniest username I can with a combination of your first and last name.\n\n\"JACKSOF\" is my pride and joy. As is \"NOJOE.\"",
            "After reading this entire thread, I realized who you were and was rather starstruck. You have (had) a [website](http://exif.regex.info/) that displays EXIF data for any picture. All of my geocaching friends used it. There are plenty of other sites out there that do it, but yours was the best and the name is easy to remember.\n\nIt has been down a few months, so I was wondering when, or if, it would be back up again. I've always wanted to create my own mirror of your site because it works so well.",
            "Your parents sound like awesome people",
            "That is a horrible policy for usernames. But also a hilarious way of dealing with it.",
            "Was expecting your initials to be NUL or something after reading the title.",
            "My school did something similar, and we were so close to having \"FUK@school.edu\"",
            "Jordan Edward Flumy Flinkmaster...\n\nHis name is my name too.\n\nWhenever we go out\n\nThe people always shout, hey!\n\nThere goes Jeff."
        ]
    },
    {
        "post_id": "kk5qjh",
        "author": "NeuronSauce",
        "title": "Nothing says I can't wear a beard net with the rest of the guys (25, F)",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kk5qjh/nothing_says_i_cant_wear_a_beard_net_with_the/",
        "score": 15460,
        "num_comments": 252,
        "created_utc": 1608929257.0,
        "selftext": "During undergrad I worked at a deli in a major supermarket. Most of my coworkers were also in college, and we all got along and generally had a good time. We usually didn't have too much trouble, but for some reason a couple of managers had decided that they didn't like one of my coworkers. Let's call him Corey. They would nitpick his work and give him a hard time for things the rest of us never got in trouble for. One morning, they decided that his 5 o'clock shadow warranted a beard net. Now this was an unusual request considering that 1) no one without a beard had ever been told to do this before, and 2) he had barely any stubble, and 3) they made a big deal about it and seemed to be trying to make him feel bad about it.\n\nCue the malicious compliance.\n\nManagers aside, I was the only female employee in the department at the time. So I stroll up and ask what's going on. They point out his stubble. I respond that I'm certain that I have eyebrow hairs longer than that, and in mock concern, I ask if I should be wearing my hairnet over them. They sort of look at each other, and hesitantly say no.... you don't need to do that. I ask why not, because it's likely that my eyebrow hairs would be in someone's food if we're worried about chin stubble. They persist that no, I shouldn't worry about it. Then I ask about the fine hairs on a woman's face. What about those? Should I be shaving? They're catching on now. They tell him to put on a beard net and leave. He does... and so do I. Solidarity.\n\nI don't think I've seen so many people double-take and start laughing before. The customers and my indirect managers thought it was hilarious. When they would ask me about it, I would just say that I was protecting the food in the store from any potential hairs, real or imagined. By noon, when the original pair of managers returned, I was having a very good day. They begged me to take the beard net off, and I pointed out that there was nothing in the store policy saying that I couldn’t wear PPE, which included beard nets. I wore it until the end of my shift that day. They never bothered Corey about his stubble after that.",
        "permalink": "/r/MaliciousCompliance/comments/kk5qjh/nothing_says_i_cant_wear_a_beard_net_with_the/",
        "comments": [
            "I like your style! Despite this being funny, I’m sure you made at least a positive impact in Corey’s life.",
            "I have a shaved head. As in, Bic razor. Bald as a cue ball.\n\nI am ***routinely*** told to wear a hair net. Over my smooth bald noggin. Not my shaved face, but over my follically absent scalp.\n\nPeople's common sense is absent.",
            "Can I just say, Thank you so much. When you get targeted by managers by no reason, it can be so hard not to feel so completely helpless and beat down and alone. Thank you for standing up for your coworker and taking the risk of going the extra mile to rub it in their faces.",
            "The world needs more coworkers like you.",
            "I'm surprised they didn't escalate things, and find a reason to write you up.  It reminds me of [this story](https://time.com/36892/girl-who-shaved-head-to-support-friend-with-cancer-banned-from-school-for-violating-dress-code/) about a girl who shaved her head to support a classmate and friend with cancer.  Apparently, a shaved head is a no-no according to the dress code, so she was told not to come back to school until she had hair.  The school only relented after a bunch of negative press.",
            "Finally a real, short, simple, delicious MC story today.\n\nAnd worker solidarity too!",
            "As someone who has been Corey.. thank you. It means a lot when co-workers acknowledge when you're being singled out!",
            "Good friend and coworker, always stand up to managerial bullying, don't give them an inch.",
            "True ally material!",
            "Nice!",
            "I like your style NeuronSauce. I shall net my beard today in your honor.",
            "Solidarity!",
            "#Solidarity.",
            "At my retail job they make us wear hairnets in the prep room, which is also cold storage. What’s funny is when hairnets became the rule, thy had just switched all processing to a central offsite facility, so we don’t actually prep anything anymore, yet we still have to wear the hairnet.",
            "Reminds me of my old Sgt during boot camp;\n\n\"Men, you will shave your face every morning! Woman you can too, we don't discriminate in this army!\"",
            "I bet it's Publix.",
            "This is wholesome malicious compliance. I love it",
            "I used to work at a place that made components for medical devices (cables). One overly self-important wanna/be engineer insisted that the shaved-head guys on the line had to wear hairnets, but never wore a beard cover himself (real neckbeard jerk). Said he didn’t have to because a) the SOP only mentioned hair covers (he wrote the SOP) and b) there weren’t any in the stockroom and c) they were itchy!  \nI was the office manager, so I just added beard covers to the next order, and when the FDA came around for the next inspection I “accidentally” pointed out the error in the SOP. \n(I’m “just the accountant/office manager”.  How was I supposed to know not to make small talk with our guests before the engineers arrive???)",
            "You know, most people are cowards when it comes to stuff like sticking up for what’s right, and I really admire your fortitude and for calling them out on their bad behavior. You set a great example for us all. Merry Christmas!",
            "It’s wild, but when I used to work at a grocery store deli, the store manager hated me for no apparent reason. One day she made my direct manager tell me, a female, to either shave or put on a beard net? Like she was literally scraping the bottom of the barrel of complaints.\n\nHer other fav target was my multicolored hair, I dye it a full rainbow one day, and some big hot shot from corporate was visiting. I like to at least say hello to them (be memorable wink wink promotion plz), and as I was going to break I took off my hat, and unleashed the rainbow. After I had walked away she was all apologetic about my hair, and he literally looked at her dead in the eye and asked why did the color matter if she has a hat? I had never laughed so god damn hard.",
            "As a fellow man... All I can say is : that was truly a Queen's Gambit.",
            "When I argued over stubble (because anything visible and they couldn't measure, needed to be covered) I brought up the fact that the hair on my arms was longer than any short beard. I backtracked real quick when they said they would implement full arm covers. I gave up real quick. Kudos to you and having it work!",
            "I work in food manufacturing, have a bald head and I’m told I have to wear a hairnet because it’s company policy. I also have a beard, so I have to wear a beard snood (net). We’re also told in the company policy that if we have 5 o’clock shadow we must wear a beard snood and this is enforced. However, women with facial hair (some stray hairs as long as my beard) are not told to wear one. \n\nMake sense of that.",
            "Love this. You, ma'am, are a hero.",
            "OP, I wish you had been my colleague when I was being shat on at a previous job. Thank you for being Good People.",
            "Even though you're a female, you're a bro.",
            "Bravo! As someone that has been \"over supervised\" by management before, I know that your support made a big difference in your coworker's work experience. It's good to know that there are coworkers that will stand up for one another.",
            "Why do I see this as wholesome?!",
            "This is the way.",
            "This Corey guy will always remember that",
            "Regardless of gender I must say.\n\nYou're a real homie my man.",
            "Damn, that's such a good way to handle that situation. It's essentially harmless and yet makes your point effectively and got the desired results. I know that back in my part time days(and probably even still today) I would have been a lot less classy than that.",
            "At the meat packing plant i used to work at,  hair nets were mandatory,  even if your completely bald.",
            "Wholesome content alert!",
            "Next you come to work with a full bee keepers face net on lmao",
            "You rock",
            "You’re fuckin awesome",
            "lol my hat off to you on that for standing up for your co-workers.",
            "Solidarity! I love that.",
            "You are a phenomenal person. Perfect story for Christmas. Corey will remember your kindness for years to come.\n\nHope you have a wonderful holiday.",
            "It seems like you were this close to getting fired in fact, you were only a *hair* away",
            "I wish you were my daughter, I'd be so proud of you.",
            "Workers Unite ✊",
            "Okay but did you wear it over your eyebrows",
            "...not only a good coworker, i'd say a good friend. well done!",
            "*sniff* *sniff*\n\nManagers behaving badly...\n\nHairnet usage...\n\nMajor grocery store...\n\nSmells like a company that sounds like Mublix to me...",
            "I love it!\n\nAt my job men are required to wear a beard cover if our facial hair exceeds a certain length. In the training videos, a *woman* demonstrates how to put one on (all in good fun)",
            "Yeah, hair nets are not PPE... \nGood way to subvert malicious manager targeting, though.",
            "Most of the stories here of maliciousness are in response to being mistreated themselves. This is next level- solidarity and support for someone else makes this so much sweeter (and more admirable).  I would love to work with people like you.",
            "Smooth.\n\nI like your style.",
            "Awesome possum!",
            "You rock!",
            "👍",
            "Letttts gooo",
            "You’re dope.",
            "Everybody liked that",
            "Good for you!!!",
            "I love how you have your coworkers backs. Super cool",
            "You should have asked those managers why they're  not wearing hair nets around their ears and nose to catch those errant hairs.",
            "TIL beard nets exist.",
            "Dude you’re awesome",
            "Nice one. You legend.",
            ":( when you want to give an award but can't.",
            "You are a die hard Bro fo lyfe yo!\n\n250+ Bro points for you",
            "Love this and I bet Corey felt ten feet tall that day.",
            "You made a friend for life",
            "This is how the world should work. Good show!",
            "this was so lovely to read. it actually brightened me up",
            "OP is Topanga",
            "Let me just say this: i love you and wish I could have worked with you",
            "/r/HumansBeingBros\nYou’re an incredible friend!",
            "I just wanna say, props to you for standing by someone being harassed. That takes something and I always appreciate it when I see it",
            "I mean, my eyelashes are def longer than stubble and those fuckers fall out all the time. Are we doing full face mesh now? Good on you.",
            "It's a shame you must embarrass them to stop being douches",
            "I hope this story is true... If so you're a legend",
            "r/resentfulsolidarity",
            "I wish more people stood up for their coworkers.",
            "I have been I'm Spartacus on several occasions. Got in to trouble for 2 in college until I suggested we involve the Dean.",
            "Hero",
            "Chaotic good at its peak. I'm sure you made many people's days!",
            "Why would they be begging you to take it off? If these managers are as bad as you're making them out to be, it's much more satisfying for them to see you possibly humuliate yourself and to be annoyed that you need to wear a hairnet over your eye brows for every single shift from then on because you do pose a good point. And then they would also force every other employee to cover their entire face and let them know YOU are the reason why. This may then incite some negative interactions between you and every other employee I find it hard to believe they begged you to take it off due to these reasons.\n\nI mean a little fib makes the story much more satisfying so you don't have to respond if you don't want to.",
            "Those guys are going to be worthless shit managers their whole lives.  They get to look forward to mediocrity and failure.",
            "Lol did you work at my store? Sounds like the level of bs my managers are capable of.",
            "I used to be in Corey's shoes in one of my last jobs and it's not good. After leaving there, the husband of the supervisor who gave me the hardest time was in the news after he was discovered to be into animals and children. I was then contacted by the place and banned from there while that person still worked there, even on their days off. To be fair, I'd have probably done things like singing \"how much is that doggy in the window\" to her.  In recent months, they've had to make a few redundancies and this supervisor and the managers who gave me a hard time (including the ones who imposed the ban) are no longer there. I was so happy I almost ran the 2.5 miles up busy country lanes just so I could laugh at them",
            "Solidarity forever",
            "Legend",
            "*Now kith*",
            "Gg",
            "YOU are a decent human being. Thank you for doing that!",
            "Fuck yeah. Stand up for the homies.",
            "Good on you!"
        ]
    },
    {
        "post_id": "t9gh6b",
        "author": "Personal_Lavishness4",
        "title": "“We’re going to have to throw them away”",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/t9gh6b/were_going_to_have_to_throw_them_away/",
        "score": 15428,
        "num_comments": 516,
        "created_utc": 1646745020.0,
        "selftext": " In the late 90s, I volunteered at a small private school.\n\nThey had little money for \"extras\" like computers. \n\nOr computer teachers.\n\nI don't know much about computers but I knew how to plug them in and I know how to put one together…if you gave me all the parts.\n\nSo naturally, I got asked to be the director of the “computer lab”.\n\nIt had two very old computers. \n\nAnd naturally, it was a volunteer job.\n\nI had very little money and a lot of time.\n\nThey knew that I wanted a job. \n\nThey told me that after I “build it up”, they would put a salary in the budget.\n\nI taught classes the difference between the components, some file structure, some BASIC, some DOS, and how rebooting your computer usually solves whatever problems you have.\n\nThe concept of “drivers”.\n\nThe thing is, the director of the school hated fundraising. \n\nSo my salary never got added to the budget. \n\nAnd the director often kept himself busy doing other things.\n\nUseless things.\n\nOne sunny morning he finds me and tells me to wish him luck.\n\n\"If today goes right,  we're going to have a huge computer lab!\"\n\nHe comes back from his meeting with a huge smile. \"I did it! I convinced a bank to donate to us their old computers!\"\n\nOk. Great.\n\nNow I have to set up and maintain 50 new (for us) computers. \n\nI can’t wait.\n\nThe computers got delivered the next week\n\nAll terminals. These were Bank Computers.\n\nI had no idea how to get them running. They didn’t have hard drives. Or operating systems.\n\nThe keyboard and mouse ports were different. They were not the standard ps/2 (at the time).\n\nI think they somehow connected to a server, which did not get donated.\n\nTheir monitors only did text. No graphics.\n\nThey were useless to us. \n\nWe needed something to run America Online. Encarta. Maybe Simcity. You know, educational stuff.\n\nI had no idea how to get these to work.\n\nI tried asking the director,  telling him that the 50 computers were useful…\n\nHe got super annoyed.  \n\n\"I'm sure they can be helpful in some way. They must be worth something. Figure it out…because if you can’t we’re going to have to throw them away.\"\n\nHe thought he was threatening me.\n\nHe did not think I'd throw out 50 computers. After all, he worked hard to get them.\n\nI did not hesitate at all.\n\nMy next class, I had screwdrivers for everyone.\n\nWe disassembled everything. \n\nIf it had a screw we unscrewed it.\n\nThe class figured out what each piece was.\n\nAnd then the class activity was to take the pieces to the dumpster.\n\nBy the end of the day, there was nothing left.\n\nThe next day the director asked me where the computers were.\n\n“Oh, you were right! They were very useful. The students took them apart, learned all about the different components, and then threw them out. Just like you said we should!”\n\nHis face turned all sorts of colors. And he stormed out.\n\nWhat I didn’t tell him… is that I saved the RAM from the garbage.\n\nI mean, after all, it was in the garbage. Right? \n\nAnd sold them on the online classifieds (Remember Yahoo Classifieds?) for $20 apiece.\n\nThere were two in each computer….so I got $2,000.\n\nI guess they were useful after all.",
        "permalink": "/r/MaliciousCompliance/comments/t9gh6b/were_going_to_have_to_throw_them_away/",
        "comments": [
            "Giving old shit like this away is a good way to avoid having to pay for someone to take it away.",
            "In the late '80s I worked at Sears in their catalog department. We took orders over the phone and made those annoying outgoing sales calls, inevitably while you were having your dinner.\n\nI'm very sorry for that.\n\nWe took the orders by hand, and then sent them off site in batches to be processed, until one day, we were informed with great excitement that we were getting computers!\n\nThese were mainframe terminals, not actual CPUs, connected to the main system through God knows how.\n\nThey built us new desks, brought in monitors and keyboards and computers, and then made us way about 4 months for the whole system to go live.\n\nI get it. They probably wanted to make all the stores go live at the same time and this takes time.\n\nThe manager and supervisors we're mostly retired older women with zero experience with computers.\n\nDuring quiet times, I would practice my typing on the disconnected keyboards.\n\nRemember that they weren't even powered on, probably not even plugged in.\n\nI got scolded numerous times because I was going to break them, or put the wrong information, and slow the whole project down.\n\nOverall, the project was a success, and guess who they came to when the system had been down to input the backlogged orders?\n\nGood times.",
            "Pls don't message me calling me names.  Think about this. I was teaching. For nothing. And dumpster diving. In the school dumpster. Because i was out of cash. Are you sure I'm the bad guy?",
            "damn the only part valuable was the ram nothing else?",
            "B-E-A-Utiful. I love this.",
            "People saying you stole those parts need to see how: \nA) they were already in the trash\nB) you were probably robbed waaay more than that in wage-theft \n\nGreat story!",
            "Once I was told by work to throw 6 PCs in the trash.\n\nI did. \n\nAnd then rescued 5 from the trash (and kept the parts from the broken 6th one) and gave them to friends/family because they were better than the computers they currently had.\n\nFree RAM upgrade for me too, and a nice spare keyboard and mouse.",
            "Makes me glad we had a director and vice who both embraced computers since their university days, so in the mid 90s they worked their asses off to milk every source of grants on the planet to make our school an example for all the others in the state to follow. \n\nWe had decent programming classes, a school homepage, a digital yearbook, videography courses (also to record school highlights for the web and the yearbook CD) and other offerings when other schools were barely even moving away from typewriters.",
            "When I was in IT support, my brother told me he'd bought a second hand computer off some bloke in a pub and could I help him set it up?\n\nSure, no problem! Went round to his house, and immediately realised what he'd done.\n\nMe: Oh, a Harris terminal, how cute! I haven't seen one of these in years. So, this is the keyboard, attached by this curly cable to the monitor here. And then you connect that to the computer through the VGA port at the back. So, where's the computer you bought? \n\nBrother: Er, oops.",
            "I’ve worked my ass off to get donations for kids. Always stunned by the crap businesses wanted to give for the write off (and we got stuck disposing them). You did an amazing job w/ zero budget and gave the kids a WAY better education than if you’d kept Director happy & stored them in a corner “waiting for the software”.",
            "Freaking terminals.....",
            "Those were dumb terminals, and they needed a mainframe, not just a server.  If the bank was getting rid of them, they were probably garbage to start with.",
            "[deleted]",
            "Went to school with a kid that was arrested for stealing all the ram out of the private schools computers and using the money he got from the ram to feed the homeless 😂😂😂 it was literally a mission impossible raid he hide in the ceiling until everyone left the building",
            "OP used sweat shop child labor to steal computer components from a school and sell them on the black market for personal gain. I like it.",
            "Well, OP, while you made a \"bundle\" on those RAM chips, you may have missed the boat on something more valuable. \n\nBack in the 70s or 80s, a certain state university wanted a computer system, and turned it over to the electrical engineering department. Seems the later head of the computer department where I studied was involved with building the computer. As an instructor, later on, that university decided to get a new computer and was going to scrap the old one. Instructor said he'd take it. Took it apart because he knew what was in it, and reclaimed all of the gold solder, connections, and made out like a bandit. He was able to pay cash for his next house when he moved to this area because of that.",
            "I feel like I was in a class that disassembled these very computers. Please tell me it was in Media, Pennsylvania.",
            "$2000 USD in 1997 is $3500 today!  Nice bonus.",
            "If i was a student that class i would still remember that amazing day even now! SO wonderful for them",
            "In Cryptonomicon, Neal Stephenson describes how a good sergeant can bring a captain to tears, merely by obeying his every order. This is that.",
            "To be fair, taking them apart to learn components was actually a really smart use for them.",
            "He got the bank to donate 50 old dumb terminals?\n\nUggh..",
            ">Maybe Simcity. You know, educational stuff.\n\nNever have truer words been spoken.",
            "If only you had known how to recover the precious metals from those components.",
            "We lived on a busy road, and it was never IF the item would be gone, but WHEN. Hubs and I used to bet on the time, 15min., half hour. Never put anything out that wasn't picked up. Longest time was 2 hours. The only caveat was that we had to be careful what we left in the front yard, or it might be gone also.",
            "  \nSounds like 3270 terminals.  Blue Cross Blue Shield donated a bunch to our University in 1982.  We had a mainframe to connect them to and we didn't have to punch cards anymore.",
            "you're right, if they were terminals, they connected to a server. they would display text that the server sent them. and whatever you'd type on the keeb would get sent to the computer \n\nextremely cool when you have a big server with a multi-user OS (Unix, Linux). each user can log-in under their own username and work simultaneously. very not cool when you don't have a single computer \n\nyou can look up ADM 3 or VT100. very interesting (and elegant and simple) concept. though there's a chance that bank used proprietary \"stream\" terminals rather than standard character-by-character ones, and those required proprietary software / OS on the server side. I. e. a useless nightmare once you're out of that ecosystem",
            "Prolly dumb terminals. Get a multiport board and some Unix variant and one 4MB Ram machine might support a dozen terminals and the kids can learn about unix programming. \n\nCourse I didn’t learn all that till the late 90s.",
            "50 bank terminals. Olivetti, by any chance? Those things were HEAVY.",
            "[deleted]",
            "Maybe he should've, you know, asked you the only computer literate person, to take a look and see if the banks computers were worth adopting.",
            "neat story but i hate this fucking writing style. ive never been so irritated by something i willingly sat through in my entire life",
            "Why did you write this like Christopher Walken talks?",
            "I'm not gonna call you names, but shit son, each sentence as a paragraph? What a madman.",
            "Why\n\ndo\n\nyou\n\ntype\n\nlike\n\nthis\n\n?",
            "Why did you put up with it at all?",
            "Back in the day (c. 1977) my father was a maths teacher, and because he knew a little bit about computers having been a student working on some of the very earliest valve computers at the University Of London in the 1950's, he found himself in the same boat of managing the school computers. A local laundry company were upgrading their computer and donated their old one to the school. It was a very early ICL George 3 mainframe (1900 model I think) that ran off punched cards, and consisted of 4 large boxes (think large chest freezer sized) housing a card reader, massive printer & processors, plus a teletype terminal. It basically took up a whole room. To get the thing up and running they had to rewire the whole room and install 3-phase electricity which was not cheap, and after much trial error they finally got it working.\n\nThe first thing you had to do every time was read in a set of a couple of hundred punched cards that effectively installed the operating system (called The Executive). Once that was loaded then you could read in other punched cards containing whatever programs you wanted to run.\n\nMove forward a week or two and my father is demonstrating the computer to a new class. He shows them the stack of cards that make up The Executive and explains how they need to be loaded first in order to get the computer up & running. Out of the blue the class headbanger thought it would be fun to pick up the executive and throw it in the air, so that all the cards came down like confetti. Unfortunately that was the point it was realised that a) they only had one copy of The Executive, and b) the cards were not numbered, so they had no idea what order they needed to be sorted back into. The computer never ran again, and sat in that room for about 10 years before my father finally sold it for the scrap value of the gold on the circuit boards.\n\nA few months after the incident the school got a Commodore Pet which sat next to the teletype for several years until the advent of the BBC Micro and a proper computer lab being created, and that Pet was way more powerful and usable than the mainframe ever was.",
            "What on earth is up with your paragraphs? Feel like my brain is bouncing around inside my skull.",
            "The way you wrote this reminded me of [The Story of Mel](http://www.cs.utah.edu/~elb/folklore/mel.html).",
            "Reformatted for those who like paragraphs, but not too many paragraphs:\n\n> In the late 90s, I volunteered at a small private school. They had little money for \"extras\" like computers or computer teachers.\n\n> I don't know much about computers but I knew how to plug them in and I know how to put one together, if you gave me all the parts. So naturally I got asked to be the director of the “computer lab”. It had two very old computers and naturally, it was a volunteer job.\n\n> I had very little money and a lot of time. They knew that I wanted a job. They told me that after I “build it up”, they would put a salary in the budget.\n\n> I taught classes [about] the difference between the components, some file structure, some BASIC, some DOS, how rebooting your computer usually solves whatever problems you have, and the concept of “drivers”.\n\n> The thing is, the director of the school hated fundraising, so my salary never got added to the budget, and the director often kept himself busy doing other (useless) things. One sunny morning he finds me and tells me to wish him luck.\n\n> \"If today goes right, we're going to have a huge computer lab!\"\n\n> He comes back from his meeting with a huge smile. \"I did it! I convinced a bank to donate to us their old computers!\"\n\n> Ok. Great. Now I have to set up and maintain 50 new (for us) computers. I can’t wait.\n\n> The computers got delivered the next week -- all terminals. These were Bank Computers. I had no idea how to get them running. They didn’t have hard drives or operating systems. The keyboard and mouse ports were not the standard ps/2 (at the time). I think they somehow connected to a server, which did not get donated. Their monitors only did text -- no graphics. They were useless to us.\n\n> We needed something to run America Online. Encarta. Maybe Simcity. You know, educational stuff. I had no idea how to get these to work. I tried asking the director, telling him that the 50 computers were [not] useful. He got super annoyed.\n\n> \"I'm sure they can be helpful in some way. They must be worth something. Figure it out…because if you can’t we’re going to have to throw them away.\"\n\n> He thought he was threatening me. He did not think I'd throw out 50 computers. After all, he worked hard to get them. I did not hesitate at all.\n\n> My next class, I had screwdrivers for everyone. We disassembled everything. If it had a screw, we unscrewed it. The class figured out what each piece was, and then the class activity was to take the pieces to the dumpster. By the end of the day, there was nothing left.\n\n> The next day the director asked me where the computers were.\n\n> “Oh, you were right! They were very useful. The students took them apart, learned all about the different components, and then threw them out. Just like you said we should!”\n\n> His face turned all sorts of colors. And he stormed out. What I didn’t tell him is that I saved the RAM from the garbage. I mean, after all, it was in the garbage. Right?\n\n> And [then I] sold them on the online classifieds (Remember Yahoo Classifieds?) for $20 apiece. There were two in each computer….so I got $2,000.\n\n> I guess they were useful after all.",
            "My only issue is that every clause doesn’t need to be its own sentence. \n\nAnd you don’t need to use return after every sentence.",
            "I was assigned a computer lab to teach in. I'm an English teacher, employed as an English teacher. I do know computers and programming though.\n\nAnyway I went to the lab, which had 40 computers. After testing, I determined that (a) The computers were OLD...about a decade each and  (b) Only 7 of them were working.\n\nI talked to the principal and was told there was no budget to fix the computers. That was all I was getting.\n\nSo then I went and tested every mouse, every keyboard, every monitor (some computers were still ok, just the monitor was busted) swapped the parts around and managed to assemble 15 working computers! As there were only 12 kids in the class I was very happy with this and told the principal.\n\nThe principal was aghast. Apparently all these computers are \"tracked\" by the school's parent company accountants, each part has a serial number, and you are not allowed to mix and match parts. He asked me to put all the computers back again.\n\nSo I examined the computers and yep each of them had a sticker with a serial code on it. So I put them all back. And now we were down to 7 computers again.\n\nAnd I had to get the kids to pair up, one computer to two students....\n\nSeriously annoying.",
            "1.Your writing style is terrible\n\n2. I tried asking the director, telling him that the 50 computers were **useful…** this is the opposite of what you claimed.",
            "I was gonna ask how many computer $2,000 could buy in the late 90's",
            "hell yeah op",
            "This is poetry",
            "In the late 1990s my sister was teacher in an inner city school and some rich guy donated a bunch of PCs. These were brand new towers with 17\" CRT monitors.  But of course there was no money to support them or train anyone, including the teachers, on how to use them, or even set them up.  Neither was there room to store them. So they were doled out, one per classroom and sat unopened in boxes. My sister stacked the boxes, draped a piece of cloth over them and used it as a table for books.",
            "Did something similar but was told those old cathode ray tube monitors could hold a dangerous charge. Did not disassemble…",
            "I guess you did get paid for that job after all hahaha",
            "Why\n\nIs this \n\nIn \n\nFree verse \n\nFormat",
            "In the late '80s I worked at Sears in their catalog department. We took orders over the phone and made those annoying outgoing sales calls, inevitably while you were having your dinner.\n\nI'm very sorry for that.\n\nWe took the orders by hand, and then sent them off site in batches to be processed, until one day, we were informed with great excitement that we were getting computers!\n\nThese were mainframe terminals, not actual CPUs, connected to the main system through God knows how.\n\nThey built us new desks, brought in monitors and keyboards and computers, and then made us way about 4 months for the whole system to go live.\n\nI get it. They probably wanted to make all the stores go live at the same time and this takes time.\n\nThe manager and supervisors we're mostly retired older women with zero experience with computers.\n\nDuring quiet times, I would practice my typing on the disconnected keyboards.\n\nRemember that they weren't even powered on, probably not even plugged in.\n\nI got scolded numerous times because I was going to break them, or put the wrong information, and slow the whole project down.\n\nOverall, the project was a success, and guess who they came to when the system had been down to input the backlogged orders?\n\nGood times.",
            "More theft than MC, but at least you got something for your time?",
            "Today, you can’t just throw it in a dumpster.   You would have to pay a special disposal service to dispose of them and keep records.  There are a lot of hazardous materials in there",
            "Every sentence on its own line is worst then a block of text. Learn some formatting, Jesus Christ.",
            "Why do you\n\nDo this\n\nReally annoying\n\nSplit line\n\nBullshit",
            "What’s up with Reddit posts where the OP makes themselves like the Peter Parker of the world, humble yet amazing. Also what private school doesn’t like fundraising and doesn’t pay teachers, and calls them directors when they have no other teachers in the program? This is some crazy nonsense.",
            "That last part there... the gangsterraper is pretty sure that's theft.",
            "TIL: Larceny is cool.",
            "Dude.  Dumb terminals in those days had PLENTY of uses.  You just needed to know how to make them work!\n\nYou could have asked them to buy a small Unix system and then you could have run them in VT100 terminal mode with RS232 connectors and you would get a working shell on every terminal, you could then have taught BASIC, some shell scripting and lots of other things.",
            "How the fuck did you work at a *private school* that didn’t have a basically unlimited budget?\n\nTuition at private schools is like $50,000 per student per year.",
            "That ending, though. You could have spent that money on buying computers for those kids, right?\n\nAt the end of the day, you stole from a school, dude. Not cool.",
            "Why did kids need to learn computer skills in the 90s? I didn’t touch a computer until 2005 and I’m fine.",
            "[I ain't reading all that crap](https://www.youtube.com/watch?v=JrY1iOgd0Ic)\n\nSeriously, this sub should start enforcing TL:DR Some peeps think they have the penmaship of reknown authors when they just add a lot of useless shit to their Grandpa Simpson rants.",
            "\"Simcity\" is educational?",
            "Why don’t they put it all the way in",
            "You definitely should've checked in before throwing them away lmao",
            "I live that kidney shot at the end where you saved the RAM and got a little side action. Suck it, director.",
            "Ah, dissection day was always the best part of biology class.",
            "I guess your paycheck came in in the end",
            "This is what happens when tech decisions are made by people who don't know tech.",
            "I mean I get computers are expensive but how hard is it to get a few from a library that was getting new ones?",
            "Sounds like you finally got funding. lol",
            "OP: I don't know much about computers\nAlso OP: I could put a computer together if you gave me all the parts.",
            "We were doing a desktop refresh at a job - hundreds of them.  Staff wanted to know if we'd be selling them cheap.\n\nNo.  We didn't let the staff have a single one.  They all got wiped/donated  because we knew that we'd still \"own\" them when something broke.",
            "We bought a cabin and it came with a purple sofa with a hole burned in the side and mouse poop in it.  We brought it home and put a free ad on Craigslist stating as such.  I moved the sofa to the curb, posted the ad and five minutes later a white cargo van drove up with young kids walking around inside.  The two adults jumped out loaded it and drove away with back door open.",
            "There was a law office that made a donation to my wifes school she teaches at. They told the school it will have some various computer accessories and office supplies like pens pencils highlighters.\n\nWhen the school got it they made all the trachera go through it. None of the pens or highlighters worked there were no pencils, the computer parts were broken keyboards, old roladex, old calculator with the paper scripts, broken binders, broken staples, and a bunch of other useless junk. \n\nThey threw it all away. Its sad how schools need funding, teachers buy supplies out of their own paycheck, parents dont support the teachers but yell at them about their poorly behaved brats, and then businesses do that shit that they know is useless.",
            "Mid-90s the nuclear plant in Hanford, WA was getting shut-down. My teacher drove a his truck out to get a load of old computers that they were getting rid of. We spent the next few weeks testing power supplies, mother boards, monitors, floppy drives, etc, assembling them into working computers, and installing DOS. We learned a bunch about electronics and computers and his room then had its very own computers.",
            "The bank was able write this \"donation\" on their taxes.",
            "Used to work at a non-profit.  \"Donated\" items are 9 times out of 10 just old, incompatible crap.  But the place doing the donating gets to take nearly full market value off their taxes.",
            "Dr. Thaw, is that you? 😂 \n\nMy high school received PCjr's donated from an elementary school. Finally, IBM took pity on us and gave us model 25 and 30 PS/2's. Later, they gave us an all-in-one 486SX. There was $100k or more in the budget for computer lab hardware, software, and activities, but the school district sat on it because bureaucrats.",
            "I work for a state job in IT...we just upgraded a ton of people to laptops/new laptops. The most painful part of my career was that we had to pay a salvage company to come take all of these working computers and laptops. Like these were better than any of the computers I saw in my high school, and I get why we had to have the hard drives destroyed but the rest of the perfectly working machines...nope not donated, not sold...nope we paid someone else to take them , pop a new HDD in and sell em. Or possibly to scrap them as salvage. I mean I understood the old monitors and some stuff but that was like a hundred or 2 desktops and laptops we sent out that day.",
            "\"the 50 computers were useful\" or \"useless?\"",
            "My public school was given a load of outdated PCs in the late 90s when the state govt gave themselves an upgrade. They arrived on pallets. Most of them didn't work and were missing parts. My cousin and I were no strangers to technology and volunteered to Frankenstein working computers from all the junk for classrooms. We each got to build ourselves a computer as a reward. It was my first PC and I loved it! I got a 50ft phone cord that I would sneak out into the hallway phone in the middle of the night and spend all night in chatrooms. I can't believe I made it through high school with how little sleep I got!"
        ]
    }
]