[
    {
        "post_id": "i07v06",
        "author": "coriann0226",
        "title": "Can’t use my cell phone at work? Have fun texting me when you want something!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/i07v06/cant_use_my_cell_phone_at_work_have_fun_texting/",
        "score": 15164,
        "num_comments": 511,
        "created_utc": 1596053882.0,
        "selftext": "I used to work as a manager at a small business. I was the only employee on site during the day, so I was expected to answer the phone, check in deliveries, help walk-in customers, etc. any time they came in. Because I constantly needed to be available, I didn’t have a real lunch break, I would just eat my lunch at my desk when I had time. \n\n\nOne afternoon one my boss called me on the office phone and very casually asked  “Hey, what’s going on? What are you working on?” I told him the project I was in the middle of, and he said “Really? Because I’ve been watching the cameras and you’ve been messing around on your cell phone for the last five minutes!” I explained to him that my fiancé had texted because there was an emergency that had come up and I was trying to help him handle it, giving him the account information, logins and passwords, etc. since I was working and couldn’t handle it. His response was “I don’t care! I don’t ever want to catch you on your phone again!” I tried to explain that I didn’t get any breaks or anything during the day, so I didn’t have any of my own time to handle things that may come up, but he didn’t care. \n\n\nSo, knowing full well that the owners, the other managers, and staff members constantly texted me throughout the day whenever they needed something, I complied. \n\n\nThe next day I came in and I left my phone in my purse. I had a smart watch, so I could see when I got a text, but I didn’t answer, because I wasn’t allowed to be on my phone. After two days of me ignoring their requests during the day and only answering their texts after leaving (saying “Sorry, I didn’t see your text because I’m not allowed to be on my phone at work. I’ve already left for the day.”), my boss came in and told me we needed to have a discussion. \n\nHe called me out on my malicious compliance, but also acknowledged that I was essentially locked in the office for 8 hours a day. So, going forward I could take a half hour lunch break where I didn’t have to do anything else, and I was allowed to use my phone during the day, as long as I didn’t abuse the privilege.\n\n\nEdit: for everyone commenting that it was illegal for them not to give me a lunch break, that’s not the case in my state (breaks are not federally mandated in the US).",
        "permalink": "/r/MaliciousCompliance/comments/i07v06/cant_use_my_cell_phone_at_work_have_fun_texting/",
        "comments": [
            "I used to work as a Quality Control Supervisor for a fueling company at a major airport in the US. Standard policy for being on the AOA (Aircraft Operating Area, i.e. \"The Ramp\") is absolutely no cell phone use. This is for safety as that environment is full of hazards and even a momentary distraction can be disastrous. Well, as I supervised the entire operation I couldn't simultaneously monitor the 6 different radio channels we had. As such, my work phone was routinely my communication device.\n\nI was standing near the terminal building in an area far removed from aircraft, but still part of the AOA and the Ramp Patrol (airport compliance officers essentially) saw me, didn't care for my reasons and issued me a citation. Get too many of these and your ID is revoked, effectively getting yourself fired. Ok, no phone on the ramp, gotcha covered boss!\n\nPretty soon airline reps couldn't reach me and as such aircraft delays went up. The Fire Inspector couldn't reach me, so equipment was tagged out of service for minor things easily fixed. The Airport Duty Manager/ADM (Person in charge of the operations of the airport) couldn't reach me so all hell broke loose. I told everyone when asked that I was merely complying with the rules as I didn't want any more points on ID.\n\nAbout three weeks into it the ADM calls me and asks if I was available that afternoon. I go up to his office and he explains that they are amending the rules so as to allow the use of cellphones in designated areas away from aircraft as well as when in a stationary vehicle. Also, my citation would be wiped. Now, would I please start carrying my phone?\n\nI laughed for a while at that small victory.",
            "Your manager got on your ass for spending 5 minutes on your phone? I hope they pay great or you're looking for better.",
            "I love it. They can be so up their ~~asses~~ made-up rules that they don’t notice how much they hurt employee productivity and, ultimately, business. \n\nAt my old job, they made up a greeting for the client care team to use, as well as a script for phone conversations to “represent the business professionally”. They said they will be listening in to phone conversations to ensure compliance. Client care team argued that most of our long-term customers are used to having a small talk before jumping to business, they knew everyone there and scripts would just be off-putting. Nope, greeting, scripts, go. Four long-term contract customers ended up sending emails up the chain saying they enjoyed doing business with us because of established relationships with their customer representatives and didn’t appreciate the robotic phone conversations. The scripts ended up canceled. Good riddance.",
            "You should also made absolutely sure you took all earned breaks and a full lunch, and of course not being on the clock refuse to answer any calls.",
            "I had a similar problem at a place of work over 5 years ago.  I was written up for cell phone use during working hours.  During the write up, I showed the supervisor and the HR rep that the text I was responding to was in fact work related, but the ass-hats wouldn't hear it.  So, I informed them that I would no longer be available by cell to the company on or off the clock.  This proved troublesome as I am the 'go to guy' for about 3 of the company's premier products.  Over the next few weeks the company lost some existing clients and failed to get a few new clients (if my buddy in Sales is to be believed), because the Subject Matter Expert for those things wasn't available in a timely fashion.\n\nWhen the supervisor and HR came back to me 'failure to answer my phone', I referred them back to my write up.  Later in the conversation they agreed that they were wrong about that.  Over the next few weeks I was able to leverage my recently discovered value into a promotion in title and pay.  I ended up leaving the company about a year later, as stupid spot policies like this made other companies more attractive all the time.",
            "Another dumb manager.  I have had this kind of micromanager who seems to know every second of your work day and what you were doing, but they often seem to have no idea what the output of your shift needs to be.  They end up obsessing over things like use of cell phones rather than watching work quality.\n\nI hate that kind of manager because most of the time they are covering up their own inability to do the job.",
            "UK, Many years ago I was working as a security officer, if you want to bring a tv or radio on site you needed permission of site supervisor, supervisor was on annual leave I wanted to bring a scanner to work, knowing the rules  sought permission from the area manager, all's okay.\n\nSite supervisor returns from annual leave, finds out I got permission from above him he went on a rant about going via him first, he then banned me from having the scanner, he is an ex cop he wrongly believed scanners were illegal, so he banned me from using radios on site.....\n\nThis lead to a row almost lead to punches, he told me that I was banned from using any radios or radio equipment on site, a key piece of equipment for security is the two way radio, okay so I cant use this (I slammed the radio down), if you want to contact me contact me via the page.. oh wait, it's a radio pager (I slammed that down), I rang head office and demanded to be taken off of site, I was a couple of hours later, during that time I never replied to him over the radio,",
            "I worked for a company that does a variety of classified work, and in particular I provided IT support for about four different classified labs. Since these were classified spaces, we weren't allowed any \"wireless devices\" such as phones or two-way pagers, but one-way (receive only) pagers were fine.\n\nThe problem was that if I was spending time working on something in one lab, nobody could call me if there was an emergency in one of the other labs, since my cell phone would be sitting in a locker outside the lab I was in. They'd have to go from one of my labs to the next, looking for me. So I asked my boss, hey, why don't we get a one-way pager for me, and then I can know when another lab needs me?\n\nSure, my boss said. Just get one of the projects you support to pay for it. You can probably guess that none of the individual projects were willing to pay the costs of a pager that all four of the labs could use to contact me; they figured this should be IT overhead and shouldn't come out of their budget. Meanwhile the IT position was, we have provided you a cell phone for customers to contact you, and therefore we aren't paying for another device.\n\nI never did get a pager, and until the time I left that job people always had to comb the building looking for me if there were ever anything urgent in a lab I wasn't in.",
            "Ha! This is perfect. We also \"aren't allowed\" to use our phones while working (as i am right now) but our bosses will legit text us and call us instead of contacting us using the radios. I even had one manager get pissy with me because i wouldn't add him on fbk so that he could give me work orders via messenger. Once i head out the door to work i completely turn off and stow my phone. It annoys them all, but i did not make the (federally enforced) rules.",
            "Anyone going to discuss how creepy it is that he just goes and says: i was watching you on the cameras? No, just me? Okay.",
            "I got chewed out for leaving a charger in the break room overnight. That’s it. I had my phone in the back charging because I didn’t have a car at the time, if I didn’t have a phone I couldn’t get ahold of my ride.\n\nThe DM called me the next day and screamed at me then wrote me up. I didn’t even touch my phone other than my break.",
            "My ex's employer makes all employees lock their phones in a locker when they arrive at the office. They can pick them up when they leave for lunch (and put them back coming back from lunch) and when they leave at the end of the day. That is some fucking bullshit, let me tell you. The dog was sick one morning and I had to rush her to the vet, it was a huge scare (in the end she was fine, thank the Elder Gods) and my ex didn't even know it happened until 9pm. It happened to be a day when she didn't take a lunch break and did some overtime. :/",
            "My first job (at a BBQ restaurant) when I was 15, we also weren't allowed breaks and actually weren't even allowed to keep our phones on us on the clock. NO EXCEPTIONS. I worked 8-12 hour shifts, no breaks unless it was for a smoke. I had a family emergency at home one day and kept my phone on me that day, making frequent trips to the bathroom to respond to my text messages. \n\nMy manager took notice of all my trips to the restroom, and followed me in without me noticing. She peered through the crack and watched me stand in the stall and check my phone, respond to a text, and when I came out, she was standing there with her hand out to take my phone from me and wrote me up. I cried the rest of the day. \n\nI wish someone would try to do something like that to me now",
            "Wow what a dick to call you out on doing what he said to do. “ I know your doing what I told you, but you should know that when I say something I actually mean something else”",
            "[deleted]",
            "Urgh. Used to have this when driving from site to site. \n\n“Why didn’t you answer your phone?”\n\nI was driving. \n\n“So? Use your phone when you drive”\n\nI’d like that in writing. \n\nNever did. Idiots.",
            "[deleted]",
            "Wow. How gracious of him to let you have a break. Asshat.",
            "Good managers know it's okay for their employees to take down time, if the end point goals were reached.  Projects done, all consumers helped, phones answered.\n\nBad managers don't know how to assess their employees productivity and start micromanaging things that aren't actually important",
            ">for everyone commenting that it was illegal for them not to give me a lunch break, that’s not the case in my state\n\nMan what the *fuck*. The US is wild.",
            "I feel this pain so much. This is exactly what we go through. We all use our phones to run outlook for company email, teams, texts, phone calls, various speciality apps and calculators, charts, and resources to keep in touch. Everyone from engineering to production, technicians, and management do it.  Except...management thinks we're just screwing around despite asking us to do everything around our phones.",
            "Im literally doing that now. My manager got pissy about the same thing. I simply dont do ANYTHING work related if im not on the clock. Ive had multiple calls about stuff needing to ship now and the truck was there to get it but they couldnt locate it for some reason. Sorry i missed your calls and text i was off the clock. (Im an hourly worker)",
            "This one is always fun.  About nine years ago my boss had a melt down because people were on their phones.  Ok fine we put them all away.\n\nWould take off with the work vehicles with people supported.  And not answer calls texts emails etc.\n\nWhy didn't you answer?  It was important!\n\nYou said we couldn't use our phones while on the clock.\n\nNot our problem you don't provide us with a communications device.",
            "I wish breaks were federally mandated. My state has literally nothing on breaks so they could make me for 18 hrs without one. Usually only work for 5 or 6 before a breaks but that's cause the company is kinda nice about it.",
            "Hooray! Fuck douchey managers, especially ones that spy on their employees!!",
            "I work in retail with a no phones to carried outside of breaks. \n\nThe manager constantly has their phone out showing members of staff their gaming stats and other personal stuff with no relation to work.\n\nAbout once a year they have a major freakout at staff (usually newer hires) breaking the no phones policy. I wonder why some people fail to comply with the rule /s",
            "My boss is similar, he basically has very little functionality. Between the leading hand and myself we make sure shit gets done.\n\nEvery now and then he tries a powerplay like that to show he is boss or to feel like a boss but he only shoots himself in the foot because we get things done by being autonomous, taking away any autonomy without participating actively will stop work from getting done.\n\nThese people are the ones who end up in their position because of who they know and sniping. He doesn't care for the job or to take interest in the work all he wants is to keep getting his wage without any \"headaches\" and to flaunt his position.\n\nBut outsourcing all his work bites him in the arse when he tries to bully either of us with his position because he needs us and has allowed us to become the keystones in the operation through his own laziness and apathy.",
            "Wow.  He decided to give you your legally mandated lunch break.  What a great guy.  Boss of the year.",
            "This is giving me severe flashbacks to the job I quit in 2019.  This wasn’t a small chain of sex stores in the south was it, lol?  I used to hate getting a message from the boss being creepy & admitting they were sitting in the office watching me to make sure I wasn’t “slacking off.”",
            "Oh look my job currently. They expect our lives to end once we hit that punch in clock and that's just not how it works. I'm sorry but it doesnt.",
            ">for everyone commenting that it was illegal for them not to give me a lunch break, that’s not the case in my state (breaks are not federally mandated in the US).\n\nThe hell is wrong with you over there on the other side of the big pond?",
            "While it may not be illegal not to give you a lunch break, im perplexed by the off site boss watching you on the cameras.\n\nIn Norway security cameras can only be accessed in the event of for example a robbery, and its very illegal to go check up on your employees. This is all kinds of fucked up but I think you handled it well. Way to go girl!",
            "So you're not allowed to take a few minutes to help fix a family emergency, but it's perfectly ok for the boss to sit on his (no doubt) fat arse and use security cameras to spy on his hard workers? What an irredeemable scrotal tumour.\n\nIt's shit like this why revolutions start.",
            "Isn’t it illegal not to give you breaks during 8 hour shifts? That sounds pretty darn illegal...",
            "Living in the UK.. seeing the potential Hellscape of slave-like conditions and not even an unpaid half hour for lunch being made normal here😷 where is my damn visa to Australia",
            "I took a toilet break at work, boss called me and asked about something. I told her, and then she starts telling me off for having my phone on me. Then how am I supposed to answer when she calls?",
            "I worked in a large store. We all used to keep our phones on us just because we had nowhere safe to keep them. Then one day they were all banned. No phones on us. I became impossible to track me down on the shop floor. I also had no idea what the time was so I missed my lunch slot constantly. One day no one could find me. When they checked the cameras it was hilarious. The supervisor just kept missing me. There were two staircases and a lift that I could take around the store. I was zooming around the store so fast that they just missed me every time. It was hilarious and eventually the store bought walkie talkies for us, then phones were allowed back. I also got in trouble for having my phone in my pocket after a staff member in test needed to borrow my sim card. Not a big deal, but I had no time to run up four flights of stairs back to the staff room with it. I just taped the sim to the back and carried on working. Of cause someone saw it through my jeans, snitched and it became a while ordeal. Luckily it ended when they realised one, the phone was useless without a sim, two, I only had it on me because someone requested my sim and three, it had been ultra busy and me leaving would have gotten me in trouble as well. It was a no win situation. I asked what I should have done. They told me I should have taken the phone back upstairs. I asked them would I have gotten in trouble for that, they said yes. No win situation. \n\nI'm so glad I don't work retail anymore. It was hell.",
            "Lmao everyone gets so shocked when I tell them that my coworkers and I don’t technically get breaks if we gotta eat we just sit down and eat then get back to work. They’re always trying to tell me it is illegal and then I have to explain to them what a right-to-work state is",
            "My boss was the same way. Bc we worked with patient materials and sensitive information, we weren’t allowed Sri use our phones at our desk. We were supposed to take the call/text outside and deal with it then",
            "Sounds like a 30 minute break that is your time and not work time so no reason to look at or respond to work related messages...",
            "That sucks, no lunch breaks? Assuming you're in the US, I know what state you live in, and that's so wrong that it's legal to do that shit there.",
            "> breaks are not federally mandated in the US\n\nCan someone remind me WHY Americans think their country is the best again?? \n\nThe more stories I hear, it is worse the a 3rd world country at this point! \n\nYou have to take a loan out if you break a toe.  I pity.",
            "I have sort of a similar experience. \n\nWhen I was in my mid-twenties I was a lead dispatcher at a national HVAC company. My shift was always 4pm-1am. Most days there would be a total of 3-4 of us closing the building together. On Sundays though I worked alone so I closed the building & left alone. The company was located in an industrial area in Florida. Industrial areas are typically not a sade place to be in the middle of the night alone as a woman. \n\nOne time my team, me, our supervisor had a meeting with the owner of the company. He told us we couldn't have our cell phones in the building at all (we didn't have lockers to store our belongings in) & that we needed to leave our cell phones in our vehicle. I brought up how I leave my shift in the middle of the night & on Sundays I was alone for it, I needed my cell phone for emergency purposes if anything were to happen to me when I left the building at 1am. \n\nHis response was - carry a concealed gun 🙄🤦🏻‍♀️\n\nSame company installed cameras in our building & there was one in the dispatch room I worked. The president, VP, & the supervisors all had access to the live stream of these indoor surveillance cameras & would watch the cameras when they were at home. \n\nOne Sunday evening I was working alone as usual. Weekend dress code was super casual since my small team was the only employees in the building on the weekends. I was wearing pretty short yoga shorts & a t-shirt. I got up from my desk to walk across the room & adjust the thermostat, then walk back to my desk. \n\nI could hear the surveillance camera turning to follow me from my desk to the thermostat back to my desk. I have no idea who was watching the video & controlling the movement of the camera that day & it was super creepy that were spying on me like that.",
            "Dang your state blows for not mandating breaks",
            "Land of the free to not eat over a full shift. Sweet \n\n\n/s",
            "Breaks are not mandated??? WTF!! The industrial relations laws in the US are appalling! You all need to unionize. I'm in Australia and what you describe sounds barbaric. I am so thankful I live in a country that still has sick leave, annual leave, long service leave, maternity/paternity leave, and a multitude of other leave, award wages, WHS legislation and statutory authorities to oversee the application of law. You are being exploited...and that's not even mentioning the lack of universal health care.\nNow that I've had my rant, am so glad you at least have a break now, to eat/use the batheoom/get some fresh air/stand and move. How 'generous' of your employer /s",
            "Pretty certain if they expect you to use your personal cell phone for communications they need to reimburse you for your bills",
            "> for everyone commenting that it was illegal for them not to give me a lunch break, that’s not the case in my state (breaks are not federally mandated in the US).\n\nThat's insane. Literally medieval circumstances.",
            ">breaks are not federally mandated in the US\n\nWhat the hell? I thought the US was supposed to be a 1st world country.",
            "You’re a female and your boss was watching you on the camera.... oof that makes me uncomfortable.",
            "FUCK that state. Looked it up, fuck the 30 states that don't have these lunch breaks. \n\nOf course its the majority of this shithole country. fml",
            "Yeah, screw your boss' response basically sounds like he wants you to use that time to respond to the owner, managers and other staff",
            "Had the exact same thing happen to me almost.",
            "Wait, there are us states where breaks are optional?",
            "\"breaks are not federally mandated in the US\".\n\nWTF",
            "Thats pretty odd for me. Luckily that kind of observation isnt legal here. Its allowed to record the shop but it's forbidden to use it to observe the employers or put them under pressure.",
            "Stuff like this is what keeps me going.",
            "> Edit: for everyone commenting that it was illegal for them not to give me a lunch break, that’s not the case in my state (breaks are not federally mandated in the US). \n\nWOW! That's fucked up!",
            "Yeah, my state doesn't mandate breaks across the board. \n\nIf you're the only cashier working the graveyard shift at a Texaco, or you're, say, a fucking Sandwich Artist, then they give you a \"paid break\", which means you take your breaks when you can, and piecemeal if necessary. \n\nWhat you get in return is that you don't have to take unpaid time in the middle of your workday.",
            "> “Really? Because I’ve been watching the cameras and you’ve been messing around on your cell phone for the last five minutes!” \n\n\nWhere I live that's highly illegal, cameras can only be used for security reasons not to spy on employees.",
            "[deleted]",
            "Breaks are federally mandated tho",
            "People suck and shouldn't be in charge of anything",
            "I'm in middle management in Utah, a right to work state.  Corporate makes sure we schedule our workers a 30min unpaid lunch if they work over 5 hours a day.  However we are also to make sure they get a 10min break or lunch every 2 hrs worked.  The breaks are not protected by law im told, they are a privilege, however the 30min lunch is a law.\n\nAs much as I complain about my job.  It's nice to know they're a few decent people still in upper management.",
            "Im doing exactly the same thing",
            "UPS Store?",
            "[deleted]",
            "It's crazy how effective this compliance situation works. I had to do this too, and love the look of my boss's face when I repeate verbatim what they said, when they ask me why I dont have my phone.",
            "What state do you live in that doesn't gave standard work place protections like your entitled to a lunch away from work?",
            " *(breaks are not federally mandated in the US)* \n\nW T F?????",
            "OSHA would disagree op.",
            "Here it is illegals to use camera to spy on your employee",
            "...so, you  MUST have been abusing the privilege before all this went down, amirite? otherwise, he wouldn't have made the rule.../s\n\n...they need to  step back and see the complete picture before they decide they know what is going on...",
            "Umm... you know that employer is a fucking scumbag, right?\n\nYou’re legally entitled to a 30 minute lunch and two 10 minute breaks for every 8-hour shift.\n\nMaybe file a complaint with your State’s Labor Commission?",
            "I was told slavery was abolished in the US",
            "> take a half hour lunch break where I didn’t have to do anything else\n\n&#x200B;\n\n> as long as I didn’t abuse the privilege\n\nOh wow! They are sooooo generous!!\n\n&#x200B;\n\n/s",
            "Get rekt",
            "Full time workers aren't even mandated 2 weeks of vacation. It's just a benefit most employer's offer.",
            "You know, it’s illegal in the US to employ a person full-time and not give them at least a half hour lunch break",
            " \"Thank you Honey! By the way, have you seen where the ______ is too? I couldn't find it anywhere.\"",
            "[I had a very similar experience once that I posted here](https://www.reddit.com/r/MaliciousCompliance/comments/8ya9l5/i_cant_use_my_cell_phone_m/)",
            "Kinda creepy that he was just watching you through the cameras, no?",
            "I had a manager that would take the tape home and watch what we were doing every night. In a fast food restaurant. There weren’t any complaints or money going missing, so we thought it was a bit ridiculous. We knew where he lived and bought him the cable hook up and his first 3 months. The owners put a stop to the ridiculous micro managing when they found out about it.",
            "Ugh - unfortunately you have a manager who doesn’t know how to manage. What a nitwit. Instead of talking to you (first - before he watched you while you were working) and attempting to have a conversation about what’s expected of you and what you can and cannot do while working, he spies on you and then calls and “busts” you?! \n\nHopefully he’s not too far up the ladder and doesn’t manage a lot of folks. Glad you were able to open his eyes a bit.",
            "How the fuck are breaks not mandated???? Why doesn't America have basic labor laws?",
            "The fact that you actually clarified that it is in fact not illegal to have no breaks is absurd."
        ]
    },
    {
        "post_id": "jjf6aq",
        "author": "TandyAngie",
        "title": "Nitpick the dress code? I can do that too.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jjf6aq/nitpick_the_dress_code_i_can_do_that_too/",
        "score": 15155,
        "num_comments": 637,
        "created_utc": 1603850584.0,
        "selftext": "Our junior high dress code was a pain. Most teachers didn’t care so long as kids weren’t distracting. The principal of the junior high, however, insisted on enforcing every single rule.\n\nA friend of mine wore a long sleeve shirt under a tank top. The principal insisted she couldn’t wear the tank top because tank tops were against the dress code. But she couldn’t take off the tank top because her shirt was slightly see through, another violation. Instead of allowing her to simply wear the tank over her long sleeve shirt, she sent her home.\n\nI decided this wouldn’t stand.\n\nI studied every rule in the dress code to prove how stupid it was. I started off small and worked my way up.\n\nNo open toed sandals. - This one was easy. I wore open toed high heels. Nothing in the rules against high heels, and the open toed rule only applied to sandals the way it was written.\n\nShirts must be tucked in to pants. Belts must be worn through belt loops. - Knocked out two here by wearing a skirt. Skirts, or at least the one I wore, had no belt loops and wasn’t considered pants so I was not required to tuck in anything or wear a stupid belt.\n\nBackpacks must be plain colored with no pins/excessive accessories. - I picked up a briefcase from a resale shop and slapped it with every sticker I could find. Any random logo or inspirational sticker I had laying around got slapped on it. Technically, a briefcase isn’t a backpack.\n\nNo costumes allowed. (I verified this, my school considered a costume to be anything only worn for a certain period of time or for a certain reason. If you wore it all day, it was an outfit, not a costume.) - I abused this one so badly. Once a week I dressed up as a lawyer, a clown, a hippie, a Shakespearean actor, a superhero, a camera man, etc. complete of course with as many accessories as I could handle. So long as I never took them off (this made gym class interesting), they weren’t considered part of a costume. I ended up letting kids pick out what I would dress as each week.\n\nNo crazy hairstyles. - Kept my hair natural colors, and kept the styles as something that was at least popular at one point. Beehive took forever but was the most satisfying. Bonus points if I could find pictures of adults who were still wearing their hair like that currently.\n\nShirts are not allowed to have logos or print, only patterns and consistent designs. - Consistent designs was my loophole here. No print, fine, but consistent print made specifically to look like a design? At this point, the principal was going mad and she didn’t let this one slide. She insisted I change, which I expected.\n\nGym shorts must teach students knees or as long as their fingertips. - Guess who’s finger tips reach about three below her butt? Me! I went from wearing a shirt that said bite me all over it, to an outfit that included short shorts. But my shorts were still longer than my fingers. I even offered to change back into my other clothes.\n\nAt this point in the year, we were almost done with school. Other kids were following my lead, and we were driving the principal mad. I decided to kick it up a bit further. I attacked what should have been the most basic rules.\n\nNo sunglasses. - Rose colored glasses aren’t considered sunglasses because you can easily see through them. Still, the principal jerked them off my face and insisted I wouldn’t get them back until the end of the day.\n\nNo tank tops. - I wore a dress with spaghetti straps. It wasn’t a shirt, so I wasn’t breaking a rule.\n\nBelts must be plain with no dangerous materials. - Plain it must be, so plain I went. I wore a shoe string as a belt. I wore a braided yarn string as a belt. I even wore a spandex band sewn to my pants as a belt.\n\nNo crocs. - Crocs are not the only rubber shoe my friends. I found every off brand croc I could get a hold of.\n\nFinally, at the end of the year, I wore one of my most outrageous outfits. I wore a see-through dress (think bathing suit cover up) over leggings and a shirt that barely classified as a t shirt. I wore shoes with a four inch cork heel. I had on fake glasses (no lenses) and a four inch wide headband. I wore bangles up to my elbows and anklets on each foot. I had a box to carry my books in that was decorated with blinking battery powered fairy lights. I walked right up to the principal and gave her a smile.\n\nKids paused to see what would happen. I waited to see what she would say. We’d had this conversation all year. She would point out the rule I ‘broke’ and I would prove how I didn’t. She sighed.\n\nPrincipal- Fine,  but if even one teacher says you’re distracting to the class, you change clothes.\n\nWe shook on it. Only thing I had to ditch was most of the bangles. They kept clanging while I wrote. \n\nIn the end, I ended up getting the dress code rewritten and amended and the principal implemented a new procedure where dress code violations were not sent home, they were noted and students had to wear a piece of duct tape indicating the specific violation. (If you forgot a belt, you put a piece of tape on a belt loop.) Kids only started to get in trouble after three dress code violations in the same week. Since she lightened up on the dress code and how harshly it was punished, she stopped having trouble with kids breaking it all the time. It worked out for everyone.\n\n\n\nEdit because everyone keeps asking for photos. I am going to look, but this was several years ago (I’m done with college now) and besides the fact we didn’t take a lot of photos because this wasn’t exactly an odd thing for me to do, we’ve also had several hurricanes and floods that ruined most of my childhood ‘evidence’. (If photos proved my life, I was born at 18.)",
        "permalink": "/r/MaliciousCompliance/comments/jjf6aq/nitpick_the_dress_code_i_can_do_that_too/",
        "comments": [
            "When I was in high school, I got \"talked to\" because I was wearing a tulip style skirt and the high point was slightly above my knees. (that was our rule) I made mention that the cheerleading skirts barely covered their butts. They replied it was a team uniform on a game day. The next day, I showed up in my swim suit. I was on the swim team and we had a meet. :) The principal was pissed but couldn't say a damn thing.",
            "I’ve been an educator for 15 years and among the most important things I’ve learned is that the more nitpicky you are about rules that are not about immediate physical, mental, or emotional safety, the more time you’re gonna spend trying to stop people from bending or subverting them.\n\nI teach English, right? So in my first year I would assign a reading. To check whether it was completed, I’d do a quiz. Easy work around: glance through cliffs notes on your way to class for the details, you’ll likely at least scrape with a pass. So I began assigning annotations and would do spot checks. Students would underline random words and sentences. Ok. Make it a requirement to highlight different things: a symbol had to be highlighted in pink for example. Well, page numbers are symbols aren’t they?\n\nAfter about six months of this nonsense, I was spending half of my class periods checking homework for a set of rules that did nothing to get students to read. When I stopped doing homework checks and started making class discussion actually interesting and, you know, meaningful to prep for by completing a reading assignment, wouldn’t you know it? More kids were doing the reading. \n\nThe lesson I learned? A real education is not about control. It’s about releasing control. Making up pointless rules that don’t actually get kids to learn anything is a waste of their time and yours.\n\nSo I say this as a teacher: I’m proud of you.\n\nEdit: wording",
            "Meanwhile in high school I got a metal magazine taken away from me and I never got it back :(\n\nEdit: I should probably really need to specify that this was a printed magazine that reviewed the metal music genre",
            "\"my school considered a costume to be anything only worn for a certain period of time or for a certain reason\"\n\nThat sounds like Gym Clothes to me.   \nGuess nobody can change into their gym clothes...",
            "People like OP either grow up to be corporate tax lawyers or stand up comedians. I hope you choose wisely.",
            "A kid in my high school got in trouble for having bright orange (dyed) hair. His mum dyed hers the same colour and came into the office the next day to tell them it was hereditary and their natural hair colour.",
            "I went to public school. One time I wore a plastic  bag over my shirt. Another time I wore an apron and short shorts. No one batted an eye... they had bigger issues I guess",
            "Congrats on that! Also the principal turned out to be understanding of you and that's awesome that they updated the dress code. A more closed minded person could have said fuck what the rules technically say and still go after you.",
            "My school was pretty relaxed. I only ever witnessed one time a kid got in trouble for violating the dress code.\n\nI was walking to class, and the principal and vice principal were in the hall saying hi to kids walking by. \n\nComing toward me was a mildly troublemaking guy. I noticed as we passed each other that his shirt said, \"Make 7 Up Yours.\" Of course, it said \"Make 7\" on the front and \"Up Yours\" on the back. I did a double-take and tried not to laugh. \n\nHe greeted the principal and vice principal over-enthusiastically, and they greeted him back happily enough. But as soon as they saw his back, they sure changed their tune.\n\nHis punishment? They made him take off the shirt and turn it inside out then and there. No harm done, I suppose.",
            "Legit did this same thing in high school.  No unnaturally colored hair?  No problem!  I'll just color my hair EVERY SINGLE NATURAL COLOR AT ONCE.  Students must wear underwear at all times?  Cool, since bras are sold in a different section than underwear and are referenced as a separate entity, time to stop wearing bras! I have since graduated, and learned recently that there's an entirely new student handbook that addresses every loophole I found...so obviously students are finding new ones!",
            "I could only dream of stuff like this. My school was strict with dress code, but only for girls on the bigger side. I would see all these girls wearing booty shorts, ripped jeans above the knee, see-through and backless shirts but they were all thin so none of them got in trouble. I am a bigger girl and in my 4 years there I wore one shirt that had a sliver of shoulder showing (it had like a window on my shoulder but it was where my shoulder met my arm) two times, and got in trouble both times. I was sent to the counseling office both times and forced to wear an over sized shirt for the rest of the day, then had to go home and wash it and bring it back. The last time it happened I ended up arguing with the lady about it because this other girl walked in to get a folder for her teacher, and her entire back was exposed, only thing covering her back was her bra strap. The lady just smiled and gave her the packet and let her leave while I had to wear the gross shirt for showing a little bit of shoulder.",
            "My friend got in trouble in school for having dyed hair, as any kind of dyed hair was against the rules. \n\nShe has naturally blond hair that never changed. The teacher didn’t believe she didn’t have ‘highlights’. So many of those school rules are just excuses for teachers on a power trip.",
            "I've had this thought before, which seems relevant here:\n\nIf some people occasionally break the rule, then they are at fault and should be punished. If everyone is always breaking the rule, then it is probably a stupid rule and should be changed.",
            "My senior year of high school I was a part of a program called work exit, basically I only had 4 classes a day then left to go to work. I worked in a warehouse every day so would always just wear whatever was comfortable, which usually meant sweats. One day I was headed to the bathroom when the assistant principal called out to me and began reading my the riot act because of the small hole near my knee in my sweat pants. Once she seemed like she was done reading her monologue I very calmly said “I will mend these after work today” and tried to walk away into the bathroom. \n\nNope wasn’t good enough for her, she tried to grab my arm and march me down to the principal’s office. I pulled my arm back from her and said “I’ll go with u, just don’t touch me.” So off we went to the principal’s office. When we got there she went into her tirade about how I was breaking dress code, began back talking when she told me and oh how disrespectful I had been. Once she was done the principal looked at me and I just said “I was trying to go to the bathroom when she yelled at me for the hole in my pants. I told her I would mend them when I got home from work today. Also she put her hands on me, and I’d like to file a complaint.” The principal looked so sad and exasperated I honestly felt bad for him. He asked me to wait outside which I did, then about 30 minutes later I came back in as the assistant principal was leaving, she looked like she had just gotten out of a 10 minute time out. That’s when I was given “the talk” about not disrespecting teachers and following dress code. I looked at my phone and announced that I had to leave or else I was gonna miss work. On my way out I looked back at the principal and said “so what about all the kids who r too poor to buy new clothes every time one of theirs gets a hole too big to mend?” Then immediately shut the door behind me and left. Next year almost no one got dress coded for small holes/tears/rips.\n\nSo yeah dress codes r dumb",
            " I Love this! And the ending is so wholesome. Good for you.",
            "My high school had a dress code (removed my senior year). The big thing was no hoodies on. Freshman year I caused a big problem about it because duck you it's cold in Michigan. Amount of times I was pulled out of class is insane. I ended up silently creating a movement with every student where we would slowly break dress code over the course of 2 weeks. The cycle of just kept continuing. Administration cracks down on dress code, over 2 weeks we slowly break it until we wear what we want (nothing crazy. Instead of polos and no jeans, ended up at black jeans and t-shirts/long sleeve shirts/ long sleeve shirts with buttons. All solid neutral colors because we were okay with it), after 2 months admins crack down again, rinse and repeat. I was the one who pushed it slightly too far by wearing beanies and calling them caps and not hats (hats were banned in the dress code). I wore button up shirts with stripes and said, \"do you want to argue with my family of 6 of who can use the washer and dryer in the middle of the week? Because I know for a damn sure me washing another shirt instead of wearing a dark Navy blue shirt with gray stripes isn't as important as my parents washing their work outfits\" and that shut them up real quick. Dress codes are worthless to be honest. Senior year I talked to the principal on the first day of school, handed him a paper that the main office prints with the dress code on it, and told him to rip it up the same cycle would continue forever. Senior year (my brothers first year in high school) had no dress code. Everyone was happy.",
            "The best school dress code is:\n- Breasts, sex organs, and butts must be covered at all times.\n- No tube tops without another top over them, because they can and will slip.\n- No profanity, hate speech, or explicit violence/sex written/depicted on clothing\n- Garments must not be visibly dirty.\n\nThat’s IT.  It was my HS dress code, and it keeps distractions to a minimum without being draconian or punishing kids for being poor or fat.\n\nAny adult who is “distracted” by spaghetti straps on an underage teen is a disgusting pervert. Any kid who’s “distracted” by piercings, revealing clothes, etc., needs to learn to deal with it, and they won’t if they’re forbidden from seeing it at school.",
            "This was a highly enjoyable read",
            "Niiiiice!  Your adherence to the dress code is admirable.  My friends and I had a similar problem with our high school principal who had a huge problem with anyone that wore trench coats (just after the first Matrix movie came out, despite no dress-code rules in the student handbook  that said otherwise) to school and banned wearing them in the building during school hours.  \n\nMyself and all the trench coat wearing goth kids (about 6 of us) got together 10 minutes before school started, marched into the principal's office on his birthday wearing our trench coats, joined arms and sang happy birthday to him as horribly as we could while doing our best and most ungainly Broadway-style kick-line dance we could given the cramped quarters of his office.  We left as quickly as his face reddened and blood pressure rose, took our trench coats off at the front door for the start of the school day, and didn't hear a word to the contrary.\n\nWhile I no longer dress in all black or wear a trench coat, it's still all about the small victories and getting in a good \"fuck you and your stupid rules\" when and where you can.",
            "There used to be a rule of NO shorts as they were too short. At the time the style was board shorts which went down to the knee practically. \n\nThe Football team came in one day wearing cheerleader skirts. The policy was changed the next day",
            "How much did you spend on these clothes...",
            "You were in Jr High and you had all this money to waste?",
            "Well done. A creative protest that worked.",
            "I was waiting until the end when you revealed that you were a man.",
            "I remember once getting in trouble by the vice principle for wearing a tie. The school tie. With the school logo on it. That I purchased from the school.",
            "Reminds me of a time when I got told to do up my top button, on my shirt at school, which it physically wouldn't do, by a teacher who's top button wasn't done up.",
            "My school banned scarves because I (a male) used to crochet/wear them. The administration didn’t like me very much. It was a super conservative school that would kick out homosexual or pregnant students. I’m pretty sure scarves are still banned.",
            "It took my principal and colleagues for a loop during a school Wide PLC when I, a male teacher, presented the discipline tracker that cited the number of dress code referrals and made the plain distinction that of the 100+ referrals made before winter break last year only 3 were of male students. \n\nSexism isn't cool. It got fixed. It also was pointed out how 90% of all referrals were done by 3 teachers. Were here to teach and help kids learn not police 12 year olds in yoga pants.",
            "I just love your creativity in all this.  What an inspiration.  Also... dress codes are stupid.",
            "That actually was a teachable moment that the adults always would preach about.  You just decided you were gonna school 'em on their absurdities.",
            "My wife and all the other girls in her high school class went on strike for the right to wear jeans. It was the '60s, and she went to a Quaker school, so that kind of direct engagement was respected.",
            "Pics or it didn't happen.",
            "This is a very cool fantasy",
            ">dress code violations were not sent home, they were noted and students had to wear a piece of duct tape indicating the specific violation.\n\nDuct tape outfit it is!",
            "i went to a school with uniforms. the rule was that we had to be wearing our ties at all times.\n\ny'all know that scene in brooklyn 99 where peralta reveals his secret tie under his shirt, tied around his belly? well, kids in my school would ALWAYS be wearing their tie, technically, but it became a game to see who could wear it in the stupidest way.\n\nsome memorable ones include: backwards like a mini cape, as a belt, on an arm or leg, as a headband across your forhead, and this one guy wrapped it around his dick once (he showed the principal his penis to prove he was wearing a tie and got suspended for a week)\n\ni used mine as a bow on my hair",
            "Outstanding work kid:)",
            "I was MAGNIFICENT!!! catholic all girls school I hated!!! My skirt was so big it fit like a hula hoop so I rolled it at the waste my shirt never stayed tucked in... at one point my seam came out of the skirt so I stapled it back in... there was paint and glitter on the poor skirt.. then because I'm black..  one day I used a soccer sock to tie my edges down and forgot to take it off...\n\nNeedless to say the whole school stayed in trouble copying my \"style\" and they didn't waste their breath talking to me...",
            "I got in trouble one time in middle school for wearing short shorts (think athletic shorts, not tight but much shorter than fingertip length) over leggings. Technically, we weren't allowed to wear leggings by themselves bc they were too tight and obviously the short shorts were too,, short. But I layered them bc I figured it cancelled out. I wore this style several times and never had a teacher tell me I was violating dress code, but one time I had to take something down to the office for a teacher and the secretary absolutely laid into me about being inappropriately dressed. I had to wait for my mom to bring me another pair of pants, but she stood up for me to that secretary and told her she didn't see anything inappropriate about what I wearing, the fact that I knew the shorts would show too much leg so the leggings underneath to block that, plus the shorts over the leggings meant you couldn't see how tight the leggings were on my butt ? Anyway fuck dress codes",
            "dress codes are stupid",
            "Our local HS finally did away with the dress code and said clothing had to be appropriate. What they found, is most of the girls ore workout clothes, including long or capri length yoga pants and sports bras with shirts over them. They had more clothes covering them than they did with the dress code",
            "I got detention for wearing black socks instead of navy blue or white... you could say I was a bit of a maverick.",
            "The fun I missed out on by going to a school with uniforms...\n\nFor a while I broke the dress code every day, by wearing a black cardigan over my uniform. Nobody said anything because I broke the rules in the most conformist way possible.",
            "A) You’re a really good writer. I’m not into reading overly long stories but this one wasn’t overly long and it held my attention. \nB) If you were my daughter the highlight of my day would be listening to how you subverted the dress code and what you’re uptight principal’s reaction was. \nC) Please don’t ever stop writing stories like this, it lifts a mans spirits On a rough day.",
            "Meanwhile everyone in my schools for the past decade has to wear the official school uniform as per dress code.",
            "And this kids is the reason why whitelists are better than blacklists; not just in computer security, nice!",
            "This makes me appreciate my high school’s dress code even more: “please wear a shirt and please wear shoes.”",
            ">A friend of mine wore a long sleeve shirt under a tank top. The principal insisted she couldn’t wear the tank top because tank tops were against the dress code. But she couldn’t take off the tank top because her shirt was slightly see through, another violation. Instead of allowing her to simply wear the tank over her long sleeve shirt, she sent her home.\n\nCould they not have simply worn the tank top beneath their shirt?",
            "When I started high school a new dress code policy had just been implemented. I wore a grey shirt on 9/11 that has a 3x5 ish american flag on it. This broke the rules of no images or logos larger than 1x2. I got sent to the office, and refused to change my shirt, stating only \"call my father\". After an hour of sitting on the other side of the principles closed door, only able to hear muffled frustration the secretary told me to return to class wearing a loaner shirt to which I complied.\n\nThe dress code was changed within 2 weeks, it was nearly eliminated entirely compared to the previous rules. Apparently the principle spent most of the day on the phone with my dad, and I know how that goes lol.",
            "I strive to be this Malicious !",
            "pics?",
            "I fuckin love you. The saviour I wish I'd had.",
            "Tank tops banned but not spaghetti straps. \n\nHow I mean spaghetti straps so more flesh than a tank top and we all know how distracting a bare shoulder is /s",
            "Why didn’t she just have you friend put the tank top under her shirt??",
            "Good for you on getting the dress code changed. So many of them are simply for controlling the student population, unfairly target girls and minorities, and are completely unfair to people from low socioeconomic backgrounds.",
            "Imagine if teachers and principals worked this hard to make sure kids were getting educated.",
            "This was a good story! But why couldn’t your friend just switch the tank top and long sleeved shirt to wear the tank top like an under shirt?",
            "Oh boy, my school made a doozy of a mistake.  They had written, on signs at the entrances, their policy about having no tobacco on campus.  No smoking signs everywhere.  Kids were always being busted for having cigarettes or dip.\n\nThere was one notable place where this policy was missing; The Student Handbook.  Now, granted, laws were written so that tobacco use wasn't allowed on school grounds.  However, there was nothing about it in the handbook.\n\nThis came to a head in late April one year, when a classmate got busted for smelling like smoke (which was a hazard if you went to the bathroom at the wrong place and time).  I had my handbook, and so went looking to see what he was looking at in terms of suspension length.\n\nIt turned out that it wasn't written anywhere in the handbook.\n\nThat little oversight was fixed the next year.",
            "I had a dress code like this and a super bitchy security guard to go with it. I will never forget the day a dude literally suckered punched her in the face for ripping off his sunglasses and breaking them. Reactions ranged from \"DAMNNNNNN\" to \"Jesus Tommy, fucking overkill much?\"",
            "And here I was bold way back when for just deciding to go without a bra. It was when \"girls had to be dressed and conduct themselves as ladies\" and going without a bra for day was the talk of the school for a month and the rumors about what type of girl I was followed till I left that one hick town.",
            "I wore a my boyfriend’s Monty Python Black Knight shirt, which he wore at least 100 times, that has the knight with arms and legs cut off and says it’s just a flesh wound, and the principal told me I had to cover it up. I said that my bf has worn it 100 times and was never told to cover it up, but he was insistent that it was inappropriate. So I put bandages on the arms and legs, effectively covering the offensive parts that he was complaining were inappropriate on me, and he was so exasperated with me, but the vice principal agreed that I did as asked, so they didn’t make me change.  My boyfriend wasn’t allowed to wear the shirt again though, which sucked for him because it was his favorite shirt, lol.",
            "I did a similar thing at my school. For some reason they banned backpacks and required we have string bags so I decided that I wasnt gonna do that. I brought a briefcase to school with everything I had inside and they yelled at me and tried to suspend me and calmly said “is it a backpack?” The principle was angry and said “no?” Me: “So show me the rule that I cannot bring a briefcase.”  P:”Well it’s a safety Threat!” Me: “But it’s not against the rules so you can’t suspend me or send me home. May I return to class now?” And they finally gave up let me go to class so to really piss her off I so I brought it everyday for 2 years.",
            "First of all -AMAZING. Second of all - I LOVE THIS APPROACH!! I was sent home many a times from teachers/principals for violating dress code. And what sucked is that MY learning was impacted. One day I wore a v-neck shirt, you'd get at Wet Seal at the time, and a zip-up jacket over it. My math teacher told me to zip up my jacket because my shirt was too low-cut. But 2 other girls in the class had the same shirt (different colors) and they weren't reprimanded. Then later in the day the same teacher saw me in the hallway with my jacket unzipped and took me to the principals office, where they called my dad to pick me up. \n\nMy favorite was when my MALE vice principal made this rule that if you're wearing short shorts you have to bend down in front of him and if he \"can see anything hanging out\" you'd be sent home...OH BOY did that not go over well with the parents!! We were in 7th-8th grade.",
            "I love reading about people rebelling against ridiculous dress codes, despite myself never being in similar situations. \n\nMy school had uniform up until my last three years there and then rule was more \"use your common sense\". Plus I was one of those strange kids who liked uniform (no need to think on what to wear).\n\nClosest thing to dress code was at my previous workplace, which had \"Jeans allowed only on Friday\" rule, which had exception for IT department. And of course, the few times I had to crawl through dust under desks, I just happened to choose to wear pretty skirt and blouse.",
            "So glad school uniforms are standard here. Never a worry about what to wear. Strictest thing enforced was hair bands must be in school colours (private school).",
            "I was in HS during the Columbine attacks....a few weeks or a month later, myself and a handful of others were pulled into the office and told we \"needed to add a little color to our wardrobe\"....we all wore mostly black, though I was more eclectic and would sometimes wear formal dresses with gaudy necklaces woven through my hair like headpieces. \n\nWe all told them since we are not violating dress code, they can't make us do anything. They didn't really try after that.",
            "[removed]",
            "There’s no way this happened. Sounds completely made up. I’m surprised it didn’t end in the entire school clapping you in a guard of honor.",
            "I was an exchange student in Japan. If Japanese teens could have their way almost all of them would have dyed their hair back then, usually brown or blonde. It was stupid popular, and of course most schools banned it. We had monthly suprise inspections where everyone would gather in the gym and skirts measured, hair checked etc. It was funny how sneaky the kids were, the teachers had a card to compare against their hair to make sure they hadn't made their hair slightly less black then normal, they check your hair underneath to make sure there wasn't a dyed patch etc. By the time I got to the front of the line they had already found five students who had sneaking hair dying done. I noticed the teacher stop and look at me, look at his rule book, call over another teacher. They had a frantic debate. At that point the naughty kids caught on and started telling. You see the guidelines were badly written. It was stated that students must have black hair, and not students should have their natural hair colour. They rewrote the rules on the spot, and the naughty kids were later dragged to a group forced hair dying. Some might have later been executed, I dunno school didn't muck about.",
            "In our school handbook they added a clause that stated that they could basically decide per case if anything violated a dress code so they didn't have to provide specifics. Wish I could have done what you did",
            "I'm so fucking glad that my kid's school dress code is that all clothing must be \"safe and weather appropriate\".  Full stop.  Still working on trying to get them to integrate sex ed, but they're generally much better than my schools were.",
            "I wore skin tone colored camis under crop tops and they couldn’t do anything because the rule was no bare midriffs.",
            "That sounded like a great way to make the one nitpicky person who worked at your school rage.",
            "I got yelled at in sophomore year because my sweater vest was charcoal grey instead of black.",
            "I think that the whole concept of a dresscode is so weird and just flies in the face of freedom. Students as well as anyone else should be able to freely express their individuality and personality, including through which clothes they choose to wear.",
            "School I went to had a problem with me wearing a polo because it had a logo.\n\nCue ripped jeans, combat boots, leather jacket, and mohawk for the rest of the year.",
            "In sixth form I was elected as deputy head boy and I put up such a fuss when they tried to introduce uniform that it was delayed until I had finished at the school. For example whilst we were running for head boy and head girl we had an interview with the new head of sixth form and the chair of governors for the school. The interview was mostly to see that we were capable of talking confidently and such, one of the questions was what would you think of a new uniform, I started to give the answer they wanted to hear, then realised that having no uniform was more important to me than being head boy, so I said “actually, sorry, scratch that I think that having a uniform would be a bad thing for the sixth form because...” I expressed my victory by wearing shorts year round. My brother was in the year below me and had to deal with a uniform in his last year.",
            "Back when we were in school my wife and her best friend were disgusted by the new \"no loose shirts\" rule. I'm kind if sad I missed that one, but I would have probably hurt people over my 2 friends. Up until then everyone thought they were fat. Well they weren't they wore baggy to hide their assets.",
            "This is what I do at my school. We have a INCREDIBLY strict uniform. I've read over the rules several times and found little gaps in them. E.g. Jumpers. To my surprise, you dont have to wear a logoed jumper, so I wear my jumper vest, aka sleeveless jumper. Nothing they can say about that.",
            "You were like The Erin Brockovich of middle school. Please tell me you are a civil rights attorney:)",
            "My school was fairly chill about dress code for the most part. We had one, but unless someone was blatently breaking it most teachers just let it go. That being said, I wouldn't be posting if I didn't have a story.\n\n\nIn 10th grade, towards the end of the year, it was starting to get hot. So I wore this tank top to school. I double checked before leaving home that it fit the dress code, because I didn't want to cause a ruccus. It went nearly up to my neck, so no issue with excessive cleavage. The straps that went over my shoulders were 4 fingers wide, which was the minimum allowed width at my school. So I headed out, happy with my choice to follow the rules and stay cool. \n\n\nI was in the hallway getting books for my next class when the vice principle came up behind me, tapped me on the shoulder, and said \"Now honey, I think maybe next time we shouldn't wear this shirt to school, don't you? I can see your shoulder blades and your bra straps.\"\n\n\nThe straps of the shirt came together in the back and went down the center of my back (still a good 5/6 fingers thick mind you). The straps she was referring to were my tank top straps, because I always wear tank tops under whatever top I'm wearing. I informed her of such.\n\n\nHer response: \"Well, I know that. But others might not.\"\n\n\nAfter that, we went our separate ways. So no big drama. But I was both mortified and offended. I'd done what I could, followed the rules, and still was called out publicly in front of all the passing kids.\n\n\nBonus story:\n\n\nThe only other time I saw dress code enforced was when I was in the 5th grade. There was this kid that I disposed, because he constantly picked on me and acted like he was better than everyone else.\n\n\nOne day, he wore a shirt to school with two hands held out across his chest. Beneath them were the words \"those look heavy, can I carry them for you?\" He was told to go to the bathroom and turn it insideout (which he was very not OK with). Sometimes, the rules exist for a reason.",
            "A girl in my daughter’s 7th grade class was made to remove the dark footless opaque tights she had on under a dress because they were considered “tights” and tights weren’t allowed. \n\n\nThat was the same year that we figured out bleached/highlighted hair was allowed but “unnatural colors” werent. My daughter dyed her hair green(the approximate color of bleached hair reacting with pool water) and Raggedy Ann Orange. That was an interesting conversation at the school.",
            "My mom is a lawyer and she got called to come to my sister's school to meet with the principal in the middle of both a meeting and her busiest day. My sister was wearing shorts that went past her fingertips (she had very long arms, so decent length shorts). However, this was Utah and the principal was very prudish. When my sister sat down the pants rode up some (as shorts naturally do) and the principal decreed that they didn't pass the fingertip test. By the time my mom arrived, my sister was sobbing in the office. \n\nMy mom went full protective mom. She was not a screeching Karen. She was the kind of person who put on a \"Lawyer\" voice that stayed level and calm but left the receiver quaking in their boots. \n\nShe started by asking the principal why her daughter was in trouble when the cheerleaders were all wearing short skirts that barely even covered their butt. The principal tried to tell her that didn't count because it was a school team uniform and thus not subject to the dress code. (The cheerleaders knew this and wore them every day to get around the dress code). My mom ripped in to him, telling him that she was a busy person with ACTUALLY important things to deal with, and he had better not DARE  to mess with her daughter or interrupt her at work again unless it was ACTUALLY important. Further, if he tried to give her a dress code violation for perfectly acceptable clothing ever again while the cheerleaders were still going around in their short skirts, he would have a discrimination lawsuit on his hands. \n\nFor clarity, the discrimination lawsuit was a reference to the tendency in Utah for non-mormons to be treated differently.\n\nEdit: They never told my mom why she had to leave work and come to the school. They just told her it was an emergency and she or my dad HAD to come NOW.",
            "If you get to be the reason a rule was changed or implemented, that's braggin' rights.",
            "This is so incredibly awesome!",
            "I have nearly forgotten the creativity and pettiness of a middle school brain. This is such a boss move to stick it to an admin who enjoys their bit of power too much.\n\nOur vice principal in middle school stuck her hand down my best friends pants to insist she tuck her shirt in.  We got the “ALL SHIRTS MIST BE TUCKED IN” rule abolished shortly after.",
            "I’ll just quietly applaud you from the bottom of the comment section. Kids getting sent home for dress code violations is probably the stupidest thing a school can do. “Oh I don’t like how you’re dressed? Well you’re not allowed to learn anymore”\n\nThankfully my school never cared for the dress code (despite displaying it on a loop on every tv in the cafeteria forever), but if you showed up with something a little too wild or revealing, they gave you a giant XXXL gym shirt that was bright orange to wear for the rest of your day. They didn’t send you home for being “distracting”",
            "In high school we were supposed to wear belts, like most. I decided to wear suspenders, because they are classy and do the same thing as belts do. They made me wear a belt with suspenders! Eventually I was able to show them how wearing both is pointless and got to continue wearing just the suspenders",
            "I recently learned that some schools are over strict about the dress code because of the rebellious nature of children. The dress code is something to rebel against, and distracts the student from rebelling in a more serious way.",
            "In my senior year of high school we seniors decided to revise the spirit week from the boring class color day and sports day to other more fun stuff like meme day and gender bender day. The school was ok with everything except the gender bender day which was interesting because IMO it was better than someone wearing a high vis vest and carrying massive traffic cones or someone who did the mannequin head in their hoodie and couldn’t see all day.\n\nI didn’t participate in the gender bender day because I had a presentation I had to dress up for but they were calling boys down to the office for wearing skinny jeans, a sweater, and Ugg’s. They could have worn the same outfit any other day of the year and it would have been fine. It was annoying but funny. \n\nA quick story from that day was that I was sitting in band and one of my friends was in the exact outfit I just described. As soon as he was called down to the office he quickly got up went to the band locker room and switched shoes and took the pants off to gym shorts under and took the sweater off. So now he just looked like one of the kids that wore sports clothing all the time. He came back 5 mins later and said the office was confused why he was there because he looked \"normal.\"",
            "This is the most epic malicious compliance I’ve ever seen. Amazing job, and please keep being this freaking awesome.",
            "How much did you spend on all those clothes?",
            "The best plot twist would be if op was a man.",
            "The eyeglasses getting confiscated could have easily blown up since they are classified as a medical device, and physical removal constitutes assault on a student.",
            "You have waaaaaaay too much time on your hands to be doing something this silly.",
            "Imagine being a grown adult and still caring about your junior high dress code",
            "What do you mean barely classified as a shirt?",
            "After years of Catholic school dress codes for my kids and other dress code discussions online, I think the only fair dress code would be a completely unisex series of basic rules that leaves lots of room for personal expression. I envision 2 codes, a gym/hot weather/special permission version, and a general version. \n\nMy basic code would be something like...\n\n* The main goal of our dress code is to protect the dignity, spirit, health, and safety of our educational community, and applies equally to students, employees, and volunteers. \n* Shoes should be appropriate for the weather and the walking surfaces in and around school. They should fit properly so as to prevent foot problems, and protect the toes and ankles (ie- heels and/or soles should not be over 2\" thick).\n* Torso- Think 'business wear' coverage- covered from below the kneecaps to shoulders and down to the mid upper arm. The area from mid-collar bone to the neck may be open. No midriff, sides, chest, shoulders, back, thighs, buttocks, or groin should be exposed. \n* Undergarments and what they protect should never be directly visible. Undergarments should also not be obviously missing. \n* No images, text, or depictions on clothing, shoes, or accessories should show disrespect to any group of people, or use words that are hateful or hurtful. No depictions of alcohol. tobacco, weapons, hatred, or violence are allowed. We encourage restraint on messages such as politics and religion (messages mocking people's beliefs are not allowed.)\n* Clothing should fit in a professional or business-like manner- neither too snug nor too loose. \n* Clothing, shoes, and accessories shall not be noisy, flashy, or flamboyant.\n\nThe gym/hot weather/special permission code would allow for things like shorter pants/skirts, exposed shoulders, etc.\n\nAlso- because I am a that kinda person, I would maintain a board of photos of the most interesting but allowable outfits. Showing and highlighting EXACTLY the sort of stuff OP was doing applauds their creativity while it also sorta steals some of their thunder.",
            "I feel like all female principles that I’ve had (and may go for some) always are so strict and all business in school, while male principles show their actual human side during lunch or talking to them just to talk until discipline or actual work is needed, if that makes sense.",
            "[removed]",
            "Please update in a decade and share stories with us from your sure to be very successful career as a lawyer.",
            "> the principal jerked them [sunglasses] off my face\n\nIsn't that illegal?",
            "It's so wierd that Americans don't have uniforms tbh",
            "My daughter wore a sports bra and a very nice shirt over it for her school pic. The nice shirt over the sports bra had a little keyhole upper back design and you could see the sports bra. She called me when her assistant (8th grade) principal told her to “go to the nurse’s office and get a tee shirt to cover up”. I lost my mind and called that assistant principal’s head principal saying I did not work 13 years on her self esteem and autonomy to have someone to tell her to cover up! A sports bra is waaayyyy more covering that other bras, and it is more distracting for this woman to walk around inspecting teen girls than any dress code violation. Furthermore, why were all the violations were on the girls and we have yet to hear or see a boy get a violation? I followed up with it is 2017 and the time to tell girls what they can and cannot wear is done.” The principal was a reasonable man with 3 daughters of his own and after this conversation the rules were relaxed and rarely enforced.",
            "No school in the world would let this carry on for weeks like you claim. Might happen once or twice, point would be made, dress code or rules would be rewritten. In what world does a school allow a smart-ass kid to outsmart teachers day after day and week after week? None.",
            "The description of your last outfit reads like some kind of Bizarro version of My Immortal\n\nI adore it",
            "Do... Do people really believe this?",
            "I hope you took some pictures to document this.  I'd love to see the beehive!  We would have gotten in so much trouble if we'd been in school together.  I even got sent home from  Vacation Bible school.",
            "Mitch Hedberg would be proud.",
            "The best part was when you actually got them to change it!",
            "I wish there was someone at every school like you.",
            "This shows the social importance of thoughtful civil disobedience to effect change. We need more of you, OP!",
            "[deleted]",
            "You should only wear the superhero not-a-costume from now on as you clearly are one 🙌👏",
            "This post isn't complete without pics!\n\nIts hilarious, ggwp!",
            "Jesus you sound awesome.  Do you have any pics you could possibly share from this era?",
            "You may be the reason my school had uniforms. You’re also my hero.",
            "This is why all schools need uniforms",
            "If I had a kid, I hope they would have this kind of spirit, wit and intelligence.  I hope your parents cherished you!",
            "> No sunglasses. - Rose colored glasses aren’t considered sunglasses because you can easily see through them. Still, the principal jerked them off my face and insisted I wouldn’t get them back until the end of the day.\n\nYou could have had her arrested for assault.",
            "This is amazing! It's totally something I would do if I had more diverse clothes..",
            "If it was a public school should have just threatened to take them to court.",
            "Damn!  Gotta bow down to your genius and your level of gutsiness!",
            "Good Job OP. I wish I was as brave as you in school.",
            "This brought me so much joy.",
            "Absolutely awesome",
            "You. Are. AWESOME!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "I am giving you a standing ovation for this, you marvellous, mischievous genius.",
            "I absolutely love this post",
            "MY HERO",
            "Were your parents supportive?  Just curious, I hope they were!",
            "If OP ends up as a lawyer I'm totally hiring her if I need one..",
            "You, my friend, will make an excellent lawyer someday. Aim high, future Supreme Court judge!",
            "I love your deviousness.",
            "I love this my god, you’re excellent",
            "/thathappened",
            "We had a principal who was, and is, a great guy but he was so afraid of getting surd for dress codes, almost anything went except obscene t shirts, etc. There were some VERY well endowed yl who really took advantage to the distraction this caused some of less self controlled ym!",
            "You are. so. awesome.",
            "I bow to you.",
            "[removed]",
            "This didn't happen.",
            "It's interesting to see from the post and comments how school staff in the us (presumably) seem to actually be bound by the letter of their rules. How are these rules formulated in the first place? Here they're pretty much arbitrary, set by senior staff at their discretion, sometimes with input from pta.\n\nThe thing is, they're just guidelines. Teachers have full authority to demand changes or cite you regardless of what the rules say. You could argue, but the principle is inevitably going to back them up. Any scene you cause runs the risk of teachers getting back at you through grades.\n\nThere have been cases of students making a grand stand, but this is always subdued by threatening to implement a school uniform.",
            "Your principal was “cool” that way. I have read so many stories where kids were punished and sent home regardless of not technically violating the code, sometimes even punished more harshly bc they were “talking back defiantly”.",
            "I want to be your friend.",
            "This is beautiful",
            "OP, I'm so hoping you're a dude XD",
            "r/dresscodecompliance",
            "If I were a student in your school I probably wait in front of your class everyday just too see what kind of bizarre fashion you're rocking each day.",
            "Epic consistency ALL the malicious compliance.",
            "You have Claudia Kishi vibes and I like it.",
            "Dress codes. A classic at malicious compliances. Good job. ;)",
            "High school is a breeding ground for MC. Love your story.",
            "Nice! Given their definition of a costume, wouldn't dressing out for gym class count as wearing a costume?",
            "Welcome to the Second Amendment. The govt keeps coming up with stupid rules and definitions and the People keep finding ways to comply and still get a litrle bit of Freedom back in the face of Tyranny.\n\nNot being facetious at all. Your story is a direct side by side with things like California and their silly 'assault weapons' ban (bearing in mind that an assault weapon is a made up political term who's definition changes according to who got voted into office that cycle). The govt keeps changing the rules and the citizens keep finding all the things the rule doesn't apply to.\n\nLook up the story about Bullet Button. It's a wild ride.",
            "If this were about a guy it would be out of the park.",
            "Legend",
            "i want photos!",
            "Well done with a happy ending.",
            "Bad ass. That's some shit that I'd do.",
            "Why didn't your friend just wear the tank top under with the long sleeve worn on top of it?",
            "Lmao this is amazing",
            "I wore a Waka Flocka Flame \"Bricksquad Monopoly 1457\" t shirt to school one day and my principle called me into his office and asked if I was in a gang. I was in 10th grade in a rural, 70 kids in a graduating class, highschool.",
            "Bra fucking vo!!",
            "I dyed my whole head pink in high school. The principal told me to do my work in the counselors office all day. I got up and drove myself home. Repeat for the next week and they finally relented.",
            "Both the hero we deserve and the one we need. Bravo!",
            "I'm surprised you got away with this much, and that the principal was mostly willing to stick to the \"letter of the law\" here instead of just counting what you were doing as a dress code violation regardless of what exact written policy is.",
            "This reminds me of the book stargirl, and all of the outrageous outfits she wears.",
            "That was a fun read, thanks!",
            "my principal just send kids who didn’t follow to detention",
            "I love the way your brain works!",
            "The hero",
            "I heard so many dumb things girls pants/skirts too short or guys refusing to wear belts. So many guys with their pants half down. I just wore gray/black pants and a t-shirt every day for 7 years lol.",
            "this is one of those stories that while the individual things are entirely plausible having them all together done by a single person in a single year seems crazy"
        ]
    },
    {
        "post_id": "a3e1rd",
        "author": "ThereShallBeWings",
        "title": "Overtime ban? Alright, I guess I'd better lock up now.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/a3e1rd/overtime_ban_alright_i_guess_id_better_lock_up_now/",
        "score": 15131,
        "num_comments": 491,
        "created_utc": 1544028554.0,
        "selftext": "TL;DR at the bottom.\n\n\nThis is an old story from back when I used to work in the opticians department of a major supermarket chain. I was a part-timer, working 9 hours per week: 3pm-9pm on Saturdays, and 1pm-4pm on Sundays. Part of my job was to close down the department on both days, because none of the managers liked being around at closing time. The department closed at 9pm on Saturdays but it was often about 9:20 that I actually left. Closing down a department takes time, mostly because you can't do it when customers are browsing. Unsurprisingly, I consistently worked more hours than I was supposed to.\n\nAll store employees were on the clock, and for some reason the store took readings down to the second. You were paid an hourly rate to within a few seconds of how long you were clocked in for.\n\nMy manager (I'll call her Val, because that was her name) called a meeting at 3pm on a Saturday, which coincidentally was the time I was scheduled to start work. Everyone in the department was either starting or finishing their shifts within a couple of hours of then, so it was a logical time, but that was about the only logical thing about it.\n\nThe thrust of the meeting was that \"some people\" - she said, looking directly at me down the length of her not-inconsiderable nose - were claiming more than their allotted hours, and that this must stop. Henceforth, all overtime must be approved in writing. This was entirely her decision. Other departments didn't have this problem as long as you weren't taking the mick.\n\nFast forward to about 8:45pm. Val and I were the only employees left in the department. She started to gather her things, as is her way. And I started the process of putting our more expensive frames into their night display cases, where they could safely be locked away when the department was closed.\n\n\n**Val**: What on Earth are you doing, ThereShallBeWings?\n\n**Me**: I'm locking up. I have to make sure I don't go over my hours today.\n\n**Val**: This department has to be open until 9pm. It's in the store handbook. You can't lock up right now, my boss will be furious.\n\n**Me**: You know from experience that it takes a good 10 minutes (I lied, it's actually more like 20) to lock up. I'm not allowed to be on the premises after I clock out. I have to start locking up otherwise I'll be disciplined.\n\n\nI reached for the tannoy and my voice saying \"Good evening. Would Mrs Lock please come to the optical department? Mrs Lock to the optical department. Thank you!\" resonated through the store - code for \"Security, bring the keys, we're locking up\". Val goes white as a sheet. The first cracks in her caked-on makeup began to show, I could see the look on her snooty face as a very large penny began to drop. She yelled \"Wait here!\" while leaving the department with a purposeful stride.\n\nBy the time she'd returned, I'd explained to the security guard, what's happening. He agreed to play along. We start (slowly) locking down the spectacle frames.\n\nVal, with sweat starting to show on her brow, wordlessly handed me a hastily-scribbled note authorising 30 minutes of overtime. I showed it to the security guard, who nodded. Val left without a word, looking really flustered, just as a customer walked in. My friend from security unlocked the frames again and I went to serve.\n\nThe following day, Val's usual snooty demeanour had changed. She didn't look contrite, but there were definitely a few cracks in her expression. She took me to one side, and without preamble, handed me a new rota, and launched into what was clearly a well-rehearsed speech.\n\n\n**Val**: ThereShallBeWings, I have approved your request to extend your hours to 10 hours a week. I now expect you to work from 3pm until 9:30pm on Saturdays, and from 1pm until 4:30pm on Sundays. I trust that this will not be a problem?\n\n**Me**: Oh, that's fine, thank you Val.\n\n**Val**: And henceforth, if you should happen to work slightly over your hours, do not be overly concerned about it.\n\n\nTL;DR: Stuck-up boss who really likes the word \"henceforth\" for some reason announces an overtime ban, not realising the overtime was me closing down the department after the close of trading. As a result, I start to close down early as she's leaving. She has a panic attack, increases my hours, and reverses the ban.\n\n\n\nEdit Juan: Holy bus, thanks for the gold :)\n\nEdit Too: \"Overtime\" in this sense means \"working over your alloted hours\". It's nothing to do with hourly pay.",
        "permalink": "/r/MaliciousCompliance/comments/a3e1rd/overtime_ban_alright_i_guess_id_better_lock_up_now/",
        "comments": [
            "I don’t understand these businesses that schedule their employees until close (or right at open) and are surprised that their employees are either 1. Staying later, causing them to go over in their scheduled hours... or 2. Are asshurt about a drop in productivity when their employee leaves at the time they were scheduled to.\n\nAt my place of work, if we open at 10am. The manager’s shift starts at 9am so they can go to the bank and do some admin time; the associate comes in at 9:30. If we close at 9pm. Both the manager and the associate are scheduled until 9:30pm.",
            "[removed]",
            "Awesome! I just want to note that this story happens all the time. Mid level management\" we need to save money lower managers, stop paying overtime.\" Low level managers \" alright crew we aren't working overtime.\" Actual working employees \" uuuuhh if you say so your the boss\" Mid level managers \" WHAT HAPPENED TO PRODUCTIVITY?!\" Low level manager \" gee I don't know boss we should form a committee to find out why our numbers are down\"",
            "Man, what? What insane company doesn't already include the time it takes to close as part of the hours for last shift? That's like retail/food services 101.",
            "[deleted]",
            "I know she was kind of a dick, but I gotta say, she owned up (sort of) and fixed it promptly. That’s almost impressive. ",
            "Back in 2003 I was working for an orthodox Jewish mortgage bank, initially as helpdesk and moved on to systems administration and some light development.  About two months after I started, we got one of those biometric timeclocks.\n\nI've never been one to clock in and out reliably and I frequently just skipped it.  Eventually my boss had had enough and he said that if I didn't clock out accurately, he would start docking my pay accordingly.\n\nWelllllll not long after that, I was working on migrating our internal domain from NT4 to Active Directory, including setting up Exchange Server 2003.  The parts of it that I could run in parallel, I did throughout the day, but then I had to stick around to kick off the migration and make sure that it was moving.  My boss had already left, but before he did, he asked me to let him know when I was leaving.\n\nSo around 10PM, I'm happy with the way things are going and figure I can leave for the night.  We shouldn't be expecting any downtime at this point.  So I give him a call and he's furious.\n\nSee, orthodox Jewish companies follow the same rules for Shabbot as orthodox Jews.  No work after sundown on Friday, and I wasn't going to do this on a Monday.\n\nHe ended up fudging the numbers because why would I know that?   I still had to check in, but it was fun watching him squirm.",
            "Slightly off topic, but that Mr. Lock code is really terrible.",
            "> All store employees were on the clock, and for some reason the store took readings down to the second. You were paid an hourly rate to within a few seconds of how long you were clocked in for. \n\nThat's some next level corporate greed right there.\n\nPayroll Director: \\*Does Math\\*\n\nPM: We can \"save\" a few bucks per month by tracking time to the second instead of the minute!\n\nExecutive Staff: Huzzah! Begin the rollout to all stores and get this man another Maserati!\n\n$100M rollout later...\n\n&#x200B;",
            "I used to work a closing shift at a convenience store.  We could get all of our cleaning & restocking done in the last hour or two before close, but the final numbers for the day's-end report couldn't be pulled until we were actually closed for the day.  The store closed at midnight, and the cashier was paid until 12:30.  \n\nTraining a new person, the closing paperwork took longer, and NewGuy got a little upset that we were there until 12:45 the first two nights, and only paid until 12:30.  He calmed right the hell down when I told him that once you know the process, it takes less than 30 minutes, and if you learn it \"my way\", you can be done in ten minutes.  You'll be out of here at 12:10, day after day, week after week, but still get paid until 12:30.  ",
            "I've dealt with a similar type of issue at a store where I worked once. If I was on register for a given shift (which I basically always was) A manager needed to be present for me to count on my register at the shift's start and for me to count off when a shift finishes. I was also expected to clock out directly at the end of my shift with no time after, which meant that I was expected to have a manager at my register *exactly* five minutes before my shift ended every single time, which was often not possible since they had other shit to do. It was infuriating because no matter what the blame came down on me. ",
            "Little confused, by changing your hours isn't she avoiding paying you overtime as a result?",
            "Your comment about her nose made me think of this…\n\n“Mr. Moony presents his compliments to Professor Snape, and begs him to keep his abnormally large nose out of other people's business.”",
            "I would have called her over to close up and walked out at 9 leaving her to put stuff away.",
            "> (I'll call her Val, because that was her name) \n\nOmg, I would give you gold if I could afford it just for this. My biggest Reddit pet-peeve is the story about some random event in some random town but the storyteller still finds it necessary to change the name and, for whatever reason, point out that it's been changed. \"So I met this guy, we'll call him James\"—like shit if you said his real name, Tim, we'd _all_ know who you were talking about!",
            "I loved the \"i'll call her val because that's her name\". I understand using a fake name for safetys sake but most people use it for who knows why.  If i'm calling someone out on their bs especially online i'm using their real name.  ",
            "The only way they actually pay OT is if an employee goes past 40 hours..not just past what’s on the schedule.. sure a part timer can get over 40 hours- that’s when management starts to worry due to if a p/t works 40 hours or more consecutively for so many weeks they have to offer them benefits like a full timer..\n\nHer saying OT was costing makes no sense due to you not getting time and a half once you go over nine hours..she herself went over her hours upper management budgeted for that store, costing her a quarterly/yearly bonus from labor. \n\nIf I were you, I’d have asked where all that time and a half pay went because you sure didn’t see it on your check.",
            "This happened at the bank I worked at. Paid until 4 which was when the bank closed but of course there was a ton of shit to do after, like putting away the tens of thousands of dollars in USD and CAD which all had to be counted, verified and written into a book. When I raised a concern about time not being paid I was scoffed at by both my boss AND my co-workers for being unreasonable. Sometimes it took 45+ minutes to do everything after four o'clock. \n\nThank fuck I'm outta there. What a bizarre culture of overwork and underpay those places have become. ",
            ">I'll call her Val, cause that was her name\n\nThe mad~~man.~~\n\nedit: person\n\n&#x200B;",
            "Was this Walmart? It sounds like Walmart, especially the time clock thing...",
            "The other option is, of course, to just page security and leave.  \n\n\n\"It was 9. You said no overtime and that the department needed to stay open until 9. So I left and assumed you'd told security to close up. Did you not?\"",
            "As an optical manager at a different box store optical, I have to say your manager was an idiot.  It also shows that she never worked as an optician on the floor.  Glad she had the dredded \"oh, shit\" moment ",
            "How could you do this to me? :( \n\n\n^^^disclaimer:not-actual-val-mentioned-in-story",
            "That worked out better for you than me. We used to have to clock out and keep working.\n\nThe nineties where a terrible time for young workers who didn't know the law.",
            "I don't understand how the most profitable companies in the world are retail companies. Every last one is run by idiots",
            "I had a similar experience in retail. I was expected to show up 30 minutes early so the people I was relieving could leave on time, but wasnt going to be paid for staying late. I didnt comply though, so it's not a good story for this sub. \n\nI didnt last long in that job.  ",
            "Yep, there's always that one manager. While I did my time at Walmart, there was a manager who would stand right next to the time clock and chew out everyone who was even seconds late. \n\nBtw, your username wouldn't happen to reference a certain X game would it?",
            "\"I'm sorry, based on the new implicit schedule I already committed to give [supermarket coworker] a ride home at 9:05 each night.\"",
            "I can't imagine anything more satisfying than getting revenge by being too good of an employee. ",
            "Man you're a lot nicer than what I did. Manager told me to stop staying past 9 but to also keep the department open until 9. So I kept it open then at 9 I left. The next day she had egg on her face and my hours for bump up until 10",
            "A certain yellow tagged electronics store used to do this crap.  Of course the manager would bail at like 8:30pm and then rip us a new one for working overtime the night before resetting the store.  We all got together and punched out exactly on time the next night.  The store was a disaster.  He tried chewing us out till the service manager (who was cool and on our side) reminded him that we were forbidden to work overtime, were all scheduled till the exact moment the store closed, and were forbidden from doing any closing prep while the doors were open.... he wanted to be pissed till he thought about and you could see the realization sweep across his face.  We all got a half-hour of overtime if we closed from that point on.",
            "Wouldn't it have been easier to just tell her that you are going into overtime because you are closing down? \n\nShe doesn't seem like that big of an asshole",
            "How does your work calculate overtime pay? I've seen anything over 40 in a week (sometimes lower, but never by much) or over 8 in a day. I've just never heard of an overtime policy like this. For a place that seems very into cutting labor costs it sounds like they have a VERY generous OT policy.",
            "What a fucking moron",
            "I wonder what actually got to her:  the possibility that her bosses would hear about a customer not being served prior to closing time, or that she could be arrested for essentially mandating unpaid overtime?",
            "This is like every retail store in the world lol. Same exact thing happened at my store (hardware store) years ago. ",
            "It doesn't make for a juicy reddit story, but you could have just told her about the oversight of the additional time it takes to close. ",
            "So this is a good story but honestly this seems like a somewhat reasonable boss,didnt take them to long to understand that you needed more time and they quickly provided u the means to keep doing your work.",
            "So you believe it was Val that single handedly decided to make an announcement about overtime? Wow\n",
            "Ran into this as a Kroger deli customer. It was 8:50 P.M. and I'm trying to get meat for a Bday party the next day while they're having conniptions and getting verbally nasty with ME because they can't work one minute past 9:00 and yet the deli is open for service until 9:00.   So, so sorry that their boss is a numbnut that can't math, but I couldn't get off work earlier to get there any earlier.     (Yes.  I did speak with th Mgr about this inane policy)\n\nEdit: typo",
            "Companies should pay you by the second (or 6 seconds). It's the fairest way. You were there working, you should get paid. \n\nMuch better than my wife's work. They pay by the 15 mins. Clock in 1 minute late get docked 15 mins. Clock out 14 minute late don't get paid for it. My late job did it by the 6 mins and I hated it. ",
            "I worked for CPI before they closed down and they tried to do this to everyone. They wanted us there 20 minutes before opening to set up, and as long as it took afterwards to clean up. All without being clocked in. So about an hour of work, unpaid. I always clocked in the second I got there, and I didn’t clock out until I left. They told me not to clock in until 9am or I would be written up. So I started showing up at 9 to get ready and clocked in right at 9, which always made the appointments wait. After some complaints and me explaining I’m well aware it is illegal to force an employee to work off the clock, they allowed me to clock in at 8:40-8:45 again and stay clocked in until the studio was completely shut down. \n\nBusinesses always try to take advantage employees! Good for you for standing up for yourself to this snoot. ",
            "Had this happen, as a \"full time\" employee at a factory.  I was part of maintenance, but my job was the \"smart shit\" (PLC's, robots, that stuff.). 4th plant manager in a year comes in, (yeah.) Sits on the plant for a month.  Hands out employee handbook.  (Notice, NOT A NEW ONE.  THE FIRST ONE.)\n\n\"No unapproved overtime\".  Okay, fine, maintenance is exempt, but they don't want to say that in front of the whole shift.  We pull our boss aside after to confirm.  \"No unapproved OT\".\n\nNext day, the other sparky and I enter at exactly 6 am, and leave at exactly 2:30.  (We NEVER left that early before.  We literally dropped whatever we were fixing, and locked our boxes, to clock out at exactly 2:30.\n\n6 am next morning, we both clock in.  8 am, our boss finally arrives.  (He was manglement, not worth a fart in a field of cows...) Pulls me aside, and basically asks what the fuck is wrong with me.\n\nI'm trying not to laugh my ass off.\n\nWhat happened is, basically 2:45, the entire plant shit itself.  Because second shift sparky was...  A few volts short of a AA battery.  (Nominal on a AA is 1.5 volts).  I worked 11 that day, started working 8-5 so they had coverage, and started looking for a new job.\n\nReports from buddies say that the place is basically dead.  And they shutdown in the middle of 3 rd the other night because the plant shit itself again.\n\nI'm now in an office, working 8-5, sitting on my ass as an engineer, instead of a \"controls engineer\" (read: last guy to get called to fix it, and the one who HAS to fix it.  Because I had to catch all the shit that no one wanted to fix, and never got the \"IT'S A FUCKING BROKEN GEAR, I DON'T DO GEARS\" to work.  But the mechanics said \"motor is making noise, it's electrical, get PaleFlyer on it!  I'm going home to get shit faced, and pass out on the couch.\"\n\nHuh.  Apparently I am still salty.  2.5 years later...",
            "Good old retail. Fucking hated working in it. People do no let your kids work in retail unless you hate them.",
            "The insane things middle management will do to shave pennies off a paycheck. ",
            "A manager leaving an employee to lock up themselves so they can leave early? That's against protocol. If something happened in those 15 mins the place was open while she's left, surely she's responsible? I've honestly never heard that shit happening in my life. Unless you're management as well?\n\nManagement is required to be 15-30mins before and after for setting up and locking up, WTAF?! I'm even surprised you were getting paid for that extra time, management never does. Just like they never get paid for their lunch breaks or get a break cos there's always some shit you need to deal with.\n\nWhat an absolute idiot she is. If she'd kept her mouth shut, you'd have plodded along moaning about the extra time and never get paid for it!",
            "OP, are you a fan of EgoSoft by chance? The X series?",
            "Legit thought here, is it possible that there were other employees stealing time, and she looked at you in the meeting not because it was directed at you, but because she was most comfortable with you? ",
            "What the hell did she think was going to happen when she said that????????",
            "You got screwed.  Before you were getting overtime and now you aren't.  I would have refused the extra hours.  ",
            ">none of the managers liked being around at closing time\n\nThere's a surprise.",
            "Some employers get that being fair and flexible with their employees is returned in kind, and some don't. I've worked a bit under 8 and clocked 8, I've worked a bit over 8 and clocked 8, I've been passing by on a day off and answered customer questions while the store was busy... It's not rocket science.",
            "I worked at a library as a teenager that closed at 5:30 every day it was open. The staff didn't have a punch clock but weren't paid overtime either and we were off at 5:30. The way we hustled people out the door was outrageous at times. There was no shame. We all had to stand and wait until everyone was gone and then leave in a group out of one door.  Most patrons got the hint when all of the lights were out 5 minutes prior to close and ALL of the employees were staring daggers. I'm sure it made for an uncomfortable gauntlet to run as they edged past us all to get out the door. I can only remember one time that someone dawdled and kept us more than a couple minutes late. If looks could kill. . .",
            "u/Sseptic would love this",
            "Did you ever have a meeting to your manager about the closing situation and how impossible it was to close and leave at the time you were rostered to?\n\n",
            "Holy shot is your username a reference to the X series?",
            "I'm 99% sure this is Wal-Mart. Sounds exactly like when I worked there",
            "Nice.",
            "Don't you actually earn less if you don't clock it in as OT? \n\nI have no idea what kind of labour laws the US has on this, if any lol, but it would probably like 250% of normal pay or so with working weekend and OT in my country. Maybe even more",
            "I used to work as a dish washer in a restaurant, well for like 3 weeks, we closed at 10.  Chef left at 10.   I was talked with cleaning all the dishes and the rest of the resturaunt.   On my second day the owner of the resturaunt pulled me aside and said I did a good job cleaning but he noticed on my time sheet I didn't clock out until 10:30 and that wasn't acceptable.   I asked him how was I supposed to clean the place if we were still open and some things could not be done until after we closed.   He said just do it.   So I left at 10 that day but not everything was finished.   I got yelled at on day 3 for how I left the place the previous night.   That was the last time they said anything about when I left",
            "I'm just impressed that your manager stayed until close. I worked a job for two years where I was constantly harassed about my closing times, but I never once saw a manager stay after 6 or so, and we closed at either 9 or 10 depending on the season. If my manager had stayed a couple times they would've either seen how silly they were being or taught me how to be better. Either of those would've been cool with me. ",
            "My last boss tried cutting overtime for certain individuals, (I was one of them). It was an extremely stupid move on her part, since I was the only one that was authorized to spend money besides the new owner, which was her. The first night we had two semi trucks break down, one in another country and one out of state..... I just let my phone ring until exactly my start time. I felt awful doing it, since the truck drivers are really good guys, but I wasn’t going to let myself get ass rammed by the company. Needless to say, a couple months later I left the company and am now making nearly 3x the money and I am salaried. ",
            "I worked for a mall kiosk that scheduled the closing shifts to end right when the mall closed. Most of it could be prepped but if you were unlucky with late customers you would run late. At best it would be like 3 minutes, at worst I had 2.5 hours (because people don't realize the mall closes early for the 4th of July). The problem was that the company wouldn't pay you for any overtime, only your scheduled shift. No 5min here or there, hours were air tight. Yes this is illegal BUT being alone at the kiosk part of your responsibility was to manage your own time. So you could report the extra time BUT would also get a strike for not managing your time. I was young and didn't know better, and it was REALLY hard to find a job in that town, and the rest of it was pretty good, so I stuck it out.",
            "Seems like she tried to make it right. You helped her.",
            "When I used to work retail years ago my boss tried the same thing, but he refused to pay the 20 minutes I worked every night to close the store. He rounded hours worked down with his justification being if we came in a few minutes late he'd ignore it. Problem with that is he was the only employee who came in late (and left early)!\n\nAnyways I got tired of telling him off about how he was essentially stealing from me and told him I was going to lock up at exactly close from now on. And I did. I dropped whatever I was doing at close, kicked out any customers, and locked the door. I left lights on, cash out, no end of day paperwork done, stock half unpacked and on the showroom floor, didn't tidy up, etc. The place was a mess. He was pretty quick to start paying for extra time when we wasted the next few mornings catching up on what I left.",
            "“Overtime”",
            "[deleted]",
            "Elephant in the room... How did you get OT working 10 hours per week? ",
            "> and henceforth, if you should happen to work slightly over your hours, do not be overly concerned about it.\n\nHAH. I would have shot back at her for that. Some people man.",
            "Wow, same industry, but I schedule my closing staffs for 38.5 hours fully anticipating over the course of the week that something will hold them up at some point. Same goes for the opening staff trying to leave before close. \nJust poor foresight by your manager",
            "You're more responsible than I. I'd wait until 9, leave without locking up anything, and ignore the phone calls until I come in the next day.",
            "I worked at a place called Freshii for a few weeks and they had the same 'policy' in place. In reality all the staff would work an extra 1-2 hours every day, but the manager would make us sign a form saying we'd only worked our allotted hours. My understanding is that they're like this at most if not all of their locations. My friend worked at one in another country and they would do this, as well as making her work 12 hour shifts and steal her tips.",
            "always give them more rope to hang themselves. xD ",
            "If I ain't getting paid then I ain't working.",
            "This post brought back nightmares of my days working in a grocery store.\n\nMaybe managers should be smart enough to build in overtime pay for closings to their budgets... or maybe that’s asking too much.",
            "I had a job that started at 9am but wanted us in at 8.40am for an unpaid meeting.\nI never arrived once before 8.50am.\nNo pay, no play.",
            "Just like when i used to work at a Subway. The general manager at the time said, you should be out of here ten minutes after close, but you need to get this done, as well as this this this... Yeah, let's just say there were more than a few mornings she came in and shit wasnt finished. ",
            "\"Tannoy\" apparently is a UK brand of PA systems.",
            "Someone else who likes the X series??? Theres 2-zens of us! 2-zens!",
            "I used to work at Walmart, they were so insanely anal about overtime, you were treated like Hitler for going over even the tiniest amount. \n\nThey actually divided the 60 minutes in an hour into a 100 decimal places. So, your overtime would be listed like 40.06 hours. If it was 40.02, you had to figure out how to cut that. \n\nIt was a nightmare because I worked overnights, had Thursday and Friday off, and the pay week switched over at midnight on Friday. It could be a cluster farce on days where they needed someone to stay. They would usually just get you to shave the time off your lunch. \n\nI would wait til Wednesday (the day before my days off) and take my long lunch then. Well, because managers tend to shoot themselves in the foot, Wednesday was our shortest staffed day AND the day when we had the most trucks and freight. \n\nSo, I would end up needing to take a 3 hour lunch because I actually did my job at the end of the shift. They would tell me to take it tomorrow because we were swamped, but I couldn't. I had to take it before the end of week. They always had a defeated face. I never felt bad though. Walmart makes hundreds of billions of dollars and we're trying to rob me of my overtime for their own convenience. Also, on the rate occasion that I was forced to take a long lunch, I spent three hours chilling in the break room or went home and played video games. I missed the worse part of the entire night. Win-win. ",
            "Wow from 9 hours to 10. Moving up that corporate ladder",
            "[removed]",
            "That... doesn't make any sense. You only work 9 hours a week. You dont get overtime until you work over 40.... So thats considered normal pay."
        ]
    },
    {
        "post_id": "b90257",
        "author": "Yiffparty_exe",
        "title": "You want to speak to my manager instead if me? Sure.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/b90257/you_want_to_speak_to_my_manager_instead_if_me_sure/",
        "score": 15121,
        "num_comments": 308,
        "created_utc": 1554308383.0,
        "selftext": "Phone user and Australian. Fear my autocorrected euphemisms. Tl:Dr at the end.\n\nPrior to being a bartender I worked at a retail chain called Big W. I'm a nerd, I tend to switch to autopilot when tired (almost always at the end of shifts) and can be a dick when annoyed. Me in a nutshell.\n\nIt's a slow Wednesday afternoon, the A/C is broken again and it's about 5 degrees C hotter inside than it is outside (29c). I'm in autopilot, rigor mortis smile on my face and retail greetings  are droning out of my throat. A guy walks into my register, demanding a refund for something trivial. Probably his panties were the wrong colour, I don't remember.\n\nI inform him in a monotone voice that refunds are issued by my supervisor, not me. There's a surprisingly substantial line at the supervisors desk, people wanting cigarettes, refunds or information. He informs me that he's not waiting that long for something trivial.\n\nHe demands I do it, because \"Even someone as dumb as you can do this\". Well that snapped me out of autopilot and the smile fades. I repeat, in a much more direct tone that \"Only the supervisor can do refunds.\" The customer is having none of it. \"Refund my item.\" He demands again, saying it very slowly as if I was the dumbest potato in the strawberry patch. \"I am unable to-\" He cuts me off.\n\n\"I want to speak to your manager, I don't want to talk to you.\" Now this is where people need to be careful with their words. As a cashier I report directly to my supervisor, one of the two at the desk. They're in charge of me. My Manager sits out back managing the store, and usually never has to interact with customers unless the supervisor calls him.\n\nSo I nod, calling through the headset for my manager (let's call him Fred). Fred's a great guy, he tells good jokes, he's always ready to help his friends and he's a caring soul. He's also a mute; and after wrapping his ute around a tree as a teen, he's also deaf. As such he knows Auslan (Australian Sign Language), but can't read lips to save his life. I also can't speak Auslan at all.\n\nThis probably took about 5 minutes for someone to alert Fred that he was needed and for him to come down. All this time I'm smiling but not saying a word to the gentleman, as he told me to. He comes up to the registers, sees it's me waving him down and pulls out his pda to communicate with me. \n\n\"What's up?\" Fred types. I take the pda and type \"Customer has a complaint, wants to speak to 'my manager' not me.\" Fred raises and eyebrow at me and I just shrug. The guy is turning red with anger, probably thinking we're ignoring him.\n\nFred turns to the guy who launches into a full on verbal assault that would curdle milk chcocloate. Something about incompetent employees and terrible service. Fred just stands there. Eventually the guy runs out of breath and Fred has a chance to show him the pda with the words \"Sir I am a deaf mute, please use this to communicate with me.\" The guy practically screams and storms out of the store.\n\nEdit: I didn't quite expect this to blow up so much, so thankyou all for reading. Much as I hate working customer service, I do enjoy helping people. If even one person walks away happy it's a job well done and I'm glad I could bring this to Reddit.\n \n\n\n\nTl;dr: Guy gets angry I can't issue a refund and demands to speak to my manager, who can't speak because he's a mute.",
        "permalink": "/r/MaliciousCompliance/comments/b90257/you_want_to_speak_to_my_manager_instead_if_me_sure/",
        "comments": [
            "Gow did Fred find this amusing as well?",
            ">Fred's a great guy, he tells good jokes\n\n>... He's also a mute.\n\n\nI found this way funnier than I should have lol",
            "Fun fact! Auslan is the predominant sign language used in Australia and is very similar to BSL (British Sign Language). The minority sign language of Australia, AISL, is very similar to ISL (Irish Sign Language) ",
            "Is it just me that got a little happy knowing that someone within the Deaf Community holds such a high level of position? It’s hard enough here in USA with the stigmas. ",
            "Since when does big w sell cigarettes?",
            ">  Fred's a great guy, he tells good jokes, he's always ready to help his friends and he's a caring soul.\n\nFred's usually are!",
            "> rigor mortis smile on my face \n\nSo sorry to hear about that. I worked for Walmart for a short time and it took me about 3 months after I left before I could change the shape on my face at will.",
            "Lmao!!! Im a deaf guy and love this!!!\n\nWhen I was fresh out of high school, I worked at a retail. One time a customer came up to me and start to try talk. When I pulled out a note pad and pen (this was early 2000)\n\nThe customer got angry and cussed at me and walked to the next worker who was a older man in his 60’s.\n\nThe man saw how customer was toward me.. he pretended to not be able to hear either.\n\nThe customer stormed out of the store after that lol",
            "Beautiful!",
            "Thanks for writing upside down to make it easier to read",
            "What is UTE?",
            "Great story, and Big W, what a name! ",
            "It’s really cool that you’re workplace was adaptive for Fred’s disabilities. Go Big Dub!",
            "I was expecting a classic \"manager comes over and says the same thing I did.\" The deaf/mute was a nice twist",
            "A male Karen? How interesting",
            "Absolutely beautiful. I mean, other than the paperwork for the incident this must've been funny as hell. \n\nAnd sorry about all the messed up milk chocolate in a 3 foot radius. ",
            "Seems his complaint *fell on deaf ears*.\n",
            "Nice one mate :)  Also great to hear that Australia is not discriminating against people with minor barriers to work like being able to speak.  I need to learn more sign language.  ",
            "That's hilarious",
            "Goddamn, this was beautiful ",
            "Just got to say, I love the diversity. I've never had any Co worker/manager who had a disability. Makes my heart happy that this guy is able to support himself/do what he wants. \nI also don't get why \"customers\" think they can't treat retail associates/anyone in the food industry like garbage. I've been there, it just makes me laugh now 🤷",
            "Apart from the story, I think it's great that deaf mutes rise to a high management position. :)",
            "I love it!\n\n&#x200B;",
            "*clears throat in Australian*.     \nSick shit dickhead.",
            "Brilliant.",
            "Fred is my favorite person right now.",
            "This is golden",
            "You can buy cigarettes at big w?     ",
            "As soon as I read this was Australian, my interest peaked. The general public can be nauseatingly stupid when something doesn’t go their way. ",
            "Thanks for the story u/Yiffparty_exe!",
            "I'm actually a bit surprised that he can't read lips at all, especially since he was born with hearing; does that mean that reading lips is more about speaking than hearing?\n\nI ask because I've known a handful of people who've been deaf since birth who both read lips and speak; just curious.",
            "It's good to hear an Aussie version of these stories. And nevermind autocorrected euphamisms - you just have to teach your phone new words like \"crikey\" and \"bogan\".",
            "Tl;dr didn't do justice",
            "\nOmg I’m laughing so hard. Nice work OP let’s get married now ",
            "Big W Townsville?",
            "For those who use Freedom Temperature rather than Commie Temperature, that's 84 F outside, 93 F inside.",
            "[deleted]",
            "Oh, Big W. So many crazies, so little time ",
            "“Wrapped his ute around a tree.” Damn! That must be an interesting story.",
            "Sounds like an after credits scene in a modern remake of The Stand if you ask me, but does that make OP Tom Moon, and who’s Randall Flagg in all this?",
            "**No refunds. Only bans for life!**",
            "If I knew anything about the gold silver thing, id give you two of each. That was the best ever.",
            "Since when did Big W sell cigarettes??",
            "dat username, though... ;)",
            "> I tend to switch to autopilot when tired (almost always at the end of shifts) and can be a dick when annoyed. Me in a nutshell. \n\n&#x200B;\n\nHey! Get out of MY nutshell!",
            "So the customer's logic was: \"I don't want to talk to your supervisor! Let me talk to your supervisor about this!\" \nEntitled customers, man...",
            "Question: what is a PDA?",
            "Instead if me ",
            "How did a deaf-mute guy become a manager at Big W?",
            "honestly a deaf mute is probably the worst choice for a manager."
        ]
    },
    {
        "post_id": "12gybjt",
        "author": "SignSavings9270",
        "title": "Print out the internet? Yes Ma'am!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/12gybjt/print_out_the_internet_yes_maam/",
        "score": 15107,
        "num_comments": 451,
        "created_utc": 1681079866.0,
        "selftext": "This is about a decade ago, but still well within the realm of the internet. I was a technical writer for the government and had slowly been transferring our old employee handbook (think government bureaucracy from the 1940s) into a modern and actually useful doc (think one page with our policies and links to useful websites, like Office of Personnel Management, forms for workman's comp, etc.).  My boss wanted the whole thing printed out, on her desk the next morning. This was Monday of the Thanksgiving weekend. I printed out the 200 or so pages and just had the links to the various websites in bold. This took about an hour, and I left it on her desk before going home that night.\n\nShe calls me in her office on Tuesday afternoon and proceeds to yell at me at how stupid I am, do I think people can just go to a website when it is on paper? No. I need to PRINT everything out. I calmly tell her that these sites are pretty dense and deep and it would be about 10,000 pages.  She says she does not care, it needs to be ON HER DESK DAMMIT first thing Monday morning. Mind you, this is now Tuesday and we usually had some of Wednesday off. I was not really planning to work Thursday Thanksgiving or Friday, as I had applied for leave and was looking forward to a nice relaxing long weekend. I don't have family, but I had plans.  But ok. I asked for, and got the request to have \"everything pertaining to the employee handbook online in a printed format.\"\n\nI also had real work and real deadlines. A quick bit of context: She was my boss, she did my performance appraisals and she could make my life miserable and possibly fire me. However, my clients were teams that put together engineering plans, biological assessments, scientific journal articles, reports to Congress, etc. that had real-world deadlines. On some of these, if you missed the publication date, your agency paid $100,000 a day in delay fees. Or you would piss off a congressperson, which is never a good idea.  And I was really getting sick and tired of  my bosses requests that took me away from my actual work.\n\nSo I was printing and printing all the rest of Tuesday afternoon, and then Wednesday. I had to go to the site, print, click on the next link, print, etc.  On Wednesday, we got a congressional (a letter from a congress critter that was actually important). Had we not gotten that, I might not have done what I did... I got overtime approved pronto to take care of this request. So I did work Thanksgiving.  As I was doing that, I kept on printing. And printing. I used up every sheet of paper in our 14 story building. I kept on researching the response for the congressional, printing, going to the next floor to carefully get that packet of paper to tuck under the appropriate page, etc. I had paper in about 20 different conference rooms.\n\nI could have done the congressional in about 8 hours. BUT it was not due until Monday. And all of this printing took me a good 24 hours of work. So I put in for 32 hours (Thurs, Fri, Sat, and Sun).  Got it done. This is now two stacks of paper, each about 6 feet high. I was waaaay under in my estimate of 10,000 pages as it was more like about 30,000. (Remember, I had at least 5 printers going at once for 4 days etc.).  I put this in my boss's office (which was already none too clean and pristine).\n\nI got written up, with a disciplinary hearing and everything. The charge was .... malicious compliance. I kept my job only because I did have her request in an email.\n\n===EDITS\n\nClosed my parens.\n\nUPDATE and explanations.\n\nI did not expect this to get more than a few hundred views, so thank you all for reading and being amused. A few explanations from questions in the comments:\n\n\"I kept my job only because . . .\" I say that because the boss was VERY UPSET and was going to HR demanding that I be put on a Performance Improvement Plan (PIP) where she could then take her revenge and create other issues that would have gotten me fired.  I was probably not in danger of being fired simply for this action. But I was not put on a PIP. I was given a  Disciplinary Letter. So the only actual fallout was that I could not get a bonus (we get $1,000 bonuses if our performance is above average). I would have been ok in a RIF as this is a mild punishment.\n\nYes, the charge actually and literally was \"Malicious Compliance.\" That was what was written on the Disciplinary Letter. She could not get me on anything else.  She had not set any limits (you can only spend x hours, print out x materials, etc.). And I had her instructions in an email to print out the handbook and all pertaining information from websites. I do not remember the exact wording. I probably should have kept that all these years, but when I left the government after 3 decades, I pretty much threw out everything.\n\nThe two six-foot stacks were not just the paper printouts. The handbook covered everything and was more of an intranet in itself.  I had been working on this project for a long time in my spare time.  The handbook covered everything. In short, this was a well-organized intranet where you could quickly find exactly what you needed and no more.  I had Human Resources policies on leave, tardiness, all disciplinary actions, retirement, health insurance, taxes, transfer requests, etc.; how to write all types of reports (planning reports, facility review reports, congressionals, etc.) along with all templates for the reports; project management and public involvement processes, etc.; every position description and how to write performance reviews, award letters, etc.;  emergency procedures for particular buildings, etc.; how to conduct and write a Job Hazard Analysis for any type of work on a facility, etc.. . . . There was absolutely no reason to print this out. And my boss never gave me a reason.  I had been arguing against printing this for at least a year before my boss gave me the order to even print the 200 pages I had in the first place. These 200 pages each briefly explained the situation (for example, why we do a Job Hazard Analysis, what it should cover, and who should do one) and then gave links (for example to the Word Template you could download and use and to good examples).  So, I already had had a LOT of material that I just put into the piles. So the piles looked like:\\* Index tab with sticky for the topic\\* Sheet of paper explaining the concept\\* Ream of paper printing out the internet (all of the pages with the related links), neatly put into a notebook.\\* Pre-printed examples of templates, reports, etc.\n\nWe did have a printing unit off site, so major jobs were printed there. Thus we did not have that many copiers in the building (one per floor). And yes, before you ask, my boss \\*\\*could have\\*\\* asked the copy unit to do the work. But the copy unit would only print things that were already in a pre-approved pdf format. They would not have printed the internet for my boss.\n\nYes, my boss kept her job. She was promoted soon after from being the group manager of about 15 people to being the Deputy Chief of a division of several hundred people.\n\nYes, I worked at the same job (technical writer) for 30+ years. First off, I loved what I did. I was good at it. I never wanted to go into management and deal with people headaches myself. Second off, I needed the health insurance and would not have been able to get a private company job because of my underlying handicap. So staying put in the government and doing what I loved worked out well for me. And I was quite effective at my job. I wrote documents that allowed decisionmakers to understand complex issues and make good decisions, employees use and protect our facilities, etc.. My colleagues respected me and we worked well together.\n\nYes, this is the U.S. Federal Government. And we did have a very ineffectual union where only a few people were allowed to be bargaining unit members. And the union could have done very little to save my job.\n\nThanks for reading my funny little story.",
        "permalink": "/r/MaliciousCompliance/comments/12gybjt/print_out_the_internet_yes_maam/",
        "comments": [
            "Should read \"got the request in writing...\" Ironically in an email.",
            "Another day saved by CYA paper trail.",
            "Did nothing happen to her? For her \"I don't care\" stupid request?",
            "I had a boss once tell me “do x” and I explained (this being my area of expertise) that doing “x” would ruin our product. She said that if I didn’t “do x” I would be fired for insubordination. I asked her to put it in an email, which I immediately printed out and kept safe. So I did “x.”\n\nA few weeks later, when the product was due to be delivered, management discovered the product was ruined and undeliverable. I was called in to the vice president’s office and asked to explain why I had done “x” when it was obvious that it would ruin the product. I showed them the email from my boss. They fired me because I “should have refused” to do “x.”",
            "OP, was there any fallout for your boss, since they went all the way forward in documenting their own idiocy then retaliating too?",
            "Did she give you a good performance review?",
            "[deleted]",
            "No. I need to PRINT everything out. I calmly tell her that these sites are pretty dense and deep and it would be about 10,000 pages. She says she does not care, it needs to be ON HER DESK DAMMIT first thing Monday morning. \n\nShe heard you but didn’t listen.  Stupid is as stupid does.\n\nShe may not be stupid but, her actions say otherwise!",
            "“The charge was… malicious compliance.”\n\nReally?!? Oh please, please, please tell me they used those actual words in the write up.\n\nCertified by the federal government malicious compliance… you win!",
            "that’s dumb. she requested it but you got in trouble. i understand it was years ago. but the fact that she didn’t understand she could just look at anything and everything on the computer and didn’t need a physical copy? if it was some HR thing? that would be malicious compliance on her part. but government jobs think different. so it is what it is. it happened.",
            "INFO: Is this an unbroadcasted episode from \"*The IT Crowd*\"?",
            "I once worked for a small museum outreach program at a university. But this program was currently moving to be under another department. \n\nWe had a ton of activities that could be loaned out to teachers in the area, along with guides for doing the activities (and accompanying info in most cases). One of the bosses with the new department asked my coworker to send her all the activities. We had all the activities digitally already, and told her so. But no, boss wanted all the activities PRINTED OUT. \n\nCoworker got busy. Several hours into the process, running on only one printer. But it was still several hundred pages in. Then the other boss comes in and asks what the heck is going on, says to stop printing immediately because that paper was coming out of the museum's budget and they would have to pay it back. \n\nStrangely, first boss was okay with the digital files once she was made aware of that detail...",
            "I used to work as a tech writer at a defense contractor. There were several times when our customer (not tech-savvy at all) requested to receive the entire maintenance manual (also around 10,000 pages) be printed out and mailed to them for them to review. Thankfully, my manager killed that idea.",
            "> *I got written up, with a disciplinary hearing and everything. The charge was .... malicious compliance. I kept my job only because I did have her request in an email.*\n\nGot to love how the protesting employee is punished, and never the manager who made the world's dumbest request.",
            "And that printing expense got passed on to the US taxpayer? Thanks!",
            ">I kept my job only because I did have her request in an email.\n\nDid you print it out for her?",
            "\"I told her what the consequence would be and was ordered, and not kindly either, to do as I was told. Now, when I do that -I- am charged with malicious compliance for doing exactly as I was told. Here's the email in which I was ordered to do this, very much against my recommendation at the time. And because the output is enormous, which I predicted, now I'm in a disciplinary hearing. Had I not done this I would have been written up and potentially been fired for not following orders. This is a heads you win, tails I lose situation.\"",
            "getting written up for following orders to a t. that's next level pettiness.",
            "I once had to print out every email exchange I had with a parent (I was a special Ed teacher) because she wanted to sue the school. \n\nI looked at the school’s attorney and apologized because I emailed with this parent at least 5-6 times a day every day, along with emails attaching copies of the homework for each of his classes and copies of class notes. And since is was May… that was a whole lot of emails. \n\nAdditionally I kept notes of dates, times, and what was discussed for all phone calls with the parent (which was usually about 4 a day). And this all needed to be printed out too. \n\nI kept a file for each of my students (not just this one) with all of this info… because it seemed like a good idea and helped me keep track of what I send/said and when.\n\nThe attorney looked at me when I brought all the print outs, had to use a cart lol. She said “Well good news is clearly there was sufficient communication with this parent. Bad news is I have a lot of reading to do.”",
            "I'm sorry do you really think anyone thought there was no internet in 2013",
            "How does a 14 story office building only have 8 boxes of paper? \n\nWhen I used to work for the feds, I went to work from home. They sent 3 boxes of paper with me.",
            "Wait...you got written up for doing what you were told despite your objections and you having explained why it was a waste of resources? I would definitely fight that.",
            "You should have refused to sign the write up.",
            "I hate these \"modern and useful docs\" style docs for things you're required to do.\n\nBecause you end up with 10+ separate documents each having endless steps, with most steps appearing several times and all pages referencing some but never all of the other pages.\n\nMaybe if the printout of everything pertaining to the employee handbook is 200 or so pages with 30000 pages of material referenced, the damn thing needs to be cut in half. Then cut in half again, and again, and again, and maybe one more time for good measure.",
            "How ironic would it be if it said “Please consider the environment before printing” at the bottom of her email? It’s been at the bottom of my organisations emails for the past 15 years.\n\n[https://thinkbeforeprinting.org](https://thinkbeforeprinting.org)",
            "And the website still sucks. No offense, OP. \n\nSource: govt employee",
            "I don't understand, why did you get written up if you did what she told you to? What did she want then?",
            "Back during the Ford/Firestone Deflatgate dust-up I worked for a major PR firm that took on Firestone as a client. As part of the court proceedings we had to track - and submit - all of our correspondence with the client. \n\nNot only did many of our project managers print off every single email and keep them in binders that they submitted weekly but we (in IT) would pull each day's worth of DAT tapes from all of our US offices (I think 8 at the time?) to send in, as well. I can't remember how long this went on. Reams and reams of binders along with stacks of DAT tapes",
            "Think I've commented this before, but: Had a boss who told me to \"print out \\[the company's\\] website so I can read it.\"  I knew it was time to leave. She's still at that place; I am not.",
            "LOL way back in the day I did tech support for one of the first web hosting companies. Had a woman call my boss to complain because I \"refused to send her the Internet on a CD\".",
            "Ugh. Another unsatisfying ending.",
            "[deleted]",
            "Well done, OP! As one who once had a similar \"print everything\" order from a boss so stupid I as surprised she could get her shoes on the correct feet, I salute you.",
            "But did you actually place it on her desk?",
            "10 years ago was 2013. How old was your boss that they didn't get the internet in 2013?",
            "Well, this is what beaurucracy is like.\n\nEverything needs to be done on paper. Who cares if the adopting the new system will make work go 6x faster.",
            "I'm guessing this is US and public employees doesn't have job security? Because public employees should have job security to tell no to all kind of bullshit.",
            "Shitty of them to write you up.  You made it clear what was involved and your manager was an incompetent time and resource waster.",
            "I assume they did their damnedest to get rid of you after that, because you showed you had a brain AND a backbone. Government agencies HATE that. (Worked for one for 15 years.)",
            "Ok but like what is she expecting you to do lol",
            "I hope I never become a dumb old person.",
            "> This is about a decade ago, but still well within the realm of the internet.\n\n\nHeh. In 2013 we had mobile phones with Internet access in them for ten years already.",
            "It really sounds like you just played yourself out of a holiday",
            "How can you get written up for doing what she asks? What's the alternative?",
            "For reference purposes, a ream (paper-wrapped package) of printer paper is 500 pages. The “basis sheet” is 17x22, or 4 times the size of a letter-size sheet (“basis sheet” is the page size where the weight of a ream is used to describe the paper, as in “20 pound copy paper”, so a ream of 20 pound letter size paper is 5 pounds). A carton is 10 reams, or 5,000 pages, or 50 pounds.\n\nYou said that the full printout was 30,000 pages. That’s 6 cartons of paper, or 300 pounds of paper.",
            "Should have printed it in 2point Times New Roman.\n\ntechnically still \"printed\" but even more useless.",
            "Sounds like that Entitled boss was trying to set you up to be fired and it backfired!",
            "Honestly, props to you for even understanding her ridiculous request. I had to reread that a few times just to grasp the magnitude of her misunderstanding of how the internet works because it was so absolutely and utterly absurd.",
            "Can’t believe they wrote you up for literally doing what you were forced to do",
            "Considering that a decade ago was 2013, yeah I’d say it’s still “within the realm of the internet”",
            "Eugh what an anticlimactic story",
            "And you were probably forced to use IE6 to do all this since that would have been the approved web browser at the time. I don't miss my government contractor days at all. Miss a few of the people I worked with though.",
            "...how are we a global superpower when the country is run on pants-on-head Darwin-was-wrong total incompetents like this whose only value will be in the material they return to the earth when they're finally dead and buried, yet who are richly rewarded for their idiocy by their fellow absolute morons?",
            "A friend told me he wanted to learn PHP, and he will just read the manual from start to finish and learn it by heart, how hard can it be. I exported it in PDF form, and apparently it's roughly 30,000 pages, with plenty of other info you need to know, practice and understand.\n\nThe plan was quickly thrown out the window.",
            "Tech writer here. Though this happened a decade ago I feel your pain. Sorry you had to deal with this nonsense. And on a holiday weekend.",
            "Damned if you do, damned if you don't.",
            "A 30cm high stack of paper is 30,000 sheets.  You had 2 stacks 6' high in your story.  That's over 360,000 sheets of paper.  36 cases of paper, and I'm not going to bother with the ink cartridges.  I don't believe you had the materials at hand for this, and even if you did, the sheer ammount of waste would have cost anyone their job.  \n\nThis didn't happen.",
            "I had a boss once ask me to call someone from the internet who made a comment about our business.  I said the internet is millions of documents.  I will not be able to find what you want.",
            "Great creative writing skills here, you get an A",
            "A decade ago was 2013",
            "Did she ever clarify what she expected, if it wasn't to print all that? Or did she just not like looking stupid?",
            "\"Ineffectual union where only a few could be bargaining members.\" Unfortunately OPM says who can and cannot be bargaining members. It's such crap. Some makes sense, like management. But others are just based on the job. Anyone who is a lawyer automatically cannot be. This is done to stack the deck against the worker. Also, most places make union participation optional. So if you don't pay dues, you cannot get union support.",
            "I would have been filled with RAGE if I had gotten that letter. Tried to warn, be polite and you got spat in the face and told what to do. You did it. If I were american I would 100% try legal actions. Atleast find another job and leave them hanging. Oof.. I would be fuming hahaha",
            "I feel like I would have raised some sort of formal grievance against her with the union, assuming US govt has a union for employees",
            "I worked for a state legislature for the house revenue committee. I took summers off and had a person that did the work for my committee in my absence. \n\nI returned in the fall expecting that the work would have been done. (I’m retired now and this was at least 20 years ago so I don’t remember exactly what happened but the work wasn’t done.) And I didn’t realize it until late the day before our meeting. On the agenda was review ALL of the legislation for the previous session. We received referrals from any committee that created revenue through fees and taxes plus our own revenue committee legislation. Our committee had to come up with the money to pay for that years’ budget. There were hundreds of bills considered by the committee. Some of them huge impactful legislation. \n\nWe used notebooks then, not being computerized yet. \n\nSo I pulled the list of bills and I got busy. I used every copy machine in the building. The copy centers, the clerks, and the copy machines on my floor. \n\nI was there all night. I didn’t even call home b/c by the time I realized I was going to be there all night, it was already past midnight. \n\nI did NOT copy all of them. I couldn’t. \n\nMy boss was furious with me. “You should have known!” he said to me with a spiteful glare. The thing is, I did NOT know this committee reviewed their previous years’ work because this was my first year working that committee. \n\nI spent the night going from copy machine to copy machine, taking out copies, adding reams of paper, clearing jams, finding toner, bringing the copies to a workroom filled with committee notebooks. The committee had (3) 4” notebooks for each member for the previous session. I ended up with another 4th new notebook. \n\nI ran home at 8:00 am to change clothes for my meeting. Another person volunteered to fill the notebooks while I went home. \n\nI said to my husband, “You can be mad at me later. I have been copying my guts out all night. I’m sorry I didn’t call. I have a meeting in an hour. I’m going back as soon as I change clothes.” He was furious but on my behalf. \n\nI was never the same after this. I was known as a very hard worker, excellent at my job. That I was yelled at for this, and the person that was supposed to do this during the summer didn’t even get a slap on the wrist destroyed me. \n\nI quit that year. I worked there 13 years.",
            "You know sometimes I wish incompetence in serious scenarios was punishable by death. Like Dmitry Pavlov who was arrested for criminal incompetence and treason.",
            "Your actions didn't sound malicious to me (for disciplinary board), you warned her and followed her order.",
            "You ran out of paper before ink? The ink used up alone wwould be costly no?\n\nhope you used color when applicable.",
            "Am tech writer, do approve. 😂",
            "Yes 10 years ago is still within the realm of the internet…just barely though",
            "\"I can't believe you printed the whole thing.\"\n\n\"I did it, ma'am. I printed it.\"\n\n\"I can't believe you printed the *whole* thing.\"",
            "> I got written up, with a disciplinary hearing and everything. The charge was .... malicious compliance.\n\nWith some stories there is a discussion about whether it is really malicious compliance. In your case there can be no argument.",
            "Close your parentheses",
            "Malicious compliance? You did exactly what she told you to do",
            "\"This is about a decade ago, but still well within the realm of the internet.\"   \nBruh a decade ago is 2013. Internet gained traction around 1993 which is still 20 years before that even.",
            "Sounds like my job as a clerk at Molina Healthcare. One of my jobs was supporting the corporate training team who insisted on having printed binders for every new hire (pre-pandemic.) Every week, the powers-that-be would add yet another document to the list, and despite my warnings, the individual binders ballooned to well over two reams of paper EACH. It was taking me HOURS each week to create and print these monstrosities, to the extent that I was falling behind on my actual work. Staff hated me for jamming up the copiers on my floor trying to get these things printed in a timely manner. Eventually, I would go up the the executive level to print because nobody showed up there until after 9am. And you know what? These binders would just get stuck in a desk drawer never to be touched again. When employees left, it was my job to go around clearing out desks, and I literally needed a cart to collect JUST the unused training binders.  Most. Ridiculous. Job. EVER ",
            "Boomers and their obsession with printing everything. Stuff does not need to be printed.",
            "So, I’m thinking you got written up not so much for the overtime that was pre-approved (hopefully) but the fact that you’re at some level where you are either supposed to have limited supervision and are expected to make some decisions on your own.  The fact once you had a pile of paper printed out stacked over 4 or 8 inches (1 or 2 binder’s worth) and decided to keep printing beyond what would have been considered practical for an employee to print out or an agency to pay for printing, you would have been expected to execute good judgement and stop the print job and overtime (unless you had continued on with the congressional request instead).  Does that sound about right?  Very malicious compliance, indeed.  Unfortunately, to your own detriment.  Did the congressional request get executed in time?  Or, was that not made a priority and why you were subject to a disciplinary hearing/action?",
            "How did she get promoted later on and yet you get written up?  Something doesn’t make sense here.",
            "Something about this is sussy.\n\n[I work in a print shop](https://imgur.com/a/fHhmeL1), so naturally I’m handling large quantities of paper day-in and day-out. Pictured in the hyperlink is your typical case of copy paper, which normally houses 10 reams of 500 sheets of 20 lb. to 28 lb. To say that it required *~20 different conferences rooms* to store 30,000 sheets of paper is preposterous. Multiply that one case you see on the ground in the image times 6, and that’s 30,000 sheets of paper visualized.\n\nI can’t call into question the validity of the printing speeds because technology has changed between 2012 and 2023, and I just haven’t been doing printing that long, but 4 days spread across 5 printers seems questionable as well.",
            "Please tell me you put them out of order...",
            "Not bad for a day in the life of a dog food company.",
            "By any chance is this your boss?\n\n[https://www.youtube.com/watch?v=iDbyYGrswtg&t=5s](https://www.youtube.com/watch?v=iDbyYGrswtg&t=5s)",
            "These days she would have been reported to the OIG for fraud, waste, and abuse.",
            "I worked at  a radio station, during the beginning of AOL, \"all you can surf for $24.99\" a month doing a computer tech/AOL question and answer show. \n\nMy favorite question:\n\nWhere can I buy the a\nworld Wide Web on a cd so I don't have to pay a monthly fee. ? \n\nAlmost as good as people breaking the \" cup holder\" on thier tower. ( cd player)",
            "Is that dumb entitled boss still working there, or has she got chewed out as of right now?"
        ]
    },
    {
        "post_id": "vqg7w9",
        "author": "yarnwonder",
        "title": "You need a doctors note to prove sickness or we’ll sack you.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vqg7w9/you_need_a_doctors_note_to_prove_sickness_or_well/",
        "score": 15092,
        "num_comments": 693,
        "created_utc": 1656850179.0,
        "selftext": "I was reminded of this because of another post and happened almost 20 years ago. I had been working away in a restaurant and had just finished a Saturday day shift. It wasn’t common to get a Saturday night off as it was our busiest night and the boss was making me feel I should be offering to do overtime because they were being so “kind” to me. The last hour of my shift I started feeling crappy. By the time I got home I was exploding at both ends and really miserable. I was hoping I would feel better the next morning, but still felt awful. I dutifully phoned in sick because I couldn’t be around food until I had been vomit/diarrhoea free for 24 hours. My boss immediately assumed I was hungover and threatened to fire me for letting everyone down. I said fine because I wasn’t about to go into work. \n\nAt the time my flatmate was helping the same restaurant out because they were short a chef. He goes into work and is telling boss how sick I am. He didn’t know I had been threatened, but it meant that boss phoned me back and said if I could provide a sick note for the day I wouldn’t lose my job. \n\nAt this time my job was paying about €300 a week and a doctors appointment and sick note was going to set me back €100. Fine, if you’re going to assume the worst about me when I had never phoned in sick before, done. I got the grumpiest doctor who was PISSED I had made an appointment for this when he had actual sick people who needed to see him. \n\nThe doctor signed me off for a full week. Instead of helping out to cover one of my shifts they had to cover another 5 shifts and I got a week off paid.",
        "permalink": "/r/MaliciousCompliance/comments/vqg7w9/you_need_a_doctors_note_to_prove_sickness_or_well/",
        "comments": [
            "I absolutely hated it when patients would come into my emergency department, wait for hours and hours while they (and often their family members with them) are exposed to who knows what from the other people waiting, for a damned doctors note.\n\nSo hell, yeah, I'd give them a note.  \"Mr. Smith has reported feeling unwell.  He should be off work for two weeks\".\n\nNothing about a diagnosis, treatment, symptoms, any of that - because the boss is not entitled (in the US) to that information under health care privacy laws.\n\nI had a couple of low-level managers call up and try to 'discuss' the patient with me.  That wasn't happening, and I told them that in no uncertain terms.  Malicious non-compliance at it's best.",
            "Ugh, same. Worked in a daycare. Got pink eye the same day my long distance boyfriend came to town. Called out. Went to dr. Got the note. Next day I go in to give it to the admin with the worst attitude and said \"here's my Dr's note\". She yelled at me, \"be quiet! We didn't send out a notice about pink eye in the classroom because we thought you were lying.\" look at my eye, lady. And screw you.",
            "\"Hey boss, not feeling too hot, I'm gonna take tomorrow off.  \n\"No, You need a doctor's note!\"  \n*later*  \n\"Ok boss, got a doctor's note, he says I gotta take two weeks off, and then two weeks light duties when I come back.\"  \n*pikachu face*",
            "The mentality of the manager reminds me of the US Army.  Of course this may be different now, or just different from 1 base to another.  But when a soldier was feeling too sick to report for their normal daily duties.  They couldn't just call out.  They still had to get checked over by medical.  There were small little \"clinics\" for stuff like this.  Which was fine if you lived on the base.  But if you lived off base, then you still had to drive to a clinic, get the doctor's note, and then show it to your chain of command.",
            "Omfg. I hated doctors notes.\n\nI took two days off because of a cold. Went back to work after. You NEED A DOCTORS NOTE!!\n\nHad to take another half day to sit in a doctor's office to get this note. \n\nHe asked why I didn't do this while I was sick. Because I had a cold? And didn't really want to get the people in the waiting room sick with me AND waste our time.\n\nIt's bullshit.",
            "Had this happen. No doctor appointments, booked solid for weeks, literally. Then I looked up my jurisdiction.\n\nA statutory declaration also qualified. So I submitted that. They refused it. I resubmitted the same stat dec with the relevant legislation page stapled to it and highlighted.\n\nAccepted.",
            "[deleted]",
            "\"Letting everyone down...\"\n\nYeah, that's not a red flag or anything...",
            "Where in Europe does a doctor's note cost €100? Please let me know so I can avoid that country.",
            "Kind of similar story here.\n\nI worked at a donation center bringing in everything from couches to clothing. 33 gallon black trash bags filled to bursting with books. Everything. Usually there would be 2 people working in case of big donations so one person isn't carrying everything. I was in my 20s at the time and a medium build woman. I could handle most things alone and genuinely didnt mind the work. It was nice to have help though for large furniture items or multiple truck loads. And it was standard practice to switch on and off as main donation taker. A woman in her 60s was hired as my partner. I had worked and been trained by women in their late 50s and 60s so was not worried about her age. However, she had apparently been hired and told that she would not have to answer the donation door since she was older, overweight (so she had trouble walking for long distances), and multiple health problems with her lungs and movement in general. I was told that I could take it upon myself to ask her to help more (that's literally not my job I wasn't her boss) or suck it up and take all the responsibility of donations. After about 6 months of escalating tensions and heated discussions about it, I noticed my arm getting sore and I was having trouble carrying bags. I told my managers and asked to be taken off donations. They said no, that I needed a Dr's note otherwise I would have to be let go since there were no other positions. I called in the next day, went to the Dr, was given a wrist brace, told to take the next 2 days off (which led into the weekend so off til monday), then had a Dr's note to be put on light duty work for a few weeks. That left the other woman having to do donations alone (I felt bad but she was also a really awful person in general so not that bad). Since she had so many health problems that meant management had to work twice as hard helping her with donations and running around the store taking care of customers and other employees. Sorry not sorry 🤷‍♀️",
            "I am so jealous of those of you who had the doctor’s notes respected. I used them properly for severe illness, and then was told to worry about my attendance points while in active anaphylaxis. If I left, I would be removed from my job on her orders. So I told her boss she attempted to make me stay through a life threatening emergency and then quit on the spot. She was fired too.",
            "And I thought the worst shit I had read about this was the diarrhea. I was wrong! 😁",
            "I worked at a clinic for 20 years and the school district had a policy of kids needing a doctors note if they were out 2 days in a row. Ridiculous. So many working parents would send sick kids to school running fevers and if the nurse called them to pick them up they would just send them back to school the next day. They couldn’t afford to miss work and pay $100 bucks for the doctors visit. Gone is common sense.",
            "Had something like this happen once. I was told I had to have a doctor's note to return to work. Not that I needed to be cleared to work, I just wouldn't be permitted to work unless my absence was excused. Anyways, I left work, drove to the nearest clinic and just asked for a note. I didn't need an appointment nor did I pay anything. Got a pretty hilarious passive aggressive note that I returned to work with. The look on the manager's face was priceless. Also, she later fired me the day I told her my mother died.",
            "My doctor would up any 1 day off note to 3 \"due to not being able to rest\" by having to go get the note. HE was clear to document that the requirement for the note aggravated the situation and increased the time off needed. They stopped asking me for notes.",
            "If your job requires a doctors note, then your employer should cover any out of pocket medical costs to obtain that note.",
            "A friend of mine (who is migraine prone) was told by a boss that no one was sick for “just one day.”  In the future he was always sure to take off three days when he was not feeling well.",
            "Man, I’ve had chefs tell me I needed to drive down and “show myself” to them to prive I was sick. \n\nI did it once in my grandpa’s truck. Why I didn’t just have him drive me therr, I’ll never know. \n\nOne of the shittiest jobs I ever had. Looking back, it was like an abusive relationship. Long hours, tons of mandatory overtime, low pay, and no appreciation or encouragement when shit was rough to try to balance out my negative feelings-just “Oh well if you can’t take the (figurative) heat anymore, then you’re just proving you were never good enough for this job.”\n\nNow, I message in sick, there’s no “prove it” it’s “Don’t bring whatever you have into the office. Stay home, get well, and if it’s covid, let us know so we can add on covid specific leave time to keep your paycheck rounded out.” It’s wild how paying well and treating folks well makes such a difference in employee attitudes and improves the quality of the labor provided.",
            "As an Irish person your doctor ripped you off, I have never heard of them charging 50 for the note in addition to 50 for an appointment. It is also against the law here for an employer to sack you for not having a doctors note for day 1 and day 2 of being sick. Moreover, if they did sack you and you had been working their a year, the onus would be in the employer to prove their innocence. Something in your story isn't adding up.",
            "You don't ever have to explain or prove why you're calling out. Tell your employer that. Calling out is calling out. \n\nAnd any place that tries to make people feel bad for calling out or wants to guilt you into working overtime is toxic.",
            "End of November, early December my husband was out with the flu. He also was resigning mid-January as we were moving across country. He had 100 some hours of PTO. Well he was out 3-4 days before he felt well enough to return (work 12 h days) and tried to go back. They wouldn’t take him back without note if off 3 or more days. So he made an appointment with primary care, wasn’t going to waste the extra copay money for quick care for a note. The appointment was literally the day he turned in his resignation for. So he just rode out 6 weeks off and used up his PTO and quit. Never did pay for the stupid dr appointment.\n\nThey just lost out in a staff member for their final 6 weeks when they were already short as heck.",
            "Had a buddy go through this at work a while back. We were at the same employer, different departments. His kid got sick, he called out to take his son to doctor. \n\nHis manager said he needed to produce a Dr's note. He reminded boss that it's only required per our union agreement after 3 days sick leave. Boss said that's true but it's his discretion to ask for one at the first call out. This was a Monday, he said no problem I'll have one for you in 3 days. Boss was mad but my buddy was merely playing by the rules. \n\nSo instead of just saying \"hey I hope your kids okay, see you tomorrow\", he had a subordinate call out for 3 days just to make the juice worth the squeeze.",
            "First, this is stupid. Most places require a doctor note releasing you back to work if you miss three consecutive days. In the US. I do not penalize my employees if they need a sick day. I don’t care why you need the sick day. Maybe you are exhausted and need to recharge. I don’t care. Take your time.",
            "This is great, but needs to be taken one step further.\n\nInsist on delivering the note *only* to your boss, into his hand, then give him a big hug...coughing and sniffling the whole time.\n\nRemind him that when *he* is out sick...and he IS about to be sick...that he will need to bring a note from his doctor.  Inform his boss of this situation as well.",
            "On one hand, I understand businesses asking for a doctor's note so that people don't just call in all the time, claiming to be sick. On the other hand, you have people already missing out on a day's worth of pay or more but now they ALSO have to field the time and cost of going to the doctor and getting a note.",
            "I once had a boss try to tell me they needed a sick note when I was visibly sick and leaving. I straight up told him they don't pay me enough to cover a dr appointment evey time I get sick just so they can have a note and walked out. Was never asked by that boss for a sick note again.",
            "My Doc is the greatest!\n\nMe: Doc my back hurts and the pain radiates into my hip.\n\nDoc: Here's some pain meds and muscle relaxers and a consult with physical therepy. I wrote you out of work for two weeks because I know you walk a lot if you need more just call me.",
            "Sometimes they tell me I need a doctors note and I get a note from my therapist-a PhD. They didn’t say what kind of doctor or what kind of note.",
            "my work did not take doctors notes,  so that was always fun \"we are a no fault facility,  we do not take them, you will take points for attendance and then we will require a return to work note from the doctor\" \n\nI'll let you blink a few times at that,  doctor gives me a full week down because of the flu, work refuses to accept it, making me use attenance points, we only get 24 of those a year,  each day is 3 points and they wont remove them with the note,  cue me calling the plant manager whom can over ride anything,  he did,  used my vacation instead, so got paid to be at home sick with the flu, did not have to do anything with HR,  she kept after me over several weeks to give her the doctors note or she was not going to allow me to work.  tough shit, I used vacation, I do not owe you a note anymore.",
            "I work in critical care in the hospital. If I’m sick more than 3 days I need a doctors note- but not just any doctors note; it has to be on a specific 2 page HR form that the doctor has to go through with you. I can pay for it or my doctor can bill directly to the hospital. He gets so mad that he charges them $150 a pop. I’ve asked my specialist to fill it out if I have a Crohns flare up and he refuses/ just sends them the note on his GI letterhead and they’ve not pushed back so far.",
            "You can get a doctor to write you a note for anything. I’ve had a doctor write me a note about a injury I didn’t have and he never saw. You just tell them like a man what your shit boss is doing. They are pretty rad people. There isn’t like one doctor that runs everything. You literally can write your own note. Your boss isn’t going to call the doctor after and ask him if the note is legit. He is just using this to fuck with you.",
            "Doctors hate this shit. \n\nSource: me I’m an NP at an urgent care and write these notes all the time.",
            "They used to do that to me on occasion. It meant an auto 2nd day of sick to me, just to be pissy about it. One time was over a long weekend I got a horrible case of food poisoning. I had eaten some sandwich meat out of the fridge not realizing the fridge was not cooling food properly. It was horrible. My boss chewed me out, accused me of being hungover and hung up on me. I cried and cried. Went to Dr and they were going to put me in the hosp. Put me on an IV in the office instead and got another 2 days off on Dr’s note. I could have gone back after 1 day but I was so hurt I decided to take that 2nd day to unpack and do laundry lol",
            "My Mom died, I had to bring a death certificate to be paid for grievance.\n\nIt was 24 hours off.",
            "I had to do that once, went in to the doctor and was like “I feel fine now but I have to have a note for work” and they handed it over, no questions asked. \n\nMy manager still gave me shit and ended up firing me for “too many absences” even though I had a note for ALL of them (invoice when my car broke down over an hour away, a doctors note, and once for FMLA)",
            "I’ve had doctors ask me how long I wanted off when going in for a sick note. Asked for one day once and the doctor tried to talk me into taking a whole week. It was a minor issue that absolutely did not need a whole week off.",
            "This happened to my partner... Same thing just different line of work lol",
            "I did the same thing, my doctor was also pissed about it and gave me a week off.",
            "I’m a teacher in an affluent area. I had a student tell me they weren’t able to do X because of X medical excuse. This child was notorious for milking it. Went the the nurse multiple times per day for things like “hunger pains” or a hurting fingernail. \n\nI finally told the child he would need a note from a doctor if he truly couldn’t participate for medical reasons. His response was, “ok I’ll have one of my parents email you.” He sent a quick message on his Apple Watch and his dermatologist father delivered a “doctors note” to my inbox within 10 minutes. The child didn’t have to do the activity for a month. Bro was in 4th grade.",
            "I was let go from a nursing position for this. I didn’t get a doctors note because I’m a fucking nurse and I know how to take care of myself without having to to pay a copay. The company had to pay me my 58 hours of PTO I had accrued from working overtime due to shortages in staffing. I hate nursing.",
            "Had an old boss demand a doc's note  and, upon producing it, write me up anyway because anyone can get a doc's note for any reason. Ask me if I ever bothered to get one again.",
            "I'd have maliciously complied to come in and actively make sure I touched damn bear everything. And the published the text messages of the boss saying to the effect of \"I don't care if you're sick, get here now!\" Publish the records and let the internet destroy them.",
            "I'm so jaded from all of my bosses that I'd probably go in, vomit and shit everywhere, and then leave. Find another job when I feel better.",
            "I yelled at my fast-food boss for getting smart with me about getting a doctor’s note. I said “You do not pay me enough to have health insurance. Going to see a doctor costs me half a paycheck, *at least*. Are you going to pay for that?” \n\nHe never asked me for one, again.",
            "This happened to me once before kind of. Had an insane sunburn with blisters all over my shoulders and face and I worked in a restaurant in the kitchen so I knew working in the heat risked popping the blisters and infection so I called in. I should mention it was my first time calling in EVER and I worked there for 2 years and I was only fourteen years old!! When I called in my boss said I needed a doctors note or he wouldn't give me the raise I was promised. I didn't know how to get a doctor's note because again, literally 14, so I just came in. He saw my face and the giant blisters all over me and made me work 9 hours in the heat. As expected the blisters popped and it was so painful I had to go to the ER after my shift. Ended up needing a week and a half recovery before working in the kitchen again and it all could've been prevented if I had just stayed home a day or two and treated them myself. I should've sued him or something bc now I'm 18 and looking back it was so fucked up.",
            "This is one of my least favorite things about work. I understand lots of people do play hooky, but it sucks that it's just immediately assumed that's what you're doing even if you're genuinely sick",
            "Damn In the US that woulda been unpaid and the fee woulda been about $80-$150",
            "I would write you that note in a fucking heartbeat. \n\nGood on you!",
            "I'm a PA in the Urgent care, and I see this often in the US. It pisses me off, and I usually don't charge them or just charge for the test if they need a covid test. I will also give them as many days off within reason.",
            "I didn’t get full pay, but pretty sure it was done because they’d been such arseholes. It was probably holiday pay now I think about it.",
            "It's wild to think that Euro has been around for two decades already... Times flies. I was like ten when it came out (born in feb 91)... Geez.",
            "My dr is pretty great.  I'm a home health aid so I just call the office if I have a cold or something and she'll write me note.  Obviously I go in if it's strep or not improving.",
            "Love when this happened at a full time job that didn't provide health insurance.  I had bronchitis, which they could very well hear on the phone.  I just told them I can't afford a visit to the doctor, and said I wouldn't be coming back ¯\\_(ツ)_/¯",
            "I live in a state that you can't ask for a note from the doctor,  but my sweet employee keeps bringing me one.  I tell her each time, it's not necessary,  you just ask for the time off and you get it.  But she's very conscientious.",
            "Any em[plyeer that requires a doctor's note for an occasional sick day or two are shitty people.",
            "Are there any restaurants in the US that give servers any time off paid?",
            "I failed a class because I got a severe case strep throat........they refused to count me excused absent until I got a doctor's note (was living in a college dorm but had no roommate so that was hell) and then failed me anyways bc that class was participation based. I'm still mad about it.",
            "My doctor just asks, “how long do you want off.” That includes metal health days as well.",
            "I hope you used that week off to get a better boss.",
            "If work requires you to have a doctor's note to return to work, it's now a job requirement... I always take that to mean they're willing to pay for it like they do with entrance interviews, drug tests, accident claims etc.\n\nGotta find a cool doc that is willing to bill the company/workplace...usually costs a lot more than just a copay.",
            "In our country sick days always have to be backed by a sick note. You get  guaranteed income for a few months from then on. The first month is paid by the employer and from there on social security tales over. After a year you faal back on 70% of your previous net wage.\n\nEdit: spelling thx to the bot",
            "If they could actually pay me enough for one",
            "100 Euros well spent 🤣🤣🤣",
            "Why no go to work, contaminate everyone and return home ?",
            "My work isn't super strict about about taking sick leave, but if you call sick on a Monday or Friday the typically ask for a doctors note.\n\nFun little thing you can do in Australia is you can rock up to a police station, ask for a statutory declaration (more commonly known as a \"stat dec\") just write on it\n\nI (Name here) was sick and unable to work from x to y.\n\nSign and date it, get a \"justice of the peace\" to sign it, which the police are and then hand that in at work. Free.\n\nMy manager is interstate so I have half a dozen stat decs in a draw at work for the past few years when I have called in sick.\n\nA lot of Aussies say to go to a chemist, but they can't back date and they cost $20. Stat dec is free 😁",
            "Since when is it malicious compliance to take paid time you can take when you're sick?",
            "Had this happen to me, sorta, back around 2005. I was working 6 days a week, 2pm-close, as the General manager at a Domino's franchise store. (We were only open from 3-close, so it was the only shift.) For a $400/week salary. \n\nMy only day off was Monday, and it never failed I'd get at least 3-4 calls from whoever was covering that shift. So basically I had no life for no money, but I couldn't afford to work anywhere else (I don't have a degree or anything). Well, one Monday I got SUPER sick with what I know was food poisoning, from snacking without thinking on the precooked chicken on the make-line that my store owner REFUSED to throw away. I not only refused to answer the phone that day, since I was delirious with fever and a migraine that was photo and sound sensitive, I tried to call in the following day, Tuesday, and I was refused. Store owner was out on the beach and wouldn't come in to cover the shift. Told me if I didn't come in I was fired. So I did a bit of malicious compliance. Still running a high fever and spewing out both ends, I went in--but I explained to my skeleton crew of staff that I was very, very ill and i would be literally in the bathroom for the entire shift. We ran at least 2 hours on deliveries that night because one of our 2 drivers had to stay inside to take orders and make food, food cost was through the roof. And, before I left, I threw out that damned chicken.\n\nStore owner was fucken LIVID, mostly at the loss of the chicken!! I told him to get over himself, that all it would take would be one phone call from me to the Health Department to get his shit shut down. He couldn't fire me because it would have meant he would have had to do the work. I managed to find a new job a couple months later, I gave them 2 weeks' notice but they were still begging me to \"work at least a couple shifts a week to help\". Hell naw. Never been so relieved to leave a place.",
            "\"I had no idea I'd have to stay home for so long, I'm glad I went to the doctor\"",
            "i get this type of thing for ppl who constantly call out sick, especially last minute, but like for ppl who rarely do, its ridiculous. some bosses are too paranoid.",
            "One time, I got fired. I moved back home trying to recover from drug addiction. I went back to work at an old pizza place I used to work at, lots of drugs there. One night, the cook, remembering that I used to be a hell of a customer, gave me a bunch of free coke. I was only a few months sober, I cracked and relapsed. I did it all. The next day, I was bleeding internally. I was vomiting coffee-ground blood. I called my boss and said I was vomiting blood and had to go to the hospital. He told me that if I didn’t show up for my shift, I would lose my job. I said, okay, that’s fine. I’m not trying to die today. I went to the hospital, and checked myself into a detox program because I had just gotten a lot of free time. When I was in detox, the district manager of the pizza chain was there too. The same day that I had relapsed at work, he had done too much cocaine at another location, had a seizure, and fell down the stairs.",
            "I guess it's good to know that restaurant owners are just as petty in Europe as they are in the USA.",
            "I'd have my doctor write a note for a month off.",
            "I’ve never understood this. Especially in America where I’m at. You need a doctors note but I’m not going to give you benefits that cover doctors appointments or enough to pay for it. Also you’ll lose your job if you don’t provide the note.",
            "In Germany you always need a doctor's note to call in sick",
            "I've always had day dreams of becoming a doctor to do things just like this, and to become a lawyer to go after shitty landlords for free out of spite.",
            "Who the fuck is actually able to get a same day doctors appointment for being sick!? So stupid.",
            "I feel like requiring a doctor's note should be a HIPAA violation.",
            "Our family physician had Italian blood in him and he had their legendary temper, to boot!  You don't ever cross swords with him or he'd get out his Lupara out and blow your ass away.  I once asked him for a doctors note for the Giant Corporation was asking for one.  Soo, he wrote one on asbestos using a laser, sending it via FAX to home office and the branch I worked at. I swear the FAX was smoking when it arrived.\n\nNo one asked me for another one.",
            "How many times are we going to see this exact same story retold?",
            "Wait—I thought the UK had “free” health care?",
            "Which country uses € and charges 100€ for a doctor's note?",
            "Did you earn that week off ...? \n\nI don't think it wasn't given to you free...\n\nYou may have earned that just by being there as long as you did \n\nsometimes they will give you like 3 hours every week you're there towards sick time, so you can acrew time off as one of your benefits...\n\nBut still...GG",
            "doctor's* note\n\nUse a possessive noun, not a plural.",
            "Let me get this straight, \n\nYou call out sick, your boss asks for proof, and you’re pissed? \n\nlmfao okay",
            "You worked food service and got paid sick time?",
            "2nd one of these today. it is an epidemic."
        ]
    },
    {
        "post_id": "d7y4us",
        "author": "SalviaMoria",
        "title": "Karen Wants Her ID Checked",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d7y4us/karen_wants_her_id_checked/",
        "score": 15070,
        "num_comments": 621,
        "created_utc": 1569194130.0,
        "selftext": "I work in a casual fine dining restaurant in a downtown area. Prices aren't crazy but high enough that we dont get a super young crowd... I would say average age of our dinner crowd is 30 to 60 although it varies more on the weekend. I only include this information so you understand why I didnt initially ask for identification (even though you should always check) \n\nThursday night a table of 4 comes in for early dinner. 2 Karens and their daughters. Excellent. I'm ready for them to split entrees and tip me 15%. Not the WORST type of table if we're being honest, but nonetheless. They order a pitcher of sangria and I tell them I'll be right back with that for them to which Momma Karen says to me \"you really aren't going to check these girls IDs? Her birthday was just last month. Aren't you supposed to check anyone who looks under 40?\" \nShe is correct, of course that I should have asked for identification even though they girls were with their mothers and I was being lazy by assuming they were of age since their moms did not stop them from ordering drinks. I agree with her and tell her that I actually am supposed to check ALL IDs regardless of age, and proceed to look at all 4 of the ladies IDs. Unfortunately for Momma Karen, her birthday was a few days previously and her ID had expired. In the state of Michigan it is illegal to serve alcohol to anyone with an expired ID regardless of age so I had to deny Momma Karen a glass for the sangria, while her daughter and friend shared a pitcher. \n\nI didnt reallllly have malicious intentions, however, it felt good that Karen's antics backfired on her.\n\nEDIT: I didnt include details of Karen throwing a fit when I denied her a glass of sangria. She informed me that she, a business owner, is more aware of the law than I, a mere server, could ever be. I simply couldn't \"just do my job\" and bring her a glass. My generation doesn't respect elders and blah blah blah. Her daughters were a little embarrassed I believe but I tried to move past it and serve them the rest of their meal normally. Karen kept huffing and puffing but said no when I offered to bring a manager over",
        "permalink": "/r/MaliciousCompliance/comments/d7y4us/karen_wants_her_id_checked/",
        "comments": [
            "That’s pretty hilarious to be honest",
            "So what was her reaction",
            "I was a bartender at a casino and this happened all the time. If your ID is expired, doesn't matter your age, cannot serve you.",
            "The other day I went to a game and bought a drink. As we were leaving I was lamenting that I didn't get ID'd and I wanted them to because they ID under 30. When I got home and was switching purses I realized that I hadn't even brought my ID so it was a good thing I didn't get carded.",
            "I don't get the expired ID when it's proof of *age* rather than *identity*.\n\nI haven't gotten any younger since this ID expired, I promise.\n\nEdit: apparently a lot of places use *non-photo IDs*, so giving away expired IDs is a thing.",
            "I got carded for buying a bic cigarette lighter at a Plaid Pantry (a convenience store) when I was around 50. I thought that was moronic.",
            "Had this happen once working at a gas station. Lady comes in (after parking her truck right next to the door in what is clearly not a parking spot), walks to the cooler and grabs a case of beer, then comes to the counter and asks for a few packs of cigarettes.\n\nAsk her if she had any gas, she says no. Go to start scanning and she Laughs. \"Aren't you gonna ask for my ID?\" even though she's clearly in her 30s or 40s.\n\n\"Aaaaah sure. Can I see your ID please?\".\n\nShe takes out her bedazzled as fuck phone with a flip wallet on it and can't find her ID. Takes out her wallet. Can't find her ID.\n\n\"Sorry ma'am, I'm afraid Im not allowed to sell these to you.\"",
            "We have the same policy for serving alcohol and purchasing alcohol in Australia.\n\nOnce we ask for ID, no matter what the age and you don’t have it, we aren’t legally allowed to serve you anymore. That being said, if you’re like 40 years old I’ll probably just let you go and warn you about the joke of checking ID’s",
            "[deleted]",
            "This was me (minus the fit) on my 21st birthday.\n\nI've looked old for my age since I was approximately 16, so when I started drinking at restaurants when I was 19/20, I never got carded.  But for my 21st birthday, I was very excited to go back to the place where my friends and I used to hang out as teenagers and finally order a drink legally.  Only because 21-year-old me appeared to be approximately 30-something, I didn't get carded.\n\nSo my girlfriend spoke up, and said, \"No no, you have to card him!\"\n\nAnd my waiter shrugged and said, \"Okay.  Lemme see your ID.\"\n\nSo I handed him my driver's license.  And a moment later, he hands it back and says, \"I'm sorry, I can't serve you.\"\n\nAnd I'm like, \"No no, check the date!\" And I'm still expecting there to be a realization, so I've got this anxious shit-eating grin on my face like, \"Eh? EH!??\"\n\nOnly the waiter nonchalantly responds, \"No, I saw.  And happy birthday.  But I still can't serve you.\"\n\nAnd then he proceeded to explain.  You see, in Maryland, at least back when I first got my driver's license (they've changed since then), they took your picture in profile when you're under 21, and facing forward when you're 21 or older.  And that's something I knew, so I was planning on going to the MVA sometime soon to get my license replaced (I just didn't want to do it on my birthday because who wants to spend their birthday at the MVA?).  But what I didn't know is that regardless of your age, you can't be served without a forward-facing ID.  So because we had asked the waiter to check my ID, I now wasn't allowed to drink alcohol there.\n\nWe left, and found another place nearby, but because I now knew that I didn't have an appropriate ID to get served, I felt compelled to keep my birthday a secret.  In the greatest of ironies, I, a guy who had been drinking for at least a year without ever worrying about getting carded, spent the first night I was of legal age to drink keeping my birthday a secret and desperately hoping I didn't get carded.",
            "[deleted]",
            "The policy at my employer is to check anyone who appears under the age of 27. This is posted on signs around the store as well, but every now and then I'll have a some who looks 50-60 years old shove their ID at me or insist I must check it. There have been many times the ID has been expired or I will ask them for their ID when they won't let the issue drop and then they \"left it in the car\" or something.\n\nOf course these people usually yell at me and get really angry even though I wouldn't have checked them to begin with. Thankfully, not even the spineless management can cave to them on this issue and usually they end up having to kick them out.\n\nEdit: words",
            "Dude, always. always. A L W A Y S check ID. Cashiers, servers, and bartenders can get hefty fines and even jail time for not checking ID. I used to work at Walmart and there was a cashier who didn't card someone, person was underage and ended up driving drunk. Cashier got several thousands of dollars in fines and went to jail.",
            "Fellow Michigander, here! I've gotten denied **on my birthday** bc I forgot to reinstate my license. Super procratinator, so I just laughed it off.  FYI, if your license is expired, use your passport if you have one.  It is pretty ridiculous that you, basically, have to pay a fee to prove that you're over a certain age to buy alcohol. It's my universe-given right to pickle myself.",
            ">I'm ready for them to split entrees and tip me 15%.\n\nThe horror.",
            "Are complaining someone was going to tip you 15%? Wth.",
            "That’s amazing hahaa I love it when people are their own karma",
            "My boyfriend is 32 and wasn't carded yesterday. I thought it was odd. He just said \"I just look old.\" Lol We didn't complain about it. Why actually complain about it?",
            "I work in a gas station with Karen 1s ID being expired I'd have to deny everyone",
            "After I turned 21, for probably the whole year, wherever I ordered a drink with my parents, my mom would always say \"you'd better check his ID, I'm sure he wants you to, he just turned 21\". Frankly I didn't much give a shit either way, but whatever.",
            "I had a similar experience a few years back in Las Vegas. My wife and I were in a casino and sat down at a table to play Pai Gow. We were immediately asked by the pit boss to show our IDs. We were in our late 20s, but my wife looks about 10 years younger than she is (FWIW, I absolutely do not), so she’s used to getting carded everywhere she goes.\n\nAnyway, the lady sitting next to me, who was clearly at least 50, jokingly asked the pit boss “aren’t you going to card me, too?” The pit boss, seemingly wanting to humor her, said sure, and asked to see her ID. She laughed and said she didn’t have it with her, as she had left it in her hotel room. The pit boss informed her that she couldn’t gamble in the casino anymore until she produced a valid ID, prompting her to throw a tantrum, as her hotel was apparently on the other end of the strip. Her husband appeared mortified by her tirade, and was gently pointing out that had she not asked to be carded, they’d have no issues. Of course, this led her to turn her wrath towards him, and she was still shouting at him as they walked out of the casino.",
            "God.  Sounds likes it’s easier to get a gun than a drink in the us",
            "I think she was right though, you should always check IDs.",
            "Blah... I hate the \"Well, as a [insert respectable thing here], I believe [blah blah blah]\" people.  Its worth the extra headache to serve them some humble pie every now and again.",
            "Are servers really complaining about 15% now? Don't they make an average of $15-25 an hour on a 15% tip?",
            "Karen sucks. She's always been evil from what I've heard.",
            "Oh come on, unless she was bitchy and demanding unreasonably this isn't a good fit to be called Karen at all. It's annoying but mothers, particularly middle class who can see over the hill by that point in their life, do shit like this to live vicariously through their kid and be 21 again for a second. It's pathetic but harmless.",
            "Love it, when customer demands a by the book procedure you give the customer a by the book procedure.\nAfter all  customer is always right.",
            "As a bouncer who pulled alot of ass including some older women I had a line for this....i used to say \"this is a no win situation for me because if I ask I lose and if I don't I lose.\"  At this point the woman is already pulling out her ID.",
            "Well, did you receive any tip?",
            "How much tip?",
            "I've done the same before and it's satisfying as hellllll. I wanted to ask them \"so, what did we learn today about keeping our mouths shut?\"",
            "She doesn't sound like a Karen. She didn't ask for a manager and didn't escalate things. What she was asking wasn't at all unreasonable. It's a funny situation and all but she doesn't sound bad.",
            "Did you still get a fair tip",
            "Why do you need to check if someone is under 40, isn't age of 21 enough to be able to buy alcohol in usa?",
            "Damn. I also worked at a casual fine dining in a downtown area of MI...",
            "I feel this, i remember getting denied entry into a bar, also michigan, because i had a temp id for my 21st, the one where they cut a corner off and staple a piece of paper to it heh i drove there to meet friends, one was a girl i really liked and i had to watch them all enter and say 'bye' basically :<",
            "Hang on, if the kids are under age they're her responsibility, no? If she feeds them sangria that's on her. You only check fornID if they are trying to obtain alcohol themselves. If Momma Karen wants to inject heroin into their eyeballs, that's her choice.\n\nOr is this a case of 'Murica not letting you drink alcohol when you're legally an adult?",
            "Just wanted to ask: Is a 15% tip considered bad in the U.S.?",
            "Wait is 15% a low tip?",
            "This is why I love living in Arizona. My license (that I got in 2012) doesn't expire until 2056.",
            "Id expired ? Seems a little draconian -especially when she was obviously of age",
            "I just recently turned 21 & the first time I tried buying alcohol legally they didn’t even card me until about the 4th time I bought alcohol. Was kinda bummed lol",
            "Lol i had this happen once when i was a bartender. There was one woman who was clearly over 40 and another woman who was probably in her mid 20s or early 30's. Management wanted us to be really strict that day as someone had served a minor accidentally the day prior (mixed up an alcoholic pina colada and a non alcoholic pina coloada when delivering drinks), so they wanted us to get really strict to make sure that if an inspector came in we would be okay. I asked the ID for the younger woman and she was actually in her mid 30's but looked very well for her age. The older woman immdeiately pipes up \"why dont you check my ID? You dont think i look young?\" \n\nSo I played along and asked her for hers. It was expired by a month or two so I said \"well miss you do look great, but your ID looks a little too old. Its expired so I cant serve you\"\n\nI let her steam in it for a few minutes but i ended up giving her the glass of wine just because she seemed a little more dissapointed in herself than anything else and wasnt really confrontational. The woman was in her mid 60's and clearly looked over 40 to begin with so we were just going to pretend that I didnt ask. Im glad to be able to deter her from ever doing that to another bartender.",
            "INSTA KARMA",
            "Hey! I’m used to be a bartender and had a really similar thing happen to me. Legally, if I ask for an ID I need to see one. It doesn’t matter if you are 21, 40, or 60. If I ask, you have to show me a legal ID. People can talk about how much bullshit that is, but I’m not risking my job, my bars license, or a huge fine for anyone.",
            "I was a cashier at a liquor store in TN for a few months where I was legally required to check everyone's ID no matter what age they looked, and if they didn't have an ID I was not allowed to sell them anything. I was surprised at the number of old people that would show up and not have their ID with them at all.  They would always get so angry because other places were not as strict as us but I could usually get them to stop when I would hit them with \"Well how did you get here today? It's illegal to drive your car somewhere and not have your driver's license on you.\"",
            "Sounds like the typical customer at Martini's in Kalamazoo.",
            "When I used to wait tables I always checked especially if kids were with parents.  They used to send people (adults with older looking kids) in to do liquor license checks all the time and would fine the waiter and restaurant (that also was in Michigan)",
            "Should've kept her mouth shut.. but then again you could've been held responsible had something gone wrong and could've been fired. You never know what could happen.",
            "A Karen who DOESN'T want to speak the manager? Now, that's a rare breed! :D",
            "I am in Michigan too and bar tended for many years I pull sit like that all the time when people were dicks!!!",
            "Not selling alcohol to someone because they have an expired licence is the stupidest law I have ever heard of. What's the logic behind that?the person no longer exists?",
            "This sounds like an old story with some minor adjustments. I’ve heard the “Karen forgets ID, can’t be served” story before. This is oddly similar.",
            "> In the state of Michigan it is illegal to serve alcohol to anyone with an expired ID regardless of age.\n\nUm, Michigan, honey, we talked about this.  Remember that conversation we had about how people's dates of birth don't change just because their ID expired?  Now you change that stupid law, brush your teeth, and go right to bed... you have school tomorrow.",
            "When I worked security for nightclubs, bars, and city event beer gardens, as a practice, I would ALWAYS card women, no matter how old they looked. Its a small cultural nicety, that older ladies appreciate. \n\nCompared to old timer dudes who tend to have the attitude of \"are you fucking kidding me?\"",
            "Why is this a thing. It's not like the ID expiring changes their age?",
            "What's wrong with a 15 percent tip?",
            "i don't get it.  as an example, if a family comes in with 2 small children and the dad orders a pitcher of beer are you supposed to card the children and then refuse service because they don't have ID?  here, if they had each ordered individual drinks as opposed to a pitcher of sangria, i could understand carding each person but as they ordered a pitcher, i'd assume only the ones of age would be partaking.",
            "You should not have to be told to follow the law while doing your job though...",
            "You say a 15% tip like it’s a bad thing? And honestly came off like an entitled Karen yourself, but nonetheless.",
            "You sound pretty entitled regarding the tipping. You’re complaining about the size of the tip you are expecting to get before you have even started to serve them. Pretty bad attitude.",
            "I don't get it really.  I'd ID the kids too.  Not worth risking my job over not feeling like checking.",
            "You call her a Karen based on what...??? How was she a Karen? This is just a shitty move for no reason. Had she been bitching, shouting abuse or being a bad customer, fair enough, but she didn't. \n\nKaren is a title someone earns, you don't just label someone it unless they warrant it, dude you suck.",
            "Guarantee that her ‘business’ is an MLM",
            "Sounds like Ann Arbor tbh",
            "Unrelated to story.  What's the problem with splitting entrees?\n\nI had stomach surgery so don't eat very much, and my daughter eats like a bird, so we always split.  It's way too much food otherwise.",
            "Can confirm this, it happened to a co worker until he showed his passport instead. Also hello from your friendly southern Ontarian OP.",
            "I don't get the laws/policies that state \"If you look under age X you have to check\". I mean looking under a certain age is surely an subjective thing but if you are allowed to drink from 21 and older why not check people that look under 21? I don't get it.",
            "Sorry for dumb question: Couldn't the Karen who had a valid id ordered 2nd drink and given it to Karen with expired id. Is it illegal or what?",
            "Perfect.",
            "Yup work as a cashier, I find most ppl who are young to hand me their ids and before I ask I just ask my folks hey is he a regular or check it. \n\nMost that come are so regular that we just call them by what the buy the most. Or we just say how many and they give exact change and leave.",
            "Did you get a tip?",
            "how was the tip tho?",
            "...no tip then?",
            "So what did they tip?",
            "Yikes. People need to learn how  to take the W....",
            "If you’re in a state like Texas then parents can by drinks for their kids (not so sure about friends of their kids though) if they’re under age. I’m of age but have a major baby face so when I don’t get ID’d while out with my mom I just think it’s because of that.",
            "Get rekt",
            "When I worked in the service industry, I experienced several instances like this. People never understand why I can’t serve them if they don’t have their ID or if their ID is expired. I’ve even had mothers demand that I let their underage child drink, even though that’s super illegal in my state.",
            " \"In the state of Michigan it is illegal to serve alcohol to anyone with an expired ID regardless of age\"\n\nThis is quite obviously not true. It may be the policy of certain establishments but it is certainly not the law.",
            "I live in Michigan and my God is that law a pain in the ass. I put off getting my ID renewed for a really long time, I used to have to go to two or three liquor stores a day to find one that would sell to me.",
            "That is a really, really stupid law.",
            "So did they stiff you with the tip at the end? Or did they tip normal amount?",
            "A true Karen would never turn down an opportunity to talk to a manager.  This must be the fabled half-Karen.",
            "This is a repost right???????????",
            "Play stupid games, win stupid prizes.",
            "How awful was your tip?",
            "I do not understand people like this, sane people don't like the hassle of admin shit. Don't bring it on yourself...",
            "HA HA sweet justice",
            "Worked at a restaurant on 23, so many freaking Karen’s and soccer moms with that “let me see your manager” haircut, I swear it’s all from Macomb",
            "I like the way that turned out for you, and I hope you didn't suffer on the tip.\n\nBut really, how stupid is this whole scenario, anyway?  Even if the kids were obviously teenagers, and would never be served alcohol by a responsible server, there's no way to police *what happens at the table* after alcohol is served.",
            "Why the fuck is it illegal to serve someone with an expired drivers License? Their age didn’t expire, their birthday is still on the same day. That and laws like that are just dumb.",
            "[deleted]",
            "She had the chance to get alcohol and she stopped herself",
            "Heck she’s lucky because in Ohio you wouldn’t have been allowed to serve any of them alcohol if one of them was underage or had a bad/expired ID",
            "You played yourself.",
            "Wait splitting entrees is bad? Jfc more things to feel guiltyvabout",
            "For my birthday this year (in my 30s) my husband took me out for Mexican and I ordered a margarita. But I was denied because I didn’t have my ID on me (left wallet at home because he was paying and the margarita was a last minute decision). Didn’t get all uppity. Just moved on with my night. Stupid Karens.",
            "Oh and I was hoping for the malicious compliance to be that you wouldn’t check her ID and tell her „Well, you clearly look over 40. No need to have your ID checked, Mam“",
            ">My generation doesn't respect elders \n\n\"Ma'am, just because you're old doesn't mean you are worthy of respect.  But any time you want to start acting respectable, I'll treat you with respect.\"",
            ">I'm ready for them to split entrees and tip me 15%.\n\nIt's funny how somebody who serves clients and relies on their mercy to make his living looks down on them instead of being grateful that they agree to pay a singnificant part of his salary instead of the owner. If somebody paid me 15%, even 10% of thier check for simply bringing and taking a couple of objects, I would be just grateful. I have a salary apart from tips, don't I? And if I don't (US, I suppose), I voluntarily rely on clients' mercy and should treat them like demigods, not look down on them. That's how it should work, I guess.",
            "Is “Karen” getting old for anyone else?"
        ]
    },
    {
        "post_id": "76gink",
        "author": "GrenadierOzlaoj",
        "title": "When your company asks you to email them every time you want USB access in company laptops..",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/76gink/when_your_company_asks_you_to_email_them_every/",
        "score": 15061,
        "num_comments": 382,
        "created_utc": 1508035428.0,
        "selftext": "So I was once sent out as an onsite software programmer to join a crew working at a ride construction site. They gave me a laptop with some limited space and an old 1TB external drive with extra data on it, the kind which needed an external power supply to run (factors in later).\n\n\nNow there are two things which are worth noting about the company\n\n* Exteremly tech unfriendly (not many tech people in the company)\n* Very bureaucratic, even in the face of emergency\n\n\nSo as a programmer, I was subject to the same laptop restrictions as say, a sales rep or a business op. Which is really unfair when you have to work closely with an onsite team. And they had blocked transfer on all plain text files. Which is what all source code files happen to be.\n\n\nI was told I would have to email the admin staff EVERY TIME I wanted to plug in the usb drive, the admin would validate with my department, and they would generate for me a one time password for that usb 'session' which was unique to that device. That really annoyed the hell out of me because I knew I would have a lot of copying/backing up to do every now and then. So I came up with a plan.\n\n\nI'd use the password to grant usb access to the drive, copy a few files, then I'd cut power to it and reconnect it. New session, new password needed, new email sent. I told them that it being a construction site, power was very unstable, and the drive they gave me kept disconnecting because it needed external power. I did this every 10-15 minutes, maybe about 50-60 times a day, for 3 days. At the end of the third day, the admin head called me himself to grant me admin rights to the laptop so that I could disable the monitoring software for the rest of the trip.\n\n\nWhen I went back, they held a meeting to review onsite policies for technical and support visits.\n\nEDIT: I really didnt make this clear I think. Usually admin blocked USB access outright. In my case, after requesting, they allowed USB access, but they applied the policy usually reserved for sales reps (which blocks documents, videos, etc from being transferred to/from anywhere, which included plain text). It was an urgent short term trip to complete this project which was gonna run on an isolated system, so setting up an elaborate delivery was pretty much overkill. And the internet access onsite was pretty terrible anyway.\n\nI don't actually have a problem with putting in security measures to disallow unknown usb devices from being plugged in. I think thats required. But a device they already verified and vetted? Thats a bit much\n\n\nEDIT 2: This is actually from some time ago, things have been better since then and a couple other incidents. We get encrypted drives with passwords atleast. And no dinosaur external drives",
        "permalink": "/r/MaliciousCompliance/comments/76gink/when_your_company_asks_you_to_email_them_every/",
        "comments": [
            "I'm so proud of your dedication and follow through. ",
            "/r/talesfromtechsupport would probably love this. I sure did. ",
            "Oh god the security policies at your work is so horrible.\n\nSometimes it needs that kind of determination to show how inconvenient stupids policies needs to be revoked",
            "[deleted]",
            "[deleted]",
            "At my organization, USB access is denied for everyone.  No exceptions.  NONE.  Not even people with elevated privileges.  Not even the CEO.",
            "Whilst in your case it sucks, more and more companies are stopping employees from plugging random USB devices into their machines. \n\nAs someone who performs social engineering tests on companies, the classic \"drops an infected USB drive near the businesses entrance\" is enough for an employee to plug the drive into their machine and infect themselves and perhaps their entire company. \n\nWhat your company needs is a better file transfer system for their programmers.",
            "[deleted]",
            "My company is pretty tech friendly, and they still require users to submit an exemption form to enable USB ports on company laptops and desktops. And the maximum amount of time you're allowed is 60 days, and all requests need to be approved by someone who is at least an SVP.",
            ">And they had blocked transfer on all plain text files.\n\nWhich is the only file type that can't infect your computer. ",
            "This seems familiar. Does this company start with \"S\"? ",
            "Couldn't you have automated the email upon usb connect somehow",
            "This is funny because I was just reading a report for school about how useless many Internal Controls are because they can just be eliminated once they become inconvenient/a hassle. ",
            "Unpopular as this comment may become.... \n\nOf course, tedious though it may be, the original policy was workable despite its clunkiness. The way forward may have been to email Head of IT to say that that the process adds x% cost to the job and will probably make the project over-run; could you have an exception to avoid this? Support might then have remoted in to the laptop to suspend the USB policy, thus avoiding local use of admin rights and the associated risks of so doing.",
            "I hope you at least made yourself a little macro to send the email.",
            "ITT people who don't understand basic computer and network security.",
            "Why were you backing up source code using a flash drive or external hdd?? why not use version control?  GitHub or bitbucket would be a lot more secure than a flash drive",
            "[deleted]",
            "I'd have written a script that fires when USB drive entered to email admin. \n\nMake the email superb obvious that's it's automated just to work the point. ",
            "[deleted]",
            "Ah, you used the \"be so difficult the IT guy grants you local admin rights to get you off his back\" technique. \n\nI have found this very effective at every place I've worked. \n\nKind of makes me think about how they say most security breaches are linked back to human error, not software/hardware error. ",
            "As an IT admin I want to mention that the rules are there for a reason yo,  also also pretty sure you shorten the life of the drive-by a few years doing that.",
            "All I can say is bravo! ",
            "you might have consequences for this later. For instance it will only take someone asking around if the power goes out a lot here to figure out what you did and while I don't think it will make them revoke any changes they made to their policies I do think it will keep them from hiring you in the future. ",
            "The IT department at my workplace is similarly bureaucratic with limited staffing.  You have to get an admin to enter a password everytime you install a new program.  For awhile, when UPS' Worldship software wanted to do an update, you'd have to get an admin to put in his/her password.  Anybody who uses Worldship on a regular basis knows it does updates quite frequently (like 2-3 times per week).  I guess IT finally got tired of constantly having to put in admin passwords for updates, so they changed something to relax that requirement, but you still need a password to install a program, which is annoying at times.",
            "\n* Exteremly tech unfriendly (not many tech people in the company)\n* Very bureaucratic, even in the face of emergency\n\nThis is also the reason that so many Washington officials use their private email servers instead of the official email servers.. Hillary Clinton for one (who is tech illiterate herself) wanted to use a certain model of phone...so she had her staff set up a way for her to use her phone: which is why she lost the election...\n\n",
            "I am one of the corner cases at my office.\n\nWhen I started, due to a previous person, the rule was simple.  You can run Linux on your work machine if you can support it.\n\nSure, most people had local admin on their Windows systems, so this wasn't much of a security change either.\n\nThese days, the rule is that you can run the version of Ubuntu that ShadowPouncer tells you that you can run if either you can support it yourself or if ShadowPouncer somehow has time to support you.\n\nNo, no, I'm not a sysadmin at the company any more, I'm a software engineer.\n\nNo, really.\n\nWell, alright, I might still be on the systems escalation list.\n\nAnd don't ask about later this year.",
            "ROLE-BASED security. Jesus Jones",
            "As an IT guy who has to save stupid people from being stupid (and yes, a lot of the time it's from developers who have a god complex), this post infuriates me.  I disagree with the policy as it is written here, but I come from the other side where we want to help - but get treated like enemies because compromising on SOME security is too inconvenient for the precious users.  \n\nI'm glad things are better where you're at now, but holy cow you made my blood pressure rise... \n\nArgh. ",
            "OP, not sure why you would expect to live in a different environment than anybody else. Systems Admins and all other IT employees in functional companies are required to do the exact same. Nobody gets special treatment, you live in the environment you create. ",
            "Every bureaucracy has rules that you can use against it if you know how. You have to be clever and you have to be persistent but the underlings with whom you're generally dealing MUST follow the rules or lose their jobs. Once you crack the code, you can get them to eat themselves. It's glorious. Well done, OP. ",
            "What sector was this company? Financial?",
            "You... are everything I aspire to be.",
            "Funny if the renewed policy would mean only usb-powered external drives from now on. Now that would actually be malicious compliance.",
            "No TL;dr story checks out ",
            "This. Is. Fucking. Awesome.\n\nGood job!",
            "At that point you may as well get a generator to run the hard drive lol ",
            "And now I have some ideas for my own situation",
            "> And they had blocked transfer on all plain text files. Which is what all source code files happen to be.\n\nNot programming in [Piet](http://www.dangermouse.net/esoteric/piet.html), f*cking casual.",
            "IT Security is an evergoing dance to find the middle ground between security and accessibility. Some people just can't dance.\n\nIn this case it's *security trough bureaurcatie* wich is never far from *security trough stupidity*",
            "[deleted]",
            "Is there a sub for annoying IT policies like this?",
            "I'm giving you a standing ovation right now. Good fucking job. Holy shit. You're a hero. Pity it only lasted three days.\n\nBe the change you want to see in the world lol.",
            "This is how you do it, you hit them with their own stupid policies until they cave. They always cave, because stupid policies cost a lot of money long term, and if there's one a thing a company loves, it's money.",
            "This is how it's done.\n\nYou bombard them with an obscene amount of e-mails so the person on the other end can't do anything but to monitor the account. Once they realize that dedicating one person to do that is a waste of money and resources, they backtrack on their policy. ",
            "That's not malicious compliance, that's deliberately wasting the company's resources and sabotaging work.",
            "Downvote for starting with 'so'.",
            "U my friend bow to no one",
            "I understand the need for securing flash drives, but just use an encrypted flash drive ffs",
            "Sounds like you have no idea about IT Sec and think you are above such petty concerns. People like you are the reason our personal data is plastered all over the internet. Your attitude directly contributes to stolen identities.",
            "How'd you cut power to a laptop? Did you remove the battery?",
            "[removed]",
            "It's not malicious compliance when you are forced to comply. "
        ]
    },
    {
        "post_id": "vhrwm3",
        "author": "brother_p",
        "title": "I have to pay for that $0.10 personal call charge? Done.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vhrwm3/i_have_to_pay_for_that_010_personal_call_charge/",
        "score": 15060,
        "num_comments": 374,
        "created_utc": 1655857733.0,
        "selftext": "**Edit: [So this story made *Newsweek* magazine](https://www.newsweek.com/man-trolls-company-insisting-pay-10-cent-phone-charge-delighting-internet-1718214). I am now like the girl you don't take home to mother in \"Superfreak\".**\n--\nBack in the days before unlimited mobile phone calling plans and long distance, I had a company-paid flip phone. There were all kinds of fussy rules attached to using it - no texting (even though texting was free), no long-distance calls (with one exception as I'll explain below), no special ring tones, and no using the camera. Like I said, fussy rules.\n\nThe one exception to the \"no long-distance calls\" rule was for travel. In my job, I rarely would have to travel to a different calling area (i.e. \"roaming\") but if I did I was permitted one long-distance call per day to call home. That's it.\n\nSo. The day came when I had to travel and stay overnight in a hotel for work. When I arrived at the hotel, I called my wife to let her know I arrived and spent a couple of minutes talking to my kids. Got some supper, did some work in front of the tv in the hotel room, and went to bed.\n\nThe next day while at the conference I was attending, I got a call from my home office. As I was in a large hotel, the call dropped so I had to call back. Didn't think anything of it, went back to my session and enjoyed the speaker. Later, after I got back to the hotel, I called home to say goodnight to the kids. I got the answering machine and left a message. Didn't think anything of that either. The next day I returned and went on with my life.\n\nAt the end of the month I got a call from Finance. \n\n\"Brother_p, it's <<finance supervisor>>. I'm just reviewing your latest cell phone bill and it shows an unauthorized long-distance call.\"\n\n\"Really? What was the date?\"\n\n\"April 3rd. You made a call to <<my office number>> at 9:20 am then another one to <<my home number>> at 6:15 pm.\"\n\n\"Oh, yeah, that's when I was at a conference. The first call was to me from the office but I got cut off and had to call back. I called home from the hotel later.\"\n\n\"So, how would you like to reimburse us for the call?\"\n\n\"I beg your pardon?\"\n\n\"The second call. You have to reimburse for the unauthorized long-distance call. You have an expense claim from the conference in so I can deduct it from that, or you can pay directly.\"\n\n\"How much are we talking about?\"\n\n\"Ten cents.\"\n\n\"Ten cents?\"\n\n\"Ten cents. Would you like that deducted from your expense claim?\"\n\nI thought I was being punked. Seriously. I sat in stunned silence for a few moments.\n\n\"No. You know what? I'll pay you directly,\" I said and wished the supervisor a pleasant day.\n\nI opened my drawer where I had some spare change, took two nickels, taped them to a sheet of 8.5 x 11\" paper, and wrote \"for cell phone charge\" and my name. I then took a company envelope, addressed it to the Finance office (in a different building walking distance away), folded the sheet of paper, and put it in the envelope. I put the envelope in the outgoing mail tray, the postage for which would be paid by the company.\n\nA few days later I got a call from the Comptroller herself. Three pay grades above me and usually wouldn't interact with someone on my level. Apparently the supervisor complained about me.\n\n\"What's with the nickels?\" \n\nI explained the situation, told her the supervisor had insisted that I pay the $0.10 charge and I complied. She laughed out loud. The paper, envelope and postage had cost the company more than what they recovered.\n\nThe following month the Finance department updated the cell phone policy. From then on, only long-distance charges in excess of $10 had to be reimbursed.",
        "permalink": "/r/MaliciousCompliance/comments/vhrwm3/i_have_to_pay_for_that_010_personal_call_charge/",
        "comments": [
            "You just gave everyone in that company greater flexibility with phone calls.",
            "Corporate logic is awesome. I got several notices of a $0.01 past-due charge(no idea how), but the website wouldn’t accept payments under $1, and I’ll be damned if I’m spending my own stamp money for a penny, even if they had spent a couple dollars in stationery and postage to get it. Eventually my wife called and got them to just cancel the bill.",
            "Not just office supplies and postage, but imagine how much labor is lost over this issue.\nLow ball estimate of these three employees' hourly wages at the time, being at least $20/hr each, discussing this topic for a minute each, comes out to at least $1.00 productivity wasted.\nThe phrase, \"stepping over dollars to pick up dimes,\" has never been more fitting.",
            "It was cash I hope you sent it registered mail return receipt requested",
            "Reminds me of my company, we had basically a per diem of sorts and we would often eat free breakfast and skimp on some meals, to then justify having fancier meals later. \n\nThey got mad at that, so now everyone spends as much as they can. Costs them significantly more per person, but at least they don't have that fancy meal to reimburse.",
            "I got married and my new bride moved into my house.  New town away from her family, no friends, no job etc so I knew it was going to be difficult for her.  And I was selling my house to move us into a bigger better home.  No stress, right?\n\nThen work asked me to go out to another country to fix a problem.  I was very reluctant, but after discussing it with my wife I agreed but warned them I would be phoning home regularly.  \"Not an issue\" they said.\n\nI fixed the problem, customer was happy, boss was happy.  Then I presented the phone bill.  It was several hundred pounds.  The boss freaked out and insisted I had to pay.   I pointed out that I had warned him and that it was small compared to the overall cost of the flight, hotels etc but he was insistent.  Yep I was fuming.\n\nIt did not take long to get my revenge as the customer had another problem and asked for me by name to go and fix it.  Of course I refused.  The boss pleaded and even offered a bonus.  I refused.  He finally asked what I wanted.  I said that the first thing would be a cheque for the cost of the phone calls.\n\nI got a bonus, a pay rise and, yep, a cheque for the phone calls.",
            "Should have wrote a check... for 11¢.",
            "I had something almost similar. I sent some urgent SMS messages to my family on the company phone, so charges came to 50 cents. Got a call at billing time that I need to pay it back immediately. I tried to explain that its not worth the effort and the last financial controller would just write off small expenses. He wasn't having it, and I have to come now. My office was on the opposite side of the city from his, and my fuel was paid with a company fuel card. So, I got in the car, drove to the office to put the coins on his desk and loudly informed him that this has now cost the company 20 dollars.",
            "The closest I ever got to being fired was when they discovered I had been covering small phone/copier charges for other employees out of my own pocket instead of billing ten people for pocket change each month.",
            "Well done!",
            "OMG, something similar happened to me about 30 years ago! I made a mistake on a travel voucher and got a letter that I owed 4 cents!! Already the company was in the red because postage to mail the letter to me, the envelope and paper cost more than 4 cents. I showed the letter to my boss and asked what to do - didn't want to write a check for 4 cents! He said to tape 4 pennies on a piece of cardboard and mail it back (using a company provided franked envelope). So I did, and never heard anything directly. But my boss complained and they instituted a rule that all errors under a certain dollar amount (think it was also $10) were written off and not collected. LOL, I've never forgotten taping 4 pennies to a piece of cardboard while my boss watched!",
            "[deleted]",
            "Before mobiles were in everyone's pockets I was working as a direct labour contractor for British gas in the UK.\n\nI got myself a mobile phone to keep in contact with the wife and kids, the gas lads all had vehicles with radios in them to stay in contact with the office.\n\nThe manager sees me with a mobile phone and says great we can get hold of you now when we need you.\n\nNope that's not happening, this is my personal phone and that's what it's going to stay.\n\nHe looks at me with big eyes and says \"What\"\n\nI responded with, I am paying the contract so I get to decide who gets the number and unfortunately British gas aren't on that list.\n\nTo say he wasn't happy would be an understatement 😂",
            "I would have found ten pennies, but great job nonetheless!",
            "I had something similar happen at my old workplace. My cell phone reception at the office used to be spotty and I was expecting an important call. My cell indicated a voicemail so I was forced to use my office phone to check my cell’s voicemail. Due to the vagaries of our local phone system, my cell number counts as long distance despite it being the same area code.   \n   \nMonths later I get a call from some office accountant who wants to know what project code to charge my 3 cent phone call to. I discuss the issue with my boss and we conclude that since it was a personal call, I should just pay it myself. Thus, I rummaged around in my drawer and found three pennies to bring to the accountant.  \n  \nBetween the accountant’s time, my time, my boss’s time, and whoever did the bank run to deposit cash, I’d say this issue wasted $50-100 over the matter of 3 cents.",
            "[deleted]",
            "This is nuts. I literally took over my company’s phones because they were trying to split 300gb between 50 people. The kicker? It costs FAR less to just put everyone on unlimited plans. The accounting dept was so concerned with “saving money” they didn’t consider it would cost less to just make life more comfortable.",
            "Penny wise pound foolish policy!",
            "I was having a really long day at work. Everyone was in a foul mood and I was being treated like garbage for literally everything that I had zero control over. I took a coupon for a competing gas station because I straight up wasn't paying attention and did not care. When the boss came to me a couple days later, she demanded I pay back the 75 cents. So, I took 3 shiny quarters from my pocket, put them in my register, and exchanged them for 75 cents worth of sticky cup holder coins that a desperate customer scrounged together to get a pack of smokes. I taped the gross, sticky, blackened, hair and dirt covered coins to the coupon and handed it to her. She knew. She knew I knew she knew. She tight-lipped snatched it from me and dramatically swiveled in her chair to \"get back to her work.\"\n\nIt sat in the junk drawer in the desk in the back room for literal years, disgusting money still taped to it.",
            "you brilliant bastard! :D",
            "Similar story...\n\nMy boss worked in the HQ building and they had a 'store' where they could get office supplies and the like on site.  I worked in a remote office and we did not have that, usually we'd just buy something retail and get reimbursed.\n\nAfter getting reamed out for buying a new laptop bag (old one didn't fit the new laptop) I was told only to get supplies through the authoritized process.\n\nSo that's why our admin assistant had to courier to me one pack of 0.5mm pencil leads from Vancouver.",
            "Some bean counters just can't be reasoned with. \n\nYears ago, the company truck I was driving was on it's way out.  I'd been telling them for nearly a year, but they dragged their feet until one busy morning the transmission went out.   The truck was way beyond being worth the cost to repair.\n\nThey lost out on the revenue I generate for a couple of days and I got paid to sit on my butt while they played catch up. \n   \n\nThe powers that be had to scramble to find something at the last moment.  I ended up with a similar truck but with the largest engine you could get that year.   Normally they never got us trucks like that because they burn a lot more fuel.  That thing was actually kinda fun. I never had trouble merging with that thing. \n\nThe thing got horrible mileage.  After a bit of digging, I saw that the manufacturer recommended running 93 octane in it. \n\nI ran a few tanks of 87, 91, and 93 octane in it.  \n\nRunning 87 octane, it got horrible mileage.  (high compression engines like higher octane but you can detune one to run well on it. Efficiency suffers though. ) \n\nWith 93 octane it got significantly better mileage.  It was to the point that not running the right fuel was just stupid.  \n\nA few weeks into this, I got an angry phone call from some corporate bean counter pitching a fit because I wasn't buying the cheaper fuel.   I explained it to him and he wasn't having it.    \n\nI pointed out that he had all the data in front of him, and suggested he check the numbers himself.  \n\nNOPE!  \n\nI was told to run the cheapest dog urine grade gas and nothing else. \n\nOk, Mr Beancounter.\n\n \n\nSo for nearly 300k miles I ran that truck on the wrong fuel burning gas at 10 mpg.\n  \nWhen I turned it in, I crunched the numbers.  They could have bought an identical new truck with the money they wasted having me run the wrong fuel.  \n\nIf they'd listened actually listened to me when I told them my previous truck was dying they would been able to trade it in, and not have had to take what was available on short notice. \n\nThe truck would have been cheaper, it would have had the more efficient engine, and it would have gotten decent mileage on cheap gas.\n\n\nGood thing we had that guy there to protect the company from me being efficient.",
            "I would have made my personal call in the morning prior to work. Big shame you couldn’t call the office back after work started.",
            "[fuck u spez] -- mass edited with redact.dev",
            "I had something similar with my taxes, I had to pay 2€, but I could split the payment over two years, so I went forth and back with them and received about 5 letters costing them more than the 2€ I had to pay.",
            "Bravo.\n\nAlthough, if it was me, it would've been sent FedEx, priority overnight, early morning delivery. Billed to company, of course.",
            "I don't get how phoning your office, counts as an unathorised call.",
            "I had a customer short me about 32 cents or so and I called her out on it as a joke. She sent me a cardboard sheet with 32 pennies on it, LOL! I framed it!",
            "I had a similar but not quite so petty ($15) discussion with Finance at a previous company.  Apparently you used to work there because it was in the company policy that they only accepted method of reimbursement was payroll deduction.  Thanks alot.",
            "We have a 4g Hotspot at our office that we sometimes use if we need to bypass the corporate firewall for whatever reason (like at some point we couldn't do first logon so had to use the hotspot.) The hotspot is a Netgear Nighthawk M1 and we can push over 200mbit over that.\n\nI always wondered what the data limit was on that thing as some months we would hammer it. Well 4 years later I finally got hit with a \"Excess Data Warning\" email. It has 1gb/month allocated to it, that month we had used 13gb a fairly light month. \n\nHonestly I couldn't give a flying fuck, the company has a corporate deal with the mobile provider where is shows you your \"allocated\" data, but it's actually pooled with every company mobile. There would be over a TB of mobile data at our fingertips. \n\nWe want to replace is with a residential 100/20 fibre internet connection but who would pay for that? nah, instead lets run 2x 4g hotspots for the handful of things that don't work on the corp lan.",
            "not a big fan of penny pinchers, especially those in the accounting industry.\n\nhell I understand the need to be accurate but seriously,i have seen companies write off a few billions in their books and not bat an eyelid(or Statement of comprehensive income for those in the know),they can afford to write off a few dollars or cents. Trust me, when I say Auditors aren't fazed if finance wrote off 10cents in the employee's expenses account.",
            "> There were all kinds of fussy rules attached to using it - no texting (even though texting was free)\n\nFYI, the reason for that particular fussy rule was that companies have legal retention rules for textual communication. If you call someone, it's okay for the contents of the call to be ephemeral, but if you send them a text or an email, the company must hold on to the message for some time, and potentially provide it in discovery if they get sued. If no policy that enforced this existed, it might have been illegal for them to allow you to text people on their behalf.\n\nThese days, retention is provided by the carriers as a service for corporate customers.",
            "Comptroller knows what's up.\n\nThe worst thing is the person who griped about the $0.10 probably wouldn't have cared, but got chewed out for NOT caring some time in the past.",
            "Used to work for a small oilfield equipment company. It occasionally required international travel. On one of the first trips I made for them I had a friend drop me at the airport instead leaving my car in airport parking for 2 weeks. They refused to reimburse me for the call to arrange for my friend to pick me up. It was less than $3. Every subsequent trip I took for them my car was valet parked in premium covered airport parking at over $20 a day. They never even thought to question the expense.",
            "I was waiting for you to say you no longer call back when you have dropped calls.",
            "I once went to collections over 5 cents. The collector called and I was like \"pretty sure I paid it off already. How much does it say I owe?\" He checked and told me it was 5 cents. You could tell from his tone that he was in disbelief. The cost of the call and his time was worth way more than 5 cents lol",
            "I once had a balance of like $0.37 at a doctors office, they actually mailed me a bill for it.  As I’m sitting there trying to figure out why they would spend a dollar to get some change I decided to see how much they were actually willing to spend.  I got five or six letters before they finally stopped.",
            "That is what I would and have done in the past.  This is just wonderful.",
            "Wish I could find something pissy like that to do at my job. We have unlimited data on our plan. But HR gets an email every time I go over Xgb of data. I stream a lot on my time off and I’m frequently on the road for work, so I use a lot of data, apparently more than the average employee as HR never gets an email about their usage. \n\nWell HR got tired of the emails from Verizon about my phone using “too much” of the *unlimited* data. So they cut off my cell data and now all I’ve got is WiFi. Bleh.",
            "I would have told them to eat dirt.",
            "I would have told them that I only made one personal long-distance call that day, so I don't owe the company anything.  If you have a problem with me making a long-distance work related call, send a new policy to my management so they can pass it to me, you know, officially and documented.\n\nThen if they do that, don't make any return calls to the office.",
            "I was at a company in the '90s that refused to pay most people a living wage, so they would make some personal phone calls from work. Accounting figured this out, so the geniuses at the top decided that the peons must pay. Every month, every person in the company was sent a detailed list of every call made from their phone. Every person was then supposed to go through that list, highlight personal calls, and reimburse the company if the total was more than $5.\n\nI did a lot of tech support, so I made a LOT of phone calls. Every month, my phone list was at least 30 pages. I would then spend the better part of the morning, maybe 3 hours or so, going through every phone call. My total of personal calls might have come to $1 in a high month.\n\nIt got to where the company would pretty much stop dead for half a day when the phone lists came out. At long last, I ran into one of the geniuses in the elevator, and asked whether anyone had bothered to calculate how much it was costing the company to have us reviewing the phone logs every month. Genius, of course, says, what do you mean? Let's say the average pay rate is $15/hour. You're paying around $45 to probably retrieve less than $10. Does that sound cost-effective to you?\n\nThat was the last time the phone lists came out.",
            "I hate Reddit. This shows that I'm getting old. I remember (and still have) a phone that didn't even have a camera. It could text, but that's it. It could also end the world, but hey, a good Nokia can last forever. I remember \"free nights and weekends\" or free inbound calls, and free calls under 1 minute (\"hey, call me right back.\" or \"call me after 7\"). Texting? pay per text. Roaming? Get charged because you used your phone too close to the Canadian border.",
            "My university once sent me a bill for 6 cents.\n\nI made 6 credit card payments of 1 cent. Enjoy your transaction fees.",
            "Well done. Probably made the work environment better for a lot of people; and showed that a process was stupid and needed to be changed. A Win :)",
            "This reminds me of when the church I was registered with but rarely attended needed a new roof. Someone, in all their infinite wisdom ( may or may not be my sister, as she defended this mailing vehemently) thought it was a good idea to send a letter via USPS to each registered parishioner, asking for a donation.\n\nThey used high quality stationery. Enclosed a self addressed stamped envelope, plus mailed both the letter and the SASE. Cost for each of these was almost $5, due to their choice of stationery. Plus labor to stuff the envelopes. There were over 6000 parishioners. They needed to raise $30,000, as the archdiocese paid for half of the cost of the roof. \nThey literally spent the amount they needed, to ask for the amount they needed.",
            "Some companies have completely stupid phone polices. A previous employer didn't provide company phones for on call but they would reimburse employees up to $50/mo to use their personal phones for business calls. Instead of just giving everyone $50/mo, they required people to send in their full cell phone bills with work and personal calls marked so the company could determine if they deserved the full $50. It took 1 person a full week every month to reconcile cell phone bills.\n\nEventually the IT manager raised enough of a stink that the CEO and CFO approved company-issued cell phones for everyone who had to be on call.",
            "This reminds me of another story on here.  Where a guy had to pay back $0.05.  So he told them they need to divide it out of the next 5 checks.  \nThey did it.  It costed them way more in labor and such to get all that done.",
            "You know...it could be this finance supervisor was doing his own MC.  Someone told them they had to account for every dime so that MFer was accounting for every dime.",
            "Stay tuned for next week when someone maliciously complies with the long distance phone policy by placing a dozen calls all under $9.99",
            "The length of you and the original caller uttering the words, “Ten cents” Back and forth cost the company ten cents. \n\nI hate bean counters who are like this. HATE them.",
            "Literally nickel and diming you",
            "Back when payphones in my area charged 10 cents for a local phone call (speak up, sonny, my hearing aid is on the fritz!), a phone ate my dime but wouldn't let me make a call. I contacted the phone company - I think I called the operator? Detailed the time and place and the payphone's number.\n\nA few days later, I opened my mail and there was a check for 10 cents. Cracked me up!\n\nI wish I'd held onto it. Evidence of a very different era.",
            "Reminds me of a debt collector sending me a bill for 20 cents. It cost them more to send me the bill than had they just written it off.\n\nIdiots.",
            "You should have sent a cheque to make it even more of a pain.",
            "I bet the finance person was doing a malicious compliance themselves. \n\nHey, you keep skipping these charges, I know they are small, but they add up. Please collect all charges. \n\nOk.",
            "Legend",
            "I can’t fucking stand businesses that operate like this.",
            "The first rules are already as absurd as they can be. \"No texts even if they are free but we don't want you to have ANY FUN with our things, even if it wouldn't change ANYTHING. My life sucks so I have to ruin it for everyone, I hate my employees\".",
            "You need to petition to have the new rule named after you. Also print and frame the memo announcing it.",
            "I just would've never called into work. Call home first to check in, then that's it. No calling work because it was literally on your dime.",
            "My dad once had to pay a similar bill to his work. He asked if he could pay in instalments and asked them to send an invoice for each instalment, costing the company about 20 times more in postage bills and transaction fees than his bill was.",
            ">The following month the Finance department updated the cell phone policy. From then on, only long-distance charges in excess of $10 had to be reimbursed.\n\nYou are a fucking legend.",
            "That’s awesome lol",
            "Not all heroes wear capes",
            "Oh corporate policies. 🤦‍♀️",
            "the hero we need",
            "Although different, I'm reminded of the BofA class action suit where they were processing any withdrawals or charges per day by most expensive to least expensive, instead of chronologically, which ended up causing some major overdraft problems. If you have $100 in your account and make a $20 withdrawal, a purchase for $20, $10 and one for $15, and a charge comes in later for $80, you would expect there to only be 1 overdraft, for the 80. But when processed as biggest to smallest, you got 100, then 20, then 0, then overdraft for 20, overdraft for 15, overdraft for 10. And at $35 an overdraft you end up being over $100 overdrawn with 3 declined purchases. It was a hefty class action. But that was beyond MC. That was more like fraud.",
            "Shame on you for not sending 10 separate envelopes with one penny in each.",
            "TCO the effort to review the bill cost them the $0.10, much less the time to tell you, the time you took to send it, the time to open the envelope, and the time for finance to discuss it, ultimately that $0.10 probably cost the company $10",
            "Send them a quarter and demand the balance be direct deposited somewhere obscure. Open an account in Turkestan unless you live there. Or maybe Crimea.",
            "I sure hope someone got fired for that blunder",
            "Well done! Made life better for everyone!",
            "The weird thing is I probably would have done the same exact thing but I wouldn't have thought of it as malicious compliance.",
            "Hahahahha this just made my day.",
            "Too bad you didn't have ten filthy, partially corroded pennies.",
            "You Legend",
            "Don't forget the time, multiplied by hourly rate for you and all the people involved. \n\nWhy did she take offense over 10 cents? It makes no sense...\n\nOK, no more  coffee for me today...",
            "I remember once that I had to fly to China at the last minute.  Because of company booking rules and airline fuckery it was more expensive to fly coach than business  by a few thousand.  I literally showed the finance people and my manager the screenshot.  Nope, I'm a peon and not allowed to fly business.",
            "Not my MC\n\nA Housing Supervisor for a rental property where we lived for a few years had a similar story.  This would have been in the early 1990's.\n\nHe was responding during an On-Call weekend, and used the Company issued Cell Phone to let his Wife know he was done and heading home.\n\nApparently, this was flagged as unauthorized and he was informed that he would have to pay for the call.  I think it was a whopping $0.15, which would be an average charge per minute at the time.\n\nHe wrote them a cheque for $0.16 just to mess with them.\n\nA place I worked around that same time made use of a lot of Cell Phones.  Project Managers had them installed in their cars, and Supervisors carried around those old Motorola Bricks.\n\nOne Supervisor in particular, distinguished himself by making calls one weekend, while drunk, and presumably passed out without ending the call.  It disconnected when the battery finally died.\n\nThe charged hours of calls from his phone (@ $0.15/minute) exceeded that of the Owner, and he bragged about it.  They got rid of him no long after.",
            "Well played, although I would have sent ten pennies instead of two nickels, and I would have used some serious glue.",
            "I had a supervisor position at one point and all my reports had company cell phones (Blackberrys, so around 2010).  I would get an email monthly telling me to be sure and check their phone bill amounts online, so I did.  No problems until one month a report's bill was triple the normal amount, but his usage wasn't.  I tried to find out what was going on and nobody I contacted could explain it other than \"we have different buckets of minutes people get put into so it's probably related to that\".  I never bothered to check anybody's bill after that because it turned out nobody actually cared or could do anything about it anyway.",
            "I received a bill once for a toll road that didn't tell me it was a toll road until it was too late to divert. I was just passing through the area, I didn't have a compatible transponder, the toll booth didn't take cards, and I hadn't carried cash for years by that point. So the worker told me to go through and the state's automated system would bill me based on my license plate.\n\nA few months later I received a letter from the state demanding payment. $0.18 for the toll. The letter had a postmark indicating it had cost them $0.52 for the postage. Plus however much it cost for the license plate reading equipment, and the cost for however many employees were involved in order to track my license plate from my home state.\n\nI don't think they have any plans to stop bleeding money from bad policies they've set.",
            "> no texting (even though texting was free)\n\nSo this isn't even about penny-pinching. It's just someone who got enjoyment from making other people's lives worse.",
            "Malicious compliance wins again!!",
            "This is the way.",
            "EPIC.\nYou have a tell people how to treat you. This man ain't about playing games.",
            "That's awesome, but I think I would have been more petty.\n\nI'd have paid them with pennies. One per letter. Let them pay postage 10 times.",
            "This is a boss move.\n\nSeriously just absolutely amazing haha 😂",
            "OP made a good call.",
            "outstanding",
            "Middle management paper pushers are the absolute worst.  That mf complained to a higher up about you without disclosing about it being over 10 cents lol",
            "I would have mailed 5 cents and then hand delivered the other 5 cents and asked for a receipt.",
            "What amazes me, especially since it's only about $0.10, is that they didn't just decide to deduct it from your reimbursement right away. Just the cost of him having to call you would be worth more than that in wages plus the phone call. Nice outcome though.",
            "I hope the finance supervisor got talked to by the comptroller, and he replied with \"following policy\".",
            "I get the 'we need to stick to policy, no exceptions' bit.  It might not be sensible in every situation, but I get it.  However, complaining about you just because you literally did *what the supervisor said you needed to do* was just a dick move.",
            "Perfect example of Penny smart...and Pound foolish",
            "B \n  C b. .                     Ть.          Ь. И      им о и с.           Т.         M.",
            "Ha! Nice",
            "What did the supervisor complain about?",
            "this is the best one i've read so far. thank you for sharing.",
            "Beauty!",
            "You couldn't find ten pennies? Tsk tsk tsk",
            "I used to have to bill back postage for clients in similar, minuscule amounts. The time it took me to do it cost more than the postage expenses 🤦🏼‍♀️ and this was a Fortune 500 company. I don’t understand how pathetic some of these companies can be.",
            ">The paper, envelope and postage had cost the company more than what they recovered\n\nNot to mention a director, you and finance guys wasted salary.",
            "Love it",
            "I still refuse to believe comptroller is an actual word.",
            "Oh, this one was **BEAUTIFUL!** Thanks for this, OP. ❤",
            "Gold",
            "Stereotypical asinine bean counter! Love the MC!",
            "This is great work!",
            "Well done OP! Thanks for sharing.",
            "I one time got a check for a dollar from the IRS .. didn’t even cash it wasn’t worth the fuel or the banks  time. They sent me multiple letters to remind me to cash it. Eventually they gave up. Lol.",
            "I just read this post this morning and Newsweek has already stole it ...\n\nhttps://www.newsweek.com/man-trolls-company-insisting-pay-10-cent-phone-charge-delighting-internet-1718214",
            "Should have attached 10 pennies to the sheet.",
            "I am a bean counter, and there are so much immaterial bs things I have to report, because of policy and cya, and high-ups also recognize it, but it's our job, the amount of time we spent dealing with small bs costs more in man-hours and wages.",
            "You could just buy a used cape for 10 cents. All heroes need it.",
            "My company pays half my cell phone bill. They’ve maybe called me once in 2 years. Email works. I work from office or home which has wifi.",
            "Delicious! Micro-manage and pay the price!"
        ]
    },
    {
        "post_id": "ddokvc",
        "author": "None",
        "title": "A contract can be used by both parties.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ddokvc/a_contract_can_be_used_by_both_parties/",
        "score": 15054,
        "num_comments": 252,
        "created_utc": 1570288907.0,
        "selftext": "This happened some years ago when I had just gotten hired for a part time position in a retail store. \n\nAll was good until the summer got close and he offered me full time for the summer ended which I gladly took. Less than two weeks in to the summer he changed my hours back to part time. I hadn't thought about getting the temporary fulltime thing in writing as he seemed like a trustworthy guy. \n\nIt made no sense as I did a good job and helped out with things my contract didn't mention when I had the time as I get bored quickly. I found out that even though he have years of experience in the field he had massively over spent on the wage bill and had to cut down to avoid getting fired by the head office. \n\nWhen I voiced my concern over this his only response \"I'm only obliged to give you 20 hour a week, as the contract state\". \n\nI wanted to chew him out verbally but I kept my cool and decided that if he wanted to play that game I would too. When I got home that night I read my entire contract and noted the clauses that I could use. \n\nOne clause stated that my responsibilities was unloading the trucks, take care of the stock room and keep the shelfs stocked. \n\nAnother mentioned that I shouldn't do other tasks as their insurance only covered me for the specific areas I was meant to work . \n\nNext day he told me to help out the cashiers as the lines were long. \n\n\"Sorry, can't do. As the contract states that isn't part of my job here and I should refrain from doing that. You can find it in my contract as clause 9a and 9b\" \n\nHe was fuming, face totally red and he just walked away without saying shit. \n\nAnother thing I had noticed in my contract is that besides my 30 min lunch break I had a 10 minute break I could take when I wanted so I gave him 5 minutes, walked into his office and told him I was taking my 10 minute break. \n\n\"What are you talking about? You only have one break and that's for lunch\". \n\n\"My contract says otherwise. It's in clause 10.\" \n\nWhen I got back from the break he asked me to clean something up out in the store. I couldn't believe that he couldn't take a hint. \n\n\"Sorry, can't do. Clause 9a & 9b prevents me from doing it\". \n\nNext day a costumer asked for help with something. \"Sorry, can't do. It's not my job. Find someone else\". \nMy boss heard about this and yelled at me but I managed to stay calm and answered with the clauses that prevented me from helping the costumer. Legally I was in the right and he couldn't do shit but I could see the hatred in his eyes. \n\nI was still on a trial period which meant he could fire me with only 24 hours notice but I could also resign with only 24 hours notice. \n\nI knew that once the summer ended and everyone were back from from their vacations he would fire me right away. I had started looking for other jobs and it was going all right so I decided to quit at the worst time possible when it showed itself. \n\nAt the last week of summer he had to fire one with suspend another for stealing from the store. It was the perfect time to quit and leave him badly undermanned for the week. \n\n24 hours and 1 minutes before my next shift I sent him my resignation before I sent a message to my coworkers about how they should remember to take all their breaks and not violate their contract by doing stuff they aren't allowed to do. \n\nI heard it gave him a little chaos when people followed my advice.",
        "permalink": "/r/MaliciousCompliance/comments/ddokvc/a_contract_can_be_used_by_both_parties/",
        "comments": [
            "One time, when I had put in my two weeks, my manager tried to schedule me for nine days in a row. After a quick perusal of my contract on my lunch break, I took a picture of the clause that states that I can only be scheduled for 7 days, and walked up to the office and sat down with the owner. \nIt went well, until he tries saying that it was okay, cause it was over two schedules. \nI politely asked how someone could work more than 7 days on one 7 day schedule. \nI walked out with another day off",
            "That last little touch at the end\n\n:fingerkiss:\n\n*beautiful*",
            "This is beautiful.\n\n&#x200B;\n\nAlso, username checks out.",
            "[removed]",
            "I love it when manglement gets screwed back with work-to-rule. Sadly, this neverhappens in the US retail sector thanks to Right-to-Work and At-Will usually getting bundled into the same legislation.",
            "Thats so satisfying\n\nDelicious...\n\nFinally, some top notch malice",
            "Great job!",
            "[removed]",
            "[removed]"
        ]
    }
]