[
    {
        "post_id": "ntc3v1",
        "author": "sujit_warrier",
        "title": "Don't listen to me because I have less exp? Ok, enjoy being blasted by the client.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ntc3v1/dont_listen_to_me_because_i_have_less_exp_ok/",
        "score": 15041,
        "num_comments": 449,
        "created_utc": 1622948632.0,
        "selftext": "So let me set the scene. I'm a software engineer, I used to work for a pretty big company that specialized in developing software solutions for their client. I was sent on-site to the client which was a big malaysian bank, to play the role of  front end developer( basically make their internet banking website).  They already had backend services setup for a mobile application which we were also to use for the website. There was only one problem you could only install the app in one phone and login to your account, this meant that if the customer logged into their app, they wouldn't be able to login through the website. As anyone can determine this is a big problem. I went to the back architect and tried to tell him as well as the project manager of this problem. They told me I don't know what I'm talking about and stop disturbing them and just do my job and nothing else. (I later found out that they hated the previous front end manager and would never listen to the front team.) So I sent a mail detailing the whole problem to both of them and their bosses as well. As expected nothing happened, but my butt was covered.\n\nFast forward 2 months, the client reviews the architecture for the website and finds that no changes have been made to the backend to accommodate the different behaviour of the website. They call a meeting and blast the 2 above guys and their boss. They claim they are backend people and don't know the difference in behaviour in a website and it was my job to let then know. So they bring me in to question me why I didn't let them know and because of me the project has been delayed 2 months and the company has incurred losses. I calmy tell them of my meeting with 2 idiots and show them the mail which they ignored. Then it was a glorious explosion.  After that they always consider my suggestions.\n\n\nEdit:  People have been asking about the glorious explosion. Well basically the architect was called incompetent and his 20 years of experience was called into question and the project manager blamed everything on the architect.\n\nAftermath: After 2 months the architect was transferred to another project and replaced and the Project manager quit IT  and last I heard he is trying to setup an organic farming business.\n\n\nEdit2: Thanks for the silver.\n\nEdit 3: thank you for the various awards and thank you for the gold.",
        "permalink": "/r/MaliciousCompliance/comments/ntc3v1/dont_listen_to_me_because_i_have_less_exp_ok/",
        "comments": [
            "Biggest part of being a professional adult, unfortunately, is covering your ass because of the shit ton of incompetence around you.",
            ">There was only one problem you could only install the app in one phone and login to your account, this meant that if the customer logged into their app, they wouldn't be able to login through the website. As anyone can determine this is a big problem. \n\n\"It's not a bug, it's a security feature!\"",
            "“Glorious explosion”",
            "Holy shit, is it mbb from Malaysia by any chance, I always encounter this shit when I'm using both app and website at the same time and it really annoying",
            "Similar thing happened to me not long ago that ended up costing me my job. Except not because of why you would think.\n\nI was working for an IT company in Operations and I was doing all of our finances. Projections, tracking, keeping an eye on revenues, making payments, yada yada.\n\nAfter a few months of being there I started noticing a pretty bad downwards trend on our financial statements. I warn the CEO and a couple of other founders about the issue, why it is happening and I tell them what they should do.\n\nThey ignore my warnings, disregard my ideas every single time and shrug me off during every meeting.\n\nWell fast forward a couple months, I get a request for a meeting. Unusual. But I’m not surprised. I do some digging before my meeting and find out people are getting laid off. Yup. I saw it coming. I’m getting laid off because they can’t afford to pay me anymore. They are sending away one third of their employees because they are tight on money. I warned them several times, told them the changes they needed to make to prevent this from happening and then they never listened to me. And I ended up paying the price because of it. They hired me to do a specific job and then they didn’t listen to me.",
            "Similar story here. I was a consultant on a project for a bank. There was a vendor platform involved along with some custom code. \n\nDuring project implementation we discover a bug in the vendor’s code and open a ticket with the vendor. I’m speaking with the vendor and they inform me it’s a simple fix but they’re official product release is not for another two months. The client says that unacceptable and they need a patch same day. Not sure why given that we’re not even in production, but the client insists I get the vendor to give us a patch. \n\nI go back to vendor and we strike a deal. They’ll give us an untested patch strictly for development use only, and before our prod go-live we upgrade to the official release. One very important thing to note this is an untested patch and does not come with warranty or support. I am explicit in telling this to the client is email. Client says that’s great, thanks so much for getting patch and let’s ensure we are careful with our testing. \n\nFast forward to the prod go-live, the client still hasn’t upgraded to the official release. I tell the client that we’re supposed to but management says the patch passed all their testing and should be good to go. \n\nObviously it wasn’t. We go to production, encounter a few criticism issues and the client is telling me to open tickets with the vendor. I do so, and as expected the vendor tells me there is no support for this. The client’s management is absolutely floored. On the call they’re very passed off saying “what kind of vendor does not offer support?!” I tell them this is why we signed up for with the patch. \n\nImmediately all blame shifts to me that I got them some flaky build, that I should have warned them, etc. I forward the same email I sent to the team. Boss was still pissed off but he didn’t have a word to say to me",
            "Reminds me of my time doing IT for a grad school office. There was a larger, university IT department, but it could take hours to days to get a small problem fixed. My job was quick and easy fixes and to be point for dealing with the university IT department. \n\nThey decide to roll out a new web application, which was great because the one it was replacing was horrible. We test it. I find little bugs here and there and they get fixed. There was one issue, not really a bug, but something we knew from dealing with grad school applicants that was going to be a problem. \n\nA month and several new versions later, this issue is still there. I wish I could remember what it was. Pretty sure it wouldn’t have taken long to fix. We start getting pressure because we are holding up the web app. So, we agree to let it be put into production. \n\nThe issue was fixed within three days because they got flooded with emails from applicants about it. \n\nI think it might have had to do with differences between how undergrad and graduate applications are processed. Been too many years for me to remember.",
            "I am in a very similar role to yours - same dev type, different client industry. It is amazing how much FED’s are looked down upon in the software dev world. I have worked with companies that listened and others that didn’t... the ones that actually listen always get the better product at the end of the day.",
            "I mean, organic farming does kinda sound more fun than what you guys were doing though....",
            "All I needed to see was \"Malaysian Bank\" to know it was going to be a clusterfuck.",
            "The moment you said Malaysian, I knew we were about to get roasted. Have you seen our government website? XD",
            "And this is why **I write**.\n\nTalk is cheap and people (me included) are forgetful.\n\nStill not ideal, as even the written word is open to interpretation, words can be stretched **a lot** and also ignored, but beats being covered by nothing.",
            "So wait, how pretty was the company? You said it was pretty but not how pretty.",
            "I’m in HR. Documentation is so important. Write things down. Email people with specifics. Document, document, document.  As long as you document facts and not opinions, you’ll always be happy you did. (And do it professionally and respectfully. Your emails may come back to bite YOU in the ass if you look like a rude jerk)",
            "> the Project manager quit IT and last I heard he is trying to setup an organic farming business\n\nLol! Man, I can just envision that mental conversation...*fk this IT sht, I'm gonna move to the middle of fk-ing nowhere where there are no computers and no 'projects' and just grow fk-ing organic fk-ing turnips, I swear it...*",
            ">Project manager quit IT and last I heard he is trying to setup an organic farming business.\n\nWhen you're used to working with bullshit, why quit?",
            "> project manager quit IT  and last i heard he is trying to setup an organic farming business.\n\nGodamn, that’s about as literal ‘end this mans whole career’ as you could get.",
            ">last I heard he is trying to setup an organic farming business.\n\nAll the poo that's fit to poo.",
            "TIL  if you see a problem and bring it up only to be ignored, make sure you document and email said problem.",
            "Had a friend with awesome cya.  Kept a journal on a daily desk calendar.  When called to account, had the day by day (pre interwebs).   The company demanded he turn the calendar over.  He showed them a receipt for personal purchase.  They completely caved. Next level up was soon gone.",
            "Always cover your ass! I have sent many emails about problems and I would also suggest hard copies at your home! Had an incedent with a manager over some safety issues and sent an email, with hard copy at home. Was questioned on this by higher ups and why I didn't bring it to someone's attention. I mentioned the email and was told that there was a hard drive crash and that that email didn't exist. I told them no problem, I'll bring the hard copy of it on fire them. Amazing how fast they back tracked!",
            "> the Project manager quit IT and last I heard he is trying to setup an organic farming business.\n\nSounds like that one got the best outcome.",
            "If you don't have enough exp, you can always just grind boars in the forest area.",
            "> I later found out that they hated the previous front end manager and would never listen to the front team.\n\nWrong answer. The back end team exists solely to enable the front end team to do their job. Yes, it's true that we do a whole hell of a lot more that the front end team doesn't know about and probably can't understand if they did. But at the end of the day, the only thing the customer sees is what the front end team gives them. And if the back end team screws that up by not listening, everyone loses.",
            "The golden rule of business and life. CYA, and do it in writing.",
            "> his 20 years of experience was called into question\n\nThe question: Is it \"20 years of experience\" or \"1 year of experience, repeated 20 times\"?",
            "Organic farming/Project Management: two very different jobs that shovel shit.",
            "> ... and the Project manager quit IT and last I heard he is trying to setup an organic farming business.\n\nGoddamn, that's one hell of an explosion lol. But kudos to the manager, hopefully his organic farm business is booming. At least the right kind, this time.",
            "Hah! One of the last things I did Friday was send an email like that.\n\nKnowing when and how to send those messages is one of the things that imo marks you as being a smart programmer, no matter how senior you are.",
            "Tell us more about the explosion!",
            "Karma is a bitch",
            ">Project manager quit IT and last I heard he is trying to setup an organic farming business.\n\nThat's a bit of a turn",
            "When I started at HP Boise, a manager from the UK took me out to dinner and said \\~ \"S/He who writes, rules.\" True.",
            "I hate managers like this. I'm going through the same thing at my job. I've been trying to get my work done but I need help from someone who isn't helping. Shes the managers friend so she gets away with not doing anything. Sent a bunch of emails and finally the manager responds 'you can ask for help and explain the situation a 1000 times but nothing is going to change'",
            "Was the project manager that quit IT and is now trying to start up a organic farming business Kimbal Musk? Haha",
            "Ugh my credit union has this setup, you can use the app or the desktop, not both. It's terrible",
            "From IT to organic farming. Hmmm...",
            "After reading so many notes in stories like this I’m suspicious of anyone who used to have a technical career and then went on to something completely different.  \n\nIt used to always think they must have struck it big but now I sometimes wonder if they were just terrible and had to bail and grow organic lettuce.",
            "I’m a front end engineer as well. Back end devs are so fucking difficult. I have one at work who feigns front end bugs that nobody can reproduce and says “I’m not changing the back end until you fix the bug on the front end”\n\nYou did the right thing covering your ass with the email.",
            "CYA is the most important thing in tech.\n\nEta: when I was hired for my current job, I already had 25 years in the business in various other companies including several fortune 500’s. However, I was still the new guy and how dare I question how the guys who had been at that company for their entire careers did things. 4 years and several disasters later due to not keeping up with current industry standards, they now listen to me.\n\nAlso I love, Love, LOVE red tape! Saves my ass all the time!",
            "Why does this always happen, businesses either ignore front or back vica versa? Never put non-IT people in charge of IT projects",
            "Always due dilligence and cover your backside. Good job mate.",
            "Satisfying story though could use some more details on the explosion.",
            "imagine, one day you're working in a office as PM, the next day, you're planning to plant tomatoes for a living.",
            "Ah, Asian user experience. Never fails to fail.",
            "I’ve never heard exp used for experience outside of games, so I thought this was an going to be an elaborate DnD post at first.",
            "Epic. Thank you for this gloriously well done malicious compliance.",
            "[removed]",
            "[deleted]",
            "I see",
            "Does this bank... Have anything to do with a month?",
            "Ok, I'd never heard that before. Plagiarizing!",
            "I doubt it but Peter is that you?",
            "Weyyy, fellow Malaysian! Hi! Nice MC",
            "CIMB Clicks?",
            "Hope.\n\nAnd if it was reported by others",
            "If they had only listened.......  It is hard to convince a \"know it all\" to listen.",
            "Maybe a stupid question, but why would you need to be logged in at the website AND the mobile simultaneously? Doesn’t make sense to me but I’m not really into web design 🤪",
            "Always carry an umbrella for when the shit showers.",
            "This is going to sound really silly but where is the organic farmer/ex IT project manager based?\n\nMy wife had a IT guy who would fly into Georgia to do IT for their dental office as trade for getting dental work done. He stopped doing IT to be a organic farmer....",
            "SLCV?",
            "Was sent to an office of about 15 people to assess their IT operations.  I did not not have the authority or funding to change things.  Noted that there was no UPS in use in the computer room and power strips were daisy chained to power the servers and network equipment.  Took a photo of the daisy chain.  Put it on the first page of the report and recommended a UPS be put in place.  Emailed report to two managers.  Fast forward a month or so.  Electricity was lost at their building and everything was down and it took days to get it back.  Office manager blasted my managers for sending me there but not fixing the UPS situation.  I reminded my manager that it was on the first page of the report as an urgent recomendation.  Managers came out looking like idiots.",
            "I am so glad you had the good sense to cover your arse. This is golden rule number one in the workplace because incompetent people will always try to throw you under the bus. Have it in writing what happened and then there's no way they can worm their way out of it \"further to our conversation earlier today, my recommendations are...\" Nice work!"
        ]
    },
    {
        "post_id": "kiolp2",
        "author": "wyrin",
        "title": "Dock half day pay for being 15 mins late! Cue malicious compliance.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/kiolp2/dock_half_day_pay_for_being_15_mins_late_cue/",
        "score": 15026,
        "num_comments": 413,
        "created_utc": 1608708294.0,
        "selftext": "This happened about a decade ago in my first job. \n\nIt was a IT/Analytics services firm in India (I am from India), while work was interesting, the work hours were insane and folks used to work 12 hours a day usually.\n\nSince we always had conference calls with our counterparts sitting in USA, we ended our workday pretty late, 10 pm was my usual time.\n\nDue to this, folks used to come in to office late in morning as well, usually entire team would only be in by noon.\n\nManagement was not happy about this, so they went ahead and decided that everybody had to be in by 10am and if you are not then they will dock half a day pay (we were all salaried employees). Usually managers were supposed to enforce this, but they didn't care since they were in office with teams themselves, but occasionally HR would stand at entrance to office to implement the policy.\n\nOn one such day I was 15 mins late and HR at gate stopped me and informed me that I will be docked half day pay.\nI stopped for a second, thought about it and turned back. HR stopped me, with a shocked expression, and asked 'where are you going?'. I replied 'back home, see you at lunch :)' and went back home ignoring his feeble protest.\n\nI actually ended up calling my manger and just took a day off.\n\nAfter this incident, I heard similar such stories from many people and HR stopped enforcing this policy.\n\n---------------------\n\nEdit 1: Corrected a few spelling errors, now that I am on laptop, I could see them!\nAlso, thanks for such a response folks! My first ever post to get such traction, not that I post a lot! :)\n\nEdit 2: well this blew up, I just got up and have been reading comments for last 30 mins. To summarise I think we are already in orwelllian future.",
        "permalink": "/r/MaliciousCompliance/comments/kiolp2/dock_half_day_pay_for_being_15_mins_late_cue/",
        "comments": [
            "\"If you don't come in today, don't come in Monday either\"\n\n\"Woohoo! Four day weekend!\"",
            "I manage an overseas dev team. I don’t know when they get in, I don’t know when they leave. They finish everything on time every sprint. They are responsive to urgent requests. Who cares about the rest?",
            "Nothing's worse than starting to micromanage an already running department for seemingly trivial reasons",
            "Bravo. Half a day's work for half a day's pay.",
            "I used to work in IT services in India too. My form of protesting the stupid mandatory hours was to not report certain tasks as done on the daily reports and then add them up as work done over the weekend so I could claim allowances. It was borderline illegal to do, but so was making us stay for 12hrs when we are required to work only 8hrs.",
            "I love the inevitable consequence of petty rules., once you say X time is late and we'll be docking Y from you're pay (which is worth looking into, you should be paid for what you work IANAL) then there's no downside to treating X as Y.\n\n5 mins late but you dock an hour - Well, I'm already 5 minutes late so may as well get breakfast and do a bit of shopping",
            "Years ago, I was supposed to present on a new product at a sales team meeting and was told to join them half an hour after their meeting started so that they could discuss other matters first.  At the appointed time, I tried to enter the meeting room but discovered it was locked.  The director came to unlock the door and told me, \"If you can be so late to our meeting, you obviously don't feel you belong to the department.  You may leave now, you're not wanted.\"  (He didn't know I was the one invited to present at his team meeting.)  Well, fine then, I went back to my office.  The director had to arrange for another session with me (and a few of his managers), and we set it for my department's meeting room.  Now, my office is located in a more secure part of the building where colleagues from other departments will need to sign in at 2 entry points and as a result, they were about 15 minutes late for the meeting.  It was my turn to tell him, \"It seems new products are not as high on your team's priority since you're all 15 minutes late.  I will have to ask you to reschedule as I have another meeting to attend.\"  They were very early at our next meeting.",
            "I got docked a half-day for showing up at 9:15 AM. So I left at exactly 1:15 PM.\n\n\"Where are you going?\"\n\n\"It's been four hours. My half-day is over.\"",
            "I was late 1 min and was docked 15min of pay. My schedule says I need to start inspections at 7:05 . People were mad when I said I'm not working until 7:15 when I start getting payed. Nothing has changes but HR said I can't get in trouble for not working if I'm not being payed.",
            "That kind of confidence scares HR because then they realize you can't scare this person with threats so they do an emotional reaction and do the \"I'm sorry won't happen again\" must have an option of another job in the wings or is so good we would screw ourselves if they left.",
            "You responded perfectly to this. Last year, I had a manager try to dock $12,000 from my pay because he didn't think I added enough value to the company to justify the extra. I just walked out and got another job.",
            "One place I worked as a temp had this same policy. If you were more than 10 minutes late, it would count as an absence and you wouldn't be paid for the day. As a result we were always understaffed, because if people were going to be late, they just wouldn't come in at all.\n\nThis company was infamous for shit like this. Work was in a cleanroom where you had to gress in head-to-toe PPE. Originally they did not pay employees for the time they spent getting dressed and undressed until they got the pants sued off them and were forced to pay for that time, as well as back pay for those employees. Also when taking breaks, your break started when you clocked out which meant you had a 15 minute break to get undressed, take you break, get dressed again and clock back in.\n\nGod I fucking hated that place. Glad they went out of business.",
            "When I was working tech support they changed the policy to something similar. If you were 1 or 2 hours late then it was a half day pay kind of thing. I pointed out to my team lead that if I’m running late, I’d just take a half day instead. She didn’t like that, and they eventually changed the policy since many others figured that out too",
            "I noticed this in big companies. They see a spreadsheet but not the people behind the spreadsheet",
            "When I worked for Amazon they had this policy that you could clock in 10 min early and up to 10 mins after the start of the shift, but if you were any later than that, you were docked an hour of UPT (unpaid time)",
            "Worked in a govt office that said if you were in 1 min late you had to take 15 mins of PTO or ask for approval to make up the 15 mins at the end of the day. They wanted everyone signing the timesheet on 15 min increments so it was easier to add up time, I worked there in 2008, get a card punch at least. My manager tried enforcing it and I just laughed.",
            "I worked for a company for six years, paid salary. My work load was crazy and it never let up. 60+ hours a week were normal. I showed up for work at 8:10 one day and my manager asked me where I was. At home! Well, we start at 8 AM. I told him I know, I over slept an I got in as soon as I could. He continued to give me a hard time about how important is was to be on time and I was getting more pissed off. I asked him where he was last night at midnight. At home, sleeping. Well I was at work at midnight. He shut up then.\n\nI made up my mind about that time to look for other work. I ended up going to work with a competitor for about two times the pay, but that is another story.\n\nalso, [https://www.reddit.com/r/ProRevenge/comments/kizz1z/dont\\_want\\_to\\_pay\\_me\\_and\\_work\\_crazy\\_hours/](https://www.reddit.com/r/ProRevenge/comments/kizz1z/dont_want_to_pay_me_and_work_crazy_hours/)",
            "Some places have weird policies. A friend of mine would get written up if late, but you could call out even 10 mins before with no repercussions. So whenever he was running late because of traffic he would call and say he isnt coming in and then uturn and come to one of our houses to hang out.",
            "I worked at a bakery that did this a few years before I started working there. They had employees that had been working there for over 15 years. It took some new employees discovering this and they called the labor board. After investigating, they stood next to the owner as she wrote out checks for the amounts that she robbed to individual employees. Some received checks around $10,000. \n\nOwner was pissed but never tried that again. Labor board still comes in and does pop audits to make sure that she isn’t ripping her employees off.",
            "That’s some smart and quick thinking there OP, kudos to you!",
            "My job the shift is 7-7 but you have to be clocked in by 6:45 and you can’t leave until 7:15. If you clock out at 7:14 they will only pay you until 7. Sometimes I’m done by 7:05 so I just sit around on the clock before I clock out. I refuse to give them even 5 minutes so instead they have to pay me an extra 10 minutes. It’s so ridiculously petty but that’s how they insist it’s done.",
            "I love when they expect to be able to dock you for half a day and still expect you to work that time.\n\nImma nope straight outta there and come in halfway through the day",
            "Don't give me a reason to take time for myself. You won't like me when I actually have enough sleep and a decent meal.",
            "I only get a half days pay? I'll only do a half days work, ya bitch.",
            "When the company starts watching your time, employees start watching their own time.  The company never wins in these situations, and the business always suffers.",
            "I worked at a large convention hotel 27 years ago. They were non-union and negotiated rules with the employees, most heavily benefited the company.\n\nOne was if you clocked in 5 minutes late you accumulated points. On surface fine but working in food and beverage was shit. You would work a full shift then when leaving you would be \"asked\" to stay over because they needed people to help with that nights convention. Mostly due to schedule being understaffed to make management look good. So you would work possibly a full 2nd shift. Then get penalized for being late and dead on your feet for your next days shift.",
            "[deleted]",
            "We had a manager that was always harping on meal breaks. If we were busy and business was jumping, we just ate on the go. She made a HUGE scene about meal breaks. I said well we need more people to cover. She said you are to punch out and not do any work. \n\nSo I did. \n\nThen she proceeded to show other employees some stuff on our company web portal. She told me to take a look. “I’m on my lunch break.”\n\nShe told me to come quick, it is quick. \n\n“Cool, I’ll take a look in 29 minutes after lunch is over”\n\nI hate managers like that.",
            "My old job had a policy where late was the same write up if you were 1 minute late and 7 hours late so a few times I woke up to late to make it on time and called in saying I would be there 30 minutes before clock out due to over sleeping. My boss and I had a meeting about that shit the next day.",
            "Used to work a job that had attendance points system. Punches anywhere from 5 min from start of shift up to half the shift (w/o being onsite and a manager verifying technical login issues) were given a half point, anything beyond the half day was a full point, and I can't remember how many until you were fired.\n\nI had been there for a few years, team leads all knew me, knew I had good work ethnic. Only a few times where I was late, and typically not by that much and always something beyond my control. One morning I got stuck in bad traffic caused by a train stuck on tracks that I couldn't get around. Even then, I was only like 15 min late. So I get in, explain things to the department head, ask if they are willing to waive the point since I couldn't have gotten in sooner. They say that my manager (who wouldn't be in for a few hours) is the only one that could do that (and I knew from past experience he wouldn't). So I thanked the lead, turned around, went home. Came back 3.5hrs later, clocked in 2 min before my shift's half way point.\n\nYeah, I lost some pay, but they lost performance metrics. Fuck 'em.",
            "I don’t care if you arrive late or leave early . Life happens . Kids refuse to put on a certain colour shirt .  You then spend 15 minutes finding one they do like . By that time that extra 15 minutes fighting with your kid adds and extra 30 minutes to your commute .  Your an hour late ?  Make it up at some point . I trust you ..  you can always tell the people who have legitimate reasons for being late vs someone who is a deadbeat employee",
            "That is an excellent tale of malicious compliance! I can almost see the look on the HR rep’s face when you turned around and went home! 🤣🤣🤣",
            "Nice to see some Indian stories here. Good on you OP :)",
            "Nice! Yeah if I weren’t getting paid for the first half of the day, I wouldn’t work the first half of the day, either.",
            "Used to do this for school. We'd get detention for coming a minute late. If I was late, I just turned around and ate breakfast at the restaurant nearby until I made up the time I was going to do in detention.",
            "I love where I am. I could potentially make more somewhere else but I never have people breathing down my neck. We’re trusted to keep things running smoothly and get our work done. We do and we never see management unless there’s a meeting or they need something.\n\nSorry you have to deal with that crap but good on you for showing them how ridiculous they’re being.",
            "if i got docked a half day's pay i sure as shit wouldn't sit around working for free until my pay counted again, lol",
            "I had a boss once who said \"if you knew you were going to be 2 minutes late, you should have left 2 minutes earlier\" when people were late due to (unexpected) traffic jams.\n\nHe started getting people to fill in forms whenever they were even a second late. As a result, morale plummeted and no one stayed after 5pm as they used to, nor would they start before 9am in any capacity.",
            "I tended to go the other way... oh wait, you aren’t in till 10pm too... I’ll just call your personal phone about a HR issue at 9:55 every night (from work) until you get the hint",
            "I will never understand why companies think their workers will stay when they know they aren't being paid.",
            "I did the same in a job i had years ago. The owner/manager/worker. Called me to hurry up, i was taking too long having bfast. I told her you dock me a hour, i take half for lunch half for bfast. She said no, you can have a quick bfast but the hour is for lunch. Alright... Here comes the busy season. Well i am going to lunch, the owner... We are busy hurry up. I said i have 1 hour. I ate lunch, i set up the arm chair we had, we also had a tv. And camera which monitors the activity in this area, as it was used to keep watch. I layed back and went to sleep for the remaining time. \nMy timer went off, and i went up back to work. She was red as hell. I did my malicious compliance",
            "These are actual annual performance review comments from my supervisor when I was starting out “his work is great quality and always on time but he doesn’t want to burn midnight oil”. I quit shortly afterwards.",
            "And this is how you get organized labor and then begin to realize the power or organized labor. Labor runs the world. Not bosses. Not middle management. Not HR. With few exceptions, it's labor. Good job OP. Keep it up.",
            "It makes sense. Why work for time when you won't be getting paid. That was a perfectly acceptable and rational response. \n\nAlso, if HR has time to watch the doors for tardy workers, maybe HR doesn't have enough to do?",
            "I did something similar once. I woke up late for work and called to see if they could adjust my schedule so I could stay later to make up the time. They said no. I knew that I'd get half an absence if I was late, so I'm like fine I'll be in at noon. They backpedaled quickly and let me just be 15 minutes late and stay 15 minutes late.",
            "At my first engineering job out of grad school boss was a micromanager from hell.\n\nMicromanaging engineers is a BAD idea: we know all the math and document everything...\n\nNormally we would do things like swing by the lab in the way in to work to see if all was well and if anything needed attention.  Doing that at 745 meant getting to work 15 minutes early but being at your desk at 810 or 815...  The boss decided he wanted us at our desks at 800, then go elsewhere, kind of like punching a clock.  We objected that this was inefficient and treated us as hourly, but he wouldn't budge and pointed to the employee handbook: 8-5 M-F.\n\nThe boss loved to schedule meetings late in the day and one fine Wednesday he scheduled a half hour meeting at 430.  He tended to run over.  Cue malicious compliance, I scheduled a lab meeting with my colleagues for 510pm.  At 500pm I and my colleagues got up and started to walk out.  He wanted to know why and we pointed out that the meeting was over, that clock works in the afternoons as well as the mornings, and that we ALL had another meeting to be at...  He decided to work with us on flex time thereafter.",
            "When I was just out of grad school I took a bus to work. Due tithe bus schedule I was given permissions work 940 to540. After about a year the boss said he needs me to be in at 9 “in case he needs me.” I told him the bus would get me there 815 so that didn’t work. He insisted so I replied ok I’m giving you my 2 weeks notice. He blubbered and said fine, 940 is fine. Since I was young with no kids, I was perfectly willing to followthrough",
            "In 11th grade I walked into English like 6 minutes late because my teacher in the previous class had held is late to lecture us. She also refused to give out and late notes. \n\nMy English teacher had this policy where off you were more than 5 minutes late, she marked you absent. The school rule was something like a write-up and a detention after 2 absences, and a 5 tardies counted for 1 absence. But this teacher's tardy window was so ridiculously slim *specifically* because she wanted kids to get detention foe being late to HER class.\n\nAs soon as I walk in the door, \"I've already marked you absent, Romelo\"\n\n\"Anatomy got out late. And it's on the other side of the school.\"\n\n\"Do you have a note frome Mrs. Lecture\"\n\n\"She wouldn't give anybody one. Probably didn't feel like writing 30 notes.\"\n\n\"Then I can't change your attendance. That's 2 now, right? That'll be detention, and a write-up.\"\n\n\"I guess it will.\" And I turn and walk right back out. I can hear the class laughing as the door closes behind me. \n\nBefore I make it very far down the hallway, she bursts out of the door, screaming \"Where do you think you're going, *Young Man™?\"*\n\nAnd I reply, \"Doesn't matter, I'm absent.\"\n\nShe did **not** like that one. I though it was at *least* a little bit funny.\n\nIt was laughably easy to skip class at this school anyway, that's why all the weird rules. I started skipping classes *all the time* after this, so I don't even remember where I went after this. \n\nMaybe whatever lunch period was happening, maybe the gym, maybe the band room, maybe the library. Maybe even another teacher's classroom.",
            "Hahah.  \"You're gonna dock me half a day's pay?  Well, I'm only gonna work half a day!\"",
            "That is a catastrophic way of handling a tardiness problem. Treat people like adults, and they'll respond like adults. You were smart to walk out the way you did.",
            "I had a job where the punch clock rounded up to the nearest half hour, so if you were 1 second late instead of starting work 1 second late you went back into your car for half an hour",
            "[deleted]",
            "NTA.  We need to do more of these “see Mr. Bossman, we are not slaves” stories.  Companies seem to think loyalty goes one way: to them.  And that folks will go ahead and work for free if they are late and will be docked a half day.",
            "about a year and a half ago, I walk into work about 10 min late, this is nothing new for anyone,  people are routinely 5-15 min late ( I work in a restaurant kitchen); anyway, it's a tuesday, the chef isn't there, kitchen staff are \"managed\" by front of house managers, I walk in about 2:10 and the manager who is there doesn't seem to enjoy my presence much, always sending me home early and whatnot, I walk into the kitchen to clock in and he's standing right inside and says \"you can go home\" I ask why and he tells me it's because I'm late, I shrug, say 'cool', and turn around and go home : )",
            "After reading the title I already knew everything I'd read in this post \n\nStill a good reading though\n\n8/10",
            "Man that's some quick thinking. I can just picture the exchange in my head.\n\n\"Uh.. wait-- hmm. 🤔😐\"",
            "That's the way to go about it.",
            "A school I was working at tried this. \"If you are even 15 minutes late, you lose an hour\" \n\n\"Fine. I will call in sick instead\"\n\n\"You know what, don;t worry about it\"\n\nIn addition I believe it was illegal anyway.",
            "Similar we had one where you could clock in UNDER 10mins late or they’d dock you half a day. I was in line to clock in when it rolled over. I went back to my car set the alarm on my phone to clock in for my half day and slept in the employee parking lot till time. I think I ate lunch then so I didn’t have to take my “lunch break” too but I might have walked in clocked in and immediately clocked back out for my half hour lunch break, as a snooze can’t remember now.",
            "short but sweet. good for you OP",
            "You got balls of steel. Well done.",
            "I don’t blame you, why work more than you’re getting paid for with no benefits 🤷‍♀️ I’m glad that others followed your lead, that’s messed up",
            "Brave move, given how little in the way of employee protections there are in India.",
            "Well if you're not going to get paid for it anyway so why would you be there I love the facts you did to that policy",
            "I would've worked 4 hours and left early saying HR told me to take a half day.",
            "... a middle schooler would see that one coming, they pretty much asked for it.",
            "This is great!!! What a shit company culture.",
            "[deleted]",
            "*shocked pikachu face*",
            "I was the liaison for our counterpart team in India.  Most of the team had to rely upon public transport in order to travel to/from work.  I shifted my schedule in order to do hand-off and interface calls because I wasn't going to leave people stranded or worrying how to get home at night.  The company chose where the business was going to be located, it assumed the responsibility of dealing with the local situation.",
            "My daughters school had a similar policy. If you were 30 minutes tardy you were absent for the whole day. Ok. If she is considered absent, she can stay home.",
            "Love this. Used to do this at school too. Came in 15min late? You aren't here for the first hour. Cool, nevermind that it wasn't my fault for coming in late. i'll happily take a break in the halls while i listen to some music. Teachers stopped giving students an hour off when people just stood up and left when hearing they wont technically be in class on paper.",
            "I have a similar story. From 2005-09 I was working as a software engineer in B’luru. The first company I worked for was an IT services firm, and our clients were US based, so we had the usual “get in late and stay late” hours since our daily catch-up calls used to happen at 7 PM or so, and we used to stay back until 9 or 10, as required.\n\nFor a short time, we got this new account manager who decided that everyone needed to stick to regular work hours, so everyone was around during the same hours, increasing inter-team communication and productivity. We tried to be compliant, but it couldn’t work, and all of us worked for the same client anyway, and those times were just how things were. So people soon started coming in at whatever time they previously used to, despite a few small warnings. The new AM couldn’t tolerate this, so big meeting, big words, names taken, check-in and check-out times read out (mind you, the access control didn’t record times, she had done so manually, or asked her assistant to do it), and since it was around the end of year, threats of low ratings, lower pay rises and bonuses. When we tried to clarify that we have to stay back to talk to the on-site guys, the response was that we wouldn’t need to stay late, if we came in at the right time and started work early.\n\nPeople were legitimately pissed. So they started sticking to the letter of regular work hours: 9-6. Problem being that it was usually a bit too late and inconvenient for the on-site guy and impossible to get the client side manager to stick around for a daily 10:30 PM call, or too early for a 7:30 AM call. This was before 24x7 internet and smartphones, with every work computer being a desktop. Once you leave office, your connectivity ends. And while we could be reached on our personal cellphones, (a) not everyone had everyone else’s personal phone numbers & (b) nobody would again navigate B’luru traffic to come back to office after reaching home.\n\nCommunication ground to an almost complete halt. Things took double the time to get done and many things had to be redone because they were not clearly communicated or understood the first time around.\n\nOne fine day, as everyone had expected, but much sooner than anyone had expected, the response SLA was missed on a production issue. Flags were raised, emails were sent. Team was first yelled at, then listened to. Then the resolution SLA was also missed. Client was pissed! Everything was delayed, targets were missed across the board. It got ugly for that project.\n\nIt went on for barely a week before such “rules” were dialled down to being just guidelines, with teams expected to exercise discretion regarding working hours as required. There were a few more changes like getting the team manager a work phone, but they were just to make it look better. A month or so later, she was moved out to a corporate role with no client interaction and we got a new AM.\n\nEdits: spellings, grammar and punctuation.",
            "My boss complained that I come into the office 10 minutes too late every day. I work an hour longer (for free) each day and those 10 minutes in the morning really help me. So now I arrive on time and also leave on time. \n\nSince when is it normal for employers to demand unpaid overtime from employees? Like just no, don’t.",
            "We have kind of the same thing where I work. Only if you're one (thats 1, uno, une or un according to google lol) minute late you're docked 15 mins. So, on the rare occasion I'm running late (I drive at least 35 mins. to work and in the snow belt in the good ol' US of A) and I know I'm not gonna make it on time I just slow down a little and get in before the 15 min. mark. \n\nWhen I first started there 10 years ago I'd bust my ass trying to make it on time without getting a ticket or ending up in a ditch in winter. Then I realized how stupid that was. lol. \n\nFor the record, I'm almost never late. Honest!!",
            "Isnt that techically wage theft?",
            "I like this story.",
            "This sounds like the perfect opportunity to have done what happened at the Winstron facility. You should have burned that sucka down!!",
            "Lowering someone's pay is a way to send their productivity to the floor.",
            "Well done!!!  My wife was lucky enough to travel to India.  She was made to work from 5pm to 5am to account for the “time difference”......On behalf of us ‘Mericans, thank you for keeping our side of the planet going.",
            "As one of the US counterparts in a similar scenario, good for you. Our India teams bust ass and don’t deserve that crap.",
            "LOL  ^^",
            "Where I am the foreman wanted to punish me because I didn’t take his side in a disagreement with a coworker. I am an electrician and I did some of the more complex data and security maintenance for him. He decided that I wouldn’t get the *easy* work anymore and got me to just work on fixing lights. What was funny was that I don’t mind fixing lights (in fact I don’t care what I do I just take pride in each job).\n\nThe other guys who had to struggle doing the challenging installs questioned why I wasn’t doing it anymore and would ask me for help. I would answer “I’m being punished.” and then help them out.",
            "I just want to thank and applaud you for using and spelling cue correctly.",
            "My husband works with a lot of Indians both here in the US and in India.  He started meeting with his one Indian coworker at 9AM her time which is midnight in ours.  No skin off his back as he’s a night owl.",
            "[deleted]",
            ">hours were insane and folks used to work 12 hours a day usually.\n\n>we ended our workday pretty late, 10 pm was my usual time.\n\n>usually entire team would only be in by noon.\n\n[Wat?](https://youtu.be/ldda7vhmuxU)",
            "\"Where are you going?\"  \n\n\"Are you serious?\"",
            "I had a manager who did this to me once after I had paid £15 to get there. Says he would send me home without any pay after working 3 hours. I said I wouldn't leave without pay, he tried to push me and I punched him in the face. I dont work there anymore but all his employees still laugh at him for it",
            "HR is supposed to make the employees lives easier and better but most of the time they do the opposite. \n\nI’m working on my third company and HR seems to he getting worse.",
            "I’ve been on the other side of this, a US exec visiting India. I would wake up jet lagged at 5, be in the office by 7 and it could be frustrating not being able to have meetings for 5h.\n\nUsually the key team members would get it and make an effort to be in by 10 and all was well.",
            "well if HR are going to be jerks about it I agree if they are going to dock your pay then why not just come in later let them suffer.  Its the stupidity of those that don't work the long shifts that cost the company money especially when they think they are stopping people from doing such, thats until they meet someone that comes up with a loop hole.",
            "I swear this is a repost",
            "Do you wear a cape?",
            "12 hours a day isnt too bad tho, everything else could be bad in there but 12hrs I think is quite ok",
            "Good! I'm glad you just left. There is no company that is entitled to free labor hours. Especially not for-profit companies. IDK if its legal or not where you live for them to do that, but thank you for refusing to sit and take it anyway.",
            "I get the feeling Joshua Fluke on YouTube has covered this exact scenario in India.",
            "At my place if work we have Flexi time. You can do your job between 6am to 9pm. Just let your line manager know your schedule. Now we have clean desk policy, leaving nothing out in the desk, everything put away in lockers, including laptops etc (we have large screens to plug in laptop) useful when working from home. So if I finish work at 1pm I start to pack up at 1:20 as by the time I’ve put away all my stuff, pens, mouse pad etc then now disinfect the desk it all takes time and I’m doing it in works time not my own time.",
            "I really don't know what else they expect in these situations",
            "Nice one!"
        ]
    },
    {
        "post_id": "dfynzu",
        "author": "jaxmagicman",
        "title": "You must get a doctor's note",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/dfynzu/you_must_get_a_doctors_note/",
        "score": 15019,
        "num_comments": 661,
        "created_utc": 1570717111.0,
        "selftext": "I am a grown-ass man, and I can tell when I am sick.  I know my body a little better than a doctor does in terms of recovery and if it is something I'm not sure of I will see a doctor.  But my place of work has this silly rule that if you are going to be out 3 days you have to have a doctors note.\n\nAnyway, I got food poisoning the other day. It was the middle of the night right before I was going to go in before it started to hit and I knew what was coming.  It was going to be 36 hours of running to the bathroom followed by 24 hours of being super tired from not having eaten for the last 2 days and not having had any sleep for the last 48 hours.  It's a full 3 day recovery for me.  The first 36 really are the worst though.  \n\nSo I called in sick on Tuesday, and Wednesday and was going to call in sick on Thursday too to get my much needed rest and be 100% for work on Friday.  I know this is what was going to happen.  But when I called in this morning I was told I have to get a doctor's note to miss this day.  It's stupid because what is a doctor going to tell me that I don't already know.  But my doctor also hates these types of rules so she had my back.  \n\nI went to her this morning and told her what my work said.  She asked if maybe I might have had chills during my time being sick.  So I said yes.  She said, she doesn't feel comfortable saying it was just food poisoning and is going to say it could have been a stomach flu.  She's writing me a note to be out until Monday now. \n\nSo now I have 2 days of just rest and relaxation followed by the weekend.  Thanks for forcing me to go into the doctor!",
        "permalink": "/r/MaliciousCompliance/comments/dfynzu/you_must_get_a_doctors_note/",
        "comments": [
            "I'm a emergency room physician and a fair number of people come in JUST to get a doctor note. I actually appreciate the people who striaght up say it rather than give me less then accurate symptoms that I have to work up and only realize later that they just needed a note",
            "I used to work for local government.  You had to have a doctors' note for ANY time you called out sick, or left early due to sickness for you or your kids, period.  If you didn't - you got a \"point\" against you, and you were only allowed seven points per calendar year before you got a write-up for your point-count.  You also got a point if you were tardy.  You also had to have a doctors' note *specifically* releasing you back to work if you were out for three days.  If you did not have a doctors' note sent into HR via email *before* you stepped foot on the property to come back to work, you couldn't badge in for your next shift, and would be marked tardy and given a point until you could provide your note.. \n\nIt was such a stupid process.  Thankfully, I have some really awesome doctors who know me and would just write me a note, and the remote-doctor programs are awesome and have come in really handy, too.",
            "A few years back or so flu season hit my work and people were calling out left and right. Sure enough it hits me. I feel sick but want to tough it out since practically the rest of my department is already out sick. I show up and halfway through I'm puke and have chills so I have to leave, which leaves no closer in our department. This pissed off the manager. I get a call the next morning that starts of with a forced concern, asks if I'm coming in that day, I say I'm feeling better so was planning on it. Then she drops that I need a sick note to excuse \"abandoning\" my shift or I get a write up. I swing by urgent care, its packed with sick people, takes a couple hours. I tell doc what's up and they're pissed that their time is being wasted by this when they have so many people to get to. Writes a note that not only am I excused but that considering that most people are sick for a few days and that I deal with people it would be \"irresponsible\" for me to work any time for the next few days. Instant four day weekend and my department was a ghost town for three of them.",
            "This is a huge part of the reason I left my office job.  Offices tend to be a high school with adults. It's honestly weird how your time,  office,  decorations,  days off and attire are dictated by someone else.",
            "My job is like this but backward. If you're out for more than 3 days you need a note to come back to work.",
            "[deleted]",
            "Where I am, they charge for the note. The price can range from $30-60 depending on the doctor's office. So not only do you have to call sick, taking a pay hit, you have to pay for the note, putting you even more behind. It's a bullshit policy that's in place to prevent abuse, but just punishes everyone.",
            "Brit here. TIL stomach flu. I hadn't heard if it before, asked my wife, and she said, \"Surely flu is a whole body viral infection, so how can it just attack the stomach?\" \n\nQuick Google later and found it's what we refer to as gastroenteritis. TIL.",
            "I know someone who only has 1 foot now. When she lost it she called her boss to say she wasn't fit to cme to work, her boss wanted a doctor's note, she sent them a picture of the stump (bone and all), her boss still wanted a doctor's note.",
            "My brother was killed by a drunk driver last year and I called my husband at work to get him to come to the hospital to drive me home... His job wanted him to get a note from the hospital. I lost my shit.",
            "That is not unique to your work. The reasoning is that if you're sick enough to be out for 3 days straight, you should be cleared by a doctor to return to work. That way serious illnesses aren't brought in to work to affect your co-workers.\n\nThat may not have been the case in your particular instance, there are absolutely instances where people come back to work well before the point that they should have, bringing all sorts of terrible germs with them.",
            "The first two years of my pharmacy school, if you were sick, you had to have a note to miss school/class no exceptions. So that means if you woke up with food poisoning, you couldn't miss school and get a note the next day after you go to the doctor, you had to give the note before you got sick, which made no sense. So when I got good poisoning one morning and was leaking out both ends, I still had to drive to school, go to the nurse on campus, all before 8am even when the nurse opened at 8am and then give the not to all my professors.\n\nMy last two years of pharmacy school on a different campus, we were given 5 business days to give a doctor's note for our absence. So if you got sick for three days, you had two days (unless it was a weekend, then four) to give the administration your doctor's note, it was fantastic.",
            "My company has a great policy on sick time. Makes me appreciate the benefits we have. Paid leave, vs time off. still need the note after 3 days, but you're getting full time wages the whole time.",
            "Whenever I read about stuff like this, I just think \"thank fucking god for unions\". Specifically, the fact that you cannot refuse to employ someone for being a member of a worker's union where I live. It gives me hope that this kind of shit will never happen to me.",
            "I was off 'sick' for one day. I had personal stuff to sort out and knew my boss wouldn't give me the day off so just made up an excuse. The next day when I got to work my boss asks for my sick note.\n\nAccording to my country's labour law, a sick note is only required after 3 consecutive days of being sick. The boss was insisting though because the policy states if you are sick on a Monday, you must give a sick note (this is against the law but anyway).  I told her fine, I will get a note. I made an appointment with a doctor and went during my lunch time.\n\nFaked some symptoms at the doctor and was given a sick note for the rest of the week. Sent her a message saying I will see them next week and felt extremely satisfied.",
            "I had a job at a call center and I started barfing uncontrollably for 2 days. I had to call out and they let me go. Theres no heart.",
            "As a Correctional Officer I have to have the note saying I was unable to work. It also has to say \"may return to work with NO restrictions\" or I can't come back.",
            "I used to work for a company that demanded a doctor's note for any call in. The boss claimed you should know you're going to be sick the next day by the time you are leaving so you could just take a vacation day like he gave us enough to have any sort of vacation and use some for illnesses. You had to be there five years to get a second week. \n\nThe first time I got sick and called in he was insisting I should just come in and shut the door to my office. I did it because I needed the job. Then a workmate got ill with something completely different a couple of days later and the whole office blamed it on me. \n\nThe next time I was ill I was already in the process of job hunting. It was a Wednesday and I went to Urgent Care. The doctor asked me if I thought I could go back in Monday and I laughed and said sure thinking it was a joke. I ended up interviewing for a great job that Friday and gave my notice on Monday when I returned to work.",
            "I worked for a company several years ago that required EVERY employee to bring a doctor's note excusing an illness related absence of ANY amount of time (even half a shift). This requirement applied to part-time workers who made minimum wage and had no employer-provided insurance.\n\nDisgusting!",
            "It’s not necessarily a note to be off but a note to comeback.  If you are out for multiple days the sickness could be contagious and spread to other people in the office if you comeback to soon.  If it’s an injury and you are allowed to comeback and get hurt at work then it could result in a workers compensation claim against the company.  The doctors note is to protect the company not to hurt you.",
            "I managed restaurants, and still do if you deal with the public, saying you have the squirts forces the employer to not allow you to work.  Unfortunately most employers in service industries are robots, and dont know the rules.  I love the fact my dhec agent knows that I do. And I love the fact she has been my dhec agent the last 12 year.",
            "I worked a job that had a similar rule, but it was also one of the most stressful and emotionally draining professions I’ve ever had. It caused me major anxiety and as a result physical symptoms, mostly vomiting, that resulted in me being unable to work. Working 12 hour shifts and never seeing the sun, the two days off never seemed enough for recuperation. My doctor gave me a note for a week off work that also perfectly aligned with my two week vacation. After finally relaxing and recuperating I realized that my mental health far outweighed the pay cheque and handed my two weeks in the first day I got back.",
            "I mean... for 3 days? That policy is pretty reasonable I must say.",
            "Where I live we must get a doctors certificate for 3 days absent from work and over, but generally that’s to stop employees taking advantage and saying they’re sick, but really just wanting a few days off. It makes people accountable and if you’re bludging it’ll deter you from taking that extra day.",
            "in Australia probably because of our healthcare but almost universally if you are going to be off work for 2 or more consecutive sick days you need a doctor's note.\n\nThere are doctor's offices that cater to quick 5-15min in and out which only charging what the government will rebate back called bulk billing clinics that people will often use for this.",
            "I got written up because I got admitted to the ER \\*where i was one of two clerks on duty\\* while i was on shift.. and i didn't find anyone at 530am  when i got admitted to the hospital, to cover my shift. i was in there for two days, and it was my responsibility to cal around for a sub... for however long i was in the hospital.. despite... not knowing how long i'd be there. I also got an hr rep to assure me i wouldn't be written up for missing because I couldn't help it. (fun fact my blood pressure shot up so high i could have stroked out, and a long term nurse went \"shit..\" when it kept climbing). So yeaah. if you work at that hospital, be sure to schedule your medical crises with your manager.",
            "Similarly, I used to work for a company that had designated types of PTO. You had a certain # of vacation days, sick days, and personal days per year.  \nIf that wasn't complicated enough, they eventually instituted an \"unscheduled instances\" program. If you use a day off or show up late without planning it ahead of time, that's an \"unscheduled instance\". Doesn't matter if it's a 15 minute lateness because of traffic, or 3 days out because you ate bad chili.  \nIf you went over a certain number of these instances, you'd get an automatic disciplinary writeup.  \n\nSo you can probably guess what ended up happening. Whoops, I hit the snooze bar too many times. I'll probably be 30 seconds late so that'll be an unscheduled instance. Oh well I may as well just *not show the fuck up* for 3 days!  \nStill had to burn PTO, but if I'm getting written up automatically anyway I may as well use that time to goof off and/or look for a better job.",
            "I would love to see someone provide a note from a non medical doctor. A Dr of philosophy or mathematics for instance.",
            "I like this, but why are you getting severe food poisoning enough to keep you out of work for a week and you know the symptoms so well?",
            "You’ve gotten food poisoning enough times that you can provide an hourly breakdown of the progression of the illness?\n\nWhat the fuck do you eat??",
            "I don't know where you live, but where I'm from the government reimburses the company after two days of an employee being sick provided there's a doctor's note. So that's why it's basically compulsory to get one (and in most other EU countries that I know of). It helps that the doctor is usually either free or cheap.",
            "I always found it a bit strange that you can miss work for health reasons and not go to the doctor. It might be because here it's the law that you must provide a doctors note. It's because health insurance covers your pay on sick days and the employer has to file a request so they get compensated.",
            "happened when i worked at a different starbucks... i was throwing up but only planned on missing one day due to food safety policies but my manager said i needed a note... and the doctors then proceeded to give me my next 3 work days off... (and my manager actually said she didn’t want my note when i offered it to her 😒)",
            "Fucking hell...\n\nMy job operates on a \"Managers watch your sick leave usage\" policy. I.e. if you're not abusing it then they don't much care.",
            "Food poisoning saps a lot of your energy and vitality! Hopefully the extra 2 days helped get you back to normal.",
            "To be fair that’s not a silly rule at all and it basically single handedly stops people using consecutive sick days just for time off",
            "I hate stuff like that. I missed school for a week because I had pneumonia, as in laid in bed sleeping for about seven days straight pneumonia. I didn’t go to the doctor because I just knew I had it, you know? I also talked to my mom, who has been a nurse for 30 years, and she agreed that, yes, I had pneumonia. I emailed all my professors and let them know what was going on, hoping that they’d be understanding. All of them were except for one. I met with him in person after I recovered, and he was convinced that I was playing hooky. He tried telling me that since I didn’t give him a doctor’s note, I didn’t *actually* have pneumonia, so my absence and missed homework were inexcusable. I ended up dropping the class.",
            "The policy isn't about you. The problem is the grown-ass adults who can't seem to be honest and will lie, lie, lie about being sick. So, since *they* can't play by the rules, we **all** get screwed. This is why we can't have nice things.",
            "As a former small business owner, we eventually had to implement this policy because employees were calling out “slick” and making the other staff compensate for them. It was also the weaker, unethical employees. We just didn’t believe them, but we needed a policy that applied to everyone. It was never meant to be a hassle for the good employees. So, don’t take it personally. The policy needed to be implemented because some employees are unethical.",
            "How the hell does that even work? If I'm sick the last thing I want to do is drag myself out of bed, make myself presentable to go out in public, and sit around waiting for a doctor to see me at a clinic. And if I'm contagious that's not doing anyone else any favors. I go to the clinic when _I don't know what's wrong_ or require some serious meds to fix it.\n\nUnless work's paying for a doctor to do a house call and bring me some chicken soup, they can just fuck right off with that patronizing \"policy\".",
            ">my place of work has this silly rule that if you are going to be out 3 days you have to have a doctors note.\n\nI wouldn't know of a place of work that doesn't have the 3-day rule...it's to prevent pulling a sickie, not to really make sure that ***you*** know you're ill.\n\nI like the MC, but it's pretty common and reasonable to need a note for 3+ days.",
            "I have an employee who calls in sick a LOT. At first, I took his word for it. Then it got excessive and suspicious. That is what these policies are for- the cheaters ruin things for the reliable workers who really are sick.",
            ">if you are going to be out 3 days you have to have a doctors note.\n\n\nI mean, this seems reasonable though. Otherwise you have people abusing the system. Plus if you are sick for that long, generally that means you might need to be medically cleared in case you aren't 100% and either spread what you have or over work yourself and cause a problem for you and your coworkers.\n\n>It's stupid because what is a doctor going to tell me that I don't already know.\n\nYou sound like a stubborn old man.",
            "Is your doctor accepting new patients?",
            "Do you need to bring in an obituary when someone dies? Cause we do.",
            "So where I am doing school we need to do an internship 3 days a week. So when we got sick we also needed to get a Doctors note at the third day. But the thing is that we were only allowed to uave 15 sick days... If we had more we needed to work the time on schooldays after school or on holidays. Most of my class were 16 and the thing is that it is in the social field so out Internships were in schools or Kindergartens. You can probably think of it but when you first enter a place like a Kindergarten where every Kid want so cuddle and snort on you... you get sick fast and often especially when your body is new to it. We also werent allowed to have overtime and we didnt get payed and that for 24h a week. And I saw hoe my classmates needed to do things that an expirienced person should do.",
            "get well soon.  I hate that shit, no pun intended.\n\nI have a strict diet now because I got tired of having to camp out in the bathroom from whatever I ate (that basically was from animal products)\n\nNeedless to say I have not had to get a doctors note.  Military has a medical dept rep on board who verifies trips to the ER and primary care provider, and stuff like that",
            "Every single job I've had, I need a doctor's note judt to have one day off.",
            "I work in retail and my employer doesn't accept doctor's notes as a viable \"excuse\" for missing work. We still accrue attendance points if we miss work for being sick. That said, I was speaking with a co-worker and she was saying something about how my work outsources its attendance junk to another company and if you're sick you're supposed to submit the doctor's note to them. I don't know how accurate this is. I haven't been sick to test it out. \\*knock on wood\\* I do know that I have more points than I'm currently comfortable with and would probably show up to work sick rather than risk accruing more points. I can't afford to lose my job, though I feel awful at the thought of possibly getting a bunch of my co-workers sick if I had to go in sick. :/",
            "A similar thing happened to me a few years ago. I was having throat issues and was out here and there for months. I was having a very rough week and was out for a few days. My boss text me asking what was going on, i explained its my throat other than that idk. He said if you're going to be sick tomorrow i need a doctors note. I went and explained to the doctor i was only here for a doctors note because i need more time to recover. I asked for 1 day and he gave me 3, I'll never forget him!",
            "U get a week for stomach flu?!\n\nWe get 2 days max... and will need to get a reconsultation for an extension beyond day 3. \n\nWe also need a doctor's note for even half a day, and it will count as a full day for most companies where I'm from.",
            "Manager here. We require a Dr note releasing you to come back to work after three days out.  \n\nHR says its to protect us from any communicable disease within the cubicle farm.",
            "I've made two appointments just to meet with my doctor and get a note. After the second one, he told me to just make a phone appointment next time, and he will have a note for me at the desk.",
            "I have really bad migraines that are fairly well managed by medication. I went from having 4/week to 3/month on medication, and the severity decreased a lot. But every once in a while, I'll have one of those \"I can't breathe or blink or think without searing agony coursing through my skull\" migraines; it happens maybe every other month.\n\nEvery time I have to call out because of these severe migraines, I have to get a doctor's note. For a MIGRAINE. I have to go and sit in a noisy, bright waiting room at the doctor's to see the doctor for three seconds for him to ascertain I'm having a migraine, to then go back home - all the while being incredibly overstimulated and in immense pain.\n\nIt's such fucking bullshit.",
            "Now I'm wondering what the overlap between gastroenteritis and food poisoning is.\n\nY'know, you could claim being hung over is food poisoning...",
            "But.. now you use more sick days or PTO... wtf?",
            "I mean, the doctor's note isn't for you to make sure you're sick, it's to have a neutral third party to ensure that you're not pretending to be sick to loaf around.",
            "Most company's have this rule in the US. Confused why people always act shocked when it comes up.",
            "its not a silly rule, its to prevent abuse of sick time. because generally, thew only time you need to be out 3 days or more, is if you have the flu or some shit.\n\nand since you are a 'grown ass man' and you know whats coming, you could have gone to the doc on the first or second day, and gotten the note to cover all 3 days.\n\n3 days is also standard across most job industries.",
            "If every manager just started to believe the word of every worker and how they KNOW their body and stuff, managing shit would be hard. Plus there are procedures for a reason. Besides they gave u first two days off anyway.",
            "Same with me . I'm a medical student and for our clinical lessons we have only a specific number of unjustifiable leaves (excuse me for bad English) . To be exact , we are allowed only 2 days off per semester. Luckily we are healthy and we use them only bec we are bored. \n\nHowever it happened to me to get sick . It was a virus and had some fever and diarrhoea . As OP mentioned it was not something life threatening but I was ultra weak and couldn't visit a doctor. I stayed in bed for a week (5 days ) . Let's do the math : Monday and Tuesday I couldn't get off the bed , Wednesday i felt better and on Thursday I visited the doctor who gave me notice for 2 days (Thursday and friday) . For this 1 day (wednesday) I got into lots of trouble , bec my supervisor thought that I was slacking and I had to contact with the prof so I could replace that day with another shift (ever saw a student attending a night shift ??? ) .",
            "> But my place of work has this silly rule that if you are going to be out 3 days you have to have a doctors note.\n\nThis isn't a silly rule and is a requirement of your companies insurance. It's pretty much a federal standard because all companies require it.....",
            "Doctor's notes are pretty standard in my area if you have to be gone more than a day. It seems like a reasonable policy, so I don't understand the issue.",
            "Sorry I don't understand what is obvious. In my country every employer, perhaps by law, requires a doctors certificate if you wish to call in a sick day form work. So I don't understand what's malicious about this post.",
            "I used to work for a communications company that suggested it would let you take a day or two without repercussion if you didn’t stay out for the full week. But if you took off a day for a bad cold or back ache, came back, and then had a relapse, you would be charged twice! \n\nNow why would I ever just take one or two days off?\n\nAnother co-worker found a shrink who declared that work caused her stress. So she worked a week and took off a week (to recover from the stress!).  Better still, the doctor declared that going fishing relieved stress. So they worked for a week and then went fishing for a week until the bosses found someway to transfer them and be someone else’s problem.",
            "My job also has that three day rule except if you call off for even one day they try to demand a doctor's note when you come back, ignoring the rule. It is how they convince people that don't know better to show up anyway because they can't afford a doctor's appointment. The union will back you up on it but the job never lets new hires know the three day rule and for some reason the union orientation doesn't go over it even though it is a constant problem.",
            "[deleted]",
            "My workplace is similar. We are encouraged to stay home whenever we feel sick not to infect our colleagues. There are even studies (they say) that if you come to work before you are recovered, you end up being unproductive for much longer (plus the risk of infecting other staff).\n\nI don't see what's the big deal. Go to the doctor, get the note, stay home, relax, come back refreshed and be twice as productive. Medical leave is something more or less, all people have to take during the flu season.",
            "I don't know why people hate getting a doctor's note. It's fairly easy to get if you are really sick.",
            "\\> what is a doctor going to tell me that I don't already know \n\nPretty much everything.\n\nOk, so you don't know more than a doctor. You have no clue if it's food poisoning or something more serious. Stop being a fucking clown and go to the doctor if you're sick.",
            ">I know my body a little better than a doctor...\n\n> It's stupid because what is a doctor going to tell me that I don't already know.\n\n> She said, she doesn't feel comfortable saying it was just food poisoning and is going to say it could have been a stomach flu.\n\nThe real takeaway here is that, no, you didn't know more than a medical professional.",
            "[deleted]",
            "Sure pal. Food Poisoning.",
            "The trick is to go in and be so sick they send you home. When you walk in and puke on your boss’ shoes it really sets the stage.",
            "3+ days is an insurance thing. Think about it: if you are out for at least 3 days, chances are you probably were fairly ill or just not well. We either need to make sure you come back only once you are well, or at least make sure you won't get anyone else sick. \n\nAny corporation worth its salt is going to force you to do the same. Sounds like you may be newer to this type of work. Don't worry though, no manager wants you off if they can help. We have money to make, dangit!",
            "LABOUR LAWS OVERHAUL, please.",
            "If that is current policy, there must have been a point in time when employees were abusing their sick time.  I don't see why getting a doctor's note is such a big deal.",
            "\\>  I know my body a little better than a doctor does  \n\ndo you tho\n\nthat's kind of antivax logic here",
            "This shit has always annoyed me also, if I ring up work because im sick, and they ask for a doctor's note for one day off I always tell them if I make the effort of going to the doctor's, the note will be for three days minimum.\n\nIn all my years of saying this, the response is always the same;\n\n\"Forget about the doc note, see you tomorrow.\"",
            "Requiring a doctor's note for a sick day is unreasonable.\n\nRequiring a doctor's note for 3 days is completely reasonable. You should have gone to the doctor's on day one. At least you'd get medicine to help you with the symptoms. Maybe this is the U.S. and you did not want to go because it would have cost you $400?",
            "If a doctors note wasnt required, then what's to stop anyone from just saying \"hey, I'm sick. I dont need a doctor to tell me I'm sick, I'll be back to work in a week I don't need to see a doctor.\" Its silly to think that you're the exception to the rule, OP. It's also so that your place of work doesnt end up getting sued for allowing you to work when you obviously have an illness that you should have seen a doctor for, and you end up infecting people because you thought you were better but you're still infectious. Dont be a fool, go to the doctor. Its required for a reason, and no, you dont know better than a doctor.",
            "Just because you're honest in calling in sick doesnt mean everyone else is. This stops people from abusing their sick leave as well as documentation. It isnt a stupid rule its perfectly reasonable",
            "Don't forget the doctor bill... Make sure they expense it.",
            "congrats! your doctor is awesome!\n\n:D",
            "Most of the companies I've worked for have had a 3-day doctor's note rule. It shouldn't be necessary, but just like warnings labels, there is a reason for it.",
            "The three days to see a doctor rule is not an arbitrary rule to torture you. It is so the employer gets their compensation from your medical insurance or as tax relief once X days per year are full. At least where I work.",
            "To be fair the doctors note is not for you. It’s for the company.",
            "I work in aged care. If we have symptoms of stomach flu. We can’t return to work for 72 hours after our last symptom to ensure we aren’t contagious. As you can be contagious for up to 48 hours after your last symptom with gastro. So I’m glad your dr kept you home a few extra days for the sake of those around you. I have so many horrific flashbacks to gastro outbreaks at work 😩😅",
            "Do you have Monday off too??",
            "Lucky my doctors office is nice if I have a cold or something minor I could just ask for a note and they’d give it to me. I once went in to actually see the doctor bc the receptionist was being a bitch that day and just told the doctor listen Ik it’s a cold Ik what to do I just need a note and that was that.",
            "Unfortunately larger and more corporate companies have more rigid rules about that sort of thing.",
            "Sounds like walmart",
            "3 days seems common, my boss asked for it once",
            "This rule is the law in my country. Stops people taking the piss and using paid sick days for holidays.",
            "Remind your doctor to send the company a bill for the note.",
            "I hate policies like this because if you earn pto then they need to let you use it. Plus going to the dr costs money which some people may not be able to afford at that time. Also, they can’t really verify the info in the note because of health information privacy. Also viral infections just need to be ridden out sometimes. It’s bs infantilization.",
            "Worked in a unionized company providing a product to the military. Our sick policy was we had 4 whole unpaid 'hits' and 3 half unpaid 'hits' per a rolling 90 day period. A 'hit' was an absence, half was a tardy or leave early occurrence. If we had a multiple day absence for illness, we could either take each day as a hit or we could get a doctor's note to tie them together for one.\n\nThat was on top of however many weeks of vacation earned and 4 days of pto per year. Also FMLA for long term or family illness or emergency. And even with all that, people *still* abused it. A few people always cause problems for the rest. \n\nI loved my job. Unfortunately, disability took me out of the work force.",
            "If you're in the US, 3rd day automatically triggers FMLA which requires documentation.  Whether your supervisor wants to or not, they could face legal problems if they don't offer and request documentation.",
            "In the US military you have to go to sick call no matter how sick you are if you’re on duty that day (unless you’re in the ER or admitted to the hospital already), or else you have an Unauthorized Absence which is a big deal. More than a few days UA and you’re considered AWOL (Absent Without Leave) which is even worse. Going AWOL could lead to a court martial depending on how long you were missing. \n\nOne time I arrived on duty with a throat so sore I couldn’t swallow, but sick call didn’t start until after my shift started. Come to find out I had strep throat and exposed everyone at work because I couldn’t call in before going to sick call. Another time I had to stay up after a 12 hour night shift to go to sick call despite puking my guts out at work so I could be excused from the next shift. Good times.",
            "Needing a doctor's note as an adult is the dumbest, most childish shit.",
            "My old job wrote you up even with a doctor’s note. 6 points within 6 months was automatic termination. No call/no show was 4 points, calling off with enough notice was 2, and a doctor excused absence was 1 point. They did not tolerate calling off whatsoever. Needless to say, I found another job.",
            "My work requires a certificate for any time off at all...it sucks",
            "I was sick. Got a note. Still got fired.",
            "In Japan you need a doctor's note to take sick leave, otherwise you have you use your annual leave days to take time off to recover. The doctor's note costs about $40 extra on top of the visit fee. Incidentally I only have 4 sick leave days a year, I took 5 days off with the flu last year and the extra day came out of my annual leave.\n\nMy coworkers have it worse though. It seems there's a cultural expectation to not use sick leave, even though they are entitled to it. One of my coworkers had surgery for cancer, needed 2 weeks off, all annual leave.",
            "I mean I know it's a pain, but I get it. People abuse the system too much and call out for the stupidest reasons. I've called out 6 days in my ~17 years working. If you're actually sick, it shouldn't be a problem to go to the doctors.",
            "I can't remember if this is a state or federal law, but I think they can't require a note anymore. At least they can't in Washington state.",
            "The 3 day doctor's note thing is pretty commonplace in my experience. That said, I think it's dumb too because I'm not going to go to the doctor for a fever or anything like that unless I'm just completely out of commission for like a week and a half, but calling in sick on the third day \"nope we're going to need proof.\"\n\nMy work is extra dumb with this, because sick days come out of my paid time off balance, so it's not like my company is losing anything when I'm sick, I'm just using my vacation days up, which I'm going to use up regardless.",
            "Upvote mostly for a strong first line. \n\nIt should be the first sentence of his biography, or any book really. Any takers?",
            "Where I work you *have* to get a doctor's note every single time you are sick or else it's a no-show. It's such bs.",
            "That's actually common practice where I live. But then again, sick days are fully paid and there's no limit of them (if you're sick you're sick) so maybe this stops people from abusing the system.",
            "Where I live you can only take sick days if you have a note from your doctor so your annoyance makes no sense to me.",
            "of course, HR are incensed that a full 40% of sick days fall on a day next to a weekend!",
            "Pretty much any employer in Australia and New Zealand, which is fine since they’re paying you for the days off, assuming you have the relevant accruals.\n\nI don’t see the issue.",
            "Do you work for the USPS?",
            "Your lucky if i call out sick i need a doctors note fmla to back me otherwize i get demarets and if i get 3 call outs i am up for being fired or not.",
            "\"Silly rule\"? In Belgium I'm expected to bring in a doctors note for any sick time, even if I go home during the day because of a migraine. No doctors note is unauthorised absence",
            "Different countries different rules, but in Germany the employees health care will give the employer something like 30% of the lost wages back......if there is a doctor's note.",
            "I am a doctor and I still have to get a doctor's note if I'm sick on more than one day.",
            "That's harsh... I mean I'm in Sweden so there's definitely some difference, but I need to be sick for two full work weeks before a doctors note is needed. Now, once you've had 4 periods of short term illness tho (dunno their definition of short term) a rehab meeting will be called to try and figure out what can be done to prevent it or if you need any extra aid.",
            "To be fair, requiring a doctors note for 3+ days is pretty much standard. As is requiring one for a single day after a long weekend.\n\nAt least every placed I've ever worked. \n\nJust enjoy the extra two days.",
            "I agree most wholeheartedly with the, \"I am a grown ass man,\" part of this post at the beginning.   \n\n\nThe very idea of having to get a note from an adult with authority, to give to another adult with authority, (the boss), is just another attempt to control people at the level of thought and will.",
            "In my country - Poland - you always need to provide obligatory doctor's note when using sick leave. Employers also have the right to check if you are not faking it.",
            "I was at the doctors getting my note today when I came across this post. Eerily similar situation.",
            " \n\n>But my place of work has this silly rule that if you are going to be out 3 days you have to have a doctors note.\n\ni think this is standard",
            ">I am a grown-ass man, and I can tell when I am sick.  I know my body a  little better than a doctor does in terms of recovery and if it is  something I'm not sure of I will see a doctor.  But my place of work has  this silly rule that if you are going to be out 3 days you have to have  a doctors note.\n\nThere are plenty of grown-ass men who will happily lie for a few days off. Not requiring a doctor's note until day 3 of an absence is a reasonable middleground between \"we trust you to adult properly\" and \"just double-checking you're not taking the piss\". 3 days is a pretty long absence in my experience.",
            "Have you read your work law in your country? It might be in YOUR best interest to go to doctors not as much as companies. It is quite same in my country, but the reasoning to this is that companies (your workplace) is forced to pay (your wage) only for the first 2 days of your sickness. All the other days after that comes from government. \n\nExample, I got a terrible virus and was out for 2 weeks, so it is 10 working days. According to law, my workplace paid for day 1 and 2 i was absent, all the remaining days were paid by government. If i miss 3 days, day 1 and 2 is counted as absent due to health reasons, and day 3 is counted as just absent and won't be paid. Also these day 3's can have a negative effect when you want to leave, or you are fired.\n\nWe have \"free healthcare\" here where I live, so it might be quite different if you are in the US.",
            "In Australia most Chemists can give Dr's Certificates. Beats the hell out of paying to see a Dr because of a migraine.",
            "My company does not offer paid sick leave (though the state passed a law making based on hours worked now).  If I took a day off it was because I was sick, but my boss would still give me grief.  So, if I could come in, I would, I would also make a point of telling my 70 y.o. boss I was contagious and he'd stay out of my office and I'd putter through the day getting almost nothing done.",
            "I got fired because of this recently",
            "You should be able to bill your work hourly for the time it takes to get a doctors note if they are going to require it.",
            "A place I worked at implemented the same rule where after 3 days you'd have to get a note. So everyone I worked with started to schedule the appointment to get there note during work so they'd miss even more work and use even more sick time. The policy was quickly dropped.",
            "I have literally forged doctors notes for this reason. They don't actually care, and if they call to confirm, the doctor can't tell them anything anyways because of medical privacy laws. \n\nThe person that wants the note, just wants to check the box so they can keep their job – just like you do.",
            "The 25th of September I was supposed to get a tooth pulled but they discovered a cyst on the root, and it involved another tooth.  I had taken the 25th off, and they couldn’t do it then, and rescheduled for the next day as I needed anesthesia. I called and my boss was irate because I couldn’t come in the 26th.  When I came in to work the Sunday (my schedule is Sunday to Thursday), my filing cabinet was missing.  He had come in to move it.  So on Oct 7th, I started having dizzy spells, including one when I was driving.  I had a recheck on the teeth the next day and had dizzy spells most of the morning, so I went to the ER, which did all kinds of tests.  Then they kept me overnight.  He was LIVID.  I called my supervisor as soon as I knew I wouldn’t be in the 8th (Tuesday), but when I called back to tell her I was being admitted, he demanded the phone and then demanded to know if I was coming in the next day.  I told him I had no idea when I was getting discharged, so it wasn’t up to me. He literally forced me to say that I would be out the following day (Wednesday), and was cornering me about the next day (Thursday) when I had had enough.  I told him the doctor was there, and that I would EMAIL him if I wasn’t coming in Thursday.  While I was in the hospital, he moved another person into my office space - our most likely to go postal co-worker,\n\nI got a doctor’s note for the 2 days I was hospitalized, and am getting a note for the teeth too, even though notes are supposed to only be for 3+ days sick.  Why?  Because when he forced me to take the Wednesday off, he told me he would notify HIS new boss (whom I haven’t met yet), and HR that I would be out.",
            "im pretty sure that the law requires you to get a doctors note in Germany If you are sick for 3 days or longer so it cant be that stupid."
        ]
    },
    {
        "post_id": "8qjseu",
        "author": "andwhyshouldi",
        "title": "You want me to stop doing your job for you? Sounds great!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8qjseu/you_want_me_to_stop_doing_your_job_for_you_sounds/",
        "score": 15017,
        "num_comments": 213,
        "created_utc": 1528816993.0,
        "selftext": "Background: I work as a front office manager in a client facing position. My primary role is to register clients, do paperwork, and solve any issues related to this. My office is right at the front, so when clients walk in, I (used to) go greet them, direct them to their location for the day, and give them the rules, etcetera. \n\nI have a fellow manager, who also works directly with clients. But he’s a lazy, useless employee, and though technically doing greetings and introductions is his job, I did it for him, because he often couldn’t be bothered to walk a hundred yards to do his job properly. \n\nSo here we are. It’s a busy day. I’m running between welcoming clients, registering them, and sending them off, multiple different parties at a time. There’s lots of people around, one of me, and I’m still working with a ten minute maximum turnaround time, which for my role is very impressive. I’ve got these people in and out as fast as possible, while also doing someone else’s job for them. The other manager is nowhere to be seen until the very end of the day, when he marches into my office. \n\n“What the fuck are you doing? Why are you greeting clients?” And so on and so forth. For a solid ten minutes. He even goes so far as to imply that because I’m a woman, my only role should be doing the paperwork while he does the real man’s work.\n\nI’m so unbelievably pissed at this. I basically ran our operation the whole day while he fucked off somewhere, god only knows where, and he now has the nerve to scream at me. He finishes with a “don’t ever do that again.” First, he doesn’t have any authority over me. We’re of equal rank, with different roles. There was one other manager in the office with me going over paperwork, and he was so shocked he couldn’t even retaliate. I’m two seconds away from taking this asshole’s head off. \n\n“Okay, I won’t.” \n\nI then march out, because things would have gone very poorly if I had stayed.\n\nCue the next day. Asshole manager comes up to me and tries to apologize, while also one hundred percent not really apologizing, at all. He repeats much of the same shit said the day before, and still seems to not recognize the fatal flaw in his plan of screaming at me for doing his job, which is that now he’s gonna have to actually work. \n\nI nod, smile, and fuck right off to my office.\n\nWhich I proceed to not leave for the next eight hours.\n\nI do exactly what my job is. I register clients. I do paperwork. That is it. I can see clients walking into the building, confused, obviously needing help, or expecting a greeting. \n\nBut hey. That’s not my job.\n\nAsshole manager, after his half assed apology, had disappeared again, so I call him down.\n\n“You’ve got clients waiting,” I tell him.\n\nHe gets there, late, and has a horde of angry clients waiting for him to actually do his job. There’s so many of them because he’s late that it’s now his turn to spend the next six hours running around like a chicken with his head cut off, while I have a great time leisurely doing my job exactly to the limits of the description, nothing more. By the end of the day, I’m feeling great, the clients are happy with my work- but the complaints are rolling in for him. He comes in at the end of the day again, obviously ready to yell.\n\n“I had a great day. So much easier to get everything done when I’m not doing someone else’s work for them,” I tell him. “By the way, I had time to process the customer requests for the week since I wasn’t busy greeting. Here’s your complaints.”\n\nAnd I proceed to hand him a very thick stack of complaints concerning turnaround time, confusing directions, lack of space, and so on. Everything relating to his role. \n\n“Have a nice night.”\n\nAnd I leave. Haven’t done his job for him since, and he hasn’t gotten any better at it. It only gets funnier every time. ",
        "permalink": "/r/MaliciousCompliance/comments/8qjseu/you_want_me_to_stop_doing_your_job_for_you_sounds/",
        "comments": [
            "I love reading nice MC stories in the morning at work. It makes me feel I have control over my own life. Gives me hope. Maybe I will have one of own someday. But I dream..",
            "As zesty as that was, I will need an update when things come to a head.",
            "> “I had a great day. So much easier to get everything done when I’m not doing someone else’s work for them,” I tell him.\n\nPerfect slam.\n\n> “By the way, I had time to process the customer requests for the week since I wasn’t busy greeting. Here’s your complaints.”\n\nFinished off with the *coup-de-grace*. Very nice. Perfect MC.",
            "sounds like there should be role reversal. you should get the customer facing role officially (and the pay raise to go with it) and the other guy should get demoted to the paper -shuffler role, since he's pissing off the customers.",
            "Good. Fuck him.\n\nI still don't understand why the hell he yelled at you in the first place. Dude deserves whatever happens afterwards, just **PLEASE CYA** because he might try to turn this around on you somehow.",
            "This is beautiful",
            "Amazing. Very well done giving me the warm fuzzies that someone got stuck doing their own job.\n\nBe sure to late the manager/witness know about the complaints. I will need an update later when other managers get involved.",
            "So how long before he gets in the shit?",
            "I hope he gets his ass handed to him by upper management at some point. That's delicious MC",
            "I was waiting for the nsfw.",
            "This was modern art, to be honest.",
            "Good story! I wonder if it would be better if you two switched offices. Not that I'm trying to defend the asshole, just thinking of what would be more efficient. ",
            "Glorious ",
            "This gave me that warm and fuzzy feeling...",
            "Malicious compliance of this magnitude with **that** amount of karma is my kind of porn. Please post more!",
            "This is what confuses me. If someone WILLINGLY does a portion of my job for me, without being asked to. And it isn't noticed by anyone else, why by his noodle goodness, would I complain? We teach children the  aphorism, \"Becareful what you wish for, You may well get it.\" I guess the guy missed that memo.",
            "If you did any of that good stuff for me I'd by you pizza on Thursday, doughnuts on Friday AND I'd pay your annual membership to the local Y so that you could continuously enjoy those end-of-the-week 'Thank-You' sentiments. Seriously, to Hell with that guy!",
            "Beautiful. Need followup now.",
            "Why isn’t there a receptionist?",
            "I demand more followup",
            "You're an asbolute legend.",
            "I worked as an IT support engineer at a well known global company. The thing is they had no asset management process, a process I had managed before at an insurance company. A very important role if you want to know where all your computers and IT equipment is.\nAnyway in this company new computers were ordered and stacked in an unlocked room in our large office. My desk was outside this room and I witnessed people taking stuff out of this room on a daily basis. The poor lady who ordered the equipment would tell us the new computer for X is in the store room. 9 times out of 10, no computer to be found. \nI explained to my manager what was going on and I was told it was none of my business? So I just let people continual steal computers, monitors, laptops and printers. \nStill baffles me to this day why they let it happen?\nThe best thing about this job I was able to tell them to “shove their job up their ass” and walk out.  That felt great, after four years of hell!",
            "Nice!",
            "This is the justice boner material I come to this sub for.\n\nChrist that felt good to read.",
            "Oh fuck that moron.  Let him dig his own grave.",
            "Keep it up op. If no one is recognizing your hardwork then don't do it.",
            "He loses his job, and this goes into /r/prorevenge territory!",
            "\\> He even goes so far as to imply that because I’m a woman, my only role  should be doing the paperwork while he does the real man’s work. \n\nHe clearly got this part wrong.  What he \\*should\\* have implied is that because you're a woman, you should be having babies, doing the dishes, and making sammiches.  Now get back in the kitchen where you belong!  /sarcasm",
            "Glorious! Now I'm ready to face the day :)",
            "i love reading about this stuff, it gives me hope for my future",
            "I’d love updates on this if you ever have any you’d like to share ",
            "I wonder if he has any ragrets ",
            "Next he will talk his boss into getting a raise because he's 'working so hard' doing his job.  He'll play the overworked martyr, then complain that you have nothing to do by comparison, so he should get promoted or a substantial raise.\n\nNip that in the bud, and EARLY.",
            "Well done! Can we get an update in the future please?",
            "\"and fuck right off to my office.\" So dry and unemotional. I love it",
            "You should get his job as well, and get paid more. You’re obviously way better at it than him 😂",
            "Was anyone else expecting him to get chewed out and fired? That would've totally been the icing on the cake. Way to stick it to the man, OP! ;)",
            "Somewhere sometime a ray of light shines over OP. ",
            "Got to love [work\\-to\\-rule](https://en.wikipedia.org/wiki/Work-to-rule). Always the basis of a good story in this sub.",
            "This is perfection.",
            ">he often couldn’t be bothered to walk a hundred **yards** to do his job properly\n\nI really hope it is 100 feet because I certainly don't want a job where I have to greet clients and walk 100 yards each time.",
            "At first I was a little upset you didnt retaliate against your jerky co-worker for yelling at you....but I think in the end you played it perfectly.  well done.  ",
            "He got crushed!",
            "!RemindMe 1 week",
            "Nice, go you!",
            "That's nice and all, but take care of keeping track of how well the hotel is doing. If customers stop going there because AM can't be bothered to do his job, corporate could decide to close it down.",
            "I wonder where he gets off to? Is he meant to be stationed at a specific spot?",
            "Why is his office a football field away? ",
            "Username checks out.",
            "He deserved that for being that rude. Although, it sounds like you two may need to swap offices? Not sure about the dynamic there.",
            "So, when does he get fired and you add 90% of his salary to yours? You should talk to your boss and make that offer, that everyone at the firm who does work would be better served in that situation.",
            "Ahhh, very cathartic. Good on you!",
            ">client-facing position\n\nohgodwhy.jpg",
            "What spurred the initial aggravation from him?",
            "OP is a receptionist",
            "~~I know it is mansplaining but your behavior is classic women behavior that keeps them down.~~ \n\nHe is not going to learn. He doesn't know you are equal rank. In his eyes, you are his subordinate. MC - a form of passive aggressiveness will not solve this issue. You need to tackle it more directly. \n\nTalk to him calmly and professionally. Assert that his absence is lowering your productivity and he is equal in rank with you, with him being the greeter. Suppress him. A person like him cannot be handled in any other way except direct confrontation. Be rude if you have to. If \"things have to get ugly\", let them. \n\nIf you can't do this, talk to your senior manager. You have to confront him.",
            "This story has more holes in it than a MRSA clinic.",
            "Passive aggression rules! Great job! Not really! Pay gap btw!",
            "I bet my entire life's savings that \" to imply that because I’m a woman, my only role should be doing the paperwork while he does the real man’s work.\" didnt happen and OP is just trying to cause sexist grief where there isnt any. ",
            "\"Flawless Victory!!!\"",
            "TLDR?"
        ]
    },
    {
        "post_id": "jcc520",
        "author": "RamboRobertsons20",
        "title": "You want me to pour Cold water to melt the ice?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/jcc520/you_want_me_to_pour_cold_water_to_melt_the_ice/",
        "score": 15013,
        "num_comments": 377,
        "created_utc": 1602862942.0,
        "selftext": "Backround: When I was 16 while working as a bagger in a grocery store we got a new manager. We will call her Elisa. Elisa had a very \"I'm right, you're wrong\" attitude. She didn't care if she was in the wrong but you better do what she told you until she changed her mind. If you spoke out against her,  you would end up on her shit list and she would do her best to get you fired. \n\nStory:\n\nGenerally the bagger is the lowest position in a store. We collect carts from the lot, put away items, stock, clean, bag and some how we are always at fault.\nCue Elisa. \nI had an early shift. Clocked in, started morning duties and I heard on the loud speaker \"OP please come up to aisle 6 (Frozen isle, seafood).\n\n(Edit: . This is an oval shaped, open air freezer at the end of the aisle. 6 compartments, about 20ft long in total. 1 compartment on each end, 2 in between on each side. About 2 ft deep under the aluminum panels with fans facing out from the center. Drainage in the bottom. Freezing air blows out vents onto the merchandise above. Drainage compartments eventually clog with ice overtime.)\n\n\nI came in and Elisa gives me a smile and asks me to grab a bucket and scrub brush. We (I) was going to pull up the bottom aluminum floor panels at the bottom of the freezer and melt the ice that accumulates around the fans. It should take no longer than 30 minutes she said. Make sure you use cold water since we dont want the temperature sensors to go off(Anything over 42F will set them off and corporate would call).\n\nI say, let me make sure I have this right. You would like me to fill the bucket with cold water and pour it on the ice in the freezer while the freezer is at 19 degrees F? \n(*Stares at me like I'm stupid*)\n\nI inform her it isnt going to work. The water will freeze and just create a mound of ice. I suggest using hot or practically boiling water while watching the temperature . Elisa gives me a firm No and the threat of writing me up if I disobey. \n\nThe start of MC begins. I've already figured that no matter what I do I'm likely to be in trouble. To get the water I had to fill it in the Meat dept sink. The Meat manager asked what I was up to and I told the story with all the details. Meat manager is scratching his head and he heads over to call Elisa. She confirms and I hear a bit of arguing. Meat manager comes back, gives me a smile and says to do as I was told. He'd back me up.\n\nSo for the next hour I must have put about 200 gallons of cold water onto the the freezer fan (I switched from a 2glln bucket to a 5 glln). I stopped and moved to the next fan each time the compartment was to the brim with ice. I got 4 compartments done before she came to check on me.\n\nInstant rage. Elisa went from white to red real quick. It was also the first time I've heard a manager cuss. \nWhat the duck is this? How the duck could you screw up something so simple?\"said Elisa.\nI said, I did exactly what you told me to. I took buckets of cold water and poured them on the ice around the fans. \nRight as she said she was going to write me up, the meat manager came over after hearing her cussing.\n\nThe meat manager saw the ice filled compartments and mentioned that i should have used *HOT* water..\nThis.. sent.. Elisa.. over the edge. UP TO MY OFFICE NOW! YOU'RE BEING WRITTEN UP!\nThe meat manager did what he said he'd do. He stuck up for me. Meat manager mentioned that he double checked with her what she wanted me to do and I was was complying with her instructions.   \nShe went silent for a moment and it was like her head was going to pop off. She just took a deep breath and muttered out, Fix it, and walked away.\n\nThe meat manager gave me an extended industrial hose hooked up to the hot water. The water in meat dept can get up to 140 degress F to kill bacteria. The ice was gone in 15 minutes and since apparently the freezer temperature measured as a whole it never went above 34 degrees F. \n\nElisa avoided me for over a week afterward. I knew I was on her shit list and for the next 8 months she tried to write me up for the most pitiful reasons.. I eventually was given a written warning for leaving 9 minutes early with approval from the front end manager that was friends with Elisa. At that point I knew I would get fired for crap eventually and I quit without my 2 weeks.",
        "permalink": "/r/MaliciousCompliance/comments/jcc520/you_want_me_to_pour_cold_water_to_melt_the_ice/",
        "comments": [
            "Meat manager sounds like a good guy, he really stuck up for you there!",
            "This is why I like my manager and boss. While we don't always agree, they'll listen when I have thoughts about what they ask me to do, and more often than not, they either realise their \"D'OH!\" moment or point out the flaw in my logic in a conversational way.",
            "Ha! That's a fun one. Great MC.\n\nIf I may be so bold: \"Que\" is spanish for \"what.\" \"Cue\" is what you are looking for here. Then there is \"Queue,\" which is a line. Man I hate the English language sometimes.",
            "Revenge is best served cold. Glad you got out of there.",
            "Baggers ALWAYS get shafted \n\nI remember one day there were 5 checkers and 3 baggers. Each bagger had a 30 min cart shift. So of these 5 lanes, really only 2 had baggers.\n\nSo I'm bagging, finish, move to another checker and start bagging. My manager comes up and says \"stop moving around. You need to help\"\n\nSo I stand there and bag for one checker. As this happens another line piles up because all checkers are also bagging.anager sees the line and tells me \"do your job. Move around. Don't just stand there\"\n\nI shit you not I was told to stand still then move about 5 times in that shift. Like fuck me dude maybe if you got as many baggers as checkers this would never be an issue",
            "Just because you work a minimum wage job does not mean you are worthless and should allow others to abuse you. Leaving that job is a good step in the right direction, but if you can next time try to alert HR about the hostile work environment that boss is creating.",
            "Bc you were in a freezer talking about ice and stuff I kept reading the name as Elsa until the last mention and I thought it was a typo. Upon scrolling back up I find my brain is the typo.",
            "You said you put 200 gallons of water on the freezer fan. Is this an exaggeration or did you miss type? \n\nYou have had to make like 40 trips with a 5 gallon bucket.",
            "Good for you, it can be hard leaving the security of known job :) \nSounds like she was one of those “fail upwards” types... as if working retail wasn’t bad enough, it’s seems to be absolutely infested with this type.",
            "All grocery store managers have this weird fucking pride thing going on. Perhaps since they'll never amount to more? Not sure",
            "So she was having you do shit work (wrongly) so she could get a bigger bonus. Those freezers have defrosters in them. If there is ice built up on them, they are in need of repair.  Repair costs are often taken out of any surplus the store generates, which is also where the manager's yearly bonus comes from.",
            "The Meat Manager knew a MC was coming. What a legend 😂😂",
            "...isnt this the time, when you ask it to be written down, or you will quit on the spot?\n\n(Then after they make  scene, you show it to higher ups, hopefully together with recordings of said scene?)",
            "Ugh, this is so infuriating. If I was in your shoes, and if I were brave, I’d have nodded my head and done the exact opposite of what she said when she wasn’t looking. This actually works when dealing with people like this.",
            "I know its petty but quitting without the two weeks always feels great to those shit workplaces, leave them high and dry no regrets.\n\nAlso, tsk tsk OP she said it shouldnt take 30 minutes and you said you poured water over the fans for the next  hour,  shocking effort :p",
            "This is what happens without science being taught in schools",
            "This \"written up\" shit you guys to over there in US sounds so... stupid.",
            "I would have shot the hot water on the thermostat intentionally, just go get corporate involved.",
            "You quit with no notice?! That is COLD!",
            "I wish people simply wouldn't put up with crappy managers. Treating people with such disrespect simply because you have the power to deprive them of their livelihood should not be tolerated.",
            "Honestly I probably would've done the same as Elise and suggested cold water, since I was always taught that hot water, especially boiling water freezes faster than cold water (Mpemba Effect).",
            "And the proper way to do this job would be to move all product to the store walk in freezer. Call HQ and let them know you are taking the unit out for maintenance.  Turn off the fans. Flush with hot water. Wash out with soap and hot water. Dry, restock, turn back on.",
            "This may be counterintuitive to some, meat managers usually make more money then the grocery store managers. Meat Is while people come into stores you do not want to piss a meat manager off.",
            "You should have made a case for retaliation and hostile work environment!",
            "This reminds me of Starbucks.\n\nTo make cold brew iced coffee, they need water that is basically at refrigerated temperature, so that there is little to no fluctuations as the coffee is transferred into the fridge to brew.\n\nCouldn't possibly just put water in the fridge for a few hours.  That'd be way too simple.\n\nSo what do they do instead?  Why 3.5 L of ice, 4 L of water.  Whisk until the water is cooled and the ice is gone.\n\nRegularly I spent half an hour to an hour whisking ice.  Just.   Using kinetic energy to melt ice cubes, really.\n\nDifference is that SBux is a cult, and this had come down from corporate.  So instead of getting angry, the managers would just be so happy about how nice it is to send somebody to whisk ice.\n\nSometimes their eyes betrayed them, and you could tell that they hated sending somebody to whisk ice, hated losing the labour on it.\n\nThey could never say that, though.\n\nStarbucks says jump, you don't even ask how high if you're a supervisor or a manager.  You just start jumping.",
            "I was kinda hoping it was going to be your boss demanding that you pour hot water on her frozen over windshield.",
            "Talk to your refrigeration techs and ask them why the drain heat trace isn't working...",
            "It's a shame managers like this don't have more accidents.",
            "Love this meat manager",
            "What you've done was really cool since it was solid evidence! I am glad it ended heartwarming.",
            "Aluminium*",
            "Aluminium*",
            "Reminds me of the time my old boss told us to use drinking straws to siphon fuel from one generator to another. She was absolutely livid when some guys left the field in order to grab a rubber tube from the shop instead of using her ingenious straw technique.\n\nIt is probably worth mentioning that we didn't have any straws either.",
            "Lmao I hope that dumb bitch still works at a grocery store 😂😂😂",
            "Now you have more power being a customer!",
            "Holy shit, was Elisa's last name Ratched? How can a mere grocery store manager be that power-mad?",
            "[deleted]",
            "Aluminium*",
            "Always get this shit in writing and signed.  At worst they will give you the ammo you need to defend yourself.  At best they will realize how fucking stupid the are and fix the order they've given you.",
            " i've worked many grocery store jobs and somehow meat dept managers are almost always great people",
            "Ugh still doubled your work and then made your life miserable",
            "Even though you called her \"Elisa\" I just kept imagining a mad Elsa in a manager outfit. The ice only reinforced this",
            "Where did a the melted water go? I'm imagining a flooded freezer section",
            "This lady is unreasonable and crazy, not to mention she thinks you can melt ice with cold water",
            "Just FYI, most hot liquids freeze faster than cold ones. Freezing isn't just dependent on temperature; the molecules of the liquid need to be in the right orientation in order to freeze, especially water. When molecules are \"hot,\" they spin fast; the hotter the matter, the faster the spin. When water freezes, [the molecules need to be in a specific pattern to lock in place](https://lh3.googleusercontent.com/proxy/n4ycXpWyaRgqqOnXX2tcVdLu3ycnh3KUOXfIow4VSFM_m0vDDbuPJaZwrw23238jTL_fuRZaBMhMyQDqydkHMXW3kZ2E3KLp2HvCnPb-Bj1ZnaCoqw2Jr3hT3KxPHIgvlPDj); they can get into that pattern faster if the molecules are rotating faster. \n\nIt's also why you can use cold water to clear ice on your windshield in winter, but not hot water. The cold water molecules try to bond with the water molecules in the ice, but it stays the same temperature; the liquid molecules pull the ice molecules apart, and the ice will just slough off without damaging the glass. Hot water will make the glass expand; it expands too quickly, and the result is a crack as the glass molecules try to move and rotate with the increase in temperature. \n\nThe way this should've been done was to clean each fan step-by-step, then move on to the next fan. Your manager didn't tell you this, so it's mostly her fault, but for the future try this: pour cold saltwater on the fans, brush the ice off, and quickly dry them the best you can before new ice builds up; maybe even do this process for each individual blade to keep the ice off as much as possible. I haven't worked in a grocery store or with big freezers like this, but I'm a science teacher so I know the physical properties of water like the back of my hand.",
            "f*ck /u/spez",
            "you do know that if you put cold water on ice, it still melts the ice..?? smfh",
            "Aluminium*",
            "Aluminium*",
            "Aluminium*",
            "Aluminium*",
            "Aluminium*",
            "Aluminium*",
            "In this situation, yes hot was the way to go, however if you are trying to melt, say an ice block in you kitchen sink, cold really is the way to go. Cold will melt the ice faster than hot. Again, in OP’s situation hot was correct (hvac tech here) but in general cold is better.",
            "As a European to me the concept of not bagging my stuff myself but have employees do it is pretty wild..",
            "fact here: Boiling water turns to ice faster than cold water.\n\ntry it if you wanna\n\nproof:[https://www.youtube.com/watch?v=pTf7X\\_COAvM&ab\\_channel=NickSchrader](https://www.youtube.com/watch?v=pTf7X_COAvM&ab_channel=NickSchrader)",
            "Why do I get the feeling I’ve read this before",
            "I hate to tell you this, but you're more likely not to go over 42 degrees if you use cold water.\n\nI do custom installation of lots of different things, and my Dad's being an engineer helped me understand A LOT of stuff. Let me comment.\n\nIt sounds like Elisa was more afraid of EVER going over 42 degrees than she was of taking a long long time to melt the ice. Her method is much more likely never to trip the alarm than your method. She takes this conservative approach to ENSURE no alarms.\n\nYou, on the other hand, make the assumption that you understand the sensors and the alarms and you assume that if you pour a lot of hot water in, you can somehow know FOR SURE that the alarm won't go off.\n\nBut if you pour, say 150 degree water onto the ice and you haven't noticed there's a temperature sensor one inch down in the ice at that spot, you might easily raise that sensor above 42 degrees even though almost the entire rest of the cooler is solid ice.\n\nSo... she makes assumptions, not knowing everything about what she's doing, but using a method that won't cause an emergency alarm. You make assumptions, not knowing everything about what you're doing, but being pretty damn sure everything will be all right. You'll probably be okay. She'll probably be okay.",
            "Aluminium*",
            "Aluminium*",
            "Aluminium*",
            "Hot water freezes just as fast as, if not faster than, cold water so something doesn't seem right here.",
            "[deleted]",
            "Just for reference, cold water will melt ice, but it’ll take a while.",
            "I’m really bummed this didn’t have a worse ending for your manager. I really wish corporate would have been called. Sorry OP ;(",
            "Is there no one to report this bitch to? She is obviously horrible at her job, why did you not find her boss and just tell them what happened? If I had a manager like this I would be working my way up the chain to make sure she got fired.",
            "Oh my god this gave me flashbacks to my bagging days at good ol fucklix. I too had an unbearable bitch of a manager. My hair is naturally spikey and every week this woman would tell me I need to fix my haircut because it’s a “fad” hairstyle...I of course have no solution unless I wanted to gel my hair down to make this dumb bitch happy. I would try my hardest to work around her schedule until the best day of my life happened. Dumb bitch got knocked up by the meat manager and had to transfer. I was then blessed with one of the best managers I have ever had the pleasure of working with.",
            "Now I'm wondering if it's actually physically possible to melt the ice with cold water in 30 minutes. Theoretically it should be possible to melt ice with any temperature water above freezing, but the cooling coils are likely still operating at sub-zero temperatures which complicates the situation. Perhaps you might be able to accomplish it with a cold water hose, but not by one-man bucket brigade.",
            "Now I'm wondering if it's actually physically possible to melt the ice with cold water in 30 minutes. Theoretically it should be possible to melt ice with any temperature water above freezing, but the cooling coils are likely still operating at sub-zero temperatures which complicates the situation. Perhaps you might be able to accomplish it with a cold water hose, but not by one-man bucket brigade.",
            "Now I'm wondering if it's actually physically possible to melt the ice with cold water in 30 minutes. Theoretically it should be possible to melt ice with any temperature water above freezing, but the cooling coils are likely still operating at sub-zero temperatures which complicates the situation. Perhaps you might be able to accomplish it with a cold water hose, but not by one-man bucket brigade.",
            "I wish this had /s at the end.",
            ">The water in meat dept can get up to 140 degress F to kill bacteria.\n\nOnly some bacteria would be killed, and it would take several hours.",
            "No TL;DR;?! 😒",
            "Now I'm wondering if it's actually physically possible to melt the ice with cold water in 30 minutes. Theoretically it should be possible to melt ice with any temperature water above freezing, but the cooling coils are likely still operating at sub-zero temperatures which complicates the situation. Perhaps you might be able to accomplish it with a cold water hose, but not by one-man bucket brigade.",
            "Where did those hundreds of gallons of water go?",
            "Ha! Great story. \n\nFun fact: 130 degrees F won’t kill bacteria.",
            "I appreciate clerk helpers. Great MC!",
            "In my experience, meat managers are always swell people! I hope the \"Eliza\" I work with can get some MC soon too!",
            "Authoritarian shitbirds. Authoritarian shitbirds everywhere.",
            "Why not complain about her behaviour to the higher authorities?",
            "I wonder what the duck her problem was.",
            "It's a throw away job, never hesitate to throw it away.",
            "Sue them.",
            "Elisa demanded a meating with the manager.",
            "So you can get fired for nothing and she doesn’t have to really have an excuse? Still can’t wrap my head around it",
            "How dumb can someone be....I'm sorry you have to deal with so much stupid",
            "I’m just here to say I had a cousin named Elisa who actually changed her name legally to Elise, because “people just say that anyway, Elisa isn’t a real name.” I was just excited to see it haha."
        ]
    },
    {
        "post_id": "asi9t3",
        "author": "FBomb2F",
        "title": "Don't ask an Owner Operator for his bosses Phone Number.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/asi9t3/dont_ask_an_owner_operator_for_his_bosses_phone/",
        "score": 15013,
        "num_comments": 376,
        "created_utc": 1550626860.0,
        "selftext": "So I drive an 18 wheeler. Not only that, but I own my truck and my business.   \n\n\nOne day while coming into Laredo Texas, I was in the turning lane for my exit and this car whips out in front of me. Not really having enough room to stop, I tuned onto the shoulder, threw on the air horn (which is extremely loud when you're next to the truck) and stopped right beside the guy.   \n\n\nHe proceeds to get out of his car with his phone and starts taking pictures of my truck and plate. By this time the light had turned green so I gave him a few short horn honks to basically tell him to get going. He then beats on my door, so I roll my window down and he starts screaming about his ears hurting and how I'm damaging his ability to hear. He then demands that I give him my bosses number and my Drivers License Number, so he can call it in and report me and \"Have my job for this.\" And he proceeded to move his car to the shoulder and backs so close to my bumper, I couldn't get around him.  \n\n\nI kind of smirked at him and told him he didn't want to speak to my boss because he's is a short tempered man and that he wouldn't like what my boss would have to say about this issue, but he insisted that he speak to my boss. I also told him if he wanted to call me in, all he'd need was the numbers on the side of my truck since it's assigned to me (considering I only own one truck, you can imagine what I would assign my truck number to be)   \n\n\nI gave him my cell phone number and watched as he laughed while speaking each number as he dialed. I see his number pop up on my phone mounted to the windshield (he couldn't see it from his angle) and tried to hold in my laughter. I let it right for a minute and he's getting impatient, the whole time traffic is going around us. I finally picked up the phone and answered it. \"\\*Insert Company Name Here\\* Transport. How can I help you?\" His face turns beat red.  \n\n\nHe proceed to yell at me some more and tells me it isn't over because now he has my number (yeah dude, so do about 100,000 other people. So what?)  \n\n\nA week later I get a phone call from a number I didn't have saved in my phone, I had forgotten about the incident but thought it might be a broker, or a customer. I answer the phone and this lady chirps up. Turns out it was his mother and she wanted monetary compensation for her sons troubles.   \n\n\nI asked if she knew what had even happened and she tells me some story about how his bumper was damaged by my truck and that he was scared to talk to me because me driving an 18 wheeler was intimidating to him. Being a smart owner, I have a camera in my truck, and I dump all my trucks footage onto my hard drive, so I asked her if she could receive videos over email. She said sure but wasn't sure what I was about to send her. I spend a minute or two looking through the hard drive on my laptop and find the video of the incident and send it to her. While still on the phone, I can hear the audio playing as she watched it. Her tone changed in an instant and I heard her put the phone down, and all hell broke loose in that house. There was Spanish screaming, things being thrown, and lord knows what else going on. It reminded me of that movie \"A Christmas Story\" when Ralphie's mom calls that lady about the curse word and hears the apocalypse on the phone. Yeah, it was kind of like that, but in Spanish.  \nShe then comes back to me and very kindly asks for 2 things. 1. She asks that I forget she called and act as if this never happened because she was embarrassed to no end. and 2. If I could delete the video of her sons idiocy. I told her that number 1 was fine, I could do that. But as far as number 2, I would not delete the footage, but the only way anyone other than me or her would see it is if it was needed for a court case. She bid me good day and hung up the phone.   \n\n\nTL;DR - Don't ask for an owner operators phone number. It could land you in serious trouble with your mother.\n\nEdit: THANK YOU ALL FOR THE GOLD AND SILVER. You all are awsome!",
        "permalink": "/r/MaliciousCompliance/comments/asi9t3/dont_ask_an_owner_operator_for_his_bosses_phone/",
        "comments": [
            "You heard a flip flop getting tossed around like a shiruken up in that house..  he dead.\n\nEdit: Thanks for the silver and gold, nothing like a mother's true love to bring us all together!",
            "Am I the only one wondering why the guy made his mom make the call?  He was too intimidated by a guy who drives a truck so he makes his mom call?  That's some weak sauce.",
            "It's LA CHANCLA! \n\nYeah, that dude got beat with a sandal.\n\nObligatory edit: Yay silver! (Seriously, I've never been gifted silver! Or any Reddit metal..Thanks guys!!)",
            "Call the mom back and offer to send her [The Mama with the Chancla](https://www.youtube.com/watch?v=t8c8aO87ZmU). Sometimes the [original](https://www.youtube.com/watch?v=CMij9AKLvog) is better. ",
            "Ha I’ve heard a lot of these from owner ops I work with. Last week a driver showed up in McAllen for my load, customer never said it would take 6 hours to load, and never said they would ask for the driver to help load it. Owner op called me up and asked me wtf was going on, I had another load for him so just told him to grab the other and I’d get him det pay for his time. He started leaving and after my client trying to call his company, which was only him, the client called me thinking I’d set him straight and keep him there. I told them the bill for 4 hours detention and hung up. Sent the invoice shortly after. Can’t screw with a drivers time like that. I’d rather lose one client than a reliable driver. ",
            "Included LPT: get a dash cam. How are these things not standard equipment already?",
            "The TLDR was my favorite part.\n\nEdit: To clarify, it was a good story, but the TLDR summary was excellent.",
            "I'm a manager and normally have a couple of guys in vehicles out on the road and every now and again I'll get a phone call regarding their driving. I always respond with something along the lines of \"Right! That's it! That guy was on his final straw with me and as soon as he walks back in the door here he's fired!\" ... 9 times out of 10 they back down and apologise and give you a more of a truthful version of events.",
            "Wow, justice served with madre realizing just how much of an ass her son is. Awesome story, thanks for sharing.",
            "[deleted]",
            "My ex is a trucker and I can not believe some of the crazy shit that goes on. \n\nThe biggest was a 16 year old who should have been in school but instead was busy speeding down the turn lane, which landed him some tire marks on the side of his Audi when a car had to audacity to try to make a turn in that turn lane. Officer and daddy are bffs though so that landed the trucker in court. \n\nJudge wasn't so keen on the 16 year old skipping school and trying to get out of damaging the Audi. Officer wasn't so keen on a stinky ol' trucker being right. After several months of harassment, it ended with officer not being allowed to pull over mr trucker ever again.",
            "How dare you use your truck horn in an entirely appropriate manner! It was loud!! ",
            "Good that your boss backs you up on that!",
            "My father is an owner operator as well. 7 car hauler. He gets a lot of angry, stupid people who think they can circumvent him and get to \"the owner\".\n\nCustomers demand their cars days early. When they call his number, given to them by my mother, who does dispatch, it is quite a treat to hear him lay into them for harassing my mom over their entitled asses.",
            "OP: I have a video of someone doing something stupid and I'm **NOT** going to post if for your amusement.\n\nThe Internets:  \\*aghast ",
            "Every year, on the anniversary of that event, he will suddenly be sent flying by a divine sandal",
            ">There was Spanish screaming, things being thrown\n\nI've seen enough posts on Reddit to know this was none other than the infamous \"la chancla\".",
            "Gotta love it when a grown man catches the chancla.\n\nIn case you're not familiar, while white people make you go to your room to wait for the belt/spoon/spatula (assuming you're not switch folk), asians throw a barrage of verbal and possibly physical violence, black people smack with an open hand (unless they're switch folk), and Indian fathers throw shoes, Hispanic mothers whup your ass with a flip flop, because it doesn't leave marks. ",
            "He. Called. His. Mother. \n\nThis was an adult?",
            "Nothing's more terrifying than a pissed off hispanic mother with a sandal. ",
            "from what i've seen, in 90% of cases the trucker isnt at fault. Its some fuckwit in a small ass econobox that pulls up in front of the trucker/brake checks/doesnt seem to see the HUGE ASS TRUCK. Then tries to have his ass and money for \"compensation of acute stupidity.\"",
            "Ah, good.  It's Mr. Truck Driver, and he's an owner-operator, to boot.  I got a few things I've been wanting to say to you.\n\nFirst, thank you for not mowing down all those a-holes in tiny cars that pull in front of you so closely that you can't even see them.  They're brainless twits, but their families would miss them none the less.\n\nSecond, I'm really very sorry about all those vehicles riding bumper-to-bumper at 70-80 mph, ignoring your signal to change lanes.  They are playing ME FIRST like five year-olds, not realizing that they're in public, at your place of business.  I would like to send a video of their behavior to their ~~mothers~~ insurance companies.  Wouldn't it be nice if we all had to have *How's my driving* stickers to qualify for insurance?\n\nThird, thank you for hauling our *stuff* all over the country.  Few of us would have jobs or even be able to grab whatever we needed or wanted at a store, without you.  Dad always said, be nice to truckers. You see a bunch of them, it means we can all find work and food.\n\nAnd man, there's a bunch of you out there right now.  Good to see.  I'll be ~~flashing my brights~~ **dimming my lights** to let you know your six is clear to move over; I'll move smartly past you so you know where I am, and I'll maintain speed and heading when in front of you, so you can anticipate me.\n\nI really appreciate you, because I was brought up right.  So, thank you, for everything.\n\n*Edited per Mr. Truck Driver and dad.  No flashing brights.*",
            ">  While still on the phone, I can hear the audio playing as she watched  it. Her tone changed in an instant and I heard her put the phone down,  and all hell broke loose in that house. There was Spanish screaming,  things being thrown, and lord knows what else going on. It reminded me  of that movie \"A Christmas Story\" when Ralphie's mom calls that lady  about the curse word and hears the apocalypse on the phone. Yeah, it was  kind of like that, but in Spanish. \n\nI'm laughing so fucking hard I got a stitch in my side. The mental picture of this is just so bloody funny you have no idea. Thank you for making my day!!!",
            "[deleted]",
            ">considering I only own one truck, you can imagine what I would assign my truck number to be\n\n42069?",
            "> But as far as number 2, I would not delete the footage, but the only way anyone other than me or her would see it \n\n... Inserts video here... \n\n> is if it was needed for a court case.  \n\nNow that would be funny.",
            "/r/screwyoublessthem\nBless that driver's mom! ",
            "I am quite impressed.\n\nI’m also impressed at you being an Owner/Operator. That’s some fucking awesome stuff. Good on you.",
            "Wait, how small was this video file that you could just quickly upload it and have her download it without breaking attachment limits?",
            "Was born and raised in Laredo and I believe you. Everytime I go back to visit that piece of shit city to see my family my stress goes up just dealing with those idiotic/selfish drivers. Good on you for putting these idiots in their place.",
            "As someone who subscribes to multiple dashcam channels on youtube, and who greatly appreciates Instant Karma type videos, I'm a little sad panda that you won't share the footage.  But good on you for having your ass covered. ",
            "I definitely would have been honking with that guy right beside the truck til he got it through his head that y'all aren't the ones to mess with.",
            "*beet red :) ",
            "This was as delicious as that idiot's mom's cooking probably is.",
            "Oh boy, Laredo Tx. Where inbreeding is *secret*, and con artistry is everywhere.",
            "X-post to r/truckers",
            "This is beautiful. Thank you.\n\nI'd love to see the video, but you can't break your promise to that poor mom, so I won't ask. Wouldn't want to bring her wrath upon you ;)",
            "Lesson learned buddy — man, when my English speaking mother slips into Spanish… I know I’m in big trouble!",
            "Story just made me picture [this](https://youtu.be/ihpe07LoOx0) from mr deeds.",
            "How old was this guy? He got his mom to call??? ",
            "Post the video! you don't owe the kid or the mother anything. ",
            "> he then comes back to me and very kindly asks for 2 things. \n\nHa, this reminded me of a story my mother once told me. She was a teacher in a lower middle class urban neighborhood. Many of the parents were hard working first generation immigrants and wanted their children to succeed. Nevertheless she would occasionally have to deal with parents and their misbehaving children.\n\nOne day a parent came in for an appointment after school very upset his 'Darling' was failing. My mother opened her grade book and second book where she kept notes for herself to remind her why she gave a failing grade/disciplined a student (middle school, 120+ students for 40 min a day) and showed them to the parent while explaining in detail about what had been going on. He very quickly calmed down and basically said: \"Thank you teacher. i hope you have a good evening. I will have a good evening. 'Darling' will NOT have a good evening.\" \n\nNext morning a very remorseful 'Darling' came in, apologized and basically behaved the rest of the year. \n\n&#x200B;",
            "I also drive trucks and buses. I won't do a job without the camera. I have a Garmin GPS with camera with a 64 gb memory card that I take with me when I drive for someone else. I put it in the windshield before I even move the vehicle to inspect it. A lady in Miami hit me by trying to move out of the way in an intersection while I was making a turn, I was close to her but wasn't going to hit her, but she was scared and hit the gas in reverse. She had forgotten she had cut her wheel to make a turn and so in reverse she went right into me. She said it was my fault and called the police. We waited over an hour for them. When they arrived they talked to her first. Then the police came over to me saying it looked like I hit her and the lady claimed she was stopped the whole time. I would have been at fault if it weren't for my dashcam. I told them I had video, they watched it, then I told them I didn't want to pursue anything. My vehicle barely had a scratch. They then proceeded to tell the lady to go home. ",
            "Thankyou for this, you have turned a really crappy morning around for me, this is hilarious.",
            "im actually from laredo, and my best advice is to always have your camera recording when you're here. if you can get your hands on an upgrade or a better camera go ahead and do so because the traffic here is terrible, and on top of that people here in my town don't follow the traffic laws. stay safe out there!",
            "I've heard you should never anger a Hispanic mother.",
            "You should put it up on r/roadcam ! ",
            "I fucking loved this so much. I had a client once (I worked at a non profit) who had come to my office, fresh out of jail looking for someone to help pay his rent. I didn't have the money at the time, and told him so. He keeps insisting that I have the money until I use one of my lines... \"if you have $0 in the bank, can you pay your rent? No? Well, neither can I, because I have $0 in the bank right now\". (We would only get rent money MAYBE once per year). He gets pissed all to hell, screaming, calling me awful names, and pitching a seriously scary fit. My co-workers from another department had to call the cops on him for me. He sees them pull up and runs out the other door still screaming profanities at me and slams my door. I then find out that his mother is one of my favorite clients (they had different last names, so I never put it together until a co-worker told me) so I literally did call his mother on him, because she was an amazingly sweet, SUPER Southern, black momma. She loved me and I loved her just as much, we even exchanged Christmas gifts every year. She was absolutely appalled to hear what all he said and how he acted. Next thing I know, he and his momma are at my office door, I go let them in and she is dragging him by the earlobe and throws his head towards one of my chairs for clients and starts tapping her foot. He gives me a dirty look. She slaps him - HARD across the face. Taps her foot again. He looks up sheepishly and apologizes and promises it will never happen again. After they left, I laughed until I cried and it took roughly 30 minutes or so for me to stop.",
            "The only way thesr people will stop this type of behavior is if they are made to answer for it.\n\nPost the vids dude. If the other guy did not want people seeing him acting a fool in public, he would not have been acting a fool in public.",
            "We need to see this footage now",
            "You own the footage and you recorded it in a public place. I want to hear what his mother says to you to convince you to take the video down.",
            "[deleted]",
            "Could I see the video? I’m curious after reading the whole post , I kinda want to see this :) ",
            "sounds like he got himself a bad case of la chancla ",
            "This was great! xD",
            "Yep, just keep the footage if they try to get courts involved. What a jackass speeding and being on his phone.",
            "For some reason I read this in Jeff Bridges voice. ",
            "Gotta love 4 Wheelers.\n\nWhat rig you driving?",
            "For real, tho, let's see that video.",
            "Gian? Is that you?",
            "Post this to r/prorevenge ",
            "This is one of the most satisfying posts I've read in here for a while!",
            "And I thought the area around Fayetteville, NC, was bad.",
            "JAJAJAJAJAJAJAJAJA. What a pendejo! We are mama bears who will defend their kid with their life but if we are excellent mama bears, we are willing to end it for making us look like we did didn't raise them right.~Sincerely, a victim of la chancla",
            "Weird seeing my hometown mentioned for once",
            "Can you show us the video? Just us friens??",
            "How old was the guy? Too funny, cuts you off, gets mad, threatens your job, then gets his mom to call you to deal with the situation?! Bahahahahaha ",
            "Did you upload it on youtube by any chance?",
            "That was both satisfying and hilarious ",
            "My dad is an owner operator and he would find this hilarious.",
            "Dannng hes fucking dead",
            "There’s so little cause to ever be rude to strangers. Being nice and forgiving is such a better way to conduct yourself. ",
            "should post on /r/roadcam",
            ">considering I only own one truck, you can imagine what I would assign my truck number to be\n\n69, right? ",
            "The phone call on the road was the best part of this story.  So satisfying to read.  I love that you let it ring a bit.",
            "I was expecting him to answer the phone to an air horn going off. ",
            "Well done.",
            "LMAO, I'm so glad you own your own company (because that probably saved you from at least a little possible drama). I hope you keep that in mind if/when you hire others and you get angry calls about them.\n\nA dashcam that you save all the footage from is a great idea for any trucker.\n\nDeath by chanlca is what you heard going on, lol. I'm betting after your encounter, he damaged the car (which was why she said the thing about the bumper).",
            "Off Topic, but what's the history for the reason why so many Tractor-Trailers have the phrase \"Not for Hire\" painted on the driver's door?",
            "I live there lmao it sounds like something someone from here would do. Best city ever.",
            "Consider yourself sued, now send me the video.",
            "Awesome story.",
            "My husband is an owner/op, and I'm going to forward this story to him lol",
            "Gotta be real, Reading the first few sentences, I thought this story was gonna end up being MC told from a jerk's perspective.\n\nI am happy I was wrong, and would loved to have heard that dude get yelled at by his mom. Also, I don't think I could have resisted he urge to call his cell and gloat afterwards.",
            ">  but the only way anyone other than me or her would see it is if it was needed for a court case.\n\nTease.",
            "I saw all that going a different direction. You'd offer to call your \"boss\" to drive over but you really call the cops because he blocked you in. Then they'd give him a misdemeanor for something or other.\n\nWould that have worked?",
            "Don’t underestimate the power of the chanclas!",
            "Featured on the chive? Very nice! https://thechive.com/2019/02/20/trucker-gets-revenge-not-once-but-twice-on-the-same-ahole/",
            "OMG! That is too funny!  I really wish hubby had a dash cam when he was last O/O.  Won't get into the story but will say it cost him over $3,000.  So happy it worked out for you!",
            "Thanos hates it! Discover the hot new footwear that's all the rage for wholesale destruction!",
            "What you heard, was the sound of *la chancla.*",
            "Mexican moms are a force to be reckoned with",
            "I gotta get me a dash cam. That’s for sharing. That was very satisfying.",
            "Can we see the video? 😄",
            "When thus he had spoken, the hot sun was setting.  \nThe streets of Laredo grew cold as the clay.  \nWe took the young cowboy down to the green valley,  \nAnd there stands his marker, we made, to this day.\n",
            "I would have told her \"sure, I'll delete it.\"\n\nThen when she tries to sue since she thinks \"there's no evidence\" you get to counter sue her with your evidence.",
            "Cut off a truck and try to use your mother for sympathy points?  \n\n\nThat's a paddlin'",
            "Don't you wish you could just run down these idiots sometimes. lol",
            "Post the video! \n\nKarma Court!",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/truckers] [A male Karen cry for his mom](https://www.reddit.com/r/Truckers/comments/aslth2/a_male_karen_cry_for_his_mom/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "[Word cloud out of all the comments.](https://i.imgur.com/JofyflK.png)\n\nFun bot to vizualize how conversations go on reddit. Enjoy",
            "I'm not sure I follow what the problem was here? \n\nYou were slowing down to exit and someone pulling in front of you (I assume also exiting and slowing down) caused a dangerous situation such that you had to move to the shoulder?",
            "Nice!  And more than fair.  Wholesome even. ",
            "Awww, bless you and bless that mother.",
            "So when will you upload the video to youtube and let us see what happened?",
            "This sound like a power fantasy. Well.. the second half at least. If I'm wrong and you provide the footage, I'll gladly admit I was wrong and give you gold.  ",
            "*boss's",
            "You really wanted to tell everyone that you own your own business, huh?"
        ]
    },
    {
        "post_id": "lzyjyp",
        "author": "None",
        "title": "Do it my way ..BUT..just do it my way.....ok.... Have fun with a flooded basement",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lzyjyp/do_it_my_way_butjust_do_it_my_wayok_have_fun_with/",
        "score": 15003,
        "num_comments": 545,
        "created_utc": 1615147794.0,
        "selftext": "This happened a few years ago right after my really good neighbor moved out and the new shitty family moved in. \n\nIt was a Saturday and I saw the new neighbors working on there back yard I hadn't really had the opportunity to introduce myself so I went over and said hello. They were digging a pit to put in a plastic rain water collection thing to water there vegetable garden with. \n\nMe being nice I offered to help and spend a really nice day digging a pit and laying some cement for the tank to rest on.\n\nWell I noticed two things and tried to bring it up\n1. They did not put in any removable mesh through the main collection pipe meaning if it gets clogged it's going to be a bitch to clean out\n2. There was no overflow line from the tank \n\nThe thing is it would of been an easy fix Maby 45 extra min I tried to bring it up and I told them you might want to put in some mesh and an overflow \n\nI was shut down right away like they said it's fine I said but your going to over..\n\nI was cut off right away with just do it my way I want it done my way if you don't like it leave.\n\nSo I said ok have a nice day and left.\n\nAbout a month later after heavy rain guess what it filled up. \n\nThen the intake pipe filled up ... The water collected and spilled through the basement window flooding the basement and I mean serously flooding atleast a solid foot of water..\n\nSo yah Maby listen to the girl that went to university for you know engineering.....\n\nThey had to pump the basement dig up the tank and add an overflow pipe....\n\nSince then they have hated me ;)\n\nEdit : for those who are DMing me calling me fucking I iddoit and just terrible things because my spelling and grammar suck I am sorry my poor speaking and grammar bother you much people have there own circumstances  English is my second language I also do have a learning disability.\n\nYour hateful comments have really hurt my feelings. I am sorry I bothered you so much.",
        "permalink": "/r/MaliciousCompliance/comments/lzyjyp/do_it_my_way_butjust_do_it_my_wayok_have_fun_with/",
        "comments": [
            "Cause why wouldn’t they hate the person who knew what they were doing and offered support? \n\nThey don’t hate you they hate they were wrong and are too stubborn to admit you were right.",
            "Maybe it's just me, but I am always so paranoid about fucking up a project I start that I would have done litterally anything you suggested if you made it clear you knew what you were doing.",
            "But did they put in the mesh?",
            "I never cease to be amazed by some peoples complete ignorance to suggestion or advices.\nOn another note, so called \"leaf separators\" (see link for image) are more or less mandatory on any waterspouts with an underground connection where I live.\n\nhttps://markgrossen.se/wp-content/uploads/2019/01/lovavskiljare-1.jpg",
            "As Albus Percival Wulfric Brian Dumbledore rightfully said, when you are right it is harder to be forgiven.",
            "It's always the fault of the person who is right",
            "Please come move in by us! We are nice and we have a drainage issue to fix. Your advice would be so welcomed. And rewarded with my hubby's gourmet cooking!",
            "Well honestly an above ground system is better if it's fed through your easdrofts I'll take a picture of what I use for my system but really it's so easy \n\nJust get one of those big blue barrels drill a hole at the bottom use resin to glue a spout to it and you can get some really unnoticeable lines that connect right to the houses easdrofts to feed right in to it.. put the barrel up of the ground I used a wood table and it's all inside a mini shed so it doesn't look like crap turn the nozzle that you attached and boom gravity fed water",
            "Stupid people don’t like finding out they’re stupid.",
            "> They had to pump the basement dog up the tank\n\nwhat",
            "One thing i've learned is to always take some time to get to know your neighbors. Unless there's an emergency I'm friendly but fairly reserved,\n\nI like to suss 'em out first to see if interacting with them is going to be a pain or not. \n\nIf they're cool I get friendlier. If not I just maintain friendly distance.",
            "Well, of course they didn't take you seriously OP, you're a *woman*! Women don't know anything about that kind of thing right? Without a penis, how can you possibly know more than them? /S",
            "That was common sense. Why would they not put in an overflow and some kind of screen/filter?\n\n I mean come on, no engineering degree needed for that!",
            "Do you have any suggestions to get the rain to fall in the first place? I live in the desert, and it doesn’t seem to work for me.",
            "Hey neighbor, here's some free advice that's worth thousands of dollars, would you like it?\n\nShut up and dig.",
            "Sorry for those mean people, OP! I enjoyed your story and understood it perfectly",
            "This is the perfect story - getting what you deserve after not listening to good advice! \nThank you for sharing!",
            "People just don't like it when they are proven wrong. Even when someone is articulate, pleasant, and nice, some people just don't want to listen. As someone who hates looking stupid, this is a tough obstacle to overcome. I too, am an engineer, and engineers can be a blessing or a curse.",
            "Haha reminds me a little of a time I went to autozone (hear me out). Similar only in the sense of I knew what I was talking about and was treated like I didn’t. \n\nSo I had just gotten a new square body (‘83 Chevy pickup) with a 383 stroker in it (not the original engine). Well the dipstick tube was leaking a bit and I wanted a new one before it busted clean open at the weld. I was looking online for the right one, and saw that autozone actually sells them. Wanted to get it that day, rather than waiting for it to come in the mail. \n\nI drove the 5 minutes to the nearest autozone and told the guy I needed a new dipstick tube. He asked year make and model. I told him it wasn’t the original engine. Told him the engine I had. He said “no ma’am that’s not how it works. I need year make and model” I said I even have the part number, but he refused to use that. \n\nI said “ok, so even if I do an engine swap, it’ll take the same dipstick tube?” Knowing full well it wouldn’t. He said yes. I was like alrighty then. But I’m not buying it until we walk out there and see if it’s the one I need. So I told him year make and model and that it was originally a diesel. \n\nHe pulled it from the back and tried to ring it up. I said no we are going to go out there and hold it next to the one I have. He didn’t want to, but ended up doing it. We go out there and I pop the hood. He holds it next to the old one that’s in there and it’s WAY too long. Like my hood would’ve smashed it when you tried to shut it. I told him this is what happens when the engine is different from what was originally in it. It takes different parts. He said that didn’t make any sense (I’ll never understand that). \n\nI asked him if he wanted to sell me the part that I actually wanted based on the part number. He said no and that this one should fit. We walk back inside and I tried again to explain to him that it’s not the original motor so it would take different parts. He refused to believe this. I said ok so this motor, one that takes gasoline, would be in no way different from the original, one that takes diesel, simply because it’s in the same vehicle? He confirmed. \n\nI told him that he should really just sell me the part that goes along with the number, but he said it wouldn’t fit my truck so he would only sell me the one that matches my year make and model vehicle. I was beyond frustrated and at a loss for how to explain this to him. \n\nI said that all I wanted was to not wait a few days for the part in the mail, and that’s why I came in. He said that I should just come back with my husband because I’m clearly confused with how trucks work. \n\nYea, I was the one who didn’t understand how trucks work lol",
            "To the people criticizing your grammar. You are still smarter than them",
            "What is a basement dog?",
            "You helping them do manual labor and they pulled the “my way or leave card”? Wow! The audacity.",
            "As a fellow female Engineer, I applaud this story!",
            "Being forgiven for being right;  is never a enviable task. \n\nYou did the right thing, in being friendly and helpful.",
            "I would of found a spot with a view and set up a nice lounge chair moved my grill and had food and as show.",
            "If OP reads this comment, it means they have read all the others too\n\nBased on your attitude in your replies, I imagine it won't bother you, but just to say explicitly:\n\nYour post was perfectly readable as it is. Yes some simple spelling mistakes, but everything is obvious in context. Just take any posts being critical of that as people trying to help improve your English, english is such that it required peer feedback because the rules can't really all be codified, it's just a series of historical rules on how the language works, and various groups will have various rules and how important the rules are will vary as well\n\nAnd obviously look at the number of updoots and awards you've gotten, that's proof that you're story is incredibly relatable, meaning you communicated all the key details to convey the situation. Which is what I would expect from an engineer, who cares about the grammar if the meaning is conveyed, not poets and engineers anyway :)",
            "People really just don’t like being told they’re wrong smh it’s not that hard to listen",
            "We haven’t.”\n\n“Yes you have.”\n\n“Have I?”",
            "Hell, even if you hadn't known what you were talking about, hearing out and considering the proposal of the person helping on their day off would have been the decent thing to do.",
            "There is no good reason to hate you for that.  At least once they get over their pride being hurt a bit.  You did nothing wrong, and hopefully they see you were just being friendly, and things happened.  Just don't be rude, or taunt them after the fact.  Hopefully things work out between you.",
            "People are strange. I would have appreciated the advice, asked your background to figure out how you knew about it, and then asked for more help on how to do this thing right when I found out you were engineer",
            "I was talking with a friend the other day about how I have run into this most of my life, right now I live with a guy who asks me for advice and as soon as i give it he wants to argue with me about whatever it is. \n\nI have luckily found a way to deal with it, when he askes for help, I walk up and say, \n\n>\"what do you need me to do, what do you want me to hold, your in charge here, I'm just here to help you.\" \n\nI try to detach myself from the planning of whatever it is and I'm just there to lend a hand. \n\nDo not ask me for advice on how to do something knowing I'm experienced in whatever it is only to do the exact opposite and have to fix it later.",
            "Be my neighbor you sound awesome and helpful.",
            "\"You were right so I hate you!\"   \nHow classical",
            "I love people like you.",
            "The fact that you were helping them and then they were rude and told you to you is insane. Like you physically helped them dig and then they told you to leave while being rude? Unbelievable",
            "Brilliant - I do love it when 'blowhards' learn the hard way :-)",
            "My guess is the guy didn't want to be corrected by a woman. Manual labor macho guy doesn't want to get help from a woman.\n\n\nThat is so stupid. Like it only takes a second to understand why your suggestions made perfect sense.",
            "Don 't pay attention to those who criticize. \n\nIf you can, don't be sorry it bothered them.... be indifferent.\n\nWhat they think just bounces around inside their own head and it can't touch you unless you let it. Don't let them hurt your feelings. It takes practice, but it is worth it.\n\nAll Blessings to you.",
            "Well, I think you rock!",
            ">Your hateful comments have really hurt my feelings. I am sorry I bothered you so much.\n\nDon’t worry about these people OP, they just have flooded basements.",
            "Wait, they went to university... and got \"there\" wrong every time?",
            "[removed]",
            "That sounds like a good idea when done correctly. I’ve actually been wanting to do something like that for my garden. Guess they should have listened to you! On that note, do you know what I could google to get designs ideas?",
            "All that degree and still can't use their and you're",
            "*their",
            "But not for grammar and spelling. I'm sure you're a great engineer though.",
            "You studied engineering and this is how you structure sentences???",
            "Try this one weird trick. Neighbors will hate you!",
            "Sound like a couple of wankers anyways, probably best to stay a few hundred yards away all the time.",
            "Found the douche neighbor.",
            "That's the kind of hate that you want!",
            "You had me until Engineering.",
            "so ... how did you make it rain that heavily? /s",
            "filing this under r/nogooddeedgoesunpunished",
            "Your neighbors are at least entertaining XD",
            "Man some people, bullying someone because of their grammar without knowing anything about them \n\nWhat i have usually noticed about these people is that these people are nothing but trash who live shity lives so they try to hold on to their English skills to bully other people in order to feel like that they achieved something\n\nWheres your PHD in English bitch because you still havent achieved nothing",
            "I hope you still get replies. Dont let hateful fucks get you down, i work with engineers and they are smart people. So are you. Learning disabilities dont define us",
            "So you put someone on blast for not fixing a simple error regarding tanks, but refuse to fix a simple error regarding language. I want to know if you recognize the irony.",
            "I wonder what their messages would be like if they wrote them in your language. I'm sure you would have the manners to overlook any errors....",
            "'Would have' (also would've) not 'would of'.\n\nEdit: maybe, not Maby",
            "You should engineer some commas into your post. Good story though.",
            "I thought I was on /r/bluecollarwomen for a second",
            "Goes to university but can't redact text worth a damn.",
            "You certainly didn't go to school for spelling",
            "90% of the hate is because of womanhood. If a man said this they would be all like \"oh man, you were right we should have put an overflow in\".",
            "They hate the fact that a young woman smarter than them told them their mistake",
            "#THEIR",
            "> there\n\nWould be *their* in the first two cases.\n\n> would of\n\nIts always *would have*/*would've*. Common mistakes, don't sweat it.",
            "No. They hate that you were right.",
            "They don't hate you or being proved wrong by you. They are sexist fucks who hate that a **WOMAN** proved them to be stupid as fuck.",
            "God forbid a woman might actually know what she’s talking about. 🙄",
            "why can't you spell \"maybe\" and don't know that \"of\" is not the same word as \"have?\"",
            "[deleted]",
            "Down voting just for your edits",
            "There's no such thing as 'would of'. It's would've, which is short for would have.",
            "You didn't go to university for punctuation and grammer, for sure.",
            "and a GIRL ? girls don't know b.s. about this sort of thing.... all they're good for is \\*\\*\\*\\*",
            "They hate that a female knows more than their balls. Oh well. Gonna have to learn the hard way that not all dudes know best.... 🤷",
            "You should have watched Schindlers List.\n\nWhen a female engineer is right about something, they shoot her.",
            "A girl, engineer? What ridiculous idea is what they might think. Edit to the people who downvote. I am not sharing this idea but rather what the narrow minded neighbor might think...",
            "She never mentioned mysoginy but I sense it.",
            "you write like a facebook grandma",
            "[deleted]",
            "Sorry I have to be that guy, but \"their\" and \"would have\". Also either use direct or indirect speech,  please.",
            "This is going to get buried, but sometimes these stories are funny and well-deserved and sometimes these stories are incredibly sad and show the absolute garbage-state of the human race.  \n\n\nImagine what would've happened if /u/littlemissbunnywoman would've heard about their flood, gone over to their house, sympathized, asked how she could've helped, helped, invited them over for dinner, sneaked into the conversation her engineering experience, asked them if they'd like to redo the intake pipe/etc, helped them redo the intake pipe/etc, and made two friends for life. Happy neighbors, karma would've come back to her, she'd have felt a sense of pride in her knowledge and justice from the world.  \n\n\nInstead, she's here laughing at her neighbors who will likely never speak to her again, at best, assuming they don't try to harm her at some level, and farming upvotes.  \n\n\nFucking sickening.",
            "Don't they teach the difference between \"their\" and \"there\" in engineering school?",
            "Don't get why you had to tell us your gender.",
            "Makes sense. I always hate people for my mistakes.",
            "Definitely not. Have a great Thursday, everyone.",
            "Are you Australian?",
            "Well you did try to warn them... served them right for not listening to the one who knows what they are doing. I seriously do not like having to deal with those sort of people and I know how frustrating it can be, kudos for keeping calm and polite.",
            "Can you come help me with rainwater collection?",
            "You just have to love people who always know best. My neighbour knows everything.....his wife will come and ask me for advice behind his back",
            ">Since then they have hated me \n\nClearly the work of witchcraft. Nobody could have known it would flood, except for a witch.",
            "I’ve never seen a rain barrel in a pit, mine is above ground. I guess it’s done just to hide an ugly barrel? Cant the rain just overflow thru a hole in the downspout if the barrel is full like mine does?",
            "By you mentioning that it might happen, you caused it to happen, is what they think. I have seen these people before. I stopped helping a long time ago.",
            "proud of you",
            "Maybe they should have dropped their ego and listened to you lol",
            "Explain to me this removable mesh. I’ve been thinking of getting a rain barrel (above ground) with an overflow. Because of mosquitos, I thought about it having a lid and draining rain water from my garage roof gutter. \n\nIs this a terrible idea?",
            "I guess Cassandra wasn't all that popular either. Some people have very frail egos. Me, I would be embarrassed beyond words but I love knowledge.",
            "I don't get that hate.\n\nI would have liked you more, if anything. I'm not going to blame you for my own stubbornness.",
            "[deleted]",
            "They were so dumb",
            "Damn it if ego isn’t the just the best. A shame they lost both great advice and a cool neighbor. Mine never offer to help dig.",
            "You should send them flowers with a note saying \"I told you so ;)\"",
            "Great post... the native English speakers who messaged you should be ashamed. Most people who speak english natively cannot speak a second language (myself included). So you're the real winner!",
            "Heh..\n\nIf they refuse to listen to an engineer because of gender - learn the hard way.  \nDid you laugh out loud in their faces with \"told you so\" - or more private grinning?",
            "Ignore the haters. Lovely malicious compliance!",
            "The people calling you stupid are morons. Not only do you speak two languages but studied in engineering, most of the people calling you that can barely speak a single language.",
            "I’m sorry people are being so terrible to you in the DMs! I could 100% understand what you’re saying in your story. You’re doing fine, they’re just insecure dickheads who want to feel powerful. Great story ❤️",
            "Lol. They hate you bc you were right? \nGeez.",
            " \"Since then they have hated me ;) \"\n\n\" Your hateful comments have really hurt my feelings. I am sorry I bothered you so much. \"\n\nu might actually be a bit sensitive."
        ]
    },
    {
        "post_id": "7ybf3y",
        "author": "None",
        "title": "Lady demanded that I, a delivery man, check her groceries out. So I complied... with my package scanner.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7ybf3y/lady_demanded_that_i_a_delivery_man_check_her/",
        "score": 15005,
        "num_comments": 488,
        "created_utc": 1518920722.0,
        "selftext": "Originally posted this over on r/idontworkherelady and they suggested this sub would appreciate it! Hope you guys like it!\n\nHad quite an amusing encounter over this past winter break.\n\nTo set the stage, I was working as a holiday helper for a UPS delivery guy. As a holiday helper they had us wear cheap brown vests with a small company logo on them. You’d think that would be enough, but apparently not.\n\nNow although we mainly drop packages off at peoples’ houses, we also went through a shopping plaza to drop off stuff at different stores. We were dropping stuff off at Kroger when this happened. The way it worked was I would take a cart loaded with packages into Kroger along with a [DIAD] (https://www.browncafe.com/community/attachments/diad-v-jpg.5078/), which was basically a scanner we used to log in packages and mark off deliveries. I usually did this delivery alone because it was simple and my driver could use the time to organize other stuff.\n\nSo off I go into the store with a decent amount of packages stacked up on the trolley, where I roll them over to customer service. Usually there’s someone behind the desk when I come in, but sometimes the employee is out on the floor helping someone find something like they were today.\n\nStandard practice for me is to unload all the boxes behind the counter and then just wait until an employee comes back to sign off on them. So I unload all the boxes, stack them behind the counter, and then lean up against it to wait for someone to come by. While I’m waiting I casually take out my phone and begin browsing Reddit to pass the time.\n\nThen I heard the “Ahem.”\n\nI looked up to see some fifty-something-year-old lady scowling at me, with a cart packed to the brim with food. She had greying blonde hair done in that [“I want to speak to your manager”] (https://goo.gl/images/8uVAwl) style and was wearing a bright pink Nike top, blue leggings, and about two metric fuck tons of attitude.\n\nWe stared at each other and her expression soured with each passing moment like the milk that was undoubtedly curdling in her cart. Finally she broke the awkward silence.\n\n“Well?”\n\nI shrugged. “Well what?”\n\nShe shoved her cart forward, almost bumping me with it. “Are you gonna keep ignoring me? Or are you gonna check me out?”\n\nI looked at her then down at my uniform, which consisted of a grey hoodie, black sweatpants, and my trademark brown vest. Kroger employees wear black khakis, blue-collared shirts, and no brown vests. I looked back up at her, trying remain polite, and said, “I don’t work here, lady. I’m just dropping off packages.”\n\nThe sour woman scoffed and jabbed a finger at my DIAD. “Bullshit. You’re just too lazy to help me. Start scanning these,” she shoved the cart at me again, this time bumping my thigh, “or I’ll get your manager.” I wasn’t sure why she didn’t go to the standard checkout line either, but I guess if things got really busy, Kroger allowed customers to go through the customer service desk too. (It wasn’t very busy anway.)\n\nNow I could’ve taken the easy way out, told her to politely fuck off, and left, but then she took her phone to make a call and snapped her fingers at me, mouthing, “C’mon. I have to be somewhere.”\n\nSo I decided to help her out and began to unload her groceries, one by one, in the most tedious manner possible. I scanned each fruit, can, veggie, and box with the DIAD (which is normally used for recording people’s addresses. Funnily enough, it didn’t know where the kiwi or Rotisserie chicken live, but it does make a satisfying little bleep when it rejects an address which sounded quite similar to a product being scanned.)\n\nI kept doing this for about ten minutes, often “miss-scanning” something or inspecting it much to the woman’s annoyance. From time to time I’d interrupt her phone call to ask her a ridiculous question, such as: “Would you like to add another grape to this bunch? There’s one in here with a brown spot.”\n\nShe would usually answer with a huffy “What?”, stare into space as she slowly worked through the question, and then shake her head sharply as she went back to her conversation.\n\nShe reached her breaking point when I inquired as to whether or not she wanted her eggs bagged individually or all together. “What? Why the fuck would you-? WHAT?” she demanded shrilly.\n\nI stood there, DIAD in one hand, egg crate in the other, looking completely innocent while trying not to die laughing. I could swear I heard her mind briefly shutting down at the stupidity of my question, before rebooting. Calmly and with a polite smile, I repeated the question.\n\nHer face was almost as purple as the grapes I’d offered to discount as she struggled to form words. “What... kind of a dumbass question is that?” she croaked, her manicured nails digging into trembling palms.\n\nI placed the eggs back in the bag while nodding sympathetically. “The kind I ask someone who’s too stupid to not take the hint that I don’t fucking work here.”\n\nBy this point the Kroger employee working the customer service desk returned and the lady turned on them with the fury of God. “HOW CAN YOU LET AN EMPLOYEE TREAT ME THIS WAY? I SHOP HERE ALL THE TIME! HOW DARE YOU TREAT A VALUED CUSTOMER LIKE SHIT!”\n\nTo their credit, the customer service worker took the verbal assault pretty well, holding their hands up in a “Holy shit” gesture as they tried to calm the lady down. Then they looked from her to me and back to her and simply reiterated what I said. “Ma’am… he doesn’t work here…”\n\nI was fascinated to see the “doubling down when you’re wrong” mentality in action, but to my surprise all the wrath leached out of this harpy in two seconds flat. It was the look of someone who realized the only way they’d save face in a situation like this was to simply drop it. She pursed her lips at the employee’s words and looked at my brown vest, as if thinking I was somehow still defying her logic.\n\n“Well,” she said coldly, “you just lost a customer.” Then, quick as she’d arrived, the bitch turned on her heel with a flip of her grey attitude-do and stormed off.\n\nI was tempted to say that was more of a win, but figured I’d antagonized her enough. Holding out my DIAD for a signature, I asked if the employee had ever encountered her before. He said he had, but never that angry. She was usually just demanding and arrogant to anyone else when she shopped there.\nAfter getting his signature, I helped him repack everything and asked if he needed me to help him take it back, but he said “no.” It was worth it just getting another tumorous customer out of the store.\n\nOnce everything was settled, I returned to the delivery van. (This entire ordeal only lasted about 15 minutes.) My driver, Jeff, wasn’t too angry. He’d arranged the rest of our packages while I was delivering and just told me to be faster next time. Then we continued about our day.\n\nTL;DR - Worked as a holiday helper for a delivery company and was delivering packages to a grocery store, woman decided I worked there so I absolutely must check her groceries out. So I did… with a package scanner, and scanned every one of her items with extra care.",
        "permalink": "/r/MaliciousCompliance/comments/7ybf3y/lady_demanded_that_i_a_delivery_man_check_her/",
        "comments": [
            "\"You just lost a customer.\" = \"I'm too embarrassed to show my stupid face in here ever again.\"",
            "I find it interesting that she had given herself the title of valued customer despite her shitty everything",
            "> She reached her breaking point when I inquired as to whether or not she wanted her eggs bagged individually or all together.  \n\nThat's where this story went from good to ~~another grape~~ great ",
            "[deleted]",
            "\"I'll never shop here again!\"\n\nBut they always do ...",
            "**Flawless victory**",
            "Ha, great story. I was a seasonal driver for UPS two years in a row, drive the brown truck and be decked out head to toe in brown gear.\n\nIt was amazing the access I had to a lot of secure locations and post offices because of the uniform.\n\nBut, so many times when delivering to the back of a retail store and then walking up front to find someone to sign that a customer would ask me something like, \"where are the kid's clothes?\"\n\nI know you just saw me walk out of the back, but have you never gotten a UPS package?\n\nOTOH, everyone loves the UPS guy at Christmas.  Especially fun when I have to act sneaky so their kids can't see what I am dropping off.",
            "I work at Kroger and this is 150% accurate on how our customers act most of the time",
            ">\"Or are you gonna check me out?”\n\nTake a step back, look her up and down. \"Niiiiiice.\"",
            ">I inquired as to whether or not she wanted her eggs bagged individually or all together.\n\nThat was the best part of this whole story. I can't stop laughing at that.",
            "Lmao eggs bagged individually.  Dude, you are my spirit animal, take all the upvotes I got.  ",
            "This is some pro level trolling. ",
            "Normally, I find that people who say \"you just lost a customer\" are 100% always the kind of customers you don't really miss out on.",
            "I'm pretty sure I just ran into this lady at Kroger today. Same description and attitude, just a fancy blue zip-up since it's slightly chilly out.  \n  \nWe were both at a self-serve checkout and near-simultaneously got the same message on our screen. It stated something along the lines of, \"Help is on the way.\" I knew this wasn't a big deal as a few days prior the same thing happened to me. An employee told me they were having issues with their system. True or not, it really isn't a big deal and I can politely wait.  \n  \nI glance over at the lady once my screen displayed the message and she glared at me, \"I don't have the patience for this. I just... Seriously?\" She looked over at the sole self-serve checkout employee trying to un-bag and put back a full basket worth of unpaid for groceries. The employee was quickly trying to open a checkout for the next customer. The lady continued, \"This is bullshit, I don't have time for this. What the fuck is taking her so long?\" Why she was getting pissy with me I don't know.  \n  \nAs the employee finished moving the items from the self-checkout, which took less than 60 seconds, she said she would be right with me. She had to put the items to the side. I told her the lady next to me was first. I'm not in a rush and the longer this lady waits the more angry she will likely be.  \n  \nSo the employee sets the items aside and walks back to the pissed off lady. The lady stands in front of the self-checkout screen with her full shopping cart, not hand basket, and doesn't move to let the employee clear the screen. Mumbling and cursing at the employee this lady just can't believe that her day is being held up this long. If she was in such a rush I don't understand why she had a full shopping cart AND went to self-checkout. Cashiers are usually much quicker than I'll ever be at serving myself. Plus if you need help why would you stand in front of the screen!?  \n  \nNo malicious compliance here, unfortunately. Thankfully OP delivered on it, good job!  \n  \nTL;DR - OP's lady (possibly) didn't abandon Kroger like she said, but rather returned in blue another day and tried to use the self-serve with a temper.",
            "When I was a little kid, I'd tell my Dad \"I wish we were rich.\"  He'd reply with \"Well, I'm glad we're not.  I probably wouldn't like you if we were.\"  \n\nAs an adult I've dealt with people like the described customer, and I totally get what he was talking about.  ",
            "My favourite part was when the Kroger worker said “no”.",
            "Have you ever seen an employee say \"I don't work here?\" Has anyone? I've worked retail and service industries for more than a decade, and I've seen plenty of shirking. I've even hidden in the back a time or three myself, when I see \"*That* Customer\" walk in. But I simply can't imagine anyone outright lying to a customer.\n\nSo the level of entitlement that comes with ordering around the first warm body you see is absolutely staggering. I think these people just assume that anyone with a menial job must be stupid and lazy, so they must be lying.",
            "[deleted]",
            "We know that haircut as \"the cunt cap\".",
            "Is there really anything like a 'valued customer' for a freaking grocery store?\n\nI'm genuinely curious, how can you be valued enough at a grocery store to behave like a dick?!",
            "i remember pumping up my car at a self serve, it was snowing, and this bitch in a mecedes suv pulls up and is obviously waiting for me to pump her gas. i see her staring at me through the windsheild and eventually throw her hands up in a \"whats taking so long\" way.\n\ni wish i had gone up to her window and cleverly/ smoothly fucked with her. \n\nbut i have bad social anxiety so i just gave her the finger and got in my car and left.",
            "As a person who doesn't like rude customers, I laughed.\n\nAs a person who knows the driver gets to go home when the packages are delivered, he was right you should have been faster. 15 minutes for one drop. Nonsense. Did he at least get a chuckle out of the ordeal?",
            "''it didn’t know where the kiwi or the Rotisserie chicken live'' mein sides.",
            ">  I wasn’t sure why she didn’t go to the standard checkout line either, but I guess if things got really busy, Kroger allowed customers to go through the customer service desk too.\n\nNo, shitty people do this to try to skip the line. And they often have items that need to be weighed when the service desk isn't a standard register with a scale.",
            "\"I don’t work here\"\n\n\"You’re just too lazy to help me.\"\n\nHas anyone ever had this legitamatly happen to them. I have never had or even hear of an emplyee pretending not to work at a place to get out of helping a customer. What world do ou live in where this is not only a regular occrance but it's the first explination that comes into your mind when some one says they dont work here.\n\nHas anyone had this happen to them or used this excuse them self?",
            "The driver... Jeff...\nis this the legendary Jeff from\nhttps://www.reddit.com/r/MaliciousCompliance/comments/6pyg3m/its_against_company_policy_to_deliver_packages_to/",
            "I don't get why when someone is told \"I don't work here\" that they respond with anything other than \"oh sorry, my mistake.\"\n\nReally, how many times in the history of the world has someone said \"I don't work here\" to get out of having to work?",
            "[removed]",
            "[deleted]",
            "/r/talesfromretail would love this. ",
            "These customers don't realize the massive favor they're doing and how little they impact the store financially when they decide never to return. Probably the nicest thing that lady will ever do in her life. ",
            "As a Kroger associate, thank you so much for this.",
            "\"You just lost a customer\" is always false. Even if it was true, not a single person would care. Yeah, great, take your toddler-level-maturity ass somewhere else so I can spend time on people who know how to behave in public. Even my 3-year-old son very rarely throws a bitch fit like that.",
            "Lol now it works",
            "Really wanted a story where you scanned everything quickly, told her she won a prize/is a valued customer so its free today, then called the police as she left the story without paying.",
            "Something like this happened to my dad once but it was a place I worked at.\n\n\n I forgot my lunch so he was bringing it to me. We were chatting for a minute or so and when he walked away some lady jumped him and start verbally assaulting him. She thought he was a manager. She said something about something we didn't sell and my dad pointed to me and said \"this young man can help you\". So I walked up and greeted her and she ignores me and goes right back to my dad and starts jabbering about something else.\n\n\n He finally tells her that he doesn't work there and starts laughing the whole situation off. She takes offence and wants to talk to an actual manager and demands that my dad call a manager... so I call the manager and the lady complains about the lack of attentive  customer service. Confused, my manager points to me and says the magic words \"this young man can help you\". And waits for a reaction. Her response is unintelligible muttering and she storms off out the door. \n\n\nThe 3 of us just looked at each other for a second and laughed it off. It was an odd bonding moment. ",
            "Jeff was angry? Wtf you supposed to do? Wait for the employee faster? ",
            "\"employees wear black khakis\"\n\nDo the employees wear balck pants or khaki pants? Which color?",
            "I love you",
            "Lol This post brought to you by Kroger. ",
            "Wonder where she got it into her head they could scan with that thing. Psychological studies dictate that for her to think that works that way, she had to experience that before.\n\nSo now I gotta check lots of groceries stores in the area to see if they scan using a DIAD...",
            "[removed]",
            ">She reached her breaking point when I inquired as to whether or not she wanted her eggs bagged individually or all together.\n\n\nI lost it.",
            "❤️❤️❤️ Coming from someone who used to work customer service, I would have LOVED to witness this!!!",
            "Loved the \"would you like to add another grape to this bunch?\" Former retail slave here: I love you, OP. ",
            "I used to work for WIS, an 3rd party inventory counting company. We would do into various stores and count their inventory. We were frequently mistaken for employees. However, if I acted this way to a customer's customer, I surely would've been fired. We were expected to answer their questions, if we could, or direct them to an employee of our customer.",
            "Alwqys enjoy your stories, hdalby. Keep em comin",
            "Damn, pretty well written. Enjoyed the little details!",
            "Bravo! Well-written too. So happy you shared...laughed hard after a long day.",
            "Sweatpants at work?",
            "Was a fedex driver, and this happened a few times to me.  It was always as easy as \"I don't work here, i work for fedex, that's why I'm here.  Someone will be with you shortly.\" and then walk away, but within eye sight of the counter so if someone came to cover the service desk counter I could take care of my shit.  How hard is it to say \"I don't work for the grocery store, i work for fedex\"  Just walk the fuck away.\n\nEverything else is just stupid.",
            "Hell yeah",
            "Incredible",
            "Pursed lips oka cat butt face.",
            "This thread delivers. ",
            "Not quite the same but I work in a pharmacy and we’ll have people come through the drive through and just ask us if we can grab a few things for them. I usually say sure, walk out of the pharmacy and let them wait a good 5 minutes before I tell them I can’t find what they’re looking for. My favorite was when a guy wanted me to get him a large bag of ice and put it through the drive through window which is no where near big enough. People are just lazy ",
            "[removed]",
            "This is an extreme version of what I go through daily at work. I'm a beer vendor and people just don't understand the concept at all",
            "People who try and physically snap at others to make them do things like a trained animal deserve to be fucked with. Great job OP.",
            "I always loved when irate customers would say they're never coming back, as if I actually want or need them for some reason. Great, bitch, hope I never see you again. Low level employee at a retail store? I don't fucking care if ANYONE comes in here, let alone fuckwads like you. ",
            "It would’ve been really hilarious if you’d scanned them quickly, and she walked out of the store with groceries she didn’t pay for.",
            "The real rub here, she will tell anyone who will listen how poorly she was treated!",
            "If you have to make another delivery at that store, ask if the lady came back. I've had a few claims of never returning to the supermarket I worked at but they all come back.",
            "People like this should be forced to work in retail with a notice at their stand saying they're hear as punishment to be as rude as possible. Just so they know why they're such a cunt.",
            "I get so tired of seeing that “double down” shit\nMost of the time it’s people who are in the wrong that say that because they can’t form a coherent argument.\n\nIn this case though it was kind of funny.",
            "Propane delivery.",
            "I worked at Kroger less than a year ago, and they had us wear tan khakis. Have they changed the uniform?",
            "I'm dying of laughter i  toilet here 😂😂😂",
            "I'm imagining you standing there, 1 solo egg in your right hand, the carton in your left, with that stupid questioning Jim Face shrug going on. Omg lmao. ",
            "When ever I happen to be behind one of these people in line at the cashiers, I make a comment to the cashier like, \"How often do you have to deal with assholes like this?\" I'm a big guy most people don't fuck with me so that usually puts an end to their tantrum. ",
            "Duuuuude! When I got to the part about the eggs, I promptly lost it!\n\nI just about died from laughing, probably ruptured something as I pictured her face and your when you just kept going!\n\nYou’re my hero and so is Jeff!!",
            "I'm like 3 weeks late but I used to work at Walmart and heard \"I'm never coming here again!\" All the time.\n\nLady. I make minimum wage. You really think I care? You represent like 0.00000001% of Walmart's profits. You think they care?",
            "Fucking *TEARS OF LAUGHTER* reading that mate! Bravo",
            "\"Just be faster next time\". Is your driver too retarded to understand there wasn't an employee readily available to sign off on delivery?",
            "Kroger has a policy in place for their vendors that conduct business onsite (Coca-cola, frito lay, etc) that states that if a customer asks you a question, the vendor is supposed to do everything they can to help the customer, including walking them to the area they were looking for or to find an employee. ",
            "Two metric fuck tons of attitude. I'm holding onto that one! \n\nEdit:typo\n",
            "r/titlegore",
            "Worked for ups also. In calling bullshit on this story. If you spent more than 5 minutes somewhere that was way longer than It should be.",
            "[removed]",
            "As a UPS employee how in the fuck are you even allowed to wear just the vest without any other uniform matching colors?  I would see if you had said black hoodie which is acceptable, but you don't even have company issued pants...\n\nEven though I know just how much the company as a whole is starting to go downhill with the way they treat their current employees and their new hiring guidelines, but that just sounds suspect as all fuck.  /shrug\n\nI'm not doubting you worked for us as a helper over break, but understand where this might come off differently to employees.\n\nEdit:  Obviously depending on size of city and people things will be different, but UPS needs to hold to its standards, and piddly shit like not providing enough uniforms for even helpers shows how much worse they've gotten over time in doing so."
        ]
    },
    {
        "post_id": "w89zh3",
        "author": "Patient_House",
        "title": "Taking the work news to the news",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/w89zh3/taking_the_work_news_to_the_news/",
        "score": 14968,
        "num_comments": 269,
        "created_utc": 1658809281.0,
        "selftext": "I'm still unsure if it's really compliance, but my ex-employer announced some news regarding our jobs. It was obviously false, but instead of calling the bullshit, I treated it exactly as I would've if it was true and it bounced back in their face.\n\nIt was a while ago, when I was working in a community-based organisation. We provided end-of-the-line shelter for people and did rights advocacy in a medium town (100k). The salary was low but okay, but most employees were there because they believed in what we did.\n\nThe main problem was the manager. She didn't act accordingly to the set of values the organisation was based on, she was grossly overpaid compared to employees, took everything personal, made sure we were cut off from the administrators and created an atmosphere where people feared retribution. We were unionized, but after a few months I realised no one was ever filling complaints (even for trivial matters) because they feared she was going to lash back at them. Turns out she had done it to a few people in the past. Once I figured I wasn't going to stay there much longer, I decided to sign all the complaints I could (according to union I could sign anything I witnessed even if I wasn't the target) and figured I would see them to the end and leave. That way administrators couldn't claim not knowing and there was a chance for my colleague to have a better work environment.\n\nSo, of course, the next few months were a living hell. She picked on me regularly. Still, most people sided with me (at least privately, most of them fearing she would do the same treatment to them if they declared it publicly). One morning, she calls a staff meeting and explains that a large amount of complaints have been filed in the last months (looks at me) and the cost to settle them or to pay the lawyers to fight them might bankrupt the organisation and everyone is thus at risk of loosing their job soon(insert ominous music). Panic ensues. My colleagues as crying, they're calling their SO, a lot of people are BEGGING me to take them back stating she got the lesson, some of them are genuinely pissed at me. IMO it was obviously bullshit made to turn them against me. I mean, the sole emergency housing of a 100k city (annually filled at 115% capacity) would be closing for a dozen complaints where I'm not even asking for money in any form, over legal fees which are usually budgeted in advance? Come on, it's basic fear-brewing schemes. \n\nNormally, I would have questioned it during the meeting or tried to reason with them afterwards. But that time, I decided to comply with the narrative and treat it as true. I left for my break and did what I would have done if we were really closing : appealing to the public outrage to help us fulfilling our mission. I called the news. Told them verbatim the morning announcement, the service hole it would create in the community, the job impact it would have in the city etc.\n\nThe local news picked it up. They called the manager and administrators about running the story, questioning how come there were enough complaints to threaten a 35 year-old pillar of the community services, asking what the complaints were about etc.\n\nBefore 4pm that same day, we had another meeting to explain that we must have misunderstood the first meeting, as the organisation was in no way shape or form in danger of closing. Sure, we must have misunderstood. \n\nMorale of the story : let those who brewed the piss drink it.",
        "permalink": "/r/MaliciousCompliance/comments/w89zh3/taking_the_work_news_to_the_news/",
        "comments": [
            "\"I see your shitty-ass attempt at intimidation, and raise you public indignation\"",
            "Well played.",
            "*let those who brewed the piss drink it*\n\nBeautiful",
            "I do this all the time. Not to the extent of the news, but whenever a boss starts saying anything about the company not being able to afford things I start stirring up bankruptcy fears and fears of checks bouncing until management makes an announcement to the contrary and assures employees and customers that there is no danger to their contracts being dropped.\n\nP.S. The customers were actually in on it and played along with my points because when you talk with people multiple times a month, it's not hard to get them in on some fun, especially teachers and school admin, dealing with kids seems to result in some people building up some desire to show a bit of mischief that they like to release from time to time.",
            "She will be let go as soon as administration resolves the complaints.  They won't admit to wrong doing before that happens.",
            "“Let those who brewed the piss drink it”\n\nA similar one I’ve heard: \n\n“Those who stirred the shitpot has to lick the spoon”\n\nI like yours better :)",
            "My wife just unionized her department at work a year ago, and I strongly encourage her every day to file grievances no matter how small they seem. Legally the employer can not retaliate against you for filing it with your union, as the union will go to bat and fight them if needed(if you have a good union). If the employer wants to play games because you unionized, you need to play thier game right back at them. It's the only way they will learn, the union is there to protect the employee from any shenanigans the employer tries to pull! \n\nOn that note, if any of you are union members, please do me a favor and reach out to your union rep and ask how you can help strengthen the union!",
            "So what ended up happening to her? Did management or the union finally look at the complaints?",
            "[deleted]",
            "[deleted]",
            "Seems like you colleagues are also part of the problem.  Retaliation is also against the law.  They should have filed complaints and the union should have went over her head if she retaliated against them.  Or, perhaps, you should switch to the Teamsters - they seem to know a lot about dealing with retaliation.",
            "Good Job",
            "This story pleases me.",
            "So good!!",
            "Whether it fits in a strict definition of MC or not, this is very much in the spirit of the sub and one of the best stories I've read here in a while.\n\nWell done! It must have been so satisfying to publicly call her bluff. I'm really glad you use your powers for good not evil haha.",
            "Haha yesssss",
            "That’s some powerful Bullshit Judo. Well done!",
            "brilliant",
            "Amazing!",
            "Stunning",
            "1:  We need followup on what became of the manager.\n\n2:  Start recording these meetings so you have proof to provide.",
            "And... what happened with the manager?!?",
            "This.\n\nThis is.\n\nThis is... the way.",
            "This warmed my cold, dead heart.",
            "That summary at the end? I'ma steal it! Call the news for all I care. Great story!",
            ">Morale of the story : let those who brewed the piss drink it.\n\nFantastic summary.",
            "I hope there was stronger union leadership afterwards. Clearly the union is not stepping up if you cannot lodge complaints without protection from personal discrimination.",
            "Good for you for sticking up to the work bully in a way that was truly epic. I think this also fits under passive-aggressive revenge in a way",
            "I hope the lady got enough heat for that shit she learned a lesson. Icing on the cake would have been if she got fired.",
            "That moral makes me so happy. Well done!",
            "I loved reading this Thank you!",
            "> let those who brewed the piss drink it.    \n\nI love this. I am going to say that all day today.",
            "🎶There goes my hero, watch them as they go 🎶",
            "Well played!!! It probably gave your co-workers more job security than before! Plus, reporters will probably be watching the moves more carefully.",
            "What happened to the manager then? Any fallout from that?",
            "Short, sweet, and beautiful.",
            "I love this. Reminds me of working for a grocery store chain. Someone got pissed because one of the stores usually closed on Christmas would be open. They called the local news to announce they were all closed and everyone got a day off.",
            "*Moral",
            "Amazing. Part of me wishes that meeting was recorded so they couldn't have tried to gaslight everyone. But I have a feeling that would be very illegal and grounds for termination.",
            "Awesome story, but the last line is utter perfection. I wish I could upvote again, just because of that last line.",
            "This is glorious",
            "OP, you are awesome. I immensely RESPECT your clarity of vision and your ability to act decisively when behaviors fail the *smell test*. Oh how I wish I could clone a bit of your clear vision.",
            "r/prorevenge",
            "I doubt many employees really believed what they did; they just didn't have better alternatives.",
            "Splendid. Well played",
            "Magnificent. The great shame is I can only up-vote your post just the once.",
            "Great call of their hand, OP. They played royal flush, but had pair of twos.",
            ">I decided to sign all the complaints I could... and figured I would see them to the end and leave. That way administrators couldn't claim not knowing and there was a chance for my colleague to have a better work environment.\n\nGood on ya, mate",
            "Your manager is a true Cindy. I cannot stand those type of bosses.",
            " Nicely done. Is this manager still employed?",
            "What happened to the manager?",
            "Well done!",
            "Damn, best story yet. Good for you!",
            "I very much hope that you raised her actions as an official compaint.",
            "To the manager, “congrats, you played yourself.”",
            "2 can always play the game. Well done 👏",
            "Crosspost to r/antiwork and r/workreform. They'd love this.",
            "On a scale from 0 to 10, I rate this one 20 points!  This is really creative, innovative and original!",
            "\nIf you can't stand the heat, get out of the kitchen",
            "The truth shall set her free.",
            "This is poetry.",
            "You are a genius!",
            "Did anything happen to the manager?",
            "Mad respect man!",
            "Epic. I bow before the master.",
            "This is a good one. Chapeau!",
            "And on that day in Whoville, your dick grew just a little bit longer",
            "Incredible that’s one of the best I’ve seen on here haha",
            " A😳",
            "Who the hell *brews piss*? Are you also tanning hides there?\n  \nAlso, I don't see drinking piss in any form as being good for morale.",
            "I'd love to know how this ends.",
            "Love it!",
            "Wow. That's great!",
            "* slow clap * Well done.",
            "Beautifully done",
            "There's a certain chain coffee company that is letting its employees strike over a false narrative because they're(corporate) worried that the homeless people overdosing in the bathrooms is bad publicity. They'd rather the public think it's union issues.",
            "What a horrible, horrible person she is.",
            "Or they've already burned all their bridges elsewhere.",
            "Was this in western North Carolina? This sounds suspiciously like an organization and woman I have also opposed.",
            "Winner, winner, chicken dinner. I’m wondering if this affected the tyrant.",
            "Very deft. Nice!",
            ">let those who brewed the piss drink it.\n\nAwesome!"
        ]
    },
    {
        "post_id": "11ibunl",
        "author": "Warm_Tomato2126",
        "title": "You want me to fly 12 hours earlier because it's cheaper?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ibunl/you_want_me_to_fly_12_hours_earlier_because_its/",
        "score": 14963,
        "num_comments": 396,
        "created_utc": 1677960717.0,
        "selftext": "TL/DR: Company changed my flight to save £80, fine, two hotels, two taxis and an extra day's pay please.\n\nDisclaimer: English is my second language but I've been speaking it since I was 5 so really should know better. I'm on a laptop so any formatting errors are because I'm dumb.\n\nI (56M in the UK) was working in Africa as an operations manager for a large global security company from 2009 to 2014.\n\nThe country I was working in had been through a long civil war and was very under-developed (Think no paved roads, people living a very traditional African lifestyle). At the time I'd been working there on a 10 weeks in country, 2 weeks at home rotation for about 4 years.\n\nI'd flown to and from work so often that I had the journey down to the bare minimum travel time, and it worked out the cheapest option for the company because travel days were paid from when I left home. The shorter my journey the cheaper it worked out for the company.\n\nSomeone in the head office had looked at cutting down on travel costs, probably to make themselves look good and get promoted. As a result i got an email after a week at home saying they had changed my normal flight which was 5pm on Sunday from my nearest UK airport, via Amsterdam, then on to Nairobi, connecting with a 9am flight to the war torn country on Monday morning. The change was from the from a 5pm departure to a 5am departure the same day, same route, and saving about £80. \n\nTo clarify, the 9am flight from Nairobi was the first flight to war torn country because the destination airport was the only surfaced runway in the country. It had had no runway lights or radar so all flights had to be in daylight.\n\nAnyway, I agreed to the flight time change, but they had to move it to the Monday so I don't lose a day at home, (All will become clear) they agreed because still saved £80 on the ticket, no skin off their nose.\n\nOnce I got the flight confirmation I contacted the travel desk asking for hotel and taxi bookings, when they asked why I need these I explained that to make a a 5am departure required a check in at 3am, so I needed a hotel at the airport on Sunday night because no trains were running to get me the 3 hours to the airport from home for that time of the morning.\n\n The flights they booked would get me into Nairobi for 7pm - after dark - so I'd need a Hotel there and a taxi each way to  and from the hotel to get me onto the 9am flight on Tuesday - the same flight I would have been on if I'd left at 5pm but a day later.\n\nA couple of days go by and I got a phone call from the company travel desk telling me the travel plan was confirmed. I was on the 5am flight with a hotel reservation at my UK airport the night before, a hotel in Nairobi after landing and the taxi would collect me in Nairobi and drop me at the airport for my final connection.\n\nI asked about the cost saving, they said £80. I then asked about the hotels and taxis... They replied, oh, they don't come out of our budget, that's the operations budget so you're fine.\n\nI was happy, I was arriving back at work a day later, still paid the same amount with a night out in Nairobi to sweeten the deal. My Boss on the other hand went nuts! Nobody had told him of the changes. My deputy flew out on the plane I flew in on, meaning I didn't get a hand over of the work that was going on. On top of that the cost for hotels, taxis and extra day's pay had all come out of my Boss's operational budget. I think the total amount added was almost £1000, but hey, they save £80 on the flight cost!",
        "permalink": "/r/MaliciousCompliance/comments/11ibunl/you_want_me_to_fly_12_hours_earlier_because_its/",
        "comments": [
            "So many penny wise pound foolish stories of companies doing stupid shit like this.",
            "yup, different budget buckets...\n\nthis is why travel budget was in my company dissolved all into operational budgets of individual services..  no more stupid savings that cost 10x more somewhere else",
            "Kinda reminds me of a story my dad told me from his working days. He was in a telecom union (in the US) and had to travel with his manager to somewhere out of state. Originally planned to travel on Monday, but his manager wanted to leave on Sunday afternoon instead. So they get to the airport and plane is delayed. Hanging out and the manager made some comment about the wasted time, and my dad was like, “well, I don’t mind - I’m getting triple pay.” Manager responded along the lines of, “what are you taking about?!” My dad said, “well, according to our contract: 1) travel time is paid time. 2) this puts me over my 40 hrs for the week, so now getting time-and-a-half. And 3) it’s Sunday, which means time-and-a-half AGAIN. But you wanted us to head out today instead of on a Monday…sooo…”\n\nEDIT: I chatted w/ my dad this morning, and a slight correction: he was getting time-and-a-half for being over 40 hrs, and then DOUBLE time (on top of 1.5 time) for it being a Sunday.",
            "I'm feel like I'm very fortunate to be able to book my own travel accomodations with no oversight. I do what makes sense based on when/where I need to be, without much regard for economically driven \"savings\". For example, if I find out that a customer needs me in San Francisco on Monday, and I'm in Charlotte on Friday, and the only seats left available are first class, it's first class. No one ever questions that for me. Thankfully. My bosses understand the impact and appreciation from our customers for the level of service we provide. That has been instrumental in increasing our market share, and it's visible and communicated.",
            "What happened going forward?",
            "Standard practice. Person A’s performance is measured according to savings they make on a specific line item, and they are given the authority to juggle things in a manner that saves money on that line item even though it costs money on other line items. Meanwhile, person B is chewed out because costs of line items they’re responsible for go up, even though they don’t have the authority to veto person A’s juggling, which is the cause of those line items going up.",
            "In my organization, they would rather have employees stay overnight at an intermediate location instead of traveling 16 hours straight (not sure if it’s actually 16 , but something like that). If you fly over a certain number of hours in a single day, agency rules allow the employee to fly business class, which is more expensive. Screw the employee if he wants to get home to see the family, cuz it’s about saving a few bucks. \n\nI’m glad the OP enjoyed his night in Nairobi, though.",
            "I am a bazillion mile traveler. We have a new Finance director.  2nd week on the job, has set up several travel meetings for next week. I'm sure there will be several new restrictions.  I can't wait to begin malicious compliance.",
            "\"Not our budget, not our problem\"",
            "When I was commuting between the US and India my manager always booked me on excursion flights with fixed departure and return dates with no refunds or transfers. The problem was that I never stayed at home long enough to wait for the cheap flight back, so I had to get the company to fork out another $1500 for a one-way flight to Mumbai, making the total cost about $2200.\n\nOn one trip back to the States I did my own research and discovered that it was cheaper to buy business class tickets with open return dates - this was even cheaper than flying ordinary class. On my return to Mumbai my manager was pissed that I booked business even after I told him I saved the company a net $800 (because as usual I had to fly back a week early). Managers can be so stupid at times.",
            "[deleted]",
            "My company used to require you to take a flight with a layover if it was the lowest fare.  No exceptions.  I happily spent so many days earning time and a half or even double time watching espn at airports across the  country. I can take a Monday direct flight and be onsite at noon....or a connecting flight on Sunday that has me on OT all day plus another day of hotel and car rental. Whatever.",
            "Straight out of “re-engineering the corporation”, that “oh it comes out of another departments budget so it’s fine”.",
            "Just another cherry on top:\n\n> I got a phone call from the company travel desk\n\nThis could have been an email. Instead they disturb you in your time at home.",
            "I know someone the company insisted on flying to big city in same province. (Ont Canada). \n\nPlane scheduled to land at 7am.  Airport to Downtown via Airport train would be $50 Uber ride to Airport at 4am $400 flight and $20 train to office. \n\nIf all goes well he would be at the office by 9am. \n\nCommuter train direct to the city would be $30. Train left at 5:00am and arrives at 9:15. 15 min walk to office. So he would be there at 9:30 at the latest. \n\nThey paid around $470 for him to be there 1/2 hr earlier than the train which would be only $30. \n\n\nHe lives a 10min walk from the train station.",
            "I never tire of these sorts of stories. Pennywise/ pound foolish tales, and stolen office lunch tales, are my absolute favorites",
            "Never interrupt your enemy when he is making a mistake.",
            "\"I'm on a laptop so any formatting errors are because I'm dumb.\"\n\nThis is basically my life motto lol.",
            "Oh my work is great at this, we call it picking up pennies with $100 bills…",
            "Is there a reason you didn't name the country? Sounds like Somalia or South Sudan to me. I guess it's not really relevant to the story though.",
            "Company I worked for used to try to tell me I had to fly on a Sunday so I wouldn't lose a days work.\n\nYa I don't think so.",
            "Ive had similar to this conversation as well with couple of my previous employers.\n\nMy job involved travelling to clients, be is sales or project meeting and such, but sometimes clients are pretty far away and traveling there will take time, often more than your normal office hours allow. \n\nOur general contract dictates that ”travelling time is not paid”, or similar, but meaning that companies dont have to pay for the travelling hours outside office hours. Which is completely ok, as of it has been agreed on at some point and it has been put into contract. But in practice most of the companies understand that the clients can be pretty far away and pay all the hours anyway. For example sometimes to get to the client, you need to drive 2h, take a flight 4h, taxi 1h, project meeting 2h, and then travel back again - thats full 16h day. Those are pretty long days, and you should be at the desk by next morning.\n\nWell, not everyone are co-operative with this and they require you to follow the base contract, meaning that I wouldnt get paid for travel time\n\nFck - no thank you.\n\nWith these employers, I begun to do the travelling only on office hours. So, I use one day to travel to client location and book a hotel. Then if there is time, I will do the meeting on the same day or on next morning. Next day I use for that meeting on the morning and/or traveling back, and if it was that long trip, I use the remaining time for long lunch so I just head back home after that.\n\nI remember this one time when I had a discussion with my supervisor for this practise, as he was wondering where I had been one day as I was not at the office meeting. I explained the procedure to him, that I had been at the client, and as the client is so far away that I cant reach them in one working day I had to stay overnight and travel back next day.\n\nAt first he was dumbfounded but slowly when he begun to understand the situation, he begun to argue that I cannot do this. That I cant use two working days for one short meeting with the client, that I need to be at the office at next morning. I asked how he would like me to proceed with the client in the future? Along with this I offer the instructions which he personally has given me for travel times, where we get no pay for the travel times outside office hours? \n\nTeams and such were not a thing back then, and my job involves a lot of survey on site, which is not possible via Teams anyway. \n\nMy supervisor had his hands tied then. He knew that he could no back off from the given instructions which he himself had pushed on us earlier, nor he could not either deny my logic for using two or more days for the client work, even if it was short on site survey for the project. He cant ask me to travel on my own time either - because thats my own fking time and employers have no control over that. I had to meet those clients, and it was not possible to do the surveys, meetings, sales etc. behind the desk. I had to be there and do the job. And If they pay me for 8h, they only get 8h.\n\nMost of the time on that business people are self guided and do what is best for the company, often sacrificing their own time, family time, etc. for the company, using more than that 8h/day for example traveling around etc. But we want to be compensated for those hours we spend in plane, train etc. Its not worth the money really, but Im not going to do that for free either.\n\nBut yeah, some companies who enforce idiotic policy to their employees, will have it rough.\n\nI personally didnt mind spending two days for traveling for those meetings and such, I enjoy traveling and I have my ways to spend time no matter where I am.",
            "This is a good example of why companies that use struct budget classifications are so stupid. \"Saving\" money out of one budget at the expense of another is, unfortunately, not rare at all.",
            "Fuck MBAs and their \"Well that bill goes to a different department so I don't care\" attitude.\n\nThey will **literally** run companies into the ground to make themselves look like a good money saver on their resume.",
            "> They replied, oh, they don't come out of our budget, that's the operations budget so you're fine.\n\nAnd this right here is where so many companies that get big enough to have multiple internal budgets founder and break their ships on the reef of \"that's not coming out of *my* budget, my responsibility is to *my* budget alone, so by saving the travel budget eighty quid on travel costs I have done my duty, even if it costs the company as a whole an extra grand.\"",
            "I once got my company to fly me out for 10 days to go to a 3 day conference and cover hotel/per diem because they would save $300 on the flights ... Per diem was $180 and the hotel was $200 a night. \n\nLooking back I don't know why I was surprised 5 years later when they were cutting costs by getting rid of the only people at the company directly involved with producing any work product. \n\nBut hey, they still paid for a $1k+ vacation for me and didn't even ask for receipts, tbh I should've tried to do that once more before leaving.",
            "I had coworker try to change my direct flight to one with stops to save the company money, but i also billed for travel time and it would cost so much more. I’ll never understand these people who can’t see the whole picture. I honestly think she just wanted me to have a bad flight.",
            "I love that different budget mentality.  I had a manager like that.  Cheap and conniving as you could imagine with his budget, but if we were say ever asked to ship anything, that came out of the requestors budget and it was 100% overnight.  He felt it made us look better because things got done \"faster\" though if I had to ship something to another person in our group, it was like it can go ground.  He tried license sharing on some of our apps too.  One of my cohorts went on vacation with a license checked out and no one in his office could get into his computer.",
            "I got chewed out at work for explaining the \"big picture\" that the finance team was ignoring, turns out intentionally. I made a higher up look stupid because the less than $10 USD saved was in reality a $250 net loss. Further memos I sent in similar vein were routinely ignored.\n\nThe same VP purchased a seriously expensive program for the company to schedule employees with. It was the cheapest option. The only problem was it was 30 years old and very inflexible. It failed in testing routinely. Corporate wrote it off as a loss. They had to purchase one of the more current ones and it was the same price as the first purchase.",
            "I see this kind of stupidity all the time. I work in IT, and have seen people decide to purchase software that is complete shite because it is $500 a month less to license. But then they need a person spending half their time time to support the piece of shite software, meaning they end up paying at a minimum $4000 a month just to support it.",
            "A lot of companies have strict limits for different items and you never ever exceed those. So if your hotel nightly rate is in budget then it doesn’t matter how many nights you stay - you are within “policy”. If the higher priced flight is above budget then you can’t book it. The travel bookers never look at it holistically. It’s ridiculous \n\nFor example, my employer requires us to park in long term parking at the airport if we travel overnight. My airport often dies pretty good deals for short term parking if booked online. But sorry - out of policy. Taxis, however are within policy. I just take a taxi to and from the airport as I’ll be damned if I’m hanging around at 6am waiting for the long term carpark shuttle in the freezing cold in a massive field. Taxi is more expensive than short term car park but it’s within policy.",
            "Gotta love the travel dept triumphant reaction to saving 80 on their budget by pushing hundreds of additional cost into *some else's* budget.",
            "Love how one department fucks over another and then shrugs and says, \"well, at least my department looks good.\"",
            "Somewhat related: \"weeks of work can save you minutes of planning\"",
            "SMH I feel this!\n\nI work for one company but have 2 different managers. They are constantly arguing about who will pay for my overtime. I look at them like they are stupid because (well they are) neither of them pay me the company pays me.",
            "A buddy of mine in USA, once told me many years ago he got a new travel rep, that was looking to save every penny in travel costs, until they changed one of his co-workers (that only knew English) flight to one that had a layover North Korea!  (The ticket wasn't in English, so he didn't know)  The coworker was imprisoned in north Korea for several weeks, until finally being released. (This was still during Kim Jong-il rein). His coworker was livid the next time he saw the travel rep.  His boss at first told him that he would have to charge leave during his imprisonment until the higher ups heard. To avoid a possible law suit gave him his full pay instead.",
            ">I (56M in the UK)...\n\nHow old are you outside of the UK?",
            ">\tDisclaimer: English is my second language…\n\nI come across native English speakers every single day who aren’t anywhere near as capable of conveying a story in English as you have been. You’re doing great; keep it up!",
            "That's hilarious 😆",
            "Just out of curiosity, were you allowed to fly first class on these long haul flights between Europe and Africa?  Personally I think it would get old very quickly if I had to do that on a regular basis in coach.",
            "Penny wise/pound foolish.",
            "My manager, oops sorry, team leader (they want to make sure we understand we're all working together) will bill a couple hours each day every day for over a week  to the company checking and comparing flight prices in order to save $20 for a single person's one way trip.",
            "[deleted]",
            "Thanks for the tldr at the top so I could read it by accident before reading the story",
            "Local Optimization, For The Win, and then Global Money Loss for the company!   \n\n\n(edited from \"Local Optimization for the win, and then for the lose!!!)",
            "Did they ever try and “save” costs again? Or did your boss lose his shit at them?",
            "Sounds like the trip to Juba, South Sudan. Made that trip a few times",
            "This is what we know as \"death by KPI\" - each department has their own Key Performance Indicator and they will do whatever they can to improve them, even if it destroys everyone else's and the circle of doom gathers pace until everyone is killing the company but nobody notices because their one single vital statistic on their powerpoint is within the target specified.",
            "Not the same scale but my arsehole expense approved declined to pay for my parking at the airport because the policy didn’t say I could drive there. It did, but that’s a separate point. \n\nParking for Monday-Friday at this cheap offsite car park cost me £15 and enroute id pick up my colleague. So parking and petrol would cost the project around £20 for the week. \n\nWhen we were told we couldn’t do this we got separate taxis there and back at £20 each way so a total of £80 for the week. It was often more on the way back as it was easier to get an airport taxi than book an Uber and hope it showed up at the right time.",
            "I’m relatively sure someone in travel got ripped because of that.",
            "This is a common issue in disfunctional companies, where managers concentrate on their teams goals rather than the mission goals of the company",
            "Jesus is coming.  Look busy.",
            "So you say you’re 56 in the UK, what age are you up in other countries?",
            "Could have just told your boss beforehand, got yourself some goodwill, and the travel desk would have still got put in their place. Unless you're trying to stick it to your boss for some reason.",
            "****REAL**** malicious compliance! 👏🏾",
            "so your destination was Sierra Leone?",
            "Lol! Too funny, spend a pound to save a penny. 🤣🤣🤣",
            "Why do you have to refer to it as war torn country all the time?",
            "They are actors. Idc who they pretend to be. Ppl pretending they someone else everyday.",
            "Referring only to the name of the continent Africa and the country to which you travelled as “war torn country” are absolutely not a good look",
            "Why... did you not tell anyone about this?\n\nWhat actions or attitudes constituted fucking someone over with what could have been avoided by an email?",
            "Hahaha, excellent.",
            "Penny wise Pound foolish they earned the ID10T award !",
            "[removed]",
            "Sounds like every multinational company I’ve ever worked for lol",
            "Sounds about right!  And definitely a bean-counter looking for a raise!  Glad you actually got to have some fun out of the stupidity (night-out in Nairobi)!  My husband used to have to fly from Detroit to Dallas, sometimes to Denver THEN to Minneapolis/St. Paul traveling all day as opposed to a straight 1.5 hour flight.  \n\nGlad it wasn't ME!  After 12 years of flying all over the world as a Dependent with the Military, I developed a crippling fear of flying!  Not so bad now though.  I think it had to do with having children and flying with them.",
            "Thank you for putting the TL;DR at the top! So many facepalmingly put it at the bottom AFTER I've read through the whole thing!",
            "Do you work the US govt? Lol",
            "Stories like this always reminds me when I complain about making all of my own travel and accommodation arrangements myself, that I could be dealing with the hell of having someone else do it for me. I just make an expense report at the end of the month, justify anything out of the ordinary, and get my reimbursement. Easy.",
            "plot twist : boss knew what he was offering you ;)",
            "I'm dealing with something similar at work. When costs that are allocated to an org within the company are lower for a certain product but costs for the company as a whole are lower for a replacement, convincing them to make the decision that is best for the total company is challenging.",
            "Kenya believe it!",
            "All you brits talking about biscuits and now I am hungry.",
            "hahahahaha",
            "I liked reading that, corporate incompetence.",
            "Reminds me of when my employer had us sign out USB cables for our laptops because of theft.\n\nSo basically they made everyone spend 5-10 minutes fetching a cable necessary for their work. Doesn't sound so bad until you put it in money. \n\nSince everyone obviously counted this as working time and they earn about £12 an hour it means 5 minutes is about £1. Office carries 500 at one time. £500 per day to save on an occasional USB cable bought in bulk at possibly £2 each. \n\nEven if every second single worker steals a cable a day they would not save any money.",
            "So, what do they do when they shoot themselves in the foot? Right, reload abd blast off the other one for good measure!",
            "So how was this change allowed, if it directly incurred increased costs from your bosses budget? I'm not used to that sort of thing being allowed.",
            "This sounds like what my bf's company does all the time. Their finance department is so short sighted that I firmly believe it will be their downfall",
            "Wonder what happened to the employee who brought up the idea."
        ]
    }
]