[
    {
        "post_id": "1111nzu",
        "author": "becauselifeis",
        "title": "Call the cops? If you insist.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1111nzu/call_the_cops_if_you_insist/",
        "score": 14965,
        "num_comments": 361,
        "created_utc": 1676270433.0,
        "selftext": "Many summers ago I worked front desk at a regional headquarter of a multinational corporation. For a visitor to be granted entrance, they had to prove that a) they have an appointment, and b) they are who they claim to be.\n\nNow the first part was easy, no need to show us your email, just give us a name and we'd call that person to confirm. The second required some sort of ID though, driver's license, employee badge, something like that. Or your inviter would have to meet you out here and confirm to us in writing. Note that we didn't keep your document, we just needed to put down your name and take a real quick glance of your face and photo.\n\nMost of our visitors had no problem with the protocol. Some would voice their frustration but still comply. Well not this special guy. He got aggressive and demanded an explanation about the need for an ID when he was standing right here. Couldn't seem to grasp it however we tried, and he got increasingly louder. He didn't want his inviter to meet him outside because \"this is wrong.\" Security was ready to see him out when he screamed at us to call the cops, because we needed to be arrested and taught a lesson on civil rights.\n\nCalls were made, cops came quickly, and he went out in cuffs. Turned out they already had a warrant, just weren't in a hurry to get him. Icing on the cake was that he was here for a job interview.",
        "permalink": "/r/MaliciousCompliance/comments/1111nzu/call_the_cops_if_you_insist/",
        "comments": [
            "This is good for calming down for job interviews: remember that there are a lot of weirdos out there. Maybe you don't compete against the greatest prodigies in your field, but just against people like in this story.  \n\n\\[Edit\\] spelling error",
            "He thinks he didn’t get the job because of company policy",
            "I don’t think he got the job….",
            "When I was working dispatch for a local security company, i sent one of my patrol guards to a restaurant to deal with a not-so-gentleman \"loitering\" and harassing customers. Guard gets there, it's one of the usual crackheads that just about every guard in this town knows. (I have personally dealt with him on multiple occasions since, when I did city patrol, hes a real piece of work.) Dude starts losing his shit on my guard (who had a body cam, I quite enjoyed the video later), and not only pulled a knife on the guard, but demanded he call the police because he was being harassed. Guard was like alright if you insist, calls the cops and says \"yeah this guy pulled a knife on me and started making threats before demanding I call you because apparently I'm harassing him\". Cops show up, ask him outright if he'd been threatening the guard with a knife (which the guard had been able to get away from him) and the guy straight up admitted to making threats with a deadly weapon lmao needless to say they laughed him into the back of the cop car.",
            "Sometimes the bullet dodges you...",
            "Man, a guy like that's gonna go places! Like right to jail, don't pass go, don't collect $200....",
            "If you're there for an interview, why on earth would you be a dick???? Like. Did he not realize people talk to each other....?",
            "What did he think he was interviewed for by screaming in the lobby? Public relations? SMH",
            "OOOOOF.\n\nLesson #1 with interviews: be nice to EVERYBODY. There's a reasonable chance the hiring manager might be asking the front desk how they were treated by the potential new hire.",
            "On his job application form:\n\n-Have you been in contact with the police the past 5 years?\n\n“Not yet!”",
            "First test in any job interview, get pass reception.",
            "[deleted]",
            "Why would someone with a warrant on them ask for police to be called in a situation that no-one with a brain cell could think warrants (sorry) police attendance?",
            "Lmaooooo omg for a job interview!!! Dodged that lawsuit, lol.\n\nMan... Why would you get that bent outta shape on that?\n\nMind, I interviewed an old man who used to be a radio host yeaaaaars back. He was so rude. It was two femme presenting people, half his age, interviewing him for a position that would report to a woman 10 years younger than him with probably 20+ years more direct and progressive experience.\n\nThe interview lasted less than 10 min. \n\nHe interrupted our question to tell us he wasn't used to being on \"this side of the table\", especially not across from women\n\nWe just went \"oh, ok\", closed our books, and informed him the position would be reporting to a woman (something he could have easily found out if he searched her name which was on the ad). He seemed upset, so we asked if he wanted to stop the interview.\n\nAfter getting caught on his words for a few minutes, he just said \"yah\" and left.\n\nSome men are just... Not ready to be employable adults anywhere outside a retail setting.",
            "He had a warrant? Not the sharpest pencil in the box clearly.",
            "I used to work customer service for a big corporation and they taught us when someone is getting irate for no reason to pay EXTRA close attention to what you're doing. It's very common for scammers to use this tactic to throw you off your game",
            "Now if this was a post on LinkedIn, you would say:\n\nyou realized the person cared deeply about right vs. wrong and gave him the job based on his #attitude because we need that in the world.\n\nSince then in 2 years the person has been promoted 7 times and is the star performer.\n\nGive.\n\nPeople.\n\nA.\n\nChance.\n\n. #attitude #hiringwisdom #bestemployee",
            "r/wewontcallyou",
            "My brother was a dispatcher. When the department hired, someone looked up all the applicants amd they would be sorted into a pile with active warrants and pile for interviews. The ones with active warrants would get called back and arrested. There was almost always at least one who person arrested and I think the most was 5.",
            "Best story of the month. Thanks.",
            "A LOT of people don't seem to understand the difference between what THE GOVERNMENT is not allowed to do (ie, require ID to enter a *publicly*\\-owned building) and what a private business can do on their own property (like requiring ID to enter a *privately*\\-owned building).\n\n\"Civil rights\" don't apply in a privately-owned space.",
            "This can only be better if he actually call the cops himself.",
            "was it an HR job? sounds like he'd've been a good fit, before his fit",
            "Some morons don't know that the interview sometimes starts the second you step out of the car.",
            "Why is it always the jerks/crooks who fail to understand that private entities get to make their own rules for entering their property?",
            "Was his name George Santos?",
            "Kinda hurts he got the call for the interview and I didn't tbh",
            "I don't ever really plan on getting into that much trouble, but I like to think that if I had a warrant out, I wouldn't be so fast to get the police involved...\n\nAh well, most criminals are not brilliant masterminds...",
            "@OP, this guy didn't happen to throw a shoe during his fit of rage, did he?",
            "Sounds a bit like a mental health issue to me.",
            "Did he get the job?",
            "Some people are their own worst enemy.",
            "He’s a straight-shooter with Upper Management written all over him!",
            "Play stupid games, win stupid prices…",
            "It’s funny that people who have something to hide do the most to get cops’ attention",
            "I’ve worked for three different aerospace companies that had these policies to comply with export regulations specific to aerospace",
            "I've seen posts on Reddit from people who think they'll somehow get through an entire hiring process without having to verify their identity, and that somehow it'll be Ok they lied about their name and background... Gotta wonder if this guy was one of them.",
            "I am sus if this is real because you said cops came quickly.",
            "I feel like I've already seen this posted..",
            "Jeezus! And all he had to do was show his dumb id lol. Ah well, another gleaming example of a problem taking care of itself!",
            ">Calls were made, cops came quickly, and he went out in cuffs. Turned out they already had a warrant, just weren't in a hurry to get him. Icing on the cake was that he was here for a job interview.\n\nDid he get the job? :)",
            "At a previous employer, one of the key hiring questions was how they treated the person working the front desk. The interview essentially started the moment they walked through the front door. \n\nAfter the interview was finished, everyone they had interacted with was brought in for a meeting to discuss the candidate, including the administrative assistant who had been working the front desk when the candidate arrived. \n\nIt didn’t matter if they were God’s own gift to Engineering or software development, if they have anyone “bad vibes” they weren’t hired.",
            "He sure showed you.",
            "I'd love to know the story around that guy, as to what would make someone flip out over asking for ID at a big office.",
            "I've botched some job interviews but not to the point of needing handcuffs, well done.",
            "[deleted]",
            "When I worked for a local utility company many many years ago, one of the rules in the contract with our union basically read that we would not be required to use our property (tools) to do our job (meaning, the company provided everything).  \n\nThis included our government issued ID’s. \n\nI Can recall at least a half-dozen instances of being asked to return to a customer’s location after they make an “exception” to their policy after I inform them we wouldn’t be going on their location to install or troubleshoot their service.",
            "Ladies and gentlemen, I have some bad news. I did not get the job at Froot Loops.",
            "Worked at a ghetto AF gas station and we had a chick trying to start a racial fight. Tossed her right out into the street and she starts screaming “CALL THE COPS!  I DARE YA WHITE BOY!!”\n\n“Ok”\n\nNever dare bored retail employees.",
            "sucked to be that person, if you have warrants don't make a scene that could get arrested.",
            "So did he get the job?",
            "Oh that is hilarious.",
            "People with warrants are always trying to make the cops job easier.",
            "That is next level dumb. He obviously wouldn’t pass the background check but that is next level. \n\nMy husband had to go to a similar place for a work thing. We thought I could drop him off then come back and get him. No so much. We couldn’t leave the complex and get back in since he was the one who had the appointment. The kid and I had to kill about an hour messing around on the building’s lawn and watching a drainage pond.",
            "That is Prime CEO Material Right There!!",
            "[deleted]",
            "so, uh, did he get the job?",
            "That’s sad",
            "I think we know why he already had a warrant.",
            "Can you imagine the quality of this would-be employee??",
            "Maybe the reason he was so indignant was that he was applying for a job under a false name, and so if he gave you his ID, it wouldn't match the appointment name anyway?",
            "I’m pretty sure this is a repost, down the job interview! twist.",
            "Yet another example of how the criminally-minded are poor at thinking through long-term consequences and consequences detrimental to them.\n\nEven if he didn't know about the warrant, he showed a similar mentality to criminals with his actions. (Heck, if \"crime\" is expanded to ethic violations, there's a lot of bad managers who are \"criminal-minded.\")",
            "Guess you can put a big ol 110 on this guy's application.\n\n>!draw a line from the top of the first 1 to the bottom of the second 1and it spells NO!<",
            "While I wouldn't have been an asshat about it, i too would have questioned your need to see my ID unless I was specifically told of your policy at the time I made the interview that I would need to present it to you.",
            "When fuck around meets up with finding out!",
            "[deleted]",
            "Had this happen to me except a) they violated my rights as a patient, and b) they had me assaulted by law enforcement after *they* (the medical and admin staff) broke laws about my rights as a patient being treated and my right to revoke a doctor from touching my medical records after they had shown clear interest in misdiagnosis of my health concerns with medical treatment that differs greatly from what was recommended by specialists in the area they tried overstepping their credentials to suggest or diagnose otherwise.\n\nThe injuries and bruising and mental distress and assault I faced are the liability of the established facilities employees, doctors, admins, and any other staff involved in having me harmed for their own fraud of my health insurance being committed as well as their crimes against me as a patient.\n\nThey are still breaking those laws. Now I have grounds for a very large lawsuit against all medical networks in this city. But thankfully no private doctor facilities are involved... :/ And the kicker: I didn't want to have to do this. I don't want to be a lawyer.\n\nAnd I am so beat the fuck up by law enforcement committing crimes against me to assist my ex and his family with conspiring to frame me to be a criminal when I am the victim of these crimes, that I honestly can say they show blatant intent on psychological and emotional, as well as physical assault to create a false sense of a necessity for a suicide watch on the wrong fucking person. The person threatening to kill themselves has a kid hostage right now. (That person isn't me. I don't hold people hostage.)",
            "This guy said the desk person is racist.",
            "He didn't want the job. I bet he was trying to ride the unemployment train a bit longer.",
            "It's becoming increasingly easier to ID someone against their will, these people who refuse to ID themselves in normal situations MUST have a reason why. It's gonna be a real shock to them when a cop comes up to their car and calls them by name and shows a facial recognition database, with their full address, DOB, SS#, blood type, relatives, previous doordash orders and amazon reviews.",
            "Sounds like your work needs better background checks",
            "So, he didn't have ID...",
            "https://youtu.be/UNXy3z_NfCI",
            "Hopefully they offered remote work...",
            "I love happy endings so much. ❤️",
            "Don't leave us hanging. Did he get the job?",
            "nice",
            "Stupid guy deserves to remain jobless."
        ]
    },
    {
        "post_id": "12ptbnp",
        "author": "jthememeking",
        "title": "Stop slacking off and get to those insurance denials? Sure thing boss",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/12ptbnp/stop_slacking_off_and_get_to_those_insurance/",
        "score": 14961,
        "num_comments": 753,
        "created_utc": 1681758925.0,
        "selftext": "This happened a few years ago, but was reminded of it because a lot of it is becoming public. \n\nInsurance companies are not your friends and will do everything they can do save money, including not paying for your medically necessary services. There's a lot of news coming out about insurance companies using algorithms to deny claims and doctors signing off on them.\nBefore algorithms, they would have minimum wage employees reading over these claims for the doctors instead. \nThats what I was. I was 19 years old, working for a insurance companies denying claims. I would be the first line for doctors to call and give their case for why they thought they needed a service or medicine. For some reason, 19 year old me when no medical experience was allowed to tell these doctors that services were not needed medically. \n\nThis job was the easiest, yet most miserable job experience I ever had. I was only able to last a few months there. During my last 2 weeks, I was really slacking off. I was just so burned out. I couldn't stand denying yet ANOTHER case where someone needed meds and the insurance company didn't want to pay for them. I was reprimanded for not working hard enough and getting processed. \n\nInsert malicious compliance. I worked faster than I ever had before. That's because I approved every case that came before. Every doctor I spoke to, I just gave them approval. Every prior authorization I saw was approved. \n\nDuring my first week, I did this once and was told to not do it again because I have to follow company guidelines, but I didn't care at this point. I probably was able to approve 50+ cases before I quit. I hope it made it difference to those people. \n\nFuck health insurance companies.",
        "permalink": "/r/MaliciousCompliance/comments/12ptbnp/stop_slacking_off_and_get_to_those_insurance/",
        "comments": [
            "Where were you this past week? I went to see my GP on Friday afternoon and had 2 prescriptions called in to the pharmacy. I received a message that they were ready for pickup around 5 PM. I arrived at the pharmacy a bit before 6 and one of the meds was denied by the insurance company. I called the insurance company and talked to a person (he may have been on the West Coast and was still at work). He indicated that the doctor needed to approve the medication. I asked isn't that what the prescription is? He said that the insurance company needed further approval. I still don't understand what more they need.",
            "I worked in a pharmacy for over a year, and the pharmacist I worked with was one of the best in the county (possibly the state). One day she was talking to a costumer and I overheard her say \"I've been working here for 14 years and I still don't understand insurance.\"\n\nNo offence, but it makes sense that those Prior Authorizations could have been based on someone still young enough to be in highschool basically just going \"yeah, sure\" or \"nah, not good enough.\"\n\nFuck insurance companies, they causes *at least* 80% of our issues, most likely closer to 90%.",
            "When I was a working physician, the worst part of my life was dealing with insurance stuff. Now that I'm disabled and can't work, the worst part of my life is dealing with insurance stuff",
            "This is the best one I’ve read. Thank you for your service.",
            "What exactly is the point of insurance if they're going to deny claims willy-nilly???",
            "First of all, thank you for serving the people instead of the company!\n\nBut this raises the question -- what *were* you allowed to approve that wouldn't get you in trouble?",
            "I genuinely don't understand insurance in America. \n\nHere we have the NHS and we also have private insurance available but many people don't bother with that as it's not really needed for the majority. I pay for insurance and have never had a single issue making a claim.\n\nI broke my leg in November and have non union so I need another surgery. I made a 5 minute phone-call today where they immediately approved for my CT scan and follow up appointment and gave me the procedure for approving the surgery (procedure is literally \"ask your doctor for the procedure code so we know what they're doing, ring us to give us the code and we'll approve it\" that's it, very simple). She also added in \"additionally, if you'd like to arrange a consult with a different surgeon just to get another opinion and confirm they agree with the proposed treatment plan that's absolutely fine, just let us know and we'll get that approved for you\". I didn't even ask about that. That's just an extra thing they're willing to pay for that they made me aware I could have if I wanted it. \n\nIn 1 year I claimed more than I have paid into the policy in the entirety of the 8 years. I still have no issue making claims for anything I need. \n\n(I visit doctors and hospitals more than I see my parents. I was unlucky when it came to the genetic lottery)",
            "Love it!",
            "Our government in Canada stepped in to end talks about allowing any private healthcare to get a foot in the door here. That really says something: \"our system may be failing, our constituents may have to wait months to see a doctor, all medical operations are delayed if they're not critical, and the rate of assisted suicides may be spiking because people in deteriorating conditions are in so much pain that they would rather die than wait for much longer to receive a life-saving operation, BUT we'll be fucking damned before we let private health insurance fuck us\"\n\nEdit:our PROVINCIAL government here in Canada. As another commenter reminded me, healthcare is a provincial issue.",
            "What pisses me off, is why they think they have the right to dictate the quality of life someone lives. Especially when WE are the ones paying for the damn insurance!!!  I’ve had a surgical procedure denied because of the “temporary code” that is used to classify it. It’s a newer non invasive surgery so I don’t have to have my joint fused together with bolts, but my doctor said the insurance would probably approve the old school surgery method. Like I’m in my 40’s and not sure I want my joint fused together with bolts just yet. I HATE our f’d up medical care system in the US!!",
            "You have to really get on their ass as your own advocate. I was diagnosed with cancer. My chemo was approved but they didn't approve radiation. They didn't deny it, they just were dragging their feet. Chemo and radiation therapy work together which is why you have them together usually. I had to call them and tell them that my cancer had no doubt spread in the freaking 2 months that I was waiting for any treatment and per one of my oncologists I may now need additional treatment. Which would cost them big time. The approval came through an hour later.",
            "Let's privatize health insurance, and let the insurance company determine whether the insurance company should cover the cost of healthcare.\n\nDictionary definition of conflict of interest.",
            "It seemed like every insurance claim I had was getting denied. Then I had to spend hours on the phone jumping through all those telephone hoops to talk to someone about it. They were legitimate claims so nearly all went through. \n\nOne denied claim was the most infuriating. My son broke his wrist falling off his bike. I called his doctor, who told me to go to the emergency room. We went and son came home in a cast. Claim was denied because I didn’t get pre-authorization first. Doctors require 3-5 days to provide the pre approval paperwork. Since when do you have to wait 3-5 days to go to the emergency room when your child breaks a bone? Can you imagine the people with heart attacks being told by their insurance company that the claim was denied due to not getting pre approval?",
            "The government needs to break some of these companies up and set strict guidelines. Phone numbers must be on the back of insurance cards Blue Cross is always a crapshoot. calls must be answered in so many minutes or it's a fine payable to the providers calling in and yes out phones know who we call and how long we are on the phone. \n\nAdjustments and reviews must be done in 14 days or it's a set fine that increases exponentially. \n\nIf a carrier needs more information it is on them to request it in writing, specifically stated what is needed, from who and why. If it's time sensitive like a prescription phone calls must be made and documented. \n\nOverpayment requests must explain in detail why the overpayment when it happened and the root cause.\n\nThere should always be a party that can easily be contacted that can resolve the issue and have a good grasp of English and I cannot emphasize this enough have a good enough connection that they can be heard clearly over their VOIP.\n\nI can think of more given time and as always, I am ready willing and able to meet with elected representation to initiate legislation to get the corruption out of healthcare.",
            "Insurance companies are making the US a more sick and more criminal country. Health should be a human right.",
            "A few years ago I was in the middle of nowhere and got hospitalized for a week with a bacterial infection. I was receiving IV antibiotics every 6 hours for 7 days.  Insurance denied it because \"the level of service could be done at home health level\". \n\nI had a very frustrating conversation with the insurance person (nurse practitioner) on the phone who was involved with the denial. She said they have an algorithm for things and the algorithm said this could be done at home health. I kept reminding her that I was in nowhere land and there wasn't a home health service that could do it nearby, and she kept replying that the algorithm doesn't take into account location. Your algorithm sucks lady.",
            "I worked for a dentist back before computerized requests. To get a pre approval you mailed in a form with the x-ray attached. No matter how I sent the paperwork, they \"never got the x ray\", and I would have to send it again. I once taped it to the sheet wrote \"x ray here\" along all 4 sizes of it and used stars, arrows and exclamation points. I still got told they didn't get it. I then asked her if she could see the paper I sent, yes I have it here ( scanned). What does it say? X-ray here? According to them the machine opening the mail would destroy the x-ray. BS, but whatever. I then stopped mailing the x-ray until after I got the denial letter. They were a pain to make a copy of. I would send every appeal with an x-ray and they never got denied. But only ever on appeal. First mail in was ALWYS denied.",
            "Thank you for doing the good work them last week days.",
            "I had a prior authorization denied because the steroids I needed for my pneumonia were prescribed in a bottle, insurance would only cover them in a blister pack. The pharmacy had to have some brought in from the other side of town because insurance was convinced I didn’t need the 15 pills in a bottle but rather needed the 15 pills in a pack.",
            ">Fuck health insurance companies.",
            "Thank you for your service",
            "I still don't understand why insurance companies can practice medicine without a license, but if I do it, I could get thrown in jail",
            "The hero we needed and deserved. Thank you.",
            "Ah, the true joy of PBM prior authorizations. If it weren't for that pesky non-disparagement clause in my severance agreement...\n\nBut - to keep it general, PA's are all about cost containment and directing you to use the least expensive medications AND those on the formulary. (How medications get selected for a formulary is...well, you can google that.) \n\nWith the current system, the best thing you can do when you get a new brand (not generic) medication is to check the formulary on the website to see what the PA requirements are. You can often start the PA process yourself. The doctor's office will still need to respond to the PA request, but if you know what's needed it can really expedite it. \n\nIf you're denied, there are also multiple levels of PA's that you can raise the denial to. Tell them you're willing to go to the \"External Review Board\". \n\nAlso - any time you get a brand prescription, always check the manufacturer's web site to see if there are any co-pay reduction cards. I'm on two brand medications that are at my plan's highest co-pay tier (yeah, they both needed PA's) - but with the co-pay card I pay $0 each.",
            "My insurance company almost killed me. At 42, just last year, I had an abnormal EKG, an abnormal stress test, an abnormal CT scan. Insurance declined a heart cath that a cardiologist, general practitioner and radiologist all agreed should happen immediately. It took me changing insurance companies entirely and having a heart attack for the cath to finally be approved. Had a triple bypass at age 42 and a heartvattack that could have possibly been prevented had the insurance company listened to the medical advice given to them by professionals in the field.  Funny thing is, I work in the insurance industry myself. It's a very jaded view that you are left with when this happens.",
            "I worked life insurance doing the same thing. People would apply and I would call them back and review their application and even if they mentioned something I knew would disqualify them I had to act like everything was fine. These were people just trying to pay for their eventual funerals.",
            "Bless you, doing doGs work, at least for those 50 people. It must have been soul destroying for a 19yo",
            "This brought tears to my eyes (in a good way). \n\nTruly, Americans need a real national health care system. If we can use taxes to pay for highways, airports, armies, and stadiums, we should be able to use taxes to keep Americans in reasonably good health.",
            "This is the system Americans are protecting when they resist universal healthcare",
            "This is sad as fuck. What a country where you can cheaply buy politicians to make this system keep going",
            "Ugh I feel this I work in insurance now but it’s my job to twist and contort reality to get as much covered for the callers as I humanly can. Squeeze what we can get out of their measly benefits. Even the “better” policies frankly suck. Prior authorizations piss me off to an irrational level, they are the bane of existence. It’s so nonsensical. Why should a doctor who’s never seen or met the patient decide if they do or do not need a treatment or medication? It’s nuts. I’m a nurse I worked in two batshit insane nursing homes for a decade before this insurance job. But after a back surgery at 21 years old and further complications years later I had to stop doing floor nursing. I didn’t know SHIT about insurance before, I’ve been here a year and I feel like I kinda sorta get it?? It’s all bullshit red tape to make it harder to have medical claims actually pay out. Don’t get me wrong I love my job im still helping people it’s just I can keep ranting forever about how bs insurance is lol",
            "I assume this is within the USA.\n\nI worked for a life insurance company here in Australia for 15 years. We paid like 98% of claims and all the staff actively find a way to pay people.\n\nHowever, if you did lie or deliberately mislead us we would cut you off. If you commit fraud we will hunt you down.\n\nAnd we would do it with passion because we all wanted to help people and shitty people like that made it worse for everyone.\n\nThat being said there was a very robust process you had to follow to tell someone to shove it. For example a week of surveillance showing someone working every day when they are saying they weren’t is not enough by itself.  That level of information.",
            "It’s ridiculous. Then one appeals and they just deny it too.",
            "Not all heroes wear capes.",
            "I used to work for a major life insurance company (the one that uses Snoopy) and their death claims department would find any way possible to deny claims.  Pretty shitty that life insurance companies try to deny death claims. They hope to make the claim process so difficult that the beneficiary will give up making it. I remember this one specific case where a lady's claim on her husband's policy was denied because the doctor forgot to put the cause of death on the death certificate. How petty.",
            "Fuckin hero right here",
            "This makes me want to get this same job and see how long I could do the same thing before being fired.",
            "I'll *never* understand why our insurance at the time said ear drops I had to have for a bad infection - $100 or so, no other option it had to be that one kind -- were not medically necessary.\n\n**I would have gone deaf without them!**\n\nWtf! Going deaf is acceptable? It was easily fixed! And $100 wasn't even that bad in medical terms, I mean ughh.",
            "Haven’t we heard about so-called “death panels” if we went to single payer or MFA? Guess what dipshits, people like OP unwillingly are those death panels.  OP was 19, no medial training, yet has a say in your healthcare that you pay through the nose for! Happy? I’m not. We need universal healthcare and we need it now.",
            "Of course we need these for-profit companies deciding my health care needs, anything else would be <whispers> socialism.\nGasp",
            "I think you saved as much lives as seatbelts do in the same timespan across the country.",
            "I had to stop using insurance for my meds because insurance told the pharmacy my psychiatrist needed to submit a prior authorization request while at the same time telling the psychatrist the pharmacy had to submit it. Good thing my meds are generic and never even got me to my annual deductible anyway.",
            "I wish you had some of my cases.",
            ">Before algorithms, they would have minimum wage employees reading over these claims for the doctors instead.\n\nWhat country is this in? Because my friend was a Registered Nurse *who became* a Case Manager to review and approve claims. She had to study to pass exams to get that job with a major US health insurance company, Shm-Aetna. I am having a really hard time believing this is a minimum wage job. I would sooner believe algorithms do it before I believe minimum wage workers.",
            "If I was in charge of the laws governing health insurance companies, they wouldn't be allowed to deny claims of any kind ever.  The doctor wants you to have it?  You get it.  Period.",
            "Insurance companies have always been so stupid. 30 years ago my daughter, a passenger, was rear ended by a drunk lady driving her BF’s car, ambulance was called and she was looked at in the ER. \n\nI just wanted his auto insurance to pay her 800$ bill. That’s all. No pain and suffering and all that. They would not do it. \n\nWhen the bill got sent to collections I called a lawyer. He wrote one letter to the insurance company. She got $11,000 after the lawyer took his 30% cut.",
            "I've been taking a medication for approximately 15 years.  For some reason it's classified as a controlled substance.  As a result, I am required to renew the RX every 6 months.  It's an important med that I need to stay functional (anti-narcoleptic.)\n\nWhen my company changed insurance to one that used Caremark for RX a few years ago, they started requiring a prior authorization.   But first, I had to argue for three months just to get them to cover it because they claimed my chart had a previous diagnosis on it from years ago and the medication was not covered for anyone who had ever had that diagnosis.  It involved lots of phone calls and letter-writing, and in the end, the CEO of my company had to call the people who were providing the insurance and threaten to change plans, before they finally agreed to cover it.    After a new insurance came in with Optum for RX I then had to write more letters and make more phone calls and do more arguing.  Fortunately, we changed to BCBS 2 years ago and I no longer need prior authorization.\n\nIn regards to the \"health care\" system in the United States --\n\nI have always believed that the United States Supreme Court's decision in *Citizens United* was the decision that finally killed representative democracy in the US and sold our government to the highest bidders.    The moment they decided that a corporation was politically and legally equivalent to a private citizen, and entitled to all of the same rights, protections and freedoms as a private citizen, the concept of equal representation was over and done, and indeed, the very concept of elected representation was done. The will of the people and the public good are irrelevant when elections are decided based solely on who can spend the most money and our public policy is guided by the best interests of corporations and billionaires.  If that's not you, then as a citizen, you no longer have a meaningful voice or a say in how our government works.\n\nThe end result is that politicians who had already been corrupted by the ~~bribes~~ campaign contributions of the wealthiest Americans were now further corrupted by millions of dollars from corporations, ensuring that for as long as *stare decisis* remains in place for *Citizens*, every single decision made by our \"elected\" representatives is merely a reflection of the wishes of the corporations whose money informs every decision they make and every position they support or oppose.   Want to win a seat in Congress? The endless corporate money can buy one for you, provided you're willing to make sure that every vote you cast aligns with the best interests of those same corporations.  If you don't toe the line, they can take your seat away in the blink of an eye just by redirecting those endless streams of money to other candidates who aren't bothered by things such as ethics and the will of their constituents.\n\nThis is why meaningful health care reform in the United States is currently a pipe dream, and why a nation that once took pride in being among the world's foremost innovators is now saddled with an antiquated third-world health care system that exists only to make Big Pharma and Big Insurance, along with their \"owned\" representatives, wealthier and more powerful, while taxpayers and the sick, injured, and poor shoulder all of the burdens.",
            "There's a great Grisham book about this topic called \"The Rainmaker\".\n\nThey also made a movie of it starring Matt Damon, Danny Devito, Jon Voight and Claire Danes.",
            "God I work in a pharmacy and insurance companies rile me up like no other. Why the hell do you need a prior authorization for a doctor that's in network? Them being in network implies that the insurance wants to work with them, so why the fuck are people with zero medical knowledge allowed to refuse to pay for treatment, especially when the provider is already okayed by the insurance?",
            "My mom had a lot of health problems and procedures and meds qnd I remember a lot where she would be approved BY the insurance after waiting forever. Get the thing done and then within Days of getting it done (2-3 days) they would call saying \"it's been denied you now owe us a kajillion dollars\" and my parents would have to fight with the insurance and prove it was approved. It happened a lot. They would claim they never did and wanted a reference number and finally would be like \"oh would you look at that? It was approved\"\n\nThey're in the buisness of making people feel better. Giving affordable Healthcare. So why don't they ACTUALLY DO THAT instead of making everyone's life hell by denying everything to save a buck and making it super complicated and expensive.",
            "That’s why my insurance denied a topical NSAID that I use. \n\nDenial letter: “have you tried ibuprofen, naproxen, meloxicam”. \n\nMe: “no dickheads, I’m on a blood thinner and CAN NOT TAKE NSAIDS, if you knew anything about my medical history you would know this, hence the prescription for a topical”",
            "And this is why we need a single payer model like every other advanced nation, and to cap the profits of healthcare, equipment, and pharmaceuticals so that we don't have to increase taxes. \n\n(Fun fact, when you take Medicare and Medicaid, add them together then divide them by the ***total*** population of the US, you still get a number higher than Canada or the UK pays per person. We ***can*** afford it if we put the price controls in.)",
            "American healthcare is an oxymoron.",
            "I'm reminded of the time my allergy medicine had a co-pay increase of $20 because it was considered a \"performance-enhancing drug\"! Yes, breathing through my nose is \"performance enhancing\". Smh.",
            "You should preference this as Health Insurance Companies. \n\n&#x200B;\n\nAs someone who is a property, and was an auto, adjuster I can tell you that is not the case for property and auto insurance. \n\n&#x200B;\n\nHealth insurance is a completely different animal and I cannot speak to how those adjusters handle claims.",
            "HERE HERE!! Agreed, our healthcare system is BROKEN, corporations are working nurses to the point of exhaustion & mental/physical illness. But you better believe those insurance company CEOs AND doctors are making out like bandits (pun intended) while Americans get sick and need care.\n\nCitizens United gave corporations personhood to the point where they cannot vote, but they can grant give-aways to our politicians who then grant MORE give-aways to the uber wealthy (some of whom are the heads of healthcare insurance companies and got that way by denying claims to sick Americans, letting them die while they roll in YOUR dough) while we get fucked.",
            "Bless you. As a devout atheist, I bless you.",
            "From what I understand, they use a Magic eight ball now...",
            "Wow! What state were you in? Any denials in my state require review by a MD before we can give them.",
            "Make this viral!",
            "Thank you",
            ">I probably was able to approve 50+ cases before I quit\n\nWhy not just keep approving everything until you're fired? Sounds like a positive, rewarding job.",
            "For a brief moment your company did a bit of the job it's supposed to do.",
            "I worked in private auto/property insurance in Canada. We had the lawyers constantly reinforcing a culture of giving the insured the benefit of the doubt.\n\nIf you are looking at a claim looking for reasons to deny it instead of looking for truth and assessing coverage, you are acting in bad faith. Bad faith costs millions in punitive damages and the courts are definitely happy to bring the hammer down on anything that even smells like bad faith.",
            "One day health insurance companies will be remembered as mass murderers.",
            "My mom has both worked as a nurse and insurance provider, only leaving to care for her kids and bc they generally sucked, and SHE still gets frustrated dealing with insurance. If someone who's actually informed and knows the system can barely work the system, it is IMMENSELY fucked. \n\nOr, y'know, works fine and is just specifically made to fuck you over.",
            "As a pharmacy tech who has WISHED to have a job in an insurance company so I can approve all PAs, you have made my day.",
            "It disgusts me that insurance companies are full of people with ZERO medical license, and they have the power to tell a doctor or pharmacy no.\n\nTechnically that makes them unlicensed practitioners.",
            "I dont understand how ICs can make medical decisions against a trained and educated doctor, presumably an expert in their field. Why can't they be sued for practicing medicine without a license? They are sometimes denying life-saving procedures and costing someone a life. Why can't they be held responsible for that person's death? Why am I forced to pay thousands of dollars a year, just for someone to tell me I can use that money I paid into the company for my health to be maintained, to maintain my health?!",
            "I believe that if insurance is required that insurance companies should be non profit. Simple as that.",
            "hey, this compliance isn't malicious, it's benevolent!",
            "Ohhh is that why all the meds that were covered by my old insurance are not covered now by the new one?",
            "Chaotic good. You rock. I have been a patient for 13 years. \n\nThe approval process is hell. I’m surprised they cover my walker. Oh wait, I bought that after the dr told me and the insurance was too slow…\n\nI am an atheist so my best way to express deep gratitude is may all humans throw only rose petals at your feet.",
            "I have a kid with a rather uncommon medical condition. My kids doctor told this that she was going to prescribe a course of treatment without stopping to catch her breath she said \"I'm going to prescribe this, they are going to deny this, I'm going to explain to them how they're wrong until we'll get it approved, okay?\"\n\nShe was so unfazed by the process and I'm sad to say had internally normalized it. She just expected that that was the normal process to have a doctor's prescription denied first try.",
            "We legit had a health insurance company that would reassign our monthly premiums from March and April to January and February. This showed double payment in January and February, but then showed that we hadn't made any payments for March or April. Then we got a cancelation letter. Conveniently this happened because we had 3 doctors appointments in March. Spent like 5 hours on the phone getting it fixed.\n\nThis happened FIVE MORE TIMES for a plan we had for 9 months. Each time it would be for different months. Each time it took 5 hours to fix. We once ended up at my child's doctor when she had strep and a 104 degree fever with the office telling me my insurance was canceled. Thankfully my doctor's office understood and let us continue our appointment.\n\nThe last time it happened was more than 1.5 YEARS after the policy ended. They again picked the month with the most doctor's appointments and \"reassigned\" the payments to January and February.\n\nThe only way it could be fixed:\n\nI got a supervisor on the phone, told them I was recording the call and gave them every bank transaction ID from every payment I made. I made them give me their confirmation codes and the dates they received the payments. Then I made them send me a paper document listing all bank transaction and the corresponding month's premium they applied too. And of course, now that I made them document it, they couldn't do it again.\n\nThe kicker? Like 3 years after the plan expired, they sent me a check for like $70 stating that we overpaid (we absolutely did not). I immediately tore that check up. They wanted me to cash the check and then claim I made underpayment somewhere and cancel my policy and get their money back from the doctors.\n\nFor profit health insurance is criminal. There's no other word that describes it.",
            "> Insurance companies are not your friends and will do everything they can do save money, including not paying for your medically necessary services.\n\nOh my gawd! no way... the industry that lobbies on the premise, \"If you're poor, you deserve to live in pain and die prematurely from undiagnosed conditions that are probably treatable, but are at least manageable.\" isn't my friend.\n\nSarcasm aside, BlackRock has their hands in all the major insurance companies and by extension, all the political \"donations\" that have kept us from universal healthcare since 1988.\n\nAs founder and CEO to this day, if we consider all the years of lost life from this medical neglect, even with a mere ~10% of the equity, that would make Larry Fink one of the greatest killers of American lives.\n\nWith him controlling nearly 5-15% of the equity in all the 2000 largest public US companies (probably international too), he's probably one of the most successful killers of all time (by indirect means).",
            "Good for you. The US healthcare system is a sick joke. It's about 3x the cost of other western countries healthcare, it has poorer medical outcomes overall and is unavailable to many who cannot afford it. Price gouging is rampant from hospitals through to the cost of drugs. Drugs are much more expensive in the US and unbelievably the GOP refused to pass legislation allowing the Government to negotiate discounts for bulk purchase of pharmaceuticals. It's a dysfunctional, expensive,  inefficient and unfair system  but stupid Americans don't want universal healthcare because Socialism. America must be the only country where the poor act and vote against their own interest because the rich tell them too.",
            "My husband is a chiropractor and he has pretty much switched his practice to only handle car injuries. Insurance companies don't pay squat. It just floors me, if you go to your GP, the insurance will pay several hundred dollars. If you go to a chiropractor the insurance might pay 40 but that's in conjunction with the copay which nowadays is usually more than 40.\n\nA friend of his from chiropractic college just closed his practice and got an hourly job, starting over.",
            ">For some reason, 19 year old me when no medical experience was allowed to tell these doctors that services were not needed medically.\n\nI don't understand how there aren't massive class action lawsuits against insurance companies for this yet. And they do it for homeowners claims as well. Perhaps not as immediately life-threatening, but when most people have their home as their single largest asset, screwing with the claim easily puts people on a path to financial ruin just like screwing with their healthcare can easily end them up dead.",
            "As someone who works on the other end of this (submitting those claims) fucking THANK YOU. My goal every day is to bleed every insurance company dry.",
            "a drug i had been taking for 2 years was denied and delayed for almost 5 weeks.  i had to call back and forth.  doctor, pharmacy, insurance company.  had to talk to each one multiple times, finding out what got denied, why.  prior auth got denied multiple times.  filled out wrong.  why.  nothing has changed.  why.  fine, talking to them again.  why.  fine, submit again.  why.  fine, submit again.  i've been out for 2 weeks, whats going on.  again.  GREAT, RUSHING TO PHARMACY.\n\nfuckin.\n\nanyways, thanks for trying.",
            "My mom did workers comp for 30 years. There towards the end they demanded employees start denying 25% of claims no matter what. My mom refused. She knew they were looking to fire her- and so she did what you did. Sent out big fat checks and approvals for everyone she could find that deserved it. Insurance is a shit hole cesspool.",
            "It shock me how US has the one of  best doctors and scientist in medicine working  in US but medical care system is cruel and most dont have access to it without going to crippling debt .(pre obamacare) Usually when I travel I get travel insurance incase something happens and i need hospital care , I arent worried about how much they cover in most countries but if I ever visit US I have to get higher package insurance just to be safe .",
            "Some libertarian explain to me how this is better than Medicare.",
            "the hero we need",
            "Thank you.",
            "It would make more sense for insurance companies to be have a list of what they cover specifically (using codes) and then have to have specific reasons as to why they denied the claim on a case-by-case basis. With the doctor that approved the denial signing his name to it and putting his liscense on the line with every signature.",
            "Fuck the American insurance and medical systems.",
            "When I was in my early 20's I worked as a skip tracer for a radiologist. If a person went to the emergency room with - say - a broken arm, the hospital staff would show the Xray of the arm to a radiologist who would officially pronounce it broken and advise the hospital staff on the proper care. The patient would never see the radiologist, and because the US health system is dumber than a pack of coked-up weasels, the radiologist's work was billed through their own practice, not the hospital's. So that person with the broken arm would have no idea that this debt existed. As a skip tracer, my job was to cold call people with overdue bills to get them to pay. We were supposed to try at least 4 times before writing off the bill. I got familiar with the addresses of the nearby homeless shelters and started writing them off without making a single call. Fuck this system.",
            "I was 17?  Worked for three days for Cigna. My temp job was simply to write “denied, check for pre-existing condition” on every claim. No reading. Just write.",
            "I work in medical billing and some days I'm just so sick of begging the insurance company to just pay the bill! I have to chase claims and resubmit things that should really just go right thru. It's very discouraging and frustrating to say the least.",
            "They are the absolute fucking worst handmaidens for satan. I once had a company refuse a patient’s meds because it wasn’t on their approved list. But they also could not tell me what meds for the condition WERE on the list because it depended on the specific plan. No where to find it online, the doc doing the denial claimed they could not tell from their end, and had the balls to tell me the patient should have a physical book that TELLS them what meds are covered. Bitch, no one EVER brings in a book from the insurance, and if they DID, there is a 90+% chance the information is already outdated. I still get occasional calls from people asking if I am in their network because the insurance lists me at a practice that DOES NOT EVEN EXIST (since 2005!!!)",
            "As someone with acquired brain injury from a work accident, I get it. What should have been a smooth run for insurance to pay for my care (with amazing doctors helping) has been turned into a fuck fest with me losing my job, house, finances and sense of purpose. All because insurance says I was like this before the accident??? Never trust insurance companies!",
            "I worked at a power company for half a year as a billing rep. Once winter hit we were constantly flooded with calls asking us please to not turn off their power and trying to set up payment arrangements that we were told to deny most of the time. There were rules in place regarding not shutting off power during certain cold months if they had children in the home, but even still it just felt like I was putting already struggling people in a worse place. People would cry over the phone to me daily asking for advice. My last two months I started giving everyone half a year to a year extensions, scratching shut off notices left and right, setting up the most convenient payment plans possible. They only really reprimanded me once since I was a good employee and I assume they were busy monitoring other agents, then one day I never went back.",
            "Cheers to you. You deserve many awards.",
            "I feel for all of you.. The American Health Care system is totally shite.",
            "Friends don't let friends vote Republican and this is why.",
            "Would not the Geneva Convention have something to say about this?",
            "My G.I (i have crohns) had to fight my insurance company to get my remicade covered because otherwise i would not have been able to afford it. The insurance wanted me to stick with a medication that gave me pancreatitis. \n\nIm so thankful to my G.I.",
            "I used to work for an insurance company, insuring assets not health at least, and I felt like a fucking parasite every minute I worked there.\n\nI'm glad you made it out of there memeking.",
            "Thank you for doing this. I have done so many prior auths for patients at the hospital I work at. It's an infuriating, deliberately laborious process and I'm already so burnt out and overworked as a resident. It shouldn't have to be \"going the extra mile.\" Our system is so fucked.",
            "Meanwhile, in Australia, private health insurance just pays out the cost that our Medicare (funded by a 2% levy on your income) doesn't cover - depending on exactly what kind of private health cover you have, if any.\n\nIt's cheaper all round to have govt funded public health insurance + private cover for the stuff that the govt doesn't cover fully or at all.\n\nAlso, a Pharmaceutical Benefits Scheme (PBS) so that medications cost absolutely stuff all because they are subsidised by the govt. It's again, cheaper to have healthy citizens than unhealthy ones.\n\nTL:DR - govt funded healthcare costs less.",
            "Whatever you have to do to get your soul back and not have any regrets.",
            "This is like McD's employees sneaking an extra nuggy in the box, except way way more life-changing.  \n\n\nOn a related note, my primary metric when looking for insurance of any kind is claim rejection rates, and appeal success rates. If an insurer has high rates for both you know they're rejecting things they shouldn't, and you will have to fight them every time to eventually get your claim paid out.",
            "For all you evil Insurance execs here, the obvious solution is to make the options only \"Deny or escalate for further review.\" \n\nIf an employee escalates too many requests they are fired. \n\nAlso, tier 2 is also \"deny or escalate for further review\" \n\nAs is tier 3...",
            "The USA is so fucked up.",
            "Typically, I'm a smaller government, low regulation guy. In the case of Insurance and medical needs, I strongly believe in more regulation of the insurance companies, so they aren't allowed to deny as much as they do now, AND, I strongly believe that the government should be setting price caps on things, similar but more comprehensively than the insulin price cap. The insulin price cap currently only affects people on Medicare, but it should be regulated to a lower price, and should be for everyone, not just those on Medicare. These corporations are actually killing people, and ruining people's lives, and should be held accountable. Insurance companies, and medical companies are out of control, and it's costing citizens millions of dollars needlessly. \n\nA 2018 study estimated that one vial of human insulin costs $2.28-$3.42 to produce, and one vial of analog insulin costs $3.69-$6.16 to produce. At those production rates, a year’s supply of human insulin could cost $48-$71 per patient, and analog insulin could cost $78-$133 per patient per year.\n\n(Link to study: https://gh.bmj.com/content/3/5/e000850 )\n\nThink about that. At the most, one of those can cost $133/year. Based on the price cap that's set with Medicare, the average diabetic on Medicare is paying $420/year. Now think about this, people NOT on Medicare are paying MORE for insulin. The companies that produce it are making billions of dollars, because they are allowed to mark up life saving medicines at an exponential rate.\n\nThis doesn't just affect those on insulin, there are tons of other medications that are the same way. They are cheap to produce, yet expensive to buy, because there is a severe lack of regulation on the price they can charge. \n\nInsurance companies don't care that medicine is expensive. Even if they're ordered by the government to cover more, they'll just raise your rates. If we can bring costs down significantly in the medical world, it will lessen the need for insurance companies, and it will be easier to regulate them, as they can be forced to only raise rates at a set percentage a year, instead of whatever they feel like, their costs will be lower, and it will still be profitable for them if they're forced to cover a lot more.",
            "Fuck insurance companies",
            "I wear dentures, top & bottom because I have no teeth (obv right?).  I need new lowers right now. So, insurance covers re-line @ 50% and a brand new one @ 100%, not sure why but ok I’ll get the new ones.  Turns out I need PA, ok, fine. I wait a week and they come back with \"before we cover your new dentures you need a full set of x-rays\".\n\n??? X-rays of what exactly? Proof I have no teeth? \n\nIn the meantime I can’t wear my lowers because they don’t fit anymore and each new appointment takes a week and then I wait a week for insurance. I figure I’ll get my new dentures by the time my birthday comes around at the middle of next month.",
            "My insurance company tried to not pay the pediatrician bill when I had my son, saying that the doctor’s office billed the wrong insurance (they have a two tier system). I fought this for so many hours it was crazy. I even was threatened with not being able to continue seeing my pediatrician for my baby’s wellness exams if I didn’t pay the bill. I ended up paying it and several months later got a refund. Health insurance in the US is criminal.",
            "I had an OB who, when told the insurance company wanted her to discharge a patient that she thought should still have another 24 hours in the hospital, would call the insurance company and inform whoever she was talking to, usually in another state (and Round Rock, Texas isn't anywhere near a state line) that *they* would need to come to the hospital in person to authorize the discharge, because she wouldn't, due to whatever good reason was the case with that patient. \n\nIt was effective.",
            "Yesterday I called the person who denied my son’s tubeless insulin pump. I left a voicemail calling her a demon and telling her I hope that next time she needs something medical it’s denied. I’m glad you figured out this job was pure evil and atoned by approving things before you left. Thank you",
            "This is why I don't have pet insurance. With 8 cats all getting ill with giardia at the same time, every single claim was denied citing a different reason for each one. Had it all been the same reason it would have made sense, but by doing what they did it literally shouted \"we'll do anything to deny your claim!\"",
            "And that's exactly why insurance companies should have ABSOLUTELY NOTHING to do with people's medical care. They are making money on other people's misery. \nIllness can happen to anyone regardless. First people pay money to get help if they need it. And when they do, they get non. And the companies leave them dying or ruined financially.",
            "I've actually worked for a health insurance carrier and in claims. You are full of shit. That's not how it works and no way some 19 year old kid without a degree is handling preauthorizations and appeals.",
            "Given the US's penchant for domestic terrorism, how are any of these insurance companies still standing? I'm surprised they're not under near constant assault from their customers",
            "Ok to clear a few things up. First I hate insurance companies as much as anyone.\n\n But in the u.s. companies are required to pay out 85% of all premiums the patients pay in.  The other 15% is to cover operating costs.  If the members of a plan don't reach that 85% threshold the insurance company has to refund then the difference.",
            "Damn.. You quit?  You could have helped so many people before they fired you.  I would have stuck it out.  You were in a place where you could literally change lives for the better.",
            "Ahh the fresh smell of bullshit…\n\n…there are literally laws in every state that prohibit this exact fantasy from occurring.",
            "ITT: Everyone knowingly paying insurance premiums for services they’ll never be able to receive. \n\nBut hey, federal government has mandated we have to, so I guess we have to right?",
            "This had to be more than \"a few years ago\".\n\nWhen I started at a health insurance company in 1997, there were already strict review standards.  \n\nAny major carrier nowadays have well documented policies and procedures and greater incentives to see that people get the care they need.",
            "Sheesh. I live in a third world shit hole. I pay for quite expensive medical aid (insurance) @ around us$300 per month for a family of four. It covers everything. Everywhere in the country. Doctor. Dentist. ER. hospital stay. All of it.",
            "American healthcare system is SO broken...\n\nIt should never be a question of money who gets the treatment they NEED. Almost no one seeks medical attention for the fun of it, this is what people need to survive, yet these companies denies it because it will cost their shareholders a nickle or a dime.\n\nIt should always be the government controlling this. A government who has its citizens best interest in mind :-)\n\nFrom a cost perspective it would be much MUCH cheaper to have the government run it rather than companies. Just look at other countries, who spend much less per citizen on healthcare than is done in the US, yet they all seem to work out just fine.",
            "Some things seem to be really fucking up America - so-called health insurance/the prison industry/the weapons industry being dog-knotted up the arse of politicians.\nhttps://www.youtube.com/watch?v=eNp4LrWtz8M",
            "So was he made a general at the end?",
            "This is not true. At all.",
            "Holy shit, as an Australian reading these stories about health insurance company approvals is horrific",
            "US health care system sucks gigantic balls... 😐",
            "This is entirely made up lol. You were processing claims following an SOP. You were not denying authorizations and making clinical decisions lol",
            "Thing is lots of doctors **do** order shit that's not medically necessary because patients think they're getting special treatment and will shop out the ones who prescribe the most unnecessary shit. Insurance companies **do** have a moral and fiduciary responsibility to deny stuff that's just going to cost their other customers more.\n\nI've even seen actual MD physicians prescribe chiropractors."
        ]
    },
    {
        "post_id": "9z1e6k",
        "author": "None",
        "title": "Super rude customer says she can’t eat pork because she’s Muslim but wants extra bacon then yells at me when I say it’s pork and calls me uneducated. So I posted her photo on FB and outed her to the local Muslim Community",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9z1e6k/super_rude_customer_says_she_cant_eat_pork/",
        "score": 14964,
        "num_comments": 1030,
        "created_utc": 1542788608.0,
        "selftext": "Long post, summary at the end! \n\n—- \n\nFor some context I’m not Muslim but my father is a half Indian from a Muslim family so I’m pretty much up to speed on these things. But I look like a very fair Indian, so often people get confused about my ethnicity thinking I’m full European.\n\n——————————————\n\nIm a salesperson and control the media of a boutique that is part of a restaurant and it’s a small place so sometimes I just wander around when the boutique is empty and get mistaken as a server. We get super busy sometimes so I help out the servers. \n\nOne day, this lady (I’ll call her CL for crazy lady) walks in with her friend and before she sits starts FLICKING her fingers at servers and yelling for someone to serve her. It was a hectic day because it was one of our public holiday (It was actually Prophet Mohammed’s birthday) so I got two menus and greeted them waiting for their drink orders. \n\nCL just spits her and her friend’s drink order at me (had to wash my face numerous times afterwards), then proceeded to ask about some of the dishes. This was our brunch time so we were still doing full on breakfast meals with bacon and such. \n\nShe asks which dishes have pork and I point them out but also offer to remove any of the ‘bacon’ from the dishes. CL looks at me like Im the stupidest thing on Earth saying, “I asked about pork not bacon, you stupid uneducated white girl.” Now was my turn to look at her like wtf, I then looked at CL’s friend who just had this defeated look on her face. \n\nI explained to her that bacon is from a pig, and that it’s essentially a form of pork so therefore not allowed for her. I know this because I’ve had my Muslim cousins whine to me about not having bacon. She started getting pretty upset at me and yelled at me, “I know more about my religion than you stupid white girl! Fuck off and get my bacon”. \n\nAt this point I pretty much give up, it’s getting busy and I’m turning heads to our table. I can’t afford to lose this job, so I comply. Especially with CL’s request for EXTRA bacon. I tell the cooks and servers who were watching the whole ordeal and so we’re all trying to stifle our laughter and groans behind the counter. \n\nI serve CL and her friend’s food, CL ordered our oriental breakfast which has everything and was topped with heaps of bacon scattered across the plate (She looked very happy) and her friend had the same but without any bacon and was looking apologetically to me the whole time. I was ready to leave it be and go serve another table when CL started telling me off saying that I didn’t listen to her on how to do her bacon (she didn’t even tell me at all bloody hell) and that I should really take feedback from customers like her and post it on our Facebook page so people know how we are. \n\nI was pretty pissed off at CL and didn’t want to yell because I knew I’d get fired so I did the next best thing- (honestly I think I only thought of this after reading so many stories on here) I agreed with her, saying that yes we should take her thoughts into consideration on our FB Page. So since I’m the media person for both the boutique and restaurant, I ask if I could take a photo of her eating lunch and post her feedback as an official post on our page. She looked over the moon at the thought of publicity and readily agreed to it. The friend just excused herself and moved away from the photo, I don’t know if she knew what I was thinking or... \n\nAnyways, I take CL’s photo, add her comments and get her FB tag so she’s tagged in the photo. However when I was getting ready to post it, I added a caption; “On Prophet Mohammed’s birthday, this lovely customer came in and ordered our oriental breakfast with EXTRA bacon. We pride ourselves on giving the customers exactly what they tell us they want!” \n\nNeedless to say- the comments of shock and horror on the post by her family and friends at the pork were endless and I eventually got a message from her to take it down saying that she didn’t want it up anymore for personal reasons. \n\nBe nice to your servers and know what you’re allowed to eat before you preach in our faces about us being uneducated about things. \n\n—— \n\nSummary; A lady came into the restaurant saying she can’t eat pork because she’s Muslim but orders bacon. I try to explain that it’s pork but I get yelled at for being uneducated. She complains about the food again, saying that we should take our customers feedback more seriously on our social media so I maliciously complied. Upon her agreement, I took her photo and tagged her on our official restaurant page whilst adding about how much bacon she wanted. The backlash she received from the local Muslim community got her to message me to take it down for ‘personal reasons’. \n\nEDIT: I just want you guys to know that I did apologise to her about the whole ordeal. I said that I was rash and should have been better at controlling my anger at her. I apologised because I was genuinely sorry for putting her out there like that and I’m usually not a malicious person.\n",
        "permalink": "/r/MaliciousCompliance/comments/9z1e6k/super_rude_customer_says_she_cant_eat_pork/",
        "comments": [
            "Asking permission to take the photo and put it up was genius ",
            "I had a Jewish friend mine I used to work with.  Everyday the food truck would come by and he would get a really nice ham sandwich they had.  I was like \"Mike?  I thought you couldn't eat ham.\"  He would reply.  \"Ehh. I'm not that Jewish\"",
            "Glorious. Just amazing. Bravo. ",
            "Every time she sees bacon now, she’ll think of you, lol.",
            "I'm sorry, i shouldn't laugh but this is priceless",
            "Quick story, somewhat related. I live in a Muslim country. I received a lecture once about Muslims and alcohol, from a Muslim. But, of course, I already knew it. The guy was kind of a jerk, just being preachy. He kept bashing me with the fact that ***Muslims don't consume or handle alcohol.*** Okay, geez, I get it.\n\nWhen people use the word \"alcohol\", they typically mean ***ethyl*** alcohol, which is the chemical name for the alcohol you find in beer and booze. I'm not a chemist, but I do know that \"alcohol\" is really a generic word for any organic material where oxygen and hydrogen form a special bond with carbon. There are many kinds of alcohol, including isopropyl alcohol, which is an antiseptic. Anyone who's ever gotten a shot has had alcohol wiped on them.\n\nBeing cheeky (and because the guy was a jerk), I pointed this out, insisting that he does, in fact, handle alcohol. The antifreeze in your car's radiator is ethylene. It's an alcohol just like propylene (used to de-ice airplanes). Methanol naturally occurs in the human body (in small amounts); it's in all of us right now.\n\nYeah, he didn't like that at all.",
            "Now that's Perfection's middle name! Speaking of which, I've seen many people who claim they are hardcore vegan, but eat eggs. Never managed to find the logic behind that. 😂",
            "CL: Can't eat pork. Give me extra bacon.  \nOP: Bacon is pig too.  \nCL: [https://i.imgur.com/D7IZ3Bq.jpg](https://i.imgur.com/D7IZ3Bq.jpg)",
            "[deleted]",
            "I'm Muslim and I approve this 1000%. ",
            "Does this still count as a “sin” (whatever the Islamic equivalent is) since she apparently was convinced it wasn’t pork? Does that fall under the “if you didn’t know then it’s okay” exception? I’m not exactly well-versed in Islam and what counts as haram or not",
            ">  I said that I was rash and should have been better...\n\nWas that like a bacon rash[er]?  :)",
            "This sounds like a child's fantasy. ",
            "I'm still a little stunned at the fact that she doesn't know bacon came from pig when one of the big rules of your religion is that you cannot eat pork or pork products...",
            ">\"Stupid uneducated white girl\"\n\nGetting back at the racists and classists by doing exactly what they want.  Nice!\n\n&#x200B;\n\n&#x200B;",
            "While it was an entertaining story I'm finding it difficult to swallow that you were so worried about your boss firing you over a confrontation with a customer in front of a limited number of people but having no such qualms about taking the situation public on social media ",
            "went to work with 2 work colleague's, 1 was a Muslim and the other guy was from a half vegetarian family. so scanning through the menu the Muslim was saying that he couldn't eat pig because of his religion. his other friend says \"I doesn't eat pig too\". the Muslim friend said \"I've seen you eatting a ham sandwich in the morning and the odd bacon roll too\". the other guy goes \"yea but I don't eat pig\" confused as in where he going with this. the Muslim guy like \"that's pig mate\". the other guy like \"no it's not\". then turn around look at me like the Muslim an idoit. in which I half laught and said \"it is\". then he looking us both if we trying to wind him up. took us about half an hour to convince him. it was loooong 30min.\n\n this before smart phones ",
            "She was due no apologies. You gave her what she demanded.  ",
            "Fuck her, you had to take it down once she asked but damn it she deserved every second of what she got for that. Uneducated white girl my ass.",
            "Now I want a heap of bacon",
            ">I explained to her that bacon is from a pig, and that it’s essentially a form of pork so therefore not allowed for her. I know this because I’ve had my Muslim cousins whine to me about not having bacon.\n\nI'm gonna go out on a limb and say you would still know bacon = pork even if you didn't have a muslim cousin. \n\nSource = everyone w/ no muslim cousin. Except that woman who you dealt w/",
            "I think a the basic plot of this story probably did happen but the story seems grossly exaggerated.\n\n \"I know more about my religion than you stupid white girl. Fuck off and get me my bacon!\"  I mean really?  Yeah probably not a quote.  That stuff gets you kicked out of restaurants, not extra bacon. Especially if other tables heard it.",
            "[deleted]",
            "Sounds fake",
            "Why don't people understand that you don't speak down to people who make your food? She's just asking to have her breakfast spat in",
            "Why on earth would you apologize?",
            "You should reply with: \"I'm a stupid white girl, I don't know how to take down a post\"",
            "A while ago I saw read a post here about a phone rep for a gym putting a customer on hold for 5 hours and calling it MC. That was disgusting. THIS, however, was genius! True MC without putting your employer in hot water! Remarkable work! Also, are you British? \"Bloody hell\" is a British staple.",
            "This is complete fiction.",
            "Why doesn't it surprise me that a story about a Muslim eating bacon on Mohammed's birthday is posted by someone named \"[deleted]\"?",
            "I wouldn’t have taken it down. Lol. ",
            "Yeah, no.\n\nThis post reeks of sketch, and is probably trying to make Muslims look bad to be honest. OP even deleted their account on top of that.",
            "you did very good, I don't think you should feel guilty or have apologised but that was your choice however it could open you up legally having apologised.\n\n  but never mind it all worked out, good for you.\n\n   ",
            "I have a Muslim coworker who used to eat slim jims. His face when we told him there is pork in slim jims was priceless. We still don't let him down for it.",
            "[removed]",
            "I want to know what her logic was thinking bacon wasn’t pork, I mean did she think she just couldn’t have a pork steak or something? 😂",
            "Why the apology? She berated you in a racist way (\"stupid white girl\") when you were trying to help her comply with HER religion.",
            "She shouldn’t have treated you that way, and it taught her a valuable lesson — not only that bacon *is* pork, but also to be nice to hardworking people like yourself.\n\nThough it was maybe a bit mean, I say it was well deserved.",
            "Am I following this correctly? The first words out of her mouth were  “...I asked about pork not bacon, you stupid uneducated white girl...” but YOU apologized to HER?",
            "I feel like she's only ever had Turkey bacon in her life",
            "I was all ready to give you shit over outing her on social media, but her gleeful acquiescence turned it around and make this extra fantastic. Hoist on her own petard, beautiful.",
            "I liked everything except for the part where you apologized lol ",
            "> I just want you guys to know that I did apologise to her about the whole ordeal.\n\nYou shouldn't have.  You provided her with a sorely needed life lesson.  Good on you, OP.",
            "Was the post taken down? ",
            "Way to go guys we made op delete his account ",
            ">Long post, summary at the end! \n>\n>—- \n>\n>For some context I’m not Muslim but my father is a half Indian from a Muslim family so I’m pretty much up to speed on these things. But I look like a very fair Indian, so often people get confused about my ethnicity thinking I’m full European.\n>\n>——————————————\n>\n>Im a salesperson and control the media of a boutique that is part of a restaurant and it’s a small place so sometimes I just wander around when the boutique is empty and get mistaken as a server. We get super busy sometimes so I help out the servers. \n>\n>One day, this lady (I’ll call her CL for crazy lady) walks in with her friend and before she sits starts FLICKING her fingers at servers and yelling for someone to serve her. It was a hectic day because it was one of our public holiday (It was actually Prophet Mohammed’s birthday) so I got two menus and greeted them waiting for their drink orders. \n>\n>CL just spits her and her friend’s drink order at me (had to wash my face numerous times afterwards), then proceeded to ask about some of the dishes. This was our brunch time so we were still doing full on breakfast meals with bacon and such. \n>\n>She asks which dishes have pork and I point them out but also offer to remove any of the ‘bacon’ from the dishes. CL looks at me like Im the stupidest thing on Earth saying, “I asked about pork not bacon, you stupid uneducated white girl.” Now was my turn to look at her like wtf, I then looked at CL’s friend who just had this defeated look on her face. \n>\n>I explained to her that bacon is from a pig, and that it’s essentially a form of pork so therefore not allowed for her. I know this because I’ve had my Muslim cousins whine to me about not having bacon. She started getting pretty upset at me and yelled at me, “I know more about my religion than you stupid white girl! Fuck off and get my bacon”. \n>\n>At this point I pretty much give up, it’s getting busy and I’m turning heads to our table. I can’t afford to lose this job, so I comply. Especially with CL’s request for EXTRA bacon. I tell the cooks and servers who were watching the whole ordeal and so we’re all trying to stifle our laughter and groans behind the counter. \n>\n>I serve CL and her friend’s food, CL ordered our oriental breakfast which has everything and was topped with heaps of bacon scattered across the plate (She looked very happy) and her friend had the same but without any bacon and was looking apologetically to me the whole time. I was ready to leave it be and go serve another table when CL started telling me off saying that I didn’t listen to her on how to do her bacon (she didn’t even tell me at all bloody hell) and that I should really take feedback from customers like her and post it on our Facebook page so people know how we are. \n>\n>I was pretty pissed off at CL and didn’t want to yell because I knew I’d get fired so I did the next best thing- (honestly I think I only thought of this after reading so many stories on here) I agreed with her, saying that yes we should take her thoughts into consideration on our FB Page. So since I’m the media person for both the boutique and restaurant, I ask if I could take a photo of her eating lunch and post her feedback as an official post on our page. She looked over the moon at the thought of publicity and readily agreed to it. The friend just excused herself and moved away from the photo, I don’t know if she knew what I was thinking or... \n>\n>Anyways, I take CL’s photo, add her comments and get her FB tag so she’s tagged in the photo. However when I was getting ready to post it, I added a caption; “On Prophet Mohammed’s birthday, this lovely customer came in and ordered our oriental breakfast with EXTRA bacon. We pride ourselves on giving the customers exactly what they tell us they want!” \n>\n>Needless to say- the comments of shock and horror on the post by her family and friends at the pork were endless and I eventually got a message from her to take it down saying that she didn’t want it up anymore for personal reasons. \n>\n>Be nice to your servers and know what you’re allowed to eat before you preach in our faces about us being uneducated about things. \n>\n>—— \n>\n>Summary; A lady came into the restaurant saying she can’t eat pork because she’s Muslim but orders bacon. I try to explain that it’s pork but I get yelled at for being uneducated. She complains about the food again, saying that we should take our customers feedback more seriously on our social media so I maliciously complied. Upon her agreement, I took her photo and tagged her on our official restaurant page whilst adding about how much bacon she wanted. The backlash she received from the local Muslim community got her to message me to take it down for ‘personal reasons’. \n>\n>EDIT: I just want you guys to know that I did apologise to her about the whole ordeal. I said that I was rash and should have been better at controlling my anger at her. I apologised because I was genuinely sorry for putting her out there like that and I’m usually not a malicious person.\n\nI'm not sure where the copy paste bot is so here I am .",
            "You had no need to apologise. Serves her right. Hope it humbled her. \n\nYou're a good person, but you should have tore her a new one for bringing up your skin colour! \n\n",
            ">I know more about my religion than you stupid white girl! Fuck off and get my bacon”.\n\nShould have been \" sorry you'll have to leave, were not serving you\" at that point. ",
            "I’m sad to hear that you felt the need to apologise to her. She didn’t deserve an apology. People like her learn only one way, which is the way you dealt with her. You made her act like less of a shitty person by realising there are consequences to her actions, you made the world a better place. Don’t apologise for being confrontational in an appropriate way.",
            "I wouldn't have apologized for shit. You don't get to berate and insult people and expect to get away with it like you're Allah's gift to this world. I would have left it up as a reminded to her to never fuck with people like that again when you clearly have no idea what you're talking about.",
            "You shouldn't have apologized. Bright side. The damage was done. ",
            "I hate to be that guy but I don't think you should have apologized. let the lesson stick.\n\nsaying that I'm the type of guy who doesn't work in this industry so I commend you",
            "I love this story. The only part I'm not crazy about is the apology. Maybe I'm just a much meaner person than you, but people like that get way under my skin. They're abusing their role as a customer to be garbage human beings without repercussions. I can't stand that behaviour. But still an awesome story. ",
            "I'm curious as to where you are that celebrates Mohammed's birthday but still serves pork",
            "I call bullshit",
            "*sees OP deleted account*\n\nthis is why throwaway accounts are a thing assuming OP's account isn't a throwaway",
            "The only thing you did wrong was apologize. This is the only way some scumbags are kept in line, is by fearing their peers finding out who they are. ",
            "r/wheresthephoto",
            "This might be the best one I've seen yet, it was nice of you to take down, but when she said she wanted it removed for 'personal reasons' I would've been VERY tempted to push the envelope until she admitted that bacon was pork.  \"Why do you want to take it down? It's not like bacon is pork right?!\" You're a better person than I OP!",
            "I don't know much about Muslims so what is the out come of people finding out about this? Does everyone just treat her like an idiot from now on or is this like a serious taboo?",
            "Uggh take that edit off. I was loving this until you felt sorry for doing it. She deserved every bit of it!",
            "i wish you hadn’t felt the need to apologize and take it down, but then again i tend to be a bit more ruthless when it comes to actually having a conscience about these types of things. personally, i’m usually #sorrynotsorry but that’s just me 🤷‍♂️ great job giving the bitch exactly what she asked for though! your story made me smile hahaha",
            "Don't be sorry. Like, at all. There is no excuse to being so ignorant about something that plays such a huge part in your life. Customers don't deserve to be humiliated, true, but you don't deserve to be abused in any way, regardless of what job you do. It doesn't cost anything to not be a dick. \nSeriously, I don't think I could stop myself from laughing in her face if it was me. Can't eat pork but I'll have extra bacon please! I'm laughing into my phone. ",
            "This belongs in a revenge thread, not sure if this is prorevenge, pettyrevenge, or regularrevenge",
            "Booooooooo for apologizing and taking it down ",
            "I wish I could have read some of those comments hahaha",
            "This made my day until the part about apologizing. ",
            "You apologised to that idiot? Why? You just ruined such a lovely story",
            "She was an ass to you, you complied with all her requests and obtained her permission before uploading the photo.\n\nNothing to feel bad about at all. ",
            "Good story well told. I was disappointed to find out you apologized. You had no reason to be sorry. Apologizing to narcissists for problems stemming from their narcissism just reinforces their sense of entitlement.",
            "Oh sure Lisa, a wonderful magical aninal.",
            "Man, I was happy until I read your edit. Fuck that bitch! Serves her right for being a bitchy know-it-all. Her friends and family should shame her till she is less than a puddle on the floor. Maybe then she wouldn't be a cunt to servers.\n\nOh, and the friend is just as guilty. If you have a friend who's mean to servers you should punch them in the face right there at the table. ",
            "Why are sorry and apologising? She was an ill-manned jerk who was rude and racist to you because she thought you were white and knew nothing of her religion, when it turns out she knew even less then the average person in the street about what is Haram. She deserved it. ",
            "Come on, this is great! You are too nice.",
            "“I know more about my religion than you stupid white girl! Fuck off and get my bacon”  \nWhere do these crazy encounters I keep seeing on this sub take place?",
            "I’ve heard this story before ",
            "Ugh, you're too.... ~nice~  I dunno.  But lady got she what she wanted you gave her every opportunity, and it seems her friend did too.",
            "I would have refused to server her the moment she called you an \"uneducated white girl\".\nWhether you're right or wrong, the moment you insult and are racist towards me, our conversation is over.\nDid work experience at the Job Center for a few weeks, quite liked it, but we where allowed to stop helping/serving someone if they made us feel uncomfortable in anyway. I'm glad we had this rule in place as one day a man comes in looking to go on job seekers, all good so far. Shortly after being seated, the man strikes up some small talk with my colleague with the main subject bring how hot the man thought Polish women where and how women are only good for one thing, lovely I know. My colleague, without saying a word just stared him down for a few seconds and walked away, refusing to interact with the man again. That was a good day.",
            "She spit in your face and you didn't throw her ass out on the street? What country is this?\n\nThat women is horrible!",
            "It doesn't matter what your religion is, don't be a dick to people. Especially servers.",
            "Not defending her rudeness, but to be fair, if she wants bacon and not \"pork\", then that's what she wants. It's a restaurant, not a mosque.   ",
            "Smart move, destroy your enemies emotionally, it has lasting effects.",
            "Sounded like a great story until I read your edit.  Why did you apologize?  You're letting that bitch push you around and then feel bad about it.",
            "I’m mixed Indian/White too and from a Muslim family and I think what you did was great. She had no right to yell at you like that and I don’t even know how she thought bacon was not pork lol\n\n\nEdit: I don’t think you needed to apologize to her at all! You didn’t do anything brash, if anything she should apologize to **you**",
            "Tl;dr Muslim woman orders extra bacon on Muslim holiday insisting it isn't pork, gets exposed to local Muslim community on Facebook. ",
            "> EDIT: I just want you guys to know that I did apologise to her about the whole ordeal. I said that I was rash and should have been better at controlling my anger at her. I apologised because I was genuinely sorry for putting her out there like that and I’m usually not a malicious person.\n\nReally wish you wouldn't have done this, she deserved every piece of flak she received as a result of her stupidity.",
            "I LOVE u/[deleted] - they have the funniest stories with the juiciest gossip. ",
            "Fuck apologising, it was completely deserved there, sometimes Maliciousness isn't a bad thing you know. ",
            "This is how to deal with racists.",
            "how does ANYONE believe these stories?? no customer would say \"shut up stupid white girl\" unless they were provoked before hand. this is like every other  r/talesfromyourserver story",
            "was this account deleted? Wtf? ",
            "You shouldn't have apologised. Bitch got what she deserved.",
            "> I said that I was rash\n\nMaybe so, but the bacon was even rasher.",
            "Sounds like r/prorevenge material to me. Got her consent to it and everything. Very well done.",
            "I love every part except that you removed it and apologized. You complied exactly with her wishes. She's an ignorant and demanding racist narcissist who deserves to be publicly outed as such (specially when it's by her own vain request). ",
            "It ^was ^^rash^^^er",
            "Not only have you got some compliance in there but you've got revenge too! r/pettyrevenge may enjoy this too! ",
            "Well at least she didnt get no glutens in her salad.",
            "Sure, OP, a wonderful, magical animal: https://www.youtube.com/watch?v=7BZDZyRaGa8",
            "I feel like she's only ever had Turkey bacon in her life",
            "My god, this is beyond chaotic good. Keep it up! I wouldnt have lasted that much holding my anger. ",
            "OP, I love you.",
            "What country do you live in?",
            "I wonder why she thought you were uneducated ? Man she must be so judgemental enough to not care about what you’re saying. Or could she not understand bacon is pork🧐",
            "Eh, to be fair, I don't think she'd have accepted that bacon is pork without this and following her religion was important to her.\n\nIt is possible to be both an entitled stubborn bitch and sincerely mistaken about something important to your whole self.",
            "I really wish we could see those comments on that FB post 😂",
            "This is amazing.",
            ">I said that I was rash and should have been better at controlling my anger at her\n\nI don't know, you could've been rasher",
            "As someone who is allergic to pork, you would be surprised by the amount of people I had found that doesn't know that bacon comes from pigs",
            "It was nice that you apologized, but when someone behaves as she did, it's more constructive to have them suffer the consequences of that behavior.",
            "Which country?",
            "Spitting is assault, hands down. I know because I was charged. It’s serious because of the diseases that can be transmitted. Right then and there you could have cut things off by calling the cops",
            "[deleted]",
            "She’s lucky it was you as I wouldn’t have took it down as easy.\n\nIf you piss me off to the point I have to spend energy to think and carry out revenge, best believe I’m going to want to see all my hard work pay off.",
            "She was ordering food that she is not allowed to eat if she is a Muslim. On top of that was treating you badly. \n\nYou were the bigger person through out this because you had no reason to say sorry but you did. Hope you have a blessed day OP. ",
            "You literally covered yourself in every way possible. Kudos OP on being educated!",
            "You didn't need to apologize to her! She got exactly what she deserved! Good job!",
            "You're a better person than I for regretting it.",
            "You shouldn’t have apologized to that stupid bitch. She couldn’t even get her own religion right. ",
            "Is the lady an actual Muslim? Genuinely curious\n\nIs it even possible to grow up knowing to not eat pork, but not once ever realize that bacon comes from a pig? 🤦🏾‍♂️ ",
            "This was exactly what she needed to put her in her place. Next time she might think twice about being rude to people.",
            "I love you so much. Lol",
            "Is the rest of the meat Halal?  Because muslims not only can't it any pork, they can't eat beef and chicken unless it's Halal.\n\nIt's not OK for a muslim to go to Wendy's and order a burger just because it doesn't have bacon.",
            "I've run into the same thing with Muslim family members. It's weird.  They also don't catch on that crow, lobster, mouse, rabbit, etc. are also in the same boat as pig.\n\n>CL just spits her and her friend’s drink order at me (had to wash my face numerous times afterwards)\n\nAs best as I can tell, this is typical for people who have Farsi as a first language. Source - extended family spits at me when talking... even the ones that like me.\n\n",
            "Hello random internet stranger! I you were beating yourself up about your course of action. I hope this does not come off as presumptuous, but I felt that perhaps some words of encouragement and advice would help you gain a new perspective. \n\nI don't believe what you did was truly malicious in nature, and the fact that you are agonizing over how your actions have affected another person demonstrates empathy and compassion. The feeling of guilt is an indication of a healthy conscious and strong morals, things that I believe are essential to being a good person.  Good people act out of anger at times just like everyone else, it doesn't make you any less of a good person. \n\nYour actions may also have the unforeseen and unknowable consequence of improving the lives of others. This woman sounds like she is a bitch to everyone, and while I doubt her true nature will be changed or affected but she may reconsider how she behaves around and treats others. \n\nOverall I don't believe you did something inherently wrong or evil. You exposed the truth, nothing more. While it's not as easy as the million people in the thread saying \"don't feel guilty\" or you \"shouldn't feel bad\" what you can do is accept those feelings of regret for what they are, the feelings of someone who has a good heart and then forgive yourself.  ",
            "I feel the need to apologize for her unacceptable behavior and let everyone know that this is not the Muslim way. \n\nIt’s just become a habit of mine in this day and age. ",
            "Amazing!! I love it!!!  I hope she enjoys her time in hell.  ",
            "Never apologize for putting a psycho-cunt in her place. She'll feel vindicated of her behavior.",
            "I really liked that story but your edit where you apologized to her for her having to finally deal with the consequences of her behavior just ruined it for me. I wanna give you the benefit of the doubt and believe you only did it because your boss told you to and not because you're a coward and pushover who has to have people like you. ",
            "Official Muslim stamp of approval. Glorious",
            "Shouldnt have apologised ",
            "I take my hat off to you queen; that was brilliant!!",
            "Screenshot or it didn't happen",
            "I just want to point out that bacon is made out of beef in many Muslim countries. I've met Muslims being baffled about pork-bacon.",
            "I **had** a friend who didn't realise *Bolognese* means a dish contains meat.\n\nThis is someone who likes to brag about his intellect and considers not letting his psychiatrists help him \"winning\" and proof that he's smarter than them.",
            "YTA",
            "Brilliant!  Well done!",
            "I hope you forgot to check your spam folder for that email, because you know, it could be days before you get around to finally removing the photo...",
            "That is absolutely perfect!!! Especially since you got her express permission. I don't think I would've been able to keep a straight face.",
            ">  I then looked at CL’s friend who just had this defeated look on her face.\n\nThe shit men go through just to be able to stick their dicks in crazy…",
            ">Story about bacon\n\n>...I was rash\n\nPlease tell me that was deliberate. ",
            "I think I'll go have a bacon wrapped pork chop in honor of this thread.",
            "As a manage at a restaurant, I would have immediately stopped her and told her to leave being racist toward my servers.\n\nI've had customers yell or swear at my servers, and I immediately told them to leave. I've told sexist men to leave for degrading my female servers. So far, no racists...\n\nSo, as a manager that woman would have been gone the second that she called her an ignorant white girl. ",
            "Kinda off track but isn't it ridiculous to believe an omnipotent God cares if you eat pork",
            "I sure hope you didn't take it down...",
            "Hahahah the customer was an idiot. Nice work keeping your cool with that asshat"
        ]
    },
    {
        "post_id": "p7dz0w",
        "author": "Direct_Sheepherder61",
        "title": "Two weeks notice in writing",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p7dz0w/two_weeks_notice_in_writing/",
        "score": 14949,
        "num_comments": 773,
        "created_utc": 1629376566.0,
        "selftext": "My very first job was working fast food, at Wendy's. I was 16, and most of my coworkers were also teenagers. There was always work to be done (\"if you have time to lean, you have time to clean\"), but working afternoons/ evenings with a bunch of teens, there was also plenty of fucking around. \n\nWork wasn't the greatest, but it wasn't really that bad either; it was tolerable. Then we got a new manager. This guy was in his 40s, and he was a lifer. He was super strict, and was not about having fun at work at all. Unfortunately, I quickly became his favorite work vessel, because I was easier to control than some of my coworkers. He leaned heavily on me, to pick up the slack that the others left. It got real old, real fast. Why should I work more than everybody else, for the same pay? Why should I be stuck doing more tasks than my coworkers, who get to continue to goof off? \n\nI voiced my concerns to the manager, but nothing changed. He was usually busy hiding in the office, with the mirrored glass window, just watching everybody. He'd only surface on occasion to tell me to work harder, and give everybody else a free pass. Eventually, I had enough. \n\nOne day, I marched in to his office, and demanded that either I get a raise, or for him to hold everybody else to the same standards. He didn't go for that. I told him to consider that conversation my two weeks notice then. He said he needed that in writing. I ripped a sheet of paper out of a notebook on his desk and wrote some along the lines of: \n\nThis is my two weeks notice. \n- Name\n\nI walked outside his office, spit on the paper, and stuck it to his mirrored glass window. He could look at it all he wanted that way. I felt amazing. \n\nFor the next two weeks, the manager kept letting me know that it wasn't too late to change my mind about quitting. He kept alluding to a raise, but never actually offered it.\n\nUpdate: \nWow! I never imagined so many people would enjoy my quick story. It makes me happy reading all the comments from people with similar stories. \nFor the doubters, yes, this was my personal experience. I started some time in fall 2006, and quit in summer 2007.\nAlso, I am aware that two weeks notice is a courtesy, not a necessity. It just seemed wrong to me to not give notice, and two wrongs don't make a right.",
        "permalink": "/r/MaliciousCompliance/comments/p7dz0w/two_weeks_notice_in_writing/",
        "comments": [
            "Ahh, yes.  \n\nYet another reminder that people quit bosses, not jobs.",
            "should've said \"sure, I've changed my mind and will stay\" then on the last day \"no I'm not staying -- I never said I would in writing, right?\"",
            "My favorite line that I've picked up from someone on Reddit is:  \n\n\n\"For the next two weeks you're gonna notice I'm not here.\"  \n\n\nWhen you know the bridge is burned, you have nothing to lose but your chains.",
            "\"He leaned heavily on me\"\n\n\"if you have time to lean, you have time to clean\"",
            "He way overestimated his ability to influence.\n\nSpitting on and sticking the notice was badass 1000.",
            "Two weeks notice is a courtesy, not a requirement.",
            "Good for you! That's great.",
            "Your last line, \"He kept alluding to a raise, but never actually offered it\", shows just how right you were to quit",
            "Hate it when managers prey on people instead of lift them up!  My first real job was Wendy's, and I loved my boss!  Whenever we opened together, she would give me a piece of freshly cooked bacon!  Back then, I was so poor, I couldn't even afford a half priced meal.  That piece of bacon was sheer heaven for me!",
            "> He kept alluding to a raise\n\nYeah, I'm going to need that in writing.",
            "You absolutely do not owe any job two weeks notice. Especially a customer service job, a retail job or a food service job. If the manager sucks, just leave.",
            "My sister worked at a Wendy's as a teenager. When she quit, her manager told her, \"You'll be back.\" \n\nShe didn't go back. In fact, she makes 100k a year now. Last time we visited our home town, he was still working at the same restaurant 30 years later...",
            "I relate to this so hard.\nI was “Team Lead” that was getting paid less than people who didn’t have the title, were constantly on their phones, and were otherwise no good at their job who got raises when they said they were going to quit.\n\nI worked twice as hard as them, received two promotions that my pay did not reflect, and frequently got saddled with the work other managers didn’t want to do.\n\nI put in my two week notice and my boss never even acknowledged it to my face. \n\nMy job after that though, I got another two promotions  there with big jumps in my pay and the job was much more flexible and cared a lot more about the staff—so I’m glad they didn’t try to keep me at the first place\n\nEdit for spelling",
            "I put my two weeks notice in by giving my boss a sympathy card that said sorry for your loss. My last day is...",
            "Why give a two weeks notice?\n\nI had a shitty boss at Jimmy Johns and I called him 2 hours before my shift and told him to find someone else as I won't be coming in to work anymore.\n\nOne of my friends that worked there called me all angry saying other people are going to have to pick up my shifts now. I told my friend tough shit, not my problem, you're not required to pick up any shifts outside of your schedule and that is on you if you agree to it. Eventually my friend realized how he was also being taken advantage of after I made him sit down with me and go over the costs of gas and car maintenance. He suddenly realized he was making less than $5/hr after his expenses.",
            "> He kept alluding to a raise, but never actually offered it.\n\nThat’s exactly it. He was trying to keep you as long as he could without actually doing anything. That would be all the more reason to leave a place like that.",
            "Got a call at work that my mother had a heart attack and was in the ICU. I told my Mgr and told him I had to go. He said \"I'll see if I can get someone to cover so you can leave.\" I looked at him for a moment, and then said, \"I said I'm leaving. After I find out if my mother is going to live or not, I will call you and see if I still have a job.\" And I walked out. (I did still have job -- but I also had a rep at that point. I only worked there a couple more months before I quit.)",
            "Did the same thing working for CVS in the pharmacy ten years ago. I took a sticky note off the boss’s desk and wrote the exact same thing, signed it, and said “I’ll bring in something a little more formal tomorrow, but I’m not going to spend an extra day here if I can help it.”\n\nOn the way out the door, I told my favorites-playin double-standard pharmacist that she really put the “F U” in “fun” at this job.",
            "My current employer requires a month or they won't pay out unused vacation days. I look forward to laughing at them when they try that shit with me. It goes completely against the law in my state.",
            "Your company would likely pack your shit the day you weren’t needed.  If they treat you bad you five them NO notice.  You resign effective immediately and you use your friend as a reference who happened to be your “supervisor” at that job",
            "I had a boss allude to a raise to get me to work a double double and I just immediately said \"I want it in writing or go back to calling replacements\"\n\nHe went back to his office and started to call people. Like they knew they couldn't swing a raise and they tried to get me to work anyways. That was when I went hunting for a new job.",
            "I worked at a McDonalds Junior year of HS.  One day before my shift I got a call from one of the local tv stations. I had applied for a studio camera job and an opening appeared  I was told to be at the station at 3, the same time my shift started. I washed my McD’s shirt, folded it and went to the store to say thanks for the memories (like fruit he pies in the same friar as the filet o fish). The AM told me that they wanted two weeks notice or I couldn’t get a good recommendation. I told him I’d take my chances. Working at the station with plenty of free, yet paid, time to do homework. Best HS job ever!",
            "Me at McDonald's: \"I quit\"\n\nBoss: \"You have to give 2 weeks written notice\"\n\nMe: (grabs kitchen fire suppressor handle) \"Remember when you told us that if we ever pulled this and there was no fire, we would be immediately terminated?  How long does this take to clean up?\"\n\nBoss: \"Bye\"",
            "What a nob. Hope you kept sticking that bit of paper back up every shift... with a countdown.",
            "That raised would have **NEVER** came, unless it be $.05 or less.\n\nBK strung me along for two years, working as an assistant manager, and that \"raise\" was always \"just around the corner.\"",
            "This happens a lot. Why, as a manager, would I try to get goof offs to work harder when a hard worker like you will do it? I used to work at fedex and would run my ass off. I worked harder and harder until I quit, I was going to evening classes and got my degree. When I quit they split my route up into two routes.",
            "LOL - That's awesome. Similar story from my McDs days. Guy quits, manager said they want it in writing. He took one of those tray liners and wrote I QUIT on it in huge letters using a crayon from the Hostess (our store had one back in the day to chat it up with customers, and host birthday parties).",
            "At my work, they usually march you out within a day or so of you giving notice, but they pay you for the full 2 weeks. Just had a colleague give a 4 weeks notice, and they marched him out the next day - found out they are paying him for the full 4 weeks! So, we ALL 'noticed' that! \\*Filed away for future reference\\*",
            "I had an assistant manager at office Max who said that it had to be written in cursive.\n\nShe wouldn't accept the notice if it were printed.",
            "The two week notice is bullshit. They need you to give two weeks so they can find a replacement. But they fire people in the middle of the day with no problem. Two weeks is a courtesy you give an employer you genuinely like.",
            "Your real mistake was giving two weeks notice. That's the sort of the job you just fucking say I quit and leave. Two weeks notice is a completely bullshit concept that comes out of American pro-employer culture. Like they can fire you with no notice but you're supposed to give them two weeks even though you getting fired suddenly would be a way bigger burden than their losing one employee? It's a total double standard. Fuck that. Give that manager the finger. The only reason to give notice is if you need the place for a reference. Nobody gives a fuck about a Wendy's job you did. What, you'll never work in fast food again? Dude, places like that are like the army. They'll take anyone who passes the physical. The application and interview are basically just to make sure you can string a sentence together and don't smell like shit.",
            "Two weeks notice is optional.  You could quit whenever you want.",
            "Basically the same thing happened when I worked at Wendy’s. Only difference is that after me and my friends quit, everyone did. The Wendy’s now only operates for about 8 hours a day.",
            "In the US, two weeks notice is a courtesy, not a legal requirement.  In writing is also a courtesy.  Unless there is some kind of contract specifying that requirement.",
            "I had a similar experience working in a pub and ended up just writing “2 weeks” on the back of a receipt with my signature… in crayon, he wasn’t too happy",
            "\"Pray I don't alter the deal any further\".",
            "Unless you live in Montana, no, he doesn't need it in writing.  At-will employment cuts both ways. You can quit at any time, for any reason. I had a similar story, years back, for a job I didn't need reference to. My response? \"This is a courtesy to you, to allow you reasonable time to find a replacement and to allow you to arrange for proper staffing once I quit. If you need that courtesy notice in writing, I suggest you write it down.\"",
            "So here's the fun part, employer wants 2 weeks from an employee, but can give you zero notice when they fire you. Fuck that bs.",
            "And you worked out that 2 weeks! Like a splinter in his thumb...😠😆",
            "My first job was at Sonic (15yo). When I quit that place I gave my two weeks and never showed back up. That was a bridge I happily burned.",
            "> He kept alluding to a raise, but never actually offered it.\n\nThis sentence alone makes me hate him.",
            "You can get a paid job writing this stuff right",
            "Fyi you don't have to give a two weeks notice. That is just a courtesy if you want to be respectful to them and if you yourself want the extra two weeks of income. There is nothing wrong with quitting on the spot if your not interested in giving them two more weeks of labor. \n\nThink about it. If you don't put in a two weeks notice what are they going to do? Fire you?",
            "Never take the raise if they only offer it after you quit. 1) they have already proven they don’t value you. 2) their behavior will never ever change. 3) sometimes they lie and you don’t get the raise. \n\nMy daughter quit and they offered her more money so she stayed and never got the raise because upper management didn’t approve. She had to quit again.",
            "I give you props for giving a proper notice. At such a young age you show more maturity than most of these pathetic excuses for human beings nowadays. Your parents raised you right!",
            "I don't know why 2 weeks' notice of quitting is a thing. it's not like if they are going to fire me, they are giving me the courtesy of two weeks notice. Its such a double standard.",
            "“Yes, we could pay you more. We’re not going to but we totally could.”",
            "wendy's once offered me a job that paid $9/hr on the condition that I quit college....",
            "I put in my notice at McDonald’s on a McGriddle wrapper. They had to file that shit too.",
            "I mean if you spit on a paper and stuck it on a window, i wouldn't expect a good reference from those guys, so there's no reason to give the two weeks rather than just walking out.",
            "The whole two weeks notice is a load of shit to begin with, especially in states that have at-will employment. Do the employers give employees two week notices when they’re about to be fired? No, so why should I give them notice that I’m leaving? If they can end my employment at any point in time without any notice, then I can do the same. I give management ample time to address my concerns before I get to the point of leaving, and if they don’t, fuck them, I’m off to better things.",
            "You do not owe anyone a 2 week notice lmao",
            "Nice! When I quit my job at Wendys the manager told me she needed a letter of resignation, so I grabbed a napkin out of the napkin dispenser, wrote “I Quit. (My name)” and handed it back to her. She did not look impressed.",
            "Should have just walked out, 2 week notice is only a pleasntry not a requirement",
            "Daily reminder that you owe these corporations NOTHING and you can literally walk out of work at any time without consequence",
            "When I quit Wendy's, a million years ago, I wrote my notice on a paper Wendy's bag. :)",
            "\" He kept alluding to a raise, but never actually offered it.\"  It was never going to be offered.  It's a ploy of managers to keep employees and to get employees 'working hard'.  Employees will fall for it for a little while.  But usually they stop caring before they catch on.",
            "Finishing up the first of my two weeks.\n\nLeft them a card on the manager desk Saturday that said \"Sorry for your loss\" on the front. Inside I markered off the flowery bullshit the cardmaker wrote and penned \"It's me. This is my 2 week notice.\"",
            "After being passed over repeatedly for a full time position at the courthouse in my town I quit in a similar manner. It wasn’t enough that I had an actual legal education (the only one) was bilingual ( only one and required by government to have said job) and had been there for two years they gave the job which was union mandated to have the above skills to a 19 year old summer student they liked better than me. This kid didn’t even finish his college program didn’t do an interview and didn’t speak a lick of French was called and offered the position. So I asked for a meeting with management and told them that what they did was against the union contract PLUS they hadn’t even advertised the position to current staff. I got brushed off. I went to my union president (during peak covid) and was told it could take a year to get something done. Well fuck that. I drew a pic of a dinosaur captioned my two weeks notice scanned and emailed it to everyone. I am back in school getting my masters and PhD. Fuck them.",
            "You’re too professional for a Wendy’s if you’re giving two weeks.  That’s a fodder job.",
            "I worked at McDonald's for a long time. Policy was the rota was up by Thursday for Monday. \n\nWell I was going to double up jobs and so arranged work on the opposite shifts (my shifts hadn't changed in months) \n\nRota goes up late, like Saturday and all my shifts have changed.\n\nI said that this was against policy and I had already made plans.\n\nManager said tough, so I quit. Right then and there. Threw my uniform over the counter.\n\nHe still works there, I have my own company.\n\nWho won?",
            "I can't believe the lack of worker protection workers in the US have. I'm in the UK. I had a terrible boss at a small firm about 12 years ago (he owned the company, I ran the company because he wasn't very good with people).\n\nAnyway this one day he came into my office and asked me if it was a good time to talk. I said not really, I'm doing X that you wanted finishing by noon, and it's 11:30. Then he started to tell me an idea he'd had that would save the company money and make my job a lot harder.  \n\nI remember this wave of rage coming over me, and saying quite calmly, 'Robert, get out of my office, we'll speak later'. He made the mistake of not listening and carried on talking. I just lost it, stood up and yelled '**Robert**! Get **out** of my **office**!'\n\nNow, my office had a glass wall that faced the general office, and *everybody* heard this. He just turned and left, closing the door, and not one person looked up from their computer. I went out later and apologies if I made anyone feel uncomfortable, and was greeted with giggles and stories of the amount of times they had all wanted to do the same thing. \n\nI went to see him later with the intention of apologising. He didn't fire me (actually he didn't let me get my apology out and never mention it again) but he absolutely could have invoked our disciplinary procedure (written me up). Thinking about it, that's the one and only time I ever did something to warrant being fired on the spot.",
            "Ugh. I once gave verbal notice I was leaving a retail job in two weeks, and was ignored. I had a job lined up, starting the day after the two weeks ended and reminded them frequently I was leaving. They continued to ignore me while smiling, and even had the audacity to put up the next week's schedule saying I was working despite me telling them that was wrong, again, for the nth time.\n\nAnd so the day came, where I turned in my uniform and cleaned out my locker. The same manager I'd been repeatedly telling for the past two weeks that I was leaving suddenly was in a panic. She had *no idea* I was planning to leave and told me I had to put in two weeks *written* notice! I couldn't just walk out the door like this, I had to have an exit interview!\n\nJust like usual, everything I'd ever said to her went in one ear and out the other. It was one of the major reasons I was leaving the job in the first place.\n\nI couldn't believe it. Even if I'd been *willing* to go with her scherade, I started work at my next job tomorrow.\n\nBaffled at the lunacy I laughed, and walked out.",
            "I worked fast food in HS and we were going on vacation before school started so I gave my two weeks. So my raging bitch of a boss said \" don't bother coming in the two weeks\" I explained that notice was a courtesy and I was planning on that money for vacation, she wouldn't budge.  Told everyone on the way out not to give notice and why.  Happy to report giving notice dropped off significantly.",
            "Ah, Wendy's.  My adult daughter worked there for a while.  She got tired of the Manager giving her grief, so she gave her notice.  The grief increased.  After she left, she got a job working for a regional grocery chain, at their gas station, which happened to be right next to the Wendy's she had quit.  Once the former manager found out where my daughter worked, she made it a point to stop to get gas when she was working, just to harass and threaten her.  It got to the point that the grocery store manager had to make a call to the former manager and Wendy's Corporate to get it to stop.",
            "He doesn't need it in writing, or even need two weeks notice, not anywhere in the US.  He WANTS those things.",
            "Two weeks notice…but backdated two weeks.  Bye, Felecia.  Out the door.",
            "Ahh... the old \"If you stay, we'll pay you more...\" line.",
            "Repeat after me: \"**My** policy is that you don't.\"",
            "Wendy's was my first job, too, at 15! I handed my notice in on a paper tray liner!",
            "In most states, you do not need to give any notice at all due to at-will employment. If you're working at a Wendy's or something you don't care about burning bridges at, you can just walk out legally.",
            "I've never understood why you are supposed to give two weeks notice if quitting, but if they decide to let you go, they do it immediately and usually escort you off of the premises. \n\nThey don't give you two weeks to find another job, so why should you give them two weeks to find another employee?",
            "If you can’t walk the fuck out in a fast food job, I can’t live in this planet anymore.",
            "As an employee, you are not required to give a two week notice, unless specifically addressed in a contract that you have signed.\n\nThats just bullshit employers tell you.",
            "Sit this is a Wendy's",
            ">He kept alluding to a raise\n\nNeed that in writing mate",
            "It's great you stood up for yourself. Next time just walk out and make the lazy fucker work for a day...",
            "I hoped you goofed off those last two weeks",
            "When I quit my job at McDonald’s, the manager was FURIOUS. I put in my 2 weeks in around mid-may. I was scheduled for 1 more week, then wasn’t on it again",
            "Imagine being this badass at 16",
            "You could've just walked and not mentioned the job ever again. It's not like quitting would follow you around on your permanent record.",
            "Note to people planning on quitting without notice, try and do it immediately after you get paid, saves a lot of hassle.",
            "What state was this? Most states have zero requirement of a notice. You can just not show up to any job though. What they going to do, fire you for quitting?",
            "Funny how most places dont give severance but theing there magical recommendations from a Wendy's manager will affect your future.",
            "What the fucks in the chilli",
            "People, you do NOT EVER have to give 2 weeks notice. Do they give you 2 weeks when they fire you? Just quit if you want to but remember, you probably won't want to use them as a reference.",
            "ROFL I wouldn't have worked out a notice when he said the shit about in writing I'd have asked does sign language count?  Then shot him a double bird and left right then.",
            "3 left's make a right.",
            "LOL, this is me, except within my family. My mother made me do all the chores when I was a kid. I'm #4 out of five BTW. I took out the trash, did the dishes, mopped the kitchen, cleaned out the fridge, and went to the laundromat with her every week. I used to complain about it, because I was her only kid that was never in trouble, got straight A's, and even had a job. FF to my 30's. She said the reason she made me do all the chores was because I was the only one who would do it.",
            "So happy you told your story. Been there, done that. These lazy ass managers who refuse to roll up their sleeves are useless. They'll always find someone to zero in on. I had one do that to me and write me up for stupid crap. I said svrew it. I quit. Not gonna for a place that treats ppl like this.",
            "When I put in my two weeks at my first job at McD's, nobody said anything to me about it. My last day, the store manager came by and offered me a $2 raise. This was when we got at most a 15 cent raise per quarter. I turned him down and decided never to work in fast food again unless it was my last resort.",
            "Sigh it warms my heart to read stories like this!!!!  All I can say is YOU GO GIRL!",
            "You quit a shitty job and provided written notice when asked.  There's no malice in this compliance.\n\nAlso, you're not required to give two weeks notice, written or otherwise, that's a courtesy you provide to your employer.  You could have just as easily shit on his desk and moonwalked out of there.",
            "Solid. Nice.",
            "Yeah... I remember those parts about working in food industry. Good on you for sticking to your guns.\n\nOblig: [https://www.youtube.com/watch?v=af7Jctuqhcg](https://www.youtube.com/watch?v=af7Jctuqhcg)",
            "when he said 'i need it in writing' id have said 'then fuck you i quit today'",
            "As funny as that is, I don't think it beats the whole, \"call your workplace and say you aren't going to show up again\" shtick",
            "Remember especially in minimum wage jobs\n\nAct your wage!!!",
            "I’ve never gave a 2 week notice in my life.",
            "More people need to do this.",
            "Not all heroes wear capes",
            "Bully for u!!",
            "As a reminder, depending on where you work, two weeks' notice is a courtesy and not a legal requirement.  I quit a job giving exactly zero days'  notice, and it was the best feeling ever.",
            "This isn't malicious compliance. Compliance, sure, but not malicious.",
            "A lifer fastfood manager has seen it all. He cared zero",
            "Two week notice in fast food??? Lol, you just quit. I'm going to be honest and say I don't believe this. I think you would have been fired on the spot. I worked in enough fast food to say straight up nobody has ever submitted a two week resignation.",
            "Naw, low wage hourly job, no notice. And if the fucker wants to act like that, no notice and I’ll fuck his car up. Also, I’m saying this as a GM now. If somebody comes to me and says I want a raise or I’ll quit, I say ok you can leave. That’s it. I also take care of my good employees to the best of my ability. I split my bonuses with staff (when they deserve it, which they usually do), I get everybody their hours, and their days off....but fuck that guy",
            "Yeah, read this story last month. Fakebot where are you when we need you?",
            "A raise, you say? PUT IT IN WRITING.",
            "You should want to work hard all the time. I’m 38 and I’ve never met anyone younger who could keep up. Work ethic is a thing of the past now days. I’m not saying your wrong for wanting a raise and I would have expected it also if I was working that much more than everyone else. Most managers don’t notice hard work either now days, but there are a few that do. Good for you for sticking to your guns and putting your two weeks in. Know your worth.",
            "I'm sure I'm going to get down voted. This thread seems like it's just a teenager pissed at a manager for making him work. \n\nMore and likely the manager wanted this person gone so he him the employee quit. Less paperwork = win."
        ]
    },
    {
        "post_id": "lsyevh",
        "author": "ultimateman55",
        "title": "Maliciously poetic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lsyevh/maliciously_poetic/",
        "score": 14949,
        "num_comments": 318,
        "created_utc": 1614348579.0,
        "selftext": "Last month, my daughter's middle school English teacher asked her students to write a haiku to review for a vocabulary test. The haiku had to utilize at least one of their vocab words. The teacher also gave them another, specific instruction, remarking that the students were NOT allowed to end their haikus with the word \"refrigerator,\" which is a popular joke in haiku circles as the word contains five syllables.\n\nSo my daughter came up with this little gem:\n\n&#x200B;\n\n*Refrigerator*\n\n*I circumvented the rule*\n\n*Haha microwave*\n\n&#x200B;\n\nI eventually stopped laughing long enough to wipe away my prideful tears and give her a hug. (Circumvent was one of their vocabulary words.)\n\nHer teacher just laughed and said \"That's very clever\" in a slightly annoyed tone. She received full credit on the assignment.",
        "permalink": "/r/MaliciousCompliance/comments/lsyevh/maliciously_poetic/",
        "comments": [
            "In high school English class we would be given a list of vocabulary words to use in sentences.  My friend and I would get into competitions to write a short story with the words, using alternate definitions. We got really crazy with it and thought we were the biggest smartasses in town.  Only later did we realize we were doing exactly what she wanted. We were learning the alternate definitions and using them appropriately.  LoL we thought we were putting one over on her but I'm sure she was actually super proud of us.",
            "Your daughter is right\n\nSilly rules should be broken\n\nShe totally rocks!",
            "My personal favorite part is that she ended it with \"microwave,\" throwing in another appliance just to hammer home the point.",
            "Former middle school English teacher here. Your daughter's MC is fantastic!\n\nI once gave each of my students an index card and asked them to pick and adjective and illustrate it. Like they could do the word \"cold\" and make the letters look like icicles, etc. \n\nOne student turned in a card that was completely blank, and I asked him why he hadn't finished the assignment. \"I did, Miss. My word is 'invisible.'\"\n\nI gave him all the points but adjusted my rule for the next year. :)",
            "I feel like kids in middle school probably are unaware of the popular jokes in haiku-writing circles, thus the teacher asked for this by telling the kids not to do something that they probably never would have considered doing without that instruction.",
            "Laughed at this for a solid minute.\n\nIt's amazing the level of creativity that can be borne out of spite.",
            "Is it malicious compliance when the teacher got exactly what they wanted though?\n\nYour daughter thought really creatively, used one of the vocab words and used a non-lazy 5 syllable ending. She’ll also never forget the structure of a haiku!\n\nSounds like winning all round to me.",
            "I'm sorry to inform your daughter that microwave has four syllables. [Just ask our darling Nigella.](https://www.youtube.com/watch?v=4KrUxLBHVu8)",
            "Creativity   \nAnd malicious compliance   \nA redditor’s pride",
            "As a teacher, I fully support this.\n\n1.  Loads of creative thinkings went into this;\n2. She completed the assignment to the exact specifications;\n3. It takes someone with excruciatingly high wit to pull this off.\n\nMagnificent.",
            "That's good that her teacher didn't try to bend the rules after the fact too. \n\nWhen I was in high school we had to write a paper on our own \"Scarlet Letter.\" One of my best friends would always pull pranks whenever he could and this was one of his best ones yet. Since our junior year English teacher didn't think she had to mention we should have proper grammar and spelling in the rubric for the paper, my friend made his \"I for Inglish.\" His entire paper was misspelled and use horrible grammar because he hated English classes but since she didn't put it in the rubric that it had to be correct, he got full points for the paper. His sentences were like \"Inglish is mine scarlet letter cuz it's da worstest thing in the world.\"",
            "[removed]",
            "I have a question.\n\nWhere is the u/haikusbot\n\nWhen we are in need?",
            "A former coworker told about finding a slip of paper in her late father's wallet; it was from when she was in Second Grade.  It was her weekly vocabulary word quiz, which had the letters scrambled and the kids had to figure the word out.  Her vocabulary word was \"this\"; she unscrambled it and wrote \"shit\".  Teacher circled it and wrote, \"*This is* ***NOT*** *one of our vocabulary words!\"*",
            "Your daughter will go as far as she wishes.  If she failed to appreciate the joke, the teacher won't.",
            "Full credit?  She should not have received full credit.  She should have gotten extra credit.",
            "omg I love this so much and if I was the teacher I would have howled, that's AMAZING. Especially clever since \"circumvent\" was the vocabulary word! Dang I would have given the girl bonus points for that! lol",
            "Your daughter is so clever! I love this so much. I hope she's a writer or something, because I bet she'd be brilliant.",
            "Well done sassy child\n\nGood malicious compliance\n\nRefrigerator",
            "Your kid really knows\n\nHow to stick it the man. \n\nRefrigerator!",
            "I’m surprised the haiku boy isn’t having a field day with those top comments",
            "TIL there are inside jokes in haiku circles.\n\nAlso, TIL there are haiku circles",
            "Fuck Haiku structure\n\nI write however I want\n\nWhat you lookin at? Punk!",
            "Roses are not blue\n\nViolets are very purple\n\nHaikus are hard...\n\n....Shit.",
            "That is glorious, I can't stop laughing. Major kudos to your daughter!",
            "She’s very clever\n\nThe envy of her classroom\n\nShe got an A now",
            "Haikus are easy \n\nHaikus are simple and fun \n\nBlue Eyes White Dragon",
            "Totally awesome\n\nIs the kid that you have raised\n\nWell done job Mama!",
            "your daughter is my new hero.",
            "😂 hilarious. Well done",
            "One of my friends has been writing three word haikus for a few years now. :) \nI don't recall him using refrigerator, but I just may have missed",
            "Am I the only one who thinks they missed out on a lesson in school? \nWhat is a haiku?",
            "Like a falling leaf\n    \nPeople seldom remember\n    \nOne line about Nature",
            "in my creative writing course we were EXPLICITLY told we couldn’t do haikus for our daily warmups. we were never told we couldn’t do poetry (if it wasn’t a “do x” assignment). \n\ni wrote around 100 limericks by the end of my senior year. i got full credit.\n\nexcept for one time when i just roasted her for a minute straight for not coming up with a proper warmup assignment. thankfully she thought it was hilarious, and ended up giving me bonus points.",
            "I love it 😂 senior year we had to right 1 poem for our senior project and I wrote about how I hated poetry. This gives the same energy and I'm here for it",
            "\"A joke in haiku circles.\"\n\n...\n\nI have so many questions.",
            "This is so fucking funny, your daughter is such a gem! I love kids with great senses of humor",
            "Ultimatum  \nCan't use refrigerator  \nStupid haiku rules",
            "This is hysterical. So clever. The last line is comedy gold. Such timing.",
            "LMAO your daughter's amazing 🤣",
            "Lmao! Your daughter is going places!",
            "An open gift box 🎁\ngave me something to give you 🎁\na helpful award 🎁",
            "This cracked me up",
            "I won an award for a haiku once in grade school!\n\nHaiku, I hate you\nYou are way too hard to do\nWith your syllables",
            "That kid is going places!",
            "Haha, I heard what the teacher said in Alan Rickman's voice",
            "I had an English class in college where the prof let us decide what type of paper we wanted to write for our final assignment (essay, book review, etc), and didn’t give any guidelines before he left the room for a few minutes to let us decide. He came back in after I convinced everyone to agree on a haiku. He ruled that out pretty quickly and we went with a book review, BUT I did some scrounging and found a haiku as part of a scholarly source and quoted it in my paper lol",
            "/u/refrigeratorhaikuguy would be proud.",
            "Is anyone reading the haiku is Zer0's voice?",
            "What a great story!\n\nYour girl is a genius.\n\nGood, she got credit.",
            "Refrigerator? \n\nCan't use refrigerator; \n\nInstead, use the fridge!",
            "I just spent 15 minutes trying to explain to my sweetheart why this is HILARIOUS, but he still doesn't get the joke. I'm still laughing though!",
            "Arbitrary line  \nBreaks in poetical form  \nHow few beats in orange?",
            "Where is haikubot?",
            "I watch a lot of arrested development, and I'm pretty sure it's pronounce cirsumvent",
            "As a child, I was always confused as to how anyone came up with these rules because they would never occur to me until AFTER they were mentioned.\n\nLike the rule where we couldn't end our creative writing assignments with \"and it was all a dream.\"\n\nNever did it, nor did I ever feel the need to because it turned out that I have this problem where I actually enjoy seeing how my own stories end.",
            "She’s a sharp one!",
            "Coming from a middle school English teacher, I heartily approve of this post",
            "As a middle school teacher I would have LOVED this and hung it up.",
            "That shows real talent, and her teacher should have been proud.",
            "Well done!!!  I see we have a troll-in-training!",
            "Holy fuck, circumvent is one of my vocab words this week",
            "Is my humor so broken that the haiku made me actually bust out in laughter LMAO",
            "As a teacher I would have been so proud if one of my students submitted this...",
            "That’s so adorable.",
            "Your daughter is a hero! Hahahahahahahaha",
            "As a teacher, I can personally say that I'd give your daughter a bonus point for that.",
            "Man, that sounds like a fun English teacher. In my middle school, we had I memorize like 50 some prepositions. Write them all down in a list. Just from memory. No multiple choice, no fill-in-the-blank with a completed sentence, just listing them off one by one. Thankfully she doesn’t teach any longer, but she was awful",
            "The farce is strong in that one",
            "Damn *straight* she got full credit.\n*reddit stands behind her cracking knuckles ominously *",
            "True story:\nIn high school, I was taking an SAT prep class (which by law we weren't allowed to take so it wasn't called an SAT prep class, but it, let's face it: it was an SAT prep class) and the vocabulary words we were studying one particular day described my dad to a T. So, I put them together in a sentence, memorized it and took it home to use on my dad.\n\nWhen I got home, both my parents were in the kitchen. PERFECT! So, I turned to my mom and said, \"Mom, did you know Dad's very overt about not being opulent so he's taken painstaking care at remaining parsimonious?\" (It means he's cheap). \n\nWithout skipping a beat, my dad turns to me and says, \"Quit making fun of my pecuniary predispositions.\"\n\nThat was the early 90s. I still don't know what that means.\n\nWell, I do, but saying I don't is funnier.",
            "oh, i had that assignment in my middle school language arts class. my smart ass was like \"you didn't say it had to be *english*\" and turned in a poem in kanji.\n\nmy teacher couldn't even be mad.\n\nor read it.\n\n(i don't speak japanese.)",
            "Have you ever heard\nA haiku, about haikus\nWell here is one now",
            "My jr English teacher issued textbooks but never used them. No Shakespeare, we presented one act plays as groups. Poetry? Favorite song lyrics, for analysis and dissection.\n\nSOOOO much fun and  decades ahead of her time. This was in the late 70s.\n\nEdit:spelling.",
            "U/haikusbot",
            "Lol haikus are supposed to be about nature and weather normally 😂",
            "You realize you are going to hate this smart cookie when she turns it on you. But I love it! She is smart, bright and a wicked sense of humor.",
            "It's snowing on Mt Fuji",
            "That is excellent",
            "I think your daughter is ready for /r/dadjokes now",
            "I have no bloody idea what's going on here 😂",
            "Wonderful English skills",
            "The one I wrote in a similar class years ago: \n\nHelp me, I'm trapped in\n\n\na small space called a haiku. \n\n\nOuch! I bumped my head!",
            "\\> (Circumvent was one of their vocabulary words.)\n\nI was gonna be pretty upset if it was any of the other options here.",
            "I love it. Your daughter is brilliant.",
            "I cackled. Give her a hug from me too. This is awesome!",
            "That's perfect. As an English instructor, I too would have given her full marks.",
            "As a teacher, I appreciate when kids find creative ways to bend the rules. A+ for this kid.",
            "My high school teacher would’ve drawn a big red F with a circle around it and a big ol mad face lol",
            "Well the teacher played herself 😁 never underestimate students",
            "I am the brother of the person who wrote this masterpiece haiku, and I could not be happier."
        ]
    },
    {
        "post_id": "m97fts",
        "author": "Kay20142",
        "title": "You want me in? Okay then",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/m97fts/you_want_me_in_okay_then/",
        "score": 14945,
        "num_comments": 566,
        "created_utc": 1616248243.0,
        "selftext": "This happened 12-15 years ago, my ex boss was a bully (I took the official route and he lost his job in the end for breaking pregnancy laws) \nAround this time I kept getting really bad ear infections in my ears. I was told I can still work, important to note that I’m Deaf and wear 2 hearing aids, with out them I hear nothing. \n\nSo he had me on a freezing snowy day stand outside running a stand about the environmental work that was due to be carried out, I had a bad ear and a cold already. By the end of the day I couldn’t feel my feet (steel toe cap boots work made us wear) boss told me it was my fault not drinking hot drinks (I only like cold drinks) \n\nNext day was Saturday, and I spend the day in the warmth of my flat trying to get better, but my ear was killing me. So I called our out of hours NHS and told me to go to the treatment Centre. Was seen and got told that I had a very nasty ear infection and gave me antibiotics. Woke up Sunday to my ear twice it’s normal side, burning, and half my face numb, I knew I was in a bad way. \n\nDrove myself to A&E at 1am, all they could do at the time was give me pain meds and make me comfortable until the ear specialist comes in on the Monday morning. Several hours go by and by then I can’t move my jaw, my ear is swollen shut. My ear was so badly infected that I was admitted onto the ward with a drip of antibiotics, a wick in my closed ear (I passed out when they did this) to put antibiotics in the ear and a morphine pump. \n\nAnyhow after 2 weeks I was back at work in front of my Boss and the HR lady as I had gone over my 10 sick days allowance. Um I was in hospital for over a week, doesn’t matter and you should still come into work if you have a bad ear. \n\nI said I do, but if both flares up I can’t come in. (I work outside with the public) HR lady said that be fine we give you office work, phone duties. \n\nI said you want me to come in when I can’t wear my hearing aids and do phone duties. \n\nBoth her and the boss said yes. \n\nOkay fine then. Signed the paperwork to say that we had this chat etc. \n\nI was angry as I felt he had caused me to be in hospital and they don’t just keep you in for the sake of it. \n\nSure enough the following month both ears flared up and I couldn’t wear both hearing aids, it was scary for me to leave my home not being able to hear but I had to follow their rules. \n\nGot into the office, told boss my ears gone bad again but I’m here. \n\n(I was told later I had shouted) Boss said something (I decided not to lip read, I wasn’t making it easy for him) I kept shouting “what you say?” A few times and then he wrote go to the desk over there and deal with any phone queries. \n\n“Okay!”\n\nSo I sat there, staring at the phone waiting for it to ring. After a couple of hours, the phone hasn’t rung, Boss came over and started talking to me, red in the face. \n\nI looked at him puzzled and said “what did you say?” \n\nHe look so angry and wrote down ‘why aren’t you answering the phone?’ \n\nI looked back at him and said “well, I haven’t heard it rung yet!”\n\nSwear he had steam coming out of his ears, I got sent back home as I was a ‘health and safety risk!’  Apparently the phone had been ringing off the hook the whole time but of course I couldn’t hear it ringing.\n\n\nSeriously asking a deaf person who can’t wear their hearing aids to do phone duties!!! \n\nThankfully only had one more hospital induced ear infection since and strangely after having my tonsils removed after way too many tonsillitis, I haven’t had one ear infection.",
        "permalink": "/r/MaliciousCompliance/comments/m97fts/you_want_me_in_okay_then/",
        "comments": [
            "I’m deaf and work at a hospital. More than once I have been told my customer service skills need work as I don’t hear people when they’re asking for help.\n\nI’m actively looking for a new job as the daily facepalm is starting to mold my nose.",
            "You telling me at no point did \"can't hear shit\" and \"phone duties\" not ring any bells in the marshmallow behind his eyes? That's... Well let's just say I'd handle it like you did",
            "Glad to hear you are not suffering from these painful infections any more. \n\nYour boss and the HR person were not very bright. Who puts a deaf person on telephone duty!? It would be completely unsuitable for you when you were well, let alone when you had a double ear infection!",
            "I want to hear the story of how he got sacked in the end! Please please pleeeeease, do tell us. \n\nDue to his bullying, if your actions directly resulted in him losing his job, please post in prorevenge. it would be suitable.",
            "Had a friend who was red-green colorblind.  When interviewing at a grocery store, she was told she’d be in charge of stocking the bananas.  It was important to put only the older, yellow bananas out for sale, but she couldn’t tell the difference between those and the bananas that were still green.  She explained that to the manager interviewing her and was told she’d have to do it anyway.\n\nSo my friend gets hired, put in charge of stocking bananas, and inevitably brings out green bananas as much as yellow ones.  Manager tells her she’s doing it wrong, and my friend again explains that she’s color blind and can’t tell the difference.\n\nApparently they had that conversation about once a week the whole time she worked there.  Never got switched off banana duty.",
            "You didn't have any more ear infections after your tonsils came out because you only ever had one infection, and the doctors were not checking your ears to make sure they were clear after the course of antibiotics.  This is more common than you'd think.\n\nMy mother dealt with me having ear infections every two to three weeks for over a year before she was fed up enough to demand a second opinion.  Second doc looked in my ear and said 'oh, there's an ear infection, I'll give you a prescription for amoxicillin.'  My mother replied 'Tash just finished a course of amoxicillin this morning!'  The second doc paused, nodded and said 'in that case we'll schedule a tonsillectomy as soon as possible.'\n\nthat was 44 years ago.  No more ear infections.",
            "Your Boss and HR are horrible but this is one of the funniest things I have read on this forum. One of the few stories that truly made me LOL.\n\nThis is amazing MC. Thank you for sharing.",
            "I had bad ear infections when I was a kid. I got the wick once when I was around 11-12 years old. \n\nI screamed. Afterward, I apologized to the doctor. He said “Actually, you did pretty well. Most people I do that to pass out cold”.",
            "I get double ear infections every year around January, they always require antibiotics, they always severely inhibit my hearing, they're incredible painful, and they hinder my balance and ability to perform daily tasks for about 2-3 weeks.\n\nI can't imagine not being able to hear at all *and* have all that pain, jeez.",
            "I used to get ear infections over and over until I had two bad teeth pulled out.  I can't remember the last time I had an ear infection or bad throat infection since the dental work.",
            "I'm sure in their minds you were faking it, because they had never experienced not being able to hear. And if they left you long enough with ringing phones, you would eventually give in and answer it. Instead of coming to their senses and being ashamed of themselves, they directed their negative emotion on you. Health and safety risk. BS narcissistic behaviour.",
            "Wow, glad you got out of there and even more happy you got your infections wrangled.  It seems like your ex boss was a little too economical in his thought processes.  That can be a ‘health and safety risk!’",
            "As with most bullies, he displayed sheer, utter brilliance in his fantastic workaround.",
            "Having my tonsils taken out cured most things for me too. Apparently they were nasty, pitted and pocketed balls of flesh that were harboring bacteria and constantly infecting me. A vicious upper respiratory cycle. \n\nI've only just started learning sign language but have learned a lot more about the deaf community. Sorry hearing folks don't understand and glad this MC was so effective.",
            "I imagine there's not much that's strange about having fewer ear problems after having a tonsillectomy. You'd had recurrent bouts of tonsillitis, and ear, nose, and throat issues can all aggravate each other.\n\nDon't know how your ex-boss expected this scenario to play out. Did he expect you to lip-read the phone or something?! Classic combination of stupid and arsehole. I hope nobody else has to put up with his crap nowadays.",
            "I was in the U.K.  started out with a general ear infection that got worse, so I took myself to a&e as it was evening. They refused to see me because I was having treatment from my GP (oral antibiotics).  By the time I got back to the GP in the morning, both external auditory canals had completely shut and both sides of my face were swollen. Couldn’t hear a damn thing. Not my baby crying, nothing. And  I had taken enough sleeping tablets to tranquillise a rhino (according to my GP) to no effect. He was so cross with the hospital he rang ENT and discussed me directly with the consultant. I was told to go directly to hospital, bypass a&e and go straight to the ward where they were expecting me.  \n\nI had the wick in both ears. I nearly pulled the radiator off the wall while they were doing it. I too was awarded the order of the morphine drip. \n\nCan I say, I’m no stranger to pain, I’ve had a 10lb 14oz baby with no pain killers, and meningitis, but this had me climbing the walls.",
            "I used to get tonsillitis quite a bit as a kid.  I was pretty much guaranteed to get it at least twice a year.  One year, I got it 6 times in an 8 month period.  That was when the doc finally removed my tonsils.  I didn't miss a single day of school after that, and I've only missed work 5 or 6 times in the 20 years I've been working.\n\nOne of those times was for an ear infection.  It was only one ear, but it was hurting bad enough that I wasn't able to sleep, despite taking ibuprofen, acetaminophen (known as paracetamol in most of the non-US part of the world), aspirin, *and* pain relieving ear drops.\n\nI was in my early 30s at the time, but I had to have my mom drive me to urgent care (lack of sleep, too much pain in the moment, I'm stubborn, but even I knew it was a bad idea to try to drive myself) the next morning.\n\nThe doc estimated that my ear was about 95% closed from the swelling.  He installed an ear wick (I didn't pass out, but *damn* did that hurt!), prescribed me some antibiotics (both oral and ear drops, which is why I needed the wick) and some narcotic level painkillers.",
            "Pretty shitty situation but the mental image of someone dilgently sitting at a phone watching it ring like mad is pretty funny. The secondary mental image of someone periodically picking up the phone, whether it's ringing or not, yelling down the line and guessing what the response is, is fucking hilarious.",
            "Truly enjoyed this MC. Well done!",
            "Semi off-topic but the new zoom auto-caption is a godsend.",
            "Wow.\n\nI use hearing aids, lip read and know American Sign Language as well.\n\nI've worked with people who don't understand that hearing aids only ampify noise, it doesn't help me to interpret it, but I have never had anyone ask me to answer the phone....!\n\nSome people must be terminally stupid.  How do they even remember to breathe so they stay alive??????",
            "They thought since you’re already deaf, how bad  that ear infection can hurt you.  Glad that you got your revenge later.",
            "My last really bad earache was in the third grade. My teacher didn't like me. She was an Arabic Catholic nun teaching at a private catholic school. She was beyond conservative. I told her about my earache and she told me I was lying. When i started crying at my desk she sent me to the back of the room. It wasn't until I passed out that I got sent to the principals office, after my teacher yelled at me to stop causing trouble, then lifted my hand to watch it fall, then lifted head to watch it fall (and bang on the desk at the back of the room facing the back wall.)",
            "I’m an employment lawyer. We had a client in a similar situation where the employer kept sending him letters about work stuff.\n\n\n\nHe’s blind.",
            "Isn't it sad that people with hearing loss get about one 1000th the sympathy and understanding that blind people get? Not begrudging that, of course, but your boss would never ever consider putting you on, say, traffic duty, if you were blind!",
            "I don’t tend to get sick often, but when I do, the worst that happens is that I lose my voice. And my last job I was a Front Desk Coordinator with a timeshare office which involved a lot of interaction and conversation with our guests.  I had to switch duties with my coworker one day, she’d be the one to greet and check in the tours while I assigned them to the appropriate “vacation counselor”.  I still had to answer the occasional question, but it was a little frustrating when the guest would say they couldn’t hear me.",
            "Same for me. My doctor said it was because when they removed my tonsils they found out they'd been basically permanently infected inside thus providing the petri dish for keeping me sick. I got them out when I was 13 after suffering 4-6 severe ear infections every year and now at 55 can report I haven't had an ear infection since.",
            "\"I'm deaf!\"\n\n\"OK, just answer the phones.....\"\n\nThese people vote, Ladies and Gentlemen....",
            "Reminded me of [this. ](https://youtu.be/L7L3iSZsNpY)",
            "What a horrible environment to have worked in. The best employers encourage their staff to take time off when needed, and that their health, and their families, are more important. \n\nAfter decades of shit jobs with shit employers, I am finally in a nurturing and encouraging work environment. I wish that for all of you here. It makes a huge, positive impact on your life, and helps you focus on your immediate priorities (instead of fearing you will be fired for taking time off to see a doctor, etc.) \n\nOP, that makes total sense that your tonsils were likely the culprit of all of your suffering with ear infections. I am glad to hear you had them removed, and I hope you are doing much better!",
            "Hahahaha, my nan had really shit hearing for most of her life, and one of her jobs was to listen to records and flag if there were any crackles or pops. All of her records came out clear :D asking someone who is deaf to listen to something is the dumbest thing, I'm so glad you did what they asked them to do and proved them to be morons.",
            "Good for you. What sort of idiot asks a deaf or hard of hearing person to do phone duties while they are unable to use hearing aids??! Glad to hear they eventually got fired.",
            "\"Haven't heard it ring yet\"\n\nThat response is pure gold!",
            "Your ears and sinuses are connected in weird ways. My guess is you had a lingering pocket of streptococcal hanging around on your tonsils, and that was occassionally causing the ear infections!\n\nI got ear infections so often as a kid I have a massive amount of scarring in my ears- but I never felt them. Sure did feel the sinus infections though.",
            "So what did the other people in the phone bank area say?\n\nI mean I'd be laughing my ass off the whole time.",
            "Oh my heck, this brings back so many memories. Growing up, I always had chronic tonsillitis but they wouldn’t remove them which was stupid. \n\nI constantly surfed, which is like swimming in nature’s toilet and especially bad in the winter when the rain clears out the rotting creek debris and washes all of the gunk on the streets into the storm drains and into the ocean.\n\nSo, here I am with chronic tonsillitis, which when introduced to all of the other garbage creates double ear infections, sinus infections, chest infections, etc. It was so common that I just lived with it on and off for years.\n\n“Oh, you can’t get ear infections as an adult” they’d say, “only babies and infants get ear infections...”\n\nYeah, whatever, just take a look...\n\n“”Holy crap! It’s a hot mess in there!”\n\nUh, yeah. Been there, done that. I got my tonsils out when I was 28 and it almost killed me and was a whole other story, but I’d do it again in a heartbeat. It’s completely eliminated the chronic sickness since.",
            "I’ve had this happen so many times in the USA. I’ve even had management expect me to just suddenly have my hearing back one day, almost like I’ve broken an arm",
            "Sick days should be illimitate. It's so stupid that you have a max number of days where you can be absent from work because of sickness",
            "I only wish I’d been there to see this. Good for you, OP! And I’m glad he got fired. I’d love to hear the pregnancy story.",
            "Ears, eyes and throat are all connected when you get infections.. still stupid of your boss to put someone hearing impaired on phone duty.",
            "I had similar problems, I’d get strep like 6 times a years, doc told me I should have my tonsils out but warned me that, since I was 20, it would be extremely painful. He told me it’d be much worse than if I was younger but I thought he was exaggerating, he was not, in 4 weeks I managed to finish one quart on rainbow sherbet, I lost 25 pounds 😳",
            "Just want to point out that “not liking hot drinks” has nothing to do with your feet getting cold. And you aren’t obligated to explain why your feet are cold when you’re standing outside in freezing weather, anyway!\n\nWell handled on the phone thing, though!",
            "Ah yes, the old remove the tonsils trick. In the states, up until the 70's they regularly removed your tonsils if you had chronic ear infections. Then because everything in the states is either yes or no, never a grey area, the pendulum swung the other way and it was barbaric to remove tonsils for ear infections. My sister is three years older than I am, she had hers removed at 3. I did also at 3. My little brother is 14 months younger, same amount of infections, if not more, and by then it was nope, not removing your tonsils. Poor kid was on antibiotics a lot and finally grew out of them around 6 or 7. Neither myself or my big sis had another ear infection after getting ours out. Now I hear stories of kids struggling for years with chronic infections, tonsilitis, sleep apnea, ADHD, and then they finally take them out when they are older and it is more risky of a surgery. I say take them out.",
            "Glad you survived that and haven't had any more ear issues since. My sister had issues with her tonsils, and the doctor told us at the time that tonsils cause a lot of ear issues too. I had completely forgotten about that until you mentioned that you hadn't had any more ear infections after the tonsils were removed. Hopefully your old boss and HR lady didn't put anyone else in danger",
            "To anyone reading through the comments here who’s experienced similar health care related issues and how to approach them with work. YMMV depending on country:\n\nIn many countries there’s specifically H&S related personnel who take care of H&S in the workplace. I’m one of those people. HR exists for the employer, not the employee. They exist to mitigate employer liability and ensure the employer doesn’t end up with labour fines because of the Mishandling of employer-employee relationships. \n\nIf you ever find that you need extended periods of time off work for health related reasons, always involve your Health and Safety Administrator/coordinator. More often than not their role is to ensure compliance from the employer, but they’re also very passionate about making sure employees are safe. It’s all our job is. When speaking to your health care practitioner ask about a note for your condition and Return to Work (RTW) instructions or guidelines. \n\nIn a lot of cases a health care practitioner will supply a note for us for what you can and cannot do with your injuries. In many countries it doesn’t matter if it happened at work or not, we have to follow the RTW program because it covers the employer from unnecessary damages if you were to return to work and injure yourself on site. It also ensures that you heal and can still come to work if there is work available. This RTW program, provided by the guidelines of a Health care practitioner ensure that we know what you can and can’t do, and helps us work with you to get better and return to your regular position in time.",
            "Been there, done that with upper respiratory infections, antibiotics kill the auditory system and infected tonsils get you the most spectacular pain in the ears. You should have gotten them removed way earlier; my Mom got tired of said throat and ear infections my brother and I were always running a fever.\nSo she arranged for both of us to get surgery the same day but I have to say that the pain after surgery is pretty awful after that the infections almost disappeared. I kept getting infections until I was an adult but not as severe.",
            "I was working when the new intern doctors showed up in icu. One had an unusual stethoscope his father (also a doctor) had custom made for him. In essence this guy was deaf. This was the only way he’d be able to hear heart and lung sounds. During his training, myself and the resident were showing him, and talking him through placing an arterial line in someone’s arm. We both were very loudly giving step by step instructions. Finally an exasperated coworker came over and said “Why are you two always yelling at him?!!!” Surprised we turned to them and in unison said “because he’s deaf!”",
            "Honestly....I’m so confused. The boss knew he had to write stuff down for you, so how did he expect you to talk to people on the phone?\n\nNobody is that crazy. What was his logic there?",
            "I can only imagine the shit-eating grin you must have had when you responded on why you can't answer the phone.",
            "If your boss had steam coming out of his ears, that can’t be healthy.  Maybe you could recommend a good hearing aid to him.",
            "so, did you inherit his title then?",
            ">“well, I haven’t heard it rung yet!”\n\nLMAO. Sounds like he finally got the hint. It makes me mad how much of a dunce your boss is (and I DO hope you report him to some government agency like OSHA or something to do with anti-discrimination or disability equality department).\n\nI'm glad you got your tonsils out. I've found those annoying fuckers often cause more harm by somehow harboring/enabling diseases. I used to get strep throat twice a year, ear infections 3-ish times every year plus catching a bad cold 6 times a year. I got them removed and never got strep throat again. I still get colds sometimes, but not nearly as often either (like, average of 2-3 times/year). As for ear infections, they're not nearly as severe now (and only happen about once a year).",
            "Cool MC but can we take a moment to appreciate modern medicine? Just 70-80 years ago such a nasty infection would've been a death sentence. Now it's a routine procedure and a week in the hospital",
            "Deaf and constant ear infections? Are those facts related? Must be super annoying to have a body part that doesn't work properly and gets infected all the time",
            "The US Healthcare System is indeed outrageously expensive, but if you're ear is that infected, even on the weekend, they have a specialist available to come in 24/7/365.  There are some aspect to our system that are fantastic.  Too bad we can't find a healthy balance somehow, but that's another conversation enitrely.  Glad you we able to make your bosses head spin, even if it meant you had to leave your house withour your aids.",
            "Your boss and your HR lady are not even worth flushing down the bog.  Nasty, nasty people.",
            "When you sleep do you take out the hearing aids? I mean is it advisable if let’s say you want to hear your alarm or maybe theres an emergency ?",
            "Ok, one idiot is one thing, but the the hell was the HR person thinking? Demanding you come in when you can't hear so you can answer phones? I hope you didn't have to work there much longer.",
            "As a deaf person with hearing aids I am so angry at this. How dare they force you in? You. Can’t. Hear. \n\nCurious about limited sick leave in the UK? I guess I’m lucky because I work for the NHS. \n\n\nAlso - I used to get really bad infections in my R ear and had much less problems since I had my tonsils out as well. Now I’m curious about the link!",
            "I used to have so many ear infections as a child and once again one Christmas in college and it fucking sucks. Hope you're somewhere where you're respected now",
            "Sidebar: I had ear infections all my life, from birth to removal or my tonsils in my 30's.  I should have removed them before but no Dr tied them to my ear infections. I can't count the number of ruptured ear drums I have suffered.",
            "I don't know who is worse, HR or the boss.",
            "I can't get over how horrible working condition are in some countries.",
            "That's some employee of the year compliance right there",
            "I used to get severe ear infections as a child, and removing my tonsils and putting tubes in my ears (to drain the excess fluid) has corrected my problem. For some reason, removing tonsils does help some people with preventing ear infections. I think it's because the tissue might be somehow connected to part of the ear canal, causing both colds/flus and ear infections to aggravate each other. I'm glad that your ears are now infection free.",
            "You really should have had a union involved with this.",
            "Please tell me both idiot boss and the HR rep were fired for being complete idiots?",
            "I'm partly deaf, i think due a lot to the psoriasis I get IN my ear canals... My hearing aids give me ear infections.\nI honestly prefer to not hear than to have so many infections! \n\nAlso, not a big fan of people, so I can ignore them with an excuse! Lol",
            "I would argue that what you have experienced is discrimination on the grounds of disability and I presume you’re in the UK because you mention the NHS. By law employers have make reasonable adjustments for employees. I think it would be covered under the 2010 equalities act. Maybe you could speak to citizens advice bureau or an organisation for deaf people? I would suggest speaking to HR but it sounds like they are pretty useless. Hope things get better at work, your boss sounds awful.",
            "Ok, maybe I'm too European to understand this, but ... how is there a sick day allowance? In which universe does this even begin to make any sense?",
            "Now don’t want these people watching his show",
            "I have posted on petty revenge",
            "Lol whoever recruited you probably lost their job",
            "R/unpopularopinion A lot in this story doesn’t add up.",
            "> (I only like cold drinks)\n\nWhat??? This is insane.",
            ">it was my fault not drinking hot drinks (I only like cold drinks) \n\nHe's right.",
            "Hmm. So you want a company to pay you for work that you can’t always do because infections sometimes prevent you from using your hearing aids ? The boss and HR did some wrong for sure....but it’s their fault you got cold because you were required to work outside and you “only drink cold drinks” ??? Uh-huh, I’m sure the North Sea Fishermen’s Union will be right behind you. Then they were good enough to give you office work and by your own admission you deliberately failed to answer the phone, potentially losing multiple customers. Hell yeah you deserved the sack.",
            "Geeze, how do you make me do this?\"",
            "Growing up I had chronic ear infections. I had my tonsils and adenoids taken out, no more ear infections",
            "I want to MARRY his attitude and have it’s a big No-No in employment law. You CANNOT be working while not clocked in. I assume you are not in a union right?",
            "Had the tonsils done at five.  Helped a lot.  Worn hearing aids all my life",
            "> he lost his job in the end for breaking pregnancy laws \n\nWould like to know this story too!",
            "Please post his LinkedIn profile. Please.",
            "Amazing!",
            "I had the same issue (chronic ear infections) until after I begged and pleaded for the doctor to remove my tonsils. They finally relented when I nearly OD'ed on the pain killers they were giving me to manage the pain.\n\nHavent had an ear infection since, over 30 years. But my hearing is jacked up though... Not the happy ending I would have liked.",
            "This is pure gold and I really wish I had some to give you.",
            "If you've never had a really painful ear infection then you just don't get it.\n\n I had a quadruple (inner and outer ear infection in both ears) in college that was compounded with fungal infections.  If I had a gun I would have shot myself -- the pain was so bad.  My jaw locked up and I couldn't eat.  In the ER a resident in training tried to jam a wick in my ear (it's a crusty sponge tube thing) and I was in fetal position crying in pain.  Thank goodness another doctor saw what was going on and gave me an injection for the pain.  I know exactly the kind of ear infection OP is describing.  My ears were messed up for weeks.  \n\nI'm sorry your boss/HR were total asshats.  Of course you can't wear hearing aids with an ear infection.  And what part of \"antibiotic drip in the hospital\" is unclear??  Damn.  My situation sucked but they didn't harass me at work.",
            "This whole story screams “thin skull rule” 🥲",
            "I had excessive ear infections as a kid and they removed my tonsils to prevent them! Everything in that area of your head is interconnected so I guess it helps.",
            "I also dislike hot drinks even when I'm cold.",
            "The level of stupidity some people have in management is mind boggling!",
            "Im so sorry he was pribably mentally ill",
            "I was in the UK in the early 90s, and tried to contact my uncle in Manchester. He lived in a tower block, but didn't have a phone, so had given us the number of a neighbour. The following exchange is etched into my memory.\n\n[Rings]\n\n'ulloh [Mancunian accent; sounds like an older woman]\n\nHello, sorry to bother you. You don't know me, but I'm trying to contact your neighbour, Walter Oldham, and he gave me your number.\n\nYerwoh'? [Lancashire version of \"You what?\" = I beg your pardon?]\n\n😞[Speaking more slowly] Sorry. My uncle, Walter Oldham, gave me this number to get in touch. He said you're his neighbour?\n\nYerwoh'?\n\n😟[Remembering my NZ accent, and trying to enunciate carefully] I'm trying to get in touch with Walter Oldham. Is he your neighbour? [no longer *saying* sorry, but definitely starting to feel it now]\n\n[Slightly louder] Yerwoh'?\n\n😦[Ditto] Walter Oldham? Do you know Walter Oldham? [Now saying \"old ham\" instead of \"oldem\", in the forlorn hope that it might help]\n\n[Louder] YERWOH'?\n\n😧[Almost shouting now] WALTER OLD HAM. DO YOU KNOW WALTER OLD HAM?\n\nI'm sorry luv, I've not got my hearing aid in. I can't hear what you're saying.\n\n😨(At this point I had a vision of that Fawlty Towers episode: \"I have a hearing aid, but I don't turn it on, because it wears out the batteries.\" \"For the love of god, turn it on ... before one of us dies.\")\n\n[Accepting defeat] I'm sorry [I really am now] to have bothered you [and to have picked up the phone in the first place]. Goodbye.\n\n[Hangs up]\n\nNow look, I know that there are phones that light up, so people with hearing difficulties know that it's ringing, but why, *for the love of humanity*, would you answer the fucking thing if you know that you can't hear the person on the other end without your hearing aid?\n\n(And, no, I never did manage to contact my uncle. I would have liked to ask why he gave me the phone number of a deaf woman.)",
            "I feel bad for you with all that pain. I hope it doesn't happen anymore",
            "There's a saying....the one who is most deaf is the one who does not listen.",
            "Your boss and HR were total\nAsshats.",
            "Love how you’re deaf but he’s the one not hearing things😂",
            "I wear hearing aids too and it drives me nuts when they try to make me to phone duties",
            "Literally can't stop laughing lmao",
            "I saw the last part about the tonsils causing ear infections, when I was 10 this is exactly what happened to me from when I was 9 and a half to 10 I’d get a monthly ear infection and the doctors removed my tonsils and I’m 21 now and haven’t got one since",
            "The Eustachian tubes connect your ears to your mouth, and tonsils are notorious for harboring bacteria, so that’s probably why your ear infections went away",
            "Yeah, bad tonsils can cause a whole host of other issues. I thought I needed my tonsils out a few years back, because I was constantly getting colds. I thought. Like every 2-3 weeks I was sick. Turns out I had a massive sinus infection. One side was completely full and the other was 1/2 full. I was on meds for a month to cleas it up. Luckily they worked or they would have had to physically drain them and that would have sucked balls!",
            "Glad you're feeling better!",
            "Should have got him to buy you one of these:\n\nhttps://youtu.be/d98FHmKnxsM",
            "Lost my voice once while working an old job, I still felt fine otherwise so I said I can work as long as they keep me off talking to anyone. Boss kept trying to put me into posts where I would have been required to talk to customers...like...really?",
            "\"Sick days\" is such a dystopian concept.",
            "\\>   I kept getting really bad ear infections in my ears. \n\nI would hope so - would be worried if you got ear infections in your foot!\n\nSeriously, glad you're doing better. I got river water in my ear when I was 8, got a terrible infection that was incredibly painful. Then one morning I woke up, feeling much better - and there was a huge ugly stain on my pillow from where the ear had drained. Ugh! Still, better out than in :-)",
            "This is the absolute best!!! 🤣 I love love love it",
            "The sheer stupidity of your bosses enflames my hatred of the human race.",
            "...: ) \n\n...also, bummer about the pain - hope you get and stay better",
            "Fuck those guys. My uncle and a friend of mine are both partially deaf and if I ever saw them being treated like that i'd be swinging. The fact they don't teach any form of sign in schools is a disgrace. I taught my daughter to sign 'hello my name is (name)' before she started school incase any kids in her class were deaf and felt isolated. Turns out, a boy in her class is particularly deaf. I'm sorry you were treated like this.",
            "A sick day maximum? What kind of third world do you live in?"
        ]
    },
    {
        "post_id": "xhrq3o",
        "author": "big-heck-nah",
        "title": "You want me to coerce an inspector after someone else did the work?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/xhrq3o/you_want_me_to_coerce_an_inspector_after_someone/",
        "score": 14931,
        "num_comments": 344,
        "created_utc": 1663534295.0,
        "selftext": "This happened years ago. I had just started working as an independent electrician, and one day I received a call from a new customer. He was one of those people that flips homes in lower income neighborhoods. I’ll call him Todd, but honestly, I’ve forgotten what his name is. Todd asked me to meet him at a vacant house he recently bought to give him an estimate for a full rewiring job. He was 30 minutes late, so I was already unimpressed with him. \n\nUpon entering the house, which was right after a rain storm had passed through, we found an inch of water covering the hardwood floors. There was water pouring out of small holes in the columns on the front porch. Everything was soaked. Instead of showing me around, Todd called his business partner and brother and spent the next 20 minutes cussing him for not fixing the roof. \n\nI’m standing around and listening to his man-baby rage on full display. The whole time I’m thinking there’s no way I’m going to work for this guy. His fuse was way too short and his anger was out of hand. I gave him a price, which admittedly was the “I don’t want to do this job price”, and didn’t hear back from him. Until months later…\n\nTodd called me later that year. He explained that he had found an electrician from three states away, and had paid the electrician with ceramic tiles instead of cash. The problem now? Well, he needed an inspection from the city electrical inspector. I agreed to meet the inspector for him, which I would bill him for. \n\nI went back to the house about twenty minutes before the inspector showed up and saw numerous issues. When the inspector arrived, we walked through together. Every issue I saw, the inspector also saw. He pointed them out, and every time, I agreed with him that the work was not up to code. This inspector kept looking at me with a puzzled expression. After we did a complete walk through I finally explained to the inspector that I didn’t do any of the work and was hired to get him to pass the inspection. He asked me if I thought he should and I told him “absolutely not”. I got paid for my time, I got paid to repair all the violations, and I formed a strong relationship with that inspector, who was always lenient with me on all my future jobs.",
        "permalink": "/r/MaliciousCompliance/comments/xhrq3o/you_want_me_to_coerce_an_inspector_after_someone/",
        "comments": [
            "Ethics: priceless.",
            "Electrician here. Sometimes my potential customers think my prices are too high. That's completely understandable. You should always shop around. But if you get someone unqualified to do the work, it will cost a lot more for me to come back and fix it.",
            ">I formed a strong relationship with that inspector, who was always lenient with me on all my future jobs.\n\nMy first thought is that I hope you mean he bent the rules, but refused to break the rules. Faulty electrical work isn't something to overlook. \n\nNice malicious compliance. Why did the owner have you meet the inspector? Was he trying to pass off the work as your work? Is having a licensed electrician present a requirement?\n\n*Sorry for all the questions. I'm not sure what's going on with that, LOL.*",
            "Similar thing happened to me last month. \n\nMy father was also an electrician. I started as an under him in 2006. I've since become licensed, he passed 4 years ago and I formed an LLC and hired an employee. \n\nI got a call from a builder who is sort of a friend of the family. Turns out said builder did an addition/remodel in the mid 90s (I was in middle school/high school) and my father wired it. No permits were pulled by any trade or builder. Fast forward 30 ish years and potential buyers of the house are asking why the addition wasn't permitted. The builder calls me, asks me to pull a retroactive permit and get it inspected. I laughed and said no. It's not that I don't trust my father's work but it never occurred to the builder that I would be held liable for everything that's been done for the past 30 years. Ummmm no thanks.",
            "thank you for not trying to encourage them to pass it anyway, thats literally how people die, ya know?\n\nMy house is like that. Can't use half the outlets or else it'll start an electrical fire. Not even kidding, three walls have scorch marks (and now, removed outlets) from it. Because they didn't prepare the internal walls properly, its almost impossible to re-run electricity to the entire top floor except for one spot, which we already replaced. Its honestly scary, and we can't even afford to get it fixed professionally so we just do what we can, when we can...",
            ">I got paid to repair all the violations, and I formed a strong relationship with that inspector, who was always lenient with me on all my future jobs.\n\nWhen I used to work at McDonald's we had that kind of relationship with the health inspector. Nicest lady who didn't nitpick. She knew we followed the cleaning procedures and checking temps and everything so she never made it a stressful time. \n\nShe would laugh with us at stupid customers who called us in. There was that one guy who tried to temp his own burger and called in because it \"failed\" his test. This idiot didn't ask for it plain or fresh or anything so you got a burger that was sitting in the warmer, had cool pickles, ketchup, mustard and onions and a cool piece of cheese on it.... and he thought it would temp like it was fresh. Dude if you're still out there and read this... you're a laughing stock of McDonald's and the health department and you wasted their time because she checked it properly and was like \"oh it tempted correctly just like the last time I was here.... shocker\".",
            "I recently paid nearly $2,000 to have the gas piping into my house replaced. Plumbers said \"this is what we'll have to fix so the inspection goes smoothly.  It'll cost x\"\n\nInspection was flawless. He walked in, looked at the furnace, looked at the stove, looked at the water heater and said \"looks great. These guys do good work. I'll release it back to the gas company\"\n\nHaving a good relationship with the inspector is key.",
            "Inspectors love honesty!",
            "I mean I'd rip my brothers head off on the phone too if he was in charge of fixing the roof and there was a foot of water in the house.",
            "Did a retrofit install of a wired security system into the local electrical inspector’s house. He was very impressed that ALL the wiring was hidden (he was expecting potential surface runs or fixing holes in the drywall) and years later when I was on my own, he happened to inspected one unit I prewired, was impressed with the quality and methods I employed and he never once pulled my jobs for inspection in 15 years. I didn’t break the rules (it was to MY benefit) and if he was ever inspecting an electrical prewire in a unit I did low voltage in, he’d rubber stamp my permit too. Mainly to show more work done on his part, but we ran into each other often and he’d tell me I was the absolute last contractor he would inspect if there was anything else on his plate, which there always was. I think he liked that I’d rather talk about anything other than work. Stay friendly with your inspectors and if you’re a good contractor, your jobs will be better for it.",
            "Great compliance. And as someone who’s had a good friend die in a fire caused by a corner-cutting “electrician”, thanks for being one of the (many) good ones.",
            ">and had paid the electrician with ceramic tiles instead of cash\n\nWut?!  I'm sure his business liability insurer accepted ceramic tiles instead of cash, too. Lol.  Also, was this the rough-in or the final inspection?",
            "I was a janitor at a school that had a large colony of bats. It's illegal to hurt them unless they are attacking, so I would catch what I could and release them outside. It was never ending. You could hear them in the walls of the classrooms and see them flying and hanging in the gym. A parent reported us to the Health Dept. When he showed up for a surprise inspection, my boss was out sick and there was literally no one in the office. I told him I'm the one that handles the bats so I showed him around. We got shut down the last week of school. My boss said I should've played dumb. Not a chance! Literally every job in this town has to deal with the health inspector. If I got in trouble let for lying to them, I'd never work.",
            "I always get annoyed when I go to McDonald's, and their credit card machines are down and they are only accepting ceramic tiles.",
            "Never piss off an inspector. He will do a VERY thorough inspection of your work.",
            "As an inspector I will always go above and beyond to help a contractor pass inspection as long as they don’t insult me with trying to pass horrendous work.",
            "I got in a huge rift with my boss over him asking me to falsify my expense report for a trip.  I had receipts for everything and he was bitching about the cost and telling me to put in a lower amount and not receipt it and he would sign off on it.  Funny he did not want to just decline over some amount..  We went back and forth and he refused to believe that putting down a number that was not correct to the best of my knowledge, was falsifying the report.  I had receipts for everything.  He was trying to gain brownie points because he knew damn well that the company would sign off on it without flinching.  That was another time I had to get HR involved and he learned the hard way he could question or not approve a charge, but it you had receipts that was the amount you turned in, and if he denied something he had to say why, and he could be overruled.",
            "I wonder if you’re from my northern-Midwestern City known for water & winter because Todd sounds like this guy I used to work with on my flipping projects 🥲",
            ">His fuse was way too short\n\nNo wonder he needed an electrician.",
            "You sound like the kind of professional that never really  needs leniency.",
            "I have found that authorities are one of two kinds of people. Either they're idiots that can't be reasonable, or they have some common sense and you can earn their respect. \n\nThis guy was one if the good ones, and it seems like OP got on their good side and was able to get some things done because of that relationship.",
            "Good rule of thumb on hiring contractors, be they electrical, plumbing, HVAC, or even carpentry: Hire licensed professionals locally. Why? They are the ones that are familiar with local codes. I recall a slumlord that hired a guy from about 3 counties over to install a furnace. Thank god the family that rented the house had bought a Carbon Monoxide Detector. Three days after the guy left, the detector went off. They called fire marshal, he came in, then had code enforcement come in and the slumlord was written up. The contractor? Long gone with the money. Slumlord had to pay a local, licensed professional, cost him an extra $4K from what the fly by night guy charged, and the furnace that was put in was defective so had to replace that. Saving money cost his a ton of money.",
            "\"Paid in ceramic tiles\" is one of those \"oh, this is gonna be good\" moments.  :)",
            "Priceless:  as a Comm Dev Director in charge of inspectors, I appreciate your honesty!  I would go to the ends of the earth to work with anyone who approaches things ethically and honestly.  I’ve had inspectors in the past who have accepted payouts to pass inspections that shouldn’t be passed or curry favor and I have always fired them and then prosecuted them.  Really appreciate you doing the right thing!  The bad apples are really few and far between but they taint the whole industry.",
            "I love this. Fuck that landlord. Literally trying to rent out places that could kill people. Absolutely disgusting.",
            "His fuse was way to short for you, an electrician, eh?",
            "> He was one of those people that flips homes in lower income neighborhoods.\n\nSay less. \n\nTodd is a piece of shit. Don't be like Todd.",
            "Awesome!",
            "Sound like todd still got a decent deal.  Some tile and a few hours from you.",
            "I don’t see the part where he was trying to get you to help him pass inspection? Just sounds like he couldn’t be there and wanted an electrician to be there while the inspector was there. Just seems like a normal shitty investor to me.",
            "Just curious. What kind of leniency is OK?",
            "Why do you need the inspector to be lenient with you if you are doing work to a certain code?",
            "Damned fine work there.",
            ">Every issue I saw, the inspector also saw.\n\nDon't know about where you are but a lot of inspectors I've dealt with were Tradies themselves. Only problems I've ever had was where they didnt like my math on some really technical stuff (An explosion proof installation).",
            "> The whole time I’m thinking there’s no way I’m going to work for this guy\n\n&nbsp;\n> I got paid to repair all the violations\n\n&nbsp;\n\nThese 2 statements do not seem to be compatible.",
            "Where is the malice? You did everything right, anything else would have harmed Todd, too.",
            "good working relationship, he was impressed with your honesty",
            "I want to know if you charged this distinguished gentleman for the half hour he was late",
            "I'd rather be friends with the inspector than the person who hires me because it's a dog eat dog world out there and I don't want to be the one wearing milk-bone underwear.... besides I want to go to sleep at night with a clear conscience ....",
            "Good story, and well-written. But this bothers me more than it should: \"coerce\" means \"force\", whether it be by physical means or something unethical such as blackmail or threats. I'm sure you weren't hired to strongarm the inspector; you may have been hired to bamboozle, flim-flam, or mislead him, or some other similar term that implies simple deception.",
            "I don't think he was lenient with your future projects",
            "Do you know what coerce means?",
            "wait. how lenient?",
            "I get that Todd wanted OP to both claim the work and get the inspector to sign off, I don't see anything malicious here.",
            "interesting.",
            "Yup your pint of blood on the line for any electric issues.  Never mind if a death.",
            ">I formed a strong relationship with that inspector, who was always lenient with me on all my future jobs.\n\nI don't think that makes you look any better in this story.",
            "Nice right up until you ruined it at the end. Lenient inspectors kill people.",
            "So if he was lenient with you in the future, I'm assuming he allowed you to cut corners just as this man was trying to get you to do from the get-go correct? From McDonald's to an electrician huh? It seems that you still have the same mindset as if you're working in fast food and although there's nothing wrong with trying to develop a rapport with an expector that can play hardball from time to time, this story made you sound like a straight up kiss ass and you had every intention on basically stealing this man's money without providing any sort of quality service that he could benefit from in any way shape or form in return...\n\nEveryone hates inspectors because not only are most way over the top but a lot of them don't even have half of an idea as to what they're doing anyways because we all know that one will say one thing, and another will say something completely different and most would describe a relationship with them as keeping your friends close, and your enemies closer.\n\nEveryone wants their home wired correctly by a qualified electrician but you basically did the same exact thing this man was attempting to do in the first place and even if this reply gets quite a bit of backlash, I can almost guarantee that there's others that feel the same exact way I do. 🤷",
            "aaaaa",
            "So you took a failure on your license for what?\n\nYou can’t get an inspector out unless a permit is pulled. That went against you Bro. \n\nStory seems FOS to me",
            "He should’ve gotten Pudgy Walsh on the horn to take care of things",
            "Quality work...",
            "Why would he pay someone in ceramic tiles?",
            "Did the right thing",
            "“Fixed seconds (“) to the appropriate minutes (‘)”\n\nNow it looks like you’re 25 feet away.",
            "This sounds like the house in currently renting... Like scary accurate down to the landlord, maintenance guy, and questionable electric.",
            "The customer still got ripped off. If there was no intention to help him pass, then why take his money?"
        ]
    },
    {
        "post_id": "svjsdb",
        "author": "DuckDownRob",
        "title": "1,400 Packages of Cookies: I Broke a Rewards Program",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/svjsdb/1400_packages_of_cookies_i_broke_a_rewards_program/",
        "score": 14885,
        "num_comments": 710,
        "created_utc": 1645195950.0,
        "selftext": "The Year was 2000 in Canada. One if the better grocery store chains Loblaws, had introduced their new President’s Choice PC Points Reward Program. This was tied into their PC Financial MasterCard.\n\nThere was a month-long promotion where you could get bonus points for purchasing select items.\n\nOne of the items was their signature President’s Choice Decadent Chocolate Chip Cookies. These are amazing cookies that are still around today.\n\n**The offer was:** For every bag of cookies purchased for the regular price of $1.99, you got 1,000 PC points when you used your PC Financial MasterCard. That 1,000 PC points was worth $1 for a later redemption.\n\nBuying a package of great cookies for half price after reward value would not make for a good Malicious Compliance story now would it…\n\nI figured something out and started some major malicious compliance with their offer.\n\nI started by going from store to store and buying every bag of cookies I could find. I even asked if they had cases in the back. From one store, I was able to get 8 cases. I ended up getting 1,400 packages of cookies over a 3-week period before the program broke.\n\nHaving 1,400 packages of cookies created a problem. What was I going to do with all those cookies I bought for $1.99? At the time, I was a field sales rep for a company with 4 factories in the province. I ended up selling most of the cookies for $1 a package to the employees. They thought it was a great deal and could not get enough.\n\n**On to the points:**\n\nEvery couple of days the bonus points would show up in my PC Points account. I realized I could take my PC Points and convert them online from PC Points to Petro Points (Petro Canada gas station rewards program). Once I had 100,000 PC points, I would convert to 100,000 Petro Points.\n\nI would then go online into my Petro Points account and convert those points to Sears Club Points (Sears was a department store that is now gone). Eventually I would redeem the Sears Club points for vouchers that could be used for in store purchases at Sears.\n\n**The Break:**\n\nAfter converting 1,400,000 PC Financial points to Petro Points over a couple of weeks, Petro Canada caught on and immediately stopped all conversions to Sears for everyone. No more points could be converted. It even was marked as not available on their website. I called Petro Points when I found out and after a little discussion regarding the sudden end of the conversions, was allowed one final conversion.\n\n**The Math:**\n\n1 Package of cookies cost $1.99. I sold the package of cookies for $1.\n\nEarned $1 in PC Points.\n\nExchanged that $1 in PC points to $1 in Petro Points.\n\nExchanged the $1 in Petro Points to $5 in Sears Club Points.\n\n\\*\\*Edited. Messed up the math. It was $1,400 net investment not $700\\*\\* For a net investment of **$1,400** (after selling the cookies), and transferring 1,400,000 in points among programs, I ended up with $7,000 in Sears Club Vouchers that I used on sale and clearance items at Sears.\n\n&#x200B;\n\nIt was a fun 3 weeks while it lasted.\n\n&#x200B;\n\n&#x200B;\n\nTL;DR Grocery Store had a points bonus, did a number of transfers to get 5x+ in value. Broke a program affiliation in the process.",
        "permalink": "/r/MaliciousCompliance/comments/svjsdb/1400_packages_of_cookies_i_broke_a_rewards_program/",
        "comments": [
            "So... basically what you're saying is you were the one that started the decline of sears",
            "Similar story (not mine): You used to be able to order commemorative coins, silver dollars, state quarters, etc. from the US Mint at close to face value with free shipping. Legally, they're still considered currency. So the plan went like this:\n\n1. Buy $1000 worth of quarters on a credit card, have them shipped to your house for free\n2. Get $1000 worth of rewards points or airline miles or whatever\n3. Deposit the quarters in the bank (they're still quarters)\n4. Pay off the credit card\n5. Repeat\n\nPeople racked up millions of free points before they closed the loophole (shipping isn't free and coins aren't sold at face value anymore).",
            "You performed arbitrage using cookies. Don't let the Girl Scouts find out.",
            "Nice. This reminds me of when I was a 20 something in Canada and took advantage of both the 20x Optimum earning weekends and weekends where your points were with 10x on redemption. Basically bought all my houehold cleaning supplies (paper towels, toilet paper, Lysol wipes, 409)cleaners in bulk (to hit the $75 minimum to get the 20x points) and then until the redemption promotion and got a Nexus 7 tablet (which retailed for around $300 cad at the time) there might have been a P&G manufacturer rebate/promotion thrown in there too.\n\nIronic because now Loblaws owns SDM",
            "Sounds like the stuff those extreme couponing people do",
            "You might like the story of the man who purchased [enough pudding cups to earn a lifetime of frequent flyer miles](https://www.snopes.com/fact-check/pudding-on-the-ritz/) and also gained a tax deduction by donating all the pudding to food banks.",
            "I miss Sears. They were always fun to run around in, kept cleaner than any Walmart ever, and had just about everything you would actually need (got my ex-wife's engagement ring there)",
            "And people wonder why Sears went out of business.  It's all this guy's fault!  \n\nLOL. j/k\n\n**Side note:** A tale from my hometown about what the owner of Sears and K-mart is up to now.  So as many folks know, it was bought up by some guy who just basically crashed it while saying he's trying to save it.  Some wonder if he was secretly shorting it or not, but who knows.  Anyway, this giant K-mart on a very prominent Boulevard in my area has been vacant for quite some time.  The property is owned by a local big name car dealer and several people have approached him about what he's going to do with this eyesore.  He has now had to come on the news to say that K-mart's parent company intends to continue to pay the rent on the vacant space in perpetuity unless said car dealer buys them out of their lease for millions of dollars.  \n\nThey are also duplicating this strategy across the country, in case you're wondering how long your former Sears or K-mart is going to sit vacant.",
            "Pepsi had a promotion with Rock Band.  Get a song for the game.  On Switch they didn’t have a way to redeem for a specific song.  Gave you 200 wii points, enough to buy the song in app, so to speak.  I emptied the bottle redemption machines at night.  I got $1,660 worth of wii points over the course of the promotion.  Every game on WiiWare or virtual console I wanted, a lot I never even opened.",
            "Not as good as some of these, but my experience:\n\nBack when Service Merchandise was still in business, I went just before New Years to get something. On the way to the registers they had a table full of Christmas clearance (mostly cards, wrap, and such) marked 75% off. $10 box of cards for $2.50, for example. I grab a box of cards, go to pay for my things, and the cashier took 75% off… of the $2.50. So now I have what was a $10 box of cards… for 62 cents. I very calmly went and put my stuff in my car… then went back in and Cleared. Them. Out. It’s been over 25 years now and I’ve never had to worry about buying Christmas cards. 😁 (three copier paper boxes full of boxed Christmas cards)",
            "Now I want those cookies...",
            "Bob Loblaw.",
            "We did something sort of similar, except there wasn't a net profit.  We just abused a rewards system.  This was around 2006 so details are a little fuzzy but mostly accurate.\n\nAt the stime we were resellers for a very well known \"Office\" software product line, which also had many, many other software products.  A customer of ours wanted to buy about $250,000 worth of various licenses because they were expanding greatly.  (If this seems like an impossibly high number you are not familiar with corporate license agreements for enterprise software.  Companies spent millions in licenses every year for tons of different things)\n\nWe didn't really make much margin off the sale, but as resellers we had to actually buy the licenses at list price minus our reseller discount.  We then invoiced the customer.  That all worked fine - we got paid on time, etc.\n\nTo actually buy the licenses we were able to use our (I think Amex?) corporate card.  So we charged something like $240,000 on the card, at a time they were having a promo where you'd get a $20 Home Depot gift card for every $3000 you spent.  \n\nWe finalged it somehow so we ended up with 160 $10 Home Depot gift cards, which were delivered right before a big convention.\n\nAt the convention we had a sign that basically said \"Sit through our 10 minute presentation and get a $10 Home Depot Gift Card\".  We had a pretty solid line of people while most of the other booths were quiet. Good times :)",
            "You should watch Punch Drunk Love. It's got a sub plot that you may have inspired.",
            "I bow to your greatness.",
            "Good story about gaming a system, but there’s no malicious compliance",
            "Good story. Not malicious compliance",
            "\"Sears was a department store which is now gone.\" Don't make me feel old, dude. I remember going into Sears. Once or twice. And then forgetting about it because it was about the most forgettable department store ever. I'm not surprised it died.",
            "This belongs on r/unethicallifehacks. This might be malicious, but I don't see the compliance.",
            "\"No purchase necessary, enter as often as you want\" - so I am. This batch makes it one million six hundred and fifty thousand. I should win thirty-two point six percent of the prizes, including the car.",
            "Your math/story doesn't make sense to me.\n\nIf you bought 1400 packages at $1.99 you spent $2786. Miraculously sold ALL of those for $1, you make back $1400. At this point you've still spent $1386. But add in the points program and you've made that back plus $14.\n\nBut then, and I can't verify the points exchange rate, but you state that $1.00 worth of points at Place A is equal to $5.00 of Place B? That seems super far-fetched to me.\n\nIdk, maybe I just misunderstood something...",
            "This isn’t really malicious (unless you had a vendetta against one of these companies) and only vaguely compliance since it’s not like they said you had to do this, just that you could. It was a great story, but there’s probably a better sub for it",
            "Not really malicious compliance IMO, more exploiting a loophole for profit.",
            "Definitely interesting achievement.  But the math seems off.\n\n\"For a net investment of $700\" seems to me should be $1400 (99 cents times 1400 packages if you will forgive me rounding .99 to $1.00.  Also, does not account for taxes.",
            "This is what's known as arbitrage, and companies are fast to identify and plug these holes.",
            "This isn't malicious compliance; it's maliclous selfishness that ruined a good thing for others!",
            "Please tell the CEO of Loblaws name is Bob Loblaw.",
            ">(Sears was a department store that is now gone)\n\nI consider myself a young person, but the fact you had to mention that makes me seriously question myself.",
            "Tina Turner did a UK tour in 1996.  She was performing at Murrayfield Rugby Stadium, Edinburgh, which is just a short walk away from our home.\n\nCadbury's Chocolate must have been one of the sponsors and were doing some sort of promotion whereby you had to buy so many bars of their chocolate to get a free ticket.\n\nRather than buying the requisite number of chocolate bars at shop prices, we managed to buy a couple of retail boxes of chocolate bars (I think it was Wispas) from a local cash and carry.\n\nWe unwrapped the lot, sent the labels away in exchange for the two free concert tickets and sickened ourselves eating chocolate bars for the next few months!",
            "Their is no chance you sold 1400 boxes of cookies",
            "How is this malicious compliance? This is just you taking advantage of a system.",
            "At a store called Price Chopper in my town, my grandmother bought a few cans of Alphaghetti when I was young and we realized if you peeled off the label, there was a buy one get one coupon. So she brought in all the like 10 labels, and got 10 more cans… with more labels. So she went to the parking lot and ripped off those labels and went back in. She did this until they physically started ripping them off at the point of sale. She then sent in her partner. This continued for about an hour and we left with like 100 cans of alphaghetti for an initial like 10 bucks. They later went out of business. I like to think that she played a small part in that",
            "There's a popular pharmacy store that has a bucks rewards program. My family's account is connected to my email, so I usually get first dibs on all the reward cash. We had $5 in rewards so I decided to shop beauty sales. At the time a few brands had great deals, like spend $10, get $5 rewards. The key thing is that you can use that reward to count towards spending totals on additional deals.\n\nSo I used the $5 reward plus around $5 cash, and I got $5 more in rewards. I then spent that reward plus $5 on another brand deal. Spending $10 cash got me enough reward bucks ($10) to pay for *another* $10 purchase for $5 rewards. I did this over and over, using free money to get more free money, checking out then going right back to shop. The cashier thought I was nuts.\n\n I was able to spend around $40 cash and got almost $250 pre-sale value worth of stuff. I felt high when I got home lmao \n\nI almost hope they fixed that because I can see it being endlessly taken advantage of if one has enough time to plan their purchases well",
            "So basically you fucked the program for everyone else. You have thousands of half price cookies and everyone else can just wonder why there isn't a reward program or points conversion option anymore.",
            "No malicious compliance here. Yes you made out like a bandit  but you screwed everyone else in the process. Not cool.",
            "I think if I actually see a story of malicious compliance in this sub this month, I might have a heart attack.",
            "this isn't compliance at all. they didn't ask you to do anything. this is just you ripping off a broken system. kudos for that, but it doesn't belong here.",
            "Poorly written, you only said the value was more for Sears in the end calculations",
            "Fun fact Sears isn’t gone! I thought they were too but I saw one in rural Arkansas that was still open.",
            "If you bought 1,400 packs at 1.99 each and sold them for $1 then your initial investment was $1,400 not $700",
            "This isnt malicious compliance...",
            ">(Sears was a department store that is now gone)\n\n*Cries in old*",
            "Sounds like a Spiffin Brit video",
            "In a Jack Sparrow voice: “You need to find yourself a girl mate.”",
            "So *you're* the reason Sears went backrupt! 😅",
            ">Sears was a department store that is now gone\n\nHold on, you had to explain what Sears was? How old we must be 😭😭😭",
            "Pc points didn’t exist until 2013. \n\nSource: I worked at the company at head office",
            "cool story but how is this malicious compliance at all?",
            "So, a cookie company thinks up a promotional idea to increase their sales and give everyone a good deal on delicious cookies. You spot a way to game the rules of that promotion in order to ruin it for everybody in order while lining your own pockets. This shouldn't be in \"Malicious Compliance.\" This should be posted in malicious conning.",
            "Sounds less like malicious compliance and more like you're a scammer.",
            "So you murdered sears. Finally, answers after all these years",
            "Cool story, although I don't really see any malicious compliance",
            "I remember hearing about a guy who learned that the AirMiles deal that week was for cat food - buy a dozen cans, get 100 bonus miles (or something like that).  He bought all that he could, even phoning stores and asking if they’d let him buy cases of the stuff.  He got thousands of AirMiles that he was able to turn into free merchandise later.  He then donated all of the food to pet shelters and got a really nice tax receipt.\n\nThat’s one of my favourite stories about milking the system.  No one got hurt, everyone benefited, and - best of all - kitties got full tummies.",
            "This is why we can’t have nice things.",
            "What makes this malicious?",
            "reminds me of the pudding guy from punch drunk love",
            "I like the PC Points Program.  They even let you double-dip.  Sometimes they offer points for buying something, but also offer point for a volume purchase.  For instance, get 600 points for every $3 you spend on ThingThatCouldBeOnSaleAlready.  Also get 10,000 points when you spend $100.  You can collect on both.",
            "TIL one Canadian broke Sears, a store that now no longer exists, and was around for hundreds of years before this one cool trick.\n\nI'm laughing but also sad about Sears. No need to explode my inbox explaining how OP did not actually put them out of business with this one cool trick thanks.",
            "The Alberta high school curriculum includes a class called 'Career and Life Management (CALM)', designed to teach life skills. I imagine most if not all provinces have something similar. I bet we could turn the average Canadian into a financial whizz if we replaced whatever hypothetical examples they use in the budgeting portion of the course with the PC Optimum program:\n\n***Old:*** \"Manny wants to buy a television. X Brand sells blah-blah-blah...\"\n\n***New:*** \"Sara notices a sale at Shoppers Drug Mart: Clinique products are 50% off but Clarins products come with a bonus of 20,000 Optimum points...\"\n\nWe'll be ruling this puny planet's economy within a generation!",
            "This is high level thinking.",
            "Used to be able to get those President Choice Decadent chocolate chip cookies at wal mart in the states in the 90’s, they were the best store bought cookies ever.",
            "Yeah, I agree with others on here. Good story. Am sure there's a better sub for it. Not quite malicious compliance. Happy you got Sears items.",
            "I love this, but this is not malicious compliance.",
            "You're Adam Sandler in Punch Drunk Love!",
            "Sometimes i wonder if im cheap to be so mindful of the offers But then i read your post and it gave me more motivation 😂😂 kudos to you Sir/Ma’am",
            "That grocery chain must hire the law offices of Bob Loblaw",
            "Where's the malaciosuness?   I mean, this was clever and all, but it wasn't that mean.",
            "I still make use of ridiculous PC Point deals to this day. I purchase $300 worth of medical supplies each month. I wait for a 20x points promo, and I get 30% back in points. Makes the medical costs sting a lot less :)",
            "Similar story when I worked for the Speedway chain of gas stations in the Midwest US. I was a broke, poor boy living with 2 roommates on minimum wage, and I got hungry with only a couple of bucks left before payday a few days later.   \n\n\nEnter the Butterfinger candy bars. At the time, they had a buy two for $1 thing going on and a rep had dropped $1.00 off coupons around the same time. There was also a Speedway Speedy card (their rewards program) promotion for 200 bonus points for the purchase of two regular size candy bars.   \n\n\nThis brought the price down to 0.00, but still had to pay the sales tax, so it was a total of $0.07.   \n\n\nI spent 4 bucks on candy bars, wracked up a ton a points, redeemed them for gift cards, and was able to survive a bit more comfortably using the gift cards for an actual lunch.",
            "The chronology of this is super weird.\n\nFirst: I bought a shit ton of cookies for the hell of it without realizing the implications!\n\nSecond: It dawned on me that I could profit from that ridiculous action!",
            "So basically you took advantage of a $5 per $1 transfer rate, and waited until right at the end to explain that point.\n\n\"Oh did I not mention the key point that ties it together? I'll just put that right at the end.\"",
            "Usually when you convert points from one program to another you actually lose value. I'm a little curious as to why Sears would allow a $5 reward for you spending only $1 of petro points.\n\nMaybe you're the reason Sears went bankrupt 😂",
            "I can't believe that you tossed your cookies so easily.",
            "It hurt me that you had to explain what Sears was. Am I so old, people don't remember Sears?!",
            "Excellent use of MC (especially because even though I shop at Loblaws I hate that we have so little choice between two huge grocery companies)! But those PC cookies are no joke-my brother lives in the states and we are expected to ship down cookies for my sister-in-law every holiday and bring them every time we visit! It makes for an awkward conversation at the border (they understood we weren't going to resell them thankfully! LOL).",
            "I find the funniest thing about this is that you had to describe Sears as a department store that went out of business lol\nI'm not even that old but this made me feel old",
            "Not exactly the same thing, but who else remembers that time pepsi ran a pepsi points promotion and had an ad showing you could get a fighter jet for 7 million pepsi points, and someone actually tried to go for it?",
            "Up until the „converted 1$ petro pts to 5(!)$ Sears pts“ it was really a story about converting irl money into questionable bonus points 1:1\n\nSurprised about that 1:5 conversion with Sears though, does not seem well thought-through on their end\n\nAnyways. Good for you.",
            "In what world did Petro Canada and Sears think a 1:5 conversion rate was equitable?",
            "Dude you're one of those people that site designers and corporate think heads have nightmares about.",
            "For the sake of clarity, maybe add in to the “On to the points” section that the Sears points were worth 5 times as much. I was thinking “so, you broke even?” Until I re-read the math section where it was a side note that the most important part of the story was that the points were 5X the value. \n\nAlso, what did you end up getting at Sears with your profit?",
            "Now we know what happened to Sears.",
            "'Better' and 'Loblaws' are not words that belong in the same sentence. **Fuck the Westons.** They're oligarchs fighting tooth and nail to keep wages low, they have caused Canada to have some of the highest grocery prices in the world by price-fixing, and they have criminally tax evaded over $1b in taxes.\n\nI'm very glad you cost them a few grand, OP. Horrible people.",
            "Isn’t this just couponing or credit rewards? How were you forced to comply?",
            "Choc chip cookies outlasted Sears.",
            "Those cookies were so delicious! I used to get them at Jewel-Osco when I lived in Chicago.",
            "No wonder I couldn't find any of those cookies. Damn you, damn you all to hell. :D",
            "> Sears was a department store that is now gone\n\nSears didn't close that long ago that this note is really required.",
            "Tl;dr - obviously a story about a web browser where they have to clear their cookies to free up cash.   \n;)   \n\n*[Joking]*",
            "How is this MC?",
            "I bow to you in honor.",
            "I bow down to your savvy here.  I can only hope to one day be half as knowledgeable with points as you were at that time.  I take my hat off and bow to you.",
            "Damn! Those cookies are da bomb. I wish they could come south of the border but Loblaws is Canadian owned and Operated and this snowbird misses those cookies.",
            "I just can't read these anymore as I listen to rslashed on YouTube at work where I don't have time to read Reddit and if I read a story 9 times out of 10 he reads it in his latest video so I don't like to ruin the outcome.",
            "I see the malicious part, but where's the compliance?",
            "Die you buy Cookies with the points?",
            "Damn how long have I been out of the loop that Sears is gone? 🤨",
            "Thats so cool\n\n/s",
            "You ate $700 worth of cookies?!",
            "So, you essentially paid the taxes of the cookies for a couple of thousands in credit for Sears. Well done.",
            "So youre the reason sear went out of bussiness",
            "this is the type of shit i like to read. Reminds me of when the gas station 76 in California was doing an energy drink promotion and i emptied the shelves and doubled my money easy by selling them to people. Good times.",
            "I like the reverse decedent cookies",
            "When you hit us with that “dept store that no longer exists” that hurts",
            "Brilliant.  What did you buy at Sears?",
            "That’s a lot of Toughskins jeans.",
            ">Better grocery stores\n\n>Loblaws\n\nDoes not compute.",
            "You should look into manufactured spending with credit cards.",
            "You had me until I realized you just managed to get $7,000 to spend at a closing Sears. Seems like a lot of work to shop there.",
            "Bob Loblaws?",
            "Best shopping story ever!!",
            "So you're the person my high school math problems were about",
            "All those cookies and you didn't get some of the reverse decadent???",
            "I thought you were ripping off a plot point from Punch Drunk Love. Great scheme!",
            "You put sears out of business!",
            "Isn’t there an app called Plastiq that lets you pay mortgage, car payments, etc with a credit card? Rack up credit card points",
            "Is loblaw’s owned by bob loblaw and his law blog?",
            "Punch Drunk Love",
            "I didn't make the rules, but I will exploit them.",
            "You are why we can’t have nice things. Department stores will never do that again.",
            "And this is why we can't have nice things.  :(",
            "Reminds me of tha Adam Sandler movie Punch Drunk Love...",
            "That’s good. Loblaws is evil."
        ]
    },
    {
        "post_id": "k360la",
        "author": "mcpux",
        "title": "Do. Not. Interrupt. Me.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/k360la/do_not_interrupt_me/",
        "score": 14887,
        "num_comments": 338,
        "created_utc": 1606638716.0,
        "selftext": "I was in my first semester of college working at my first full-time job. I was taking phone calls one day, when I received a phone call that went something like this:\n\nMe: “Hello, thank you for calling-“\n\nPerson: “Hello, I am calling to complain. Your office provided dentures for my grandmother and you charged her far too much for them!”\n\nMe: “I’m sorry about that, but this isn't...”\n\n“But nothing! How can you possibly treat an elderly person this way! You clearly took advantage of her and-“\n\n“Excuse me, if I can say something real quick-“\n\n“No! Do. Not. Interrupt. Me. I have something to say to you people! You should be ashamed of yourselves...”\n\nSo, I did as they asked. I didn't interrupt. This continued for a solid 45 minutes. They laid into me HARD. Very upset about the way that their grandmother was treated. They were fully justified, I might add. She was treated horribly and was clearly taken advantage of with her procedure.\n\nThey come to the end of their rant:\n\n“...I will be reporting your office for your behavior. What do you have to say for yourself?”\n\n“Well, I am terribly sorry for how your grandma was treated. That’s horrible and nobody should take advantage of the elderly that way. But I’m afraid you have the wrong number. That's what I was trying to tell you.”\n\n“...”\n\n“...”\n\n“...This isn’t \\[Dental Practice\\]?”\n\n“No. This is \\[Business\\]. We build websites for dental practices. \\[Dental Practice\\] is our client.”\n\nBig reveal: I was a tech support agent for a dental website company! Somehow, this person got our phone number from the practice’s website and, since they were deafened to rage, they wouldn’t listen when I tried to inform them. They apologized for wasting my time and wished me a good day. I thanked them for the apology, wished them an equally good day and had a very good laugh with my coworkers once they hung up.\n\nEdit: a lot of comments mention something to the effect of: \"Why didn't you just hang up?\" and to that I say:\n\n1. If I hung up, they were just going to call back again, but angrier\n2. It was very entertaining\n3. Since I knew they had a wrong number, I didn't really have to pay close attention to what they were saying, so I just kind of took a 45-minute break and browsed the internet\n4. At least I didn't have to talk to an actual angry customer for 45 minutes\n\nAnd for those who insinuate it was bad work ethic or a waste of company time to spend 45 minutes on a wrong number call... well, yeah. You're not wrong. Welcome to customer service. I also used to take smoke breaks just to get away from angry customer phone calls and emails. And I don't smoke.",
        "permalink": "/r/MaliciousCompliance/comments/k360la/do_not_interrupt_me/",
        "comments": [
            "During my apprenticeship as a paralegal I had such a caller who went on a rampage about the government controlling us etc, I had a headset on and just kept working my files and muted myself because I was relaying every funny thing to my co-workers. After like 30min he finally calmed down and I actually managed to help him (no, the court has not set a date yet).",
            "You just hung in there for 45 minutes, really??",
            "I worked for a screen printing business and had a Karen gripe at me about an order we didn’t do. Didn’t go on 45 minutes but it was quite satisfactory when I got the chance to tell her we didn’t get the low bid for the Little League that year, as we often did, so kindly get in her car and go to the place that did. I even gave her directions.",
            "My wife works phone support. All the time, she gets people that call and are angry because of <fill in issue, real or imagined> and demand to no longer be on the mailing list, then hang up. \n\nShe would gladly take them off the mailing list, but they don't give their name or address.",
            "During the time when the BP oil spill was going on in the Gulf of Mexico, a local company (in Maryland) called BP Consulting, who did not deal in the oil and gas business, was absolutely bombarded with crazies on the phone and social media. I felt so sorry for them.",
            "When this happened to me when I worked at a bank of america call center I would just mute them and take my headphones off. Then either browse around online or organize my desk as usually they were so loud you could hear them even without the headphones. As usually I agreed with them especially with how the bank sometimes treated them.",
            "Omg I kinda feel bad for that woman, but then again she should've at least given you a little time to speak 😂",
            "I know a guy (ahem) who worked an it call desk back in the day when they had to ask for passwords to view an account. Yes years ago. He was good with troublesome callers and could usually have someone calmed and resolved in a few minutes. Two times, however, the callers were so abusive he changed their passwords to something he didn't even know (hit multiple keys at the same time, no re-enter new pw back then) and then pretended to be disconnected. An account with an unknown password could not be fixed so second level reps would have to just set them up a new account with new email et al. That dial up internet service sold to a bigger firm years later.",
            "People saying it's bad work ethic? I hate that mentality. If you get a chance to chill out for a bit, take it. It's not going to sink the company if you have extended smoke breaks or waste a bit of time on a call. Nothing better than an unexpected break from working!",
            "I love getting wrong call angry people. Had one the other day.\n\n\"Before I start I must say I am furious and you will fix my problem today. Now my reference is 123456789.\"\n\n\"I'm sorry to hear that let me see what I can do, however that doesn't sound like one of our references. Can I take 'other detail that helps me find file' \"\n\n\"No, that is definitely your reference I have it here, 'reference number' for 'company that is definitely not us' \"\n\n\"Ah, that'll be it, you've rang X company\"\n\n\"You're not Y company?\"\n\n\"Sorry sir, completely different company\"\n\n\"Right\" \\*hangs up*\n\nPrick couldn't even apologise for getting shirty with someone he has no beef with, he tucked his tail between his legs and ran as soon as he realised he fucked up.",
            "Should probably have checked to make sure they were calling the right place lol",
            "Used to work in website support for a UK energy company and I would guess that twice a day I would deal with an email or call from a customer asking why they couldn't see their account online. \n\nAll ages, all types, from the \"you're the monkey put me through to a supervisor\" types to the elderly who were \"so sorry for bothering you\" types.\n\nWould check and find out they weren't even our customers so it'd be a fucking miracle if they could see their account on our website. \n\n50% of them would raise a complaint because it was our fault they couldn't work it out. I wouldn't mind because I had a template all written out that I would send them and my closed complaints stats were awesome. \n\nI would have 15 minutes as personal time after the calls due the emotional turmoil I felt /s",
            "I get calls like this often because I work for an energy saving company but people ring us up thinking we are their energy retailer. I have to try and cut them off before they waffle on.",
            "Over a decade ago I had a caller to the office where I worked IT.  As soon as he verified that he'd gotten IT, he was off to the races, talking a mile a minute, trying to sell me toner and printer services.  I tried to interject several times, but he just kept talking right over me.  Finally after a minute or two, I just hung up.  \n\n\nA minute later the phone rings.  The salesperson was like \"I think we got disconnected\"  \nMe: \"No I hung up on your stupid ass, because you wouldn't stop talking long enough for me to let you know you had the wrong department.  Don't  call us again.  \nAnd then I hung up on him again.",
            "Credit to the caller for accepting her mistake and apologizing for wasting your time.",
            "You missed a real world opportunity to say \"No, this is Patrick.\"",
            "r/idontworkherelady",
            "Yeah anyone saying that's bad work ethic has clearly never worked customer service in a call center. \n\nI was AD in the Marine corps for four years, I got out and went straight into a customer service role for two years and between the bullshit I was getting over the phone and the bullshit I had to deal with in the office I swore I'd never work on a call center again.",
            "I used to work for a university library.  A big part of my job was \"hiring triage\", going through all the applications for student employment, then passing the good ones on to the department supervisors.  In a typical summer, for fall semester hiring, I'd be going through 700 applications or more.  400 for spring semster.\n\nI also worked a 1600-0230hrs (4pm-2:30am) schedule.\n\nI came in one day to a message light on my phone.  Checked my email, then the voicemail.  First call was 0930 from a very angry mother, threatening my job and demanding I call her by \"Twelve o'clock!  I don't care about your schedule.  You call me by twelve o'clock!\" as to why her son hadn't been hired.  \"He has workstudy!  That means you have to give him a job and he wants to work in the library!\"  I mean, she's entirely wrong about what having workstudy means, but then again, she was just so wrong about life in general.\n\nNext message, 1000hrs, was her again.  Pissed I hadn't called her yet.\n\nNext message, 1025hrs, was my department head, looking for the file on this kid.  Apparently PsychoMom gave up waiting and went higher on the food chain.\n\nI looked up my info on the kid, took it with me to the boss's office, to ask her about PsychoMom, and to ask permission (knowing I wouldn't get anyway) to call her just before midnight, since she obviously wants an update and doesn't care about schedules.\n\nBoss vetoed the call, but let me know it wasn't needed.  Due to my records, they were able to pull up Junior's application, then give her a call to update her.\n\n*We didn't hire her kid because he hadn't returned our call or responded to any of our three messages about doing a phone interview.*",
            "Anyone who insinuates that you have bad work ethic by wasting 45 minutes for company time has never had a customer support/retail job.",
            "I say the place so I don't have any more calls like that....sucks when two businesses have the same number except for the last one...",
            "though perhaps unintentional, i suspect your giving her a space to vent helped in some way.",
            "Those who say you wasted company time have clearly never worked in the customer service field. You can't just hang up on them, because, like you said, they'll call back angrier, plus they would then have an actual reason to mad at your company. What people don't understand is that you need to let people talk sometimes, and when you do that, instead of trying to prove some sort of point, the problem works itself out.",
            "***2. It was very entertaining***\n\nYou have to take your entertainment when you find it.  good job.",
            "I've had that happen, but not for 45 minutes. SHEESH! That's a long time.",
            "\"dental website agency\"\n\nWow, there are so many jobs.",
            "I once worked at a law office whose main number used to be connected to a urologist's office - who performed vasectomies. Well, apparently vasectomies aren't always 100% effective, and sometimes the parts that are \"cut\" can even \"grow back.\"\n\nAbout once a month I had to take a call from an ANGRY, presumably pregnant partner (not always the wife) of an unsatisfied former client of a urologist who wasn't very good at his job....\n\nI would mute my side of the call, and put the \"unsatisfied client's wife/gf/side chick\" on speaker - for the entertainment of everyone in the office. It was my favorite call to take, and each one was better than the last. They wouldn't even realize that I was on mute and not responding. They just wanted to rant, and rant, and yell, and curse....and understandably so. But it was still hilarious. Imagine the rant of an angry, newly, albeit accidentally pregnant woman, who thought she had taken every measure necessary to avoid such a \"situation.\" They are VERY good at ranting.",
            "\"I'm sorry, ma'am, but this is a Wendy's.\"",
            "I do phone support and I have no problem letting someone ramble on; I'm paid by the hour not the call.  Sometimes the office phones don't fully hang up so the call is still live and I'll let those run on for 5-10 min just to get a break.\n\nMy dad had a worker that always went out with the smokers on their \"smoke breaks\" but didn't smoke.  Told my dad \"why should I be working when they aren't.\"",
            "Having worked tech support, I feel that last bit the most. It always irked me that only smokers were allowed breaks.\n\nIt was fairly common for non-smokers to just stand in the smoke pit holding an unlit cigarette just to get a much needed 5 minute break.",
            "I don't know that I'd have the patience for that.",
            "Back in the day I worked for a software company with a similar name to a package holiday company. About once a month we would get a phone call complaining about canceled flights and crappy hotels.",
            "Back in either 2001 or 2002 (I can't recall, unfortunately. Memory of that time period is disjointed courtesy of a cerebral aneurysm in 02) I was at home minding the phone and our web portal for our small business IT support company.\n\nWe got a call shouting that we hadn't delivered their new router yet. It took a good fifteen minutes for him to run out of steam before I could get a word in, just to let him know that we were a tech support company, not a retailer, manufacturer or a telco/cable provider. \n\nTurns out that in his blind rage, he decided that our business card was the card for the company rep he wanted to shout at.\n\nHe was profusely sorry for some of the rather vile things he had said over the phone and later became a pretty dedicated customer (he owns a car dealership chain in that part of Virginia).",
            "This was absolutely hilarious and to everyone whining about his work ethic, your jobs would fire you in a heartbeat over the stupidest thing I know this isn't /r/antiwork but stop being mindless work slaves lol",
            "To all the people saying this is bad work ethic :  \n\nboss makes a dollar,  \nI make a dime,  \nthat's why I poop on company time",
            "I can't believe how smoke breaks are still a thing. Just think about how much money goes down the drain just so that some people can satisfy their addiction. If a non smoker went outside for 5 every hour/ two hours and just stood there I would get written up, but as a smoker they are allowed",
            "I used to work for a car/taxi dispatch and one time a woman couldn't find her car in Manhattan. I asked to place her on hold to contact the driver, and she said no and kept complaining about how stupid we are, the driver is, etc. \n\nNow in her defense, we have some drivers that make me wonder how they got their license but in this case it was one of our best drivers so I believe him when he says he's there.\n\nShe rants for a good 20 minutes or so, asks me when the driver will be there. \"I have no idea ma'am since you wouldn't let me place you on hold to confirm with him.\"\n\nNow she lets me put her on hold. I called the driver, \"There's no one here but I see a lady down the block screaming, $5 says thats her.\"\n\n\"I TOLD YOU! IM AT FUCKING 46th AND.... \\*mumble\\* this is 47th? Fuck, oh there he is.\" \\*click\\*",
            "I was wondering what M. Night Shyamalan had been up too. Can I just say, this was way better than *The Village*",
            "Awwww hahaha it was probably cathartic for her to get all that out though",
            "Customer service is just the worst",
            "FWiW, op actually gave good customer service...",
            "I would’ve yelled “YOU HAVE THE WRONG NUMBER” during her rant.",
            "you have waaaaaaay too much patience",
            "Well you've got the compliance part down. Nothing really malicious about it though",
            "I hope you played Solitaire or something for those 45 minutes!\n\nI work for a site called Not Always Right and our readers really appreciate stories like these. Would it be okay with you if we shared your story on our site? Please let me know if that's cool?\n\nThanks again for the great story!",
            "Why would you stay on the phone that long? Story is either heavily exaggerated or a complete fabrication",
            "Why didn't you \n1) hang up\n2) keep interrupting her till she stopped, would have been more efficient than waiting 45mins",
            "Who sits and listens to a wrong caller for 45 minutes?",
            "Did this company happen to be in Temecula?",
            "I used to work for a superannuation company (superannuation is a government-mandated retirement savings scheme, and the company managed those accounts) and the contact number was one digit off of a particularly cheap internet service provider. As a result, around once a week I would get calls from disgruntled ISP users whose internet had stopped working.\n\nI don't know how they missed the signs that they were calling the wrong place - the automated recording says \"Thank you for calling [superannuation company]. To make a transaction to your superannuation account, press 1.\" They'd press 1 and sit on hold for 2 minutes of automated advertisements about our various superannuation products, and then they'd reach me.\n\nUsually the conversation was something along the lines of:\n\nMe - \"Thank you for calling [superannuation company], this is Chet_Awesomelad. How can I help you?\"\n\nCaller - \"Yeah my internet isn't working.\"\n\nMe - \"This isn't an internet company, this is a superannuation company. You must have the wrong number.\"\n\nCaller - \"Oh.\" \\*hangs up*\n\nThey never apologised. Sometimes they'd actually get mad when I told them it was the wrong number, and I'd hear them say something along the lines of \"Oh for fuck's sa-\" and then the line would disconnect.\n\nAnyway, there was one call where it went differently. The woman who called started launching into her complaint immediately, similar to your caller. I tried to interject, same as you, and she shouted me down. Eventually I got the chance to tell her that she had called the wrong number, and she started insisting that she *had* called the internet company and that I was just too lazy to fix her problem so I was *pretending to be from a different company to avoid doing any work*.\n\nShe refused to hang up (we weren't supposed to hang up the call, even in these sorts of situations) and kept demanding (well, screaming) that we fix her internet. I kept trying to tell her that she had called the wrong number. Eventually I had to say \"Okay fine, I'll just transfer you through to the support team now!\" Then before she could respond, I cold transferred the call to the correct number.",
            "How is this malicious compliance ?",
            "[removed]",
            "Yeah I'd have said wrong number and hung up!",
            "You seriously wasted her time there. If you felt sorry for her you should have said wrong number and ended the call.",
            "As if you sat and listened to that for 45 minutes without getting a single chance to say anything at all. Yeah, k.",
            "How did you boss feel that you held up the line for 45 mins for something you knew was unrelated to your business? To me that's the equivalent of chatting to your mom for that long. You knew it was not for you, so hang up.",
            "Yeah. 45 mins. Sure.",
            "How is this malicious compliance?",
            "[removed]",
            "This is a great example of how not to behave.  \n\n\nIf a person is needlessly bossy, hostile, controlling, and aggressive like that, they will make a lot of situations worse than necessary, and they'll take longer to fix. They'll also establish adversarial relationships with everybody who has the ability to help.... and that doesn't help.  \n\n\nThey're making life shittier than it has to be, both for themselves and others.  \n\n\nTurns out to be a female caller.  \n(bossy, hostile, controlling, aggressive) Matches up.  \n\n\nI love helping guys, they have their own procedures about how to communicate effectively and they can express their emotions by just saying, \"I'm upset about this\" in a flat voice.  \n\n\nIt's always women that make things go way off the rails and totally out of control, off topic especially. Men get to the point, and it's beautiful.",
            "Sorry but this is time theft. It’s a cute story but i’d fire you. Luckily this is just fiction.",
            "Maybe they'll learn something from this experience. Doubtful, but possible.",
            "You get paid the same, either way.",
            "Hmm....I actually find that whole situation suspicious. If they would mistreat an elderly like that, then they're lack of ethnics doesn't end there, so I get the feeling that the posted your company's phone number on their website to direct angry customers towards your company. Just a thought, I can't verify anything without undeniable evidence. Although, I wouldn't be surprised if that was true."
        ]
    },
    {
        "post_id": "16fg97n",
        "author": "One-Cardiologist-462",
        "title": "Oh, I'm on private property?",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/16fg97n/oh_im_on_private_property/",
        "score": 14880,
        "num_comments": 556,
        "created_utc": 1694390751.0,
        "selftext": "My first time posting here.\n\nI used to work for a supermarket chain, and quite often I'd be asked by management to work at other locations.Most of the time, this wasn't a big deal. I was happy to help out - It gave me an excuse to drive and have the petrol paid for.\n\nHowever, one day I was asked to work at a location very far away at a very early hour of the morning. I initially refused on the grounds that I would have to wake up at around 2am in order to have a shower, breakfast, and drive to be on site for 5am.After some arm bending from management I finally relented and begrugingly agreed I would do it.\n\nDue to the drive not taking nearly as long as I initially expected, I arrived on location at about 4.30am.I waited in my car with the music playing.At 4:50am I get a loud knock on the car window, nearly making me jump out of my skin. It was the manager for that store, who, never seeing me before, did not know who I was.The conversation went as follows:\n\nManager: \"You need to leave. This is private property.\"  \nMe: \"Oh, bu-\"  \nManager: (interrupting) \"-I don't care. Go. Now.\"  \nMe: (quickly realizing I can play this to my advantage)\"... Oh, I'm sorry, Sir. I don't want any problems. Of course, I'll go, right away. Sorry.\"\n\nAnd as per his request, I drove home with a smile on my face, knowing that I have the rest of the day free to myself.A few hours later I get a phone call. I answer the unrecognized number, and I recognize the voice immidiately - It was the manager who told me to leave.\n\nManager: \"Hello. I'm looking for \\[myname\\].\"  \nMe: \"Hi, yeah, that's me.\"  \nManager: \"This is \\[managername\\] calling from \\[location\\], I was expecting you to work with me today, you should have been here for 5am.\"  \nMe: (trying to sound casual) \"Yeah, I was there waiting in my car, you told me to leave, remember?\"  \nManager: \"...But you didn't say th-\"  \nMe: (interrupting) \"-There are no ifs or buts. I was on private property and was asked to leave. I was legally obliged to do so.\"  \nManager: \"Right. But don't you think-\"  \nMe: (interrupting) \"-It doesn't matter what I thought. I was asked to leave private property. I'm not going to break the law and risk getting in trouble with the police.\"\n\nIt was at this point he hung up on me.I expected to get in trouble for what had happened, but I never heard anything more about it. This was a few years back now too.It's one of my favorite stories to tell. I hope you enjoyed it.\n\nEDIT (to answer FAQ)  \n\\* I **was** paid for petrol money and travel time.  \n\\* I **was not** paid for the shift - It was originally going to be a day off anyway.  \n\\* I suffered **no financial losses** what-so-ever as a result of this.  \n\\* My local manager never spoke about this, and I never mentioned it to him. I did not suffer any disciplinary action.  \n\\* Yes. **I did** have to wake up early and lose out on sleep.",
        "permalink": "/r/MaliciousCompliance/comments/16fg97n/oh_im_on_private_property/",
        "comments": [
            "Heh, I like that you added insult to injury by interrupting him like he did to you :D\n\n\nNice one!",
            "What real fallout could you deal with?  \n\nI can see it now:\n\n\nMgr:  OP didn't come in for their scheduled shift at 5 AM\n\nOP: I was told I was trespassing on private and needed to leave, so I did.\n\nIf Mgr was too dense not to start the conversation with something so ridiculous as can I help you?  Then they get what they deserve.",
            "Sameish thing happened when I owned a snow plow service. \nI was contracted for certain places and my rate was fixed for the season. One particular lot was $20k November -feb. Push once, push daily didn't matter. \nOne night before a light snow I went to the lot to see if I'd need to come salt or push before morning. I was met by a store manager while sitting in the lot in my car looking at weather radars and texting my crew. \n\"Sir this is private property and we're closed you need to leave\" \n\"I'm here to-\"\n\"SIR THIS IS PRIVATE PROPERTY WE'RE CLOSED YOU NEED TO LEAVE, IF I SEE YOU HERE AGAIN AFTER HOURS OR BEFORE WE OPEN ILL CALL THE COPS\" \nSure thing\nAfter a phone call in the morning wondering why I'm well rested and they're about to open with icy sidewalks, I gave the area manager the story and got paid for an \"emergency \" salt per contract. Never saw that other manager at my window again.",
            "So you expect someone you don't know at 5am and see someone at 4:50 and threaten the police? Manager is very smart, big brain.",
            "I had a similar situation.   I was asked to cover the closing manager at a different location.\n\nI assume the reason for the confusion  was that the store I was going to was staffed by individuals of a different race than I am.  When I walked in, in work clothes,  I was told, \"we dont need your help,\"  so I walked out, drove down the street, and called my boss.  I told her what they said.  She told me to enjoy the night off and called the store to tell the opening manager that she now was working a double because she sent her relief out the door.",
            "For my work as a mobile IT tech we sometimes get  “refused access to site”.  They are then billed for the visit. I’m only to happy to not fix their problem and have them pay for it. \nWe have had customers call police on our techs as well.",
            "I worked for a not for profit.   I was sent to sites to electrical test and tag .   ie test all of your electrical appliciances from your kitchen kettle to your p o s machines. It's a legal requirement. I worked the main area and went to 5 different sites every 6 months.   I was always early so the sales area could be done before customers arrived .    One time an early volunteer showed up and tried to call police on me for being in the carpark and loitering. (Note   Volunteers in these shops where I am think they own them and they are always right. They argue about every change.)  So long story short.  She had a lamp over her sorting area,. It failed its test.  I had to cut its cord.",
            "I had something similar. I was a relatively new IT guy working for a supermarket chain. Most of our stores were close by in a cluster, but one was nearly 3 hours drive away. Each store had a small server rack that pulled retail and price data and also there was WiFi setup for the price guns and so PoS systems can process card payments.\n\nI was on call on a Sunday (24/7 operation) and the system pinged me saying that the distant site is offline and the failover 4G didn't kick in. So, I jump in my car and drive 3 hours till I get there. I walk up to one of cashiers and ask them to point me to a manager on duty and they point out this guy. I walk up to him:\n\nMe: Hi, my name is NAME and in from the IT department. Could you please open the IT room for me to have a look at the server?\n\nThem: What? Hell no, I'm not letting some random on there. I'm gonna need to see some ID.\n\nMe: Sure, here's my driver's license.\n\nThem: No, work ID.\n\nMe: We don't have those. But look, I'm wearing the company uniform, and if you call the IT's number, it will route to this phone I got here.\n\nThem: You could have gotten that uniform from any clothes line. I'm gonna have to ask you to leave.\n\nMe: But your IT system is down and you can't take card payments...\n\nThem: [Reaching for his phone] Don't make this difficult, I will call the police for trespassing.\n\nMe: Ooookay, thanks for you time.\n\nI jumped back in my car, texted my boss' work phone (which was off at the time, but still, to cover myself), wrote my notes into the support ticket and assigned the ticket to my boss.  \nNext day on Monday I come in, and first thing they pull me into a meeting, with my boss, head of IT, the company owner and on video call is the dude who denied me entry. They ask us what happened, I tell them, he doesn't try to wiggle out of it (since there are cameras that filmed our interaction).\n\nThe dude got his first and final warning prior to termination. I got paid 6 hours at 2.5x rate for driving there and back and listening to an audiobook.  \nI do agree they should have given us IDs but the guy had instructions that if he had reason to doubt our identity he should have called the  24/7 IT phone number and verify (which was routed to my phone, and would have rang in front of him).",
            "If you're expecting someone to show up to help your store at 5 am, and someone's sitting in your parking lot in a car, waiting, at 4:50, and your first sentence is \"You need to leave, this is private property\". Well, he got what he deserved.\n\nI'm sure the reason  OP never heard anything about is that in order to complain the Mgr would've had to admit what a tool he'd been.",
            "Instead of asking who you are...  What a bonehead move. 😵‍💫😄😉",
            "Did you get paid for the whole day?",
            "Both of you understood trespassing (being in a business where you have to exercise it occasionally) and both of you chose to abuse it that day. Perfect symmetry.",
            "i'm surprised you didn't say something like \"i \\*tried\\* to tell you who i was but you said you didn't care!\"",
            "The manager was too dumb to ask any questions before losing his shit. That shift would've sucked anyway.",
            "He learned a lesson that day.",
            "One would think that a person expecting to meet a new worker very early in the morning might check to see if that stranger sitting in the parking lot is that new worker before brusquely demanding that stranger leave the property. \n\nHeck, even if a person *isn't* expecting to meet a new worker early in the morning, one would think a person wouldn't be needlessly rude to a stranger sitting in the parking lot. That stranger could be the CEO in disguise, after all. \n\nMy point is, be pleasant to people. Also, ask questions.",
            "This was one stupid manager. He's expecting OP to be there for a 5 am start, but doesn't know OP.\n\nSo when he sees someone in the car park he doesn't know *just before 5am*, he orders them to leave instead of just checking to see if it was the expected OP.\n\nAll OP did was follow the manager's instructions. Malicious compliance at its best.",
            "It never ceases to amaze me how idiots end up in management positions; he knew a new person would be working that day and was too dense to put two and two together when kicking out an unknown person minutes before an unknown person was supposed to work.  Effing genius...",
            "If you see someone where you think they don't belong and they're not a danger, a simple \"Hey, can I help you?\" Would clear up so many situations. But the manager just had to get authoritative and demand you leave instead",
            "Had a manager give me written directions (pre-google maps) to a location that I was going to fill in at. Ass that he was, he gave me directions that took 2 hours to get there. Told me it would only take 40 minutes.\n\nLuckily I went early to eat. I got there barely on time and the manager here gave me proper instructions to get home. \n\nWhen I turned in my mileage, they had an issue with my route. They said they can't turn in my mileage like that because it would be suspicious. \n\nI told him that he could pay me out of his pocket if he didn't want his paperwork to look suspicious.  I added the only thing suspicious are the directions you gave me to purposefully waste my time and make me late. We can talk to corporate about those suspicions if you don't pay me!\n\nI don't know where the money came from, but I was paid by the end of the night. \n\nI hate managers that think they are so powerful, and use that to screw others! \n\nThe manager at your second store was taught a big lesson in politeness,  and courtesy the day you drove off!! For sure!",
            "That was like the perfect crime. Manager might have still been able to pin that on you if it weren't for the \"I don't care\" before telling you to leave a second time. Like dude I'm not going to correct your mistake if you don't care.",
            "To be honest it would have been as funny if not more funny if you refused to leave and he called the cops on you for trespassing.\n\nAdded bonus if you keep quiet and actually get served a Notice of Trespass you don't ever have to work at that location ever again.",
            "Back in the late nineties I had a similar experience. Me and the other openers showed up no manager hung around for about 20 minutes got a peace of paper next door. Left a wish you were here message and went home. Hr and a half later get a call on my landline “we’re the fuck are you!” Is my boss he is mad “Mars were the fuck do you think you called?” He was quite taken back by that. “Why aren’t you here?” “I was there, I left a note, why weren’t you there?” Tuns out another manager no called no showed",
            "How in the hell did he not recognize that the only car in the area was probably who he was waiting for and not some loiterer?",
            "Ohhhh this was so satisfying to read",
            "The most important question is, did you still get paid for the drive?",
            "I love it.",
            "Power tripped himself",
            "Love the pettiness of this.\n\n&#x200B;\n\nI worked as an over the phone interpreter for a company that worked with hospitals. I was working with some doctor, who kept berating the patient (as an interpreter, you interpret what is said regardless of what it may be, your job is to be \"invisible\") over every little thing. The patient has questions, and this guy is pissed for it.\n\nAs we are working through the interaction, an ambulance drives by my street, with its siren on, followed by a few more emergency vehicles, all of them blaring sirens. I muted myself to keep the noise from interfering with the call, but that meant I was silent for a few moments. Doctor didn't like that at all, he starts now yelling directly at me for not saying anything. I apologize, state emergency vehicles drove by and will resume the call now. He goes \"maybe go somewhere quieter, this is unacceptable?\"\n\nFine, you are just an asshole so lets make your day more fun.\n\n  \n\"I apologize someone had a medical emergency around me. I will make sure to loudly voice your complaint about the noise levels emergency vehicles generate. As the quality conditions for the call cannot be met, I will need to find you a new interpreter\"\n\n&#x200B;\n\nAnd sure as shit, he stammered and objected but idgaf at this point. You just said the words I wanted to hear the most.",
            "Haha you know that manager wasn't eating crow the entire double-shift he just created for himself.",
            "What a bellend - literally all he needed to do while waiting for a stranger to show up for work before 5am was ask the stranger who had shown up before 5am *their bloody name*!! 🤦‍♀️😂😂😂",
            "So wait... the guy’s expecting a worker he hasn’t met at 5... and at **10 to 5** he shoos you away without even asking who are!? I could understand this mistake if it was right when you showed up at 4:30, but at 4:50!? Does he think  workers just materialize at the exact moment that they’re scheduled to show up?",
            "Even the facetious English \"May I help you, SIR?\" meaning \"get the f*ck off my property before I start shooting\" in proper American would have given the \"I'm waiting to start my shift with you\" or something similar.\n\nThis is just hilarious.",
            "I'm surprised you have that much restraint when he interrupted you like that. If I were in your shoes, my knee jerk reaction would be to raise my voice or slam my hand onto the horn to shut him up and force him to listen to my explanation as to why I was there LOL",
            "Please tell me you billed travel time.",
            "That is definitely the most wal mart shit I have heard in a while.",
            "\"petrol\" and \"favorite\" ? which side of the  pond do you  live on?",
            "Did you get paid travel time and mileage for your car?",
            "i enjoyed",
            "Perfect revenge!",
            "This sounds fun, but was it worth losing a day of pay and the reimbursement for the long drive?",
            "This is fantastic",
            "Well, you Did try to explain, lol.  Not your fault he didn’t want to listen.",
            "The interrupting him just like he did you.  That was perfect. Took him a couple of interruptions during the call for him to figure out where that came from. I hope he saw how much of a power tripping A-hole he was.",
            "Coming soon to AITA. Store manager inadvertently evicted employee from car park...",
            "So you drove hours to not work and not get paid?",
            "I have worked in many retail stores. Not a single person in the store would ever give a shit if someone was parked outside before we opened. It happens daily.",
            "Quality.  Hope you got paid..",
            "He got what he asked for.",
            "My bet is that he whined to the district/region/whatever mangler, and mentioned that he'd told you to leave, and the DWRM said \"you dumbass idjit, you told him to leave. I'm sure as hell not going to try to run paperwork on him for following an *explicit instruction.\"*\n\nOnly, you know, they probably didn't talk like a hillbilly from Kentucky. But the gist remains.",
            "Plot twist: that location couldn’t find an employee within 2 hours driving distance because manager was an asshole.",
            "Private property! I would do the same. Have a day off and go biking/fishing or whatever.",
            "I expected this:  \n\"Someone told me to leave and didn't give me a chance to explain why I was there.\"",
            "And? How did YOUR manager at your usual location react to all this? The story feels incomplete without that bit.",
            "This is one of the best militiouscompliance.",
            "I never get these stories where it reads like a tv script, it takes very little effort to actually say what you need to say. You could say \"I'm supposed to work here today\" much quicker than \"... Oh, I'm sorry, Sir. I don't want any problems. Of course, I'll go, right away. Sorry.\"",
            "> Me: (interrupting) \"-There are no ifs or buts. I was on private property and was asked to leave. I was legally obliged to do so.\"\n\nI mean, if you don't want to get paid, you do you. There is no way you got paid for this.",
            "And then the whole town clapped.   Nice try.",
            "A paid vacation day, good for you !",
            "I miss TLDRs.",
            "[removed]",
            "Why didn’t you just tell him? What a waste of people’s time.",
            "So you got up at 2am for nothing and missed out on a days pay? You really showed him...",
            "[removed]",
            "Very well played!",
            "You should have told him who you are, even if you had you drove away and drove back 15mins later (you would get giggles anyway). This was a bit of an asshole move.",
            "You still had to use your time and fuel though",
            "Thoroughly enjoyed! Well played 😎",
            "I mean sure you aren’t wrong but you went out of your way to not clear up an obvious misunderstanding. Do you desire any upward mobility? Promotability? Being the bigger person would have tremendously increased the perception of you as a mature individual who can be trusted with bigger things. What you did, however reeks of having a personality who would rather poke sticks in eyes the rest of his life.",
            "You were a jerk.",
            "Maybe he realized he was the asshole.",
            "That amazing.",
            "Well that was before my time and I feel ancient most days",
            "\nCv-",
            "Well done.",
            "Gold.",
            "nice",
            "Oh to be young again",
            "[removed]",
            "As your manager told you what to do, and you did it... were you not doing duties as assigned?    \nSounds like you should have got your shift work too.",
            "Epic \n\n:D",
            "LOL bless his little heart",
            "My thoughts? Well played.",
            "You are my hero! Thanks for sharing",
            "So you shot yourself in the foot, made a net positive of 0. Yes it's malicious compliance but what a let down, but try standing up for yourself more OP. I'm sorry this happened to you."
        ]
    }
]