[
    {
        "post_id": "nwcwnk",
        "author": "Seannj222",
        "title": "Evict me without cause and only give me till midnight to be out? No problem.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/nwcwnk/evict_me_without_cause_and_only_give_me_till/",
        "score": 14861,
        "num_comments": 391,
        "created_utc": 1623292313.0,
        "selftext": "So once upon a time I was living in a (not legal) basement apartment of an old Hungarian woman's house. I was poor, the place was cheaper than what was around, so I took it. \n\n\nHow bad could it be?\n\n\nShe. Was. Horrific. \n\n\nAt first she was an okay landlady, but then things started to turn. First I noticed that things were, off when I got home from work. Ever get that feeling someone was in your room? That. \n\nSo I asked her if she'd been in there and she denied it. Then I set up a camera and caught her on camera. Asked her again and she denied it, saying she's never go in my apartment without telling me. Then I showed her the video and she got mad at ME. \n\nI worked nights. One time she came in during the day time and I was there. In bed, naked under the sheets. I woke up when she came in and asked if I could help her, she said no and left. \n\nAfter that she would call me \"lazy boy\" when she saw me, assuming I didn't work since it was at night. \n\nThings kept getting worse. She'd sometimes shut off the water when she thought I was using too much or when I refused to share my wifi password with her other tenant. \n\nFinally, one night I had some friends over for a birthday. There was six of us total, it was around 11pm and trust me when I say, we were not being loud at all. Literally just hanging around the coffee table eating cheesecake talking and laughing. \n\nShe came into my apartment and started yelling that I was having a loud party with too many people in the middle of the night! She actually came and grabbed my shirt telling me everyone had to leave. \n\n\nOh hell no. That was it. \n\n\nSo I pushed her off of me and the police were called. \n\nThat Monday, she left a really poorly written eviction notice on my door.. seriously, hand written. Telling me to be out by Saturday by midnight. \n\nHere's the MC.\n\n\nBy 11:59pm that Saturday, I had all my stuff in the U-haul. My friends and I were just working on bagging up the trash and other stuff for the dump, when she came in and yelled at me that it was past midnight. \n\nNo problem. I got up, and left. Leaving a huge pile of junk in the bedroom and storage room. Easily 2 pickup trucks worth of crap I wasn't taking. \n\nShe actually called my father, who was my emergency contact on my application to tell me it cost her $400 to haul it all away and that I owed her money. He blocked the number. \n\n\nTHE END\n\nBonus story\n\nShe was showing the apartment when I was still living there. She didn't tell me. So when she lead two strangers in the daytime, waking me up again, I stood up. Fully naked, full staffed and said I wouldn't rent from her if it were the last apartment in town. The couple quickly left.",
        "permalink": "/r/MaliciousCompliance/comments/nwcwnk/evict_me_without_cause_and_only_give_me_till/",
        "comments": [
            "Way to stand up for yourself",
            "Something similar happened to a roommate I found on Craigslist. He was subleasing from classmates who made him do 100% of the chores on top of an equal share of rent. He finally refused and they said to move out by midnight that day or to pay the remaining 10 months rent up front by the following week. He found my place on Craigslist that evening and I helped him get out by midnight. Best roommate I ever had.",
            "Awesome on your part!! I just wish you could’ve done more to get back at her. I hope she royally screwed herself over somehow after you left.",
            "I think this is great. I'd not heard the term fully staffed used in this manner.  But I think I get the picture!",
            "she handed an eviction and you handed an erection",
            "Solid MC! I also love the description of being “full naked, full staffed” when she was showing off the apartment while you were there. Hope you found a better place after that!",
            "You missed a real opportunity to comment \"*Free* prostitutes delivered *directly* to my bedroom?!?! Thanks landlord!!\" and scare them away that way.",
            "I’d love to hear her side of the story. And not in a way of wanting to understand her side, but just that anything she says will end with “and then I saw his penis.”\n\n“He had friends over late! Big party! And then I saw his penis.”\n\n“I gave him an eviction notice! And then I saw his penis.”\n\nHe takes long showers and refuses to share his WiFi. And then I saw his penis.”",
            "I just went through a very similar situation with an indian family in london. Tried to hide in his room when i was leaving the country and waiting to get my deposit. Luckily i saw this coming so told him my flight was 48 hours before it was. \n\nEnded up having reserching this scammer to find out he likely aquired his house through identity theft. \n\nI left a copy of the info on the kitchen counter, and long behold my deposit was in its place by the time i really had to leave. \n\nThats the nutshell. The details are crazy lol.",
            "[deleted]",
            "[deleted]",
            "I read old Hungarian woman and shuddered. The last one I stayed with was a literal nightmare, burst in my room about a spam call she got, and I almost got the shotty to end things for her in a morning daze of not knowing who TF was bursting in. So sorry you went through this. Literally same shit, no joke. Put stuff behind my door and closed it to see if she was invading my privacy. Yep. Evicted without cause, yep. Did stuff to bring the house to code and fix things that hadn't been maintained in twenty five years. Still waiting on money from that shitshow. Thanks for sharing that last bit, made me laugh. Fuck these type of people.",
            "I went to see an apartment with a friend. The tenant was still there and it was awkward as hell. The tenant and this lady did not seem to like each other. We took a brief tour and on my way out of the door the tenant leaned closer to me, looked me right in the eye, and whispered, 'She's crazy.' \n\nThat's all I needed to hear. We didn't pursue the apartment and I probably owe that tenant a huge thank you.",
            "IMHO; She's been collecting money on the rent without reporting it as income. City and federal authorities would like that information. Could be considered a public service to put a stop to that, and her renting to the next victim.:)\n\nBonus is, You may just also get all your rent back.",
            "I had a very similar experience in my last place. I had just gotten hired in the area after college and didn’t want to sign a long term lease to an apartment yet. So I signed a 6 month lease to rent a room in a condo. I was one of 4 dudes, all engineers in automotive, and we all got along great. Seriously a great bunch of dudes. \n\nThe landlady was an absolute raging control freak though. This condo was actually her home she raised her children in, so she was still psychotically attached to it. She made unreadable demands nonstop. Stuff like telling us to spend 3 hours a night cleaning, or how to arrange our silverware. \n\nRight before I moved out, she actually had the basement door removed because “opening and closing it caused enough  wind to blow out the furnace pilot light”. The furnace was about a good 60 feet from the door and separated by two walls. \n\nI could go on all day about her shit.  But when I moved out I filed a complaint with the city hall. This city code requires all rented rooms have an egress point in case of emergency, and half sized basement windows don’t count. The city actually followed up and fined her. I also imagine her rental insurance premium now sky rocketed. \n\nI really hope it fucked her entire world up, but but for the petty nonsense she did to me. She was a certified predator. All the other tenants were non-citizen Indian guys working here in a visa. They had been long term tenants and she had been doing this shit to them for years. She threatened them “criminal court” to force them to comply with shit like how to clean toilets, simply because she knew they were scared about losing their visas. I’m sure she picked her tenants specifically for this reason, and according to her words she accepted me as a resident “because I made so much more money than they rest of the guys”. She also went by Karen. \n\nKaren if you are reading this, I hope your life sucks and your daughter still refuses to go to college for what you want. \n\n…I also intentionally left a huge pile of trash for her to clean up :)",
            "Glad you didn't go off half cocked",
            "I wonder how good a look that couple got 'cause i'd have stared for a good min if not longer",
            "Had somethin like that as well.... A couple that acted as janitors. They had the spare key and when I didn't answer the door, because - why should I if I don't want to? She would get the key and let herself in.... I pulled the naked-thing twice, then she learned and I had a stern talk with my landlord about the spare key. In short: I got the key and the janitor lady was beyond angry.",
            "Glad you took a stand",
            "If this was USA, you didn't have to leave that quick. Most states you need a month notice",
            "With video evidence of her breaking in?\nPolice, right away. Seriously.. call them as soon as this happen and get the fk out fast.",
            "If it’s an illegal basement apartment, you can sue for all the rent back",
            "“Fully staffed” 🤣 I’m dead",
            "This kind of shit is why there are requirements to rent out a space legally",
            "A hand-written eviction notice?  I think in every civilized country, you have to go through some sort of court process before evicting someone.  Even if it is a room in the house the landlord/lady lives in.",
            "Why were there 2 pick up trucks of trash in your rented room?",
            "A lot of places have cleaning deposit of at least $400 if you leave a place excessively messy.  It's on her if she was to stupid to ask for a deposit like that.",
            "I was moving out and the property manager was threatening me that \"anything I don't take right now she's taking to the dump\" but I had already taken all of my stuff and everything left was garbage so I said thank you and left a huge pile of stuff.",
            "I am impressed! I was once in an extremely similar situation. I had crazy anxiety every time I would come back to my apartment. I wish I had left as quickly as you did.",
            "Each case where she went into your home without advance notice should be criminal trespassing. After the third or fourth time I would have called the police, particularly if you had proof that she denied that she had done it.",
            "Sounds like a future judge Judy episode.",
            "Were you camping in the room when you stood up because it sounds like you were pitching a tent",
            "Should have reported her. I don't care so much about her renting a room and not paying the income tax on it, that's not an issue. But when she enters your space without permission, multiple times, shuts off the water, and everything else it changes. Shesgetting reported for everything she did, especially for demanding cleanup fees. I have a feeling there wasn't a written lease agreement at all. \nAnd depending on the state it can take months to legally evict a person",
            "r/landlordlove",
            "Alternate “The Fugitive” story line was where I thought this was going",
            "The bonus story, rock solid.",
            "Mom?",
            "What kind of personality trait is it when people get mad at you for catching them lying?\n\nI have a baby-mama like that and it's impossible to work with her.",
            "But do you shift gears?",
            "That’s why you take your evidence and seek legal representation",
            "God I love this thread because these are all ideas for how to deal with my landlord. Just blindsided me with a year's worth of electric bills after just not charging me for it the past year and a half. I don't have a lease, and this prick refuses to basically do anything aside from rent the place out to a dude who invites literally his entire family over every day. I've gotta find a good paying job that doesn't suck away my soul so I can move out already.",
            "I had a roommate one time get pissed at me for not telling her \"good morning\" after she made a ton of noise, waking me up an hour and a half earlier than I needed to be. She texted me I had 30 days to move out, that I was disrespectful, blah blah blah. Like really bitch? You make tons of noise in the morning and on top of that your son makes noises literally ALL FUCKING night long. And I am the one that is disrespectful? I've contemplated putting her number online so people can harass her.",
            "I also rented an unsanctioned basement apt from a selfish controlling woman. After staying with her for a year she announced she would have the heat fixed because it looked like I was staying a while. The apartment was just warm enough to  prevent hypothermia because the rest of the house was heated, but I probably survived only because I’m fat. I assumed the heat just didn’t work well, not that it was completely broken. She was obnoxious about the rent like paying in afternoon was an outrage and when she traveled once she made me pay rent early.\n\nOnce, when I was the sickest of my life I put out trash and left the outer door ajar. She burst in to scream at me while I lay in bed and I apologized profusely or as much as I could  being so ill. When I was upright for a short time I decided to crawl into a pharmacy for some OTC meds. She locked me out in retaliation (the outer door for which I had not been given a key.) I tried banging and ringing the front door and could see her smug poker face watching tv a few feet away, no response. I was so sick and I went to the police, it was very late at night. I death coughed so uncontrollably I couldn’t hold urine and stood there shaking while the cops called her about access to my place. I could hear them saying, “do you REALy feel safe having THIS women in your house?” She told them she did not lock the door. It was miraculously open when I tried again. Months later when I moved out (notice given- all legit,) she turned out the lights to my entrance through the back yard. It was motion sensitive, so again, I know it was intentional. This, because she was upset I didn’t complete my move during daylight. \n\nI just have to mention I took this women to the doctors more than once and to Kmart on demand. I also cleaned up a shit ton of shit dung when she took her medicine incorrectly and screamed for my help.\n\nBoth her children where in DC in the military. I can imagine this woman who didn’t believe in excuses; not illness, not unfortunate events, not coincidence, not catastrophic weather was the perfect person to prepare men for military discipline.\n\nApologies for postal length.\n\nSummary: Rented from a sanctimonious, ungrateful, sneeky senior.",
            "Why didn’t you report the illegal apartment (after you left LOL)?",
            "Huh, I think this was my landlady in the past. Is this an individual in Amsterdam",
            "You didn't win, you let her off the hook. Get a lawyer and help the next guy next time",
            "You said she only gave you until midnight to be out but then you said she told you on Monday that you had until midnight Saturday?",
            "moral of the story: dont rent an illegal apartment.",
            "How did you have a basement apartment with a UHaul and two pickup loads of shit in it?",
            "Do you not live in a country with laws? It's not ok to treat tenants like that.",
            "\\> Fully naked, full staffed and said I wouldn't rent from her if it were the last apartment in town\n\nSaid by the guy standing in an apartment he rented from her",
            "[deleted]",
            "As per tradition, I have to ask:\n\nVolt-e ott bojler eladó?",
            "I would've had her thrown in jail, old lady or not the elderly aren't above the law.",
            "I left 6 feral barn cats as my “fuck you” to a landlord.",
            "V",
            "...",
            "Why do you think six people talking and laughing was not loud?",
            "\"I worked nights. One time she came in during the day time and I was there. In bed, naked under the sheets. I woke up when she came in and asked if I could help her, she said no and left. \"\n\nShe wanted your d",
            "Why is it relevant that she was Hungarian?",
            "[removed]",
            "When she *led two strangers",
            "When she *led two strangers",
            "Hungarian here, if you are still around you got a free beer of my last brew for that...",
            "even if you didn't mention Hungary, I'd guess it... this kind of shit happens so often it is not even surprising.\n\nnice job btw",
            "I bet you’ll think long and hard before you rent from an old woman like that.",
            "Hard times call for hard times",
            "Epic. Well done!",
            "I love this! I can only imagine the look on the potential tenants faces.",
            "Just listened to this on r/slash’s podcast (I’m really behind), and hoowee! I had to rewind it cause I was laughing so much!"
        ]
    },
    {
        "post_id": "fqa3x1",
        "author": "lesbian_moose",
        "title": "I have to show up at 8:30 no matter what the schedule says? You got it.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/fqa3x1/i_have_to_show_up_at_830_no_matter_what_the/",
        "score": 14803,
        "num_comments": 263,
        "created_utc": 1585357228.0,
        "selftext": "I was working for a child care center while I was in college. We staggered staff in and staggered them out so that we were always fully staffed when all the kids were there and they all had various arrival and leaving times. So staff could be scheduled to arrive anytime between 7:30am and 2pm. \n\nI worked M-F 8:30-4:30. Even though my schedule was fairly permanent, I would check the schedule that got sent out every Sunday evening (it would always get sent between 6 and 9 pm and it would be for that current week so we had less than 24 hours notice for our weekly schedule, a hot mess express if you ask me but I’m not in charge and my schedule is set so I don’t raise too much hell about it). \n\n\nOne week I get the schedule and it says that my arrival time is 9am instead of my usual 8:30 for the entire week. I figure they’re just trying to make minor cuts and they really like having everyone under the full time threshold so I just assumed they were barely  cutting my hours so they could get away with it. No big deal, but I knew that most of the kids arrived at 9 so I would need more time to set up. I get there at 8:45 on Monday and set up quickly and go about my day, I do a little prep Monday night so I don’t have as much to prep In the morning. So on Tuesday I get there at 8:55 clock in and begin my day. \n\n\nMy week goes on like that with me prepping in the evening and getting there at 8:55 until Thursday when my boss calls me into the office and reprimands me for my “tardiness.” I tell her the schedule tells me that my arrival time is 9 so I’m actually arriving early everyday. She says that the schedule says 9 just to indicate that you are the morning shift but if you’re scheduled for classroom time, you need to arrive at 8:30 regardless of what the schedule says so you have time to set up the classroom. I don’t agree with this at all and it’s obviously not true because not everyone arrives at 8:30 anyway, there has to be more distinction than just morning crew versus afternoon crew on the schedule. But she admits that she’s “partially to blame for the mixup” and doesn’t turn it into a formal write up. \n\n\nI start arriving at 8:30 every morning (just like I had been before the week in question, I’m not a late person). One week I was going to be scheduled for the 1-6:30 shift because another coworker needed to switch with me and we had both agreed to this. So the schedule comes out and says my arrival time is 1pm. I arrive at exactly 8:30, clock in, and sit my pretty butt in the office chair, and wait. Well eventually my boss notices that I’m just hanging out in the office and asks what I’m doing. I say “well I was told to arrive promptly at 8:30 no matter what the schedule says, so here I am.” She says “we don’t need you here for the morning so you can clock out and come back when your shift begins.” Um nope. I say “you can find a task for me to do until my shift at 1 starts or I can sit here, but I’m staying clocked in. You were the one that said that I have to be here at 8:30 no matter what. I’m just following your instructions.” \n\nI had to deep clean the entire school until my shift actually started, but it was so worth it because I still got paid for the whole day and my boss had to admit to me that she was full of it. Watching her try to backtrack was the funniest thing that’s ever happened to me!",
        "permalink": "/r/MaliciousCompliance/comments/fqa3x1/i_have_to_show_up_at_830_no_matter_what_the/",
        "comments": [
            "I mean fucking shit \"I know I said 9 but you need more time to prep. I'll schedule you at 8:30 next week.\" This would be the fucking correct solution. I have a feeling this wasn't the only rotten thing she's done, though.",
            "\" But she admits that she’s “partially to blame for the mixup” and doesn’t turn it into a formal write up.\" \n\nThat was a CYA move on her part because she knew she was in the wrong, just didn't want to admit it.",
            "Under no circumstances would I accept a verbal schedule that contradicted the written one. If she wants you there at a specific time, she can write that time on the schedule.",
            "Yeah I was on mobile when I wrote it so the paragraphs didn’t break apart. I had to open my laptop to fix it",
            "so much extra work for nothing. \n\nJust tell them: I need  a schedule that reflects the actual time you need me to be here. \n\neasy peasy.",
            "If it's on record as 9 am start but you're starting 8:30, are you missing out on that half hour pay?",
            "I'm going to guess that employees--maybe not you, but some others at some point--had some issues with the \"hours worked vs hours paid\" calculation... \n\nBecause this is freaking classic \"I want to make people work more and pay them less\" tactics from the *Big Book of Things Terrible People do to Employees*.",
            "Thanks for fixing the text OP, when i came to read it it’s perfect. Btw, this is hilarious",
            "OP, ignore all theses comments from people who have time to browse, but apparently don't have time to read 7 paragraphs of a (relatively clear for this sub) story; thank you for writing cohesively.",
            "This was really common with managers in retail. Out of the 3 that I had, 2 would take this exact approach. \"Well, I know x says y, but you should really know better.\" Just a way if passing all of the blame onto you, when it is their fault for not doing something.",
            "> she admits that she’s “partially to blame for the mixup”\n\n“It’s my fault that I screwed up the schedule, and it’s your fault that you’re not clairvoyant.”",
            "Wait, you agreed to swap shifts for the entire week, and then showed up at 8:30am? Sounds like the joke is on you..",
            "Sounds to me like she wanted you to come in at 8:30 but wait until 9 to clock in. It looks like she was trying to steal 2 1/2 hours of your pay.",
            "So the Boss' master plan to get you to voluntarily deep clean the entire school finally worked?",
            "While your boss is clearly worthless, you're not going anywhere in a company where you fuck around and play semantics with communication.  It would be better to have agreed to clock out and had the manager clarify your arrival times in writing.",
            "You agreed to switch shifts with a coworker and then demanded to be paid for a shift you switched out of? I'd tell you to enjoy unemployment.",
            "I'm not sure this is malicious compliance. Its clear that they did make a mistake on your morning schedule. If you work mornings they want you in at 830 and screwed up in how they communicated that. In your malicious compliance you switched shifts with a later shift and knew you were working that later shift but still came in the morning. That doesn't sound like malicious compliance to me.",
            "This is what happens when an I-can-NEVER-be-wrong boss meets a situation where they are wrong; the doublethink two step. They are actually right and you misunderstood.",
            "[removed]",
            "How it should have gone: \n\nBoss \"go home until your shift\"\n\nYou \"no\"\n\nBoss \"ok, go home and never come back\"\n\nYou're absolutely the dick in this story.",
            "Seriously? Yeah I get the first fuck up but you actually swapped with someone the 2nd time?? That's not MC, just stupidity.",
            "Had something similar.  Worked in a nursery where you were expected in by 7:45. But then you actually had to be in by half 7 for the daily meeting. Then they'd tell you when you would have your break throughout the day, sometimes wouldn't get told until 10 am. Basically working non-stop from half 7 until 6pm. Absolutely horrible if you ask me.",
            "This is the stupidest shit I've read on this sub",
            "You are the petty I wish I was brave enough to be!",
            "Not worth deep cleaning. You played yourself!",
            "The fuck is a pull up expert?",
            "According to the schedule, you’re falling from.",
            "I worked at a contracting company who wanted us at the warehouse/shop for 7am, but we weren’t on the clock until 8am, so this guy got a free hour out of all his employees",
            "Shit leaders gonna be shit. Our schedule for the week gets made on Monday morning in an hour long cluster fuck meeting that could be an email, it’s a wonder we don’t get anything done",
            "So they're just taking half an hour off your wages, for the same work.",
            "You look like a tool in this story.",
            "Could've all been prevented if you had just called to ask what's up with the new schedule..",
            "[removed]",
            "OP you really aren't the brightest are you? sure manager is a dick for trying to cut your hours but you played yourself really",
            "Super surprised you wouldn't just get fired. \n\n100% on your side, btw. \n\nNitpicking: in the story, your boss says \"9 just means you're on the morning shift, which starts at 830\" but then later you've taken a shift which starts at 1pm, so wouldn't that mean you're doing the afternoon shift/not starting at 830am?",
            "\"You know what I mean, I want you to work without pay.\"",
            "Eh, I probably would have just used the moral high ground to ball my boss out for a fuckup. I’m not impressed with your focus, get your act together.",
            "Actually you didn't do what she said because she said you need to come early (which she should have scheduled - that's not the point) IF you're scheduled for classroom time, not every day.\n\n\nAlso you said that you voluntarily switched shifts with a coworker and then you are showing up for your original shift and expect to get paid for it?\n\nYou are either fucking over your coworker or yourself.\n\n\nHonestly if I were your boss I would let you learn a petty lesson and pay you until your shift, that you switched yourself, would actually start but until then it would have been your pleasure to do all the nastiest work around that needs to get done.",
            "It sounds so petty. You know what she means. Why do you want to get on your boss' bad side?",
            "That is so stupid. They are going to fire you the second they can, as would I. You are going to have a hard time holding a job if you continue to act so ridiculously.",
            "Guess who still has to go to Brown.",
            "Was this at a CDC because this sounds a lot like my old job",
            "My schedule says 9am on it but if I’m not at my station by 8:58am I’m late.  I feel ya.",
            "I need to know more about the pretty butt.",
            "Redditors are too lazy to read text that isn’t cut up for them like how mommy cuts their food. Sorry OP, I really liked your story! Sometimes deep cleaning is actually really nice because now it’s up to genuine standards instead of half-assed ones.",
            "Wait seriously? I thought that’s hilarious",
            "You should’ve issued a lockdown.",
            "For the love of God...paragraphs",
            "This one of the dumbest things ive read and super childish on your part. Id wager that most of it is made up, specifically the last half",
            "1) This is amusing, and I approve.\n2) If this is the funniest thing that's ever happened to you, you need more funny in your life.",
            "Aren’t the death rate at best 1-2%?",
            "Nice one!!  Good low conflict way to put turn the screws to her which subconsciously very very much makes people respect you more and be far far more careful about what they say and do around you because they know you, have a BIG backbone and people tend to stay out of people like that’s way. \n\nWell placed intensity has been the key to my advances at almost every job I’ve ever had.",
            "I just came",
            "I just looked at it or not!",
            "This hurts my eyes",
            "Wall of text remains unread."
        ]
    },
    {
        "post_id": "baltsw",
        "author": "AshyCat21",
        "title": "So there is no such thing as overtime, great god to know!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/baltsw/so_there_is_no_such_thing_as_overtime_great_god/",
        "score": 14806,
        "num_comments": 417,
        "created_utc": 1554675138.0,
        "selftext": "Hey Reddit, this is my first post and its my BF's story.\n\nSo, a bit of back story, my BF's boss is a bit of a dick, but unfortunately, he's also his uncle.\n\nMy bf works in I.T. He handles a lot of complaints regarding servers and general IT stuff. For the past three years he has worked overtime for free. (It's difficult to say no to family). He answers his personal phone and has to drive long distances to fix problems clients are having, sometimes at 10 at night. \n\nRecently, we've been trying to save money to make a life together. So my bf decided to ask the boss to finally get paid for all the overtime hours he will be working from now on. The boss is livid. He states that he will not pay my bf overtime money and he shouldn't ask again and that he should be grateful for his job. He concludes by saying that there is NO SUCH THING AS OVERTIME IN THIS BUSINESS!!\n\n&#x200B;\n\nCan you see where the malicious compliance comes in yet? ;)\n\nSo my bf now does not answer any calls after 5 or before 8. The boss now has to take all those calls and drive the ridiculous distances himself. BF gets called in and is asked why he isn't picking up his phone because the clients are getting really upset at him.  Bf's answer \"I'm sorry, but you said.... there is no such thing as overtime\".\n\n&#x200B;\n\nI've never been more proud!! ",
        "permalink": "/r/MaliciousCompliance/comments/baltsw/so_there_is_no_such_thing_as_overtime_great_god/",
        "comments": [
            "Am I the only one who wants to know the boss' reaction?",
            "I love your boyfriend.\n\n:-D but in all seriousness, good for him! It really takes a lot of courage to stand up to a boss, and a family member.",
            "Why don't you tell your BF to take his skills elsewhere and get paid what's he's worth? Then you two could save faster. He has the experience, that's the had part!! Great story too, don't work for family it's can get messy.",
            "Pretty sure it's against the law to work OT and not be paid for it.",
            "I work in IT as well. Management loved getting me with the \"you're salary, no overtime\" spiel. I was on call 24/7/365 (minus when I used one of my 8 paid vacation days). I burnt out after a few years. Between the constant on call and underwhelming salary, its a no brainer that I don't work there anymore. IT really needs to form a union because this type of behavior is rampant. ",
            "I've been an IT professional for the last 15 years - good on him. That kind of abuse is extremely common in the industry, even when you're not working for shitty family members.\n\nBurn out, poor mental health, bad home life etc.. far too many of us deal with this from shitty employers who don't value what we do and pretty much expect us to trade our lives for poor pay and terrible conditions.\n\nDon't put up with it. If one person working 8 hours a day can't keep on top of the work then they need to hire more staff, it's that simple.",
            "And this is why I refuse to work for family again. Lost most of my teenage years and early adulthood doing that. I could've spent those ten years doing something else.",
            "For many salaried people, especially in tech, there really isn't overtime pay. They'll throw people a bone or two like free lunches and dinners and bonuses, but any time is business time if you are needed by your supervisor. That's why when you evaluate your job, consider the possible overtime hours and see if the salary is sufficient.",
            "Unpaid overtime is an epidemic. It's a shame almost no politicians are willing to stand up for working people and end this practice. ",
            "Having worked for an uncle myself in a similar field, I can attest to this scenario. However, my malicious compliance was of a different variety. You see, I had a lot of company data on my personal laptop (company desktop was available to me at the office, but it was old and slow, and I had an i7 so you better believe I used my own computer). I made sure the raw data was on my laptop and only the compiled versions of information were sent to the office. This included updated stock & price lists, inventory management files, price calculation algorithms, compilations of company transaction history for the new EMS (Enterprise Management Software) that I was in-charge of implementing, the like.   \n\n\nNow after 8 months of working for him, I had enough of the 3-5 hours staying back at the office compiling data in Excel, and sometimes just staying back to drive home \\*even though he used to come to office in his car\\*. One day I went up to him, told him I'm leaving the gig because it's not fulfilling at all, and I'd rather pursue prospects elsewhere. I had a few interviews lined up and was feeling confident. He seemed unusually calm and with a stern face said the uncle equivalent of 'all good mate, catch you on the flip side'.\n\n&#x200B;\n\nThe above conversation took place in May. I get May's pay in June. Imagine my surprise in the first week of June when I got 60% of my usual pay, because \"You're leaving the office abruptly and in a mess. We need to employ someone else and train them to take over your position. That's where the rest of your pay will go.\" Bear in mind, before I joined, this position at the office didn't exist. I only joined because the job market is terrible out here and I wanted some experience of how a company works. Being the nephew of the GM, I figured I'd get an inside view. This was also NEVER MEANT TO BE A PERMANENT GIG. And now, my pay gets cut due to the costs of employing someone else.\n\n&#x200B;\n\nSo I just stopped working on the worksheet I was compiling at that time (oh yes, I was still being given assignments), and with all the raw data said fine, don't pay me, you don't get your data. \n\n&#x200B;\n\nIt's been 10 months, me and my uncle don't speak anymore. \n\n&#x200B;\n\n\\#DontWorkWithFamily\n\n&#x200B;\n\nTL;DR : Work for uncle temporarily for experience. Decide to leave coz excessive unpaid overtime. Last month of working, pay is cut due to costs of hiring a replacement. I take all raw data of the company with me, leaving new guy to start over in nearly all aspects.\n\n&#x200B;\n\nP.S. : Sorry if the formatting sucks, first time sharing anything, and I don't know how you guys construct such well-worded, perfect flow anecdotes.  \n",
            "As somebody else in IT that deals with client servers, there absolutely is such a thing as overtime in his business. If he's been there for a year or two, he should get out and find himself a real company to work for. Family or not, that's a shitty boss, and a sign of a company that barely scrapes by money-wise.\n\nI worked for a small company once in this field that was great because it was super low-stress but also only kind of paid okay. The CEO acted like he was a millionaire, showing up at random times in the day in his tennis clothes with racket in hand. But he also struggled to pay our wages on time. Eventually it got worse and he didn't pay my last two weeks at all before the company closed up shop without notice. I'd talk to him about getting out of that company.",
            "Its called wage theft.\n\n&#x200B;",
            "I was going to say that there's nothing worse that working for family...\n\nThe I remembered a friend who worked for family who did really well.\n\nSo I'll re-state it as \"there's nothing worse than working for family that treat your time as nothing else but a way to make money\"\n\nLet me give you my story.\n\nI was born to be a machinist. My dad owned an engineering company that I ALWAYS wanted to work at. It helped that I'd been working there since I was 9 ish. Drilling PCB holders, or stamping a different pcb holder on a fly press.\n\nI loved that he wanted me there. \n\nI was of course supposed to be paid a fiver a week, but I never saw it. I didn't care, my dad saw me as someone worthwhile, so I was happy.\n\nI get my gf pregnant, I'm not happy, so I leave working for him.\n\nSeveral months later, I've been doing a HND (EITB based) in college which included CNC programming, so he comes to my flat and says \"I've got a job on, he shows me the drawings and asks if I could program his Bridgeport Series 1 CNC mill (basicly a manual mill with HUGE control boxes). \n\nI saw it, proper 3d milling, but on a limited machine. Saw I could program it, said \"yeah, i can do that\"\n\nhe asked how long it'd take to produce 100 pieces, I said about a week. He offered £3 piece work. I did it in 4 days.\n\nTurns out the material was supplied by the customer, all he had to pay was electricity (and of course al the normal things for a business like public liability insurance, but forget those for now (he already owned the buildings))\n\nA few years later, I was in the office of that particular customer and the manager I was trying to get a cheque off for something else asked me if I'd programmed a particular job. Well yes I sure did. \"Man, that was beautiful, we didn't think your dad's place could pull it off.\". Through further talking I found out that he had supplied them to the customer for £296 each. \n\nHe paid me £3 each.\n\nI'm sure he remembers this as the time he got a great deal. I remember that time as when he lost my trust. OK, so he earned £30k ish. I'm sure he was made up about it. However, I've learned that my dad has one objective in life, and that's to have more. It doesn't matter so much where it comes from, as long as it's his, and he doesn't share.\n\nShit thing to learn, but I learned it and I promised to make sure my kids didn't learn the same lesson.",
            "If the uncle gets nasty your bf can just call your state's labor department and report it. They love unpaid overtime cases.",
            "If he had the overtime documented, and wanted to get paid for it, a call to the State department of labor would probably get him his money. The departments frown upon employers flagrantly violating employment laws. This would result in fine against the employer also, which I understand not wanting to do, if it is family, etc. Just sayin'. ",
            "[removed]",
            "Of course, he may find himself unemployed. There are jobs/businesses where extended availability without extra payment is the norm",
            "now this is what i like to see",
            "Family and business don't mix. ",
            "The more I read about IT jobs in the states, the less appealing it all sounds. It'll be a lot less stressful for my wife to learn a second language and find a job here than me to enjoy an annual burnout in the states in those conditions.",
            "GOOD. On-call work deserves on-call pay difference. Anyone in medicine and IT can tell ya that one. :) I'm glad your bf got the cojones to refuse his uncle's bs.",
            "yes. this is indeed the correct use of malicious compliance. \n\nI have ran businesses and let me tell you that finding employees who go a little above and beyond the minimum is rare. your bf uncle should be thanking the stars to have someone like your BF and pay them extra with gratitude. ultimately, if his boss should be adjusting the prices to the service and the clients should pay for it. what you have here is money going to waste and your bf and you paying for it ",
            "There are exactly four jobs I can think of in which there really is no overtime.\n\nBeing a business owner \n\nElected political office\n\nVolunteer work\n\nMilitary service \n\nJust because the uncle doesn't pay himself overtime, the business being his baby that he needs to put his every ounce into, does not mean he's entitled to everyone else seeing it that way.",
            "I don't know if this is the same everywhere, but I'm pretty sure the kind of work he is doing requires paying overtime.  Developers get excepted, but not trouble shooters.  Such rules are usually available online, and can be printed. \n\nHowever, most client support is done remotely first, as the client gets faster service.  My last job got their network and servers supported remotely except for major installs.  Ten calls a night is weird.  ",
            "I personally plan on never answering any before 8/after 5 calls. Why should I? What’s the point? I already spent/will spend half of my waking hours at xyz business I don’t give an airborne fuck about, why do you think I want more?",
            "Check the laws.  Even if your BF is salary, there are stipulations.\n\nHe needs to treat it like a business decision, not family.  And hope his uncle can too.",
            "IT is pretty competitive. Your bf should get a new job ",
            "Document. ",
            "Find a new job.   ",
            "How’d it work out though? Did the boss/uncle buncle see the error of his ways?",
            "So, what did he say the aftermath was?",
            "I worked for years at a small mom and pop design company and got out through the ringer with the number of hours I worked and no overtime. I wish I’d had the knowledge or backbone to stand up to them but it took a long time and a lot of pain to be there. \n\nGood for him and good for you by extension.",
            "By law you’re suppose to be paid time and a half for over time hours. ",
            "In all honesty if he can prove the hours he worked, he can take it up with the department of labor and chances are the company will be in deep shit. Happen to a old co worker of mine.",
            "There’s no such thing as overtime *pay*",
            "I thought you were going to say he talked to the labor board and got back pay for all the hours he was working over time.\n\nStill, this is good.\n\nHonestly everyone in IT is chemically castrated, it's hard to watch them just get walked all over.",
            "Tell you BF his boss also needs to pay his cell phone bill if he insists on calling him at home and he should also provide a company car for those trips.  ",
            "the ultimate \"fuck you\" move to this is reporting his boss/company to the department of labor. If your bf recorded his hours, the dept of labor can and will make his boss give him back pay for OT",
            "Jesus, putting up with that for 3 years. Poor guy. I'm glad he finally decided to stand up for himself. People like his uncle will abuse the living shit out of that... as you have seen. \n\n",
            "Never do unpaid overtime",
            "It’s just too bad he didn’t document his overtime and go after the motherfucker for backpay plus interest. ",
            "Is this in the US?\n\nIs your boyfriend Salary-Exempt?\n\nIf so, is total yearly pay should be based on working 45 hours per week to compensate for after-hours (key words) work. \n\nIf he's hourly or salary-nonexempt, his uncle is breaking federal wage law. ",
            "When your BF's uncle is enjoying his holiday home on the lake, just take a moment to ponder where all that unpaid overtime went. Helping people out because you want to is one thing, being taken advantage of is a whole different kettle of fish.\n\nGood on your BF for standing up for himself, but also spend a little of the new time he's got on his hands to spruce up his resume.",
            "If your bf documented his OT hours, he could go to the state and get that all reimbursed.  With interest.  And penalties.  Of course, he'd have to find another job, but something tells me that would be in your bf's best interest, both career-wise and personally.",
            "I wish I could do that. I work at a movie theatre, and although I’d consider myself customer service (selling tickets, tearing tickets, selling concessions, cleaning theatres) I am still considered “entertainment” and therefore, don’t qualify for overtime.\n\nSo, I am hired as “part-time” get paid $8 an hour, and will often work over 40 hours a week in the summer, but I don’t get paid overtime.\n\nI’m not much of a complainer, but this doesn’t seem right to me",
            "Never, ever, ever work for family unless you have a meaningful stake in the business. You'll never be appreciated for what you do and always be paying for the sins of whoever donated the sperm and egg that created you.",
            "I was like this for almost 10 years,  I am a hardware tech so if something died I had to be on scene replacing and often at all hours of the night.  Was pulling an all nighter at a client one night and had a complete and utter breakdown mentally.  The client found me on the floor balling my eyes out and unresponsive to outside stimulation.  When I finally came good, we sat and had a very long chat about it.  I started for him the next month as contractor and now make more money than I ever did with my previous employer.\n\n&#x200B;\n\nWhat happened ruined me in ways I cannot express,  everything suffered and all my issues now stem from that job.  I have put together a small group of \"my boys and girls\" to do the big stuff and I'm about to take a leave away from the 9 to 5.  The wife and I bought a bus and we are about to hit the road.  Not sure if we are coming back or not but hey life and happiness are more important now the the figure in the bank.",
            "Never do business with family.",
            "Great GOD ",
            "Unpaid overtime is illegal in most countries, so technically your boyfriend could sue if he hates his uncle enough",
            "I do not understand why Americans work for free and then wondering why their bosses get ridiculously rich and trying to enslave their employees even more...",
            "Remember to update on what happens ",
            "Nice.\n",
            "1. This employee takes his job very seriously and has been working hard. Maybe I should reward him on top of paying his overtime unless I want him to stop working like this.\n2. there's no such thing as overtime lul\n\nWhoa, tough choice",
            "He needs to document all of the overtime he can think of that he has worked over the entire employment. Then upon termination request backmpay from HR.  If it is not paid take it to a lawyer, it's pretty easy treble damages.",
            "When you say overtime do you mean he doesn’t get paid for the hours he works, like he worked 44hrs but only got paid for 40 or do you mean he gets paid for every hour he just doesn’t get any extra $$ for it being over 8hrs or over 40?  \n\nI can understand if his wage is higher because they understand he’s on call and has the occasional issue to deal with but he doesn’t get extra dollars other than his wage.  Like no time and half.  \n\nWe pay guys a higher wage for on call for all their hours regardless if they’re doing the on call portion of the job or just regular work hours, they’ll make extra and of course pay them for the hours they work if they do get called.\n\nBut if they go over 40 it’s not a higher $perhr. That’s covered by the overall higher wage they make for all their hours. ",
            "We deffinetly need an update to this!",
            "> So my bf now does not answer any calls after 5 or before 8\n\nThat's what you're supposed to do anyway if you're paid hourly in shifts. You have to offer people valuable contracts that overall compensate them for the extra and unusual hours. ",
            "My work did the same thing when I got hired. But were like, “since there’s no overtime, go home after 40hrs. \n\nSweet",
            "Many IT workers are exempt from overtime laws. If this idiot uncle were smart he’d make your BF salaries exempt (if allowable) which would mean no overtime, only “time” and he could be worked up to 168 hours per week while still paid a base salary. ",
            "Tell your boyfriend to start looking for a job as soon as possible. Even if he doesn't get fired, the work atmosphere is only going to get shittier for him. ",
            "I've been IT for many years.  We are considered in Canada to be essential personnel.  Ergo no ot.  It is not granted ot as per what you are talking about.  It sucks but that's how much of us live. ",
            "what happened then?",
            "Sadly, this situation is very common in Belgium and not only with familly members.\n\nWe have the notion of \"being on call\". That means that you have to be available if any incident happens.\n\nI got called a Saturday because of problem on a gaming server. As it was the first time and because the dev wasn't available, I unblocked the situation.\n\nMonday, I made it sure it was the last time I would answer a call. Either they pay for me being on call or they accept I will not react at all.\n\nThey tried hard to have me being on call for free and quickly abandonned.\n\nI ended up quiting the place although I was enjoying my role. No opportunities in salary growth, dishonesty and disrespect of employees.\n\nThe biggest strike was when a pregnant HR employee has been taunt because she couldn't go on a chair and extend her arms to catch a folder! She righfully said she can't. Even a complete morron would have avoided asking her anything remotely dangerous.\n\nWe got also people drilling holes and doing hard work at no more than 5 meters. I could even touch the guys by stretching my arm... Sound level almost 80. (In Belgium we have laws for this, we were very border line)\n\nI had to complain many times to get the devs (and me) moved to a suitable location. We ended up in a meeting room with luxious chairs ^^ But that wasn't ideal either. (i.e. not at all ergonomic)\n\nSo, I had to close my eyes during two weeks as people couldn't decently produce quality code.\n\nI was QA (not tester), so I was sideways to the management. It did make my lofe way easier.",
            "answer the calls, contact a lawyer to help you document everything well. when he doesnt get paid OT, after so long, sue. You shouldnt have to give up that extra money and its very illegal to not get paid OT.",
            "If your boyfriend is actually getting paid and doesn't have to file a 1099 for his work, talk to your boyfriend about small claims court. I'd also encourage him to tell his family about what's going on. That's some shit to treat a relative like that. Especially one who was so willing to work.",
            "What an awful shitty uncle. I hope he looks to leave now.",
            "Your BF needs to get a different job. It would probably give him better pay, actual legal treatment, scheduled raises, and better benefits. It would also take out all the stress of family dynamics and being taken advantage of. His uncle's reaction that he should be grateful and getting angry when asked for things that would be standard in another job is likely never going to change. Something to consider. ",
            "Good for your BF. I've worked a family business and I've seen plenty of others who's boss was family. Most of the time I've witnessed it as it was for me, the whole ordeal is giving too much of yourself because it is family. Seldom do I see it where it's a cash waterfall for the family member but that can happen too.\n\nOn a side note, anyone working at a private company that's a family business should consider moving on as soon as possible. If you don't have the right name you are not the one advancing.",
            "Unpaid overtime = corporate welfare.\n\n&#x200B;\n\n&#x200B;",
            "\"  So my bf decided to ask the boss to finally get paid for all the overtime hours he will be working from now on. \"\n\n&#x200B;\n\n&#x200B;\n\nI read it wrong and i thought your it said your bf was going to get paid for all the overtime hours he worked before and from now on.\n\n&#x200B;\n\nOops. I read wrong. It makes sense after reading it. \n\n&#x200B;\n\nThat is fun. Nice.",
            "I am curious what are your boyfriends workplaces clients?   \n\n\nVery few companies I imagine would need 24 hour support, I think a culture of dependence has developed so the clients now assume there will always be support.",
            "The Fair labor Standards Act would disagree with the \"no such thing\" rule. \n\n&#x200B;",
            "sometimes family is the worst of abusers. \n\nI knew a guy trying to start a restaurant  who had family coming in and ordering food but not paying for it. \n\nthat little problem put him out of business, \n\nhope your BF/SO gets paid for hard  work, and your plans for the future work out well.(happily ever after) ",
            "Tell him to please search for a new job. So many IT opportunities right now it’s insane. He could find a company that actually values him. ",
            "Depending on where the company is based, it can be EXTREMELY illegal to NOT pay overtime.\n\nI hope boyfriend has kept track of every second he worked, because it could be his asshole uncle owes him a shitload of money.\n\nUnfortunately, you don't get to choose your own family. If some asshat uncle will throw you under the buss like that, they don't deserve one tiny bit of family friendliness.\n\n\nHe needs to look for another job.  Even move if need be, unless you own a house, or even if you do, a move might be worth it, depending on such work in the area.\n\nAnything is better than being in such an abusive, dead-end job.  Sounds like dude has skills, and needs to be PAID for them.    \n\n",
            "I know",
            "Definitely something that comes with private organizations, not necessarily family.  Mix in people with a strong work ethic and going \"above and beyond\".  It's a recipe that pretty much creates this environment over time.  I worked for a small, private company for 10 years and nobody wanted to let the company or CEO down.  We worked hard, jumped in after hours if necessary, bonuses dangled like a carrot, etc.  Fast forward several years and it just became expected and abused.  Once the first employee left for greener pastures, the rest followed over the course of a year.  With a career like IT, you have marketable traits.  Whether its with hardware or software languages.",
            "The boss doesn't give away his company services and products for free.\n\nDon't give away your labor for free.",
            "Hope he knows expected ot without pay is a decent reason to tell prospective employers why you're looking to leave a job.",
            "In the US IT pros are exempt from a lot of the OT laws. Just FYI. \nIt’s BS but worth looking up.",
            "I worked for a large company in it like this doing tech work. They got away with it by misclassifying tech positions as salary exempt, meaning legally no overtime pay. I did this job for almost 10 years including on call. I would get called at 2 am to swap a printer a hour away and literally get zero compensation and be told that I was expected to be at work at my normal start time. Field IT is rough, large orgs will take advantage.",
            "My old old old compnay we got paid for 48 hours a week but worked 42. They would add this up and state we needed to do 26 days ovetime a year and they called them 'company owed days'. We called them compulsory overtime days. Still not sure if it was legal.",
            "Is there a sub for stories that end too soon?",
            "hi, probably won’t see this but I’m literally in the same situation right now. \nI’m a self contractor however, and the MSP I work for is pretty informal. Unfortunately family is involved. My dad is the only W2 employee, and he is old friends with the boss. After speaking with several other IT on reddit, it turns out they Mis classified me as a contractor instead of an employee to skirt around benefits and overtime. \nThey also dictate my schedule even when I’ve formally told them my hours for school reasons. Overtime was a huge issue, and two years ago they made all the contractors sign a contract saying we were ok with no overtime. Anyway, te gotten pretty overwhelming and toxic. I’m working 60-80 hours a week, and I just keep getting stacked with projects. Currently figuring out what I should do. I don’t want to hurt my family, since my dad is already on the older side where no one would want to hire, and the company/boss hasn’t necessarily targeted me or been an asshole, just very pushy and nonflexible, even though he and my dad say he’s very flexible.",
            "Ehh if he signed salary exempt taking the job he has no legal standing to be paid though ",
            "Ummm also maybe talk to a lawyer because overtime pay is a federal right (within the U.S.). I’m new to HR management but in this class I’m taking I’m pretty sure I read that every employer is required to pay their employees time and a half on anything over 40’s a week and/or 8 hours a day. Also his boss can’t fire him for suing to get the pay he was owed. But take that with a grain of salt because I could be wrong.",
            "He should be able to find a new job pretty easily btw. ",
            "STFU with your fake ass story ",
            "Sadly in most states/provinces, IT people are exempt from overtime, so his boss was more than likely correct.",
            "IT is an overtime exempt position. I’m pretty sure none of them get paid OT. ",
            "Nobody I know in IT gets paid overtime, so in that sense his uncle may be right. On the other hand, if he's expected to be on call he shouldn't also be expected to be there 9-5. Moreover, if he's paid as a contractor his boss has zero say in _when_ he works—IRS rules!",
            "Seems more like mishandled expectations. If your BF didn't set the expectation up front that OT was to be paid a certain way, then it's wrong of him to ask for years of backpay at an increased rate. Moving forward he could notify the boss that he won't work outside of 40 hours without OT pay. \n\n&#x200B;\n\nIf he's on a W-2 Non-Exempt then he could bring in the dept of labor--if you want to go that route. If he is W-2 exempt, then the law is on the employer's side and your BF needs to re-negotiate his employment terms (lol, that's not going to happen) or seek work elsewhere--and manage expectations upfront.",
            "He works for his uncle tbh who gives a fuck?? ¯\\_(ツ)_/¯ .. entitled people problems .. dude gets a gf,, “well he’s your uncle ask him for more money so we can get a bigger house”",
            "Now we are met on the great climax of that orgy and have come to ejaculate a cumming of the climax as a final fucking place for those who have empregnated. "
        ]
    },
    {
        "post_id": "f18fj1",
        "author": "Sanctemagne",
        "title": "My girlfriend can't come over till tomorrow? Tomorrow it is then!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/f18fj1/my_girlfriend_cant_come_over_till_tomorrow/",
        "score": 14787,
        "num_comments": 617,
        "created_utc": 1581253824.0,
        "selftext": "My mother hated my first girlfriend. I had actually been planning to become a Catholic priest (and therefore to be celibate) when I was in high school, so my mother saw my first girlfriend as having ruined my life's plan when we first got together. Now naturally, my girlfriend and I wanted to spend as much time together as possible at that early stage of our relationship, but my mother did everything in her power to try to limit this. As such, one day I asked if it was alright for my girlfriend to come over to our house, but my mother said \"no, not today\". I was not particularly happy about this, especially because it was so obvious she was just being vindictive and had no good reason as to why. So I pressed her about it and eventually, after much discussion, she agreed that my girlfriend \"could come over tomorrow, but not today\". Again, this was vindictive because she knew that neither of us had as much free time the next day as we did on the day in question, so it would have meant way less time together for us. Nevertheless, I agreed to my mother's offer. \n\nSo right on the stroke of midnight, my girlfriend arrived at my house and I brought her inside. Immediately my mother called me away into the kitchen and started getting very intensely angry that I hadn't done as I was told because she said that she couldn't come over until tomorrow...to which I replied while gesturing to the clock \"but mother, it *is* tomorrow.\"",
        "permalink": "/r/MaliciousCompliance/comments/f18fj1/my_girlfriend_cant_come_over_till_tomorrow/",
        "comments": [
            "Does she not realize that plans change?",
            "My parents were similar to this. Non-catholic, but southern babtist which is a monster in it’s own way. They kept trying to force my bf out because they believed he was getting me to hate them. In reality I just realized that it wasn’t normal for parents to use you as their own personal slaves. Funny how parents blame the gf/bf for any change in their child’s mindset.",
            "Dude, I’m the youngest male on my dads side of the family, which meant to my grandma I was going to be the priest in the family. I never wanted that shit, but it was all she ever talked about when it came to my future. Her last words to me as she lay in her death bed was that she could die happy knowing I would find my place among the clergy. She had no idea that, despite how much I loved her, I had no intention of becoming a priest, and the fact I was raised Catholic meant I had a +10 resistance to guilt. I do, however, play a mean cleric in d&d campaigns, so I guess there’s that.",
            "Tom Cruise was going to Seminary school to be a Priest, but after sneaking out to smoke cigarettes and stealing liquor from the private rooms of the Franciscans he got kicked out.\n\nWe all know his religious goals today and that he changed his mind...wonder what would have happened if he hadn't been kicked out.\n\nhttps://www.google.com/amp/s/churchpop.com/2016/08/10/tom-cruise-was-almost-a-catholic-priest-until-he-got-kicked-out-of-seminary/amp/",
            "I’m amazed that a mother would somehow prefer to have a catholic priest in lieu of potential grandchildren.",
            "My husband went into seminary straight out of high school, and his mother had a FIT because he was moving away, wouldn’t have grandkids, etc. He discerned out, we started dating, got engaged....and she threw a fit again. \n\nStraight up said “I regret you leaving seminary!” Even though he left after lots of prayer and thought (and also she gets no say anyway.) \n\nUnfortunately for her, we got married anyway. We have a great, strong, Catholic marriage, so in the long run if your mom’s not supportive of whichever vocation you’re called to, there’s always St. Mary to lean on 🤷🏼‍♀️",
            "Kind of reminds me of my cousins first date with his wife. He told me that on the first date, she told him that she doesn’t do kisses until the second date. So he dropped her off at 11:59, drove around the block, and then at 12:01 he was back at her door for their second date. Always thought that was a cute story. Clever thinking on your part haha",
            "When I started dating my now wife, her parents told her: \"get home before 9pm or we'll lock the door and you'll sleep outside\"... You see where this is going obviously. They didn't. After a few days, we missed the curfew. So instead of pleading to her parents, she just came to my place.\n\nThe next morning, they called, angry, but she explained that she had followed their rules. Not home by 9, can't get in. So no other choice than sleeping with me.\n\nWe've been living together since. It's been over 15 years already.",
            "I feel like \"Listen here you little shit.\" Is a common phrase in your household.",
            "Good MC, would have gotten me murdered in my home, but since you obviously lived, good MC. \n\nSorry half the other posts so far are basically asking if you're a pedophile, internet has become a weird place.",
            "[deleted]",
            "I guess what I don’t understand is how a young person could fell comfortable going to a friend’s parents home when they’re clearly not welcome there by the homeowner.",
            "This is hilarious XD I have a similar experience with my boyfriend. We met in a catholic college our freshman year, he had this scholarship because he was studying to be a priest (I was studying to be a vet) and on September 20th of our freshman year he asked if I wanted to be his girlfriend XD After that whenever the monks would introduce me to someone else they would say “Remember that boy who was studying to be a priest? This is his girlfriend” XD they never said it maliciously and we always got a good laugh out of it. Both my boyfriend’s and my family are still very close and good friends with the monks :b",
            "Hush now baby, baby don't you cry.  \nMama's gonna check out all your girlfriends for you.  \nMama won't let anyone dirty get through.  \nMama's gonna wait up until you get in.   \nMama will always find out where you've been.  \nMama's gonna keep baby healthy and clean.  \nOoh baby, ooh baby, ooh baby,  \nYou'll always be baby to me.",
            "\"It's _never_ tomorrow in THIS house.\"",
            "I worked with a young lady decades ago, her dad was an ex priest and her mom was an ex nun. They were lovely people who like a lot of couples met at work and fell for each other. \n\nUs older guys when at work gatherings at bars after work and when out of earshot of the young lady used to comment occasionally when the topic came up on how that must have been a very interesting honeymoon.",
            "what kind of kid wants to be a priest when they grow up? Seems so weird to me.",
            "i mean, more power to you. but if you were my kid, i’d just say “aren’t you clever” and tell your girlfriend to get the fuck out of my house.\n\nedit: fwiw, i would have let her come over in the first place. so it’s kind of moot.",
            "I like the fact that it is implied your gf would be sleeping over since it is midnight. That feels especially scandalizing to a Catholic mom.",
            "My moms doing this to my 22 year old ass right now, and im just not going to let her be a part of her grandchildrens lives.",
            "I did something similar as a kid. My cousin had spent the night and at like 9pm my sister decided to bake a cake. That cake smelled *amazing*...and my sister said we couldn’t have any until tomorrow. So at 12:01am we went into the kitchen and cut us some cake. She wasn’t even mad...she was amused that we took her so literally.",
            "...\"no. it's not. it's *today*. tomorrow is *tomorrow*\"",
            "\"I want you to be a stoic celebate for the rest of your life.\"",
            "Slap me with them downvotes. Religious parents are generally super controlling. I said it.",
            "God calls in many ways, and if you are incompatible with what has been defined by others as your call, than it is not the call of God. The last thing Catholicism needs is a Priest who is not comfortable with being a priest. \n\nGo do his work as an example of a good dad and influence others by your model. Then you can be comfortable as a Father.",
            "I dont want this to come off as mean, or rude, Im actually just really curious...\n\nWhy did you want to be a catholic priest in HIGH SCHOOL?\n\nLike, thats ambitious as fuck, and I feel like thats something you dont stumble upon. I really hated church as a child and a teen, so  Im at a complete loss how something like that can be attractive at that age.",
            "That comment section is gonna turn into a /r/raisedbynarcissists thread 👌",
            "[deleted]",
            "I feel lucky that my parents really like my gf and I believe her parents like me too",
            "I love this.",
            "How this was upvoted 12.5k times is beyond me. You wanted to be a priest so your mother was protecting you. You sound like a brat.",
            "Your mother is sly like a Fox!  It is NEVER tomorrow, it is ALWAY today!!  Tomorrow never comes!",
            "And then she kicked her out because you don't have any power in the house?",
            "On behalf of small boys everywhere: thank you for not becoming a catholic priest.",
            "So yeah, that's great and all but I don't think these type of stories work as well when someone else (your parents) are providing you with room and board. Their house, their rules, within reason.",
            "Ooookay so while I'm an atheist so I do r much care about the religious aspect, you might need to remember it's not neccesarily \"our house\" but actually \"her house\" and if my son (late teens) had played a stunt like this, he wouldn't be having guests round for a while.",
            "So have your plans to become a priest changed?",
            "Haha, so did y'all fuck or what",
            "No, it is always 'today'. She just wasn't quick enough to get you with the zinger.",
            "I’ve seen your profile and it is intriguing. I have a question for you How did you go from wanting to be a Catholic priest to being a sugar daddy?",
            "I was expecting that when the next day hit she would say sorry, its now today, she can only come tomorrow. Tomorrow never comes, it is always today.",
            "Man, I wish I had the bravery to step up to my parents like this. They think I'm still Catholic too. At least being in college has given me some privacy to be myself and to live my life the way I want.",
            "My mum was a nurse. It happens.",
            "The future is now old woman",
            "How's the Catholic Priest goal coming along?",
            "She just wanted to show him what he was giving up so he when he enrolled in AA later (Alterboy Anonymous)\nhe would have some stories to tell.",
            "600th comment.",
            "It actually all depends on how old you are. If you're still young and living with Mom, maybe go easy until you can move out?",
            "Kids want weird things while they're growing up, fair enough. But what kind of parent actually WANTS their child to be a priest?",
            "So...were you 23 in this story?  Because if one of my kids brought their boyfriend over under the same circumstances that would be the last time he came over for a long time. I'm frankly surprised the girlfriend would be willing to be that defiant.",
            "Um, no thanks. I hate it.",
            "A celibate Catholic Priest, now there’s a novel idea.",
            "holy shit someone smoke a bunch and read this. it’s fucking hilarious. Sheldon in a different timeline",
            "God is dead.",
            "It just sounds like you decided to change plans once you figured out you could get your dick wet. Not that I believe that you should wait till marriage, but your devotion to being a priest doesn’t sound really genuine or like you thought it out that much. Especially if you’re willing to just completely change what you believe to be ethically correct when it’s convenient. That’s my problem with most devoted Christians currently. I noticed you quoting a few bible verses at a woman in this thread. You can’t just pick and choose what you like about your faith. I mean you can, but it’s kind of pathetic. If you are going to be a more laid back, moderate catholic like myself and don’t care about waiting till marriage, then quoting that shit at people who disagree with you is asinine.",
            "Why would you become a priest and be celibate? Sounds like a terrible way to spend your time, may you see light that isn’t Catholicism",
            "Made the right choice. Would have been stupid for you to become a priest when you clearly are not into little boys.",
            "I know a catholic priest who is married, but no children, only adoptive. Although he lives in Spain. I never knew you had to be celibate to be a priest, I thought it was only monks",
            "My girlfriend has to go right across the street",
            "Good one! I really wanna pull this on someone. Sadly, the time has passed...",
            "My mom was like this growing up. Best I can say is wait until your in your own.",
            "Certainly should be pulled over too.",
            "She won’t want to share HIS girlfriend",
            "Wait till you try Chartreuse.",
            "Had this in my ESOL classroom tomorrow!",
            "Fine. I have no time to explain to you.\nI have my invocation paperwork.\nIt doesn’t matter to me.",
            "Did you hit?",
            "My standard of \"This is a peloton ad??",
            "So did you become a priest after anyway?",
            "If you actually said “but Mother, it *is* tomorrow” then idk why she was worried about you losing your virginity lol",
            "I think that's the reason our Catholic student society got shut down. Most of us coupled up and the priest left with a student.",
            "You should show her this bit of protestant propaganda from 1555 criticizing celibacy. \n\nhttps://vulgarcrowd.wordpress.com/2015/10/19/the-naughty-nun-a-raunchy-woodcut-from-1555/",
            "You should show her this bit of protestant propaganda from 1555 criticizing celibacy. \n\nhttps://vulgarcrowd.wordpress.com/2015/10/19/the-naughty-nun-a-raunchy-woodcut-from-1555/",
            "You should show her this bit of protestant propaganda from 1555 criticizing celibacy. \n\nhttps://vulgarcrowd.wordpress.com/2015/10/19/the-naughty-nun-a-raunchy-woodcut-from-1555/",
            "You call your mom “mother?”",
            "The amount of hate thrown at you for your religion is astounding...granted I’m probably a bit biased as well as I’m Catholic but geez\n\nY’all need to take a chill",
            "What sort of nut would rather their son be a genetic dead end than have children?",
            "Toby?",
            "I take it she didn't like either of your girlfriends.",
            "Sounds like it is time to grow up and move out.",
            "r/insaneparents",
            "Try living elsewhere. If you tried this with my mum she would slap the black off you",
            "Your mother sounds like a miserable old HAG. I’d move out and never speak to her again",
            "If you want guests over whenever you want, then move out.",
            "OP seems like kind of a brat tbh",
            "Just letting you know that some people really are glad you’re happy!",
            "Done",
            "Is your mother Irish?",
            "[removed]",
            "Get your own place if you want to have people over."
        ]
    },
    {
        "post_id": "lc39fd",
        "author": "SalvaPot",
        "title": "You want your money back on this item that is selling for 10 times what you are paying for, and you demand it now? Sounds good.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/lc39fd/you_want_your_money_back_on_this_item_that_is/",
        "score": 14780,
        "num_comments": 235,
        "created_utc": 1612399929.0,
        "selftext": "I run an anime/geek store and we are really lenient with pre-orders. We used to not require a deposit to make an order, and in case you needed more time to pick-up an item, all you had to do was ask. We could also hold the items for as long as needed in our storage if you wanted to gather a lot of items so you could save on trips/shipping.\n\nBack on February, Funko released a special edition [Vinyl POP of Naruto Hokage](https://gameskeysaustralia.com/image/cache/catalog/data/2020/Funko/AA47097-500x500.png). This one in particular had a 1 in 6 CHASE variant that ended reaching up [to a resale value of $130](https://www.hobbydb.com/marketplaces/poppriceguide/catalog_items/naruto-hokage-glow-in-the-dark). But the way I do pre-orders is that, if you order 6 of the same piece, you are guaranteed a chase. But if you only order 1, you still get a 1 in 6 chance of getting the chase, I just mix them up in random boxes and do a public stream raffle on social media, so everyone knows who won the chase, and I get good publicity that way\n\nA client ordered just one and left $5 as deposit, the piece was $15. This particular client won the riffle (Along several other clients), but he wasn't that interested in picking it up or paying for the rest of it. I send him a message letting him know that he had won the special variant and had a week to pay it or he will lose his pre-order. At first he was angry because he wanted the normal version, no this \"yellow thing\", but we explained we could change it if he wanted but that this one was far more valuable. He said he asked his son and his son wanted it anyway, but asked for more time to pay, so we gave him one more week. Then he asked for another week. And another.\n\n&#x200B;\n\nThen we had to close the store for a time for, you know, 2020 reasons,, and we told him we had to close but we could still schedule an appointment to give him his item or wait until the worst passed. He never answered.\n\nEventually we were able to re-open the store with regulations in place and send him another message telling him we can save it for as long as needed in this strange times. He still didn't answer the messages, but at this point he arrived at the store and demanded for his money back, citing how we were on the middle of what was going on (Fair) and he couldn't waste money on frivolous plastic (Also fair). I asked him if he was sure, and even showed him the price the figure was selling for (at that point in time the chase figure was selling closer to $150, and he just had to pay retail price, so about $10 more for it).\n\nHe said he was sure I had made up the numbers, that he had ordered the figure for his son but he didn't deserve it (harsh) and just wanted, no, demanded his money back.\n\nI just said \"Fine, I'll give you your money back. Also, I'll just put this figure out for sale.\" He just said \"whatever, just give me my money\" I made a point to grab a post-it note (That I use to put prices to not damage the box), write in big black letters \"$90 bucks, last one\", and put it on the glass window that leads to the street. I could see him turn his eyes while I did this.\n\n&#x200B;\n\nWhile my employee was giving him his 5 bucks back and giving him a receipt, a young man knocked the door, I gave him some cleaning goo, checked his temperature and let him in. He immediately asked to buy the Naruto CHASE figure. The angry man eyes went wide open over his mask as I picked the POP and guided the young man to the desk, where he handed me the bills one by one.\n\n&#x200B;\n\nThe angry man stood there shocked as the younger man was gushing about how hard to get that figure was and how he was getting it for half the price other places where asking, and in such perfect condition too. I couldn't have had a better reaction even if I paid him for it, lol. The young man completed his purchase and leaved as fast as he came. The angry man looked at me, almost as if accusing me of taking advantage of him.\n\nI just said: \"Well, you got your money back, I'm happy you are happy, if you need anything else please let me know, and stay safe out there.\"\n\nThe man just didn't have much else to say and left. Kind of a small and silly thing to feel good about, but 2020 hit us so hard that any unexpected profit was cause for celebration, so we celebrated that good sale with some (instant) ramen, Naruto style.\n\nTL:DR- Man ordered a toy, got lucky and got the rare valuable variant, refuses to buy it even when told of its value, demanded money back, as he is given his money back he gets to see it sell for 6 times what he was going to pay.\n\nEdit: Thanks for all the kind words! My store is in México and I really appreciate everyone asking me how to support it, I didn't mean to self-promote and I'm not 100% if it's against the rules, so I won't, lol, and also I can't ship to the US right now due to the situation (I'm not american so I can't cross the border since I'm not essential, also I'm trying to go out as little as possible). I want to answer all of you directly but I just can't!",
        "permalink": "/r/MaliciousCompliance/comments/lc39fd/you_want_your_money_back_on_this_item_that_is/",
        "comments": [
            "You and your store sound very fair and conscientious.  A lot of places wouldn't have stuck to your original agreement like that, holding onto a $150 collector's item for months to sell it to a guy for $15, even taking the time to explain how much more valuable the item is while still not raising the price.  That guy was a jerk, especially to his kid, going back on his word to buy a $15 toy after many months.",
            "My ex gave away one of my warhanmer 40k armys \"For charity\" without asking. After loosing my shit she said \"she'd pay me back what ever that stupid plastic might have cost \"... well.. ok then. Luckily there was pictures so when I presented her with the 1300€ bill (not including work hours and paint) she wasn't as amused as before about my stupid plastic figures.",
            "Sweet justice.",
            "Now that’s instant Karma. Dude hadn’t even gotten his money in his wallet before the awesome guy came knocking to buy it. If someone told me that the prize I won was that valuable and I wasn’t certain the seller knew what they were talking about, I’d be pulling out my phone to check the price elsewhere and confirm it!",
            "I love how he couldnt understand that he could literally pay $10, turn around and sell it on the spot to some other dude for $100 rather than DEMAND his $5 from the cashier.",
            "Do you have a store website? I would love to check it out. You seem like a really great shop owner and I do in fact love geek stuff. Win/win",
            "Instant karma can be so much more delicious than the deferred kind. You'd have still made out well if it had sold an hour after the guy had left the store, but this is priceless. (For everything else, there's MasterCard.)",
            "My brother is a HUGE Naruto fan, who is currently trying to collect as many Naruto Pops as he can (just recently I gave him a Hot Topic exclusive metallic Gaara Pop).\nIf he would've been in this guy's shoes he would've been thrilled.\nI'm glad the guy got a dose of instant karma, but I do feel bad for his son.\nI hope the son finds out what happened one day so he'll know just how callous and entitled his father is, if he doesn't know it already.",
            "The poor son tho..",
            "Absolutely golden!",
            "Massive respect for you. Not many store owners would be as accommodating as you were and wouldn't think twice about making a profit off of someone's luck. I guess the guy simply never thought he could actually sell it off to someone and would rather \"save\" his money rather than go through the hassle of selling it online or something. I'd say most parents aren't really aware of how collector's items like these work. I bet my mom would've passed the opportunity as well. 🤷🏻‍♂️",
            "I love it!  I’m thankful that preorder exists because there’s too many scalpers out there trying to flip items for high price when I want something at a normal price if possible. You did give the guy a fair chance after all. Must be so nice to see karma have a quick turn around while he was there!",
            "Angry and stupid, people are these days.\n\nIt seems to be getting worse by the day.\n\nBut whatever.",
            "Amazing",
            "Wait, so price of each funko pop is ~15$ and I am guaranteed a CHASE version if I buy six, the chase version sells for almost 130$.\nSo a person can always have 40$ in profit.??\n\nHow are you guys not losing money on this.?",
            "Honestly it would have been really easy to search ebay or Google for the value of it.",
            "Kinda surprised he didn't try to ask for the 90. Since that \"should have been his\" or something along those lines.",
            "Hahahaha love it",
            "What city is your store located in if you are willing to share? Or the store name?",
            "I love it not only for the karma- but that someone who was truly excited to have it got the variant.",
            "Yo, this man literally said fuck your $130 figure I want $5 back right now? Lmao",
            "Does your store have a website? I'd love to support your business!",
            "Now he knows Pain.",
            "Uggghh, I am SO glad I don't deal with FunkoPops or collectors anymore.\n\nGrown adults fist fighting over toys was the line in the sand for me.",
            "Hahahahaha",
            "I imagine how often people buy ultra rare pops or variants like this and have no idea...",
            "Perfect timing!",
            "HAA HAA !!!",
            "Instant Kurama...",
            "You got a website I can check out?",
            "Do you have an online store? Sir, you are awesome and I'd love to buy something from a social distance.",
            "No wait, I want you to give me the value it's worth, even though I could of had it for 10 more bucks",
            "I'm down to buy 6 rn if I'm guaranteed one lol hmu plz",
            "Never underestimate the selling power of limited edition nerd things- spoken by an avid anime and DnD nerd",
            "Well, he was correct in a way.\n\nHe didn't believe you when you said it was worth $150, and they guy who bought it said it was selling elsewhere for double the $90 he paid you.......\n\nBut I don't think that's what he meant. :D",
            "Delicious. You gave him every opportunity. He could have kept it and sold it. He pulled his bad luck on himself.",
            "That was a very satisfying read! Thanks for posting.",
            "Secret Jutsu:Instant Karma no jutsu!",
            "I like your style! Does your store have a website? I’d love to support local even from afar lol.",
            "Love this. He though you were lying to him and that he was smarter than you by demanding the money back. But I'm happy it worked out for you",
            "I love the smell of instant karma in the morning! \n\nAlso, do you have a website? I too am a geek who loves  to collect",
            "So you order six of them for 15 each and are guaranteed to get one that sells for 130? I'm guessing you sold out pretty quick.",
            "That's a parent that didn't do his research, also not understanding the amount of anger over such a small amount that you got for your kid.",
            "I only feel sorry for that guy’s son.",
            "This was a great story, but for the life of me I can’t fathom paying so much for a bloody Funko Pop.",
            "does store have a website?",
            "It’s rare I save a MC post but this one so deliciously shows a perfect example of textbook instant karma. Thanks for sharing OP and I wish you and the store well. I bet it was even more satisfying in person.",
            "I don't know why but story's like this, is what makes me the happiest",
            "Reading this made my brain happy! What a great story, I wish I could have been there!",
            "I'm not into anime/manga as I once was, but I need to know your stores' name and location now.\n\nI would frequent it as much as possible, even if just online.",
            "What is your store called? If I ever want to buy anything anime/geeky I’ll visit your store!",
            "I seriously don't get the appeal of those things. To each their own, but  no matter how into something I am, I wouldn't want a bunch of ugly dolls of that Fandom just sitting around my room.",
            "I worked for a store that sold funko pops and we were *never* allowed to hold chase figures, that dude lost t big time.",
            "Great story and happy you made out like that.  \n\nDo you sell DnD items?  If so can I get your website?  I’m a new DM and recently started a game.  So I am always looking for new stuff.",
            "Getting his money back is just that dude's ninja way.",
            "Dattebayo!",
            "Wow. That was stupid. He had no idea what he just lost. His son will probably try to kill him for that, or at least be a little terror for a long time in anger.",
            "If it were me, I'd have paid the money, then immediately asked if you'd buy it back for whatever 1/3 of your sell price was. Would have walked out with a few more dollars, and you'd have still made a profit. I just can't imagine being told I would only pay retail on something that sells for 10x that and the shop not be willing to make some sort of deal on the spot.",
            "Does it count as idiot tax? In this case $145 on a $5 money earned back",
            "In all honesty it’s ugly as shit, tho nice to see him regret his decision.",
            "Sounds like that guy was pretty down on his luck, and though it's not right to be a jerk to his son or anybody else, you just never know what a man's going through. \n\nMaybe he really could've used the money and couldn't believe how shitty his luck is and simultaneously how stupid he was. Why would you lie? How did you make a website just to lie and get 10 bucks? \n\nThe dumb ones always seem to be unlucky for a reason.",
            "TIL people pay exponentially more money for differently coloured plastic tat.",
            "You might want to look at your deposit  policy.  Most places give you a short amount of time to cancel and after that the deposit is not refundable.",
            "this sounds crazy. seems you are spending too much mental energy on every item you sell.",
            "I'm confused. So you can buy a special one (plus 5 normal ones) for $90 and sell the special one for $120? Seems like a busted method to get free money and figurines.",
            "some people are unironically buying funko pops lmao",
            "[deleted]",
            "You might have just helped that guy torture his child.",
            "How do you know which boxes have the special version? When I've seen this sort of random thing in figurine boxes and such in the past it's always been a mystery until the box is opened.",
            "The way the guy felt about not wanting that yellow thing, that's they way I feel about Greenlight chase pieces, like they make the wheels green and all that, makes them look jank. Hot Wheels super treasure hunt are well better with their special paint jobs and rubber wheels. Don't understand why companies make their chase pieces look worse than the normal one.  \nNice story anyway, did the kid really come in and buy in front of angry dad? I have a feeling you made that bit up, if you did you're forgiven made for a better end, lol.",
            "Just came here to say that there was nothing malicious here.",
            "Perhaps a compromise would have been offering some store credit on top",
            "Comic Book Guy uses his powers for good.  I like it!",
            "I need to go there. Where’s your store?",
            "Just wanted to say thanks cause now I know these exist!",
            "Back when the Harry Potter on the broom Funko was a convention special, my local Hot Topic got one and held it for me - for a week before they had to sell it. \n\nHowever. That week was the week my dad died, so I hadn’t been able to make it in to Hot Topic for various obvious reasons. \n\nAnyway. I went in a couple weeks later on the off chance they might still have one and asked. They said no and explained that they’d held it for me but since I hadn’t come in they had to put it in the floor. Which was policy. I understood and explained why I hadn’t come in. They felt so bad, which was nice, and the manager let me use her discount on the two I bought that day - the chase variants of Dipper and Mabel from Gravity Falls. \n\nI still don’t have the Harry on the broom. Maybe one day.",
            "Man, I wish I could come to your store just to support you after reading this. Love POPs. I would have been thrilled to get that Naruto variant!! Good luck out there!",
            "\"This yellow thing\" v_v Bijuu mode feels bad man",
            "You can't save stupid people from themselves no matter how hard you try.",
            "I feel bad for the kid.  I hope the guy didn't tell him the whole story, but he sounds like the sort to do just that to \"punish\" his kid.",
            "You speak (write) very good English for it being your second language (I'm guessing). Just so you know the past tense for leave is \"left\", not leaved. I enjoyed your story",
            "Golden",
            "reminded me of the Family Guy episode where Peter fucks up the “ Cheesy Charlie's ”reservation for Stewie’s birthday-\n\nPeter says “good luck getting someone to fill the spot” (paraphrasing) - immediately dozens of people start throwing money at the manager.\n\nhttps://www.youtube.com/watch?v=I4ouCTfoJPY",
            "OMG!  Good on you for not doing what a lot of places do and keeping the Chase variants to sell at a higher price.  We have ordered so many Pop figures (probably about 430 if I had to guess) and have never gotten a Chase variant at all. Makes my heart happy!",
            "I’m sorry but you were a little too nice. Wish we could donate to the store or something.",
            "You gave him way too many opportunities to change his mind. If I were into the stuff you sell, I’d definitely come to your store.",
            "I work in retail and we sold so many funko's during Christmas.  I see it all the time in my store tho.  Parents without a clue bc they don't seem to care what their kid takes interest in."
        ]
    },
    {
        "post_id": "ug4uoe",
        "author": "None",
        "title": "You are NOT allowed to work from home.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ug4uoe/you_are_not_allowed_to_work_from_home/",
        "score": 14789,
        "num_comments": 364,
        "created_utc": 1651426224.0,
        "selftext": "This was 2018ish; pre-pandemic. \n\nI was working at a nuclear power plant in the mid-Atlantic. Once or twice a year we would get a heavy snowstorm, but we were far enough south that the local government wouldn’t plow or salt anything other than the main roads. The power plant has a “policy” during inclement weather that no matter how long it takes you to get to work if you make it in you get paid for the day, otherwise you have to take vacation. Note: I, like a majority of my coworkers, live in the closest large city which is an hour away. The drive to the power plant is 1/2 interstate, 1/2 hilly, curvy country road.  \n\nI wake up and see we have about 10” of snow over night and text my supervisor to ask if I can work from home; I have my laptop with me, don’t have any work going on that I would need to be inside the power plant, and I’d mostly be reviewing paperwork anyway. Supervisor tells me the “policy” for inclement weather and that he was at work already and the roads “weren’t that bad”. I reiterate that I would just be sitting at my desk doing paperwork when I eventually get in. He is hearing none of this and tells me I am not allowed to work from home. I need to drive the 50+ miles to work or take vacation. I didn’t even bother to respond and decided take the vacation day. I head to a local store about a half mile (0.8 km) away and pick up some snow sleds. I’d like to note that the roads were bad, I was driving a 4x4 and had some trouble getting to/from the store. \n\nThe wife and I do some sledding in the neighborhood, have some hot chocolate, and other classic “snow day” activities. \n\nAround 11:00 I get a text from my supervisor, “OP, are you able to come in to work, hardly anyone showed up because of the snow. There is some document we need reviewed. And we really need you here in case we need someone to do something in the power plant”. I tell him sorry, but I’m taking vacation today, per the “policy”. He tells me he’s emailing me the document to review and he can sign it for me if I approve. I replied, “I’d take a look at it if I could, by my supervisor told me I wasn’t allowed to work from home”. \n\nHe never responded to that and I never heard anything else about it, but I didn’t have to work that day, which was nice. \n\nBonus MC: I am a salary employee, but have to record hours worked in a computer program. Our real HR policy says, “if an employee works any part of the day they will be paid for the whole day”. I put 10 minutes of “work” time in for the time I was texting with him and didn’t record any vacation hours. He approved my time sheet for 10 minutes of work and I saved a day of vacation.\n\nEdit: [Mid-Atlantic](https://en.m.wikipedia.org/wiki/Mid-Atlantic_(United_States))",
        "permalink": "/r/MaliciousCompliance/comments/ug4uoe/you_are_not_allowed_to_work_from_home/",
        "comments": [
            "[deleted]",
            "I simply cannot fathom people that seem to be unable to think beyond the letter of a policy… and I simply cannot stand people who seem to be unwilling to think beyond the letter of a policy.\n\nExcellent MC, it is good that you did not give in when they called you! 👍🤠",
            "\"*I * got into work, why can't you?\"  Sometimes that backfires big time. The county that I live in is much longer north-to-south than it is wide. One time the school superintendent (who lived in south county) looked out their window and saw only rain, ignoring the weather forecast calling for snow & freezing rain in north county. School was not cancelled nor was it dismissed early. Several schools that were hit the worst had teachers and students stranded overnight in the classrooms. \n\nNow school is cancelled at the first sign of a snowflake.",
            "We have a rule that absolutely protects vacation time. \n\nIf you are called into work *during* your vacation you are given an additional week of vacation at a later date. It’s a great policy as it keeps the employer from bothering people for no reason, it provides a previously agreed upon *emergency* contingency, and it makes everyone kind of hope it could happen on their quick little vacation.\n\nIt’s a win all the way round and has only happened once in the last 25+ years.",
            "I worked in a computer lab where 100% of our work was done on software in the cloud.  \n\nWe asked several times pre pandemic if we could work some days from home, because commuting to the city was expensive and took a long time.  They were adamant it would never happen.  They said it “COULDNT” happen because of this that the other\n\nMarch 2020?\n\nEveryone was working from home within less than a week.\n\nI hate corporate culture.  I hate companies.  I hate how awful they are for no reason.  ITS ALL ABOUT CONTROL",
            "I was hoping this was going to be the OP actually driving to work and getting there in the afternoon sometime. Meaning that rather than getting 8+ hours of work out of them working from home the company had to pay a full day for them only working a couple of hours. \n\nThe real story was so much better.",
            "> Our real HR policy says, “if an employee works any part of the day they will be paid for the whole day”.\n\nGood on your HR for doing that. I worked at an org where, during newhire orientation, HR got in front of the newhires and said this exact thing.\n\nDid some employees abuse the policy? Yes.  Did they also get passed over for promotion or put on PIPs because of shitty performance (i.e. not getting their work done)? Also yes.",
            "Had a director say that I'm not allowed to work from home a couple years ago too. I am in IT and development, so this wasn't sensible. I also preferred to work from home while sick, mostly because I was struggling with sorting out digestion issues at the time and it's better for everyone that I'm working but not monopolizing the restroom.\n \nAnyhow he was a hard line, if you're home you're not to work and if you're sick you're not authorized to work. This is a decent policy imo but it needs flexibility...\n \nOne night I was in bed, heard a noise. Dogs went nuts. Got up to look. Nothing was amiss so I went back to bed, only on the way back I walked full stride barefoot into a 25lb barbell. Broke the everliving shit out of my toe.\n \nI dunno if you've ever broken a toe but let me tell you how fun it's not. Once you've stopped cursing and hobble to the ER your foot is gonna be swollen and purple... Your shoe will not fit and your toe is probably gonna end up taped to the toe next to it for a couple weeks.\n \nObviously the next morning I called in and said I'm gonna need to work remote because I legit can't drive let alone put a shoe on.\n \nNope. Denied. Take a sick day.\n \nI protested that it's gonna be at least a week before I can even fit my foot into my shoes. Nope, take sick time. Not allowed to work.\n \nOk then.\n \nA couple hours pass and HR called me for help with an IT issue. Apologized and said I'm not allowed to help because I've got a broken toe. She WTF'd so I explained. Also explained that it's going to be at least a week before I can drive. \n \nPolicy got changed right quick.",
            "My town was notoriously bad about snow removal, especially on the mountain where I live.   I was a salaried employee of a consulting company.   I worked at a client site where my employer billed $65/hour for my time.  \n   \nAs winter approached I went to my manager and told him that I wasn’t going to risk my life driving to my client site when the weather was bad. The client would let me work from home,  \nbut wouldn’t pay the telephone charges to dial into their system. (This was before high speed internet was available).  I said that if our company would reimburse me for the $35 telephone charges, I would work from home on snow days.  He bucked it up the food chain and it was denied.   \n   \nOK.  On the days when I decided it wasn’t safe to drive I stayed home and used one of my personal days  \n   \nLet’s review.   Under Plan A I get my normal day’s salary, my company gets $520 in revenue less the $35 for my phone bill. Under Plan B, I get my normal day’s salary and  \nmy company gets $0.",
            "\"You are not allowed to work from home!\"\n\nNarrator: *TWO HOURS LATER*\n\n\"I need you to work from home.\"",
            "I did something like this with a previous job, but it technically wasn't MC. The entire city was shut down by some huge blizzard. One of the higher ups send out an email saying \"the office is open\". Nothing more than that but I took a chance that no one who would check on me was in that day. I worked from home, but because work from home needed to be approved a week in advance, I technically wasn't allowed. I still put down that I worked that day and no one questioned me on it",
            "A complete lack of flexibility is the key to success in business with a happy workforce.\n\nSAID NO-ONE EVER!",
            "At my work (salaried physician) we had a bad snow storm some years back. They said if we didn’t come in, we would have to take a vacation day (this even though the office was closed)… but we were also expected to cover our messages from home during that “vacation” day. I drove to work to sit in the office doing the exact same work I would have done from home. Since we are normally not paid for doing that work, which is almost 50% of the job, I was pretty pleased. And all I had to do to get paid was risk my neck!",
            "I'm on the West coast. To me, in the \"mid-Atlantic\" you find ships and boats, but no cities, or roads, and no nuclear power plants except on submarines. At first I thought OP worked on a sub.",
            "Love it, I hate stupid policies and the managers that follow them blindly.",
            "Thats probably the best part of our union, if we say the roads aren't good we aren't supposed to show up and we aren't docked",
            "Chef's kiss at reading how answering and replying to a text saved a whole day's vacation time.",
            "\"There is hell out there, you gotta burn a vacation day if you don't come.\"\n\nBoy, am I glad I don't live in a country were that's a thing",
            "Boss” take your laptops home there’s a big storm comin. Be safe and I’ll see everyone Monday. Wear your PJs inside out and flush an ice cube down the toilet. Schools will probably close”",
            "Omg that bonus MC is juicy! I bet that shit keeps him up at night.",
            "Similarly, if I get called outside of hours it's an immediate 2 hours guaranteed. Whether it's a mistake or not I put it in every time.",
            "We had a lot of ice, for Texas, and if nobody showed up we would all get a bad weather day. One pinecone drove more than 20 miles on a frozen highway just to be the only one and had to go back home. Ruined it for everybody else",
            "> I put 10 minutes of “work” time in for the time I was texting with him and didn’t record any vacation hours. He approved my time sheet for 10 minutes of work and I saved a day of vacation.\n\nThat's hilarious. Real life Vogons 🤣",
            "I’m guessing Calvert or Anna.  Maybe Surrey",
            "Upper management really should fire people managers like that.",
            "From someone in the same industry it sounds like crappy safety culture. Plants love to have their staff on site but not enough to build attractive housing or roads next to it.",
            "I got a 4x4 in ny, 10” of snow ain’t making it hard to get to the store.",
            "I would have showed up around 4:30, made a fresh pot of coffee, and turned around to go home.",
            "When I was about seven months pregnant we had a strong thunderstorm and the roads were flooding (Houston). I called my boss who said the roads weren't bad on his way in (from the same suburb) and he really needed my help that day so I really should make it in. I drove in and it was flooding so badly that I was grateful I made it. When I got there he wasn't in our office. He called me at the office and when I answered he said, \"Oh good! You made it in! I'm taking the day off because the weather is so bad that school is canceled and I'm home with my kids. I needed you to go in so there would be some department coverage.\" So he lied to me that the roads weren't too bad because he never actually left his house. I was seven months pregnant and he had no issue risking our lives. His wife also went to work that day while he stayed home with their kids. 😂",
            "It took me a while to find out \"mid-Atlantic\" is some American term and not Azores or some other actual place in the Atlantic lol",
            "Jon, is that you?? \n\nAlso nuclear here, and kudos for fucking the system.",
            "Our business got hit with a ransomeware attack a couple years ago. I walked into the building and two managers walk up and say \"Is your computer on?\" I reply, \"No, It rebooted and didn't get past bitlocker on Friday due to an update.. what's going on?\" \"Don't turn it on.\"\n\n&#x200B;\n\nSo we sat around gossiping, trying to figure out what happened until we found that a different office clicked on a link, the malware flooded the network and spread across the north american domain controllers and offices.\n\n&#x200B;\n\nPaid in full for about 2 weeks worth of no work (I ended up getting voluntold to help with the imaging of machines to wipe the infected machines so I at least was productive somewhat) while they got our office back up and running.",
            "What was the aftermath of this?",
            "The best one",
            "I never thought I'd be alive in a time where stories would start with \"pre-pandemic\", these last years have been.. special.",
            "> I’d like to note that the roads were bad, I was driving a 4x4 and had some trouble getting to/from the store. \n\nGoes to show you that having good winter tires is at least as important as 4x4...\n\nMid-Atlantic, it might not be worth it, but here in New England it is... The only real cost is the wheels, every mile I put on my winter tires is a mile I don't put on my summer tires, so it all works out... On a truck ( which I assume you're driving ), steel wheels ( steelies ) are inexpensive... My tire place swaps my winter and summer wheels for free ( I give the guys a tip, but it only takes them 10 minutes ).\n\nIf winter temps stay below 50, winter tires might make sense...",
            ">\nI was working at a nuclear power plant in the mid-Atlantic.\n\nThey have nuclear power plants in the middle of the ocean? Like an oil rig?\n\n>local government wouldn’t plow or salt anything other than the main roads. \n\nWait, now's there's a main road leading to the middle of the ocean?\n\n>I, like a majority of my coworkers, live in the closest large city which is an hour away.\n\nNevermind. I guess my interpretation of \"mid Atlantic\" has nothing to do with the MIDDLE OF THE ATLANTIC",
            "Are you sure the HR policy says that it only counts non de minimis time?  The ones I normally sees says that and your texts are 100% that.\n\nThey could just have missed it or not cared.",
            "\"Boss can I do X?\"\n\n\"No you have to do Y\"\n\nOP does Y\n\n\"\"\"\"Malicious compliance\"\"\"\"\"\"",
            "I’m gonna guess the Dominion Nuclear plant at Lake Anna",
            "Long time lurker on this sub.\n\nDespite your malicious compliance, it appears your supervisor tried meeting you in the middle albeit after they realized there was a serious problem that could have been prevented.",
            "OP, are you from Pittsburgh?",
            "Duke or Dominion?",
            "> I was working at a nuclear power plant in the mid-Atlantic.\n\nMeans something very different to everyone else in the world, unless you're Ernst Stavro Blofeld or Dr Julius No. In which case the images it conjures are pretty much right.",
            "Sounds like Shearon Harris nuclear plant.  Not sure if NC is considered \"mid-atlantic,\" but I can see how it would be considered.  It's also the fact that inclement weather preparedness is as he describes; that's the difference between NC and VA if I had to guess.",
            "Why don't you tell these good people of reddit how much money you make and how many paid vacation and sick days and holidays you get every year while you're whining about having to go to work OR take a vacation day?????",
            "It is INSANE to build a power plant that is accessed by a \"steep, curvy country road\".\n\nAside from snow storms, how many other contingencies might require emergency access?\n\nWhy did they not have a contracted provider to keep the road clear from interstate to entrance?\n\nWhen I'm asked why I don't support nuclear power, this adds another arrow to my quiver.\n\nThat this existed for one moment is outrageous and proof that it is failure to imagine contingencies that opens the gates to real catastrophe.",
            "I didint know that they build power plants in the middle of the Atlantic",
            "> a nuclear power plant in the mid-Atlantic\n\nErm... I'm going to guess that this isn't literally in the middle of the Atlantic ocean. The only landmasses in the Atlantic are very small and not exactly known for snowfall.",
            "Hold up a second here, are we just ignoring the fact that your work at a NUCLEAR POWER PLANT if in the mid-atlantic. The middle of the atlantic ocean? Question 1 - why? Question 2 - how?\n\n\nEdit: looked it up and Americans think that mid atlantic means some states in the north ish of the us. Despite the fact that that is quite clearly the west of the atlantic and nowhere near the middle. Seriously people, if you're going to name a place in reference to it's location to another thing, pick up an atlas before you do it.",
            "Susquehanna?",
            "Fucking boomer mentality.",
            "That was a shit read.",
            "Helps to know the rules.  Good for you.",
            "Good for you. It's been years and I'm still dealing with the injuries I suffered during multiple car wrecks being forced to commute during harsh winters.",
            "lake Anna nuke plant?",
            "Peach Bottom?",
            "Knowledge is power, and in this case, money.",
            "Love that bonus mc.",
            "Administrative phone calls have made me alot of money.",
            "Sounds like North Anna.",
            "Noice",
            "I see you work at Lake Anna",
            "I had Covid early January, asked if I could work from home.  Boss was like, \"No, you can't have access to all my company info from home.\"  I was like, \"I created all the stuff you use, data bases, CAD, CAM, POS system, g-code.\"  He was dead serious about me not having access and stealing his operation.  He does not realize I can make it all again, since I made everything to begin with.",
            "The story didn't turn out how I expected.  I was sure you were going to show up 10 minutes before close of business, get your credit for showing up and then just head home.  Though you kind of did that, just in a nicer, safer way, I suppose!",
            "I love that you got the 10 mins of work that way. If it were me I would have sat at home most of the day. Then load up the truck to go sledding with the wife, but make a pit stop at the plant to \"work\" for the last 10 mins then leave to go have fun. If they ask just say the roads were bad and I got here as soon as I could. Middle management is the worst 😅",
            "Yeah, this didn't happen.",
            "Could you explain to your international readers what you mean by \"in the mid-Atlantic\"? It's obviously not the ocean."
        ]
    },
    {
        "post_id": "aoxnpo",
        "author": "SqueekySea",
        "title": "My dads girlfriend has a wrist tattoo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/aoxnpo/my_dads_girlfriend_has_a_wrist_tattoo/",
        "score": 14742,
        "num_comments": 709,
        "created_utc": 1549751917.0,
        "selftext": "My dad’s ex girlfriend had a wrist tattoo and recently got a job. She was told to cover up the tattoo because it ‘violates God’s image of a woman’. She tried covering it up with makeup but they said that the different tone of the makeup made it more obvious. They told her that she had to find a way to cover up the tattoo cleanly or she would be fired. Keep in mind she works in a building where she is never seen by the customers. She just answers phone calls and writes messages for people. \n\nSo she tried putting a bandage on it. They said that made the area look like she had tried to slit her wrists and told her to find another way. So finally she comes to me with this problem. \n\nI’m very petty. And all for taking things literally. \n\nSo I ask her, do you have any bracelets you could wear to cover it up? She brings out this box full of the noisiest metal bracelets I’ve ever seen.\n\nSo the next day she goes to work and both of her wrists are COVERED in these bracelets. You can hear her coming from a mile away. \n\nHer boss told her she could expose the tattoo.\n\nEdit: I should clarify, this is about an ex of my fathers. This happened about 3 years ago.\n\nEdit 2: For those of you wondering, the tattoo in question looked kinda like [this](https://i.pinimg.com/236x/2b/8e/fd/2b8efdea99c751738b853c6b997b8508--rain-tattoo-umbrella-tattoo.jpg) with just some slight differences.\n\nEdit 3: Last one I promise! I’m reading through all the comments and I’m loving all the civil discussion and trading of knowledge and research that this post has generated! Honestly learned so much just by reading the comments 🥰",
        "permalink": "/r/MaliciousCompliance/comments/aoxnpo/my_dads_girlfriend_has_a_wrist_tattoo/",
        "comments": [
            "My English 2 teacher back in high school has something similar happen because she had the names of her children tattooed on her wrists and one foot (three children, one for each spot.) The school had made her use bandages at first but her kids were understandably concerned, so by the time I had her she was free to show her tattoos. \n\nWhat is up with you people who don't believe that the OP's story happened? I'm not sure why or how it seems fake. ",
            "I used to work for an attorney who didnt like tattoos. She had me doing the first round of interviews for a receptionist and a girl came in with a nose stud and a couple of visible tattoos. Definitely alternative but nothing offensive and her resume and cover letter were great. A minute into our fifteen allotted minutes my boss  calls the conference room line and tells me to get her out. It was super awkward and I felt like it was very rude but I got her out quickly. My boss told me absolutely no visible tattoos. \n\nWe ended up hiring an absolutely wonderful lady. A few weeks after she started I happened to notice a tattoo on her wrist, partially covered by a bracelet. I took it as a very small and petty victory over an upright boss.",
            "As someone with a wrist tattoo - try a watch or FitBit band. I hid my tattoo from my mother for 5 years. ",
            "I used to have to cover a tattoo on my upper right arm when I worked in a spa. I started with a tube cloth bandage, which I washed regularly, but it was cutting off the circulation in my arm while I was doing intense massage, and manager complained when it started looking a bit ratty, so I swapped to a plain white sock with the toe cut off. I would buy multipacks of white socks and leave them behind the reception in the spa so I could replace them as needed. \n\nRegulars started noticing that I constantly had this thing on my arm and expressed their concerns at me doing a lot of massage work when I had what looked to them like a long term injury, so I ended up telling most of them the truth about why I was wearing it. Most clients don't care if you have a little ink. If anything, a lot of them asked to see it, and told me it was nice, and didn't understand why I had to keep it covered. Manager never budged on the cover up, but she had no choice but to let me show off the little one on my hand, because makeup and plasters don't survive a day of massage oil, body scrub and facial products, and gloves don't feel good during massage xD ",
            "Buy her some of those fabric sleeves that make it look like your arms are covered in tattoos",
            "Sounds like a dreadful place of work. ",
            "I just started a new retail job a few months ago with a no visible tattoos rule. My store manager doesn't care so I only have to worry if the district manager or anyone else from corporate comes in. Right now I throw on a sweater that covers my wrist but im not sure what I will do once it gets too warm for that in the summer. My tattoo by the way is an outline of a cat silouette, not offensive in the slightest. So dumb. ",
            "What country is this in?",
            "You're an amazing ex-step-kid. Hope she treated you well while she was in your life! ",
            "I worked at Starbucks years and years ago...no visible tattoos rule in effect.\n\nWe used to have coffee stickers (who knows, they may still?), just a little bit bigger than a large postage stamp...and just big enough to cover the tattoo I have on the inside of my arm near my elbow.\n\nI used to put a sticker on my arm every time I worked.  I called it extra advertising.",
            "Ah yes the days I had to wear bandaids over my piercings and had to have my hair normal colors. Now everyone is tattooed up and down & rainbow hair. I was born a generation too late :/",
            "I'd have told them to shove God's image of a woman up their 'holier than thou' arse",
            "My sister did the same thing! She was a cashier, and the only time people ever commented on her tattoo was to complement it. Corporate rolls around, says to cover it, so she goes to the dollar store and buys dozens of annoying bracelets.",
            ">She was told to cover up the tattoo because it ‘violates God’s image of a woman’.\n\nJesus, that's stupid.",
            "In Australia it's illegal to fire someone for having tattoos that aren't offensive or on the face/neck. It's harder to get a job, sure, but you can't be fired for having them. ",
            "Whoops, wall of text TL;DR at bottom.\n\nI worked with elderly, I had a co-worker covered with tattoos.\n\nFingers, hands, full sleeves, throat, neck etc. built like a tank.\n\nWith other words a person that you'd see riding a Harley with a patch on hes back (well he did that too) and not someone working with old folks.\n\nHe was the favourite among the elderly, he had the the perfect personality, kind, caring, could handle the stress.\n\nBut the tattoos, they *loved* him for them, one lady opened up directly to him, started talking about a sailor she had dated in the 30's, the men were eager to show their anchors, stick and pokes etc.\n\nA (load) of tattoos doesn't make you a bad person.\n\nI should note that I live in Sweden, so the same rules as in USA doesn't apply. We don't have the same stigma around tattoos.\n\nPs. The lady had dementia and was miserable, sat in a corner and didn't want to talk to anyone before he came there.\n\nShe was clear enough to *know*  she had dementia.\n\nTL;DR: A dude covered in tattoos saves the day in a home for elderly.\n",
            "\"She was told to cover up the tattoo because it ‘violates God’s image of a woman’.\"\n\nYikes, what the fuck...",
            "This happened to me at two different jobs after college. They had me put giant bandages over each wrist until too many people were worried I had tried to off myself. Didn't have to wear them ever again.  So dumb.",
            "As someone who is currently studying Bible/Theology for a B.A. , it;s always annoying/funny to hear people complain about tattoos and argue that it's \"ungodly.\"",
            "In high school in of the girls I knew had a tattoo of a cross on her ankle. She worked at the YMCA. They made her cover it with makeup every day. I guess it detracted from the image of the Young Mens *Christian* Association? ",
            "I've only ever had issues over my tattoos once. As soon as I asked if there was a problem with the colors of my skin, they stopped immediately.",
            "Sounds like her boss was a misogynistic shithead",
            "Hell yes.  Put on a cuff with bells :)",
            "I have tattoos on both my wrists and people hardly ever notice them. It took a few years for people to mention them at my last job. I really don't think tattoos are that big of a deal anymore. There's less negative connotation behind them. 🤷",
            "2019 and there are still businesses who judge employees by completely harmless and non-offensive tattoos. Jeez.",
            "When I was about 18 I asked my boss at the grocery store if I could get my lip pierced. They said sure, as long as you find a way to cover it up, maybe with a bandaid.\n\nI went out and got it pierced and then came to work with a bandaid over my face. Customers were sorta concerned why I had such a big bandaid on my face and was working with their food. My manager comes and says, yeah you’re going to have to take that out this isn’t working like I thought. I said no way now I’m out 50 bucks (which was a lot of money, to me back then). I’m not sure why they didn’t just up and fire me (possibly because we were union) but I had my lip ring the rest of the years I worked there.\n\nAlso one time I went to a job interview wearing short sleeves. I have a tattoo on each wrist. The very first thing the lady said to me was, we don’t allow visible tattoos. Needless to say, I didn’t get the job.",
            "Pretty sure “violates God’s image of a woman” violates sexual discrimination policies regarding to employers.",
            "i thought she might try to wear a burka.  let them see if that is god's ideal image of a woman.",
            "I hate when people mix religion and work. I personally feel like religion should be something that's private and not forced upon other people, especially those under your payroll",
            "My wife has tattoos on her wrist and forearm which also has to be covered. She is an emergency dispatcher and sits in a room no one can see and has zero face to face interactions with the public.",
            "It 'violates gods image of a woman' omg get fucked",
            "That company is full of prudes!",
            "I have tattoos on both of my wrists. When I first started my job no one cared, then the policy changed. One is easily covered by a watch, the other is a half sleeve and required an arm sleeve to cover it. \n\nLiterally every single client who saw me with the sleeve on asked why I had it, and then asked to see the tattoo. They all then said how beautiful it was and it was silly to have it covered. ",
            "Had a friend who worked at a girl scout camp and was told she had to cover her tattoos and if any of the girls asked, she was to tell them they were a mistake. In this day almost everyone has one, so that just seemed silly. ",
            "[deleted]",
            "I'll never understand this rule. I don't have tattoos,  didn't grow up around anyone with tattoos, you think I would be in the \"offended\" group, but what sort of reason is there to be offended? \n\nI get gang related or discriminatory (swaztica, racial slur, etc.) related tattoos but if we are banning self expression we may as well make everyone shave bald.",
            "I don't get why businesses want tattoos covered up, unless they promote discrimination or hate speech. I had a teacher who had been in the military before being a teacher and he had several tattoos to signify some of the things he had done, all in service of our country, yet he had to have them covered up.",
            "People give California a lot of shit (often fairly), but I've sern people with face tattoos working retail and no one cares. I once saw a dude in a very nice suit coming out of an office building with a mohawk at least 12\" tall, apparently it's not an issue for him. People have mostly gotten past that sort of nonsense here. ",
            "I like it! ",
            "Any company that would fire someone for nit being \"Gods image of women\" should not be in business this century. ",
            "if an asshole tried to do that to me i'd print 10,000 copies of leviticus and paste them everywhere.   those cocksuckers are breaking every rule in the book. ",
            "I don’t know if anyone has asked, but what was the tattoo? ",
            "Is that legal where you are? Also, there's been a whole other Testament since all that Deuteronomy hard ass BS, if none of the locals have noticed. ",
            "Wonderful plan !!!!",
            "Solid MC - a small tattoo is much less annoying.\n\nAlso I'm curious, did she have a dress code that only let her wear short sleeves?\n\nWhen I only had a wrist tattoo, I would still wear a light cardigan to work because full sleeves were the only thing that fully covered it.",
            "In my nursing class, this girl had something very tiny on the back of her neck and her arms. Teacher didn’t give her permission to wear long sleeves under the uniform, so she had to stick bandaids all over every day. \n\nShe’s allergic to latex. ",
            "If your body is a temple, then tattoos are just a little stained glass",
            "“God’s image of woman”\n\nNow that’s a new one I haven’t heard!",
            "Im glad ive never experienced this in Canada. Its commonplace to see goverenment officials with sleeves. I have a sleeve and most of my legs covered. Never had an issue with it.",
            "Jesus got pierced didn't he?",
            "This is why I keep all my tattoos on the trunk of my body rather than places that could be exposed.  I love people's tattoos and I want them to be more accepted in more companies... but I also know that I may end up being discriminated against for those tats.. it sucks, but for me, it isn't a hill I want to die on, but fully respect those who do.",
            "I hate super religious people's actions like this (the wording there was weird, but what I mean is I don't like the way they act)",
            "People need to wake up. It's not the 1830's anymore. Normal ppl have tattoos and they don't mean your weird or a criminal.",
            ">violates God’s image of a woman  \n  \nGeez and i bet the person saying that has pierced ears and is wearing at least 2  different fabrics of clothing",
            "That’s against Gods view of women? Does she work with Religious people in a heavily male dominated field, where all woman must be covered from the neck to the ankles, and address any male as their superior?",
            "Where do you live that an employer can impose their religious interpretation of their view for women on employees, but a woman can also have a job and tattoos? That's really beyond messed up.",
            "What about an arm band like athletes use...it could be just a small quarter sleeve instead of a bandage. Like [this?](https://i.imgur.com/qIUJyoU.jpg)",
            "I have had similar experiences involving tattoos and workplace policy. Thanks for sharing, OP!",
            "I just wrapped bright ass colored Coban around my wrist ",
            "That tattoo appears to be a coverup for a suicide attempt.",
            "Gods image of a woman has her being used as a submissive one of potentially many concubines so really some art is the least of her problems",
            "I’m pretty surprised by all of these comments, y’all had to know when getting your tattoos that employers have the right to make “no visible tattoos” part of the dress code, which a majority of them do.\n\n\n\n\n\n\nI’m saying this being someone with tattoos I wear long sleeves for everyday. I knew this when I was getting my tattoos. I do think it’s silly if you’re not facing customers everyday (I am someone in that boat) but rules are rules. ",
            "I've been why my company for 10 years. When I started the were no visible tattoo, artistically dyed hair, long facial hair, leggings, wedge shoes rules. Now I see all of those things. I don't think the official policy has changed, but nobody really cares. Talent is talent.",
            "in my country (austria) if someone fires you with the reason „violation of gods image of a woman“ you and your company would get sued into oblivion. it would be covered in all of media and you really would need to hide from the public.\n\nyou americans with your religion are a silly thing, i am glad you treated us like you did after WW2 (not that it wasnt purely a strategic decision, nevertheless) but holy moly, you got pretty retarded along the way",
            "18 year old me did this working at Jamba Juice. I covered my wrist tattoo with a bandage and splashed it with raspberry concentrate to be a brat, that lasted about a week. Then I ended up dating my boss and the tattoo wasn't a problem anymore haha",
            "In my opinion, telling someone to cover their tattoos because of any reason is extremely disrespectful, especially in a work setting. Tattoos have literally zero effect on how you do your job. The whole idea of covering tattoos at work is because they're associated with \"degeneracy\" or the person hiring you doesn't like them, but that is subjective and in a work setting, decisions should be objective. Like, can you do your job or not. Some of the smartest people I know work with tattoos at top companies (Google, Facebook, etc). The rest of the world needs to get with the times.",
            "I'm from Rome, Italy, where the Vatican city is, and we don't threat people like that for a tatoo. I guess somebody thinks to have more power than the fcking head of the Church.",
            "Here’s what I don’t get about workplaces like this  is that any attempt to cover just Brings more attention to it.  I used to work at a coffee shop that had the same policy and most staff wore bandages to cover them. Like you said for a wrist tattoo it makes it look like you’re covering self harm. Customers would ask all the time(especially new customers) what happened. It was the most distracting policy ever and the continued conversations assuring customers they were ok just made transactions take longer. ",
            "I wonder if these . . . people . . . would insist that a Holocaust survivor cover the telltale tattoo.",
            "I love that tattoo... You did good with the bracelets thing.",
            "When I worked at Disney as a CP I had a cross tattoo on my wrist that I had to cover up. I happened to have a wrist brace for when carpel tunnel acted up, which was seldom, and they made me wear it every. Single. Day.  If my manager wasn’t paying attention I would grab a bandaid to cover it. I tried makeup but this was back in the early 2000s before setting powders and sprays and I would get makeup all over my uniform. \n\n",
            "I love that line about marring gods image of a woman.  I should use that sometime on a man and see what reaction I get.\n\n\"Sup bro, did you know that your wicked sweet arm tattoo is disgracing God's image of man?\"",
            "[removed]",
            "It's almost mandatory to have a tattoo here in New Zealand.\n\nEven our police showcase their tattoos. \nOn the NZ police Instagram page.\nhttps://www.instagram.com/p/BKO1PHjA1SQ/\n\n\nConstable Rasau Kalivati is half Fijian, half English. He got his turtle tattoo after his Dad passed away in 2002. It's specifically placed on the inside of his weaker arm to remind him that his Dad is always with him to give him strength in life #NZPoliceInk",
            "I always consider employment when I get tattoos.\n\nTheir sexist/cultist religious reason is strange..but if you choose to work for some religious company then that is on you.",
            "They were upset about it looking like she slit her wrist????? What would they do if someone actually did have a bandage from that?  Wtf",
            "It says she tried putting A bandage on it. As in, a singular bandage. And I just imagine her putting like one diagonally across the middle, the rest of the tattoo perfectly visible and is just like “Yep that works”",
            "Doubtful that, if they used that specific reasoning, it'd hold up in court. You can't really force your religious views on your employees. Some places get away with but it's blanket policies that don't really effect much except being closed on sunday or specifically written moral clauses that give them a lot of leeway. They can easily say they just don't view tattoos as professional and they'd be good but bringing God into just troubles the water.\n\n&#x200B;\n\nEdit: Can't really",
            "Fuck that, that's religious discrimination and she should act on that.",
            "Honestly, religious nut-heads like this piss me off. Why do they care about such small things like tattoos?",
            "How is that shit not illegal? ",
            "How about a simple long sleeved shirt? ",
            "It’s odd that we torture ourselves so\n\nThe only reason we dress up for work and have appearance restrictions is to prevent bad impressions. \n\nThe reason we would form a bad impression is because we expect people to dress up and look like everyone else.\n\nIt’s circular reasoning and we should just stop making ourselves miserable and dress how we like. I think the world has bigger issues to tackle than “Susan has purple hair”.",
            "Someone I know self harms.  She’s in treatment now, but her arms are covered in cuts and scars.  Bad ones.  She’s so upset that no one is hiring her.  Whatever it’s my GF and we’ve been living off my disability check for the last few months.  It’s a hard time to find work, let alone her scares :/  ",
            "Well that is a good tattoo to prevent jobs",
            "I worked at a video store in 2010. It wanted to promote its ‘family image’ so no tattoos were allowed. (Please note that this Midwest video chain has an adult film section). I have a “3” on the back of my neck and 20 year old me decided to get a short bob haircut. They made me cover this tattoo with band aids. I got the most obnoxious bandaids you could think of. Bacon. Sesame Street. Hello Kitty. And then I had to explain the bandage on the back of my neck to customers. It was hilarious. \n\nOh, I was also required to remove my tiny nose stud before my shifts as well.\n\nEventually this place was hit with some class action lawsuits regarding unfair break and clocking in and out practices.",
            "My old female roommate got a neck tattoo, it was a cool tattoo. She’s Native American like me and it was a tattoo of a leaf from a tree Native to us with the Cherokee work for beautiful written inside it. \n\nShe’s a teacher for a well known school in the area for mentally challenged kids and the like. I told her the day she got it she would have to cover it up. She laughed and said no...\nNext day she comes home with a big bandaid over it lmao. ",
            "Curious - what part of the world are you in and what type of company? It’s striking to me that they could give her that much hassle for *that* reason.",
            "Why didn't they just fire her then? ",
            "This happens to me at work, I have a tattoo of a woman with her breasts bare and I work in a daycare. These kids are mostly 2 to 4 years old, so they or their siblings are all six months or so distant from seeing tits every single day, they don't see anything wrong with it, but I have to have it covered up because it offends some of our parents. I've gotten to the point where I just use a black marker to color in the area around her areolas. The kids get scared when they see me with a bandage or a cover up in that area. I told them that some people don't like to see boobies, I'm just being courteous to everybody while I'm around a lot of kids, and if they want to cover it up themselves with a marker they're perfectly welcome. I get my tattoo colored in all the time it's pretty cool",
            "I have a wrist tattoo but live in the UK where long sleeves are appropriate for the majority of the year. I've never been asked to cover it up but will be starting a customer facing job on Monday so that may change. ",
            "Long sleeve shirt?",
            "In the early 90s I worked in burger King and they made me cover my tattoos with blue plasters! \nIn food service I think the blue plasters are much worse than the tattoos! ",
            "That was the only good thing when i worked at target years ago...they allowed tattoos,piercings,colored hair,crazy painted eye brows...did not matter it was ok. There was a guy they really needed to tell to bathe but mostly you didn't need to worry as long as you wore the right clothes. ",
            "One more reason to get my Marilyn Manson cross tattoo on my wrist. Just to piss off people like that. ",
            "I have tattoos on both arms that stop before the elbow. (Left arm has a giant draksign and hunters mark) (right arm is the emblem for all the covenants in the souls games) mind you when wearing a simple t-shirt you can see them but with any form of long or even semi long sleeve shirt they were covered. When I worked in a kitchen they made me wear a chefs coat even though customers would never see me which was fine. Until we got a new manager fresh from corporate who decided to call everyone with tattoos forward and she then gave out these long hot uncomfortable black sleeves and told everyone to wear them. Even though my coat covered my tats she still told to \"wear the sleeves or leave\" I chose to take the high road. I wore them for the next two weeks until I got my new job. Never looked back and I am never working kitchens again.",
            "This makes me glad I work where I work.\n\nWhats even better is I work for my city government in their Animal Control department. Almost everyone who works there has tattoos and display them proudly. Our adoption coordinator has this bad ass full sleeve tattoo.",
            "\"violates God’s image of a woman\"\n\nAh yes, those people... Honestly I never got this kinda thing, my mother is a hardcore christian and even she doesn't give a toss what you have stuck on you, unless it was meant to be offending and awful (like a tat saying \"Fuck you, go die\" or some weird crap along those lines. ",
            "Si.",
            "One option would be elbow-length opera gloves. Of course that means you need to dress to match and act appropriately..."
        ]
    },
    {
        "post_id": "ustpwm",
        "author": "Lifeaccordingtome83",
        "title": "“You can give a dollar off, if it helps you make a sale…”",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ustpwm/you_can_give_a_dollar_off_if_it_helps_you_make_a/",
        "score": 14721,
        "num_comments": 647,
        "created_utc": 1652929148.0,
        "selftext": "Back in the early 2000’s I was a college student working at Blockbuster. At that time, it cost $3.70 to rent a movie, sometimes for just two nights and the late fees were insane as most who were adults at that time remember. 🤦🏻‍♀️ \n\nWe had this barcode on the side of the register we could scan to give a dollar off a movie rental but only when it helped us make “an additional sale”. The idea was to help push the overpriced candy and give a dollar off a movie rental. So Blockbuster started a fundraiser for Saint Jude’s (no incentive at all for employees to get donations, but of course as it was for a good cause I wanted to ask everyone), I got annoyed because people would spend a ton of money on late fees and more movie rentals and crap they didn’t need but I asked everyone on a Saturday night in the busiest Blockbuster in the entire state, to donate and got 2 people, out of several hundred, to donate a dollar. \n\nThe next day, I realized I had to scan a piece of paper so the dollar donation would ring up…hence the donation was technically an “additional sale”, so I started a new campaign of my own…anyone who agreed to donate a dollar to charity got a dollar off their movie rental. For the next 3 weeks until the charity partnership was over, with the customer’s permission, I took $1 off the movie rental each time and scanned the barcode for the $1 additional sale that went right to charity. The customers were happy they could pay the same price and help a good cause and I got to help collect a few thousand dollars for that cause, putting Blockbuster’s own up-selling methods to work against them. 😬\n\n\nEdited to add: This was the early 2000’s when you weren’t asked about donating at every store. I was 18 years old and just frustrated by the lack of donating because I watched so much money wasted on stupid late fees that could be taken off so easily for anyone but you had to complain. I couldn’t fathom why anyone wouldn’t want to help a kid for a dollar. I’m sorry some people see this as thievery and/or don’t understand my frustration. Blockbuster ripped people off systematically and this was my small way as a broke college kid trying to even the scales a bit.",
        "permalink": "/r/MaliciousCompliance/comments/ustpwm/you_can_give_a_dollar_off_if_it_helps_you_make_a/",
        "comments": [
            "Brilliant! And very kind ☺️",
            "Nicely done. That said, I always ask if the company is matching the donations. If it is, then I donate. If not, then I do not. Regardless of the cause. The whole concept of a giant company choosing a charity and asking me to donate, but not matching the donations just irks me.",
            "So, THAT'S why they went out of business. And all this time I thought it was due to Netflix!",
            "I like the malicious compliance, but I'm going to be honest.  I give thousands of dollars in charity every year, but I almost always turn down the \"corporate\" charity.  We get bombarded with \"round up\" or donate a dollar.  And while most are good causes, that's not how I choose to give.  They also may not be charities I choose to support for various reasons.  \n\nSo, continue to use your innovation to improve things, but maybe withhold judgment on people you don't really know.",
            "OH! Now we know the real reason Blockbuster went out of business!",
            "DQ in my area does a \"buy a balloon\" thing (it's a paper balloon) and everytime I went there I was asked to buy one. I was getting annoyed by this and then an employee explained that you get coupons with the donation and you can use them right away. So I spent $3 on a balloon, used a $2 coupon on my blizzard, and had two coupons worth $2-$3 left for a cone or chicken strip basket. If they explain it to you it's a good deal.",
            "I'm one of the people who would have pissed you off. Those charity offers don't go 100% to the people they are supposed to support, the money goes to pay for other things alomg the way. I used to donate to a charity for police officers widows, until I discovered most of my donation actually went to fund the call center, so they could call more people for donations. So now I say no to every spontaneous charity request until I can see the breakdown of donations. Not knocking St Jude's, they are pretty upstanding, but plenty of those \"round up\" requests are not quite what they seem.",
            "Benevolent compliance?",
            "> I got annoyed because people would spend a ton of money on late fees and more movie rentals and crap they didn’t need \n\nOmg people came in to spend money on the things they want from the business and not spend extra money on that business' marketing ploy",
            "Worked Christmas Day in a movie theatre in concessions. Was supposed to ask every customer (in a line that literally never slowed down or ended for 8 hours) if they wanted to round up their change for a children's charity. About an hour in I ask someone if they'd like to round up THREE CENTS for children on Christmas and they cussed me out, hard. I refused to ask anyone after that, didn't want to lose even more faith in humanity on an already rough Christmas 😒",
            "I imagine if blockbuster as a whole did things like that they might have lasted a little longer.",
            "I got hired at blockbuster when I was 18 and told by the manager he’d call me in a few days to let me know what my schedule was. Never got a call and about a week later it was shut down 😂 looking back and reading your story, it sounds like I dodged a bullet.",
            "I hate it when businesses do this shit. I wouldn't be shocked if the actual charity got 10% of those donations to begin with, but also I'm using coupons to save 25 cents, you are a multi million dollar corporation. How about YOU fucking donate instead of trying to guilt us into doing it for you.",
            "A lot of people make their own donations in their own name to get a tax deduction.\n\nIf you donate to a company, the company makes the donation and pockets the tax deduction.",
            "As a rule I do not donate to charity drives. They are simply a marketing ploy by companies that just write the donation off later. Donating directly us a muchore efficient means if donating. You also get to be the one that takes advantage of the write off later.",
            "Awh I miss blockbuster! Thank you for the nostalgic post whole also putting it to the man!!",
            "I dont go to blockbuster to donate to random charities, good move but who cares about donating to your cash register impulse buys.",
            "You can go on and get annoyed, but no, I am absolutely not donating to a corporation's ability to write off donations on their taxes. I think tf not.",
            "[deleted]",
            "I donate to St. Jude's (and other places). I do not participate in these things.  \n\n\nIf a company wants to donate, they can do so with the dollars they already have. I am not going to give them MY dollars so they can (hopefully) turn around and give to a charity and get the write off.   \n\n\nI don't hate children with cancer... I am an adult who had cancer as a child actually.   \n\n\nI just don't want to give big corporations (or small ones for that matter) my money to claim as their own for tax purposes and look like they've done something.",
            "Honestly, things got a little bit better working there by the early 2010s. I would get a lot of snack sales on the $5 bundle we sold (2 20oz drinks, 2 boxes of candy, and a bag of popcorn).",
            "That's why the blockbusters went bust! For scamming people.",
            "You're fired.",
            "I remember when Blockbuster would charge $3 a night for new movies and $2.50 to rent a video game. And you had to return it before 1130 AM or you'd get a full price late fee. Didn't finish watching the movie or play the game very long, too bad. Back in the early 90s I loved that place but looking back on it now, I can't believe my parents actually paid those prices. Especially when we had neighborhood rental places that were so much cheaper.",
            "When time came for Blockbuster to be taken out into the treeline and a Bullet placed in its collective Head...\n\nMany, Many ,Many of us stood and watched as the Red Mist stained the Summer afternoon",
            "I never donate to a charity through a store or site because they get the tax deduction not I.  I realize it may seem cheap to the cashier but the company is getting all the credit for both the donation and the “look at me” publicity.",
            "Those late fees. Man that brings back memories. I had racked up 100s in late fees across multiple Blockbusters. In my area they didn't seem to have any connectivity between the stores so you could start fresh. It was always the same conversation - \"sir, you owe $XX in late charges.\" Can I put $2 towards that? They would always let you go with paying $1 or $2, but what a f'ing racket that was. Glad they went out of business. In 2000, the CEO of Blockbuster Video had the chance to buy Netflix for $50m. Instead, laughed them out of the room. F you BB.",
            "You gave them the jab. Netflix hit em with the knockout combo.",
            "Did you get in trouble at all? I miss the days of waking into a movie store and reading titles. So not the same enjoyment",
            "Omg I love this. I worked for Blockbuster right at the same time you did, and I remember how atrociously bad they managed everything. Customers were angry about fees, but the employees were even more upset about all the crap they had to put up with from upper management every day. Glad you could get a win on them while helping people in need at the same time.",
            "People seeing this as theft are obviously too stupid, or illiterate to read the part where you got PERMISSION from the customer",
            "Is this why Blockbuster went out of business? 😂",
            ">So Blockbuster started a fundraiser for Saint Jude’s (no incentive at all for employees to get donations, but of course as it was for a good cause I wanted to ask everyone)\n\n~~Just FYI, those charity donation events by big businesses aren't really about charity. The whole point is that the business collects the money that people donate, then~~ *~~the business~~* ~~donates the money to the charity. The distinction is important, because it means the business can use those donated dollars to write-off their own federal taxes. Every time people donate at a fast food drive-in or whatever, they are effectively taking money out of the taxpayer's pocket.~~\n\n~~This doesn't mean people shouldn't be charitable, it just means if you want to donate to Saint Jude then do it through their website, not through a business donation drive.~~ \n\nEdit - Upon consulting with BigMikeThuggin the CPA, it appears this is incorrect **:P** Feel free to give to charities through corporate charity drives if you feel so inclined.",
            "I love this.\n\nFWIW: a lot of people don't donate at the register because 1/ they donate on their own already, ~~2/ when you donate at the register the retail corporation accepting the donate gets the tax write-off rather than the actual donator.~~ People also like to research the charity since there are a lot of shady ones out there, St. Jude's is pretty good though. It's my default response because I'd rather donate directly on my own.\n\nEdit: I was wrong about the taxe deductions piece. But practically nobody is claiming those deductions since they aren't likely to keep the receipt. https://www.taxpolicycenter.org/taxvox/who-gets-tax-benefit-those-checkout-donations-0#:~:text=What%20happens%20to%20the%20money,collection%20agent%20for%20your%20gift.",
            "I feel like most people don’t donate through corporations because it’s more beneficial to the corporations than the charity. Why give a major corporation more tax write off when you can just donate directly yourself?",
            "That’s an awesome bit of creativity on your part, way to go!",
            "This is the most satisfying MC I've ever read☺️",
            "And that’s how Blockbuster died. It wasn’t netflix after all…",
            "No wonder why they went out of business!/s",
            "Its great you helped a charitable cause.\n\nBeing angry that nobody wants to donate an extra dollar while theyre buying what they want to buy is bizarre. I never give money at registers and you absolutely shouldn't expect people to want to. \n\n\nEveryone can donate how they want and when the want. Dealing with manipulative tactics to get people to donate is a shit thing for companys to do.",
            "MaliciouslyGenerousComplience",
            "You did well padawan",
            "Plot twist: this is the single reason blockbuster went out of business",
            "So you bankrupted Blockbuster. Cool",
            "\"BE KIND, REWIND...\"",
            "So you’re why blockbuster is gone",
            "I had a store manager actually get fired for coupon abuse.  When you signed up for Rewards we had a coupon for 1 free rental.  This is when new movies were 5 bucks and older ones either 1 or 2.  The coupon would apply to the lowest value movie because of course it did.\n\nHe almost always had the most sales and I was basically always second.  But that's because I knew who to pitch it to and who not to (he had no shame over selling it).  \n\nWell one day looking at the history of a customer of his I noticed the coupon had been used several times for a customer.  They had rented a new movie and 4 old ones.  So he scanned it 4 times.  Looking into it he had used it 2-3 times a lot when they would get a new movie and some older ones.  Doing this was supposed to be a big no-no.  We ratted on him and he eventually got fired thankfully.  \n\nHe I think sued or fought the termination, won and eventually got hired back.  Thankfully another store than where I was at since he was lazy, arrogant, and selfish.  A real pos manager.  \n\nBlockbuster back in the days was crazy yo.  Working at the end was a real trip.",
            "I once got fired for something somewhat similar. Was working at a restaurant that was running a holiday season promotion to buy a $50 gift card and the customer would receive $10 “restaurant bucks” valid for the slow season of Jan-Feb. ok cool.\n\nThe restaurant management really wanted to push this so they created teams of serving staff and ran a competition tracking gift card sales. Right on, let’s do this.\n\nI’m working merrily one night when a customer asks if they could buy the gift card now, then use said gift card to pay for the meal they were currently having. I check with a manager who tells me that is perfectly acceptable and even shows me how to enter it in the POS system.\n\nWell now, college bone head me wanted to win, so I start using this angle as my sales pitch, and even then not a whole lotta people were biting.\n\nSome weeks later, I come in for a shift and get sat down by all three store managers who told me that my name was flagged in the corporate system.  As a part timer I was making 300% more gift card sales than full timers. Their default assumption was I was somehow “stealing” these “restaurant bucks” (no good anywhere else…) and told the store to let me go.\n\nAnd that was the end of it. First and only time I’ve ever been fired.",
            "I did the same thing when I managed a gas station. I’d collect coupons and ring the difference up as donations. Buying a $4 energy drink? Hey I’ve got a coupon for that, so that money goes to st Jude’s instead. Or I’d offer them the coupon for a dollar donation. So many donations.",
            "I generally refuse to donate money to charity on principle. Especially through a corporation. All it does is give the corporation a tax right off. And maybe a penny of my dollar donation would actually make it to the intended recipient. More if it's one of the decent ones. Though I'd donate my money directly to those rather than through any business.",
            "Damn. You just brought me back. Worst job ever. For essentially pennies. That stuff would not fly now.",
            "I knew it! You were the reason Blockbuster had to declare bankruptcy!",
            "You’re mad at people for not wanting to donate to who knows where? That is silly to me. If I’m gonna donate I want information, and to know exactly where my money is going and that it gets there. I’m not just gonna trust some giant corporation to do this, and you shouldn’t expect anyone else to. That is just annoying",
            "And that's the story of why blockbuster went under, to many $1 off coupons. Jk",
            "The shitty thing about donating through the company like that is then they get to write off those donations.  If you want to donate it’s better to do it on your own.  Of course many wouldn’t donate without the prompt but they also wouldn’t be giving those huge corporations tax breaks",
            "So THAT’S why Blockbuster went under!",
            "They always want you to round up, but they are never willing to round down.",
            "When they went bankrupt I wanted to travel to the blockbuster that denied my membership and piss on their door.  As a college student years earlier I had wanted to rent a movie.  Even a drivers license and multiple credit cards were not enough to rent their overpriced dvds, they wanted multiple utility bills to show where we lived.  It’s stupid.  All you should need is a single valid credit card.\n\nWe’ll, Redbox started eating their lunch, and you know the only thing you need is a single credit card.  They don’t care where you live or who pays the utilities.  I laughed when I saw a “blockbuster box” trying to copy Redbox’s vending machine movie rental concept, but in typical Blockbuster loser fashion, the format was an as card instead of a dvd.",
            "You may just bankrupt the company with that level of MC!",
            "I prefer to look at this as taking advantage of a loophole for the greater good. But 🤷🏻‍♀️if you want to see that as thievery, which some apparently do, I’m sorry you feel that way. The store manager thought it was great and made sure I worked the register every shift. 😂",
            "I donate to charity but I’ll never donate through a store or restaurant. They can donate their own money for the tax write off",
            "Donating at the register like that lets the company take the credit for the donation instead of the person donating, which is kinda scummy especially since most don't do a match donation. \n\nWhen in doubt its better to donate yourself to a charity.",
            "I personally never donate with those big corporate accounts.. all it does is give them a tax break and I'm not even 100% sure all of the money goes to the charity do you want to donate do it yourself or donate time.",
            "That was a painful read.",
            "Bravo! They help a lot of sick kids.",
            "I hate it when companies do that. They raise money by asking their customers for it and then they get to go \"oh we raised $xxx for xxx charity\"...no your customers did.",
            "How about fucking blockbuster donates money and you don't bug working Americans to give up their hard earned money",
            "While I do understand the frustration at people not donating at the POS, it's better to donate on your own to the organization in question. Donating to charity via checking out at a storefront is just an excuse for them to reduce their taxes.",
            "Thank you so much for this, seriously. Not only did you make a difference for St. Jude, but you also kicked a corporation in the ass. Well done, OP.",
            "The reason id never donate when a corporation asks me to is cause its just a tax write off for them. Theyre litterlly taking your money and saying \"look how much charity we gave\" without actually having to give up their precious profit margins",
            "Clever, brilliant even. And great story. But not malicious. More r/antiwork tenor haha",
            "Just think of all the charitable donations Blockbuster got to claim on their taxes. Brilliant way for them to get free money off the backs of others charity.",
            "Blockbuster went bankrupt by just $2000.\n\nNow we know who to blame /s",
            "[deleted]",
            "This is thievery with extra steps. I don't mind but it's not MC. You just abused a system to siphon money from Blockbuster profits directly to the charity. You're a criminal, which is fine, but it's just like... fancy crime. Like discount Robin Hood.",
            "Never donate through a retailer; they get to write that shit off at a huge margin while you just get to lose money with no tax break. If you want to donate, do it yourself directly to the charity of your choice. Don't let their corperate greed trick you into helping them make more money off of you just because there is a picture of a dirty cat or a sick kid on a card.",
            "Not all heroes wear capes. Well done.",
            "When I worked at blockbuster people would libe up special for me when I was checking.  \n  I got in trouble for helping out customers save too much with deals.  \n  My manager cried when she fired me.",
            "[deleted]",
            "[deleted]",
            "This is the way.",
            "I would've scanned the dollar off and the donate barcodes. Save a dollar, and donate, all while spending the regular amount",
            "Not only a good example of malicious compliance, but an honestly lovely thing to do. ❤️❤️",
            "A wholesome malicious compliance! Very rare but love to see",
            "A lot of Blockbuster's policies didn't make much sense. When I worked there I found out you could buy movies from them and also sell movies to them. I could look up the buy and sell price for all movies they would buy. Quite often they were very different prices. They would buy movies at higher prices if the movies weren't currently in print but would sell them at the normal prices. I must have bought and sold the same copy of Dune when I worked there probably 20 times. I made a lot of extra money while working minimum wage and no one ever noticed.",
            "[deleted]",
            "You got blockbuster a tax write off! Nice!",
            "I love this story, no wrathful people or toxic behavior, just some clever thinking that I'm sure helped a lot of people. Godspeed good sir, godspeed 🫡",
            "I'll never donate to anything at a checkout. There's plenty of money around that's fuking wasted every day, why expect the average person to give more.\n\nRed cross is the worst. Never donate to that shithole.",
            "[deleted]",
            "Socialism in small doses.  Thank you comrade!",
            "You know you're wrong right???? A donation is NOT a sale. You were frauding blockbuster.",
            "It's all too easy to type words on the internet, but I can't think of anything else to say \n\n#Genius",
            "It was my first experience with getting rejected time and time again. I was a teenager making minimum wage and it was so disheartening to watch people spend very large amounts on popcorn and soda and late fees and not giving an opportunity to give to sick kids another thought. \n\nThis was well before everyone asked you to donate for something every time you walked out the door.",
            "Just like the question on 1040 tax form, would you like $3 to the presidential campaign fund?  It doesn't increase your taxes.",
            "How is this malicious compliance?  Blockbuster was probably more than happy with this outcome.",
            "Just so you know, those donations in no way hurt blockbuster. The reason stores ask you to donate to a charity at the till is because they then take all that donated money, donate it in the name of the business and get a tax deduction for it. \n\nI believe whole heartedly in charity, everyone should give what they can to help out people in need. But do research pick a charity that is responsible with the money in a cause you care about, then donate directly to them. \n\nDon't let mega corporations use your good will (or guilt) fund their tax break.",
            "[deleted]",
            "Why get annoyed that only 2 people out of 100 gave $1 on top of their order? When large companies collect for charity since they keep a large portion of it so often most people who want to donate will do so directly to the charity so they get the whole $1 instead of 80c (example) going to the company and 20c going to the charity.",
            "Fuck donating at the register. Like corporations need another tax deduction smh.",
            "It is awesome that you were able to work it out this way. Bravo. \n\nFor me personally, I don't donate through companies' campaigns because effectively what happens is that those donations end up being paid in lieu of the company's actual taxes. Because it's a charitable donation, they can write that off as a straight up tax deduction. \n\nSo no, I'd rather not pay your taxes for you while you take all the credit for a large donation. I'd rather everyone just pay their taxes so valuable institutions like St. Jude can be properly funded from a reliable source rather than having to rely on corporate greed preying on thousands of gullible people.",
            "I work Taco Bell. We have a thing going where we ask “would you like to round up your change to help kids with scholarships and programs”.   The other night i had someone whose order was 9.97, it would take literally 3 cents to round up for the donation.  They said no.   \n\nWhenever i have someone whose donation would be incredibly small like that i will loudly say back “okay i wont round up the 3 cents to help kids with scholarships, making your total 9.97”.  Then ill wait for them to start to drive up at the drive thru window, and then ill quickly say (as if to a coworker, but with my headset still on) “wow the donation was only going to be 3 cents and they still didnt do it”.  Sometimes the customer is still close enough to the speaker still that they hear me and feel bad, other times they dont hear me and never realize i was badtalking them",
            "I always decline those drives because typically they only donate a portion to the charity, but they ALWAYS use it as a write off for the company.  I'd rather just donate on my own and not give a huge corporation a tax break with my contribution.",
            "Actually you helped Blockbuster with a write off on their taxes for donations. Individuals can’t claim $1 or $2 but all of the customers individually donating basically went right into corporate’s pocket",
            "If indeed the dollar off of the movie was to promote the purchase of other items then the donation is an other item and counts the way you used it. So no mc here move along.",
            "This wasn't in any way a malicious compliance.  This was theft.  You abused a sales tool you were given responsibility for to steal hundreds, if not thousands of dollars from your job because you thought people were \"wasting their money\".  People don't donate to charity for a lot of reasons.",
            "That's not malicious compliance.\n\n\nAlso I never donate at registers because I hate people like you trying to guilt trip me. I already donate to causes I support. I don't need to help multi-million/billion dollar corporations with their PR by donating at the register.\n\nPeople like you suck.",
            "Companies take all that money and just write it off on their taxes.  Customers literally just fund a tax break for a massive corporation.\n\nWhat you did was the most based way to do one of these charities.\n\nPSA to anyone reading this.  Never give one to a corporation for charity.  All you are doing is directly funding their profit margin.  Just give to charity yourself.",
            "People who throw their lives away watching movies are crappy people? Shocking.",
            "How very Project Store of you /s",
            "My wife was a store manager and they never paid her vacation time after they went belly up. They owed her like 4 grand. Horrible company.",
            "No wonder they’ve gone bust! 😂",
            "OP\nSo you are the reason Blockbuster went out of business.",
            "I like the way you think!",
            "I never up sold for blockbuster.  I wasn’t going to get paid more by talking to the customers sheesh.",
            "And now they’re shutdown… way to go man",
            "Best story ever!",
            "No wonder they went out of business.",
            "I f’ing LOVE this post!!! 🤔😳😁😂🤣 I don’t know if this counts as a malicious compliance, since I didn’t get to do it. I’m off work right now on worker’s comp, so I couldn’t do this. Here goes:  so I found out my manager got a job totally out of the grocery chain we work for, and he started work here when he was 16, until at age 35……here’s what I would’ve said to him in front of the other employees. “I’m glad you’re leaving here now, because of you I was going to quit!” 😳☹️🤬",
            "r/wholesomecompliance",
            "You single handedly bankrupt blockbuster. 😂",
            "I'd award you, but haven't got any right now. You did great!",
            "And just a few years later, blockbuster went out of business... Coincidence? You monster. How do you feel causing this great company to fold?",
            "The real reason blockbuster died.",
            "As a general rule I don't donate to charity I don't trust them.",
            "People were asking for donations at stores even in the 2000's..",
            "How are late fees \"ripping people off \"?",
            "I hate being asked to donate at the register. I would never say anything rude to a cashier about it, but it does bug me. I think giving your change to a guy outside the store is much better than letting the store donate it for you. I donate money to causes I believe in and organizations I have researched and vetted for myself. \n\nThe only exception is the wendy's keychain thing where they give you a free junior frosty for the rest of the year. That is just an insane deal, and seems like they are actually losing something to keep that charitable money flowing. THAT one is ok.",
            "Wow do I remember the early20000's differently, it was a time where every store was asking you to donate except for a blockbuster and if they did it would've been a really weird place to be asked that question.",
            "5110AY26",
            "Donating through companies is just giving them a tax break. You're not really doing any good except keeping the status quo up.",
            "Congratulations you have Blockbuster a tax write off!",
            ">I couldn’t fathom why anyone wouldn’t want to help a kid for a dollar.\n\nBecause many charities waste the money donated to them and only a small percentage actually goes to doing the charitable thing being used to advertise how great they are. Many people are very judicious with the money they donate only going to specific organizations they've vetted rather than handing out money to everyone who asks.\n\nI, for instance, will never donate to Red Cross. While working for an NGO in an impoverished country, I observed the Red Cross with their fleet of $80,000 vehicles cruising around but doing very little. If one of these broke down, I learned that it was their policy to burn them rather than leave it for someone in the area to benefit from. Some sense if you're operating in a country run by a warlord, but still. [Charity Watch](https://www.charitywatch.org/charities/american-red-cross) lists them as spending $24 for every $100 that goes into their budget, and then 90% of the remainder goes to actual program costs (*so $68.40 if you donated $100 actually going to program costs, which as described above can still be quite wasteful*) rather than administrative overhead. And they're one of the less-crummy ones on the list.\n\nPlus, the only reason businesses handle some of the fundraising for charities is for the good PR, and they get to claim the amounts people donated against the company's taxes.\n\nHard pass, I'll choose who to donate to on my own, thanks.",
            "I google big donation and get 1 billion result",
            "In California you get asked for donations since the mid 90s....it wasnt a new thing in the 2000s or now",
            "No wonder block busters went out of business people kept giving discounts for everybody xD",
            "I did a similar thing for a charity drive at my job that management kept forcing us to push on every customer, except I did it without the customer’s permission. If someone came in and only got a $1 fountain drink or cup of coffee, I’d just ring it up as a $1 donation. Those drinks are almost all profit for the company and the money went to a good cause, so I really didn’t care. Plus it kept the boss off our backs because we were competing for most donations with all of the other stores in the district.",
            "Ah, so this is where Blockbuster fell."
        ]
    },
    {
        "post_id": "8dfvb1",
        "author": "rumpleteaser91",
        "title": "'That table is free! I can see it! It's empty!'",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8dfvb1/that_table_is_free_i_can_see_it_its_empty/",
        "score": 14722,
        "num_comments": 264,
        "created_utc": 1524154606.0,
        "selftext": "(Cross post from r/talesfromyourserver , someone mentioned it also belonged here, so enjoy!)\n\n(Excuse formatting, mobile post!) \nAbout a year back, I worked in a family restaurant, it was a Saturday night and we were pretty busy, with all tables reserved, but it was all under control. I was hosting, and we had a family of 8 due in for a birthday. \nAs I was making my way back to my station, a group of 8 people walked in, (for the purpose of this story, the big idiot will be referred to as 'BI' and I shall be 'me') the exchange went as follows:\n\nBI  'table for 8'\n\nMe 'No problem, Sir, do you have a reservation?'\n\nBI 'No, I don't think so'\n\nMe 'Ok, well I'm very sorry, but we are fully booked for tonight, but I can take a reservation for another night if you wish?'\n\nBI 'No, if I wanted to eat here another night, I would have come here another night'\n\nMy back got RIGHT up\n\nMe 'I understand Sir, I do apologise. I'm afraid all our tables are reserved for tonight, but you're more than welcome to take a seat at the bar if you like, while you choose if you would like to go somewhere else?'\n\nBI 'What about that table over there, (pointing to the birthday table) that's got 8 seats, we'll just sit there!'\n\nMe 'Sorry, that table is reserved for another family, they're due here any minute, if you wait at the bar, we have a 30 min policy, so if the family doesn't turn up, you can take their table'\n\nBI 'Well none of these empty tables have 'reserved' signs on them, so how are we meant to know? Can you not push those two together for us? (Pointing to two tables that weren't even in the same area!)' \n\nBig Idiot then spots my manager walking past, and grabs her arm to speak to her (which went down about as well as a fart in a lift!)\n\nBI 'EXCUSE ME, there is a table over there that we would like to sit at, but this GIRL here won't let us sit there, we travelled half an hour to get here, and I'm not happy! They don't have any signs on to say they are reserved, so I don't understand!'\n\nMy manager, without missing a single beat says 'I'm sorry about that Sir, please wait a second while I sort this out, I won't be long'\n\nBig Idiot is looking pretty pleased with himself at this point, puffs out his chest and gives me the smuggest look he's probably given anyone. Until he spots my manager walking out, with the little reserved signs in her hand (our restaurant used to be self seating), she walks over to my station, checks the diary, and walks over to each empty table, and places a sign on each one, and walks back over to the station.\n\nManager 'I'm sorry our system confused you Sir, I have now rectified it, I see we have have a free table tomorrow evening, at the same time if you would like to come back then?'\n\nBig Idiot turned the most putrid shade of puce you've ever seen in your life, and stated he will sit at the bar and wait to see if the table cancels, and as they're walking, the birthday table of 8 walks in.\n\nBig Idiot huffs, and beckons his family to leave, at which point, my manager calls over 'If you would like that table for tomorrow, please give us a call, have a nice evening!'\n\nOh sweet, sweet Karma...\n\nTL;DR Idiot thought he could bully his way to a table, my manager took matters into her own hands",
        "permalink": "/r/MaliciousCompliance/comments/8dfvb1/that_table_is_free_i_can_see_it_its_empty/",
        "comments": [
            "Love that manager!!",
            "Ugh. I remember years ago when I used to bartend at a restaurant back when you could still smoke indoors in some places, we had a small smoking section that was just one side \\(back end\\) of a \\(3\\-sided\\) bar and the few tables behind it.     If anyone asked for smoking section they got that table, or if they wanted to smoke at the bar we asked them to sit on that side.\n\nSo one time this guy sitting on the other side facing the rest of the dining room asked for an ashtray and I told him he had to move over to the other side to smoke. \n\nGuy :Well I couldn't find the saying I can't smoke here, how am I supposed to know that?    \n\nMe: I know, there isn't any sign, but that's just our smoking section over there.  \n\nGuy: But there isn't any sign!  \n\nMe: Yes, that's why I'm telling you it's over there.  \n\nGuy: How am I supposed to know that!?  \n\nMe: Because we are here to let you know!  \n\nAnd on and on and on....",
            "Give that manager a hug from me!  Every workplace should have that type of support from management! ",
            ">I do apologise\n\nlol\n\nIf anybody tells you that they *do* apologize, you should know that you've just fucked up and should re-evaluate your actions. That little \"do\" means so much.",
            "> spots my manager walking past, and grabs her arm to speak to her\n\nNo, *no*, NO!  Just because someone works customer service, that does not make it acceptable to *grab* them!  \n\nI love the way your manager took care of the situation, but if it had been me, that guy and his party would have been out the door 5 seconds after the grabbing - willingly or not.",
            ">how are we meant to know?\n\nI just told you!",
            "I used to hate hosting for this reason. Every Sunday in the summer, we would get multiple parties of 30 just walk in and expect a table immediately. I once had a group of 30 walk in right after another group of 30 while both our side rooms were already full. So I quoted the second group a 45-60 minute wait and the guy (I guess leader of the group) complained the ENTIRE TIME. He complained to his group, to other guests, to me. To everyone. If you don’t want to wait, make a fucking reservation. \n\nThe other thing people don’t seem to get, is just because there’s an open table, it doesn’t mean there’s a server to take care of you. ",
            "Your. Manager. Rocks.  \n\nThat was EXACTLY how to handle it.",
            "What a great manager! I've been through so many managers that would have just made the situation worse by trying to push tables together or something and not understanding the fact that NO, the little tables are reserved too! They're all reserved. ALL OF THEM. ESPECIALLY THAT ONE THAT YOU ARE LOOKING AT RIGHT NOW WHILE DOING YOUR MENTAL MATH OF ADDING 4+4=~~8~~ 6* , THAT TABLE IS RESERVED THE MOST. (*because that's what happens when you push little square tables meant for 4 together, two of the sides disappear and there is only seating for SIX people, not eight, unless two of the customers are willing to eat squeezed between two other people and with table legs between their own legs, if the tables have 4 corner legs instead of one middle leg.)\n\nSo yeah, your manager is awesome! (And maybe you guys should just use those reserved signs every night to avoid know-it-all customers trying to roleplay at being the hostess.)",
            "I wouldn't have even bothered with the signs,I would have just said \"well since you're not seating yourself we don't need signs, I'm here to keep track of the reservations.\" probably why I never have stories that fit here, I'm to direct.\n\nEdit: fixed auto correct.",
            "Puce! What an awful word for a color, but great for the context! (Also definitely thought it was green but I wasn’t even close)",
            "That guy did a lot of things wrong, but what on earth makes people think they have the right to physically grab someone? I simply can't wrap my head around that.",
            "My wife and I were eating dinner in a tiny little restaurant in a small yet popular town on the north shore of Lake Superior.  It was Saturday night, the place was packed, and it was something of a 20 minute wait.\n\nIn comes a loud mouthed dude with a woman in tow.  He asks about the wait, she replies that it'll be about 20 minutes, he makes a snide comment in response and then they wait.  He spends the entire time time complaining loudly to no one in particular just how he feels about the situation he is in.  A table opens up, the couple in front of them sits down, and now loudmouth and his date are next in line.\n\nLoudmouth: \"Why can't we have that table right there?\"\n\nHostess: \"Sir, that's our only table for 8.  We're a small restaurant.  If a large group comes in there will be no way for us to seat them. \n If you'll please be patient with us another table will be opening up very soon.\"  \n\nLoudmouth: \"I don't care, I want that table and I don't understand why we can't have it.\"\n\nThe hostess then explains the same thing again with different words and Loudmouth tells her he would like to speak with the manager.  The manager steps over and explains exactly what the hostess said.\n\nLoudmouth goes \"I'm a customer!  If you won't give me what I want I'll go someplace else!\".  He turns and storms out the door.  It takes his date a moment to realize what just happened then she follows after him.  Moments after they leave a different couple steps in through the door.  In as much time as it takes the new couple to ask for a table for two, a table opens up and new couple gets to sit without waiting.\n\nFive minutes later (because that's how long it takes to walk the downtown and see there were no other options for fine dining in this tiny town) Loudmouth and his date return.  The hostess tells him it'll be about 20 minutes.  Seeming to have accepted his fate he stands quietly.  They were still waiting when my wife and I left a short time later.",
            "Wow, fuck that guy in particular.",
            "Why do so many /r/all posts get removed from this sub with no fucking moderator explanation?",
            "We have a similar issue a lot at tge restaurant I work at. We're a small family restaurant with a bar. We're in the middle of nowhere, but we get really busy for dinner most nights. Since we're the only bar for a few miles in any direction, a lot of people want to treat our place like their local townie bar. They actually had to stop serving shots before I worked there to curb that attitude. But people will still try to walk in and just grab any open table to drink at. Then they get pissed that they messed up our seating and we ask them to move for people who are actually eating. I don't get it. We have a few big tv's, but aside from that zero drinking atmosphere. It's like trying to have your Friday night shenanigans at a tiny version of Uno's.",
            "We get a variant of this in the hotel business, too. People show up looking for a room and then call us liars because we say we’re full when the parking lot is mostly empty. It’s too much for them to grasp that people don’t book a hotel to just sit around and stay at the hotel.",
            "I don't know why but I imagine Big Idiot speaking with Geordie accent. ",
            "Opened it and vola , its deleted just when i started to read it ",
            "Only worked in food service about 8 months maybe 10 years ago when I was in highschool. But in that short time I learned how to be a good customer. Seriously, never fuck with people who are serving you food.",
            "My back got RIGHT up... Can you explain this, please?",
            "As a restaurant manager, this greatly pleases me.",
            "Beautiful.",
            "This pleases me greatly.",
            "Such a great story, such a great manager",
            "Man it left me pretty pissed off after he said \"These tables don't have reserved signs, *how are we to know?!*\" I don't know you fucking daft cunt. Possibly by some employee that works here telling you? Since it's not your fucking job to find yourself a table? 😡",
            "the last restaurant i worked at did that.  someone has a reservation for 7pm.  if someone walks in at 6:50pm and asks for a table, we were supposed to treat them as having a reservation for 6:50pm, and that they should get seated first.\n\ni did not like that policy.  it felt like we were sticking it to the people with the 7pm reservation.",
            "> grabs her arm\n\nWhen I worked as a server, we got tired of this behavior and adopted a policy of having our chef escort any customers who physically touched anyone out of the restaurant.  He was a big, grumpy guy and took great pleasure in his new duties.",
            "Oh u/rumpleteaser91, I didn’t know my dad frequented your restaurant. ",
            "Lol you know that Yelp was like \"restaurant refused to seat us despite being empty.  They're racist, sexist, bigots and idiots.  Also the food sucks -5 stars.\"",
            "[deleted]",
            "Hell as a patron if I saw a big idiot grab a server or staffers are I would be escorting that big idiot out personally.",
            "Has he ever been to restaurant? ",
            "So much better than my manager, who would throw me under the bus.",
            "Manager handled it like a champ. Makes me wish I had put in some time waiting tables when I was younger. There's something about learning to think on your feet with relatively low consequences. This person can probably navigate all kinds of stressful situations by staying cool and professional. ",
            "Badass. Good manager !",
            "First time I’ve seen the word puce used since monsters inc. excellent revenge, and don’t forget, leave the puce!",
            "That manager is a fuckin' bro",
            "When people say excuse formatting, do people actually give OP shit for not bolding quotes and shit? I've been on reddit for like 5 years and see that little blurb all the time. Is it just tradition now or what?",
            "You go, GIRL!",
            "I'd like to imagine that the people with BI chewed him out, and never went anywhere with him ever again.",
            "> \"so how are we meant to know?\"\n\nI don't know, maybe by asking the server who will seat you if there are any tables available? The server you'd've talked to even if they had tables available?",
            "What is it with customers and their weird obsession that signs are more valid than the words of those who work there? \n\nWho do they think make/place the signs in the first place?",
            "He grabbed her arm? That sounds like a nice call to the police for threatening behaviour.",
            "I wanted to give you another updoot, and here you go! ",
            "The customer is always right.\n\nHere is what that phrase actually means.",
            "As someone who has worked in this industry for a long time. This made me happy.",
            "I was SO hoping this would be the outcome as soon as I read his comment about the tables not being marked!  I would have done the exact same!",
            "Good manager lass",
            "I love when shit like this works out perfectly ",
            "good read, will definitely have to ponder this ",
            "Where is the malicious compliance?",
            "Oh that is the best!!! ",
            "Yay! I was expecting the manager to tell you to give them the table and a completely different outcome. Love this one!",
            "“Putrid shade of puce” was an excellent touch. Well done.",
            "Hey, can I get into the elevator?\n\"No.\"\nThere's space right there!\n\"No.\"\nTheres no sound saying it's full! \n\"Ah, look at that.\"\n*elevator goes into nudge*\n\"There's your sign.\" \nBye!\n*door shuts*",
            "[deleted]",
            "Just for a moment I was really afraid of the Big Idiot deciding to fuck with the birthday party and ruin everybody's night. Whew.",
            "I like your use of adjectives. ",
            "That manager deserves a raise. ",
            "I’ve waited tables, hosted in a pinch, worked food service, etc. I would give you a strange look if you asked me, if after telling me the restaurant is booked after I’m already there, whether I wanted to book a table for another night. On the phone, sure. In person, it would sound odd",
            "Not trying to be difficult but maybe start with the reservation question rather than No Problem",
            "would've been funnier if she tazed him when he grabbed her arm lol",
            "the guy definitely handled the situation poorly, though i think he was right that the tables should have been labeled from the get-go",
            "Did the birthday party appear afterwards?",
            "Obviously, Anyone who is verbally or physically abusive should not be served, and made to leave. But the idea that a customer who is here at the brick and mortar location should be second to the person that called from their couch....well. I just think that's absurd. I think things should be first come first serve."
        ]
    },
    {
        "post_id": "15w9l82",
        "author": "Taaronk",
        "title": "You want me to tell you EVERY tuner I hear as a HS teacher…okay…",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/15w9l82/you_want_me_to_tell_you_every_tuner_i_hear_as_a/",
        "score": 14725,
        "num_comments": 516,
        "created_utc": 1692532912.0,
        "selftext": "This was fun for me and I was shocked how long it was allowed to go on for.\n\nI’m a high school teacher of an elective subject that lots of kids take and enjoy. I build great relationships and generally have the same kids for multiple years, so I get all of the tea spilled to me.  \n\nThere was an incident during and after school event.  I was in one space doing my thing and some students who had been in another part of the building came in and said, “Mr. Taaronk, there are people having sex in this other room.”  I follow them to the scene of the crime and there is nobody there.   I do all of the appropriate follow-up to see if anything actually went down, but no body no crime (and no one actually saw anything, they just said they saw the couple come out of the room and it smelled like sex when they went in after).  Also, no cameras in the part of the building in question - a thing I had pointed out as a problem multiple times in the past.\n\nFast forward like four months and the principal calls me down to their office.  They proceed to chew me out for not reporting the incident, it having finally made its way through the rumor mill up to the top.  I tell them all of the steps I took to follow up at the time and that it didn’t seem like there was anything to report — the room didn’t smell like sex to me, so it didn’t occur to me to tell anyone about it (to be fair it was early in my career, so maybe I was wrong).  I ask them (in what I assumed would be received rhetorically), “so where is the line on what unverified, evidence free rumors I should be reporting?”  And they respond: all of them.\n\nCue malicious compliance!\n\nI proceed to call and email them after. Every. Single. Conversation I have with a kid that could be even remotely construed as problematic.  We are talking a minimum of 3 times a day, usually more for THREE. WEEKS.  STRAIGHT.  Including weekends. The most satisfying was on a Friday afternoon at about 4:45.  The principal picks up the phone and before I can say a word they say, “okay Mr. Taaronk…you’ve made your point.”\n\nUPDATE:\nSome clarifying points, particularly for those in the profession who think my initial reaction was problematic:\n1) I (the teacher it was reported to) didn’t actually SEE the couple in question, nor could anyone involved point them out to me in the building. \n2) I DID seek clarification as to why the principal didn’t think I handed it appropriately and when seeking clarification on what unverified reports come to me should go up the chain and she said “all” - this is where the MC came into play, not because I objected to the notion but because my legitimate question for guidance was a non-answer. \n3) It was a Friday after school — I didn’t think anything of it due to the complete absence of anything actually occurring and so I forgot about it come Monday.  There was literally no one on campus to report it to and as a young teacher it simply didn’t occur to me that I could/should call the admin on a Friday evening to report an event that had ZERO evidence of being true.\n\nEdit - yes, I made a typo in the title. It should read “rumor” not tuner.  \n\nTl;dr - a rumored incident wasn’t reported due to lack of evidence it happened. Boss said report every rumor. So i did multiple times a day for several weeks until they got sick of it.",
        "permalink": "/r/MaliciousCompliance/comments/15w9l82/you_want_me_to_tell_you_every_tuner_i_hear_as_a/",
        "comments": [
            "Principle hears \"sex\" and \"rumor\" but forgot he works with teenagers.",
            "I looked at the typo in your title and assumed you would be a music teacher. \n\nThe real story is even more satisfying. Ahh teenagers…",
            "Lol a principal should know better. Kids are *the* best at spreading false rumours!\n\nI knew a teacher who accompanied a bunch of kids on a trip to a theme park. She hates rollercoasters, refuses to go on one. She had a word with one of the mouthiest kids, and by the end of the day all the kids were totally convinced that this teacher had gone on the biggest/scariest rollercoaster at the park.",
            "I’m trying to figure out if “tuner” Is a typo here, or some new slang I’m not aware of.",
            "My wife works in a school and had a very similar situation. Once day her boss just said enough already. And she replied no, you didn’t give me any guidance on what you want reported so I’m not going to stop. After a few more days they decided maybe trusting her judgement was a good idea after all.",
            "I want to hear some of these rumors you sent the principal",
            "When I was a teacher, I ran Saturday morning detention (3 silent hours in the cafeteria, Breakfast Club style) I would always let them go at the 1.5-2 hour mark if they were cool and cooperative.\n\nOne Monday morning, Asst. Principal flags me down, and asks “Did you let the kids go early on Saturday?” \n\n“Yea, they were good. Always let ‘em go early.”\n\n“Ok… well… I’m gonna need you to hold ‘em the full 3 hours for the next couple of weeks. We caught 2 of the ‘em fucking on the tennis court when they should’ve still been in there. They probably would’ve done the same after 3 hours, but just do me a favor and go the full time, please?”",
            "The students were in the closet making babies and I saw one of the babies and the baby looked at me",
            "Two sophomores were caught on camera having sex in one of the stairways before school. Teachers accidentally confronted my friend because she was wearing the same leggings as the girl… then they realized my very Hispanic friend with long straight hair was not the curly haired ginger girl they were looking for",
            "I took a mason jar and tried to capture the smell. Here, take a whiff and tell me how to add it to the documentation.  I can see attach file, pdf, docx, but not ‘odor’.   \n\n\nPlus, how do they all know the ‘sex smell’?  /s",
            "If it took him three weeks to get to \"you've made your point\", then he needs a few more weeks of it to *actually* get the point.",
            "Where I went to school, if some of the teachers actually discovered something like that, they would probably just have said \"next time, please don't do that on school grounds\"... As long as the perpetrators were 14 or over, the legal minimum age and consent was not in question, of course.\n\nGenerally, instead of fighting tooth and nail for abstinence, they explained the biological background, the how and how not, consent, how to properly use condoms and what additional options are available for contraception.\nShocker: teenage pregnancies are few and far between.",
            "When I got out of the Marines I took a job at Walmart doing asset protection for about a year while I finished college. It didn’t pay well but I could set my own hours and didn’t report to anyone in the store because they didn’t have an asset protection manager for me to report to. Whenever I apprehended a shoplifter I had to enter it into a portal so the legal department could do their thing and I would try to keep my reports concise and just included relevant information about the apprehension. \n\nThe area manager contacted me and said my reports needed more detail although I never had to redo any of them and as far as I know 100% of my stops held up to any challenges. After that I included every single detail including the clothes they wore, the entire path I followed them around the store, any dialog I overheard, every item they stopped to look at, the weather outside, etc… and after a couple of weeks of several page reports for each incident she called back and said the old reports would work fine.",
            "Smells like Teen Spirit in here",
            "I'm really curious what a bunch of high schoolers think sex smells like and how it lingers? I get sex has a smell but I dont think I could walk into room someone had a quicky in and say it smells like sex.",
            ">  The principal picks up the phone and before I can say a word they say, “okay Mr. Taaronk…you’ve made your point.”\n\nThe only reasonable response is \"I don't think I have, because that didn't sound like an apology.\"",
            "what does \"so I get all of the tea spilled to me.\" mean?",
            "That's a great story! I had something similar when my headmaster approached me, irritated she had missed some information that was shared in a planning group on our server. Since I'm responsible for IT in our school (besides being teacher), she demanded to be part of every group group on the server, so she would get all mails and dates. I asked her \"all groups, even the class groups?\". She insisted to get every mail, everything.\n\nIt took her two days to break down in the information overkill. She couldn't even find her own mails and dates anymore.",
            "Thought this was on r/guitar",
            "Same thing happened to me basically. I had left work and they called me back in. Im fairly new so I oblige. I wasn’t that far away. \n\nMy boss and principal are in there. And they tell me this story and I just said, “I didn’t believe it” \n\nThere’s a little more to it. But the same jest.",
            "No, Mr Taaronk, the school superintendent and the board of education, need to be looped in as well. Per the principal that ALL rumors, innocuous words, hearsay, and mere glances need to be reported all day, every day. A trail of constant flowing paperwork and the whole destruction of forests must be done to ensure total compliance",
            "Ohhhhhh…. rumor!   I understand now.",
            "Once upon a time back in the 90s, in mid-sized NSW country town (name withheld to avoid detection), a student teacher had started their first placement. They were intending on being efficient by prepping their next classroom's blackboard before class started, and made their way to the classroom. \n\nExpecting it to be empty, they opened the door without knocking. The room was not empty. The innocent young teacher beheld upon the teacher's desk at the front of the room two teenage students going at it hammer and tong. Swapping saliva and other fluids. Doing the dirty.\n\nShocked, the green teacher quickly shut the door and not knowing what to do, looked up and down the hall and went towards another open classroom door. With relief, they saw another fellow, much older teacher, writing on the blackboard in their own empty classroom. \n\n\"Mr Older Teacher\", they knocked. \"Um... i don't know what to do. There's um ... two kids doing ... um ... doing it. Doing IT.\" \n\nAfter a moment's pause, and without taking their chalk away from the board with which they were writing notes for their next class, the older, jaded, teacher simply answered. \n\"Yep - that's be the Johnson. They do it all the time.\"\n\nTrue story.",
            "Cue \"I'd like that in writing, please.\"",
            "That's so incredibly annoying. You do what the principal explicitly asks for and they think you are being malicious and annoying and trying to \"make a point\". No, you asked them to do this, specifically.",
            "Why is it that high schools so often have such a complete lack of common sense? For an institution supposed to be for learning they often don't seem to learn anything",
            "Unrelated question: Are you by chance a fan of Small Town Murder?",
            "This is amazing. I left teaching because my admin told me to solve problems on my own and tell him when things happen. You can’t win!",
            "So satisfying for someone to be like...ok you win",
            "In reading some of these other posts—Gross. when I was in junior year (2020) I had to ride the bus to school.. and I had once witnessed two middle schoolers having sex to my right in the other bus seat 🤢. I still never want to go back on a bus. I never got into that at school yeesh",
            "\"Sorry, but you demanded that all of them need to be reported. Unless you give it to me in writing, I HAVE to continue doing this.\"",
            "As a principal, I'd be grateful for the steps you actually took instead of downright dismissing the story. Nice response!",
            "If the kids really like you, you will get ALL the tea!",
            "Well played sir.",
            "tuner?",
            "What about the teachers who arrive at work?  So they smell like sex ?  Hmmm we need an investigation. Who among the staff had sex?",
            "As a Uk based high school teacher - I’d absolutely have to report the rumour.",
            "One of the guys that I used to work with at Mickey D’s went outside to clean up the Playplace one night when he heard a noise coming from the slide.  He shined his flashlight in there, and sure enough, there were two teenagers having s*x.",
            "What exactly is a tuner? I read the story but never heard that term being used before.",
            "This isn’t malicious compliance it’s best practise well done mate. It’s not just a safeguarding concern you also need to cover yourself.",
            "I read this thinking I was on the r/vintageaudio sub.",
            "Am I the only one who thinks it’s bizarre that it was such a big deal in the first place?",
            "“No body, no crime!” STM fan?",
            "You want me to tell you EVERY tuner?\n\nWhat the hell is a, \"tuner?\" In this usage of the word?",
            "Smell for sex?",
            "Next time bring a 3rd arty with you. The student could say it was you two.",
            "The student who smelt it dealt it? lol idk.",
            "Plot twist, kids stealing answers for the test and saying they are having sex to throw off the suspicion.",
            "Idk man if you hear a rumor like that you have to say something... You have to cover your ass always.",
            "What does sex smell like? Ive never walked in to a room and thought to myself “it smells like sex in here”",
            "In the UK, that’s called Safeguarding!",
            "\"the room didn’t smell like sex to me, so it didn’t occur to me to tell anyone about it (to be fair it was early in my career, so maybe I was wrong).\"\n\nYou have since learned what sex smells like? 😉",
            "Well-played and great story but I need to call out one little thing:\n\n> Also, no cameras in the part of the building in question - a thing I had pointed out as a problem multiple times in the past.\n\nWe managed to educate each other for thousands of years without constant video surveillance. I know a bunch of people with advanced degrees who managed to get them without living in a panopticon. You probably do too. \n\nIt’s bad enough that now we’ve normalized surveillance and taught kids that violating their privacy is to be expected. Now we’ve got teachers objecting to the existence of places where privacy is not violated? Please think twice about that.",
            "It’s always better to over-report than to miss a potential safeguarding issue. There will be colleagues, who have all of the other pieces of the jigsaw, who will decide if your report is inconsequential or actually significant and/or part of a wider picture.\n\nYour school should have made this crystal clear to you on day one. If they haven’t, this is on them.",
            "\"Smell\" like sex? Wtf does sex smell like?",
            "Oh I can’t wait to start teaching. If anything close to this happens to me, I will 100% do the same thing",
            "Tuner??",
            "Please tell me you're not the English teacher.",
            "What’s a tuner?",
            "Trying to upvote but it’s on 6969",
            "I'm glad I'm not a kid wherever you teach. Imagine \"not enough cameras\" being an issue.\n\nCool MC, though.",
            "i know of the reverse case.\n\nIt was non consensual and the guys never met the cops;",
            "[deleted]",
            "Teachers should proofread their titles.",
            "Malicious compliance makes me\nlaugh because 99% of the time you’re just making your own life harder in the long run. Sure you might have “made a point” or something, but now you’ve at best proved to your boss that you’re an annoyance who is vindictive, and at worst have made a professional enemy of your boss who will now try to sabotage you at every turn. Well played? \n\nWhereas if you had just said “There are a lot of rumors, so if we could get some concrete guidelines as to what to report that would be helpful. Otherwise I’ll have to call you up all the time and neither of us has time for that.” \n\nBut if you want to play obviously passive aggressive games, don’t be surprised when you win said prizes.",
            "I say this as a teacher myself, but there is almost no part set off this story that actually sounds real lol",
            "Props to the girls parents for moving their daughter away from there, I wish my parents prioritized my mental health that much when I was a kid.",
            "So you didn't follow policy and then got butthurt when you were told to follow policy.\n\nGood to know such mature individuals are teaching kids.",
            "This is great 😂😂 nice one",
            "tl;dr",
            "aff",
            "That's some awfully slow learning on the part of the principal!",
            "YES",
            "Hahaha 🤣",
            "Congratulations on throwing more paperwork on your desk?",
            "Also, what do they think teenagers are doing anyway?",
            "Me. Crawford, is that you? 😅",
            "Love this! 😂😂😂",
            "I'm still trying to figure out what a tuner is.  /s"
        ]
    }
]