[
    {
        "post_id": "10eudba",
        "author": "Supervisorconfession",
        "title": "No written notice? No can do.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10eudba/no_written_notice_no_can_do/",
        "score": 14718,
        "num_comments": 472,
        "created_utc": 1674006136.0,
        "selftext": "So I work at at a major University in the USA. I run a night crew that works a swing shift. Every 6 months or so, upper management likes to have some all staff meetings where everyone in our department shows up to listen to them talk about how great they are. Overall, pretty big waste of time. First one I ever went to, I was forced to go by my previous supervisor. I had to be there at 10am for a 90 minute meeting. My normal start time was 4pm so this was a HUGE inconvenience. The next year, that Supervisor had left and I was the new Supervisor. I knew another meeting was coming because I had received several emails about it. However, I had read the contract and it's required that any temporary shift change requires 48 hours **written notice.** So I decide to say nothing. Finally, less than 24 hours before the event, we finally receive our notice. I immediately reply saying that they failed to give us 48 hours notice and we would not be attending. My manager was initially upset because I didn't say anything earlier. I informed him that wasn't my job and pointed to the contract. He eventually gave in and said, \"Fine, you don't have to come. Next time we will give you more notice.\"\n\nHowever, I decided to make this a larger issue. I spoke to the Director, who was also upset we wouldn't be attending. So, I offered that we could do a smaller event for the night crew. Long story short, ever since then we now have a separate event at night. Turns out there is far more than just our shop. There are several other groups, including custodians who also don't have to adjust their shifts. I never intended it to be that far reaching, but that simple rule saved us a ton of heart ache. No one thinks about the night crew lol.",
        "permalink": "/r/MaliciousCompliance/comments/10eudba/no_written_notice_no_can_do/",
        "comments": [
            "No one EVER thinks about the night crew.",
            "I worked 3rd shift for 20 years. \n\nALL of this is true.\n\nI refused to come in during my sleep time for meetings. I told them that me coming in at 3:00 PM for a meeting was the equivalent of THEM coming in at 3:00 AM for the same thing. If THEY weren't willing to come in on MY schedule, I wasn't coming in on theirs. Furthermore, if it didn't pertain to my job and ONLY affected day shift, send it in an email or write a memo and put it in my mailbox (pre-email days.)\n\nI never had a problem after that, because the managers realized I was right.",
            "Former NOC shifter.... I hated those \"Could have been an email\" meetings. Literally 90 minutes I could have been asleep but instead was sitting listening to the day crew get praised for shit we did because they were too lazy to do it.",
            "If it’s alright for you to come in off shift, it’s ok for days to stop in at night for meetings also",
            "Had this before. Told my boss, just schedule it for 1am we’ll all be here if you do that. He goes “day  shift people can’t come in in the middle of the night they need sleep”  then a light bulb went off and we did two meetings.",
            "Old saying, \n2nd Shift is 2nd Class. \nThis applies to 3rd as well. \nI’ve been in 2nd since 1985",
            "I can relate. I work night shift, grave actually, and start at 9pm. Making any kind of meeting during the day is next to impossible, I don’t even try. I’d have to come home, sleep 2 hours or so, go into work, have that stupid meeting, go back home, sleep another 4 hours or so, and then get up and go back to work? Nope, not happening. I’ll quit before I do some bullshit like that. Every once in awhile we have a mandatory class. I’ll call in sick the night before so I can sleep before the class, and call in the night of the class because I’m not going to get up at 7am to attend a class and stay up until 7am the next morning.",
            "We do all staff meetings at 7:30 am, as 3rd shift is getting off work, and at 2:30 pm, between 1st and 2nd shift. We do them on Tuesday and Thursday and everyone arranges to get to one of the meetings. \n\nBut I'm in Healthcare and the Nurses and techs are the backbone of the organization, the biggest amount of staff, and we cater to them.",
            "As a night shift worker, I thank you for your service! I absolutely hate it when we have to rework our entire schedules for some bullshit day shift waste of time. Like, we aren't demanding you get up at 1am to show up to a meeting. Just because it's \"normal people\" hours doesn't mean it's our hours. 10am is literally the middle of the night for me. I go to bed at 6am and am up by 345pm every day.",
            "We have the same bullshit but on a global scale.\n\nI get to login to a global zoom call at 5am or if I'm lucky 6am to listen to shit I already know about.",
            "One of the greatest lessons I learned in life. Don’t piss off the night crew unless you want fire and brimstone.",
            "Same for maritime industry, important meeting during the day for all. \"Do you know the mandatory resting hours regulations?\" Pikachu face....",
            "Love how management always thinks the world should revolve around them. Nice work not only getting out of the meeting but having a  new one set up for night crews! 👏",
            "There are people that do work at night? I thought all that work got done by elves and magic (good) trolls.",
            " My husband is at work right now, probably complaining about the useless, no-good day pukes.",
            "When I worked 3rd shift we always got the shit end of the stick when it came to meetings. The management would schedule “important” all hands on deck meetings at 8am. It’s near impossible to shutdown an entire manufacturing facility quickly and without waste so “all hands on deck” means all machines keep going so the incoming shift goes to the meeting at their normal start time and the incumbent shift stays over. THEN the 3rd shifters go to an identical meeting when 1st shift is done with theirs. \n\nThat meant sometimes the 3rd shifters ended up leaving 1-1.5 hours later than normal. Lots of people missed getting kids to school, missing appointments etc. Notice was often the day(evening) of and attendance was mandatory. Management would brook no insubordination when they wanted to us plebs. \n\nI didn’t care, I was always there 1-2 hours later as I had stuff to pass on to supervisors and engineers, so I just started filling out the attendance sheet for people that needed to roll at their normal times. Yeah it was technically theft, but giving essentially no notice and draconian adherence to the point system was threatening people’s livelihoods. It has since been modified to EVERY shift gets a piece of the overlap now and the demi-gods that are management have to work around shift change time, the poor things.",
            "Lol when I worked night shift in California I had to come in for an all staff meeting during the day.  Because the meeting took place less than 8 hours before my next shift I informed my manager that legally I could not work that night and they would have to cover. \n\nThey ended up getting me to agree to an exception on the condition I got overtime for the full shift.  I was never invited to an all staff meeting again.  \n\nThey wondered why I didn’t care about anyone in the day shift, but any time there was a staff party I was never left a single slice of cake or pizza.",
            "Work nights mostly with a paving crew, few years ago they had the Christmas party and give out bonuses and food etc etc, but it started at 11 am and noone on nights was getting up for that, called corporate and said I was taking the guys out for dinner before the next shift on the company card since noone thought about the crews working night shift.\n\nI took them to a 5 star Brazilian Steak house near where we were working and racked up over $1700 bill plus tip put it on the Company card and enjoyed the rest of the night as we were too stuffed to actually get any production done.\n\n3 weeks later at the end of the month it starts running around the office about how I took the guys out, district manager is frothing at the mouth about how much we spent and how we didn't get approval, so i called our corporate office put it on speaker and let the HR lady ream out the district manager for not taking night shift into consideration and making us work the night before the party.\n\nSince then we have had 2 more Night shift Christmas parties, this year I got us a catered suite at a Tampa Bay Lightning game, the CEO showed up for that one 🤣🤣🤣",
            "Well done!  I worked 10 hour night shifts at a casino and the new boss had a mandatory meeting an hour after I was finished…so it turned into a 13 hour day 🙄",
            "Bless you sir for thinking of the night crew, cause Lord knows management rarely does.",
            "From one vampire to another, I salute you!",
            "Once on night shift, I was working as 'mandatory personnel' so I had to work 12 hour shifts; 3 days on, 4 days off, 4 days on, 3 days off.    \n\n\nThe end of my 4 days on I am told at 0600 I have to stick around for another 3-5 hours to sit through some briefings that are *super mandatory*.  I tell my supervisor that it is a bad idea as I just worked 12, and am on 'crew rest' and people are very fussy about that. I would 'probably not get in huge trouble for sleeping in the front row of the auditorium in front of the full bird once I showed this instruction describing what crew rest was, that I just so happened to have in my pocket, but my supervisor might'  \n\n\nThey found a way for night shift to do it later pretty quickly. I may have distributed the instruction to a number of night shift folks pretty blatantly.",
            "Night shift is always misunderstood. Patients who work night shift needing healthcare get squeezed into the mold of up at 7am and in bed by 9pm, and get frowned at for going to bed instead at 3am. Not only that but they’re retired. Let them do what they want!",
            "As a night shift nurse I feel you.\n\nNothing pissed me off more than my last job constantly doing meetings at noon or literally sending emails out at 9:00 p.m. the night before about a mandatory meeting the next day.\n\nFuck you.\n\nMy manager literally sent out an email at 9:00 p.m. on a Tuesday about a mandatory meeting at 11:00 a.m. on a Wednesday. You know where my ass was? HOME.\n\nMandatory my ass.\n\nLuckily my current manager is smart enough that if he wants us to have a meeting he shows his ass up at 6:30am before night shift goes home or he comes in at 6:30 p.m. before day shift goes home.",
            "I'm a lead custodian on days and I fight tooth and nail for the night guys to get treated the same or better as day shift. They arent after thoughts.",
            "Funny how people who have \"normal\" day hours want to force shift workers onto their time schedule. This happened to me in the military after working the midnight to 8 AM shift and an hour for a meal returned to barracks to find 1St Sgt looking for us(shift workers) who didn't attend a parade practice for a Junior Officers parade. Sorry Sarge, just got off work. Wanted to charge me with AWOL, so called my OIC and had him dress down 1St Sgt for overstepping his authority. Why won't they learn night owls will always win?",
            "Please *please* *please* tell me this meant that a day dwelling piece of sh*t had to come in and torture everyone with their grandstanding and self absorbed \"look at me!\" rhetoric.\n\nAlways loved it when \"guest speakers\" or union shysters at my graveyard custodial job had to come in on our turf/time schedule.\n\nCould tell the tired and worn out ones that was seething underneath at having to be up at a time they could be enjoying late night television with the ball and chain instead...\n\nAlways warmed my cynical heart to see them suffer for their inability to have any options for 3rd shift workers that pull their asses out of the fire more then any other shift in the company.\n\nNeed to see a union rep? Drive 100 miles round trip or take a bus to Los Angeles. Banking Questions with the company credit union? Schedule time for a day dweller appointment when you should be winding down and sleeping... And so much more slanted to their favor and not yours.\n\nSome of the union brass would further have misery as they couldn't leave until everyone was done shredding and yelling at them. One of the few times managers had our backs and would just step into the shadows with a smirk",
            "No one think about the night shift but we some how get the blame for everything.",
            "Nice job!!!",
            "r/wholesomecompliance",
            "> No one thinks about the night crew lol.\n\nTrue, true, true!",
            "This Night Shift worker salutes you.",
            "I work a 6-6 night shift and was told while working at 6:20p Monday that there was a mandatory meeting at 1:30p Tuesday when I also worked the next night. I didn't go to the meeting.",
            "Global company with all staff meetings. When we complained that it is a bit annoying to join a meeting at 11PM or 4AM, management just recorded the meeting and let us watch it in our own time (or not)",
            "My job use to force us to have mandatory on site meetings for an hour or so. If it wasn’t your day to work? Still had to come in. Literally had to come for 45 minutes each way to go on a SATURDAY. It sucked. BUT my last meeting before I quit involved some very dramatic arguing/shouting/fighting amongst coworkers while the managers just stared mouth ajar. It was actually really worth it seeing them try to contain the situation. Even managed to sneak in recordings of it while I snickered hysterically under my mask 🥳",
            "And my company wonders why I have such a crappy attitude. I work 5 pm to 830 am. Every DAMN meeting is scheduled for 9 or 930 am. Like I only have 8.5 hrs a day to eat, sleep, shower, run errands. I really don't want to waste 2+ hrs to hear something that could have been emailed to me and I don't care about \"bUildiNg The tEaM\". I am the only team member at night leave me alone.",
            "\"Well you're off *all day!\"*",
            "Seriously. I feel bad for night crew. They are always first to get blamed when things or food go missing in the office. Are you sure it is not your staff who hates you that took those????",
            "Working night shift is like being a mushroom. \n\nYou're kept in the dark and fed a lot of shit.",
            "This is beautiful. If administrators need to waste precious time off tooting their own horns, let it be their own precious time off and not time off of probably hundreds of workers.",
            "Don't want to piss off the night crew. They already deal with enough crap.",
            "Imagine being so ignorant you tell your night crew we need you for a meeting before you usually wake up.",
            "They only think about 9-5ers",
            "Bravo, as a fellow shift worker I salute you. Tired of my sleep schedule being treated as if it's optional.",
            "I work at a school as a night janitor, every year before the school year starts there is a meeting that is mandatory that everyone goes to. We work till 10:30/11:30pm depending on the building you are in. They want us there at 7am, but not to work 8 hours, they want us there for a 45min meeting then to go home and come back at our regular shift. I am the supervisor in my building and told my boss if I come in and have to go home after the meeting I'm not coming back that day, he said I can skip it.\n\nNone of the teachers ever have to have a meeting at the school 8hrs before or after their shift. I just hate how the \"support staff\" and 2nd shift guys are treated like 2nd class citizens.",
            "This story reminds me of an episode from Community where the Custodians are having an elegant, posh party in the generator room.",
            "I worked as a night supervisor, 11pm to 7 am. Our weekly management meeting was 8:30 on a Thursday. I hung around, had a break, caught up on paperwork,  etc, then went to the meeting. \n\nONE swing shift supervisor CHOSE to move to a new house 1 hours drive from work and agitated for the meeting to be moved to 2:30pm so that he could attend every week in stead of every 2nd week or have to drive an hour to a meeting, do the meeting , then drive an hour home, then repeat for their shift.\n\nThey changed for him without consulting anyone else, and asked me to attend the new meeting time. Hell no! I'm not getting up in the middle my sleep. Its the equivalent of a 2am meeting for dayshift workers.\n\nNever attended another management meeting again until I left that company.",
            "Second shift , second class. We used to get left overs from day shift for christmas parties.",
            "Dude.  You are awesome.  You created an entire shift in upper management.  It was small, but had great effect!",
            "love the attitude of management... I'll completely lose my shit at non attendance of meetings when it would take less effort to make the meeting relevant, timely and put out incentives so people want to come on their own... I've never had problem with meetings but when you and your opinions are ignored and it's just the company fapping off to their so called achievements and management blowing smoke up each other's butt... what's the point?",
            "Night shift always gets the raw end of the deal because day shift's leavings are hard to spot in the middle of the workday, but opening up in the morning you can easily spot any little imperfections. Drives me up a wall remembering how shortsighted day shift was when I worked at a restaurant.",
            "I ran into issues like this in a Army way too often. I would be on 24 Operations, but my company/Battalion ETC would want to have some horseshit event, be it a formation or a mandatory Kumbaya/Pat us on the back thing. One of the few times a commander when on a mission and an event was to follow, the rules/mandatory attendance magically would be dropped… no shit sir, how do you think everyone else reacts to having to do this every week.",
            "Username checks out. \n\nMy supervisor thinks about our night crew. She is always riding us to make sure things are in order before the night people get there, so there's not a mess left that they then have to deal with. \n\nHaving company-wide meetings are generally a waste of time anyway, in my opinion. Every meeting I've ever been to could have been more efficiently done via an email (which would have the \"reply all\" button disabled!). \n\nI actually had to attend a meeting this month in the early morning on a day I was not scheduled to come in until later, leave to go to my other job, and then return for when my shift started. Ugh, what a day. (And, yes, it could all have been done via email.)\n\nI don't suppose I should complain too much though, my job has been pretty flexible most of the time, and we don't have a lot of meetings.",
            "I have a similar issue but I’m the ONLY employee in the company that works at night. I work for an HVAC company and I am the on-call service tech. My shift starts at 4pm and I’m on call until 7am. That doesn’t necessarily mean I work every day until 7am but I’m still expected to be available. Every Wednesday there’s a service meeting at 7am, which is fine for everyone else bc they start their days at that time but 95% of them could have been an email. It’s pointless for me to attend and I don’t know how to tell my boss it’s inconvenient for me.",
            "My department is flexible on work schedules. I tend to come in at 7:30 or 8AM while many of my coworkers come in at 10 or 11. There have been several instances where they'll schedule design reviews (likely to run WAY long) at like 3 or 4PM... And I leave at 4.\n\nI told them I am going to start scheduling meetings that I expect them at attend start at 7:30AM. What do you know, their meetings started to get scheduled at 1PM instead. :)",
            "Dude, good for you! You held your ground against management in a polite, firm, factual way. You proposed a solution. And as a result, you’ve made the lives of not just you, but many of your co-workers better.\n\nAs management myself, we have blind spots. If you’re feeling charitable, you might entertain the notion that management wasn’t trying to be douchey but simply, as you say, didn’t think about the night crew. You raised your voice in an appropriate way and everyone was better off for it. Kudos.",
            "Everyone in the night crews for the whole company are grateful for your diligence to meet contract requirements, I assure you. :)",
            "Well done. My father was supposed to attend a Christmas breakfast super early, just so no work hours had to be wasted. So the get together would be over right before the regular clock-in time.\n\nMe: _So when's this breakfast thingy gonna be held again?_\n\nFather: _Next Friday, I just_ told _ you._\n\nMe: _Right, okay, but... which day of the week is your day off...?_\n\nFather: _Frid- oh... right. Nice!_",
            "I have always been a night person, and I love you so much for this!",
            "I worked midnight shift and those daytime mandatory trainings and meetings and whatnot were such a pain and really wrecked my sleep.  Good on you for finding a way to protect the night shift.",
            "I live an hour from my work. And I work nights. 9 pm. to 5 am. Big boss likes weekly meetings on Tuesdays at 12:00 P.M. I also have college classes on Tuesdays from 3:40 pm to 6 pm.  Big boss knows this and still refuses to schedule for a different day in the week. I enrolled in classes before we started the meetings or I would've changed what days my classes were. \n\nSo what happens ? I get off work at 5. Get home at 6. Try to sleep right away. Sleep from about 630 to 1030. Get showered and dressed for the work meeting. Get there at 1200. Meeting goes to 1:30-P.M. then drive the hour  back to my campus. Class is finished at 6 P.M. not enough time to sleep before I work. Go back to house and shower and change into work uniform, and get to work around 8:30 and start sleeping in car when I can so I don't waste anytime. New policy comes out that we can't sleep in our cars on property. Property is 20 minutes from another location that has safe parking.",
            "Day time people don’t wanna come to a meeting at 2am and then work at 7am but they never think about the night crew getting up 5 hours early to come to a day time meeting.",
            "I work graveyard shift, have for years now and nobody gives 2 rats about us, we could be all laying dead in a back hallway and nobody would notice until a few days had passed. Sad but true.",
            "I (luckily) only worked nights for about 2 years, and the number of times some day shift middle manager would make some sweeping attempt at \"building morale\" by doing some stupid event at a time only convenient for 1 of 3 shifts..........fuckin staggering.",
            "Not sure on your state/prov/local law, but here you can’t be required to report for work without at least 8 hours between shifts. A 10AM meeting that lasts even 15 minutes followed by a 4PM following shift would not be allowed under law.",
            "No one thinks about the crew",
            "Same boat. I suggested that these meetings be scheculed for 3pm (our start time for 2nd shift). Was told it is not fair for 1st shift to have to stay 30min late but okay for 2nd shift to come in hours early, go back home after meetings (we are on the clock for meeting), clock out after meeting and come back to do our job. We are lucky enough to get cold pizza though.",
            "I did 7 years at a counter service restaurant, most of it night shift. Every time they had a morning all hands meeting I'd bring up communication (or lack thereof). Shit never changed. Eventually I was given front end management position (though 1 of the 2 owners insisted I was just a shift supervisor? Despite that I did schedules and payroll and inventory?). Shit still didn't change, other than my blood pressure.\n\nFinally they hired in a GM. Finally, things started changing. I no longer was the go to double-triple-shift-opener-closer-fill-in-for-anyone (yes, a lot of that I brought on myself, because I had a hard time saying no to the owners).\n\nI finally gave my written notice full of my \"I don't have any more fucks to give\" complaints on New Years of 2021. I left it in the opening bank at the end of my shift. Then I ghosted them for 2 weeks. When I finally consented to a call from the owner, he essentially ignored that half my complaints were about him and said it sounded like I was super burned out and why didn't I say anything? I don't regret leaving. \n\nI now work in a 9-5 office environment where my chief job is to answer the phone, order office supplies, and clean the employee kitchen. I get paid holidays and sick time!!!! Unlimited overtime during tax season (accounting office).",
            "If you’ve never worked nightshift for years. You won’t understand, it’s a completely different life. \n\nWe are the forgotten.",
            "I’ll always remember my last 3rd shift job. Every review, “oh, you have potential but you don’t do ENOUGH.” Coming from management that wasn’t there at night. Moved to day shift and I was dragging ass bc I just changed my whole schedule. They couldn’t stop telling me how great I was doing.\n\nDay shift management NEVER fully appreciates night shift. It’s literally out of sight, out of mind.",
            "You are the hero we night crew need.",
            "Having worked night shift in a past life, I will always consider the night crew should I become important and influential enough.",
            "My partner works day shift 90% of the time, but does overnights a few weeks of the year. This is necessary for his department to run. It is really necessary for all department heads but none of them do it and then they complain about nightstock fucking up their shit. My partner was speaking with night shift who complained that all the departments were constantly throwing them under the bus and making them out to be incompetent when really they just had no opportunities to communicate their needs because, unlike my partner, they didn't allocate the time to have a conversation with night shift. Well, one early morning an executive overheard my partner and a night shift employee speaking on this issue and decided to make one week of overnights mandatory lol Yeah, it kinda sucks because people's lives are upended for a minute but I'm happy his night stock will finally get a little respect. Things don't just stop running when the sun sets.",
            "Where I use to work at a factory luckily they did it a little diffrent. When food was brought in they would order day shifts for our lunch at 11 am. Then they would order night shifts food for their lunch at 6pm. When there was a meeting it was scheduled between our shifts so day would stay over for another hour for it and night would be in an hour earlier for it. Usually the hour meeting only lasted 30 to 45 minutes so both crews would just talk together. I think that's one of the reasons why there wasn't a rivalry between both shifts like you see in most places.",
            "I work night shift at an airport and my previous airline started requiring night shift to pick up basically all of morning crew's responsibilities. We said fuck that and all went to another airline thats been trying to get us for a while. Their night shift went from 2nd best in the country 3 months straight to so bad they lost their contract in the last year.",
            "I started work at 10:30 so day meetings mean I stay over and get Overtime. But since all overtime has been canceled I don't go to meetings. Management does not like that because to get me they have to open overtime for everyone. Sucks being them.",
            "Because they don't want you to think, they want yo to submit.",
            "You shall be named Saint Compliance",
            "As a fellow shift worker, I thank you sir/madam",
            "With my job, i have to schedule multiple shifts and multiple time zones. We first looked for crossover times. Either late afternoon or early mornings. Basically at shift changes. It wasn't hard and everyone in the organization understands the reason for it. It is better to be convenient for everyone than convenient for just one person. It builds contempt among the shifts. And damn sure all sessions were the same. If one group had snacks, all groups had snacks. All information presented was the same and all groups treated equally. Senior executives were onboard with this concept too.",
            "When I worked overnights at the hospital, our manager would schedule mandatory meetings for 7am. Unfortunately for me, they were always when I was off the night before. I flat out told her I wouldn't be there, because I wasn't spending 2 1/2 hours of of my day on a city bus to get there and back for a one hour meeting and one hour pay - for a meeting that 99% of the time only concerned the nurses. She would have talks with me for missing, but I simply repeated that it was a waste of my time. Eventually she set up Zoom so I could attend from home.",
            "You ended up saving the university a minimum of 1.5 hours of overtime for each night crew member who attended the morning meeting. More, if they have a minimum 'shift' time rule.\n\nThat is, if they were paying for the 90 minutes you all had to spend in those meetings. They should be if attendance is 'mandatory'.",
            "A perfect example of how a problem can be an opportunity to improve the situation for many people, when handled properly.\n\nOf course, \"handling properly\" often requires somebody with power to treat people with less power as fully actualized human beings with their own perspective and value. And that is, unfortunately, surprisingly rare.",
            "No one ever thinks about the night crew and normal management tends to side with the day crew because they have to be around them all day, but at least when I was on the night crew, we got more done, with less people.  For a long time there was just two of us and we would get near 50% more done, but the funny thing was, we could have totally kicked ass if we wanted to, we never wanted to.",
            "You’re a night crew hero!",
            "Sometimes a little pushback makes everyone's lives better, including the company resisting the change.",
            "I worked for years for a major semiconductor manufacturer. Catered meetings regularly ran out of food about 75% of the way through the staff. And this after getting RSVPs so they would know how many people were attending.\n\nThey seemed to think that engineers would be happy with one taco (or comparable). 🙄",
            "Never had any of that on night shift, at three different businesses.\n\n**#1:** Night shift was the dominant shift (800+ staff on nightshift, compared with \\~700 for day and afternoon shifts combined).  Plus the sheer volume of staff meant that split meetings/training sessions/etc. would be required anyway.\n\n**#2:** Rotating shifts, so everybody was night shift at some point.  Many of the staff were long term, right on the ball.  Because of this, the various shifts were always upfront about what was happening.\n\nFirstly because you couldn't get away with anything because it would be spotted immediately; secondly because you were always working with another shift 4 hours offset and they wouldn't want to get blamed for your fuckup; and thirdly because what you did to me I will soon have the opportunity to do to you.  With malice aforethought.\n\n**#3:** Only nightshift as required, and that would invariably involve the boss working nightshift.  If he's going to be put up with working nights, he was charging like a wounded bull and would throw around money like nobody's business.  \"I fancy a kebab/pizza,\" meant that shortly said foodstuff would be arriving.  He looked after me especially well. A) because we got on very well, and B) because I was the only person who didn't bitch about working nights.",
            "Lady’s and gentleman. The next candidate for the next presidential nomination of United States of America goes to Mr. Supervisorconfession.",
            "I used to head home 100% too dangerous to drive when day shift had meetings or training for us way past quitting time. I’m really surprised I was dumb enough to do that way back when. “But, my work needed me to…” wouldn’t have been a very good excuse.",
            "How is an email not written notice?",
            "i feel like i read before like a month ago...",
            "Not so malicious compliance.",
            "Navy for ten years. Was always night crew for watch. But they held train g middle of the day until we got a new 1st class and chief who preferred nights. They made the training during our watch and it took only one training for the day crew to realize what trouble they caused us. Tracings got split I two for the the two watches. Works great when you have someone in your corner.",
            "As much as this is Malicious Compliance, it’s actually a better example of leadership!\n\nGood on ya!",
            "We have 3 shifts in at HQ at my employer as well as multiple intern was tional timezones.  Any major meeting is held at least 3 time to to make sure all shifts and areas get the information.",
            "My company does it's quarterly meeting at 8am PT/1600 GMT-London/0300 Sydney, and 6pm PT/0200 GMT-London/1300 Sydney,  \n\n\nWhich covers most of our worldwide employees during regular business hours.",
            "Not all heroes wear capes!",
            "So speaking up works",
            "I worked in a big store that had a staff canteen. It was cheap food, but decent enough. Issue, it was only for the day staff, night staff like me, got a choice of whatever was in the vending machines, chocolate and sweets. Also, this machine liked to jam and not give you your food. So of cause I would ram it to get my food unstuck, same as everyone else who was in the middle of their long ass shift and were hungry. We all kept getting in trouble for ramming the machine and not getting someone to come fix it. I asked who to ask, because no one was around on the night shift. Turns out we had to wait till day shift arrived to fix it. Yeah, no. I kept ramming it until I left. \n\nAlso, one job liked to have staff meetings after work that were mandatory and weren't paid. I refused to go. One, it was on a night I had an activity and two, they already made us arrive early and leave late without paying us constantly. I wasn't going to their damn meeting. They also stole a week of holiday off all of us 0 hour contracts because we didn't use it in time. No shit, our manager told us we didn't get any holiday and refused it until the last minute. We all got one week off, I lost a week and got told by hr it was my own fault I didn't use it, along with about five other people. Total bull. I requested it to be carried over to the next year.",
            "What does \"HUGE\" stand for?",
            "I worked nights for 15 years by myself....(IT). I was well respected and I just started asking for a gift card to the same place. They were happy to oblige.",
            "And did the “speakers” who had to come for the night shift complain about having to adjust their shifts?",
            "@Se U I",
            "I always think about [the night crew](https://youtu.be/G4ApQrbhQp8).  (warning: it's a robot chicken clip, though this is a tame one)",
            "So what was the purpose of the meeting?  I mean, if you just didn’t go, would it matter?",
            "Is night crew the new inquisition?",
            "Our night shift does 4-tens (Monday-Thursday, 2pm-12am). The company will have quarterly meetings (just updates on numbers, new things, new people, anniversaries, business) and will make it a lunch thing (with door prizes and stuff). Always on a Friday. They get lunch catered and everything. Tried asking if we can get the updates Thursday night and a pizza party. \"I mean, we COULD. I guess, of that's what EVERYONE on your shift wants, but everybody needs to be on the same page.\" Now we take Monday off the week of \"business parties\" and come in at noon (when the business lunch starts) and get off at 10 (still getting paid for over an hour for the lunch, rather than just 30 minutes). I think we got a win, honestly (the catered lunches are MUCH BETTER than pizza).",
            "\"upper management likes to have some all staff meetings where everyone in   \nour department shows up to listen to them talk about how great they\"\n\nas someone who works in a relatively large university in the US, I can't begin to describe how true this rings about almost literally every management event. The last faculty meeting I went to was like 3 hours of \"enrollment went up 1%! aren't we growing awesomely?\" but at least there was free lunch",
            "Too bad that the CEO when on one of his ego trip...  Trip and fall off a 100 meter cliff",
            "I worked at a manufacturing company that had three shifts and all meetings were held on three separate shifts, which meant if anyone in the office side had something to present, they showed up at midnight, 8 am and 2 pm. I always thought that was how it should be. Accomodating shift workers instead of accommodating salary workers.\n\nBut then, the entire town was shift work and everything, even childcare centers, grocery stores and clinics were set up to accommodate shift work.",
            "My boss never understands this still! I work 1-9 but sometimes I work overtime and so I stay past midnight. My badge apparently doesn't let me out after midnight and his solution is always just come in early. Like ok then you come in at 3 instead of 6 AM.",
            "If it was a weekly or monthly meeting, I'd say, great.\nSince it happens twice a year only, it is quite petty.",
            "I feel that way about my job. Part of the company includes a call center. No one ever thinks about the call center folks. We are the red headed step child, yet they rely on us so much.",
            "I've been working night shift for almost two years now and my family STILL doesn't understand how my schedule works (or, they do understand but simply don't care).\n\nI constantly get guilt for not showing up to family events around, say, noon on a Saturday. No matter how many times I explain to them that I dont even get home from work until 8am Saturday morning, they will say Im being lazy and don't want to visit or whatever else lame reasoning they give.\n\nAnd yeah, my job also requires me to come in monthly in the mornings for stupid meetings that rarely pertain to me. So I've made it a habit to call-in for my upcoming shift that night after each meeting. Make me drive 45 minutes back to work 5 hours after my shift ends for a 3 hour meeting and then expect me to come back 6 hours after for another shift? I don't think so.",
            "Okay, I actually just got a perfect example of this TODAY! So I work nightcrew in fast food and we're swapping to a new app. They're making us come in for small groups to learn the app and they're doing them all either in the morning or early afternoon. So all high schoolers who work 5 to 10:30 will have to come in at 9AM on a Saturday to do this training bc they won't do a training at 6PM! Mind you the person who does this training does work this late."
        ]
    },
    {
        "post_id": "p0s0be",
        "author": "gr82bhpy",
        "title": "Don't call me Mommy? Okay.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/p0s0be/dont_call_me_mommy_okay/",
        "score": 14693,
        "num_comments": 723,
        "created_utc": 1628474589.0,
        "selftext": "Apparently this happened when I was about 3 years old, but my mother has held it over my head for the last 20 years.\n\nMy mom was on the phone with my grandmother and I wanted to get her attention for something. I did what any 3 year old would do and tugged on her leg and called \"Mommy\" out to her. She gave me an annoyed look and kept on with her conversation. Whatever it was I needed it must have been really important and I kept at it. After a few more tries, she eventually shouted at me \"Stop calling me mommy!!\"\n\nFrom that moment on, my first little malicious compliance switch went off in my head, and I only called her Mom or Mother from then on. She was always heartbroken for years after this and often brought it up. I was her only kid and it embarrassed her to no end being called mother in front of other people when I was so young. And to rub salt into the wound, I still call my Father \"Daddy\" to this day.",
        "permalink": "/r/MaliciousCompliance/comments/p0s0be/dont_call_me_mommy_okay/",
        "comments": [
            "I did that once and my kid started calling me Beatrice. It’s not even my name",
            "Omg I have almost the same story! My mother used to be much more strict (asian tiger mom) and one of her big things was respecting your parents. When i was about 8 or so my mom sat me down and said \"you are getting older, and calling me mommy is too childish for you.\" My dad chose that moment to pipe up and say \"you will never be too old to call me daddy\". My mom instantly wilted and tried to go back and say \"oh no you can still call me mommy maybe just not in front of others\" and i was like NOPE!  Never once called her mommy again.",
            "That’s not a bad outcome. My 13 year old son calls me “peasant”.",
            "Should've started calling her by her first name.  /s",
            "I don't know why this triggered this memory but when I was 5 I asked my mother \"mom what's your name?\" And she said \"it's mom\" and I said \"no, what's your real name and she looked uncomfortable and thought for a bit and then said \"Aimee\" and I replied \"I already knew that and that's a boring name\".\n\nSorry this wasn't that interesting but I felt compelled to share.",
            "Less malicious, but when I was about 5 my mom told me I couldn't have a Dr. Pepper to drink and 22 years later I still have never had one. That \"mom said it so I guess I won't\" kid reasoning can be powerful and strange lol",
            "My mom *will not* respond if you're trying to get her attention by saying, \"Mom!\" It's out of pure stubbornness and it's incredibly frustrating, especially when you *really need to get her attention!*\n\nSo me and my sisters go, \"Mom. Mom. Mom. ***NAME!***\"\n\nIt pisses her off but amuses other people.\n\n^(*Like just fucking respond when we call you the first time. Jesus...*)",
            "School mate always called her mother “mommikins” and non stop in every sentence would be “mommikins”. \n\nMy adoptive mother was annoyed at me getting her attention one day when I was about 9, “mum, mum, hey mum, mum!” She said “stop calling me mum!” \nI replied “mommikins!!” \nI have never been so terrified of her than the 4sec after uttering that word, “dont you ever utter that name again or you will eat your tongue for dinner”. \nShe has been first name or ms surname for over 20yrs now. \nI believe she regrets it, and often asks over the years why I don’t call her ‘mum’. That moment cemented in my mind that I didn’t have a mother, I had a female caretaker.",
            "My mom said she wasn’t my mom when I was 6 my dad came to pick me up and I don’t talk to her anymore lots of other things in play there but yeah",
            "I have called my father 'father' since I was a toddler, so about 34 years. My parents have no clue as to how/why I chose to do this. Apparently it started out with me calling him 'daddy', as that's what they taught me, but out of the blue it turned into'father' and stuck. Relatives would berate them with 'why do you make her call him 'father'?!' as if it was akin to calling him 'sir' and something they were forcing me to call him, instead of 'daddy' or 'dad'. But my parents didn't care and thought it was adorable lol. \n\nOnce I had my own children and started teaching them to talk using 'daddy'and 'dad' for their father, I started using 'dad' once in a while for my own but not often. I use 'father' to refer to my husband when speaking to my kids, too. I can't explain why I do it now, I guess it just feels like the right word in that subconscious millisecond before a word comes out.",
            "\"O'kay Lady luv you buhbye\"",
            "Mine decided randomly to call me Felicia Karen... And I'm her Dad. Not every day, just when she wants to be snippy.",
            "It's amazing how children that young can react to things like that. And if you can personally remember the day it happened, that speaks to how deep it effected you. The tone your mother tells it to people in usually determines how we react to it too. And sometimes something else you saw before that point could have traumatized you a bit if it related (like if you saw a movie or TV Show where a mother said that to her child and the mom in that media really hated the kid)\n\nI'm willing to bet an apology spoken in a soft, teachable moment tone, would have soothed your 3 year old self. If she never did that, she kinda set herself up for that. XD I kinda wonder if anyone ever talked to your mom or dad about little you calling your mom \"mother\".\n\nStill this is the best malicious compliance I've seen coming from a young child. XD Good job 3 year old OP.",
            "Unfortunately at 3, I don’t think your compliance was out of maliciousness, but hurt. 🙁",
            "My 4 year old daughter would call me and my wife “mommy” and “daddy” exactly the first 2 times she calls us. Thereafter she annoyingly and very loudly reverts to “LISA!!!” (My wife’s name) or “MY NAME”. Failing that she will go to “My Name, I’m talking to you, don’t you have ears!?”",
            "I... literally can't imagine ever telling my daughter that. No matter how annoyed I am. She earned every bit of that compliance.",
            "My youngest has me saved in his phone as Khaleesi Mother of Dragons and my oldest has me saved as Spawnpoint. My youngest has his dad saved as Square ☠️",
            "I tell my kids that my name password has temporarily changed for X amount of minutes (depend on the length of time I want silence from “mom mom mommy mama mom mama mom mom”. I said if they guess the password they are welcome to address me but otherwise they must wait until temporarily disabled OS can restart. I hope I’m not traumatizing them. They know it’s a joke and a fun whimsical way to set a boundary. Plus they aren’t 3.",
            "I stopped calling my mother any synonym for ‘mother’ around the age of fourteen, once I finally realised no amount of love I could put out would be received back. Started just calling her by her first name. Went on like this until she disowned me. Funnily enough, my other siblings started doing the same thing.",
            "My oldest calls me Birth Giver. LoL",
            "She said stop. You obliged. I see no issue here that she should be upset about especially if she requested it (even out of annoyance).",
            "What kind of response is \"Stop calling me mommy\"? What purpose did that even serve her???",
            "I once told me ex-wife’s 5-year old daughter one time who just called me “dad”: “I’m not your dad”.\n\nBecause at that time her biological father was very much still involved in her life so I didn’t want to step on his toes.\n\nRegretted it instantly. She never called me dad after that - always just by my name.",
            "I've always preferred 'Squadron Leader'.",
            "Not of my culture\n\nBut can somone explain to me the social difference bethween mom, mother, and mommy?",
            "I remember the day my dad told me that. He called his mom \"mommy\" though which I found very unfair.",
            "Mothers underestimate how much power their words hold",
            "Apparently when I was little my mom upset me once and I told her \"You're not my friend anymore.\" She responded with, \"I'm not your friend, I'm your mother.\"",
            "Maybe we're related.\n\nMy mom said something like \"I've changed my name to shit, and you're not allowed to say that\" when I did the \"mom...mom...mom...\" routine. \n\nDon't have kids in your 20s, folks.",
            "I told my son, when he was five after an hour of mom look at this mom where are we going mom guess what mom I farted mom when are we leaving mom (instert literally any sentence or question here) I was going insane. So I said look, kid, for the next 5 minutes you're not allowed to say mom, hoping to help break him of using the title like verbal punctuation. With out skipping a beat child says \"hey taskedout look at this\" fuck.",
            "When I was about eight years old, my father slapped me for calling him \"dad\", saying \"I'm not your dad, I'm your father.\"  My mother said \"No, you're not.\"  Boy, did it get quiet around the house after that.  I never called him by anything after that.  I would only talk to him when ordered, and never used any kind of name.  When he died, I only put his birth and death info on his headstone.  My siblings demanded I put his name down.  I told them if they wanted it, they could pay for it.  There is a headstone in Banning, CA with no name on it.",
            "My mother went on a rant about how I ruined her life when I was about that age. She threw me outside (this woman should not have had children), where a neighbour found me and asked, \"what has Karen (not her real name) done now?\" I asked who 'Karen' was, she told me that that was my mother's real name. \n\nFrom that day to this day, I have never called her anything else, nor have my younger siblings. I knew even then that that woman was not my mother in any sense that mattered. Every time that my younger brother, the golden child, calls her 'Karen' instead of 'mum', I feel a small burst of satisfaction. Neither of them knows that I did it deliberately.",
            "I once referred to my step-dad as “father”.  He swiftly corrected me, because biologically speaking, he *wasn’t* my father.  For the rest of his life, I sent him “Father’s Day” cards with the word “Father” scratched out and “Dad” put in its place.",
            "Anyone who holds something against you that you did when you were a child - and THREE YEARS OLD - no less is a petty so-and-so. Who does that?!\n\nThe only parents who I know who do this are abusive narcissists. Not saying your mother is, OP, I don't know your situation. But that's how bad doing something like this is.",
            "The artist formally known as Mommy.",
            "Mine figured out how to spell my name as soon as letter were learned and from then on, for several years, called me by the spelling… no matter the circumstances, day to day or emergency or crying or laughing, this little tot would yell the spelling.",
            "I don't understand why some people are coming after you, when you were a child and not your mother who was an adult and capable of choosing her words carefully. \n\nit's moments like that, that OP described, that become foundations for us as people who feel things and so on. \n \nif \"mother\" wanted to be called \"mommy\" then she shouldn't have snapped and said what she said to  an actual child.",
            "Play stupid games win stupid prizes and this one was doozy! You were 3 yo and acting perfectly normal, your mom overreacted  and ended up with years with hurt.  I'm sure every time your friends said mommy to their mom's in front of her it was a reminder that she was never going to hear that word from your lips again and it was her fault.",
            "aww this breaks my heart",
            "My dad once jokingly said to stop eating all his bread. 6 year old me stopped taking lunches to school. CPS was called.",
            "My mom has a running joke in her family that she's a witch. Apparently, a lot of weird things used to happen around her when she was a kid, idk. So my grandmother sometimes called her witch, and then when I was a kid, she would call me mini-witch. So one day, we called her on the phone to chat, and when she picked up, she said, \"Hi, mini-witch.\" So I responded back, \"Hi, granny-witch!\" I think she didn't like that very much, because she got all silent after, but she couldn't actually get mad at me for it. Never called me mini-witch again, though.",
            "She's lucky you didn't start calling her by her first name.",
            "Neither of my parents would/will respond to any variation of Mom or Dad. I had to resort to yelling their actual names, especially if it was important. My mother is a little better then my father, but I'm still yelling her name in public spaces to get her attention. My father is a lost cause, and what is worse is he accuses me of never calling him *Dad* which isn't true I usually say *\"Dad! Dad! DAD! RANDY!* to get his attention.",
            "Haha when I was 7 or 8 my mother threw the remote at me when I made some noise while she was on the phone. And another time she told me ‘don’t call me mummy, just take me as a random aunt’, and notice I used ‘mother’ in the sentence? I don’t even use ‘mom’.",
            "Never called my mom “mommy”, nor my dad “daddy”. But, I was a fan of saying “mom” or “Ma” over and over again to get my moms attention. One time when I was about 5-6 I was doing just that and she told me that she was changing her name to Mergatroid and that when I could pronounce it, she’d answer me. Well, I got it first try, and I’ve been calling her that every now and again my whole life. I’m 25 now. It’s always fun explaining why my phone will light up with the name “Mergatroid ❤️” and I answer with “hey Ma”. I usually only whip it out nowadays when she’s not paying attention to me and I really want her to, typically because I’m doing/saying something just to annoy her lol. It’s great when she’s trying to ignore me in public, she will starts whisper yelling at me and her face gets red. God I love it. She put me on this earth, it is my sworn duty to embarrass/annoy her at any given opportunity. She chose this, not me.",
            "Got what she asked for",
            "My son got his two other siblings to call me mother. All those brats still call me mother!",
            "“She was heart broken for years after this…”\n\n“And to rub salt in the wound…”\n\nMy guess is that there is something more going on here to continue something a person knows is breaking their mother’s heart, and to gleefully rub salt into wounds after two decades.\n\nI hope OP has a better relationship with their mom than this implies- like this occasionally comes up as a “remember when you said…”.  If it is still hurtful to your mom, and OP still does it anyway twenty years on, but OP loves their mom otherwise, I’d encourage OP to talk with mom about why it is hurtful and why it is still happening.\n\nI miss my dad and there are so many hurtful things I said which I thought were funny or clever or that “he needed to hear”, but which I recoil from the memory of now.  It adds another layer of mourning on top of the loss- wishing I could take it back, wishing I could tell him I was wrong.\n\nOn the other hand, if Mother deserves this, if she has shown in other ways that she does not deserve to be “mommy”, I might stop it anyway, particularly once OP has a kid of their own.  Little ones learn how to treat their parents by watching others, even if we don’t realize it, and this might be a good spot to correct that tradition before it becomes fate.",
            "It was her fault.  So so sad some things people say to their kids, spouse or friends.",
            "I guess it would be accurate to say you had Mommy issues.",
            "My ringtone for my mother is the Wilhelm Scream. \n\n[The Scream](https://youtu.be/cdbYsoEasio)",
            "My grown ass son (he’s the middle son and third out of four) will text me 20 times in a row with just one word. Mom. Mom. Mom. He used to say that over and over and over as a kid. Good thing I love him. 😆😆",
            "My mother once said she wanted to be called \"mother dearest\"and my brother picked it up. He quickly shifted to using it unironically (as these things go), and it annoyed the heck out of our mom, but she couldn't do anything about it.\n\nTJ, the brother, has a way with people, so she wasn't even annoyed. Hell, he got away with calling her \"woman\" because that's what Jesus called Mary. Boy wasn't even religious. He managed to get away with so much like that, but he was also incredibly diplomatic. It wasn't favoritism... It was just how he handled life.",
            "My thirty year old daughter has called me Jose since she was little. I'm a woman named Julie.",
            "My mom went on rage mode with me telling me how much she hates being called “mom”. Like your mom she didn’t actually mean it but was taking her anger out on me like she always did. \n\nSo I invented “madure” (rhymes with manure) which meant mom to me. It actually is super helpful in crowded areas. Every mom perks up at “mom” but only my mom perks up at “madure”. \n\nPreteen me did future me a solid.",
            "She asked for it",
            "I mean, that's kinda on her. Would it have killed her to pause her phone conversation and ask what you wanted? Since the person on the other end was your grandmother I'm sure she'd understand. (Also, \"Stop calling me mommy\" is a very mean thing to say to a 3 year old)\n\nIncidentally, did you ever refer to her as \"Mommy\" after that? Aside from this one thing, do you have an alright relationship with her?",
            "My mom used to do the same. Then say \"dont bother me unless it's life limb or eyesight.\" Or when I would say something was unfair she'd hit me with \"Life's not fair get used to it\"",
            "I was really into Eminem when I was in elementary school. I would rap along with his music. One day I was being an inconsiderate little shit and singing along to his music while my parents were watching a movie. They either said shut up or be quiet. Either way I think that's why I don't talk much now. I remember feeling guilty but also insecure. Like my voice was annoying or repulsive. I still have a hard time with public speaking or talking on the phone.",
            "My mom used to say, “I’m going to change my name to Shit and dare you to say it!”\n\nShe never did follow through.",
            "My mother is the epitome of a helicopter parent so I call her Maternal Overseeing Monitor (M.O.M)",
            "\"Mother, I require sustenance. Bringeth forth the milk and the cereals.\"",
            "Every time my youngest calls me Father, I reply by calling her Spawn.",
            "My mom told me she changed her name but wouldn’t tell us what it was lol.",
            "In my daughters phone I am Fartsniffer69420. Feel the love?? In mine she is Chonky Raccoon.",
            "Something like this happened to me too. I've spent the last...I don't know, 25 years calling her by her name.",
            "Both of my boys call both of us parents by our first names. Mum and Dad never get used at all.   \nI'm in my 70's now, and nothing's changed. I don't really mind, at least they are talking to be still, I count that as a win.",
            "Gotta love stubborn children. When I was a kid and around the age that kids would switch from calling a parent mommy or daddy to mom/dad I called my mom \"mom\" once instead of mommy and she immediately teased me for it. So she remained mommy until I started calling her Madre. Point is, maybe don't tease kids about stuff like this lol.",
            "Not too long ago my mom said something about everyone being sisters so I deadass looked her in the eye and said \"Okay, sister ___-\" and continued the conversation. She was shocked. I don't even remember what the conversation was over anymore.",
            "My mom tells the story of how I, as a toddler, walked up to her in the kitchen one day and announced, \"Mommy, I have a new name for you.\"\n\nThat was the last time I ever used the word 'mommy'.  She's been 'mom' ever since.",
            "Do you think there is a fine line between being maliciously compliant and being petty?",
            "I'm confused as to why you would even say that to your child. \nIs mommy something offensive where you come from?",
            "Mother, don't tell your children not to call you mommy. Don't tell your children not to say that word. Not what you meant to say. Ohhhhhh mother.",
            "Are you sure it wasn't just to say \"Hi!\" or \"Look at what I can do?\"?",
            "I grew up on a boarding school and my parents where teacher and principle. So i always called them by their real names, since all the other kids called them that.",
            "My father would call his father \"daddy\". He would say the same thing: \"Stop calling me daddy! You're not a baby anymore\". Now he doesn't call him anything, he says \"hey you\".",
            "My mom did this so my siblings and I called her snake instead. I’m in my 40’s now and she still thinks it’s hilarious.",
            "Exactly this! Did this too - have called my mother her first name since I was four. I’m 50 now…never called her mom again. For consistency, did same for my dad.",
            "“Ma” was prohibited.",
            "Haha, little kid compliance is the best. My daughter just busted it out one day, she started calling me by my first name for almost 9 months, mummy was still mummy. But I was pretty much always Gary (but my real name) when she was about 5!",
            "I am assuming you are female because of the way you described tugging on your mother's leg and politely calling \"Mommy\".    \nWhen my daughter was two her mother was talking with a neighbor who had a boy about the same age. My daughter wanted something and walked up to her mother, tugged on her skirt and said \"Come please. Come please.\" The neighbor looked at this and then sighed and said \"Aren't girls wonderful\".",
            "Sounds like she fucked up.",
            "Why would a mom say that tho? She could have just said I’m in the phone or distracted you or something. I would never tell my son not to call me daddy even tho he does like 500x a day",
            ">Whatever it was I needed it must have been really important and I kept at it.\n\nYeah, that must have been it...",
            "My mother kept me from my father for so long that i grew up calling him by his first name as well as his dad. By the time i was like 8 he came down to my level and literally threatened my life if i didn't call him dad & his dad papa...i called him dad till i was like 16. It was Sean from then on out and still is although i rarely talk to him",
            "My parents were teenagers when they had me so when i was born my grandparents couldnt die fast enough so i had to many people to call grandma so i just started inventing names. My dads mom is grandma pika & I'm now 21 years old and i still call her pika.",
            "Aww, that’s just sad all around.",
            "Christ my mother still hasn't forgiven me for calling her 'dear' when she had a full on tantrum when my stepdad and I were trying to help shower and dress her when she broke her arm (my mother is not the best patient). It slipped out when I was asking her to co-operate and she went ballistic.",
            "hehehe! Sorry but, if \"you can't handle my <mommy> at your most hectic you don't deserve my <mommy> at your best\". Love it!",
            "Inb4 a bunch of people bring up The Coneheads’ “Parental Units” reference but a significantly lower number of individuals knows it comes from The Coneheads. Not gate keeping, I just love Dan Aykroyd.",
            "When my cousin was 2 he was saying “mommy mommy mommy mommy” I’m the grocery store. My aunt got fed up and said “don’t say mommy again” so he started repeating her first name over and over.",
            "I used to own a daycare. I named\nit Eva’s Mom, as I was known for\n years😂😂",
            "I never did call my mother mommy. She was always mama to me.",
            "My parents actually get called Female and Male parental units. Like for the sole fact that I’m not really comfortable calling them mom and dad anymore",
            "My daughter calls me babe. It's super fun to explain while standing in line at the grocery store.",
            "Excuse me ma'am, /r/nuclearrevenge is over thataway.",
            "Ha. Pretty much the exact same thing happened between my father and I. One day he snapped at me when he was obviously upset about something that had nothing to do with me and demanded I \"show him the respect he deserves and call him sir, not dad, sir\" I laughed in his face and told him he doesn't deserve that much respect but not to worry he'll never have to worry about me calling him dad. I started calling him by his first name 12 years ago and honestly I tried calling him dad and it just felt weird. I think I stopped thinking of him as a father way before his little episode",
            "Don't call me mother, not fit to 🎶",
            "According to my wife, her oldest sister would sometimes say \"I swear I'm gonna change my name to bitch and dare them to say it!\" When talking about her kids being super annoying.",
            "My daughter has two mums and I am MumA and her other mum is Mums1 !",
            "How sad.",
            "It's actually YOU holding it over HER head",
            "I often refer to my mum as mother. Never called her \"mummy\"\n\nI don't like the word \"mummy\".  And no, I'm not all that interested in Ancient Egypt either.\n\nMy father has decided to disown us - my sister refuses to call anything other than his name or \"him!\"  I still use dad out of habit, nothing more.",
            "I have a similar story. When I was a couple of months old, my mother couldn't breastfeed me due to some medical issues. So after a while when she was able to feed me I didn't accept to be fed by her.",
            "My two year old sometimes likes to call me Dad instead of Daddy. So to get her back... I call her Hol instead of Hollie! She quickly goes back to calling me Daddy shortly after that!",
            "I think saying mummy or daddy is kind of babyish even my 5 year old calls my our mum, mum and thats how we all refer to her, calling her anything else like mummy or mother just sounds like something a rich kid would say"
        ]
    },
    {
        "post_id": "z6ofo6",
        "author": "itcoop",
        "title": "Maternity wear",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/z6ofo6/maternity_wear/",
        "score": 14670,
        "num_comments": 377,
        "created_utc": 1669615018.0,
        "selftext": "This happened several years ago. \n\nAfter onboarding a new job, I was told I could hire an assistant. The HR director, Kelly, handed me a stack of resumes, told me about a friend's daughter, and bumped \"Kat\" to the top of my interview list. Kat passed the tech test with high scores and interviewed well so, I hired her.\n\nKat showed up to work on time, had a good attitude, performed well on assignments, and was generally a pleasant person all around. After probation, Kat was excited to tell me that her last raise was enough to get an apartment with her BF.\n\nIt was a couple months after her raise I started to notice Kelly spending an inordinate amount of time talking to Kat. The convos sounded personal / cordial and Kelly was friends with Kat's mom so, I didn't think much about it... until one day Kelly barges in my office.\n\n\"Did you know Kat moved into an apartment with her boyfriend?\"\n\n\"I might have heard something about that.\"\n\n\"Well, Kat is pregnant and her mom is devastated...\" and proceeds to fill me in on the details on Kat's personal life.\n\nUncomfortablly, I interrupt acting like I have a lot going on.\n\n\"This really isn't any of my business.  If there's something related to Kat's performance that we need to discuss, please fill me in but as for me Kat is doing a great job.\"\n\nA few months pass. Kat's baby bump is starting to show. Kelly is again in my office.\n\n\"Kat is not in compliance with the dress code.\"\n\nLast staff meeting, Kelly handed out a dress code policy with a collage  various womens shoes and dresses and suits presumably cut from fashion magazines to assist us determine what was acceptable from what was not. I picked up the policy and the Clipart sheets with a stare reminiscent of Jack Nicholson's I'm Of A Mind To Make Some Mookie! Batman / Joker scene.\n\n\"Is she wearing something in the 'not allowed' clippings?\" As I began to spread the clip art around my desk.\n\n\"She isn't wearing maternity clothes\" as Kelly points to the bullet about maternity clothes in the policy.\n\n\"Well, the policy clearly says maternity wear is allowed. Kat is clearly pregnant and she is wearing clothes, so...\"\n\n\"You know what I mean when I say maternity clothes. Clothes from a maternity store!\"\n\nI told Kelly that I would talk to Kat, which I did. Kat filled me in that there was some drama with her mom not liking her BF, that Kelly is involved. etc. etc. I just told her to read the policy and be sure she complies - and no matter what, to trust me: I had her back.\n\nThe next day Kelly is in my office telling me that Kat is again not in compliance with the dress code. At this point Kelly knows I'm getting frustrated.\n\n \"OK. I'll talk to her again. This time I want you present because I'm going to give her a formal warning and assign remedial training.\"\n\nI bring Kat into my office with Kelly present and formally read off my prepared statement making it clear that it will go into her permanent file.\n\n \"Kat, you were given a verbal warning yesterday to comply with this dress code. Because it is not clear to me what is or is not a violation of this policy, you are to report to the HR office 10 minutes early every morning for the next two weeks for dress code inspection. Report to me if HR finds your dress unfit. If you are found to be in violation of this policy and are unable to correct your dress before the start of the work day, your employment will be terminated.\"\n\nBy the time I'm finished, Kat is tearing up and Kelly is staring at the floor, speechless. I dismiss Kat.\n\n\"I hope that this is the last I hear about this because if I do, I'll fire her.\" as Kelly, speechless, walks out of my office.\n\nI told Kat not to worry about any of this; we have them where we want them. So, for a week Kat reported to me that her clothes were fine per HR inspection. At the beginning of the second week she was chuckling, \"Kelly told me that I look 'very nice' today.\" Attitudes began to change and everyone was smiling.\n\nI got called to the red carpet by Jim, the CEO. He tried to keep a straight face as he recited what he heard was going on and asked me to cut the remedial training short becuase it was embarrassing the HR staff.\n\nStraight faced I said, \"Well, Jim, if I stop the remedial training, I'd have to fire Kat. Company Policy clearly states that failure to complete a formal remediation plan is immediate termination. It is very clear... there is zero tolerance.\"\n\n\"You can't fire a pregnant woman for what she wears. I'm asking... no, I'm TELLING you to stop.\"\n\n\"Stop following company policy?\"\n\nLaughing he concedes \"Ok. I am rescinding that ridiculous dress code policy effective immediately.\"",
        "permalink": "/r/MaliciousCompliance/comments/z6ofo6/maternity_wear/",
        "comments": [
            "Sounds like Kelly needed remedial training.",
            "Your part, weaponizing company policy to get Kelly out of your and Kat's hair, I get.\n\nKellys part escapes me. I'm still baffled by what her goal here with the dress code policy was to begin with. Kelly's shocked reaction to your remedial training gambit suggests she wasn't trying to get Kat fired.\n\nWhich leads to it not being work related at all, but something to do with their personal lives? The only possible goal I can see there is driving her away from the BF and back to mom. But it doesn't make sense how dress code complaints would accomplish that.",
            "\"I want you to slap her. DO IT!\"\n\n\"Slap her? I've got a gun. I'll shoot her!\"\n\n\"Wait! Don't!\"",
            "At least the CEO knew the policy was bullshit quickly and got rid of it",
            "Imagine have a boss with a spine. I wish I could meet Kat just so I could ask what it's like. You're Great OP. If every manager was half the boss you were, we wouldn't even need subs like antiwork anymore. You're a rare breed, friend.",
            "You sound like an outstanding person. We need more of you everywhere in the world, was a very good read.",
            "The dress policy stated that pregnant women MUST wear maternity clothes?!\nFucking hell. What a ridiculous rule. Effectively you'd be expected to wear maternity wear from the day you return a positive pregnancy test. Or women who don't show a bump the whole way through.\n\nWhat if you were post pregnancy but really loved how comfortable your maternity wear was? Is there anything staying that non-pregnant people are NOT allowed to wear maternity wear?",
            "Nice to actually see some bosses have their employees back.",
            "Feels like you could have primed Kat in a 1-1 before reading the formal statement to her in front of Kelly so she didn't get unnecessarily upset but otherwise good story!",
            "Is there something I miss or I can’t connect here? \n\nDespite the good ending, were you betting on Kelly wouldn’t cause more drama during the daily dress code inspection? \n\nHow did you know this would work?",
            "What is it about HR that it attracts the lowest common denominator, laziest, bottom-feeding sycophants imaginable? I understand that they are there to serve the company not the workers, but why are they so irreconcilably shit at even that?",
            "Kelly should be fired",
            "'Allowed' does not equal 'required'.\n\n/thread.",
            "This is one of the most wholesomely-maliciously compliant stories I've heard here. I'm so glad you shared this.\n\nI'm just curious, when you said Kat was tearing up, was it because she was upset about getting the formal warning (though thankfully it sounds like she knew your hands were tied)? Or was it because she was trying to not crack up about you admitting you had no clue what Kelly wanted?\n\nMan I never thought I'd be able to say something like \"Wholesomely-maliciously\" in my life. ...Maliciously Wholesome? Malsome? Wholiciously?",
            "You have to be the bestest best Boss EVER! Bosses like you make happy workers.",
            "Love this. Great story. Always nice to see a win for pregnant women. \nI occasionally deal with workplace discrimination in my line of work and love to see when MC causes a change for the better.",
            "Reminds me of what the senior attorney at my last job always said to HR when we discussed issues, especially when management wanted to make an exception.\n\n\"We have a policy. Follow the policy. If you insist that the policy should not be followed, then the policy needs to change.\"",
            "Everybody that works for you is very lucky!",
            "Well written story, and entertaining!",
            "The number of times I've seen a CEO of a company violate his own policies... <shudders>",
            "Kelly needs firing.",
            "Was Kelly trying to get Kat fired so she would have to move back into her mother's place?",
            "Sounds like hr Kelly needs to go back to school and learn to keep personal out of the office. \n\nGood for you but I’m sure it was scared as hell at first!!",
            "I think my English is not Englishing. How did OP and Kat maliciously comply to the dress code?",
            "Best thing I've read all week",
            "Finally, a CEO that steps in and does something useful rather than let HR be tyrants, albeit a bit late.",
            "Kelly got fucking beurocratically suplexed lol",
            "HR's *job* is to protect the company.  Clearly Kelly had forgotten this, and OP took action to remind her of it.  In ways that ensured that not only was both the company and the employee protected, but should anything happen to the employee then Kelly would potentially be on the hook to the company for her actions that violated the law.  Was there possibly a better way to have done this (at least from the company's perspective)?  Probably, but Kelly clearly also needed to be taught a lesson in staying out of other peoples' business...",
            "I quite literally just finished my yearly manager ethics and HR training. Kelly should have been referred to have remedial training and been warned that her behavior constitutes harassment and retaliation. It should have been reported through the chain of command.",
            "Love it. Win Win Win !\n\nKat was okay.\nKelly learned to deal and about personal drama vs work.\nStupid company policy was cancelled.",
            "We all need friends like you 👌",
            "As someone who wore a lot of flowy shirts that were not technically maternity wear, Kelly is the one who needs some HR training.",
            "Companies need more managerial peeps like you.",
            "I wonder what people thought of me when I was pregnant. I didn't wear maternity clothes at all. I existed in sweats and leggings with baggy shirts and hoodies.",
            "I FUCKING LOVE THIS.",
            "People that power trip are the worst",
            "BTW, I think Kat will work for you for a long time, giving you everything she can!   Talk about a loyalty builder!!",
            "This is very confusing to read. It sounds like the poorly made dress code was removed, which is good, but Kat was made unnecessarily stressed out over something that sounds ridiculous. I get that the plan was kinda clever, maybe company politics is harder to deal with here  making the plan necessary but I get the sense that a more straightforward solution would have been better when considering the mental health of those involved.",
            "The best story on office politics I have heard.\n\nYou cut them off at the knees.",
            "Why wasn’t Kelly penalised for sharing personal medical information? Coming into your office like that to tell you about Kats pregnancy was incredibly unprofessional and shouldn’t be tolerated in a work environment.",
            "This would even be more hilarious if OP was a man. \n\n\nI can tell you from many years of experience, men have absolutely no problem with whatever a woman wears until another woman makes an issue of it.",
            "Serious office space judo. A worthy r/MaliciousCompliance. Bravo.",
            "Dude one word RESPECT!",
            "Ahh HR being nitpicking idiots. Seeing this made me laugh a bit as I had to deal with some nonsense from them this morning.",
            "Best one I have heard of in a while",
            "Kelly equals a remedial \"Karen\" and Karen's never ever win.",
            "Lol too good to be true. Must be high paying jobs to put up with that kind of bullshit.",
            "I don't get why everyone thinks this is such a heartwarming tale.  Kelly abused her power (lol --HR) and still has her job? \n\nWHY IS THIS A HAPPY ENDING?",
            "I feel like making a pregnant woman parade in front of HR, coupled with giving a reprimand for anything clothing related is a scary area.  OP - you are brave.",
            "HR person here!\n\nKelly is a HUGE discrimination lawsuit waiting to happen.\n\nI'm surprised Kelly still has a job.",
            "Good for you! More bosses need to be like that",
            "> Laughing he concedes \"Ok. I am rescinding that ridiculous dress code policy effective immediately.\"\n\n\"Per CEO Jim, company dress code rescinded effectively immediately. All pending or in-progress disciplinary measures relating to dress code are hearby dismissed and all records pertaining thereto are to be purged.\"",
            "Sounds like the boss was like trying not to say even he doesn't like that bitch",
            "I do hope after this incident, Kat went LC/NC with mom.",
            "A win for everyone but Kelly!",
            "Ummm you let this go on way too long. What dress code requires maternity wear?",
            "I didn’t think that policy is even legal under title IX. The dress code is discriminatory against pregnant women.",
            "Is this a pre-school or a business? People need to grow the F up.",
            "This is exactly the sort of reason I got out of management and got into software development. Like wtf is wrong with these children! No, I’m not your dad, brush your teeth before you go out to sell, stop hitting your sister, and focus on your damn work for once! \n\nNo drama. Just computers doing exactly what you tell them to do, with only yourself to blame when it doesn’t work right.\n\nSadly, it always comes back around to being people problems anyway, but at least I can ignore it 90% of the time now.",
            "That's a good boss to have",
            "I don't love this story. OP made their employee uncomfortable simply in order to win a power play with HR. They could have gone over HR's head immediately about that dumb policy. Also there was no guarantee that it would have worked out this way and the employee really could have gotten fired for this if HR was truly deranged. So yeah. Not a fan of this story and I hope OP gains some empathy and better leadership skills.",
            "You sound like a really cool boss.  Not everyone has money for maternity clothes.  As  I recall, this was 26 years ago though, they seemed to cost a bit more than regular clothes.",
            "I wouldn’t have wanted to put a pregnant woman through all this. I feel like this was handled poorly. I would have just shut Kelly down on my own without involving Kat. This could probably have been considered harassment.",
            "An I missing something, what was pregnant girl wearing that was not up to dress code?",
            "n i c e",
            "The CEO is a nice person. I love the ending there!",
            "\"Wear a maternity dress, or you're fired.\"  \n\n\"But, I'm only 3 weeks along.\"  \n\n\"You're pregnant, wear maternity clothes or else.\"\n\n\"You only know I'm pregnant because I told you.\"\n\n\"You heard me.  Or you're fired.\"\n\n\"You're fired.\"\n\n\"I'm not pregnant.  I miscarried.\"\n\n\"OK, hi girlfriend, wanna go for a beer after work?\"",
            "Boss sounds like an OK guy, Kelly needs a new drama tv show",
            "You, I like your style.",
            "I hope Kat got OT for those 10 minutes every day.",
            "Definitely need a follow up to what happened afterwards 🤣",
            "Somebody made this into a TikTok. Voice synth with video game for video",
            "what was the “remedial training”?"
        ]
    },
    {
        "post_id": "1134t9w",
        "author": "Ok_Ganache2137",
        "title": "Boss says the time reported by the punch system is law, watch me use the law to my advantage",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1134t9w/boss_says_the_time_reported_by_the_punch_system/",
        "score": 14662,
        "num_comments": 538,
        "created_utc": 1676485488.0,
        "selftext": "Not a 100% this qualifies as malicious compliance, but here goes:\n\n8 or 9 years ago, I was baker at a popular fast food chain in my country. I always been a model employee, so one day I was surprised the manager asked me into her office. She reprimended me because I had taken a 45 minutes (instead of 30) break one day the previous week. I remembered that day, and indeed I had taken more than 30 minutes, 31 minutes to be exact, and that was because on my way back, someone had a concern that I took the time to resolve. I explained that to her but she was adamant that the system rounded to the nearest 15 minutes and that if it said 45 minutes, than there was no way I could have only been 1 min late. She made it clear that it was my fault and that the punch system is law since it can't lie.\n\nOn my next shift, I looked into it. On the punch system, there is a way to see at what time you punched. I realized that the system was not rounding the amount of time you worked/were on break, but rather the time at which you punched. What happened that day was that I punched out at 10h22, rounding to 10h15, and got back 31 minutes later at 10h53, rounding to 11h, hence the 45 minutes break.\n\nNow in my position, I had the luxury of choosing when to go on break as long as they didn't run out of anything during that time. From that day till the day I switched job a few months later, I made sure to go on break just after the cut-off, and back just before the next one. For instance, punching out at 10h08, rounding to 10h15, and back-in at 10h52, rounding to 10h45. I thus ended up with 44 minutes break, that according to the system were only 30 minutes long. One time, a supervisor told me that it seemed like I was gone for a bit longer than usual, I replied that she saw me punching in and out, and that she could go confirm in the system if she wanted to. Never heard from it after that.\n\ntldr: was chewed on because of a weird quirk of the punch system, learned how to use it to my advantage and had 14 minutes extra on all my breaks.\n\nEDIT: The manager was also under the impression that the system rounded the amount of break time to the nearest 15 minutes, not the ins and outs. That's also what they tell during recruitment, hence why I initially thought that's how it worked.\n\nThe supervisor who noticed was a part-timer, not the same person as the manager. I also don't think they actually cared, just found it strange.\n\nBefore leaving, I did share the trick with a few coworkers, but since cashiers have a supervisor that coordinate break time, they can't really be late. For them, 1 minute late is actually noticed by someone, let alone 14.",
        "permalink": "/r/MaliciousCompliance/comments/1134t9w/boss_says_the_time_reported_by_the_punch_system/",
        "comments": [
            "Had this same system at a job a while back. Started leaving at 3:53 every day. I beat traffic when I did that, and it automatically rounded up to 4:00 every time. When a coworker asked about it I replied \"I wouldn't play the game if there wasn't a game to be played.\"",
            "In the age of artificial intelligence and vast computing technology, the idea that they need to have the system round to the nearest 15 minutes for any reason but cruelty is ridiculous",
            "Excellent malicious compliance. Micro-time-managerss is one of the most annoying things employers can do. The manager/hr department at my last job started nitpicking the time we badged in and badged out of the building, so even though I got all of my work, was on salary, ate lunch at my desk, and stayed late, I got written up because sometimes I would badge in a few minutes after my scheduled start time. Great way to get a good worker to stop trying.",
            "Good on OP for gaming the system after the system gamed him.",
            ">She made it clear that it was my fault and that the punch system is law since it can't lie.\n\nBut she admitted it rounds, so if it's rounding it's literally lying",
            "I think is dumb how anal some managers can be.\n\ndid it affect my job performance? no? then shut it.",
            "Unless and when a dire necessity, almost no job hinges on you being there one minute more or less.",
            "Punch in systems that round to the nearest select time should be illegal, dollar general(this was like 12 years ago not sure if they still do that) did this and it was so freaking stupid",
            "This is why companies have wage theft class action lawsuits filed against them. When we updated our time clocks, we eliminated rounding entirely. That said, before the update, we also knew how the rounding worked and would routinely change an employee’s clock in or out time for lunch so they weren’t cheated of the 15 minutes of pay.",
            "Don't forget that you can also show up on-time at 6:07 and your shift ends at 3:53.",
            "She got 14 free minutes of work and was complaining?",
            "This sounds like the system at my old job, where the bosses wanted us to clock in at, say, 8h53, rounding to 9, and clock out at 5h7, rounding to 5.\n\nMy coworkers and I collectively said no and ignored subsequent passive aggressive memos about being “team players.”",
            "My team has a lot of people who are chronically late.  I get an hour+ of overtime some weeks for just waiting the ~5 min for them to show up and then talking to them so they know what they are walking into for a few minutes.  Out at 8~9 mins past the hour means I get the OT for the 15.  The manager doesn't seem to mind, or at least hasn't bothered to get people to be on time.\n\nIt's not a very smart system, but then again nothing our company does is very smart.",
            "You were taking a \"Baker's Lunch\" ! \n\nGood MC OP!",
            "Well played gaming the system!",
            "The funny part is, if they were to ask how to improve productivity and anyone says \"invest in a better punch card system\", they'll look at you like you grew another head. Just like if you were to say that *any* piece of equipment needs to be changed or updated",
            "Blows my mind that companies really do treat people like that, tearing someone’s ass out because of a missed minute here and there. Companies like this don’t deserve loyal employees, they don’t deserve employees at all.",
            "Aahhh Kronos.  Yep, did payroll for an oil company in Ohio that used this time clock system.   They used it to their advantage,  requiring employees to clock in at 5 till their shift, and the person coming off to clock out at 5 after.  This gave them 10 minutes of overlap, so one employee could watch the other count their cash drawer down without paying for 2 employees...",
            "The hospital I work at still rounds to the nearest quarter hour, for coming in, lunch break start and end, and leaving at the end of your shift. It's done on a computer, they could round the time stamps to the nearest minute, but they don't.",
            "A timecard system rounding time in/out sounds like wage theft.",
            "I used to be salary, but my job switched us to hourly because of some bullshit. I asked at what time the time clock rounds, answer was 7 minutes before and after.\n\nFor the past more than a year, I've been clocking in at 6:52, clock out for lunch at 11:53. Back in at 12:37 and leave at 3:23.\n\nNobody has said anything to me. I told my lead what I've been doing and he's been following suit. Except sometimes he'll use it to grab some OT he only worked halfway for.\n\nFuck the system and fuck corporate America.",
            "Oh i remember the days at 10 til people waiting 3 minutes by the clock to get that extra .25 lol",
            ">For instance, punching out at 10h08, rounding to 10h15, and back-in at 10h52, rounding to 10h45.\n\nMy first retail job had the system run *exactly* like this. Idk what your system is, but we had a way to fix the times, then we'd just print out the report showing the time changes made, and had the manager and employee sign off with the reason the change was made written down.",
            "The clock-in system at my work has a similar feature. Plus or minus 7 minutes will round it to the nearest 15 minute increment. Clocking in at 10:07 or 9:53 would be read by the system as a 10:00 clock in. It’s something we always explain to new hires, just so they know ;)",
            "They used this exact time scheme at my last place of employment and I abused the shit out of it. Our 30 minute lunch was paid if we stayed onsite, but i didn't like to pack a lunch so I would punch out at 11:08 run to a close by food establishment and hurry back before 11:23 so i effectively never left. I would then take a 60 to 90 minute break to eat because my management didn't care about what we did onsite they only care if we left, lol.",
            "Hahaha, the joys of TimeClockPlus! I always took advantage of that system, and figured out if you timed it right, you could rack up about 120 hours a year. No one in management ever seemed to catch on to that loophole, either.",
            "very malicious, very compliant. congrats on the free money.",
            "That’s called working the system lol. Well done",
            "You are a working person’s GOD, Or GODDESS. Whichever is appropriate. I hope you passed your break glitch on to a coworker or two!!",
            "OP, that’s awesome! You really showed your boss who’s the boss. I hate it when managers are so nitpicky about the punch system. It’s like they don’t trust us to do our work. Good for you for finding a loophole and getting some extra break time. You deserve it.  Enjoy your 44 minutes of freedom, my friend. You are an inspiration to us all.",
            "Nothing better than beating the system by technically following the rules",
            "The fact these things round to 15 minutes is stupid. Its a fucking digital system, its unbelievably simply to pay by the minute. Theyre just used for wage theft from employees.",
            "The place I used to work rounded one way, clocking in and another clocking out. Don't think they ever got turned in for it. @$$ h013$!",
            "My job has this same system, and I learned about it a hard way as well. Now I use it to my advantage, but I don't abuse it because my job is good to me. If they were scummier, I would be too.",
            "They do this at my work and get pissed off when I don’t do anything for 15 minutes. I’m not working for free. Give me the write up I don’t care.",
            "Sounds like a wage theft case asking to happen against this company",
            "This makes me feel good. Well done!",
            "genius",
            "I asked my boss about this actually. He low key mentioned that as long as as the clock says 30, his boss’s boss won’t ask his boss question, and in turn his boss won’t have to ask him question. Therefore, I should help both of them by pretending the conversation did not happen. \n\nSo maybe that’s also your manager’s intention.",
            "One company I worked at divided an hour by 1/10ths of an hour or 6 minute blocks. If I knew I was going to be one minute late, I took my time and I was five minutes late...same pay.\n\nDear bosses. If you have a good employee that is doing a good job and is a valuable asset...relax when he is a couple minutes off once a month. They aren't abusing the system, and you giving them sh!t for one incident (when his work is all caught up and good quality), all you are going to do is piss them off and get them thinking about the possibility of a better job somewhere else...",
            "Manager: \"The punch system is law since it can't lie\"\n\nPunch system: *has been lying literally all the time*",
            "Every worker but you at this place has a wage theft case. This punch system is wildly illegal",
            "We had a system like this at the last place I worked. We would game it hard, and one day the general manager told me I am committing time clock fraud. So I asked him if he’s been stealing workers time because the transaction goes both ways. Never heard anything else about it. New places gives you credit for every minute. Way more fair for everyone. Rounding should be illegal.",
            "I worked at a retail grocery store for 20 years and you always punch in before xx:07 and punch out just after xx:53. They can call it time theft all they want, they stole plenty of mine.",
            "Fuck Panera Bread",
            "That system would allow for all kinds of wage theft. Glad you beat them at their own game.",
            "this sounds like tims lmao",
            "I do this when I punch out for lunch! Our lunch is 30-45 mins no more or less and it’s round to the clock. Scheduled lunch starts at 9-9:30pm and so I punch out at 8:46 and it rounds to 9 and I punch back in at 9:44 and it punch’s back down to 9:30 effectively making it 45 mins. To be fair our scheduled time to leave is 3am but we can’t until work is done and so it’s always past 3 essentially so I know others do this with their lunch too so I support it. Why work like we got free healthcare anyways.",
            "Noice.  I approve.",
            "Hehe.  Possibly better than accusing them of wage theft.  :)",
            "This is the way",
            "Great idea. The time card machine earlier in my career wouldn’t dock you 15 mins if you clocked in 7 mins late. But for awhile, the HR manager would stand by the time clock in the morning and give anyone late so much grief. He would write down everyone’s name even if it was just 1 min! I was salaried but my office was in earshot of the machine. It was ridiculous! Later they got rid of the time clock and that horrible mgr!",
            "I worked at a place that the punchclock rounded to the nearest 15. You bet your ass i didn't get up from my desk every day until 508",
            "I worked in the Middle East. We had an electronic system which recorded ins and outs. The time worked was calculated by the last out minus the first in. \n\nI was a VP. We VPs refused to log our hours. I had an employee who logged so many hours, but never got anything done. These workers were engineers but paid hourly. I asked HR in another country to send me all his ins and outs for a few days. \n\nThis employee had an apartment very near the office - or most likely a partition or bed space. He would go get dinner, hang out at home, then walk the 10 minutes back to the office and have an in recorded around 10 pm and an out recorded at 10:10 pm. He was paid for 12 hours every day and he actually worked less than 6 hours. \n\nHis nationality of workers were not paid well, so maybe this was his MC. However, the Owner was not too happy about it.",
            "Yeah TH is the worst place to work fucking hate that place.",
            "I quit clocking out for lunch and just let the computer system auto-correct for my lunch break.  At the 6:00 mark, it automatically applies a lunch break.  My lunch breaks have been exactly 30 minutes for years and nobody has noticed.",
            "I’m paid to the nearest 15 minutes, rounded up or down by 7/8 minutes. But my time is recorded exactly.",
            "That's amazing. Bravo!",
            "This reminds me of when I worked two different jobs for the same company. I had to switch between tasks for each role many times during the day, so HR said I could manually track my time and enter the two roles in two summarised entries per day. The line manager for one of my roles (who, by the way, did not outrank the HR manager who approved my manual entries, she just decided to have a power trip over me one day) decided she wasn't having that and told me to clock in and out every time I did a task for her team. I didn't even bother arguing, just did it, and after the next pay cycle where she had to approve 2 weeks' worth of 15-30 min clocks she quietly asked me to go back to the previous arrangement 😂\n\n(My other manager just had me continue to summarise my time spent with his team, and payroll just paid the total sum of hours which had to be worked out by the power-tripping manager, so this did not negatively affect anyone but her which is why I went along with it.)",
            "I did the same thing at my first job! It would round to the nearest 15 minutes. Punch in for my shift at 3:07, leave from my shift at 5:53 😂",
            "Oh I loved that system! It wasn't a secret at all in my department when I was at that job. In fact we'd spend a good few minutes explaining it to new hires.",
            "Used to have a time system like this once, and I always kept track of my hours. I would get confused when my paychecks showed me working fewer hours until I figured it out. After that, if I was ready to clock out at :06 or :07, I'd go kill 2 minutes then cock out.",
            "Good optimisation my friend",
            "9000th upvote",
            "This sounds like a great way for the employer to commit wage theft.",
            "Was it a company that came from Hamilton and used to bake donuts?",
            "My old work was like this. 7 minutes one way and it would round down,  7 minutes another and it would round up. I'd gain almost 15 min a day from my clock in and out time. Always left at 3.23 and rounded to 3.30. And clock in goal was 7.07am to round back to 7am",
            "Home Depot definitely used this system in the early 2000s. Easily defeated by a grill igniter from the garden section.",
            "I worked at a restaurant many years ago where the punch system would round forward on punch in, and round back on punch out. So in at 8:01 turned into 8:15, and out at 3:59 turned into 3:45.\n\nOnce we realized this, we all started punching in a minute early, and punching out a minute late (example: in at 7:59, and out at 4:01).\n\nEventually, a whole bunch of us current and former employees made a group complaint to the labour board, and the restaurant was forced to pay thousandssss of dollars in backpay and penalty fees.",
            "That is so very petty and gave you an extra 15 minutes for a break while only using 30 according to the punch system. The manager noticed your longer breaks but since she believes the punch system is the law, there you go!",
            "This. Absolutely this.",
            "[removed]",
            "I love this oh so much",
            "We have no idea what the manager actually thought. They probably didn't think about it at all and just said whatever came to their mind.",
            "14 Strikes again.  I tell you, the way it shows up in my own life is un Can He.  \n\nImpossible!  ;)",
            "Congrats, you figured out how to abuse the 7-minute rounding, just like every hourly employee just about everywhere. \n\nFYI they can probably see the rounding in their software and may come after you eventually. I was in charge of payroll verification at a previous job and technically I was supposed to reprimand people who did that.",
            ".!?!44444444?44?444\n4?4?4?4??44?4??44??4 \n44?4\n4  3t 3?3b 33 \n 33\n 4   333 4y33 ?333 3 333t 3 3y 33 y 3t 3  33 33 33333\n4  3f3  3 333  33 3t3  33  3 33 3\n4 3\n4 b  333\n 3  44b34ttt4  3 3\n 3 3 33 33  3 33 3  3y3t3 3 3b 3 3 33 3  33 3t3t  3 3 33 43 3 33 33333  43  33  3 33  3 3 44 43 3 3 34b 33 44 44",
            "This is theft.  I know bosses are shitty, but a shitty boss is no excuse for theft.",
            "I also have a \"punch system\" that doesn't lie but I don't think you'll like it as much as yours.",
            "Was this Panera? This sounds like Panera fuckery.",
            "Had a similar situation happen to me in an afterschool tutoring job.  System did the exact same thing as this one so I would clock in just before the cutoff so it looks like I started the whole 15 minutes earlier and then I would clock out just after the cutoff so it'd round up to the next 15 minutes.  Was able to get an extra 30 minutes of pay out of this.\n\nSadly didn't take too long for this to get called out by the higher ups since we were small teams and easy to audit.  I was able to use it to my advantage to give myself some wiggle room when I was running a little late or if I wanted to cut out a little earlier since they only could see the overages, not the unders like in your case.",
            "Which law did she think made her statement true?",
            "The time clocks where I work are the same way. I'm always clocking out at 53 so i can go home \"on time\" but early.",
            "Our system rounds to the nearest 15 for punch in and out for the day. Lunch break, however, is to the minute. I have used that little tidbit to gain an extra 7 minutes here and there at the beginning/end of the day and always take a 28 minute lunch. That 10 minutes a week isn’t a big deal to me but adds up to almost another hour per pay period which is worth it.",
            "I did the same thing with my job, realised the system rounded the clock in times so I would arrive late and leave early but the system would say its right on time",
            "While not as bad, when I worked in a fast food, I noticed that when you're on break, the punch would tell how much time it's been. Later I noticed that whether you punched at 1 second or 59 seconds, it would still count it as one minute when the minute rolled over. So I would wait for the minute to change, then punch my break in.  \nAlso one time, I worked in a daylight saving time change of hours, and the hour repeated itself when I was on break. The time shown I had been on break was like -20(I think I had a mixup and took an extra 10 minutes)",
            "Winner",
            "Rounding to the nearest 15 min is just wage theft.  Systems today, even cheap ones, can do it to the millisecond.  Fuck them.",
            "I work for a large hospital corporation and it’s the same thing, rounding to the nearest quarter hour but both actual punch and rounded punch are shown on the system. So it would be easy to see if you’re gaming the system.",
            "At my work for our various job sites we use the 7 minute rule also. Almost every work order that goes into the office would be 8 minutes after the quarter hour. No sense in losing quarter of an hour pay for no reason.",
            "For a time I worked for a hospital system that had a similar time clock system, and all it caused was huge lines of staff at the 7 minutes on either end of a shift so people could maximize their clocked time while not breaking any rules.",
            "I helped setup the time and attendance system at all old job. Why don't you just use seven minute rounding? It's so much more fair...",
            "There was a guy who pulled that at one place I worked who was reprimanded, and when continued, fired.",
            "Yeah, they just started doing this at my place of employment.\n\nEvery morning we have to fill out a opening \"check list.\"\n\nThe first thing on the \"check list\" is:\nDO NOT ARRIVE PRIOR TO 6:45 or 7:45 am. (We are scheduled to arrive at those times.)\n\nThe second thing on the \"check list\" is: CLOCK IN.\n\nWell I always arrive at 6:45/7:45, but often I would not clock in until 6:46/6:47.\n\nManagement repeatedly would tell me, I need to work on being time. My reviews suffered. \n\nI repeatedly pointed out, the \"check list.\" I am following the rules. I am here, everyday, at 6:45/7:45 even if the time clock shows me clocking in a minute or two later.\n\nFast forward to November 2022,\nWe are now on a system they does just what this does.\nI clock in at 6:46, rounds to 6:45.\nWe, me and my coworkers, always wait to clock out on the round up end.",
            "The system at my job works similarly, but my managers are cool and tell us to exploit it",
            "I had a job with this system and one hour lunches. The amount of us who punched out at 12:08pm and in at 1:07pm was hilarious. We got a 59 minute break but were only charged for 45 minutes. They asked us to stop, but legally we were taking the minimum half hour.\n\nMy current job pays by the minute, so you bet my lunches are exactly the 30 minutes they give me. I want every penny.",
            "A lot of places that use Kronos have this same shortfall.\n\nBeen using it for nearly a decade now lol.",
            "This is still common today with many punch systems. And many people take advantage of it.",
            "I used to work at a place that used punch cards and calculated minutes as decimals, ie, 10:51 to 11:01 would be 10.51 and 11.01. If you clocked that, it'd be ten minutes of real time, but it would be calculated as 0.5 hours.\n\nThey forced you to take a lunch break, so if you did 8:59-12pm and 12:59 to 6pm, total time would be 8 hours and two minutes, but total calculated time would be 8.82 hours.\n\nDo that every day for a two week pay period and you manufactured 8 hours from 20 minutes.",
            "UK here: I don’t think I’ve ever worked for a company that rounds at all in the last thirty years: our clock systems & payroll all pay to the minute.",
            "I will never again stand for a 30 minute lunch break.  Fuck that.",
            "Sweet! Lucky I never worked with punch-ins. Still don't. Sure, people will notice when I'm late, but that'll usually be based on the train schedule. And I always inform my colleages beforehand, so no issues there.",
            "Gotta be in by Bob I used to say.\n\n8:08 and your late. Be at work by BoB",
            "My employer uses the Workday app, and it used to do the same. Oddly, it rounded the time stamps for worked time, but not daily commute time. So I would clock in at say 8:07, the punch would round down to 8:00, but my commute time from 7:30-8:07 would overlap it. On the flip side, if I clocked in at 8:08, it would round up to 8:15 and there would be a pay gap between the commute time ending at 8:08 and worked time starting at 8:15. \n\nNot many people noticed because it’s typically only a few minutes here and there, and chance should average it out to a even balance. Not to mention, it didn’t actually round the displayed time off- it showed the exact time you clocked in at. But the paid time at the top of the day would change depending on how it rounded. \n\nI always clocked in at 8:07, 8:22, 8:37, or 8:52 (when I get to my first job, I’d wait until time to clock in) and I’d always clock OUT at 4:08, 4:23, 4: 38, or 4:53. That way the pay always rounded in my favor. Eventually workday fixed that bug, so now I just put my time in normally lol",
            "Could you take lots of short breaks? Start break at xx:08. End break at xx:22. On the system it counts as a 0 minute break from xx:15 to xx:15. Get paid for 14 minutes of not working. Repeat every 15 minutes, for the whole day. Officially you took no breaks. But actually you only worked for about 7% of the time.",
            "Had something like this but used it for a 15 min lunch instead of going the long way so I could be done earlier",
            "At my job if you don’t punch out for lunch, they take 30 minutes automatically, so I punch out for a minute then punch back in when I’m not hungry 🤫",
            "You got away with this because management and corporate were distracted that they found someone to work for the minimal pay. If they paid you a real wage then your time would have been watched closer.",
            "Same thing at my work. I leave 7 minutes early every day. Boss complained once and said I need to stay the full shift. Did that for about a week and went back to leaving early.",
            "One company I worked for, remotely at the master clock would set the clocks early to force workers to start and come in early and reset the master clock at after lunch to make you work later for free.\n\nI was required to sync all the PCs time to the national NIST service Atomic Clock.  I was called in and chewed out as the PCs time  did not match the wall clocks.  I simply stated the wall clocks were off and changing before work and after lunch and this was no accident.  Facilities was then dragged on the carpet in front of me.  \n\nHow did this all start.  Someone had complaint to the Labor Board.  I was not the one, but I saw it coming.  Now the master clock was done away with and battery operated clocks installed to save electricity.  Automation of clocks was so nice.",
            "Yup, I remember that system from my first retail job at Petco. I never used it that way for lunch breaks, but everyone always waited until 8 minutes after the hour to punch out at the end of the day.",
            "I miss systems like these. My current job uses Kronos and I fucking hate it. My favorite was at Walmart back in the day; they gave us an hour lunch  half paid, half unpaid along with 2 15 minute breaks and management was often nowhere to be seen. I worked overnight in the back by myself and most days was unbothered. I used to milk the hell out of that time",
            "My last job had a punch out clock. We had to punch out for lunch and I would forget a lot because I ate at my desk and would just start working whenever I was finished. Sometimes it would be a 15 minute break, sometimes like 45. Eventually my boss started noticing and bugging me to punch out, so I just always took the full 45 minutes from then on and would use my spare time watching movies or playing games on my phone. Maybe go for a walk in the park. I would refuse to answer any questions or deal with any work related stuff, even if it was \"real quick\". I ended up getting a lot less done all so he could save a few bucks not paying me for a break.",
            "We had a time clock like that years ago, rounded 7 min back and 8 forward.  Now we're paid to the minute.  If I work 8 hrs and 5 min I get 5 min of OT.",
            "Greggs?",
            "This sounds like wage theft with extra steps.",
            "Shitty retail chain I worked at did this so I would take long ass breaks almost every shift. Also no one cared if I took an extra 15 occasionally so sometimes I would use this for an extra 30 with the rounding. As long as I brought my coworker on shift a coffee they were cool with it.",
            "Home Depot has used the same punch rounding system for years.  It was changed this year to pay based on the actual minute of the punch.  I am relatively certain that the topic of this OP was finally discovered by the powers to be in HotLanta",
            "But the system CAN lie, and does. You and your supervisor sat and talked about how it lies, and the company explained how it lies during orientation. \n\nIf it's not logging your exact in and out times, but rather rounding to any increment in any direction, then the numbers it is reporting are not factual.\n\nThese not factual numbers, that is, lies, are being used to serve a corporation usually at your expense. You jsut happened to find a way to tilt the lie in your favour. Kudos to you for that, but this whole story is about how the system lies.",
            "Under this same logic you could have started your shift late and went home early It's not your fault their system has such a flaw that results in time theft, I don't know what country you are in but in many Time theft is a very serious thing and if the company is the one doing it there are many legal penalties for them."
        ]
    },
    {
        "post_id": "ix2az2",
        "author": "eatapeach18",
        "title": "Ask me to slow down while driving through my neighborhood? Okay!",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ix2az2/ask_me_to_slow_down_while_driving_through_my/",
        "score": 14654,
        "num_comments": 371,
        "created_utc": 1600701186.0,
        "selftext": "I live in a very quiet suburban neighborhood with lots of active neighbors (joggers, bikers, dog walkers, baby strollers, kids playing ball in the streets, etc). The speed limit is 25mph, but when I see lots of foot traffic on the sidewalks, I bring it down to 15mph or even 10mph if I see a big group of kids playing in the street. \n\nThere’s this sweet group of kids who play basketball in the middle of the street eight doors down from my home. When they see cars approaching, they move to the curb and wait for the cars to pass before resuming their game. One day I was driving home from work and I saw the kids out playing, and their mother was on the front lawn talking with another adult. I slowed down to 10mph and went to the complete opposite side of the street as I crept by.\n\nA little while later she knocked on my door and complained about “how fast” I was driving and that I could have harmed her precious children. I said, “The speed limit is 25mph, and I was going 10mph. How much slower do you want me to go??” She said “I don’t care, just slow down or else I’m going to call the police! I have a doorbell camera so I can see you every time you drive by!” Okay crazy lady, whatever you say!\n\nThe next day, the kids were outside playing in the street again. I slowly approached, came to a full stop, and then I took my foot off the brakes and let the car crawl at 1mph. The kids stared at me all confused as it took me an entire minute to pass through their makeshift basketball court.\n\nI continued to do this a few more times until one day the mother came and knocked on my car window as I was crawling by. I lowered my window and asked if there was a problem. She said “Why are you going so slow? Are you stalking my children?!?” I said “No, of course not. You demanded that I slow down, so I am!” And I rolled up my window and went on my way. She comes banging on my door again and says “Don’t get smart with me! Now you’re going TOO slow!” I said “Are you saying that going 10mph is okay now? Because if you don’t like it, you can call the police.” She huffed and crossed her arms and stomped off my porch.",
        "permalink": "/r/MaliciousCompliance/comments/ix2az2/ask_me_to_slow_down_while_driving_through_my/",
        "comments": [
            "Tell her to not walk so fast across your yard.",
            "I respect your dedication",
            "had an older lady jump out infront of my car a few months ago because i was doing 20 in our neighborhood... (speed limit 25)...\n\nObviously i wasn't going insanely fast as i had more than enough time to slow down and stop while she stood there with her hand out screeching...\n\nThen she went full on level 5 karen meltdown about \"all you young punk kids and your speed racers treating the street like your own personal racetrack!\"...  i was in shock... then laughed and explained that i'm in my thirties driving an suv going less than the speed limit... \"i think we'll all be ok\"... \"but i'll tell the rest of the punks in their suv's to slow down\"\n\nher husband just started laughing, then she gave him the death glare and he turned around and continued down the sidewalk. \n\nHappened to catch her several times after that in roughly the same spot and she just scowled each day as i waved.  \n\nPeople are unreal.",
            "You should drive past her house again at 1mph.\n\nThis time in reverse.",
            "I bet she has her partner move all the furniture \"a little to the left\" all the time",
            "This has happened to me a few times.  My standing response is \"If you think the posted speed limit is too high, the city council is the correct forum to address your concerns.\"",
            "Anyone else remember the yelling, \"CAR!\" and getting the fuck out of the way for 30 seconds and life moved on?",
            "Petty. I like that shit.",
            "\"Officer, he went ROCKETING BY at 10 mph!!\"",
            "Ask her how fast she drives her broomstick",
            "As I read I thought “this guy got off and pushed his car through the danger zone”",
            "I feel for those kids.",
            "Tell Karen to never step foot on your property again or you’re calling the police.",
            "Must be a lovely person to live by. Armed with a door camera.",
            "exactly the reason I have invested in a dashcam and a gps signal for mph. I would respond with \"go ahead, I've got video feed of exactly how fast I go down this street\"",
            "I was a newspaper delivery guy for a while. End of one of my routes was a trailer park for 55+ folks and Im driving through purely coasting because there are 5MPH signs throughout and even coasting im going about 10. Old geezer came out yelling at me to slow down. I ignored him and get out to drop a paper on a doorstep and he comes up yelling he is gonna have me fired for speeding. I asked, \"Do you have a radar gun?\" What are you talking about?\" \"Well if you dont have a radar gun then you cant possibly know how fast I was going so you have no proof.\"  Case closed.",
            "[deleted]",
            "\"just slow down or else I’m going to call the police\"\n\nGo ahead, sweetie.  Let me know what they say once they stop laughing.\n\n “Why are you going so slow? Are you stalking my children?!?” \n\n\\*Jake Blues voice\\*  Yes.  How much for de little gurl?  Sell them to me.  Your children.  I want to buy them.",
            "I was coming up on a crosswalk in front of a elementary school one day. Kids just started crossing and I was still a good 50 feet from the actual crosswalk when I slowed to 5-10mph. Halfway there a woman that was walking with the kids speed walked into the middle of the crosswalk and stopped in front of my car that was creeping at this point. She flings her arms out to the side with her feet wide apart and she just nails me with this LOOK. There was still maybe 2 car lengths between my car and the crosswalk and she saw I was creeping. Like how far back was she expecting me to stop? I stopped -10ft away. She looked like she wanted to jump at my car and shook her head at me as she walked off.",
            "Okay, why did I never think to do this. I literally had the exact same situation in my neighborhood. Except it involves several families and a bunch of them have yelled at me and one came banging on my door. Same as you speed limit is 25, I usually go 15-10 depending on what’s going on I’m the street. Still to this day when I turn down the street the parents sometimes scream bloody murder at their kids like their about to get run over by a train or something. They act real dramatic about it like I’m going 50mph. So next time they are out there I’m going to creep along at 1mph! Brilliant!!",
            "[deleted]",
            "Exactly my level of petty. I like it. Now next time, do it in reverse.",
            "We have a serious problem of people driving 40-50mph in my neighborhood. I drive 25ish unless there’s people around (especially kids), then I slow down. On multiple occasions I’ve had cars tailgate me and even pass me because I’m going 25 in a neighborhood. I don’t get it.\n\nHowever 10mph is exceptionally slow and well within a speed that gives you plenty of reaction time should a child jump out in front of you.",
            "{Reverse through at 10mph.}\n\n“I’m doing -10mph! Are you happy now?!”",
            "Tell her she's talking to fast and you can't understand her.",
            "Is it bad that I hope this story is made up? Because if it’s true, then this lady is a whole bag of crazy, and I feel so bad for her kids.",
            "There is a main street in a nearby town that has a cop that will write tickets for 27 in a 25 zone.\n\nWhen I get to that street I go 20 and make sure there is always space between the needle and 25 on my speedometer. The best was when that cop was in the car behind me. There was nothing he could do for the 5 min it took to go into downtown.",
            "Go slow and roll on your horn the entire time. Give the kids the thumbs up and smile for the camera.",
            "If I'm going 10 in a 25 and someone bitches at me for going too fast, I'm going 25 from now on. I started out reasonable because I'm a nice guy and you didn't like it. Now I do what the sign says.",
            "Does this story need to go to r/entitledparents?",
            "Like in the Parks and Rec episode where the lady wanted the slugs gone but not all of the slugs lol",
            ">“Don’t get smart with me!\n\nI'm not, M'am. It just seems that way to some.",
            "I had a neighbour throw himself in front of my car like a suicidal pedestrian in front of a bus.\n\nI stopped and stared him down.  He started screaming at me to slow down.\n\nThe issue is that he wasn't yelling at me, he was yelling at all the speeders he didn't catch.",
            "sounds like 7mph might be sweet spot",
            "Omg. I am laughing so hard. Just picturing a xar going 1mph and some crazy lady literally walking up along side you knocking on your window 😂 \nThis was great!",
            "Lol you still answer your door? If I don't know the person, I assume it's either a Karen, a salesperson, or a serial killer",
            "I have to admit when I saw the title and as a mother of 2 small children, I thought I was going be against this malicious compliance. But this is gold! 1mph.... BaHaHa!!!!",
            "Been there! I went with 4 low, 4000 rpm at 5 mph",
            "Time to buy a taser \n\nIt’s not legal. But it might be worth it",
            "In some areas, it is against the law to play in the roadway and/or throw an object in the roadway. Next time tell her to call the police and inform her it is illegal to play in the roadway, even if it is allowed in your city or town.",
            "Bitches be indecisive",
            "[deleted]",
            "Are you driving a manual? I'd have fitted on the loudest, most annoying exhaust possible, then keep revving while chugging slowly in first. And when she invariably complains, I'll kindly inform her I've got to keep the car from stalling while going slow enough for her liking.",
            "Tie a rope on the sideview mirror and walk it like a dog down the road.",
            "I honestly don't know how people have the patience to entertain idiots like this, but more power to you.  She would have had me going from a 1 to 11 with her entitled banging on my door with that nonsense.  This is why my next house will have no visible neighbors.",
            "*“Why are you going so slow? Are you stalking my children?!?”*\n\nWhy, yes, I'm capturing them on my dash cam like you're capturing me on your doorbell cam. Isn't stalking wonderful?",
            "[deleted]",
            "Time to drive super slowly by, pop the car in neutral and rev the shit out of it. If the kids love it then keep doing it",
            "I would tell her I was going to call the police on her for trespassing, then start to count in the annoying tone that parents do at their kids.",
            "I hate when ppl tell me to slow down. I just think to myself \" shut the hell up lol\"",
            "This is how I deal with radar vans.",
            "Hell I would have taken a detour through her front yard (slowly that is)",
            "Beautifully done. I love it",
            "This might be one of the dumbest people on the planet.",
            "Tell her to mind her business. People like her think the world revolves around them, it’s infuriating",
            "This one is my favorite. This is the best one I've ever read on this subreddit.",
            "I would have just not opened the door the second time. Then I would go back to cruising by at 25 mph. \n\nFuck that bitch.",
            "Ugh. Karen.",
            "Nothing like this ever happens to me.",
            "They shouldn't play in the road in the first place.  Op may be nice about it but the reason for speed bumps is because some people refuse to slow down.",
            "Playing in the street? Her fault for letting them do that.\n\nMy dad would have whipped the shit out of me if he saw me get in someone's way",
            "The fun thing is that an automatic will coast at about 5mph. To go 1mph, you would have to be riding the brakes the whole time.",
            "I would tell her to call the police if she doesn't like how I drive.",
            "Yeah Karen's can't help the urge to shit where they eat it's just a part of their animal instinct",
            "Love this. Only thing I feel sorry for is the kids havig to wait for you to move your ass out of their playing zone. Otherwise, well played.",
            "Call the police in her for harassment",
            "Ohhh so petty...! But ohhh so brilliant! Love it",
            "tell her to go eat a peach.",
            "wear a mask and egg her house",
            "ok",
            "Honestly, the second time she came banging on your door like that, you should have told her that if she knocks on your door again, she'll be get a visit from the police about her harassment, then slammed the door in her face.  Let her knock again because she isn't taking the hint and call the police right away.  Once they knock on her door and have a word with her, she'll get the hint to cut her crap.",
            "Frankly, I'd just say screw it and report the kids for playing in the street. They aren't supposed to be doing it anyway and if it's going to stir up shit between neighbors, it's best that it comes to an end.",
            "lol what a stupid bitch.",
            "Call the cops on the children playing in the street.",
            "You perfectly Kyle'd that Karen, Kudo's. You'd have a gold if I weren't cheap and had premium lol.",
            "Now you’re just the creepy kid stalker prowling for children to run over.",
            "[deleted]",
            "Pretty sure OP meant their car door and on their way at 1 mph. OPs house/yard was not involved",
            "If you ever wondered wht the fly is doing when they land on your arm ?\n   \nThey're wiping off their feet",
            "You should have hit her with a DDT",
            "[deleted]",
            "[deleted]",
            "Neat. You were a smart ass to a mother who is frustrated with people driving too fast in her neighborhood.",
            "I am sure you were doing 10mph. What a load of Shit."
        ]
    },
    {
        "post_id": "d42qqt",
        "author": "bill1nfamou5",
        "title": "Never piss off your tattoo artist.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/d42qqt/never_piss_off_your_tattoo_artist/",
        "score": 14666,
        "num_comments": 603,
        "created_utc": 1568450859.0,
        "selftext": "Being Friday the 13th, while waiting for my tattoo, I was reminded of a situation a few years ago with my friend Liz who's my primary artist and an especially Karen type lady and her Kyle esque boyfriend (double k for both) who came in to get cheap ass tattoos.\n \nI watched this whole thing go down but wasnt involved per say.\n \nSo Liz was doing a quick custom job on me and my buddy Chris (yes we got matching tattoos, Star Wars Yin/Yang for those wondering) I went 2nd so liz and I could catch up. Double K bypassed the massive line out the door and down the stairs and walked straight up to the artist area to try to skip the line. This was shut down pretty quick and they were told there's a huge wait in front of them and they'll have to go to the back of the line. \n \nWell Double K didnt like this one bit and started to throw a fit. Like legit tried to pull me out of the chair because \"hes getting what he wants and I was here first\", she wasnt, i was there at 8 am to help Liz load in OJ and Doughnuts and the 10 people in line before me knew this too. \n \nWell one of the artists just finished and said \"I'll take you two\". We were all kinda flabbergasted by this but Liz got this big shit eating grin on her face so I knew something was up. I figured the dude would do a terrible job, go too deep, use the wrong needle, something to just royally fuck up their day but he did none of this. He pulled his flash sheet and said \"pick one\". Karen picked something and he asks where she wants it. Back of her ankle, so dude gets to work free handing it while Double K keep looking at the line like they won something.\n \nWell they did win something, the smallest tattoo I've ever seen. This thing was no bigger than a dime, from 10 feet away all I could see was a little black spot on her leg that looked more like a mole than a tattoo. Double K lost it. Screaming about him assaulting her and forcing her to get a tattoo and they're gonna call the cops and all that. Then they tried to skip out without paying. They were rather impolitely informed that theft of service is a felony and that cops are only 10 minutes away. They tried to pay up the $13 but that's where the guys brilliance really shone through. \n \nHis sheet said \"Custom\" at the top. All custom tattoos were $31. Not only did this lady have a very tiny, and very intricately detailed tattoo, she only had a $50 on her and they had a big ass sign at the register that said simply \"NO CHANGE\". Double K ended up paying the shop minimum anyway, but she got her tattoo ahead of the line.",
        "permalink": "/r/MaliciousCompliance/comments/d42qqt/never_piss_off_your_tattoo_artist/",
        "comments": [
            "She asked for a \"13\", but they drew a \"31\"?",
            "What I'm wondering, did double-k want cheap-ass tattoos or cheap ass-tattoos?",
            "Is a no change policy legal? That seems sketchy",
            "The part that seems made up is where Karen tried to pull OP out of the chair and nobody seems to mind... and another tatoo artist just casually gets him to get tattoed without making a big deal out of someone trying to pull said OP out of the chair.",
            "[removed]",
            "[removed]",
            "I don't know... I'm all for malicious compliance and all that, but purposefully permanently (without procedures) tattooing someone with something you know is ridiculous for cutting in line seems a bit excessive.",
            "No Regerts",
            "Yeah this too much. None of these artists sound like professionals.",
            "If a shop can afford to setup for $13 accounting for their time, needles, tubes, ink, stenciling, and hopefully sterility... That's gonna be a no from me dawg.",
            "A cheap tattoo is not good and a good tattoo is not cheap",
            "This belongs in /r/trashy, not here.",
            "[removed]",
            "As shitty as these person are it’s just not ok to do that.",
            "[removed]",
            "A line outside a tattoo shop? These aren’t haircuts. Every session for my sleeve was like 3-5 hours and usually my guys only session that day tattooing. Am I missing details?",
            "So basically the tattoo shop both robbed and assaulted a woman. How righteous of them.",
            "I have a friend who is a piercer in a tattoo parlor with really talented, sought after artists. If they had a shitty customer like this, they wouldn't permanently mark the person's body and overcharge them for work that they intentionally did poor on. This post reeks of trashy, unprofessional people.",
            "Nah fuck that place",
            "Whats the opinion on $13 tattoo?. I feel like that is too cheap for something that is going to be permanently on your body. Overworked artist.",
            "No change? Kinda scummy",
            "[removed]",
            ">per say\n\n[per se](https://dictionary.cambridge.org/us/dictionary/english/per-se)",
            "Sort of curious, what does Star Wars yin/yang tattoos look like? Is it two curved halves of a Death Star?",
            ">Star Wars Yin/Yang for those wondering\n\nyikes",
            "This was in the style of an online pancake recipe.\n\n*Well I was sitting in my aunt's auxillary gardenette one midnight when a bluejay took a seat next to me. It offered me part of its big Mac and I said I only eat pancakes on a full moon. And then I got to thinking: gee I bet nobody has ever posted a pancake recipe online and that's why this recipe is posted here online now! Happy days :')*",
            "[removed]",
            "Soo buddy of mine is a rather semi famous tat artist.. He travels alot and gets premium money for his time.. That said one other chucklefuck of an friend kept asking for a free tattoo... Stating its free practice. Anyway like that one cartoon kid with bugsbuny who kept saying\" I want an Easter egg\" this guy kept at my friend for a free tattoo. So months of this obnoxious behavior persist and the guy finally says\" fine but it has to be what I want to do, where I want to put it.. \" dude agrees and it ends up to be Bella lagosas face (not sure if I got that right) covering his entire right ass cheek. Guy agrees. It happens.. Guy is happy with the tattoo.\n\nFew years pass and one of our friends die. Dude with Bella lagosas face on ass doesn't come to funeral or wake because he's working a volentary shift to kiss his bosses ass rather than showing up for a one time event for someone who was very important to us all.. And at the wake the tat artist is clear he's furious. He tells us that he wanted it to be a secret for him, but he felt he needed to share. He explained there's the new black ink that does not discolor much, but also that old ink that as you get old it turns that green blue color... He said he hid 37 cock dootlles into the Bella tat, with the old ink so as dude aged the cocks would discolor and slowly appear over the face of Bella. He told us that if he's ever asked he will deny it here forth on out, but he kinda hopes dude heads about it so he can sit there with a mirror looking at his own ass trying to figure it out.. Now I don't know if that's doable, or if that's a story to fuck with that guy.. But if it's doable, knowing the tat guy I woo ld wager he 100% did it given how pissed he was at the guy for annoying him. I'm still waiting for the day it's confirmed and dude gets pissed as 37 cocks appear in his tattoo on his ass.",
            "Maybe I am weird, but I think I would like to have a tiny intricately detailed tattoo. Not on my ankle, but it sounds cute for maybe a finger or near the wrist.",
            "[removed]",
            "“Per say”",
            "I don’t understand how “don’t fuck with the people permanently inking something into your skin” is not common sense.",
            "Yo that's way to cheap for a tattoo. Pay good money for a hard working artist. That shits on you for life",
            "[removed]",
            "I'd never get a tattoo, but if I did I wouldn't get one from someone I'd treated badly.",
            "That's great! Love hearing about entitled people getting shit on!"
        ]
    },
    {
        "post_id": "96wju9",
        "author": "CssyJ",
        "title": "Order a 'surprise' drinkfrom the bartender? Oh, I'll make sure you're surprised.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/96wju9/order_a_surprise_drinkfrom_the_bartender_oh_ill/",
        "score": 14620,
        "num_comments": 1203,
        "created_utc": 1534148243.0,
        "selftext": "So just a short dose of malicious compliance from my previous job where I was a bartender.\n\n\nToo frequently for me to count, I'd have customers come up to order shots or a mixer, and say \"surprise me\". I used to try and give them interesting shots, some more obscure stuff that don't get ordered frequently, and the  the customer would then complain that the drink tasted awful. So I started taking a different approach to these 'surprise' drinks.\n\n\nEvery time a customer came up and said \"surprise me\" I would give them a nice glass of water. Needless to say, they were surprised. ",
        "permalink": "/r/MaliciousCompliance/comments/96wju9/order_a_surprise_drinkfrom_the_bartender_oh_ill/",
        "comments": [
            "I used to have a little pocket sized cocktail book that I would take with me when I went out drinking. All my friends loved using it. The bartenders liked that I could just hand them the book and not give some stupid explanation of some drink neither of us knew. Finally, at a $4 cocktail night, a poor, overworked bartender borrowed it from me as everyone was asking for weird stuff he didn't know. He offered me free drinks for the night if he could keep it. I (hammered at that point after an episcopal) I agreed. I never found that wonderful little book at the bookstore again.",
            "I love ordering a 'surprise me' cocktail from a bar I trust. \n\nBut, I also have very broad tastes and have never sent it back (or not enjoyed them). If I'm in the mood for something specific, I'll tell them \"Rum, not too sweet\", etc. ",
            "You have reminded me of some old days tending bar. We played it pretty fast and loose for cocktails. One regular had a specific challenge. The shot of shit. He challenged us to make him whatever we wanted in a shot and if it made him puck he'd buy a round of drinks for the bar. \n\nOne rule was it still had to be alcoholic.\n\nI tried literally everything, EVERYTHING.\n\nPickle juice from the olives, Check\n\nBailey's and Lime Juice etc. Check\n\nChilli vodka flatliner with wasabi Check\n\n...\n\nAnd never once did his constitution fail him. It was great fun to accept this challenge but so gutting I couldn't 'win'. Despite this he and I became and remained great friends. ",
            "Bartenders/wait staff in this thread, how do you feel about me saying \"Whatever your favourite drink is\"? I figure it's as good a random selection as a \"Surprise me\", but less thought. \n\nThough judging by the reactions here, I'm not surprised I got a vodka and soda water the one time I did that at a packed wedding.\n\nEdit: This blew up a lot more than I expected. Judging by the reactions below, what I'm hearing is that I should only do stuff like this in a really quiet bar when I have a bit of rapport, where the staff has enough time and overall giveafuck to customize it. Because even if I don't mind getting a dud, they'll worry about it, and they'll resent the mental overhead. Noted. ",
            "I had a \"surprise me\" shot for my 25th birthday - they gave me a breakfast shot complete with a crisp piece of bacon on the top! Best. Surprise. Ever. However, now that I've moved I can't find anyone that makes it/knows what it is. :(",
            "A mate of mine, not long after turning 18 (we're in Australia, drinking age is lower here) went up to a bar of a pub and said surprise me. He received Midori and milk.\n\nSadly, that became a bit of a running joke amongst my friends and I think a few of them actually came to enjoy that combo.",
            "I used to give people The Cement Mixer.\n\nYou give them a shot of Bailey's and a shot of lemon juice. Tell them to shoot the Bailey's first, then the juice, then shake their head side-to-side fast to mix in in their mouth.\n\nWhat happens is it curdles. In your mouth. Like full fucking chunks.\n\nThe reactions never disappoint.",
            "As a customer who occasionally does this when I dont want the usual but also dont believe that every bartender could know literally every drink in existence, this is a little scary to read.\n\nThat said, I'm not an asshole about it ever. I usually approach saying I like vodka, cant have orange juice, and don't like the taste of grape. Discovered watermelon jolly rancher shots once by saying that. \n\nI also don't do it at busy bars. ",
            "What'll you have?\n\nA surprise. \n\nVodka?\n\nNo. \n\nOK here you go.\n\nWTF this is vodka.\n\nSurprise! ",
            "A few years ago I was at a bar for a Business thing (vendor took us out).  I was early to the bar and asked for them to surprise me.  I don't like overly sweet drinks.\n\nThe bartender started mixing things, took a straw to check the taste, added a couple more ingredients and served it up.  I wish I knew what he had put into it, but it was exceptionally good.\n\nThe bar wasn't busy as it was basically exclusively for our group.  It was a great experience.\n\nMy assumption if I say surprise me, is that the server or bartender will simply make an additional drink of something else that was already ordered by someone else or just pick a drink they personally like.  I don't drink often, and like to explore new things and that is an easy way to accomplish this.\n\nI'm finding some of the responses here a bit disturbing.",
            "I did this to a bartender one time. It was a small hotel bar and not very busy. She sat a 22oz Irish Trash Can in front of me. I was mostly surprised at the price. $25",
            "[deleted]",
            "I'm surprised at how angrily everyone is reacting to this.  A \"surprise me\" on a busy night?  Well your next order is two old fashions and a lemon drop, so shake two hecking lemon drops while you're at it and problem solved! \n\nBartender pro tip:  You're not miserable because the tips suck.  The tips suck because you're miserable.  ",
            "This is something I do fairly frequently. I am pretty introverted and like to stick with things I know.  If I don't do this I'll never try something new. I have also never complained about anything that was ever made for me because that's what i asked for. Thank you for using water and not some of the horrid stuff the other bartenders are talking about in the comments. ",
            "Some people order like this because they don't have a lot of experience or knowledge about alcohol. The first drink I ever had was a margarita at chilli's when I was like 26.  People can also be super self conscious at bars or around bar tenders and just simply clam up and not know what to order. \n\nAlso consider that they may not know what's appropriate to order at that place, for example, I'm born and raised in Florida and I'm female so literally every cocktail I know is either a margarita or a rum based drink,  but I feel like it would be weird to order a goombay smash in a swanky Manhattan bar.\n\nSo I guess what I'm saying is that if you bartend and someone does this don't assume they're being cocky or trying to waste your time. Maybe just make them a classic universally well liked cocktail like a professional and not be an ass?\n\nOr maybe all the inexperienced alcohol drinkers of the world can ignore the fact that the bar is busy and that you'll have to get the blender out or go to the kitchen for fruit and order the only thing they know for a fact they'll like since you can't be trusted....have fun making twenty thousand strawberry daiquiris and margaritas a night I guess?",
            "[deleted]",
            "The bar I used to work at always kept a bottle of Malort behind the bar for this scenario.  Our liquor distributors didn’t carry it, but any employee going to Chicago had to buy a couple bottles to bring back, and all the bartenders would throw in a couple bucks to pay them back.",
            "Maybe all the people asking for a surprise drink don’t drink alcohol often and don’t know how to order",
            "Got a nasty ass drink called the Scooby snack once when I asked for a bartender suggestion as I had just turned 21. ...and I didn't wanna drink beer.\nShe also gave it to me with a 3 foot long straw.\n\nNastiest drink and rudest fucking bartender.\nWas very embarrassing..dunno why she was like this. I was nice and even tipped her when my bf didn't...",
            "At the last place I bartended, we had $4 well drinks. If you just wanted a shot of tequila or whiskey and didn’t name a brand, you get the cheap stuff for $4. It also wasn’t uncommon for us to get some cheap, inconsiderate clients in as well. So we decided to make a shot, just for special occasions. Apparently when you take a shot of well gin (normally $4) and add Tabasco to it, suddenly the price drops to $3.50. We called it the forest fire, since it was like a prairie fire, but with pine needles instead. \n\n\nThere were a number of times where jerks ordered a round of the cheapest shot we had, and I was more than happy to oblige, and stand back and watch their faces as they down that unexpected, quite unpleasant concoction. ",
            "I'm not a professional bartender, but am the GM of two sister restaurant/bars, so occasionally I find myself bartending, and I have also developed a handful of cocktail menus, so I have atleast some sense of what creating a drink entails. I like to try new things, so as a customer I also frequently ask a bartender to \"surprise\" me. From both sides, I dont really see what the big deal is. I'll give an example of each:\n\nThere's a local Italian place that my wife and I eat at as often as we can. They have a small cocktail list, and also a list of some rarer alcohols that they carry. Their two main bartenders are particularly talented, so if I see one of them is  working I'll order from my server by saying something along the lines of \"I'll have the [rare alcohol]. Please ask [the bartender] to make something fun with it. I'm sure whatever he makes will be perfect.\" \n\nThe last time I did this I ordered a rye whiskey and the server returned with a cocktail that contained a large flat orange peel bridged atop the glass with a burnt piece of wood resting on top. It looked amazing, and tasted fantastic. A few minutes later the bartender stopped by to ask how I liked it and to tell me a little about what it was and his process in creating it. Far from bothered or annoyed by my request, he seemed excited both to create the drink and have the opportunity to talk about his craft. For my next drink I asked my server to ask the bartender to make whatever he would like, and recieved an equally creative and delicious cocktail, though by that point he was too busy to stop back and talk about it.\n\nNow from the bartending side. I was short staffed this last weekend and needed all my available bartenders to work the bar, leaving me to bartend a wedding we were catering. I've served in the bar, so I've poured a few drinks, but I've never been the sole bartender of an event. Wedding bars are high volume, but usually pretty simple in that most of the orders are for a [alcohol] and [mixer]. So even for someone as inexperienced at bartending as me, pretty manageable. \n\nBut at this event I had four guests who were insistent that I \"surprise\" them each time they ordered. I needed to make custom cocktails despite there always being a short line of guests waiting behind them. I didnt find this annoying at all, and it barely slowed my pace. \n\nI drew on my experience creating cocktail menus and simply added a slight twist or variation to cocktails I was familiar with. I made Soco-ritas, which was just a traditional margarita with Soco in place of tequila and topped with a splash of grenadine. I also made a few different variations of long island ice teas, substituting one of the ingredients with another alcohol in the same family. The rest of the \"surprises\" were just combinations of sweet alcohols with sour mixers, or sour alcohols with sweet mixers, topped with a splash of this or that. \n\nThey weren't all winners of course, but overall the guests enjoyed them, and I enjoyed making them.\n\nTl;dr - a \"surprise\" order is more of an opportunity than a threat.\n\n\n\n\n",
            "Seems like more work than it's worth; when they say \"no, I meant something with alcohol, nice joke though\" then you have to backtrack and make an actual drink. ",
            "Just have like 3 shots in your head that you always make in that situation. There’s nothing wrong with indecision at the bar if the customer is relinquishing control like that. I’ve been tending for 9 years and I am sick of hearing bartenders complain.",
            "I worked at a Martini bar and would get “make me what you like” I would always preface this with “what I like isn’t a \nmartini” and they would say “I don’t care, bring me what you drink when you aren’t working” Well, okay, I’d oblige. They were still shocked when they got a shot of whatever whiskey I happened to grab and a Budweiser bottle. I wasn’t lying, that is what I would drink when I would get off work. Quick, hard, and to the point. It just always caught people off guard that I would make fancy, complicated drinks all day and all I wanted was the white trash special when I got off. ",
            "Ok, so how do you bartenders feel about this: \n\n\nUsually around 2 or 3 shots in I'll ask my bartender if there were any drinks they made up themselves that they can make for me. I've only gotten one bad response where he put jalapeno syrup and gin together",
            "[deleted]",
            "My wedding.\n\nI'm drunk AF.\n\nMy Best Man and New BIL saw that I was drinking a lot and wanted to make sure I stay hydrated.\n\nHe went to the bar and got me a water.  Tells me it's water, tells me to chug it.\n\nI do so.\n\nI tell him, \"this tastes a little like vodka\".\n\nIt was.  The bartender made vodka + water.",
            "You guys are brutal.\n\nAs a bartender, this is your chance to shine and land a great tip, or a repeat customer who brings their friends next time, or suggests they come back.\n\nThey're not asking you to read their mind. They're asking you to give them an experience. You hear this every day at the BS hoo-rah meeting.\n\nAsk \"You want strong or sweet?\n\nGo make something. It doesn't have to be over the top, work with the time and supplies you have.\n\n**Sweet?** Mix up something bright and layered. Or a red headed slut (the name goes over great too with guys and girls). Jolly Ranchers. Kamikaze.\n\n**Strong?** Irish Car bomb. Liquid Cocaine. 4 Horsemen of the Apocalypse\n\n**Got time?** Make something layered- B52, Slippery Nipple or a Blowjob/Muff Dive.\n\n",
            "Me and some friends had a bartender who is so good he would hear you didn’t like something and make it for you and you would like it. He was a chef of bartenders. We ask him to surprise us several times and he pleasantly surprised us.\n\n",
            "My go-to when I'm in a bar is to ask the bartender to make me their favourite drink. Bartender's know what's up and it's a great way to discover new drinks you otherwise wouldn't have tried. \n\nThat said, my favourite bartender so far to take me up on it poured me a double of whiskey, neat. Respect. ",
            "My old bar had a bottle of water that we labeled, \"same again\" for when people ordered the same again. The look of frustration on someone's face when they're handed water is hilarious. Nothing is more annoying in a busy bar, especially one with multiple staff, than when someone comes to the bar and orders the same again. The chances of someone remembering your order on a busy night is slim, just don't say it unless it's your local, a quiet night or you know the bartender personally.",
            "In a similar vein, a few years back I used to work at a craft beer bar. 22 different taps, hundred or so different bottles and cans. Some people would just walk up and say \"just give me a beer\". After a couple of months of trying to extract some kind of choice or preference from them I developed a new plan.\n\nIn NZ there's a craft brewery called Garage Project. One of their lagers is simply called \"Beer\". It comes in a plain white can with the word \"Beer\" written on it. From that day on, if you asked for \"a beer\" you got that.",
            "I don’t get how people don’t like gin.",
            "Couldn’t decide on a drink at a shitty concert a few years ago. The bartender asked me a few questions about what I like and said she would make me a drink. It was so goddamn good, I had a second one and then asked her to write the recipe down for me, then I gave her a $10 tip. Hands down, the best cocktail I’ve ever had. \n\nEdit: Too many pronouns ",
            "I often tell bartenders to choose the drink and I am happy with what I get everytime. Because the whole point to say that for me is to try something new.",
            "Used to go to this bar in my 30s.\nHad the best bartender.\nI never knew what I wanted and he would always surprise me.\nI loved his creations and he was tipped well.\nMy husband , friends and I loved that place.\nMemories",
            "I order a Wendy's Frosty (kinda between soft serve ice cream and a milkshake) and tell them to surprise me. They have two flavors, chocolate and vanilla.\n\nOne time the guy put chocolate in the computer so it printed on the receipt but then gave me a vanilla. He got it.",
            "I would always make them a Shirley Temple, 9/10 the customer would always proclaim it was the best drink they ever tasted. \n\nDon’t do this to bartenders. Especially when you’ve been drinking margaritas all night and the bar is packed. I don’t care if you think the bartender is your “friend”, we are here to do a job, not read your fucking mind. ",
            "I don't drink alcohol anymore, but I still love bartenders, and tipping them. A sushi joint I love has a full bar, with a huge amount of fresh juices. When the bartender is slow, I will ask for a booze free drink, something that will be fun for them to make. If I go when they are busy, I order like a normal person.",
            "This is kinda lame, honestly. I mean, I don’t know how often people say a surprise drink tastes bad compared to how many say it tastes good, but this doesn’t really seem malicious or compliant. It’s more like technically inconvenient. ",
            "Eh, I’ve been there. Don’t want the usual. Don’t know what I want. Though I never ever ever do it when it’s busy, I never complain, and I always tip a little larger than I would normally. \n\nGotten some pretty interesting and great stuff out of it. Works really well with baristas as well. ",
            "Why be a dick about this?  Shots and mixers are the equivalent of adult candy, a bartender has a much better idea of what types of candy are available, and you have the chance to make a customer or group of customers really happy, meaning repeat business.  Why is \"surprise me\" such a hardship?  IF the drinks you made tasted awful, maybe the problem was you.\n\nGlad you picked another line of work.",
            "Had this one guy come up to me and said \"I wanna surprise my friend. Give me the nastiest thing you can think of.\"\n\nSo I took a shot glass, ran it through my dishwasher so it was hot, and poured a shot of our well tequila in it.\n\nHis friend was not amused.",
            "Back when I had a side gig as a bartender my \"surprise me\" drink of choice was a virgin Cuba Libre. It always surprised the guys ordering.",
            "What we did was ask the waitress what the bartender's best drink was. \n\nHe excelled at making Margaritas. ",
            "My wife and I were doing the surprise shot thing regularly for a time. We never ran into a bad bartender, we usually got some tame sugary shot with some color to it. And we never complained not even when we got a cheeseburger shot:\n\nSome bro bartender lined up 6 shot glasses for the two of us, then without explanation, filled one with Jack or Tequila (i forget), one with tomato juice and the last one with pickle juice. And then he put a slice of cheese on top of one of them.\n\nNeither he nor either of us knew what order to do the shots in. I think we ended up gagging on cheese. \n\nStill not complaining! It was a funny story at least",
            "If you don't enjoy expressing your creativity and showing guests experiences they didn't know they could have you may be in the wrong profession.",
            "excuse yourself to step out of sight for a second, return with a straw in each nostril. Say \"bet you weren't expecting this!\"\n\nOr give them something made with that multiple thousand dollars a shot booze and let them be amazed by the bill.",
            "Bassist in my band bartended at a fancy-ish restaurant downtown. Went to see him once and asked him to make me something he liked.\n\nThat drink was called \"whiskey in a glass.\"",
            "\"Here's your shot of Johnny Walker Blue Label. That'll be $45.00\"",
            "I had a ginger friend who had to stop asking for surprises for drinks when he invariably was given a Red Headed Slut every time.",
            "When I worked as a barman I noticed guys would come up and order two really bad shots for them and the girl they were with.\n\nYou could tell the girl really wasn’t into it so I would always pour the guy something like Wray Nephews or Laphroig. Whilst pouring the girl water or something sweet like Eristoff Gold.\n\nGuy would always look like a total dick trying to impress the girl.\n\nNever understood why they would think it’s a good idea to give someone you’re on a night out with or have met that night some terrible shot if you’re hoping on getting a kiss later.",
            "I always just gave either expensive stuff if its a slow night, or stuff that no one orders to get rid of it.",
            "I love it when I ask for a surprise and get an obscure drink or something I've never had before. I don't know a lot about drinks and tend to stick to basic stuff so it's a chance to experience new things I don't know about.",
            "Whenever I used to ask a bartender to surprise me with a drink it was because I didn’t have much knowledge on alcohol and didn’t want to come across as stupid lol ",
            "My friend always orders whatever has the weirdest name on the bar menu. Sometimes it's awesome, sometimes not, and sometimes I have to carry her home because it was too good to only drink one.",
            "“Make me something girly.”\n\n“I don’t know what that means, heres a list of drinks and their ingredients...”\n\n“What’s the Pineapple Punch?” \n\n*Points to each listed ingredient & reads them out loud for her, like a child learning to read*\n\n“Is it good?”\n\n“Do you like pineapple?”\n\n“No.”\n\n ¯\\\\_(⊙︿⊙)_/¯ \n",
            "Jesus Christ you barmen are service people. Have some decency. A chef wouldn't ruin your meal like a petulant child because he is busy that night and you ordered something non-standard. ",
            "I very often order off menu because I get good results that way. Usually involving a specific base alcohol. I guess you must not work in a bar that prides itself on its drinks.",
            "Whenever I'm in a \"surprise me\" mood, I always tell the bartender what my tastes are.  Like if I want something sweet, or sour, or spciy.  I would never just say \"surprise me\" with no context. ",
            "Sounds like you are one of those assholes. Reminds me of when I get in a taxi and ask for the stations and the guy asks \"fire station?\"",
            "Serious question, what is a better way to ask a good bartender for them to pick a drink for you when you...\nA) Very rarely drink liquor.\nB) Have no idea what is out there to any real extent, but could describe what flavors I enjoy in beer and food. \nSomething like \"I don't know anything, I want to know a little, what do you recommend?\"",
            "When I can’t make up my mind I always just ask “what do you usually go with” and have them give me that. Is that bad form? \n\nDisclaimer: I usually am able to make up my mind. Just when all else fails kinda thing. ",
            "When I was a bartender we had some stock that was going to expire so we did surprise dollar shots. I was told to just mix things for shots. So I did. Some were good, some were not. But we sold a lot of shots.",
            "TIL bartenders are assholes",
            "At a restaurant I used to work at, one of the regulars would order his food this way-- he was one of the nicest guys around and he said he found his new and favorite foods at the restaurant this way",
            "When people asked me for a surprise drink I would make them my signature drink, \"The Seven Sees\". I would take a shaker, put in some ice, then a splash of the first 7 bottles or w/e i think of. Shake it up and put it in a random glass.",
            "\"triple shot of gold Patron straight up, that'll be 20$\"\n",
            "My favorite from any bar is \"your strongest, sweetest, brightest, rum-based  drink.\"\n\nI've gotten blue, lime green, orange, and pink before. They're all delicious.",
            "I only do this at bars where the bartender knows me and knows my drink preferences. I wouldn't do this to one who had never served me before.",
            "Is asking them to fuck my shit up via a cocktail still okay?",
            "In my local bar, if you order 'bartenders choice' they take £2 off the cost of the cocktail. The staff love it becouse they get to make their favorites. ",
            "If a bartender gives me a glass of water without me specifically asking for one, I take that as my cue to slow down and think about calling a taxi home",
            "I thought you were going to do something really unpleasant and I was going to bitch at you for punishing people who came later and didn't do anything wrong. But that's just funny. Well played. ",
            "[Relevant](https://youtu.be/3D3QOWPLW4I)",
            "We had an SOP at one of the bars I worked at. This order, or anything too complicated while it’s slammed: put vodka in it and make it red. That’s it. Served an awful lot of vodka grenadine shots.",
            "TLDR comments.\nDon’t do this. \nI also do this which how I found out I like amaretto sours. :-(",
            "PSA for any non-bartenders out here, please have some awareness of your surroundings if you do this.\n\nIf the bar you are sitting at is relatively calm (good rule of thumb: if the tender is able to stand still for a minute or two at a time and hold a conversation), this is your ideal opportunity. DO NOT do this when the bar is wrapped & 3 deep.\n\nThe people that come to the bar and let me play are some of my favorite people. I have a regular who constantly lets me do this, and we actually came up with a drink so good the company made it a monthly special.\n\nAny bartender who has any sort of pride in their job LOVES being able to build your perfect cocktail, or choose your perfect beer. If somebody says “I don’t know what I want”, I will generally start the process by saying “dope! I’ll find something for you, what are your bugaboos?” Which is when you find out they aren’t into IPAs/mezcal/etc etc. It’s one of the best parts of the job.",
            "Cement mixers?",
            "Where do you work so I can never go there?\n\nI ask for the bartender to recommend things all the time, sometimes I get something I like, sometimes I don't. You're making yourself worse at your job because of a few assholes you've had to deal with. Now other people will be afraid of asking bartenders to pick a neat drink because of YOU being an asshole.\n\nYou are the person you hate. ",
            "stuff like this has rules.\n\n\n1) don't do it when it is packed\n\n2) Don't complain about what you get\n\n3) if you like it ask about it and compensate them based upon how much you liked it. \n\n\nThere that's it. You are literally asking an expert for a random part of their expertise... something different or fancy is almost always to be expected. ",
            "If you have the ingredients, Smokers Cough or Holocaust.\n\nWhen I first started, birthday \"Woo\" girls would ask for a free birthday shot. I was always more than happy to buy them the shot to watch the look on their faces after they slammed it.\n\nEdit: This is when I first started bartender at a sports bar. \n\nIt's not something I currently do, as the clientele isn't trashy.\n\nEdit 2: If I was back in the same type of place, I would absolutely do it again, because I'm a sadistic fuck.",
            "I get unreasonably angry at typos and spelling mistakes in titles of popular posts. ",
            "I did this once. The waitress came back with a shot and a fish bowl. You had to grab a fish, drop it in your shot and drink. I was definitely not expecting that.",
            "When I used to drink, I thought I was cool when I did this exact thing, but I was also excited, hoping that the bartender would be excited to make something new or off the road.\n\nI think maybe 1:30 actually took me up on this in a unique way? I mean, I'm not special and I think I would have paid attention to the crowd so it wasn't a huge bother, but shrug? Most of the time it ended up being the house drink. Not really unique now huh?",
            "https://www.youtube.com/watch?v=3D3QOWPLW4I\n\nis this you?",
            "one of my favorite things to do if it was slow was play dice for shots.  Good way to rack up a bill and drink whole keeping the customer entertained.  (I've only ever seen this played in Wisconsin)  But sometimes it would be losers choice, other times it we would shake the dice and first 3 dice were the page number and the 4th dice was the selection on the page in a big book of shots.  Always spiced things up.",
            "OPs original, mine was.removed:\n\nSo just a short dose of malicious compliance from my previous job where I was a bartender.\n\nToo frequently for me to count, I'd have customers come up to order shots or a mixer, and say \"surprise me\". I used to try and give them interesting shots, some more obscure stuff that don't get ordered frequently, and the the customer would then complain that the drink tasted awful. So I started taking a different approach to these 'surprise' drinks.\n\nEvery time a customer came up and said \"surprise me\" I would give them a nice glass of water. Needless to say, they were surprised. \n\n",
            "Water with blue food coloring would be hilarious. Free(ish) and their brain would probably try hard to find sweetness in the drink.",
            "Tell them, as they're taking the shot, that it'll be $10. Watch the water shoot clear to the other side of the bar.",
            "\"Surprise me!\"\n\nCoors Light it is, then.",
            "Add this thread to the list of reasons I prefer to invite friends over to my house instead of going out to a bar.",
            "I can see why you’re no longer a bartender.",
            "Ordering a \"surprise\" from me got you a Gin and Diet Coke. I'll bet your surprised how shitty it tastes. ",
            "A shot of water would be a bigger surprise",
            "I came to this post expecting you to put a bunch of gross shit in. Pleasantly surprised",
            "I tend to be the one surprising bartenders when I order shots. Nobody expects someone to order a shot with a name as ridiculous as a 'Duck Fart'."
        ]
    },
    {
        "post_id": "js2abf",
        "author": "Monsterlamb",
        "title": "Drunk women calls the cops on me after assaulting me.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/js2abf/drunk_women_calls_the_cops_on_me_after_assaulting/",
        "score": 14615,
        "num_comments": 304,
        "created_utc": 1605072700.0,
        "selftext": "Does this qualify?\n\nThis happened a few years ago.\nI was a manager/bouncer at a very busy local bar and it was my job to cut people off and/or bounce them if needed.\n\nI was in the process of cutting a woman off and she became very belligerent. Since this was also a karaoke bar she just so happened to be called to the stage while I was in the middle of cutting her off. She marches past me and stumbles onto the stage.\nI have the karaoke host cut her music off and continue on to the next singer. \nI go to the stage and escort the lady off. To be clear I did not touch her at this moment. I’m a broad 5’9” woman and my boots add an inch and a half so this very short women complied rather easily UNTIL she continued to argue with me after the fact.\nShe didn’t want to leave and ended up punching me in the face. \nI put my arms around her -picked her up and headed towards the front door at which time she grabbed the protective glass cover on the host stand and shattered it all over the ground. \n\nOnce she was outside she was yelling and screaming that I had assaulted her and threatened to call the police to have me arrested. I quickly grabbed a business card for her and said “our address is on the card just so you make sure you call the cops to the right place.”\n\nThey arrived and asked me who they needed to address. They arrested her. I’m certain they just put her in the drunk tank for the night.",
        "permalink": "/r/MaliciousCompliance/comments/js2abf/drunk_women_calls_the_cops_on_me_after_assaulting/",
        "comments": [
            ">and said “our address is on the card just so you make sure you call the cops to the right place.”\n\nThis sounds like more of a power move than the literal lift-and-carry you did. Nice work.",
            "My son is a bouncer at a local sports bar. He is 6’5” and about 240 pounds. He tells me the easiest way to get a drunk girl out of the bar is to offer her a piggy back ride. He takes her outside and dumps her on the bench outside and she’s done.",
            "I'm a regular at a club, going to see 2-3 shows a month.   I love watching the bouncer crew at work.   One time my wife returned from the restroom and said there was some lady acting up.\n\nAbout that time I saw the female bouncer go in and come out a minute or two later, carrying the trouble maker.   Under her arm, the way you carry a toddler having a temper tantrum.   Through the club and outside.",
            "[deleted]",
            "The protective glass cover didn't sound very protective though.",
            "TIL why bouncers are called bouncers",
            "Hahahaha! This reminds me of the time my husband and I went to our local pub on a night there was dancing. This guy started dancing all over me and then slapped my ass. I stopped and said don’t touch me then moved away. Dude slaps my ass again so I decked him knocking him into a booth. I went to the bouncers and let them know what happened. Guy called the cops on me so I’m outside, 5’4, wearing a dress waiting for the police to show up. The officers couldn’t keep the smiles off their face as I explained what happened then asked me if I wanted to press charges. The dude I decked was standing on the other side of the building blubbering about being hit. We’re regulars to the pub and the whole staff got a kick out of it!",
            "Jesus drunk people are stupid. Hey you are the angry one flailing about smashing things and intoxicated.  You lost already your arguments are on deaf ears. You know This makes me think about how happy i went on that sober train. No more booze for pour moi.",
            "I also worked as security/bouncer and having a female coworker is a god send. \n\nIt's better optics of a female guard removes a female patron with male guards as back up\n\nSo I'd like to thank you for working hard",
            "Surprised pikachu from the drunk woman I’m sure.",
            "Just out of curiosity, is it a common thing for the bouncer to also be the manager (or manager to be a bouncer)?\n\nI don't go clubbing so my experience is pretty lacking.",
            "But the assault and the vandalism...",
            "Were charges filed?\n\nI'm hoping drunk was perma-banned for this stunt.",
            "It kinda fits but cool story anyway.",
            "Ya gotta be nice...til it’s time to not be nice anymore. And don’t forget, pain don’t hurt.",
            "A lady bouncer? I have now problem admitting when a lady is tougher than me but you must be super tough",
            "Now I wanna watch roadhouse",
            "I swear I saw a similar post a few days ago on the same sub.",
            "All you have to do is be polite.\n\nHow do I know when it is time to not be polite?\n\nI will tell you!",
            "Is there a subreddit for bouncer stories?",
            "These types of people need to be charged criminally. So sick of managing drunks in public.",
            "I love it when they call the cops on themselves",
            "Your business didn't make her pay for the damages?",
            "It never ceases to amaze me that drunk people think they’re in the right against someone who’s sober and doing their job. Cops will almost ALWAYS side with the sober bouncer/bartender.",
            "Yep sounds like work and nice job btw!",
            "look .... sometimes mom has a bit too much, and she likes to sing, ok? You just broke her concentration and bruised her pride, is all.\n\np.s. when she woke up she said she didn't remember what happened.",
            "Im confused, are you a 5' 9 lady",
            "Hopefully she was made to pay for that glass cover.",
            "i didn’t think drunk tanks were actually a thing. this is some trailer park boys shit! i love this",
            "I bet you're glad you weren't male",
            ">Does this qualify?\n\nNo. It does not.",
            ">screaming that I had assaulted her and threatened to call the police to have me arrested.  \n\n\n>They arrested her.\n\n?\n\n>I’m a woman\n\nohhhh i get it now",
            "Another reason alcohol is evil and should be outlawed.",
            "Who got arrested for over serving?",
            "[deleted]",
            "Self report!!!1!!1",
            "*woman"
        ]
    },
    {
        "post_id": "bra9aa",
        "author": "_Volly",
        "title": "You want to time every ticket I do with a person shadowing me? OK.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/bra9aa/you_want_to_time_every_ticket_i_do_with_a_person/",
        "score": 14595,
        "num_comments": 470,
        "created_utc": 1558444379.0,
        "selftext": "TL:DR: You shadow me, better keep up. BTW - I love the stairs.\n\nAs a tech of going on 30 years I've seen some stupid management directives. This one is one of my favorites.\n\nBack in 2007 I worked for a large bank that is based in Atlanta and I worked in Richmond in a 28 story office tower. My primary job was desktop support and fixing phones. At that time I was very athletic, I moved fast all the time and hated to use the elevator. If I had to go less than 6 floors - I took the stairs. My boss didn't care for as a team we were the most efficient team in the company as far as # of tickets worked each week per tech. We worked smart, not hard.\n\nSo upper management in Atlanta decides one day to do a deep assessment on how ALL the techs in the bank did our job.  My team gets a visit from Atlanta one day in the form of a heavy set guy who says he will be shadowing us to see how we did our job. He was a bit of an condescending jerk too in his attitude. He even had a stop watch to time us. Now we all knew right away what was happening - Management wanted to outsource us so they needed to know what we did, how long it took and what we used so they could put a cost on it before soliciting for bids. Lets just say my team was not thrilled about it.\n\nNow I decided to be a smart ass about this and my team knew what I had planned for this \"event\". I was told this overweight condescending jerk was to shadow us and time us. OK - he is going to have to keep up. Time for Malicious compliance.\n\n**I ONLY used the stairs.**\n\nOur lab was on the 20th floor. A typical morning for me would be like this: I'd run a desktop monitor ticket to the 6th floor, then go back to 20 to get my phone bag to go to lower level 1 to the IPX to hook up a phone then go to the 14th floor to test the phone then up to 22 to fix a printer then down to 7 to look at a laptop. Today - I'm ONLY doing the stairs so this guy was about to have a heart attack trying to keep up with me while I did my job. I took no pity on him and didn't even pay attention to him.  As far as I was concerned this jerk was assisting others in having my job eliminated. At some point I'd lost him in the stairwell. Later my boss says to me the guy was a bit mad for me taking the stairs but my boss told him - \"That is how my tech works and he is one of my best. If you can't keep up - that is your problem.\" (To this day I have said she was the BEST boss I've ever had)\n\nLater I find out what I did got back to upper management in Atlanta. They were pissed yet they could not punish me for I was doing my job and did it very well. The story also got around to other techs and they thought it was funny as hell what I did. \n\nIn April 2008 we found out we were outsourced. Just like we knew it was going to happen. I no longer work there.\n\nEdit: I'm doing quite well these days being a code developer and SF admin so I look at that experience as my cheese moved so I needed to find new cheese. If it didn't happen I would not be where I am now.",
        "permalink": "/r/MaliciousCompliance/comments/bra9aa/you_want_to_time_every_ticket_i_do_with_a_person/",
        "comments": [
            "Yep. That’s a “damned if you do, damned if you don’t” situation.  Your group was getting outsourced regardless of what your team did, and the shadow was getting data to get bids.\n\nHope you found something better.",
            "How do they outsource desktop/ physical hardware support? I get help desk/software support outsourcing, but you physically had to move a monitor to someone and install it. An off-site company comes and does that now?",
            "Why didn't he just ask you what floor you were going to then take the elevator...?\n\nAlso, do you not sweat? I'd smell like ass if I did what you did",
            "Wait.. if you were the best team why would they try and outsource you? (That means they have another company do your job right?)\n\nE:(NVM got the question answered)\nE2: I get it now. Capitalism is great and all but can be shitty at times.",
            "My company recently had us filling out \"Capitol time\" hours, so they could \"properly claim the tax incentives.\" What they then did was lay off enough employees to cover the capitol hours and hire contractors for all capitol projects. \n\nIf your employer starts making you track your tasks and hours, restructuring isn't far behind.",
            "I know someone that worked as a computer programmer at a bank with a similar description. I think her final straw was when they took away the coffee machine.",
            "> this guy was about to have a heart attack trying to keep up with me\n\nOP showed this dude the stairway to heaven",
            "IIRC, just about everyone in that building was out of a job soon after, and likely a lot of that upper management in Atlanta. At least you got out early, and they may have got theirs.",
            "Stairs for days!\\~",
            "The second they start looking to outsource is the second you should start looking for a new job.",
            "When you have a good boss, follow them on LinkedIn, and work for them when you see where they've landed.  I've done that a few times, and it's always been worth it.",
            "This is one of the reasons I backed away from IT. People have unrealistic expectations for IT professionals. Troubleshooting takes time,  companies hate that.  They want you to know how to do EVERYTHING. I was in networking and was grilled for not being familiar with Airwatch. I was done at that point.",
            "I might have been petty enough to make that guy watch me search the internet for a new job",
            "The thing I don’t get is that the last 4 large companies I’ve seen outsource IT lasted like 2 years max because it generally works like shit. How have people not learned this lesson yet?",
            "I TRUST that you had your day in the SUN, yes?",
            ">outsourcing\n\nIf this is what I'm eventually going to walk into I should just drop out of school now, shit.",
            "that fitbit watch must've been blaring w the sudden heart rate and step count\n\nwell played/ran, OP",
            "You got your revenge, SunTrust doesn't really exist as it's own bank anymore.",
            "and soon an AI will do all the jobs",
            "... : ( to the job loss, but kudos on the work method!",
            "Nice malicious, athletic, and smart compliance! What does outsourcing mean?",
            "I wonder why upper management was pissed since they planned to fire you anyway.",
            "Sucks you got outsourced, but good job on ditching that dumpy dipshit and making him look like a tit.",
            "Fucking outsourcing. My job is in the process of being outsourced, and the same management that decided to outsource is dragging their feet. It's been going on long enough that there might be an 'extension'. I have no idea whether I will have my job another two weeks or another two months.",
            "This was done to textile employees when the factories were being automated early in the 20th century. More than one of the guys  doing the studies were tossed out a window into the mill pond.",
            "reading this felt cathartic. thank you for sharing.",
            "> In April 2008 we found out we were outsourced. Just like we knew it was going to happen. I no longer work there.\n\nHaving been in IT for decades myself, I knew this is how it was going to end.  But I loved your MC!",
            "That shit happens, it's time to get those resumes updated and bail.  \n\n\nUnfortunately, in this day and age, all us \"worker bees\" are just a commodity to Management like coffee or anything else.    \n\n\nIf they can get it cheaper elsewhere, they will.  About the only decent revenge you can get is bail, and leave Management to figure it out themselves.",
            "Humana was doing this recently. They wanted me to save all my SQL reports that I had spent days and weeks creating so people in India making $1.50 could just click a button and get the results.  It was obvious they were going to fire people, but kept saying it was so we didn't have to work so hard lol\n\nI never saved my reports before I quit. I hated that places. Very shady.",
            "How does being outsourced work? They just say we found someone cheaper fuck off?",
            "Worked at Company 1 (c1). Left job for Company 2 (c2). C1 would call me in for maintenance on ancient system, paid by the hour. Eventually, some newbie started shadowing me. If they'd asked me, I'd've been glad to take a few hours to teach him. But no, they wanted me to fix their shit and let newbie 'skulk & learn'.\nHe's looking over my shoulder, trying to pick up what I'm keying. Now I've been on keyboards since 11th grade typing (1968), so I'm what you could say pretty fucking quick.\nHe's taking notes and I'm three commands beyond him and pulling ahead with the lead. Every Enter processed the line and blanked it. \nA lamb going to slaughter.\nDon't know if he ever learned anything, or maybe they took my years-ago advice and replaced the pos system. They stopped calling.",
            "How long had you worked there, and is there a reason beyond it being better for you physically that you took the stairs?",
            "Boo to upper management!",
            "This is hilarious. Sorry you lost your job but you really stuck it to them!",
            "Taking the stairs would be so much slower with that many floors regardless of how fit you are. Did anyone complain about you taking so long?",
            "Why not go as slow as possible so their bid would be inaccurate.",
            "that's just shitty. hope you enjoyed it",
            "Good for you. For the malicious compliance and all the stairs! I could never climb 22 flights of stairs unless my life was in danger lol.",
            "Just doing some math....I may have worked for the company that was outsourced to.\n\nDid you also have offices in Memphis? I was sent down there for the rollout, which was supposed to be done months earlier, and in semi-secret (install this hardware for a new project. Don't mention the project is job killing). Well, delays in the contract meant it wasn't secret, and all the bank staff were told \"hey, you are being outsourced, and no the outsourcer isn't keeping you\". Shitty situation.\n\nWell, the IT staff there, being told they have 30 days left, went full on Office Space and did nothing. At all. I mean, they said they did, but didn't. Can't blame them. Left me with a HUGE rollout when my job was just supposed to be testing.\n\nBut here's the fun part: our admin assistant called the soon-to-be-jobless workers and asked them what hotel was closest to the office, for me to stay at. They decided to fuck with my company, and instead of saying the Radisson that was literally across the street, they said the super fancy Peabody a few blocks away. DAMN NICE HOTEL!!\n\nSo, thank you to the disgruntled staff. Sorry your jobs got chopped, I didn't like knowing that happened, but thanks for the comfy bed!",
            "As a heavy set guy who tries to take the stairs when he can, you're an asshole and I love you for it.",
            "I've been the shadow before. Not exactly for outsourcing, but more for standardization across multiple markets. \n\nThere are good ways to do it that make people less anxious and bad ways to do it that guarantee they won't tell you anything useful or will straight up lie to you. Having a stopwatch is incredibly stupid. It's far better to discreetly use a wristwatch if you want to keep track of times. However, if he was already a condescending jerk I doubt he was very good at his job in the first place. Be nice to people is pretty much rule #1 if you want information.",
            "Fat-shaming... with literal extra steps.",
            "[deleted]",
            "You should also post this in r/ProRevenge",
            "Bank of America just sucks.",
            "You don’t expect them to stay!",
            "Someone tells you to do?",
            "Wait, did you go faster than the elevators on the stairs? Because then I’m with you but if the elevator is faster wouldn’t that hurt your time and in turn just be screwing your self over?",
            "Suntrust?",
            "So you worked at Capital One?",
            "I’m confused though. If his job was to Time how fast you took vs someone else, wouldn’t taking the stairs prove that they should replace you because another tech would take elevator and arrive much faster",
            "Well done you!",
            "Worst ending, ever.... \nSorry to hear",
            "Must have been lag day.",
            "It's already clear what's going to happen no matter what, might as well just have fun with it.",
            "Yer they get more people in who will not be as efficient to them but they pay less, they should keep the loyal workers and are guaranteed to get the problem sorted.",
            "Put tl dr at end",
            "If I were the job shadower I would have taken the elevator. The guy had no brains.",
            "You're an asshole.  You took advantage of someone else's limitations in a very cruel way.  Yes, the guy was **technically** helping to outsource your job, but it wasn't *his* decision.  It wasn't personal.  That decision was made at far higher levels.  He was doing his job.  All you did was make his life miserable.  If you had a chance of changing the outcome and saving your job, that would be one thing.  But you knew it wouldn't matter and of course you were right, so you accomplished nothing other than making another human being suffer.  Congratulations.  You're the asshole here.",
            "Nice",
            "I see it as upper management could outsource people that don't use technology to gain effeciency. \"We aren't paying him to exercise\" would honestly be my train of thought.",
            "[Logo of company](https://thumbs.dreamstime.com/z/athlete-computer-running-jumping-vector-illustration-cartoon-wearing-sports-clothing-63463641.jpg) OP's job was outsourced to.",
            "Yeah f that guy shadowing who was just doing his job.",
            "I'll be honest I'm not reading the post till hopefully rslash does a video on r/maliciouscompliance I hope this is on there",
            "You got him a bit healthier, so you actually helped him",
            "[deleted]"
        ]
    },
    {
        "post_id": "175pqdo",
        "author": "No-Lobster-177",
        "title": "Put in my two weeks notice, covert narcissistic supervisor reveals herself.",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/175pqdo/put_in_my_two_weeks_notice_covert_narcissistic/",
        "score": 14594,
        "num_comments": 475,
        "created_utc": 1697060342.0,
        "selftext": "I (30f) have been working at a super small construction company for the past 2 years. I've put my best foot forward every day, and never had any issues with anyone in the company. As of 3 months ago, they moved me from an in-field coordinator, to an accounting position. It was an emergency move as one of the employees stole 80k from the company and they needed an immediate replacement. My new supervisor, we'll call her Mary (34f) was always super kind to me and we've became pretty good in-work friends. Well these past couple months have been hell, I hate the new position, and to be fair, I'm not very good at it. So I found a new position and I've been keeping it a secret for a while. I let the owner know first and he was very kind and receptive to it. \n\nThe issue started when Mary got word of it. She immediately cornered me and started going on this rant saying things like; \"Why didn't you tell me? You're being incredibly unfair and selfish. I can't believe you would do this to us, this is unacceptable. Don't ask me for a referral because you are not getting one from me\" etc. I politely told her that the opportunity was something I simply couldn't pass up. She then went to the owner and asked for any details I might've given to him about the new company and new position (I believe to try to sabotage me leaving), and thankfully I hadn't discussed any details about it with anyone. It was awkward after that, but I didn't think anything of it. \n\nThe next day when things took a turn for the worst. Mary decided to be petty and removed all of my authorizations to any accounts I had so I couldn't perform any of my daily tasks. I didn't want to leave on a sour note, so I brought it up to the owner as Mary was OOO (out of office) that day. He re-authorized my accounts and I continued to work. Mary was back the following day and was completely livid that I had went around her and talked directly to the owner. Her actions towards me would only get worse from here on out. \n\nThe next day, I came in to notice that my desk was moved and my computer access was taken away yet again. Cue the malicious compliance. Since I couldn't do any of my daily tasks, and really didn't feel like dealing with a screaming Mary- I was on Reddit for basically the whole day. At the end of the day, Mary came into my new back storage \"office\" and said \"Busy day today? I know mine was.\", I just smiled and said \"Yep! Exhausting\". She did not like that response and went to the owner to say that I was purposefully not doing my job, and my last two weeks would be pointless so we should just let her (me) go now. The owner disagrees- calls me into his office, and after I explained what she had done, he gave me access again, and told Mary to work from home. \n\nAnother day goes by, it's extremely peaceful now that Mary is working remote, but unfortunately this does not mean my day was getting any easier. Instead of taking my access away- she had IT start forwarding all my emails to other employees in other departments that had nothing to do with my specific position. At this point I only had three days left and so I just took it as \"OK, this sucks for them, but it's on Mary's head if anyone has any questions. I looked at my PTO and I had way more than I had thought! So why not use those for my last days? And that's exactly what I did. I was originally supposed to let all vendors know and start forwarding them off to the appropriate people, and interview second round candidates for my position, but not any more. The owner was completely okay with it, and understood that Mary was being toxic and that he would have a talk with her about her attitude and position if this continues. \n\nNow with my last two days, and me being on PTO, I finally thought I was safe from Mary. But low and behold she was still holding a massive grudge, as if me leaving my position was a personal attack on her. She called me at 4:30 in the morning, and left me a voice mail saying our company was having an \"Accounting Emergency\" and I need to come in IMMEDIATELY. I called her back about 4 hours later, which she was fuming about, and went on a massive rant about how I'm extremely entitled, I will never get any where with my attitude, she's embarrassed for our company to say that I ever worked here, that if she ever finds out where I will be working she will make sure that I'm fired and will never get a job in this town again. I laughed at her, and she went ballistic- like when you take a 4 year old's toy away. Screaming so loud her voice was shaking, saying silly things like I have no respect for her or the company and that I will rot in hell. \n\nI hung up on her once she started bringing my family into things. I called the owner and explained to him what happened- which he wasn't shocked about and had told me that when she came in that morning she was going on a rampage like the Tasmanian Devil. After finding out why she was freaking out, he promptly fired her.  I was shocked- since this was such a small company and he definitely needed her. \n\nI had heard from another coworker that she ended up destroying a bunch of company property on her way out and now she's facing a lawsuit due to the damages. \n\nSo thankful she revealed her true self to everyone & that I'm far far away from that company and her.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
        "permalink": "/r/MaliciousCompliance/comments/175pqdo/put_in_my_two_weeks_notice_covert_narcissistic/",
        "comments": [
            "Lol! Wow.... That lady burned a lot of bridges. She'll have crappy luck getting a new job. Lol I bet she applies to your new company at some point.",
            "How much of her work was she having you do?",
            "Wow.\n\nEdit: I was wondering why the temper tantrum.  What about this as an explanation - she'd outsourced her job to you and now had to actually work for a living.",
            "Wild ride and I was down for it. Hilarious.\n\nGrats on the new job!",
            "I feel bad for the owner dealing with this. First the bad hat who stole company money. Then losing OP and having to fire crazy Mary…he lost 3 employees through this chain of events. And it’s a small company where any resignation is felt more acutely than a big one. Only good thing is this owner seems to be a sensible person and not swayed by crazy Mary’s office politics. Congrats on the new job OP.",
            "Several years ago a guy who worked for me found an investor for an idea he had, so he left to go start his own business. I held no grudge, wrote up a nice farewell email for him, wished him well, and that was it.\n\nFast forward a few years, and I'm job hunting. I randomly stumble onto his company -- he's CEO now, and looking for someone to head up the tech department. We couldn't quite make the numbers work out (I eventually went somewhere that paid more for a less demanding job), but he did mention that he was worried about the reception he'd get when he announced he was leaving and he was impressed by the way I handled it.\n\nI would have done it that way no matter what, but sometimes simply behaving like an adult comes back to you in a good way.",
            ">...he promptly fired her. I was shocked- since this was such a small company and he definitely needed her.\n\nNo company needs employees who are prepared to sabotage other employees ability to work, for some personal issue.  That she damaged stuff on her way out confirms that his decision to fire her was correct.",
            "Plot twist, Mary was partners with the embezzling employee, and was lashing out due to fear of being caught. Explains the removal of access to accounts.",
            "That same bitch would fire you for no reason and with no notice. \n\nThis is exactly why I never give notice, well, it’s like 2 seconds notice. A guy in my company gave his two weeks notice after being physically attacked by the job foreman, the kid was only like 19 years old and half the size of the foreman. He got a job offer making almost twice what he was and couldn’t refuse it, especially after being attacked. \n\nSo instead of pressing charges, or quitting in the spot, he gave 2 weeks notice. They repaid his kindness by moving him to a different job that was the furthest from his house that we had. \n\nHe told them to eff off after that. \n\nFortunately, that foreman is long gone and I moved up to a higher position than foreman so I don’t have to put up with any shit and I won’t allow someone to be picked on.",
            "I sincerely hope that she's single.",
            "I would call her at 4AM… “I heard you got fired” LOL",
            ">this was such a small company and he definitely needed her\n\nAnd that was the day Mary found out that she wasn't indispensible.",
            "Ring her from a private number and don't announce yourself. Just say in to the phone\n\n \" Don't ask me for a referral because you are not getting one from me, I'm embarrassed for the company to say that you ever worked here, that if I ever finds out where you will be working i will make sure that your fired and will never get a job in this town again\".\n\nThe hang up.",
            "I read this and immediately thought she was the one stealing money and, having framed one person who got fired, was ready to do the same to you. It's the only thing that makes sense in my tired ass brain",
            "All people bring joy to one’s life. Some by entering, and some by leaving.",
            ">... \\[owner\\] promptly fired her.\n\nwoof! that escalated - and not in the manner Mary was expecting, no doubt.\n\n>... and now she's facing a lawsuit due to the damages.\n\nand it just keeps getting better and better.\n\nof course, you do realise (OP) that this is \"all your fault\" and she will be gunning for you. watch your back.",
            "Wow!  Sounds to me like you were probably secretly doing her job for her and only she knew it. Narcissistic people typically don’t go crazy like that when somebody quits (sure you’ll get the rumor mill started but her reaction is that of someone who is severely wrong doing). Unless something on their own behalf is at risk, her behavior is absolutely showing there’s some sort of risk with you leaving and affecting her. I love it when peoples true colors come out like that because then you’re just like “gotcha!”.\n\nAt any rate, has anyone thought that the 80K may be traced back to her? Because her behavior is indicative of something big, that she did wrong and you leaving means that she could be potentially found out. I would bring up to the owner to pay for an auditor to come in. I mean it’s gonna cost a pretty penny but I’m willing to bet 80k that she was in on that money stealing somehow.\n\nSounds to me like she wanted you to be the fall guy and that’s why she’s being that reactive. What do I know? I’ve only worked in construction type of industry for 25+ years as a business manager and saw shady shit all the time. What I do know is a sneaky snake when I hear it or see it.\n\nI’m telling you…she’s in on the money stealing and probably more.\n\nWatch yourself because she might come after you personally now. Go straight to the police when she does.  She is not stable and is having clear psychotic breaks.  Watch yourself OP.",
            "Wow! She sounds like she has serious mental problems. I don't know how she can get a good job reference from this company now. Good thing you escaped.",
            "Honestly, I think she was planning to steal another $80k and get you blamed for that one. And you quitting ruined her plans. That would be my theory.",
            "Well, that sure sucked for the company: with you having your two feet outside and she jettisoning herself, she left the office two men short. The boss might have been supportive, but that must have hurt bigtime.",
            "I don't think she is getting a referral from that owner.\n\nSince she harassed you, consider joining on the lawsuit. That would make it even more embarrassing for her.",
            "You were probably doing a bunch of work that she was supposed to be doing that whole time.",
            "Sitting around scrolling Reddit due to someone with way too many admin rights, thinking 'fuck yes. finally something for MC!' Very nice MC and well written too.\n\nThe owner tried everything under the sun to try to protect ole Mary from herself. \n\nThe sad part is if he had fired Mary after the first outburst, he would have had you, OP, to help hire into the position. Even if you hated what you did, you still knew the ins and outs.\n\nHindsight is always 20/20 or all that.",
            "I'm wondering if she took the $80k",
            "> I was shocked- since this was such a small company and he definitely needed her. \n\nHe needed a liability like her like he needed a hole in the head! You could probably sue the shit out of the company for her threats to sabotage your future employment.\n\nAlso, considering her behavior, I frankly would not be surprised if *she* stole the 80K and successfully framed her subordinate.",
            "Well, you could always testify for the boss in his lawsuit.  Her actions led directly to you cashing in PTO and leaving the job early.  That's added losses to the company.  If the relationship with the boss is a good one, and you don't want to burn a bridge, this would be the way to go, though given how long it takes civil suits to get resolved, this might take a few years and there'd be further contact with the crazy lady.",
            "Wow. I was expecting the meltdown but not the property damage. Like I'd love to understand her thought process on that only to use it on some people I know who are very similar to Mary. \n\nWhat can I say. Christmas dinner is boring without a show.",
            "Mary was fucking crazy",
            "Now, go back and offer to take her position to REALLY piss her off. :P",
            "I’m usually not the empathetic type but I know people can crack under stress; that they can be still doing ok but go coo coo bananas if something else comes up. A rational person would’ve taken the hint when the owner sat them down, sent them home, and reversed their calls; they also wouldn’t have destroyed the place on their way out. I wonder if some other facet of her life was falling apart, like maybe a death in the family or a divorce or something, which sent her in a tailspin. \n\nThat said I think OP handled the situation w/more tact and grace than I ever would’ve. I don’t think there was anything malicious in your compliance. Always have the right to demand respect in the workplace and to safeguard your own sanity in so doing. Very well done!",
            "Call her back. Ask her how her work is now that you're gone.",
            "The shitty owner had that coming to him due to enabling Mary's abuse. All the good bosses I've worked with wouldn't have  tolerated that shit. I fucking cannot imagine justifying taking away access so they literally cannot work and expecting their bosses to let that kind of deliberate sabotage go.",
            "Email her and tell her you’ll be a reference for her if she needs one.  ;)",
            "By chance are you in Tucson? I worked with a crazy Mary once and this sounds EXACTLY like her.",
            "Honestly, I'd consider calling the boss and taking Mary's old position.\n\nHe's just had to deal with a lot of shit and can use the help and seems to like you.",
            "If I were you I’d look into filing a restraining order to legally protect you/your new job from her.",
            "An accounting emergency at 0430? The emergency sounds like she woke up with nightmares about having to do her work without you supporting her, OR, she woke up with nightmares that she would be caught out on her blaming things on you.",
            "I wonder if she had something to do with the embezzlement. She probably figured having someone who didn't know what they were doing would be easier to control and keep them from evidence of her involvement.",
            "She fell in love with you. Crushed hard. Then you dumped her without doing it to her face. Love scorned.",
            "It’s a breakdown tbh",
            "tasty!",
            "Wow! Do you think she is vindictive enough to try and make your life miserable now? She sounds like someone who doesn’t react rationally, I hope you stay safe and don’t need anything like a restraining order. Very entertaining read.",
            "This was an absolute treasure to read-- Holy shit! I can't believe people like Mary actually exist, and that your boss didn't fire her after the first or second incident.",
            "Mental health problems are more prevalent than people think.",
            "There’s burning a bridge and then there’s destroying it with a 30,000 pound gravity bomb…",
            "So where the f#$% was Mary while your predecessor was absconding with 80k? No wonder your boss was understanding with you about her b.s.. He was probably looking for a reason to can her.",
            "This is a classic extinction burst. Narcissists, on their way down/out, will implode. Thankfully, the owner had your back just enough that you didn't find yourself in the blast radius.",
            "Get a restraining order against Mary. If she was a psycho while she had a job, now she has nothing to do but \"make sure you get fired from your new job\".",
            "I'm guessing this massive overreaction was due to her also having committed fraud and she was worried that bringing an actual accountant into the department would unravel her crimes.",
            "If you got records of her meltdown on you, keep and save them. If you got a social media presence, either warn everyone close to you on it so they can know about her (juuuuust in case) or lock the account down for now.\nWhen you get to your new job, make sure you don’t talk about it on public social media or even linkedn for a while.\n\nShe sounds like she can definitely become a “problem for years” kind of person if she finds you either irl or through social media.",
            "Ten bucks says she will be blaming you for the loss of her job and not her own shitty behavior.",
            "The owner sounds like a good dude. Did the right thing for an employee on their way out and made his own job more difficult for a bit.\n\nMaybe drop your resume for Mary's job?",
            "Well played!  Of course, had the owner fired Mary in the first place, he probably wouldn't have lost the accounting person that you had to replace and none of this would have gone down.",
            "She gets IT to forward your emails to other people? I call bullshit. That’s a fireable offense to IT.",
            "Damn",
            "Tasmanian Devil Karen is a hilarious image.  Also, I would have left immediately after the first incident and not returned, that's ridiculous.",
            "You should put in for her job, that would be hella karma",
            "You dodged a bullet big time",
            "What a story! You handled this like a pro, OP — congrats on your new job!",
            "Lmao she was probably jealous that you were moving on to a better career, better position and a different company",
            "Been in small construction companies before and this kind of thing is what I've seen plenty of times. Sounds like the owner knows the law and has been in business for a while.",
            "> I was shocked- since this was such a small company and he definitely needed her. \n\nVery few people are so good at their job that they're worth driving others away.",
            "An interesting tale",
            "So, if you were doing 80% of her work for her, wouldn't removing your access to the system result in HER being behind on work deadlines?  \n\n\nWhere is the logic in her behaviour?",
            "These people walk amongst us...and they can vote.",
            "an accounting emergency ... my sides are aching from laughing at that!!",
            "Feel bad for the owner.",
            "Did she also take away your swingline stapler?",
            "I've got to say, it sucks that she did that to you but think of the future employees of that company that have been saved by her showing her ass so bad it got handed to her.  The boss sounds like a decent guy.  Any chance you'd go back if there were a better position there?  Maybe just touch base with him and let him know you'd be open to the idea if something changed since you know he's now gotten rid of Typhoid Mary.",
            "\"I'll make sure you don't get another job in this town again\"\nMeanwhile, she never gets another job in that town again.",
            "Guess who else was embezzling.",
            "What was the reason she gave the owner for her unhinged behavior?",
            "And she called  YOU  \"entitled\"!",
            "How delusional does she have to be to think that was going to end well for her?",
            "In my case, a co-worker denied me access to download drivers.  I am the guy responsible for maintaining all the PCs and the idiot was a MAC man who did not believe Windows would need driver updates once in a while. So I had to go home for lunch, download the drivers, on the clock for the drive and downloading, and then fix the issues.  Now for the good part, the IT big boss crashed using a new required app for his job.  He knew of the downloading issue and I made him wait for my lunch hour.  Now when HR gets involved, the idiot required to restore my downloading rights for me alone.  The idiot appealed and was shot down in flames at corporate.  The best part, my boss got the blame for his new report not being completed on demand which many in the company needed the new driver for the app for the entire corporation.  I am LA and I was talking with Midwest about this very issue of the app and driver fix.  I was that important to be talking with corporate, and IT bosses thru out the corporation.  I just got there first and figured out the answers first.  I even had to email the driver all over the corporation including corporate themselves.  They got the wrong driver and I had gotten the right driver.  Its good to be service demanded.",
            "It kept getting worse and worse. Is this even a real story?",
            "Not really MC, but heck, that's a tale -- thank you for sharing.  Concerned that she knows where you live...",
            "updateme!",
            "What a complete psycho. Narcissistic AND bipolar. JC.",
            "Perfect time for you to ask for her job",
            "Reading between the lines, someone stole money from under her nose, she n now has a major hangup on \"loyalty\", and may not actually be competent in the job and is dependent on the support OP is offering. Lack of competence likely contributed to the theft in the first place. OP hands notice, 'Mary' panics... idiocy results.\n\nYou say she was needed, but... was she?\n\nSpoiler, they fired her, so obviously they could do without her, at least in the short term.",
            "Sometimes the people at work who are the best friends are the ones who are relying on you to get the work done. Once you are no longer helpful, you are a threat.\n\nThe truth is the owner can't afford to not fire her. People like that drive off good employees, and sometimes turn a blind eye when someone else is stealing from the company (just saying)",
            "I'd show up at her trial (if there is any) and  sit smiling.",
            "OP, have you filed a restraining order or order of protection against her yet? If not, please talk to the owner and get help doing so. I'd HATE to hear she shows up someplace you are and acts horribly.\n\nAlso means you'll need to let your new employer know. Could be fun if Mary shows up there and gets taken out in handcuffs.",
            "Wonder if Mary had something else going on at work that required you and your position in accounting to sustain it.",
            "Mary loves you and you broke her heart. She is not dealing with it well.",
            "That company is crazy! One person steals 80k. Then the supervisor acts like this? What a shit show of a company. As an owner of a smaller construction company than this, I feel for your old boss. This guy is going through hell to run a company.",
            "Wow! I had to read the entire thing! That boss deserves praise also for having patience and for supporting you. Did she think you’d stay if she treated you like trash? That’s seriously mental",
            "WHY?!?\n\nWhat does self-destructing do for her?  I do not understand her at all.  This was... senseless.  What did she gain?",
            "You will never work in this town again.\n\nNo you!!!",
            "He definitely doesn't need an employee that will open his company up to lawsuits based on her behaviour. Way more trouble than she was worth.",
            "Lol. I love how she threatened to make sure that *you* never 'worked in this town again', but seemingly ended up making sure that *she* would never get another job anywhere around there ever again. She will *never* live this down.\n\nAnd she also could end up with potential criminal charges (depending on what the outcome of the lawsuit is) that would stop *other* places from hiring her either. 'Cause, you know, background checks are a thing...",
            ">After finding out why she was freaking out\n\nWhy was she freaking out?",
            "Every time a long tenured employee leaves for another opportunity we throw a happy hour for them. I find that is a very important culture to have. No job is going to be perfect forever and we are always thankful we had the time with them that we did.\n\nPlus we tend to get a large number of boomerangs so having them leave happy helps.\n\nI honestly can't understand Mary's attitude here.",
            "Mary has mental issues. I hope she gets the help she needs.",
            "I got a feeling that your problems with her aren't over.",
            "I would leave her a voicemail wishing her good luck getting another job, but that you would be unable to offer a reference for her. Then block her on everything.",
            "You were wrong. It doesn't matter how big or small the company is, it doesn't need her or anyone like her.\n\nAnyway, good luck with the new job.",
            "Lock\nYour doors and get a dog. She sounds mentally ill",
            "Erm, did she have some unrequited romantic intentions that she never mentioned? How fuckin mental.",
            "You should have asked him if he was hiring you could have had her job",
            "Wow 😲. Thanks for sharing, that's quite a tale.",
            "I’m so glad the owner happened to be a rational person through this. Imagine if he had taken her side 😳",
            "Wow, what a toxic work environment! I'm glad you were able to get out of there and that the owner took action against Mary.",
            "I’m a 31f commercial construction superintendent and this is fucking hilarious. Glad your owner has a brain!",
            "Damn XD I love how they just keep kicking her legs out from under her EVERY TIME SHE DOES SOMETHING.\n\nLock you out once: she's reprimanded.\n\nLock you out twice: she's sent to work from home.\n\nScream at you because she's jealous and go in a raving mad spiel at work: fired because everyone's tired of her shit.\n\nDestroy company property on the way out: pay up, fired bitch!",
            "Holy shit, what a literally psychotic bitch. Glad you got outta there, though with the owner firing her, I suppose it wouldn't have mattered anyways.\n\nJust make sure to keep an eye out in case she decides to try and go Psycho Killer on you. Judging from the way you described her, it wouldn't surprise me in the least if she kept that personal grudge. People like her are the ones you really gotta keep tabs on.",
            "Find out where she's working next and Sabotage it lol",
            "Why would she take you finding a new job personally?",
            "Well... that escalated quickly.",
            "I would say she was heavily jealous that you got the position that you did.",
            "Dumb bitch",
            "She sounds... incredibly entitled, with a bad attitude and an embarrassment to the company.  :P",
            "OP, is it possible Mary had a crush on you? That's an insane reaction to someone leaving, but Reddit has shown me insanity before.",
            "getting confronted on bad behavior is most peoples weaknesses.",
            "OMG she sounds so much like the secretary at my dad's construction company! Except she's incompetent at her job and a petty bitch. I tried working there for a while but eventually she did the same kind of thing making it so I couldn't do my job and straight up ignoring me. I got so fed up with her and the owners not doing anything about her behavior that I walked out. She's apparently done the same kind of thing to at least 2 other women who tried working there after me and just informed her replacement in training that \"you know [the boss] is married right?\" And clarified that *she* is the boss' work wife. Incredibly petty.",
            "Wow, that sounds like an incredibly toxic work environment\n\nI'm glad you were able to escape from that situation and that the owner took action against Mary's behavior.",
            "The owner sounds like a decent person. They are hard to cover by. After she was dyed I would have renegotiated my position and pay",
            "This whole thing was such a well written enjoyable read. It was like a short story from a book.\n\nGood luck with the new job OP",
            "You're surprised she was fired??? How? The company needed someone doing their job, not spending all day coming up with malicious amd toxic ways of bullying staff members. She sounds horrific and you put up with a thousand times more than I ever would have. Her very first rant at me would have had me telling her in no uncertain terms to reel her neck in followed by a complaint to the boss. The rest would have been bonus time.",
            "I'm surprised that the owner was sane enough to understand what was going on and fire her. This isn't how these stories go down generally. The boss's boss usually sides with the AH boss 😂",
            "Fuck narcissists. But not literally, they’re hell for any children to be raised by them.",
            "Umm... then the whole company stood and clapped as she was led away in hand cuffs.....",
            "The only thing I don't get about this story is usually when you have PTO you have to work the 2 weeks before and the 2 weeks after your PTO to get paid out for it. I don't know a single place that would let you use PTO for your exit days.",
            "A super small construction company that also has it's own IT dept?\n\n>Instead of taking my access away- she had IT start forwarding all my emails to other employees in other departments that had nothing to do with my specific position.",
            "Wow, such a creative post.",
            "I would reach out to her and offer her a reference for a new job.",
            "She sounds like a bitch but I don't see why you'd use the word narcissistic. None of this really relates to narcissism.",
            "Fucking yikes. Sounds like she needs some professional help. \n\nGlad you found a better gig, hope it’s going well!",
            "I hope the owner suffers a lot over this, and learns to stop treating horrible employees with kiddie gloves. She should have been fired immediately as soon as she started sabotaging your workstation, and by extension HIS BUSINESS. Can you imagine if a restaurant manager went into the kitchen and started turning off the goddamn gas and hiding the pans so nobody could cook, and the owner of the place just said he'd have a talk with them??",
            "[removed]",
            "We *really* need a sub for stories about leaving your toxic job, because this sub has basically become littered with stories like this that have nothing to do with malicious compliance.",
            "Gotta love Rule 3",
            "She’s age 34?? Thats like classic boomer behavior. A lot of millenials did kind of absorb boomer attributes from their parents and this is clearly one of those.",
            "Owner had to fire her. Otherwise, you could sue him for not trying to fix a hostile work environment.",
            "Don‘t get me wrong, it’s a great story. But I can’t really find the malicious compliance?",
            "Geez. Psychotic break much?\n\n(not a formal diagnosis, I am not a licensed healthcare professional, go away or i shall taunt you a second time, ni)",
            "Ok so the company lacks employees, desperately. You quit, and the owner fires more people? The math isn't mathing.\n\nThe rest of the story is quite obvious bogus as well.",
            "Let me guess, she's obese and ugly.",
            "Hahahahaha....thats amazing",
            "Who’s going to give her a referral?",
            "There's a direct ratio of need to worthwhile that has to be maintained. No matter how much she may have been needed, the fact that she did actions that would chase out anyone whom was also needed (since you still had plenty of work to do, including getting your replacement in and up to speed) made her not worthwhile. It's cheaper, easier, and more effective to cut her off and replace her than replace everyone she chases off and eventually her anyways. She learned that the hard way, and owner should have made her keenly aware of that much sooner if it was to be avoided altogether.",
            "That's not so much stealth narcissist as much as sociopath.",
            "Well that was quite the extinction burst...\n\nHow dare yiu make her have to do her job! And now she has no job, thanks to you! And a lawsuit slapped on her! All things that are your fault! OP I hope you feel appropriately terrible!\n\nThat is, not at all terrible. Enjoy the new job!",
            "You should definitely find out where her next job is and covert fuck with her.  Just once or twice.  Post your update to Petty Revenge 😀",
            "Sounds like she was going through some kind of life crisis",
            "This behavior reminds me of a crush gone wrong. Nothing sexual but have you ever just really liked someone as a kid. This reminds me of that.",
            "That woman needs professional help, holy shit.",
            "GEEZ! Me thinks Mary has some bigger issues than your departure. Glad you're safely out.",
            "I'll bet my eyes you were doing her job and knew you leaving would expose that and her incompetence.",
            "That was a delicious read, thank you",
            "A controlling person who went  crazy after losing their perceived control over someone else.",
            "I'll wait for this to be played over Minecraft parkour on TikTok",
            "Mary would shoot herself in the head if she was told doing that would get you fired from your new job lmao",
            "Sounds like she was already in the process of having a mental breakdown and your resignation triggered an acceleration and she flat-out went off the rails.",
            "Fuckin romper room. What a cuckoo...",
            "I need a TDDR (too drunk didn't read) please and thank you.",
            "Mary, Mary, quite contrary, how does your venom flow?",
            "I have never been so stoked for someone I’ve never met. Love a good comeback story. Good on you, OP!",
            "Since betting is now legal, I will bet anyone - whatever amount - that Mary will reach out to OP for a reference.",
            "Thats what happens when the owner didn't fire her sooner.  See?  don't be nice to AHs.",
            "Sounds like Mary needs a therapist.",
            "Your former boss / owner was more supportive than I thought he'd be. Hopefully he finds a better replacement for his sake more than anything.",
            "People be craazaaay and they can hide it til something just happens and they turn into wacky wild nut jobs -assuming out of jealously- I picture her  to be let’s just say blehhh in looks and her whole life was micro managing people and then you come in - I assume you’re pretty and smell nice and smile alot and then you get a better job very quickly after being under her reigns and she blew a gasket lol",
            "She sounds like a maniac!",
            "Man, something crawled up that lady's ass and died.  She must have had some big plan that involved you, and you blew it!!  lol  At least karma did its thing.",
            "I hope you rang her at 4:30 in the morning just to laugh at her.",
            "Woah! I'm gobsmacked. I can't believe she went through with all those acts of sabotage, thinking she was invincible to the consequences. All I can think is that it was a total mental breakdown. I'm so glad that the boss could see things clearly from your perspective, even though I'm surprised she was still employed after the second bout of nasty meddling. Well done to you on holding your ground, being honest and not accepting the abuse!",
            "Did you find who stole the 80k",
            "Maybe she has some mental disorder? Very erratic behavior.",
            "Wow I cackled when I read the lawsuit part, thats mental. \n\nI'm so sorry you went through this, but holy shit thanks for sharing",
            "Man, I feel so bad for you OP. Small companies can be either heaven or hell, sometimes both, and often go from one to the other by the hand of one person. Best of luck in the future!",
            "The owner should have fired her sooner. It might also be advisable to get a restraining order seeing as she called you at home at 4am. This sort of person will continue acting like this after you have left.",
            "My wife worked for a woman (Let's call her Cat) like that in an international company.  Then there was a big layoff. My wife stayed and Cat was let go.  On her way out, Cat tossed some important tax files.  Unfortunately for her, she missed the proper trash bin and my wife found the files.   \n\nNow, fast forward two years.  my wife gets a call from someone she knew in HR in another big company in our area. It seems Cat had applied there and my wife's friend, remembering my wife worked at the same company, called to ask about Cat.  Needless to say, Cat didn't get the job.",
            "good job",
            "[deleted]",
            "What. The. F.",
            "What a nutcase 😕",
            "I would have left that first day after giving my notice.  Don’t need any crazy or drama like that in my life.  Would have just walked and saved myself 2 weeks of my mental health being fvcked with.  I guard that shit like it’s Fort Knox!",
            "Entitled BITCH FA & FO, earning the Instant Karma she got!",
            "Holy shit!",
            "Holy shit there are some crazy, crazy people out there. Wait, not \"out there\" - they are right among us! \n\nGood luck to you, with your new job! \n\nGood luck to \"Mary\" on getting over her nervous breakdown as well. Probably should watch your back for a bit just in case she never does, though, because holy cow. 😳",
            "Some folk are quite simply batshit insane.",
            "She sounds like someone who has undiagnosed borderline personality disorder. One of the symptoms of being someone with BPD is that they can become super friendly with someone and think the world of them, and then when they feel slighted by that person (can be something as small as not refilling the coffee pot) then that person becomes their enemy with no warning. \n\nIn saying that, said person they are really friendly with can have all the red flags in the world but the person with BPD can still think they're the best thing since sliced bread.",
            "Quite a story but where is the malicious compliance??",
            "Yikes. You have to wonder about people like that, who have so much rage and anger in their hearts. What exactly is this supposed to accomplish? Why would you make things so awful? I wonder if she felt she deserved the better job, and was upset that your life was suddenly better.\n\nI'm also wondering like a lot of the others whether or not she was tinkering with the books...",
            "That last part is not really the satisfying ending you might think. I hope you have some of her craziness documented, and from now on record any calls, emails, etc. Some people snap in a long-term way, and you need to get legal help...",
            "That story makes me sad. There is no reason to treat people that way and I hope she gets the help she desperately needs.",
            "Escape from a toxic workplace. Karma caught up, revealing her true colors. Wishing you a better future!",
            "It looks like the owner was left with no choice in the matter. His lawyer and HR staff were probably all demanding she be let go immediately to protect the company from liability over a hostile work environment. She was probably also starting to get (negative) attention from customers.",
            "That woman is a natural disaster. They should have moved you back to your original position to try and keep you, but I am glad you found a great opportunity.",
            "Mental",
            "This Mary sounds like an utter complete and total bunny boiler.",
            "Well, She made sure at least one of you would never get a job in that town again...\n\nMission kind of successful?",
            "What a stupid person! She doesn't deserve your respect. 😑",
            "Sounds like she was incredibly possessive of you and thought she could do anything to you without consequence due to her position, and, based on the ending, was generally just batshit insane.",
            "Was her name, Daenerys Stormborn of House Targaryen, the First of Her Name, Queen of the Andals and the First Men, Protector of the Seven Kingdoms, the Mother of Dragons, the Khaleesi of the Great Grass Sea, the Unburnt, the Breaker of Chains, Destroyer of Company Property, Salter of the Earth.",
            "Fucking psycho what the fuck",
            "Some managers choose to take it personally when an employee leaves. They need to internalize that the employer - employee relationship is a business transaction. I give you my time and effort, and you give me money and benefits. When I find a place that offers me a better deal that's not necessarily personal, it's just business. I've had to deal with managers who took things very personally when employees left (myself included), and it honestly is rather sad. One of the jobs of a manager is to help their employees get to the next level - preferably in house but at a small shop like this that may not be an option. Having said that, I've turned down higher paying jobs because I liked my manager and the work. Oftentimes employees will stay for good coworkers, but leave for bad management.",
            "Sounds like management material for sure",
            "Wowee she was really insane wasn’t she??!! 😮 that’s the kind that wolf hurt or kill someone!",
            "Would have been icing on the cake if he offered you her old position. At least now you know why that other guy stole $80k.",
            "Long time since I've finished one of these. Thanks for sharing!",
            "Mary was stealing too.",
            "Holy shit",
            "I can't understand how a grown ass person could behave like that. I just cannot imagine embarrassing myself on such a massive scale that my entire professional reputation gets irreparably destroyed. Do trust that this will follow her everywhere - and at 34, she has a LONG time to find out more.",
            "You sure her name wasn't Karen?",
            "Tl;dr : Mary is banging the boss.",
            "What a crazy bitch. Glad you got outta there, something is seriously wrong with that lady.",
            "Yeesh, that lady is coo-coo for Coco Puffs. Glad you got outta there when ya did!",
            "Accounting manager?\n\n* There's no accounting what some people will do.\n* She paid for it in the end.\n* She decided to damage property, and was held accountable.\n* She took away rights, and the right was taken from her.",
            "Damn!  That was a wild ride!  You did the same things I would have done (and have done) in previous positions.  Funny how toxic they get when they realize how much they need us.",
            "In the U.S. it's frequently a company policy that a previous employer, or any previous colleagues, can NOT give a reference. Any such requests are to be forwarded to HR, who can simply confirm your dates of employment and state whether or not you are eligible for rehire.",
            "That poor company.",
            "Great story, but I'm unsure on where you MC'ed?",
            "Excellent description of a covert narcissist BTW. I commend you on your calm and mature handling of this whole situation. I’m sorry you had to face her shenanigans in the first place. I also feel badly for the owner, who had to keep adjusting to compensate for her vindictive actions.\n\nMay your new job be drama-free and here’s hoping that Mary gets her mental health issues addressed and treated by a professional ASAP.",
            "I would have given her covid.",
            "Lmao @ her making sure you never got work again. Shes gonna have plenty of trouble trying to find work herself. What a psycho!",
            "How come you don't like it when people bring your family into things?"
        ]
    }
]